[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Jonah",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "THREEFOLD REPENTANCEJonah 3:1 - Jonah 3:10",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "THREEFOLD REPENTANCE",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jonah 3:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jonah 3:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " This passage falls into three parts: Jonah’s renewed commission and new obedience {",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 3:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 3:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "}, the repentance of Nineveh {",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 3:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 3:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "}, and the acceptance thereof by God {",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 3:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "}. We might almost call these three the repentance of Jonah, of Nineveh, and of God. The evident intention of the narrative is to parallel the Ninevites turning from their sins, and God’s turning from His anger and purpose of destruction; and if the word ‘repentance’ is not applied to Jonah, his conduct sufficiently shows the thing.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. Note the renewed charge to the penitent Prophet, and his new eagerness to fulfil it.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " His deliverance and second commission are put as if all but simultaneous, and his obedience was swift and glad. Jonah did not venture to take for granted that the charge which he had shirked was still continued to him. If God commands to take the trumpet, and we refuse, we dare not assume that we shall still be honoured with the delivery of the message. The punishment of dumb lips is often dumbness. Opportunities of service, slothfully or faintheartedly neglected, are often withdrawn. We can fancy how Jonah, brought back to the better mind which breathes in his psalm, longed to be honoured by the trust of preaching once more, and how rapturously his spirit would address itself to the task. Duties once unwelcome become sweet when we have passed through the experience of the misery that comes from neglecting them. It is God’s mercy that gives us the opportunity of effacing past disobedience by new alacrity.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The second charge is possibly distinguishable from the first as being less precise. It may be that the exact nature of ‘the preaching that I bid thee’ was not told Jonah till he had to open his mouth in Nineveh; but, more probably, the second charge was identical with the first.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The word rendered ‘preach’ is instructive. It means ‘to cry’ and suggests the manner befitting those who bear God’s message. They should sound it out loudly, plainly, urgently, with earnestness and marks of emotion in their voice. Languid whispers will not wake sleepers. Unless the messenger is manifestly in earnest, the message will fall flat. Not with bated breath, as if ashamed of it; nor with hesitation, as if not quite sure of it; nor with coldness, as if it were of little urgency,-is God’s Word to be pealed in men’s ears. The preacher is a crier. The substance of his message, too, is set forth. ‘The preaching which I bid thee’-not his own imaginations, nor any fine things of his own spinning. Suppose Jonah had entertained the Ninevites with dissertations on the evidences of his prophetic authority, or submitted for their consideration a few thoughts tending to show the agreement of his message with their current opinions in religion, or an argument for the existence of a retributive Governor of the world, he would not have shaken the city. The less the Prophet shows himself, the stronger his influence. The more simply he repeats the stern, plain, short message, the more likely it is to impress. God’s Word, faithfully set forth, will prove itself. The preacher or teacher of this day has substantially the same charge as Jonah had; and the more he suppresses himself, and becomes but a voice through which God speaks, the better for himself, his hearers, and his work.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Nineveh, that great aggregate of cities, was full, as Eastern cities are, of open spaces, and might well be a three days’ journey in circumference. What a task for that solitary stranger to thunder out his loud cry among all these crowds! But he had learned to do what he was bid; and without wasting a moment, he ‘began to enter into the city a day’s journey,’ and, no doubt, did not wait till the end of the day to proclaim his message. Let us learn that there is an element of threatening in God’s most merciful message, and that the appeal to terror and to the desire for self-preservation is part of the way to preach the Gospel. Plain warnings of coming evil may be spoken tenderly, and reveal love as truly as the most soothing words. The warning comes in time. ‘Forty days’ of grace are granted. The gospel warns us in time enough for escape. It warns us because God loves; and they are as untrue messengers of His love as of His justice who slur over the declaration of His wrath.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. Note the repentance of Nineveh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " {",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 3:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 3:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "}. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The impression made by Jonah’s terrible cry is perfectly credible and natural in the excitable population of an Eastern city, in which even now any appeal to terror, especially if associated with religious and prophetic claims, easily sets the whole in a frenzy. Think of the grim figure of this foreign man, with his piercing voice and half-intelligible speech, dropped from the clouds as it were, and stalking through Nineveh, pealing out his confident message, like that gaunt fanatic who walked Jerusalem in its last agony, crying, ‘Woe! woe unto the bloody city!’ or that other, who, with flaming fire on his head and madness in his eyes, affrighted London in the plague. No wonder that alarm was kindled, and, being kindled, spread like wildfire. Apparently the movement was first among the people, who began to fast before the news penetrated to the seclusion of the palace. But the contagion reached the king, and the popular excitement was endorsed and fanned by a royal decree. The specified tokens of repentance are those of ordinary mourning, such as were common all over the East, with only the strange addition, which smacks of heathen ideas, that the animals were made sharers in them.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " There is great significance in that ‘believed God’ {",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 3:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "}. The foundation of all true repentance is crediting God’s word of threatening, and therefore realising the danger, as well as the disobedience, of our sin. We shall be wise if we pass by the human instrument, and hear God speaking through the Prophet. Never mind about Jonah, believe God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " We learn from the Ninevites what is true repentance They brought no sacrifices or offerings, but sorrow, self-abasement, and amendment. The characteristic sin of a great military power would be ‘violence,’ and that is the specific evil from which they vow to turn. The loftiest lesson which prophets found Israel so slow to learn, ‘A broken and a contrite heart Thou wilt not despise,’ was learned by these heathens. We need it no less. Nineveh repented on a peradventure that their repentance might avail. How pathetic that ‘Who can tell?’ {",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 3:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "} is! We ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "know",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " what they ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "hoped",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Their doubt might give fervour to their cries, but our certainty should give deeper earnestness and confidence to ours.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The deepest meaning of the whole narrative is set forth in our Lord’s use of it, when He holds up the men of Nineveh as a condemnatory instance to the hardened consciences of His hearers. Probably the very purpose of the book was to show Israel that the despised and yet dreaded heathen were more susceptible to the voice of God than they were: ‘I will provoke you to jealousy by them which are no people.’ The story was a smiting blow to the proud exclusiveness and self-complacent contempt of prophetic warnings, which marked the entire history of God’s people. As Ezekiel was told: ‘Thou are not sent . . . to many peoples of a strange speech and of an hard language. . . . Surely, if I sent thee to them, they would hearken unto thee. But the house of Israel will not hearken unto thee.’ It is ever true that long familiarity with the solemn thoughts of God’s judgment and punishment of sin abates their impression on us. Our Puritan forefathers used to talk about ‘gospel-hardened sinners,’ and there are many such among us. The man who lives by Niagara does not hear its roar as a stranger does. The men of Nineveh will rise in the judgment with other generations than that which was ‘this generation’ in Christ’s time; and that which is ‘this generation’ to-day will, in many of its members, be condemned by them.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But the wave of feeling soon retired, and there is no reason to believe that more than a transient impression was made. It does not seem certain that the Ninevites knew what ‘God’ they hoped to appease. Probably their pantheon was undisturbed, and their repentance lasted no longer than their fear. Transient repentance leaves the heart harder than before, as half-melted ice freezes again more dense. Let us beware of frost on the back of a thaw. ‘Repentance which is repented of’ is worse than none.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. We note the repentance of God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " {",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 3:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "}. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Mark the recurrence of the word ‘turn,’ employed in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 3:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 3:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in reference to men and to God. Mark the bold use of the word ‘repent,’ applied to God, which, though it be not applied to the Ninevites in the previous verses, is implied in every line of them. The same expression is found in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 32:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which may be taken as the classical passage warranting its use. The great truth involved is one that is too often lost sight of in dealing with prophecy; namely, that all God’s promises and threatenings are conditional. Jeremiah learned that lesson in the house of the potter, and we need to keep it well in mind. God threatens, precisely in order that He may not have to perform His threatenings. Jonah was sent to Nineveh to cry, ‘Yet forty days, and Nineveh shall be overthrown,’ in order that it might not be overthrown. What would have been the use of proclaiming the decree, if it had been irreversible? There is an implied ‘if’ in all God’s words. ‘Except ye repent’ underlies the most absolute threatenings of evil. ‘If we hold fast the beginning of our confidence firm unto the end,’ is presupposed in the brightest and broadest promises of good.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The word ‘repent’ is denied and affirmed to have application to God. He is not ‘a son of man, that He should repent,’ inasmuch as His immutability and steadfast purpose know no variableness. But just because they cannot change, and He must ever be against them that do evil, and ever bless them that turn to Him with trust, therefore He changes His dealings with us according to our relation to Him, and because He cannot repent, or be other than He was and is, ‘repents of the evil that He had said that He would do’ unto sinners when they repent of the evil that they have done against Him, inasmuch as He leaves His threatening unfulfilled, and ‘does it not.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So we might almost say that the purpose of this book of Jonah is to teach the possibility and efficacy of repentance, and to show how the penitent man, heathen or Jew, ever finds in God changed dealings corresponding to his changed heart. The widest charity, the humbling lesson for people brought up in the blaze of revelation, that dwellers in the twilight or in the darkness are dear to God and may be more susceptible of divine impressions than ourselves, the rebuke of all pluming ourselves on our privileges, the boundlessness of God’s mercy, are among the other lessons of this strange book; but none of them is more precious than its truly evangelic teaching of the blessedness of true penitence, whether exemplified in the renegade Prophet returning to his high mission, or the fierce Ninevites humbled and repentant, and finding mercy from the God of the whole earth.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Jonah 3:1-3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jonah 3:1-3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And the word of the Lord, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — After Jonah had been well chastised for his disobedience, and was set at liberty, as recorded in the preceding chapter, the divine call to him to prophesy was repeated. He had rebelled against God’s command the first time, but now, being humbled and better prepared, he is tried again. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "So — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Hebrew, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And, Jonah arose and went into Nineveh — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "He now obeys without reluctance. Such was the blessed fruit of the correction which he had received. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Now Nineveh was an exceeding great city — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The Hebrew reads, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "A great city to God: ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "so ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the mountains of God ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "are the same with ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "great mountains, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 36:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cedars of God ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "are translated ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "goodly cedars, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 80:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Nineveh was the greatest city in the known world at that time; greater than Babylon, whose compass was then three hundred and eighty-five furlongs; but Nineveh was in compass four hundred and eighty furlongs, which makes something more than sixty of our miles. It is said that its walls were one hundred feet in height, and broad enough for three coaches to meet and pass safely by each other: that it had one thousand five hundred towers on its walls, each two hundred feet high. Diodorus Siculus represents it as an oblong figure, the two longer sides of which measured one hundred and fifty stadia, and the two shorter ninety. “Ninus,” says he, “hastened to build a city of such magnitude, that it should not only be the greatest which then existed in the whole world, but that none in succeeding ages, who undertook such a work, should easily surpass it; and his expectation has not been deceived. For no one has since built so great a city; both as to the extent of its circuit, and the magnificence of its wall.” According to a report recorded by Eustathius, fourteen myriads of men were employed for eight years in building this city. It is here said, that it was of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "three days’ journey; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and Diodorus asserts the same; that is, of three days’ journey in circuit, allowing twenty miles to each day. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3:1-4 God employs Jonah again in his service. His making use of us is an evidence of his being at peace with us. Jonah was not disobedient, as he had been. He neither endeavoured to avoid hearing the command, nor declined to obey it. See here the nature of repentance; it is the change of our mind and way, and a return to our work and duty. Also, the benefit of affliction; it brings those back to their place who had deserted it. See the power of Divine grace, for affliction of itself would rather drive men from God, than draw them to him. God's servants must go where he sends them, come when he calls them, and do what he bids them; we must do whatever the word of the Lord commands. Jonah faithfully and boldly delivered his errand. Whether Jonah said more, to show the anger of God against them, or whether he only repeated these words again and again, is not certain, but this was the purport of his message. Forty days is a long time for a righteous God to delay judgments, yet it is but a little time for an unrighteous people to repent and reform in. And should it not awaken us to get ready for death, to consider that we cannot be so sure that we shall live forty days, as Nineveh then was that it should stand forty days? We should be alarmed if we were sure not to live a month, yet we are careless though we are not sure to live a day.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the word of the Lord came a second time to Jonah - o \"Jonah, delivered from the whale, doubtless went up to Jerusalem to pay his vows and thank God there. Perhaps he hoped that God would be content with this his punishment and repentance, and that He would not again send him to Nineveh.\" Anyway, he was in some settled home, perhaps again at Gath-hepher. For God bids him, \"Arise, go\" . \"But one who is on his way, is not bidden to arise and go.\" God may have allowed an interval to elapse, in order that the tidings of so great a miracle might spread far and wide. But Jonah does not supply any of these incidents . He does not speak of himself , but only of his mission, as God taught him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "CHAPTER 3",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Jon 3:1-10. Jonah's Second Commission to Nineveh: The Ninevites Repent of Their Evil Way: So God Repents of the Evil Threatened.Jonah, being sent again, preacheth the overthrow of Nineveh, Jonah 3:1-4. Upon their repentance, Jonah 3:5-9, God repenteth him of the evil, John 3:10.  And,  after that Jonah had been well disciplined for his contumacy, and was set at liberty, the word of the Lord came;  the command, or the prophetic Spirit: see John 1:1. The second time;  the first time Jonah rebels against the command, now, better prepared and humbled, he is tried again, God doth give him the gift of prophecy, and by that signifies his reconciliation to him, and admits him into his old station. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Jon 3:1-10. Jonah's Second Commission to Nineveh: The Ninevites Repent of Their Evil Way: So God Repents of the Evil Threatened.Jonah, being sent again, preacheth the overthrow of Nineveh, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Jonah 3:1-4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Upon their repentance, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Jonah 3:5-9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", God repenteth him of the evil, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "John 3:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "And, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " after that Jonah had been well disciplined for his contumacy, and was set at liberty, ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "the word of the Lord came; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the command, or the prophetic Spirit: see ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "John 1:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "The second time; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the first time Jonah rebels against the command, now, better prepared and humbled, he is tried again, God doth give him the gift of prophecy, and by that signifies his reconciliation to him, and admits him into his old station. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the word of the Lord came unto Jonah the second time,.... Jonah having been scourged by the Lord for his stubbornness and disobedience, and being humbled under the mighty hand of God, is tried a second time, whether he would go on the Lord's errand, and do his business; and his commission is renewed, as it was necessary it should; for it would have been unsafe and dangerous for him to have proceeded upon the former without a fresh warrant; as the Israelites, when they refused entering into the land of Canaan to possess it, upon the report of the spies, and afterwards reflecting upon their sin, would go up without the word of the Lord, and contrary to the advice of Moses, many of them perished in the attempt, being cut off by the Amalekites, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 14:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and this renewal of Jonah's commission shows that he was still continued in his office as a prophet, notwithstanding his failings; as the apostles were in theirs, though they all forsook Christ, and Peter denied him, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 26:56",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and that the Lord had heard his prayer, and graciously received him, and took away his iniquity from him, employing him again in his service, being more fitted for it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "saying; as follows: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "saying; as follows: ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And the word of the LORD came unto {a} Jonah the second time, saying,",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And the word of the LORD came unto ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{a}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Jonah the second time, saying,",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) This is a great declaration of God's mercy, that he receives him again, and sends him forth as his Prophet, who had before shown such great weakness.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1–4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Jonah’s Preaching",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the second time",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Like St Peter (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 21:15-17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), Jonah is not only forgiven, but restored to his office, and receives anew his commission.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 3:1-10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Jonah’s Preaching and its result",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Sent a second time by God on a mission to Nineveh, Jonah promptly obeys, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Jonah 3:1-3 a",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jonah 3:1-3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " a",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". He enters into Nineveh and delivers his message, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Jonah 3:3 b",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jonah 3:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " b",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "–4. The Ninevites believe God and repent, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Jonah 3:5-9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jonah 3:5-9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; and are spared, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Jonah 3:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jonah 3:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 1-10.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - Part III. JONAH'S PREACHING IN NINEVEH; THE REPENTANCE OF THE NINEVITES. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 1-3.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - § 1. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Jonah is sent a second time to Nineveh, and obeys the command",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 1.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The second time.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " He is forgiven and restored to his office, and the commission formerly given is renewed. Commentators have supposed that he went up to Jerusalem to pay his vows, and that the word of the Lord came unto him there. But all unnecessary details are omitted from the account, and we know nothing about this matter. The beginning of the next verse, \"arise,\" seems to imply that he was then in some settled home, perhaps at Gath-hepher. Jonah 3:1",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The word of the Lord came to Jonah the second time, to go to Nineveh and proclaim to that city what Jehovah would say to him. קריאה: that which is called out, the proclamation, τὸ κήρυγμα (lxx). Jonah now obeyed the word of Jehovah. But Nineveh was a great city to God (lē'lōhı̄m), i.e., it was regarded by God as a great city. This remark points to the motive for sparing it (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 4:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), in case its inhabitants hearkened to the word of God. Its greatness amounted to \"a three days' walk.\" This is usually supposed to refer to the circumference of the city, by which the size of a city is generally determined. But the statement in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 3:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", that \"Jonah began to enter into the city the walk of a day,\" i.e., a day's journey, is apparently at variance with this. Hence Hitzig has come to the conclusion that the diameter or length of the city is intended, and that, as the walk of a day in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 3:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " evidently points to the walk of three days in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 3:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the latter must also be understood as referring to the length of Nineveh. But according to Diod. ii. 3 the length of the city was 150 stadia, and Herodotus (v. 53) gives just this number of stadia as a day's journey. Hence Jonah would not have commenced his preaching till he had reached the opposite end of the city. This line of argument, the intention of which is to prove the absurdity of the narrative, is based upon the perfectly arbitrary assumption that Jonah went through the entire length of the city in a straight line, which is neither probable in itself, nor implied in בּוא בעיר. This simply means to enter, or go into the city, and says nothing about the direction of the course he took within the city. But in a city, the diameter of which was 150 stadia, and the circumference 480 stadia, one might easily walk for a whole day without reaching the other end, by winding about from one street into another. And Jonah would have to do this to find a suitable place for his preaching, since we are not warranted in assuming that it lay exactly in the geographical centre, or at the end of the street which led from the gate into the city. But if Jonah wandered about in different directions, as Theodoret says, \"not going straight through the city, but strolling through market-places, streets, etc.,\" the distance of a day's journey over which he travelled must not be understood as relating to the diameter or length of the city; so that the objection to the general opinion, that the three days' journey given as the size of the city refers to the circumference, entirely falls to the ground. Moreover, Hitzig has quite overlooked the word ויּחל in his argument. The text does not affirm that Jonah went a day's journey into the city, but that he \"began to go into the city a day's journey, and cried out.\" These words do not affirm that he did not begin to preach till after he had gone a whole day's journey, but simply that he had commenced his day's journey in the city when he found a suitable place and a fitting opportunity for his proclamation. They leave the distance that he had really gone, when he began his preaching, quite indefinite; and by no means necessitate the assumption that he only began to preach in the evening, after his day's journey was ended. All that they distinctly affirm is, that he did not preach directly he entered the city, but only after he had commenced a day's journey, that is to say, had gone some distance into the city. And this is in perfect harmony with all that we know about the size of Nineveh at that time. The circumference of the great city Nineveh, or the length of the boundaries of the city of Nineveh in the broadest sense, was, as Niebuhr says (p. 277), \"nearly ninety English miles, not reckoning the smaller windings of the boundary; and this would be just three days' travelling for a good walker on a long journey.\" \"Jonah,\" he continues, \"begins to go a day's journey into the city, then preaches, and the preaching reaches the ears of the king (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 3:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). He therefore came very near to the citadel as he went along on his first day's journey. At that time the citadel was probably in Nimrud (Calah). Jonah, who would hardly have travelled through the desert, went by what is now the ordinary caravan road past Amida, and therefore entered the city at Nineveh. And it was on the road from Nineveh to Calah, not far off the city, possibly in the city itself, that he preached. Now the distance between Calah and Nineveh (not reckoning either city), measured in a straight line upon the map, is 18 1/2 English miles.\" If, then, we add to this, (1) that the road from Nineveh to Calah or Nimrud hardly ran in a perfectly straight line, and therefore would be really longer than the exact distance between the two parts of the city according to the map, and (2) that Jonah had first of all to go through Nineveh, and possibly into Calah, he may very well have walked twenty English miles, or a short day's journey, before he preached. The main point of his preaching is all that is given, viz., the threat that Nineveh would be destroyed, which was the point of chief importance, so far as the object of the book was concerned, and which Jonah of course explained by denouncing the sins and vices of the city. The threat ran thus: \"Yet forty days, and Nineveh will be destroyed.\" נהפּך, lit., overturned, i.e., destroyed from the very foundations, is the word applied to the destruction of Sodom and Gomorrah. The respite granted is fixed at forty days, according to the number which, even as early as the flood, was taken as the measure for determining the delaying of visitations of God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: The lxx, however, τρεῖς ἡμέρας, probably from a peculiar and arbitrary combination, and not merely from an early error of the pen. The other Greek translators (Aquil., Symm., and Theodot.) had, according to Theodoret, the number forty; and so also had the Syriac.) ",
        "children": []
      }
    ]
  }
]