[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(3) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Now Nineveh was",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " . . .—The past tense here certainly seems to imply that at the time in which the author wrote the city was no longer in existence, but the force of a Hebrew tense is not to be estimated by the analogy of modern languages.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "An exceeding great city.—Literally, A city great to God; an expression equivalent to a divinely great city, and taken, as Ewald thinks, from the language of the people, like the Arabic “to Allah,” in the saying “to Allah (i.e., divine) is he that composed this.” In the Hebrew poetic and prophetic writings a finer form is found, e.g., “mountains of God,” “cedars of God” (Psalm 36:6; Psalm 80:10), “trees of Jehovah” (Psalm 104:16), but in Genesis 10:9 a precisely similar proverbial use shows itself, also belonging to the Mesopotamian region, “Nimrod, a mighty hunter before the Lord.”",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "An exceeding great city.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Literally, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "A city great to God;",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " an expression equivalent to ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "a divinely great city,",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and taken, as Ewald thinks, from the language of the people, like the Arabic “to Allah,” in the saying “to Allah (",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "i.e.,",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "divine",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") is he that composed this.” In the Hebrew poetic and prophetic writings a finer form is found, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "e.g",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "., “mountains of God,” “cedars of God” (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 36:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 80:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), “trees of Jehovah” (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 104:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), but in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 10:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " a precisely similar proverbial use shows itself, also belonging to the Mesopotamian region, “Nimrod, a mighty hunter before the Lord.”",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Of three days’ journey.—Hitzig takes this as giving the diameter of the city, but most commentators refer it to the circumference. The circuit of the walls was the most obvious measurement to give of an ancient city. Herodotus variously reckons a day’s journey at about eighteen or twenty-three miles (v. 53, iv. 101), and the circuit of the irregular quadrangle composed of the mounds of Koujunjik, Nimrud, Karamless, and Khorsabad, now generally allowed to represent ancient Nineveh, is about sixty miles. This agrees sufficiently with the obviously vague and general statement of the text.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Of three days’ journey.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Hitzig takes this as giving the diameter of the city, but most commentators refer it to the circumference. The circuit of the walls was the most obvious measurement to give of an ancient city. Herodotus variously reckons a day’s journey at about eighteen or twenty-three miles (v. 53, iv. 101), and the circuit of the irregular quadrangle composed of the mounds of Koujunjik, Nimrud, Karamless, and Khorsabad, now generally allowed to represent ancient Nineveh, is about sixty miles. This agrees sufficiently with the obviously vague and general statement of the text.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3:1-4 God employs Jonah again in his service. His making use of us is an evidence of his being at peace with us. Jonah was not disobedient, as he had been. He neither endeavoured to avoid hearing the command, nor declined to obey it. See here the nature of repentance; it is the change of our mind and way, and a return to our work and duty. Also, the benefit of affliction; it brings those back to their place who had deserted it. See the power of Divine grace, for affliction of itself would rather drive men from God, than draw them to him. God's servants must go where he sends them, come when he calls them, and do what he bids them; we must do whatever the word of the Lord commands. Jonah faithfully and boldly delivered his errand. Whether Jonah said more, to show the anger of God against them, or whether he only repeated these words again and again, is not certain, but this was the purport of his message. Forty days is a long time for a righteous God to delay judgments, yet it is but a little time for an unrighteous people to repent and reform in. And should it not awaken us to get ready for death, to consider that we cannot be so sure that we shall live forty days, as Nineveh then was that it should stand forty days? We should be alarmed if we were sure not to live a month, yet we are careless though we are not sure to live a day.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Jonah arose and went unto Nineveh - , ready to obey, as before to disobey. Before, when God said those same words, \"he arose and fled;\" now, \"he arose and went.\" True conversion shows the same energy in serving God, as the unconverted had before shown in serving self or error. Saul's spirit of fire, which persecuted Christ, gleamed in Paul like lightning through the world, to win souls to Him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Nineveh was an exceeding great city - literally \"great to God,\" i. e., what would not only appear great to man who admires things of no account, but what, being really great, is so in the judgment of God who cannot be deceived. God did account it great, Who says to Jonah, \"Should not I spare Nineveh that great city, which hath more than six score thousand that cannot discern between their right hand and their left?\" It is a different idiom from that, when Scripture speaks of \"the mountains of God, the cedars of God.\" For of these it speaks, as having their firmness or their beauty from God as their Author.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Of three days' journey - , i. e., 60 miles in circumference. It was a great city. Jonah speaks of its greatness, under a name which he would only have used of real greatness. Varied accounts agree in ascribing this size to Nineveh . An Eastern city enclosing often, as did Babylon, ground under tillage, the only marvel is, that such a space was enclosed by walls. Yet this too is no marvel, when we know from inscriptions, what masses of human strength the great empires of old had at their command, or of the more than threescore pyramids of Egypt . In population it was far inferior to our metropolis, of which, as of the suburbs of Rome of old , \"one would hesitate to say, where the city ended, where it began. The suburban parts are so joined on to the city itself and give the spectator the idea of boundless length.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "An Eastern would the more naturally think of the circumference of a city, because of the broad places, similar to the boulevards of Paris, which encircles it, so that people could walk around it, within it . \"The buildings,\" it is related of Babylon, \"are not brought close to the walls, but are at about the distance of an acre from them. And not even the whole city did they occupy with houses; 80 furlongs are inhabited, and not even all these continuously, I suppose because it seemed safer to live scattered in several places. The rest they sow and till, that, if any foreign force threaten them, the besieged may be supplied with food from the soil of the city itself.\" Not Babylon alone was spoken of, of old, as  \"having the circumference of a nation rather than of a city.\" ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "An Eastern would the more naturally think of the circumference of a city, because of the broad places, similar to the boulevards of Paris, which encircles it, so that people could walk around it, within it . \"The buildings,\" it is related of Babylon, \"are not brought close to the walls, but are at about the distance of an acre from them. And not even the whole city did they occupy with houses; 80 furlongs are inhabited, and not even all these continuously, I suppose because it seemed safer to live scattered in several places. The rest they sow and till, that, if any foreign force threaten them, the besieged may be supplied with food from the soil of the city itself.\" Not Babylon alone was spoken of, of old, as  \"having the circumference of a nation rather than of a city.\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3. arose and went—like the son who was at first disobedient to the father's command, \"Go work in my vineyard,\" but who afterwards \"repented and went\" (Mt 21:28, 29). Jonah was thus the fittest instrument for proclaiming judgment, and yet hope of mercy on repentance to Nineveh, being himself a living exemplification of both—judgment in his entombment in the fish, mercy on repentance in his deliverance. Israel professing to obey, but not obeying, and so doomed to exile in the same Nineveh, answers to the son who said, \"I go, sir, and went not.\" In Lu 11:30 it is said that Jonas was not only a sign to the men in Christ's time, but also \"unto the Ninevites.\" On the latter occasion (Mt 16:1-4) when the Pharisees and Sadducees tempted Him, asking a sign from heaven, He answered, \"No sign shall be given, but the sign of the prophet Jonas,\" Mt 12:39. Thus the sign had a twofold aspect, a direct bearing on the Ninevites, an indirect bearing on the Jews in Christ's time. To the Ninevites he was not merely a prophet, but himself a wonder in the earth, as one who had tasted of death, and yet had not seen corruption, but had now returned to witness among them for God. If the Ninevites had indulged in a captious spirit, they never would have inquired and so known Jonah's wonderful history; but being humbled by God's awful message, they learned from Jonah himself that it was the previous concealing in his bosom of the same message of their own doom that caused him to be entombed as an outcast from the living. Thus he was a \"sign\" to them of wrath on the one hand, and, on the other, of mercy. Guilty Jonah saved from the jaws of death gives a ray of hope to guilty Nineveh. Thus God, who brings good from evil, made Jonah in his fall, punishment, and restoration, a sign (an embodied lesson or living symbol) through which the Ninevites were roused to hear and repent, as they would not have been likely to do, had he gone on the first commission before his living entombment and resurrection. To do evil that good may come, is a policy which can only come from Satan; but from evil already done to extract an instrument against the kingdom of darkness, is a triumphant display of the grace and wisdom of God. To the Pharisees in Christ's time, who, not content with the many signs exhibited by Him, still demanded a sign from heaven, He gave a sign in the opposite quarter, namely, Jonah, who came \"out of the belly of hell\" (the unseen region). They looked for a Messiah gloriously coming in the clouds of heaven; the Messiah, on the contrary, is to pass through a like, though a deeper, humiliation than Jonah; He is to lie \"in the heart of the earth.\" Jonah and his Antitype alike appeared low and friendless among their hearers; both victims to death for God's wrath against sin, both preaching repentance. Repentance derives all its efficacy from the death of Christ, just as Jonah's message derived its weight with the Ninevites from his entombment. The Jews stumbled at Christ's death, the very fact which ought to have led them to Him, as Jonah's entombment attracted the Ninevites to his message. As Jonah's restoration gave hope of God's placability to Nineveh, so Christ's resurrection assures us God is fully reconciled to man by Christ's death. But Jonah's entombment only had the effect of a moral suasive; Christ's death is an efficacious instrument of reconciliation between God and man [Fairbairn].",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Nineveh was an exceeding great city—literally, \"great to God,\" that is, before God. All greatness was in the Hebrew mind associated with God; hence arose the idiom (compare \"great mountains,\" Margin, \"mountains of God,\" Ps 36:6; \"goodly cedars,\" Margin, \"cedars of God,\" Ps 80:10; \"a mighty hunter before the Lord,\" Ge 10:9).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "three days' journey—that is, about sixty miles, allowing about twenty miles for a day's journey. Jonah's statement is confirmed by heathen writers, who describe Nineveh as four hundred eighty stadia in circumference [Diodorus Siculus, 2.3]. Herodotus defines a day's journey to be one hundred fifty stadia; so three days' journey will not be much below Diodorus' estimate. The parallelogram in Central Assyria covered with remains of buildings has Khorsabad northeast; Koyunjik and Nebbi Yunus near the Tigris, northwest; Nimroud, between the Tigris and the Zab, southwest; and Karamless, at a distance inward from the Zab, southeast. From Koyunjik to Nimroud is about eighteen miles; from Khorsabad to Karamless, the same; from Koyunjik to Khorsabad, thirteen or fourteen miles; from Nimroud to Karamless, fourteen miles. The length thus was greater than the breadth; compare Jon 3:4, \"a day's journey,\" which is confirmed by heathen writers and by modern measurements. The walls were a hundred feet high, and broad enough to allow three chariots abreast, and had moreover fifteen hundred lofty towers. The space between, including large parks and arable ground, as well as houses, was Nineveh in its full extent. The oldest palaces are at Nimroud, which was probably the original site. Layard latterly has thought that the name Nineveh belonged originally to Koyunjik, rather than to Nimroud. Jonah (Jon 4:11) mentions the children as numbering one hundred twenty thousand, which would give about a million to the whole population. Existing ruins show that Nineveh acquired its greatest extent under the kings of the second dynasty, that is, the kings mentioned in Scripture; it was then that Jonah visited it, and the reports of its magnificence were carried to the west [Layard].",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "So, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; as God commands and directs, so Jonah with ready, resolved, and obedient mind sets about the work. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Jonah arose, and went unto Nineveh; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " though it was a long journey, yet three weeks’ or three months’ travel by land is more eligible than three days in the belly of hell. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "According to the word of the Lord; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " every way complying with the command of God, speeding thither resolved to preach whatsoever sermon God should put into his head, encouraged with assurance that God who did send would be with him whithersoever he was sent. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "An exceeding great city; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the greatest city of the known world at that day; it was then in its flourishing state greater than Babylon, whose compass was three hundred and sixty-five or three hundred and eighty-five furlongs, but Nineveh was in compass four hundred and eighty, her walls a hundred feet in height, and broad enough for three coaches to meet and safely pass by each other; it had fifteen hundred towers on its walls, and these towers two hundred feet high; and one million and four hundred thousand men employed continually for eight years to build it, if our author be not mistaken. There is some difference in accounting how this city was ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "three days’",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " journey: if we account the length of it at one hundred and fifty furlongs, this will amount to eighteen miles and three quarters; this seems too little to be three days’ journey, unless it be supposed the prophet accounts his leisurely progress, and takes in the many stops that would necessarily and unavoidably retard him in his walking and preaching such strange news; if we consider this, it is not unlikely six miles would be as far as he could go in a day, preaching to all and discoursing with many. Others will account it three days’ journey to go through the streets and lanes of this city; but on the supposition it was eighteen miles in length, and eleven miles in breadth, it will be more than three days’ journey, or a week’s journey; for supposing in a mile’s breadth but eight streets, from end to end, through eighteen miles’ length, it will amount to four hundred and sixty-four miles. Others account by the compass of the walls sixty miles, and allow twenty miles to each day’s journey, too far for any one to walk, preach, dispute or reason, and account for himself: the first account seems most probable. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "So Jonah arose, and went unto Nineveh, according to the word of the Lord,.... He was no longer disobedient to the heavenly vision; being taught by the rod, he acts according to the word; he is now made willing to go on the Lord's errand, and do his business, under the influence of his power and grace; he stands not consulting with the flesh, but immediately arises and sets forward on his journey, as directed and commanded, being rid of that timorous spirit, and those fears, he was before possessed of; his afflictions had been greatly sanctified to him, to restore his straying soul, and cause him to keep and observe the word of the Lord; and his going to Nineveh, and preaching to a Heathen people, after his deliverance out of the fish's belly, was a type of the preaching of the Gospel to the Gentiles by the apostles, according to the commission of Christ renewed unto them, after his resurrection from the dead, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 26:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and after many failings of theirs; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "now Nineveh was an exceeding great city: or \"a city great to God\" (m); not dear to him, for it was full of wickedness; not great in his esteem, with whom the whole earth is as nothing; but known by him to be what it was; and the name of God is often used of things, to express the superlative nature and greatness of them, as trees of God, mountains of God, the flame of God, &c. Psalm 36:7; it was a greater city than Babylon, of which See Gill on Jonah 1:2; ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "now Nineveh was an exceeding great city: or \"a city great to God\" (m); not dear to him, for it was full of wickedness; not great in his esteem, with whom the whole earth is as nothing; but known by him to be what it was; and the name of God is often used of things, to express the superlative nature and greatness of them, as trees of God, mountains of God, the flame of God, &c. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 36:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; it was a greater city than Babylon, of which See Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jonah 1:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "of three days' journey; in compass, being sixty miles, as Diodorus Siculus (n) relates; and allowing twenty miles for a day's journey on foot, as this was, and which is as much as a man can ordinarily do to hold it, was just three days journey; and so Herodotus (o) reckons a day's journey at an hundred fifty furlongs, which make about nineteen miles; but, according to the Jewish writers, a middling day's journey is ten \"parsas\" (p), and every \"parsa\" makes four miles, so that with them it is forty miles: or else it was three days' journey in the length of it, as Kimchi thinks, from end to end. This is observed to show the greatness of the city, which was the greatest in the whole world, as well as to lead on to the following account. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(m)  \"magna Deo\", Montanus, Vatablus, Tigurine version, Mercerus, Drusius, Cocceius. (n) Bibliothec. l. 2. p. 92. (o) Terpsichore, sive l. 5. c. 53. (p) T. Bab. Pesachim, fol. 94. 1.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(m)  \"magna Deo\", Montanus, Vatablus, Tigurine version, Mercerus, Drusius, Cocceius. (n) Bibliothec. l. 2. p. 92. (o) Terpsichore, sive l. 5. c. 53. (p) T. Bab. Pesachim, fol. 94. 1.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "So Jonah arose, and went unto Nineveh, according to the word of the LORD. Now Nineveh was an exceeding {b} great city of three days' journey.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "So Jonah arose, and went unto Nineveh, according to the word of the LORD. Now Nineveh was an exceeding ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{b}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " great city of three days' journey.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) Read Geneva (c) Jon 1:2",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "arose, and went",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Before, he ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "arose and fled",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". He is still the same man. There is still the same energy and decision of character. But he is now “as ready to obey as before to disobey.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "was",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] It has been asserted that the use of the past tense here, “according to all sound rules of interpretation, must be understood to imply that, in the author’s time, Nineveh existed no longer,” (Kalisch). Nothing, however, can safely be determined from the use of a tense in such cases. The clause “Now Nineveh was an exceeding great city,” &c., is evidently a part of the narrative, and prepares the way for ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 3:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It simply states what Nineveh was, and what Jonah found and saw it to be, when he visited it. It is not a historical note, like that which is introduced with reference to the building of Hebron, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 13:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". St John writes (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 5:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") “Now there ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "is",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " at Jerusalem by the sheep-gate a pool.” It might be argued (as it has been) that because he uses the present tense, Jerusalem must have still been standing when he wrote his Gospel. Yet it might with equal force be concluded (and it is a proof of the unsatisfactory nature of this sort of criticism) that because he says that Bethany ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "was",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " nigh unto Jerusalem (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 9:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), that “Jesus went forth with His disciples over the brook Kedron, where ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "was",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a garden” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 18:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and that “in the place where He was crucified there ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "was",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a garden” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 19:41",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), the city and its environs were already laid waste when he wrote.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "exceeding great",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Lit., ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "great to God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The expressions of this kind which occur in the Bible may be divided into two classes. They all alike spring out of the devout habit of the Hebrew mind, which recognises God in everything, and sees Him specially in whatever is best and greatest upon earth. But this habit of mind finds expression in two somewhat different ways. Sometimes, at the contemplation of what is more than ordinarily grand or beautiful, the pious mind rises at once to God, and recognises Him in His works. A thing so great, so fair, must be the work of His hands. “By the greatness and beauty of the creatures proportionably the Maker of them is seen.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "“Who made you glorious as the gates of Heaven",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Beneath the keen full moon?…",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "God! let the torrents, like a shout of nations,",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Answer! and let the ice-plains echo, God!”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Hence such expressions as “mountains of God,” ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 36:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; “cedars of God,” ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 80:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; “trees of Jehovah,” ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 104:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; the explanation being added in the last of these instances (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 24:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), “which He hath planted.” The other class of expressions are those in which the excellence of the object contemplated appears to suggest to the mind that it will bear the scrutiny of God’s judgment, that even before Him, or as referred to Him, it is what the writer asserts it to be. To this class the expression here belongs. “Nineveh was a city, great, not only to man’s thinking, but to God’s.” (Comp. ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 4:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) In like manner we have, “a mighty hunter before the Lord,” ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 10:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; “fair to God,” ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 7:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of three days’ journey",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The most probable and most generally received opinion is that these words refer to the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "circuit",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of Nineveh, and that the writer intends by them to say that the city was so large, that it would take a man, walking at the usual pace, three days to go round it. This would give about 60 miles for its circumference. See note B.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "NOTE B. NINEVEH",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "NOTE B. NINEVEH",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "It is evidently the design of the writer of this Book to give prominence to the vast size of Nineveh. when he speaks of it, it is with the constant addition, “",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the great city",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 1:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 3:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 4:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and the addition is justified by the statements that it was “great to God,” that it was a city “of three days’ journey,” and that it contained “more than sixscore thousand persons unable to discern between their right hand and their left, and also much cattle” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 4:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). In seeking to verify this description and to identify, with some reasonable degree of probability, the Nineveh of Jonah, we have first to determine what is meant by the expression “a city of three days’ journey.” It has been held that the “three days’ journey” describes the time that would be occupied in traversing the city from end to end; along “the ‘high street’ representing the greatest length or ‘the diameter’ of the town, which ran from one principal gate to the opposite extremity.” (Kalisch.) But unless we are prepared to regard the “figures given in the text” as “the natural hyperboles of a writer who lived long after the virtual destruction of the city, and who, moreover, was anxious to enhance the impressiveness of his story and lesson, by dwelling on the vastness of the population whose fate depended on their moral regeneration” (Ib.), we shall find it difficult to accept the gratuitous assumption that Nineveh is here described as a city “about fifty-five English miles in diameter,” with a “high street” fifty-five miles long. Nor is it more satisfactory to suppose that by a city of three days’ journey is meant a city which it would require three days to go all over. No intelligible idea of size could possibly be conveyed by such a definition. Adopting, then, the more reasonable view that the “three days’ journey” refers to the circumference of the city, and estimating a day’s journey at about twenty miles, we have Nineveh here described as comprising a circuit of about sixty miles. Whether this large area was inclosed by continuous walls we cannot certainly say. One ancient writer, indeed, (Diodorus Siculus) asserts that it was, and that the walls were “100 feet high, and broad enough for three chariots to drive abreast upon” (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Dict. of Bible",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Article ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Nineveh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); and he, moreover, gives the dimensions of the city as an irregular quadrangle of about 60 miles in circuit. But without relying too much upon his testimony, which may be regarded as doubtful, we may conclude that an area such as has been described was sufficiently marked out to be known and spoken of as the city of Nineveh. This vast area was not, however, completely covered as in the case of our own cities, with streets and squares and buildings. That was a feature unusual, and almost unknown, in the ancient cities of the East. It was perhaps the feature which, belonging to Jerusalem by virtue of the deep ravines by which it was surrounded, and which “determined its natural boundaries,” and prevented its spreading abroad after the fashion of other oriental cities, called forth the surprise and admiration of the Jews after their return from Babylon. “Jerusalem,” they exclaim, “(unlike Babylon where we so long have dwelt) is built as a city which is compact together.” Like Babylon, Nineveh included not only parks and paradises, but fields under tillage and pastures for “much cattle” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 4:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") in its wide embrace. The most probable site of the city thus defined will be seen by reference to the accompanying plan. It lies on the eastern bank of the Tigris in the fork formed by that river and the Ghazr Su and Great Zab, just above their confluence. The whole of this district abounds in heaps of ruins. Indeed, “they are found,” it is said, “in vast numbers throughout the whole region watered by the Tigris and Euphrates and their confluents, from the Taurus to the Persian Gulf.” “Such mounds,” it is added, “are especially numerous in the region to the east of the Tigris, in which Nineveh stood, and some of them must mark the ruins of the Assyrian capital.” (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Dict. of the Bible",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) Four of these great masses of ruins, which will be found marked on the plan, Kouyunjik, Nimrud, Karamless, Khorsabad, form together an irregular parallelogram of very similar dimensions to those mentioned in the text. From Kouyunjik (lying opposite Mosul) on the Eastern bank of the Tigris, a line drawn in a S. E. direction, parallel to the course of the river, to Nimrud is about eighteen miles. From Nimrud, in a northerly direction, to Karamless is about twelve. The opposite sides of the parallelogram, from Karamless to the most northerly point Khorsabad, and from Khorsabad to Kouyunjik again, are about the same. These four vast piles of buildings, with the area included in the parallelogram which they form, are now generally identified with the site of the Nineveh which Jonah visited. For fuller particulars the reader is referred to Smith’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Dictionary of the Bible",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Article ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Nineveh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and to the well-known works of Mr Layard and Professor Rawlingson.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 3.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Arose, and went.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " He was now as prompt to obey as formerly to flee. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Was",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " when Jonah visited it. Nothing can be argued from the past tense here as to the date of the composition of the book. It is a mere historical detail, and cannot be forced into a proof that Jonah wrote after the destruction of Nineveh. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "An exceeding great city",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; literally, a ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "city",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " great to ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "πόλις μεγάλη τῷ Θεῷ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Septuagint); great before God - in his estimation, as though even God must acknowledge it. So Nimrod is called (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 10:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") \"a mighty hunter before the Lord;\" and Moses, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 7:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is said to have been\" beautiful to God.\" The expression may also mean that God (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Elohim",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", God as Governor of the world) regarded this city with interest, as intended in the Divine counsels to perform an important part. For he is not the God of the Jews only, but also of the Gentiles (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 3:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Of three days' journey;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in circumference - about sixty miles (see note on Jonah 1:2). Or the writer may mean that it took Jonah three days to visit the various quarters of this huge place. The area of the vast quadrangle containing the remains of the four cities comprised under the name ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Nineveh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is estimated by Professor Rawlinson at two hundred and sixteen square miles. We ought, however, to omit Khorsabad from this computation, as it was not founded till Sargon's time,  ",
        "children": []
      },
      {
        "element": "span",
        "class": "date",
        "text": "B.C. 710",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Jonah 3:3",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The word of the Lord came to Jonah the second time, to go to Nineveh and proclaim to that city what Jehovah would say to him. קריאה: that which is called out, the proclamation, τὸ κήρυγμα (lxx). Jonah now obeyed the word of Jehovah. But Nineveh was a great city to God (lē'lōhı̄m), i.e., it was regarded by God as a great city. This remark points to the motive for sparing it (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 4:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), in case its inhabitants hearkened to the word of God. Its greatness amounted to \"a three days' walk.\" This is usually supposed to refer to the circumference of the city, by which the size of a city is generally determined. But the statement in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 3:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", that \"Jonah began to enter into the city the walk of a day,\" i.e., a day's journey, is apparently at variance with this. Hence Hitzig has come to the conclusion that the diameter or length of the city is intended, and that, as the walk of a day in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 3:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " evidently points to the walk of three days in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 3:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the latter must also be understood as referring to the length of Nineveh. But according to Diod. ii. 3 the length of the city was 150 stadia, and Herodotus (v. 53) gives just this number of stadia as a day's journey. Hence Jonah would not have commenced his preaching till he had reached the opposite end of the city. This line of argument, the intention of which is to prove the absurdity of the narrative, is based upon the perfectly arbitrary assumption that Jonah went through the entire length of the city in a straight line, which is neither probable in itself, nor implied in בּוא בעיר. This simply means to enter, or go into the city, and says nothing about the direction of the course he took within the city. But in a city, the diameter of which was 150 stadia, and the circumference 480 stadia, one might easily walk for a whole day without reaching the other end, by winding about from one street into another. And Jonah would have to do this to find a suitable place for his preaching, since we are not warranted in assuming that it lay exactly in the geographical centre, or at the end of the street which led from the gate into the city. But if Jonah wandered about in different directions, as Theodoret says, \"not going straight through the city, but strolling through market-places, streets, etc.,\" the distance of a day's journey over which he travelled must not be understood as relating to the diameter or length of the city; so that the objection to the general opinion, that the three days' journey given as the size of the city refers to the circumference, entirely falls to the ground. Moreover, Hitzig has quite overlooked the word ויּחל in his argument. The text does not affirm that Jonah went a day's journey into the city, but that he \"began to go into the city a day's journey, and cried out.\" These words do not affirm that he did not begin to preach till after he had gone a whole day's journey, but simply that he had commenced his day's journey in the city when he found a suitable place and a fitting opportunity for his proclamation. They leave the distance that he had really gone, when he began his preaching, quite indefinite; and by no means necessitate the assumption that he only began to preach in the evening, after his day's journey was ended. All that they distinctly affirm is, that he did not preach directly he entered the city, but only after he had commenced a day's journey, that is to say, had gone some distance into the city. And this is in perfect harmony with all that we know about the size of Nineveh at that time. The circumference of the great city Nineveh, or the length of the boundaries of the city of Nineveh in the broadest sense, was, as Niebuhr says (p. 277), \"nearly ninety English miles, not reckoning the smaller windings of the boundary; and this would be just three days' travelling for a good walker on a long journey.\" \"Jonah,\" he continues, \"begins to go a day's journey into the city, then preaches, and the preaching reaches the ears of the king (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 3:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). He therefore came very near to the citadel as he went along on his first day's journey. At that time the citadel was probably in Nimrud (Calah). Jonah, who would hardly have travelled through the desert, went by what is now the ordinary caravan road past Amida, and therefore entered the city at Nineveh. And it was on the road from Nineveh to Calah, not far off the city, possibly in the city itself, that he preached. Now the distance between Calah and Nineveh (not reckoning either city), measured in a straight line upon the map, is 18 1/2 English miles.\" If, then, we add to this, (1) that the road from Nineveh to Calah or Nimrud hardly ran in a perfectly straight line, and therefore would be really longer than the exact distance between the two parts of the city according to the map, and (2) that Jonah had first of all to go through Nineveh, and possibly into Calah, he may very well have walked twenty English miles, or a short day's journey, before he preached. The main point of his preaching is all that is given, viz., the threat that Nineveh would be destroyed, which was the point of chief importance, so far as the object of the book was concerned, and which Jonah of course explained by denouncing the sins and vices of the city. The threat ran thus: \"Yet forty days, and Nineveh will be destroyed.\" נהפּך, lit., overturned, i.e., destroyed from the very foundations, is the word applied to the destruction of Sodom and Gomorrah. The respite granted is fixed at forty days, according to the number which, even as early as the flood, was taken as the measure for determining the delaying of visitations of God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: The lxx, however, τρεῖς ἡμέρας, probably from a peculiar and arbitrary combination, and not merely from an early error of the pen. The other Greek translators (Aquil., Symm., and Theodot.) had, according to Theodoret, the number forty; and so also had the Syriac.) ",
        "children": []
      }
    ]
  }
]