[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(5) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Believed God.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "believed in God.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Notice again an implied contrast to the dulness of the Jews, who were “slow to believe” the prophetic warnings addressed to themselves.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Proclaimed a fast.—Apparently on a spontaneous resolution of the people themselves. (See Note to Jonah 3:6.) The fast would no doubt be for one day, according to the Jewish and the general Oriental custom.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Proclaimed a fast.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Apparently on a spontaneous resolution of the people themselves. (See Note to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jonah 3:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".) The fast would no doubt be for one day, according to the Jewish and the general Oriental custom.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Jonah 3:5-6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jonah 3:5-6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "So the people of Nineveh believed God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — “The fame,” says Lowth, “of the wonderful works God had wrought for the Jews, was spread over the eastern parts of the world. This might make the Ninevites hearken to a man of that nation, that came to them as sent by God. And it is likely that he gave them an account of the miraculous circumstances which attended his own mission. But, without question, a sense of their own guilt, and their deserving whatever punishment Heaven could inflict, was a principal reason that moved them to have a regard to this message. And by the men of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Nineveh’s repenting at the preaching of Jonah, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "God designed to upbraid the stubbornness of his own people, and shame them, as it were, into repentance; lest the men of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Nineveh should rise up in judgment against them, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "as our Saviour speaks of the Jews in his own time, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 12:41",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".” ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And proclaimed a fast — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The king and his nobles, or those in authority, ordered that every one should fast for three days, and put on habits of sorrow and humiliation. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For word came unto the king of Nineveh — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Archbishop Usher, in his ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Annals ad ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "A.M. 3233, supposes this prince to have been Pul, the king of Assyria, (Nineveh being then the capital city of that empire,) who afterward invaded the kingdom of Israel, in the days of Menahem, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 15:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : it being very agreeable to the methods of Providence to make use of a heathen king, that was penitent, to punish the impenitence of God’s own people Israel. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And he arose from his throne, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — He laid aside all his state, and put on the habit of a penitent.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3:5-10 There was a wonder of Divine grace in the repentance and reformation of Nineveh. It condemns the men of the gospel generation, Mt 12:41. A very small degree of light may convince men that humbling themselves before God, confessing their sins with prayer, and turning from sin, are means of escaping wrath and obtaining mercy. The people followed the example of the king. It became a national act, and it was necessary it should be so, when it was to prevent a national ruin. Let even the brute creatures' cries and moans for want of food remind their owners to cry to God. In prayer we must cry mightily, with fixedness of thought, firmness of faith, and devout affections. It concerns us in prayer to stir up all that is within us. It is not enough to fast for sin, but we must fast from sin; and, in order to the success of our prayers, we must no more regard iniquity in our hearts, Ps 66:18. The work of a fast-day is not done with the day. The Ninevites hoped that God would turn from his fierce anger; and that thus their ruin would be prevented. They could not be so confident of finding mercy upon their repentance, as we may be, who have the death and merits of Christ, to which we may trust for pardon upon repentance. They dared not presume, but they did not despair. Hope of mercy is the great encouragement to repentance and reformation. Let us boldly cast ourselves down at the footstool of free grace, and God will look upon us with compassion. God sees who turn from their evil ways, and who do not. Thus he spared Nineveh. We read of no sacrifices offered to God to make atonement for sin; but a broken and a contrite heart, such as the Ninevites then had, he will not despise.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the people of Nineveh believed God; - strictly, \"believed in God.\" To \"believe in God\" expresses more heart-belief, than to \"believe God\" in itself need convey. To believe God is to believe what God says, to be true; \"to believe in\" or \"on God\" expresses not belief only, but that belief resting in God, trusting itself and all its concerns with Him. It combines hope and trust with faith, and love too, since, without love, there cannot be trust. They believed then the preaching of Jonah, and that He, in Whose Name Jonah spake, had all power in heaven and earth. But they believed further in His unknown mercies; they cast themselves upon the goodness of the hitherto \"unknown God.\" Yet they believed in Him, as the Supreme God, \"the\" object of awe, the God אלהים  'ĕlohı̂ym ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 3:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 3:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", האלהים  ha'ĕlohı̂ym ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 3:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", although they knew Him not, as He Is , the Self-Existent One. Jonah does not say how they were thus persuaded.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "God the Holy Spirit relates the wonders of God's Omnipotence as common everyday things. They are no marvels to Him Who performed them. \"He commanded and they were done.\" He spake with power to the hearts which He had made, and they were turned to Him. Any human means are secondary, utterly powerless, except in \"His\" hands Who Alone doth all things through whomsoever He doth them. Our Lord tells us that \"Jonah\" himself \"was a sign unto the Ninevites\" . Whether then the mariners spread the history,  or howsoever the Ninevites knew the personal history of Jonah, he, in his own person and in what befell him, was a sign to them. They believed that God, Who avenged \"his\" disobedience, would avenge their's. They believed perhaps, that God must have some great mercy in store for them, Who not only sent His prophet so far from his own land to \"them\" who had never owned, never worshiped Him, but had done such mighty wonders to subdue His prophet's resistance and to make him go to them.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And proclaimed a fast and put on sackcloth - It was not then a repentance in word only, but in deed. A fast was at that time entire abstinence from all food until evening; the haircloth was a harsh garment, irritating and afflictive to the body. They who did so, were (as we may still see from the Assyrian sculptures) men of pampered and luxurious habits, uniting sensuality and fierceness. Yet this they did at once, and as it seems, for the 40 days. They \"proclaimed a fast.\" They did not wait for the supreme authority. Time was urgent, and they would lose none of it. In this imminent peril of God's displeasure, they acted as men would in a conflagration. People do not wait for orders to put out a fire, if they can, or to prevent it from spreading. Whoever they were who proclaimed it, whether those in inferior authority, each in his neighborhood, or whether it spread from man to man, as the tidings spread, it was done at once. It seems to have been done by acclamation, as it were, one common cry out of the one common terror. For it is said of them, as one succession of acts, \"the men of Nineveh believed in God, and proclaimed a fast, and put on sackcloth from their great to their little,\" every age, sex, condition . \"Worthy of admiration is that exceeding celerity and diligence in taking counsel, which, although in the same city with the king, perceived that they must provide for the common and imminent calamity, not waiting to ascertain laboriously the king's pleasure.\" In a city, 60 miles in circumference, some time must needs be lost, before the king could be approached; and we know, in some measure, the forms required in approaching Eastern monarchs of old. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And proclaimed a fast and put on sackcloth - It was not then a repentance in word only, but in deed. A fast was at that time entire abstinence from all food until evening; the haircloth was a harsh garment, irritating and afflictive to the body. They who did so, were (as we may still see from the Assyrian sculptures) men of pampered and luxurious habits, uniting sensuality and fierceness. Yet this they did at once, and as it seems, for the 40 days. They \"proclaimed a fast.\" They did not wait for the supreme authority. Time was urgent, and they would lose none of it. In this imminent peril of God's displeasure, they acted as men would in a conflagration. People do not wait for orders to put out a fire, if they can, or to prevent it from spreading. Whoever they were who proclaimed it, whether those in inferior authority, each in his neighborhood, or whether it spread from man to man, as the tidings spread, it was done at once. It seems to have been done by acclamation, as it were, one common cry out of the one common terror. For it is said of them, as one succession of acts, \"the men of Nineveh believed in God, and proclaimed a fast, and put on sackcloth from their great to their little,\" every age, sex, condition . \"Worthy of admiration is that exceeding celerity and diligence in taking counsel, which, although in the same city with the king, perceived that they must provide for the common and imminent calamity, not waiting to ascertain laboriously the king's pleasure.\" In a city, 60 miles in circumference, some time must needs be lost, before the king could be approached; and we know, in some measure, the forms required in approaching Eastern monarchs of old. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5. believed God—gave credit to Jonah's message from God; thus recognizing Jehovah as the true God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "fast … sackcloth—In the East outward actions are often used as symbolical expressions of inward feelings. So fasting and clothing in sackcloth were customary in humiliation. Compare in Ahab's case, parallel to that of Nineveh, both receiving a respite on penitence (1Ki 21:27; 20:31, 32; Joe 1:13).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "from the greatest … to the least—The penitence was not partial, but pervading all classes.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "So, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "the people of Nineveh; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the inhabitants who heard; they first believed who first heard, and successively others as soon as they heard. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Believed God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " speaking by his prophet; they knew their own sins. Though Jonah were a stranger to them, yet because, coming in God’s name, he did very particularly, fully, and to the life enumerate, decipher, and lay open their sins, with what they deserved, what might be expected, what God threatened from heaven, all which concurring wrought them to believe their danger, God’s mercy, and the possibility of escape if they repent. Whether the fame of Jonah’s deliverance came to Nineveh before him appears not, nor is it likely it should come so far and so fast, though it were known on the Syrian coast, and about Tyre and Zidon; possibly Jonah might publish it in Nineveh. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Proclaimed a fast; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " every one called upon other to fast, of cried out it was high time to fast, repent, and supplicate God, so some think; but this passage is an anticipation, tells us what was done, and will tell us afterwards on what grounds, authority, and example it was done. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Put on sackcloth; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a ceremony very usual in mournings, private or public, in those countries, and a token of their true mourning; this all did, great and small, rich and poor. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "So the people of Nineveh believed God,.... Or \"in God\" (r): in the word of the Lord, as the Targum; they believed there was a God, and that he, in whose name Jonah came, was the true God; they believed the word the prophet spake was not the word of man, but, the word of God; faith came by hearing the word, which is the spring of true repentance, and the root of all good works. Kimchi and R. Jeshuah, in Aben Ezra, suppose that the men of the ship, in which Jonah had been, were at Nineveh; and these testified that they had cast him into the sea, and declared the whole affair concerning him; and this served greatly to engage their attention to him, and believe what he said: but this is not certain; and, besides, their faith was the effect of the divine power that went along with the preaching of Jonah, and not owing to the persuasion of men; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and proclaimed a fast; not of themselves, but by the order of their king, as follows; though Kimchi thinks this was before that: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and put on sackcloth, from the greatest of them even to the least of them; both, with respect to rank and age, so universal were their fasting and mourning; in token of which they stripped themselves of their common and rich apparel, and clothed themselves with sackcloth; as was usual in extraordinary cases of mourning, not only with the Jews, but other nations. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Jonah would be a quite a sight to behold. The digestive juices of the fish would have turned his skin to a most unnatural colour and his hair was most like all gone. Indeed, anyone looking like that would attract your attention and give his message more credence, especially after he told you what had happened to him. A God who creates storms, prepares large fish to swallow a man and preserves him in the fish, would not likely have too much trouble destroying your city. Editor) ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(r) \"in Deum\", V. L. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(r) \"in Deum\", V. L. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "So the people of Nineveh {d} believed God, and proclaimed a fast, and put on sackcloth, from the greatest of them even to the least of them.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "So the people of Nineveh ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{d}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " believed God, and proclaimed a fast, and put on sackcloth, from the greatest of them even to the least of them.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(d) For he declared that he was a Prophet sent to them from God, to make known his judgments against them.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "5–10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Happy Result of Jonah’s Preaching",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "believed God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "believed in God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Three things their faith certainly embraced. They believed in the God of the Hebrews, as the true God. They believed in His power to execute the threat which He had held out. They believed in His mercy and willingness to forgive the penitent. And this was marvellous faith in heathen, contrasting favourably with that of the chosen people. “So great faith” had not been found, “no not in Israel.” What they knew of the Hebrews and their God (for doubtless they recognised in Jonah a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Jewish",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " prophet) may have contributed to the result. That they knew also the miraculous history of Jonah’s mission to them, and so were the better prepared to credit him, appears to be plainly taught us by our Lord. It is difficult to understand how Jonah should have been “a sign unto the Ninevites,” corresponding in any way to the sign, which by His resurrection the “Son of man” was to “the men of that generation,” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 11:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 12:38-41",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) unless they were aware that he had passed, as it were, through death to life again, on his way to preach to them. How that information reached them we have no means of judging certainly. Of course it may have come to them from the lips of Jonah himself, though we have seen reason (see note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Jonah 3:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jonah 3:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ") to regard that as improbable. Alford speaks of “his preaching after his resurrection to the Ninevites, announcing (for that would necessarily be involved in that preaching) the wonderful judgment of God in bringing him there, and thus making his own deliverance, that he might preach to them, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a sign",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to that people.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 5-9.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " § 3. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "The Ninevites hearken to the cry of Jonah, believe in God, and repent.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 5.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Believed God;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "believed in God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which implies trust and hope; Vulgate, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "crediderunt in Deum.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " They recognized Jonah as God's messenger; they recognized God's power as able to execute the threat, and they had confidence in his mercy if they repented. This great result has seemed to some incredible, and has occasioned doubts to be east upon the history. But, as we have seen in the Introduction, Jonah's mission occurred probably at a time of national depression, when men's minds were disposed to expect calamity, and anxious to avert it by any means. Other considerations led to the same result. They had heard much of the God of the Hebrews, much of the doings of his great prophets Elijah and Elisha; and now they had in their midst one of these holy men, who, as they were informed, had been miraculously preserved from death in order to carry his message to them; for that it was thus that Jonah was \"a sign unto the Ninevites\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 11:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") seems most certain. They saw the Divine inspiration beaming in his look, dictating his utterance, animating his bearing, filling him with courage, confidence, and faith. The credulity with which they received the announcements of their own seers, their national predilection for presages and omens, encouraged them to open their ears to this stranger, and to regard his mission with grave attention. Their own conscience, too, was on the prophet's side, and assisted his words with its powerful pleading. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "So they believed in God, and proclaimed a fast.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Spontaneously, without any special order from the authorities. Before the final fall of Nineveh, the inscriptions mention, the then king ordered a fast of one hundred days and nights to the gods in order to avert the threatened danger (see a note by Professor Sayce, in G. Smith's 'History of Babylon,' p. 156). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Put on sackcloth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 37:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 21:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 1:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The custom of changing the dress in  token of mourning was not confined to the Hebrews (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 26:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Jonah 3:5",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The Ninevites believed in God, since they hearkened to the preaching of the prophet sent to them by God, and humbled themselves before God with repentance. They proclaimed a fast, and put on sackcloth (penitential garments: see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 1:13-14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 21:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.), \"from their great one even to their small one,\" i.e., both old and young, all without exception. Even the king, when the matter (had-dâbhâr) came to his knowledge, i.e., when he was informed of Jonah's coming, and of his threatening prediction, descended from his throne, laid aside his royal robe ('addereth, see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 7:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), wrapt himself in a sackcloth, and sat down in ashes, as a sign of the deepest mourning (compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 2:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and by a royal edict appointed a general fast for man and beast. ויּזעק, he caused to be proclaimed. ויּאמר, and said, viz., through his heralds. מפּעם הם, ex decreto, by command of the king and his great men, i.e., his ministers (פעם  equals  פעם, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 3:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 3:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", a technical term for the edicts of the Assyrian and Babylonian kings). \"Man and beast (viz., oxen and sheep) are to taste nothing; they are not to pasture (the cattle are not to be driven to the pasture), and are to drink no water.\" אל, for which we should expect לא, may be explained from the fact that the command is communicated directly. Moreover, man and beast are to be covered with mourning clothes, and cry to God bechozqâh, i.e., strongly, mightily, and to turn every one from his evil ways: so \"will God perhaps (מי יודע) turn and repent (yâshūbh venicham, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 2:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and desist from the fierceness of His anger (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 32:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), that we perish not.\" This verse (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 3:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") also belongs to the king's edict. The powerful impression made upon the Ninevites by Jonah's preaching, so that the whole city repented in sackcloth and ashes, is quite intelligible, if we simply bear in mind the great susceptibility of Oriental races to emotion, the awe of one Supreme Being which is peculiar to all the heathen religions of Asia, and the great esteem in which soothsaying and oracles were held in Assyria from the very earliest times (vid., Cicero, de divinat. i. 1); and if we also take into calculation the circumstance that the appearance of a foreigner, who, without any conceivable personal interest, and with the most fearless boldness, disclosed to the great royal city its godless ways, and announced its destruction within a very short period with the confidence so characteristic of the God-sent prophets, could not fail to make a powerful impression upon the minds of the people, which would be all the stronger if the report of the miraculous working of the prophets of Israel had penetrated to Nineveh. There is just as little to surprise us in the circumstance that the signs of mourning among the Ninevites resemble in most respects the forms of penitential mourning current among the Israelites, since these outward signs of mourning are for the most part the common human expressions of deep sorrow of heart, and are found in the same or similar forms among all the nations of antiquity (see the numerous proofs of this which are collected in Winer's Real-wrterbuch, art. Trauer; and in Herzog's Cyclopaedia). Ezekiel (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 26:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") depicts the mourning of the Tyrian princes over the ruin of their capital in just the same manner in which that of the king of Nineveh is described here in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jonah 3:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", except that, instead of sackcloth, he mentions trembling as that with which they wrap themselves round. The garment of haircloth (saq) worn as mourning costume reaches as far back as the patriarchal age (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 37:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 16:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Even the one feature which is peculiar to the mourning of Nineveh - namely, that the cattle also have to take part in the mourning - is attested by Herodotus (9:24) as an Asiatic custom.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Herodotus relates that the Persians, when mourning for their general, Masistios, who had fallen in the battle at Platea, shaved off the hair from their horses, and adds, \"Thus did the barbarians, in their way, mourn for the deceased Masistios.\" Plutarch relates the same thing (Aristid. 14 fin. Compare Brissonius, de regno Pers. princip. ii. p. 206; and Periz. ad Aeliani Var. hist. vii. 8). The objection made to this by Hitzig - namely, that the mourning of the cattle in our book is not analogous to the case recorded by Herodotus, because the former was an expression of repentance - has no force whatever, for the simple reason that in all nations the outward signs of penitential mourning are the same as those of mourning for the dead.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This custom originated in the idea that there is a biotic rapport between man and the larger domestic animals, such as oxen, sheep, and goats, which are his living property. It is only to these animals that there is any reference here, and not to \"horses, asses, and camels, which were decorated at other times with costly coverings,\" as Marck, Rosenmller, and others erroneously assume. Moreover, this was not done \"with the intention of impelling the men to shed hotter tears through the lowing and groaning of the cattle\" (Theodoret); or \"to set before them as in a mirror, through the sufferings of the innocent brutes, their own great guilt\" (Chald.); but it was a manifestation of the thought, that just as the animals which live with man are drawn into fellowship with his sin, so their sufferings might also help to appease the wrath of God. And although this thought might not be free from superstition, there lay at the foundation of it this deep truth, that the irrational creature is made subject to vanity on account of man's sins, and sighs along with man for liberation from the bondage of corruption (Romans 8:19.). We cannot therefore take the words \"cry mightily unto God\" as referring only to the men, as many commentators have done, in opposition to the context; but must regard \"man and beast\" as the subject of this clause also, since the thought that even the beasts cry to or call upon God in distress has its scriptural warrant in Joel 1:20. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "This custom originated in the idea that there is a biotic rapport between man and the larger domestic animals, such as oxen, sheep, and goats, which are his living property. It is only to these animals that there is any reference here, and not to \"horses, asses, and camels, which were decorated at other times with costly coverings,\" as Marck, Rosenmller, and others erroneously assume. Moreover, this was not done \"with the intention of impelling the men to shed hotter tears through the lowing and groaning of the cattle\" (Theodoret); or \"to set before them as in a mirror, through the sufferings of the innocent brutes, their own great guilt\" (Chald.); but it was a manifestation of the thought, that just as the animals which live with man are drawn into fellowship with his sin, so their sufferings might also help to appease the wrath of God. And although this thought might not be free from superstition, there lay at the foundation of it this deep truth, that the irrational creature is made subject to vanity on account of man's sins, and sighs along with man for liberation from the bondage of corruption (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 8:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".). We cannot therefore take the words \"cry mightily unto God\" as referring only to the men, as many commentators have done, in opposition to the context; but must regard \"man and beast\" as the subject of this clause also, since the thought that even the beasts cry to or call upon God in distress has its scriptural warrant in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joel 1:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      }
    ]
  }
]