[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1:1-16 This prophecy is against Edom. Its destruction seems to have been typical, as their father Esau's rejection; and to refer to the destruction of the enemies of the gospel church. See the prediction of the success of that war; Edom shall be spoiled, and brought down. All the enemies of God's church shall be disappointed in the things they stay themselves on. God can easily lay those low who magnify and exalt themselves; and will do it. Carnal security ripens men for ruin, and makes the ruin worse when it comes. Treasures on earth cannot be so safely laid up but that thieves may break through and steal; it is therefore our wisdom to lay up for ourselves treasures in heaven. Those that make flesh their trust, arm it against themselves. The God of our covenant will never deceive us: but if we trust men with whom we join ourselves, it may prove to us a wound and dishonour. God will justly deny those understanding to keep out of danger, who will not use their understandings to keep out of sin. All violence, all unrighteousness, is sin; but it makes the violence far worse, if it be done against any of God's people. Their barbarous conduct towards Judah and Jerusalem, is charged upon them. In reflecting on ourselves, it is good to consider what we should have done; to compare our practice with the Scripture rule. Sin, thus looked upon in the glass of the commandment, will appear exceedingly sinful. Those have a great deal to answer for, who are idle spectators of the troubles of their neighbours, when able to be active helpers. Those make themselves poor, who think to make themselves rich by the ruin of the people of God; and those deceive themselves, who call all that their own on which they can lay their hands in a day of calamity. Though judgment begins at the house of God, it shall not end there. Let sorrowful believers and insolent oppressors know, that the troubles of the righteous will soon end, but those of the wicked will be eternal.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But thou shouldest not - , rather it means, and can only mean , \"And look not (i. e., gaze not with pleasure)  on the day of thy brother in the day of his becoming a stranger ; and rejoice not over the children of Judah in the day of their destruction; and enlarge not thy mouth in the day of distress. Enter not into the gate of My people in the day of their calamity; look not, thou too, on his affliction in the day of his calamity; and lay not hands on his substance in the day of his calamity; And stand not on the crossway, to cut off his fugitives; and shut not up his remnants in the day of distress.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Throughout these three verses, Obadiah uses the future only. It is the voice of earnest, emphatic, dehortation and entreaty, not to do what would displease God, and what, if done, would be punished. He dehorts them from malicious rejoicing at their brother's fall, first in look, then in word, then in act, in covetous participation of the spoil, and lastly in murder. Malicious gazing on human calamity, forgetful of man's common origin and common liability to ill, is the worst form of human hate. It was one of the contumelies of the Cross, \"they gaze, they look\" with joy \"upon Me.\" Psalm 22:17. The rejoicing over them was doubtless, as among savages, accompanied with grimaces (as in Psalm 35:19; Psalm 38:16). Then follow words of insult. The enlarging of the mouth is uttering a tide of large words, here against the people of God; in Ezekiel, against Himself Ezekiel 35:13 : \"Thus with your mouth ye have enlarged against Me and have multiplied your words against Me. I have heard.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Throughout these three verses, Obadiah uses the future only. It is the voice of earnest, emphatic, dehortation and entreaty, not to do what would displease God, and what, if done, would be punished. He dehorts them from malicious rejoicing at their brother's fall, first in look, then in word, then in act, in covetous participation of the spoil, and lastly in murder. Malicious gazing on human calamity, forgetful of man's common origin and common liability to ill, is the worst form of human hate. It was one of the contumelies of the Cross, \"they gaze, they look\" with joy \"upon Me.\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 22:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The rejoicing over them was doubtless, as among savages, accompanied with grimaces (as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 35:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 38:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Then follow words of insult. The enlarging of the mouth is uttering a tide of large words, here against the people of God; in Ezekiel, against Himself ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 35:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : \"Thus with your mouth ye have enlarged against Me and have multiplied your words against Me. I have heard.\"",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Thereon, follows Edom's coming yet closer, \"entering the gate of God's people\" to share the conqueror's triumphant gaze on his calamity. Then, the violent, busy, laying the hands on the spoil, while others of them stood in cold blood, taking the \"fork\" where the ways parted, in order to intercept the fugitives before they were dispersed, or to shut them up with the enemy, driving them back on their pursuers. The prophet beholds the whole course of sin and persecution, and warns them against it, in the order, in which, if committed, they would commit it. Who would keep clear from the worst, must stop at the beginning. Still God's warnings accompany him step by step. At each step, some might stop. The warning, although thrown away on the most part, might arrest the few. At the worst, when the guilt had been contracted and the punishment had ensued, it was a warning for their posterity and for all thereafter.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Some of these things Edom certainly did, as the Psalmist prays Psalm 137:7, \"Remember, O Lord, to the children of Edom the day of Jerusalem, who said, Lay bare, lay bare, even to the foundation in her.\" And Ezekiel EZechariah 35:5-6 alluding to this language of Obadiah , \"because thou hast had a perpetual hatred, and hast shed the blood of the children of Israel by the force of the sword in the time of their calamity, in the time that their iniquity had an end, therefore, as I live, saith the Lord God, I will prepare thee unto blood, and blood shall pursue thee; sith thou hast not hated blood, even blood shall pursue thee.\" Violence, bloodshed, unrelenting, deadly hatred against the whole people, a longing for their extermination, had been inveterate characteristics of Esau. Joel and Amos had already denounced God's judgments against them for two forms of this hatred, the murder of settlers in their own land or of those who were sold to them Joel 3:19; Amos 1:6, Amos 1:9, Amos 1:11.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Some of these things Edom certainly did, as the Psalmist prays ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 137:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"Remember, O Lord, to the children of Edom the day of Jerusalem, who said, Lay bare, lay bare, even to the foundation in her.\" And Ezekiel E",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 35:5-6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " alluding to this language of Obadiah , \"because thou hast had a perpetual hatred, and hast shed the blood of the children of Israel by the force of the sword in the time of their calamity, in the time that their iniquity had an end, therefore, as I live, saith the Lord God, I will prepare thee unto blood, and blood shall pursue thee; sith thou hast not hated blood, even blood shall pursue thee.\" Violence, bloodshed, unrelenting, deadly hatred against the whole people, a longing for their extermination, had been inveterate characteristics of Esau. Joel and Amos had already denounced God's judgments against them for two forms of this hatred, the murder of settlers in their own land or of those who were sold to them ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joel 3:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 1:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 1:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 1:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Obadiah warns them against yet a third, intercepting their fugitives in their escape from the more powerful enemy. \"Stand not in the crossway.\" Whoso puts himself in the situation to commit an old sin, does, in fact, will to renew it, and will, unless hindered from without, certainly do it. Probably he will, through sin's inherent power of growth, do worse. Having anew tasted blood, Ezekiel says, that they sought to displace God's people and remove God Himself Ezekiel 35:10-11. \"Because thou hast said, these two nations and these two countries shall be mine, and we will possess it, whereas the Lord was there, therefore, as I live, saith the Lord God, I will even do according to thine anger, and according to thine envy, which thou hast used out of thy hatred against them.\" ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Obadiah warns them against yet a third, intercepting their fugitives in their escape from the more powerful enemy. \"Stand not in the crossway.\" Whoso puts himself in the situation to commit an old sin, does, in fact, will to renew it, and will, unless hindered from without, certainly do it. Probably he will, through sin's inherent power of growth, do worse. Having anew tasted blood, Ezekiel says, that they sought to displace God's people and remove God Himself ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 35:10-11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". \"Because thou hast said, these two nations and these two countries shall be mine, and we will possess it, whereas the Lord was there, therefore, as I live, saith the Lord God, I will even do according to thine anger, and according to thine envy, which thou hast used out of thy hatred against them.\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14. stood in the crossway, to cut off those of his—Judah's.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that did escape—The Jews naturally fled by the crossways. (Maurer translates, \"narrow mountain passes\") well known to them, to escape to the desert, and through Edom to Egypt; but the Edomites stood ready to intercept the fugitives and either kill or \"deliver them up\" to the foe.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "In the cross-way; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or in the breaches, viz. of the walls, by which, when the city was taken, some might have made their escape from the enemy; thou didst, though thou shouldst not, spitefully and cruelly watch at such breaches, and preventedst their flight; or else thou didst post thyself at the head of the ways, where thou mightest seize fleeing Jews. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "To cut off; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " either kill if they would not yield, or cut off their hopes of escape by making them prisoners. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Those of his that did escape",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " out of the city, and were fleeing farther for safety. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Neither shouldest thou have delivered up, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " reserved them prisoners, and brought them back into the hands of the Chaldeans, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "those of his, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of thy brother Jacob’s posterity, which did remain, survived the taking of the city, and were fairly like to escape; but thou foundest them and betrayedst them, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "in the day of distress, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " when they could no longer defend their city, nor had any hope but in a flight through all the secret ways they knew; but thou didst watch these ways, and didst cut off many who sought to flee through them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Neither shouldest thou have stood in the crossing,.... In a place where two or more roads met, to stop the Jews that fled, let them take which road they would: or, \"in the breach\" (y); that is, of the walls of the city; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "to cut off those of his that did escape; such of the Jews that escaped the sword of the Chaldeans in the city, and attempted, to get away through the breaches of the walls of it, or that took different roads to make their escape; these were intercepted and stopped by the Edomites, who posted themselves at these breaches, or at places where two or more ways met, and cut them off; so that those that escaped the sword of the enemy fell by theirs; which was exceeding barbarous and cruel: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "neither shouldest thou have delivered up those of his that did remain in the day of their distress; or \"shut up\" (z); they shut them up in their houses, or stopped up all the avenues and ways by which they might escape, even such as remained of those that were killed or carried captive; these falling into the hands of the Edomites, some they cut off, and others they delivered up into the hands of the Chaldeans. Of the joy and rejoicing of the mystical Edomites, the Papists, those false brethren and antichristians, at the destruction of the faithful witnesses and true Christians, and of their cruelty and inhumanity to them, see Revelation 11:7. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "neither shouldest thou have delivered up those of his that did remain in the day of their distress; or \"shut up\" (z); they shut them up in their houses, or stopped up all the avenues and ways by which they might escape, even such as remained of those that were killed or carried captive; these falling into the hands of the Edomites, some they cut off, and others they delivered up into the hands of the Chaldeans. Of the joy and rejoicing of the mystical Edomites, the Papists, those false brethren and antichristians, at the destruction of the faithful witnesses and true Christians, and of their cruelty and inhumanity to them, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 11:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(y)  \"in diruptione\", Junius & Tremellius, Tarnovius. (z)  \"neque concludas\", Montanus, Mercerus, Tigurine version, Tarnovius. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(y)  \"in diruptione\", Junius & Tremellius, Tarnovius. (z)  \"neque concludas\", Montanus, Mercerus, Tigurine version, Tarnovius. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Neither shouldest thou have stood in the crossway, to cut off those of his that did escape; neither shouldest thou have delivered up those of his that did remain in the day of distress.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Neither shouldest thou have stood … delivered up",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "stand not, deliver not up",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 14.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - The climax of injury is the cutting off of fugitives, and delivering them into captivity. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Neither shouldst thou have stood in the crossway;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "and stand not thou is the crossway",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Edomites, as neighbours, would know all the passes into the wilderness by which the Judaeans would seek to escape. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Neither shouldst thou have delivered up;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "and deliver not up",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; Septuagint, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "νηδὲ συγκλείσῃς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",, \"shut not up;\" Vulgate, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "et non concludes.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " So Pusey, \"shut not up,\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " with the enemy, driving them back upon their pursuers (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 31:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The Hebrew word implies both meanings - \"to deliver over to confinement;\" and the meaning here is - do not seize on the people to give them over into captivity (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 1:6, 9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Those of his that did remain.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Those whom the invaders had spared. Obadiah 1:14",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "\"And look not at the day of thy brother on the day of his misfortune; and rejoice not over the sons of Judah in the day of their perishing, and do not enlarge thy mouth in the day of the distress. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Obadiah 1:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Come not into the gate of my people in the day of their calamity; thou also look not at his misfortune in the day of his calamity, and stretch not out thy hand to his possession in the day of his calamity: ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Obadiah 1:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Nor stand in the cross-road, to destroy his fugitives, nor deliver up his escaped ones in the day of distress.\" This warning cannot be satisfactorily explained either \"on the assumption that the prophet is here foretelling the future destruction of Judah and Jerusalem\" (Caspari), or \"on the supposition that he is merely depicting an event that has already past\" (Hitzig). If the taking and plundering of Jerusalem were an accomplished fact, whether in idea or in reality, as it is shown to be by the perfects בּאוּ and ידּוּ in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Obadiah 1:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Obadiah could not in that case warn the Edomites against rejoicing over it, or even taking part therein. Hence Drusius, Rosenmller, and others, take the verbs in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Obadiah 1:12-14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as futures of the past: \"Thou shouldest not have seen, shouldest not have rejoiced,\" etc. But this is opposed to the grammar. אל followed by the so-called fut. apoc. is jussive, and cannot stand for the pluperf. conjunct. And Maurer's suggestion is just as untenable, namely, that yōm in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Obadiah 1:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " denotes the day of the capture of Jerusalem, and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Obadiah 1:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Obadiah 1:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the period after this day; since the identity of יום עמדך (the day of thy standing) in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Obadiah 1:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " with יום אחיך in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Obadiah 1:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " strikes the eye at once. The warning in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Obadiah 1:12-14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is only intelligible on the supposition, that Obadiah has not any particular conquest and plundering of Jerusalem in his mind, whether a future one or one that has already occurred, but regards this as an event that not only has already taken place, but will take place again: that is to say, on the assumption that he rises from the particular historical event to the idea which it embodied, and that, starting from this, he sees in the existing case all subsequent cases of a similar kind. From this ideal standpoint he could warn Edom of what it had already done, and designate the disastrous day which had come upon Judah and Jerusalem by different expressions as a day of the greatest calamity; for what Edom had done, and what had befallen Judah, were types of the future development of the fate of Judah and of the attitude of Edom towards it, which go on fulfilling themselves more and more until the day of the Lord upon all nations, upon the near approach of which Obadiah founds his warning in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Obadiah 1:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The warning proceeds in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Obadiah 1:12-14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " from the general to the particular, or from the lower to the higher. Obadiah warns the Edomites, as Hitzig says, \"not to rejoice in Judah's troubles (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Obadiah 1:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), nor to make common cause with the conquerors (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Obadiah 1:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), nor to outdo and complete the work of the enemy (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Obadiah 1:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").\" By the cop. Vav, which stands at the head of all the three clauses in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Obadiah 1:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the warning addressed to the Edomites, against such conduct as this, is linked on to what they had already done.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The three clauses of Obadiah 1:12 contain a warning in a graduated form against malicious pleasure. ראה with ב, to look at anything with pleasure, to take delight in it, affirms less than שׂמח ב, to rejoice, to proclaim one's joy without reserve. הגדּיל פּה, to make the mouth large, is stronger still, like הגדּיל בּפה, to boast, to do great things with the mouth, equivalent to הרחיב פּה על, to make the mouth broad, to stretch it open, over (against) a person (Psalm 35:21; Isaiah 57:4), a gesture indicating contempt and derision. The object of their malicious pleasure mentioned in the first clause is yōm 'âchı̄khâ, the day of thy brother, i.e., the day upon which something strange happened to him, namely, what is mentioned in Obadiah 1:11. Yōm does not of itself signify the disastrous day, or day of ruin, either here or anywhere else; but it always receives the more precise definition from the context. If we were to adopt the rendering \"disastrous day,\" it would give rise to a pure tautology when taken in connection with what follows. The expression 'âchı̄khâ (of thy brother) justifies the warning. בּיום נכרו is not in apposition to בּיום אחיך, but, according to the parallelism of the clauses, it is a statement of time. נכר, ἁπ. λεγ.  equals  נכר (Job 31:3), fortuna aliena, a strange, i.e., hostile fate, not \"rejection\" (Hitzig, Caspari, and others). The expression יום אבדם, the day of their (Judah's sons) perishing, is stronger still; although the perishing ('ăbhōd) of the sons of Judah cannot denote the destruction of the whole nation, since the following word tsrh, calamity, is much too weak to admit of this. Even the word איד, which occurs three times in Obadiah 1:13, does not signify destruction, but (from the root אוּד, to fall heavily, to load) simply pressure, a burden, then weight of suffering, distress, misfortune (see Delitzsch on Job 18:12). In Obadiah 1:13 Obadiah warns against taking part in the plundering of Jerusalem. The gate of my people: for the city in which the people dwell, the capital (see Micah 1:9). Look not thou also, a brother nation, upon his calamity, as enemies do, i.e., do not delight thyself thereat, nor snatch at his possessions. The form tishlachnâh, for which we should expect tishlach, is not yet satisfactorily explained (for the different attempts that have been made to explain it, see Caspari). The passages in which nâh is appended to the third pers. fem. sing., to distinguish it from the second person, do not help us to explain it. Ewald and Olshausen would therefore alter the text, and read תּשׁלח יד. But יד is not absolutely necessary, since it is omitted in 2 Samuel 6:6; 2 Samuel 22:17, or Psalm 18:17, where shâlach occurs in the sense of stretching out the hand. חילו, his possessions. On the fact itself, compare Joel 3:5. The prominence given to the day of misfortune at the end of every sentence is very emphatic; \"inasmuch as the selection of the time of a brother's calamity, as that in which to rage against him with such cunning and malicious pleasure, was doubly culpable\" (Ewald). In Obadiah 1:14 the warning proceeds to the worst crime of all, their seizing upon the Judaean fugitives, for the purpose of murdering them or delivering them up to the enemy. Pereq signifies here the place where the roads break or divide, the cross-road. In Nahum 3:1, the only other place in which it occurs, it signifies tearing in pieces, violence. Hisgı̄r, to deliver up (lit., concludendum tradidit), is generally construed with  אל  (Deuteronomy 23:16) or  בּיד (Psalm 31:9; 1 Samuel 23:11). Here it is written absolutely with the same meaning: not \"to apprehend, or so overpower that there is no escape left\" (Hitzig). This would affirm too little after the preceding הכרית, and cannot be demonstrated from Job 11:10, where hisgı̄r means to keep in custody. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The three clauses of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Obadiah 1:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " contain a warning in a graduated form against malicious pleasure. ראה with ב, to look at anything with pleasure, to take delight in it, affirms less than שׂמח ב, to rejoice, to proclaim one's joy without reserve. הגדּיל פּה, to make the mouth large, is stronger still, like הגדּיל בּפה, to boast, to do great things with the mouth, equivalent to הרחיב פּה על, to make the mouth broad, to stretch it open, over (against) a person (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 35:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 57:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), a gesture indicating contempt and derision. The object of their malicious pleasure mentioned in the first clause is yōm 'âchı̄khâ, the day of thy brother, i.e., the day upon which something strange happened to him, namely, what is mentioned in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Obadiah 1:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Yōm does not of itself signify the disastrous day, or day of ruin, either here or anywhere else; but it always receives the more precise definition from the context. If we were to adopt the rendering \"disastrous day,\" it would give rise to a pure tautology when taken in connection with what follows. The expression 'âchı̄khâ (of thy brother) justifies the warning. בּיום נכרו is not in apposition to בּיום אחיך, but, according to the parallelism of the clauses, it is a statement of time. נכר, ἁπ. λεγ.  equals  נכר (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 31:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), fortuna aliena, a strange, i.e., hostile fate, not \"rejection\" (Hitzig, Caspari, and others). The expression יום אבדם, the day of their (Judah's sons) perishing, is stronger still; although the perishing ('ăbhōd) of the sons of Judah cannot denote the destruction of the whole nation, since the following word tsrh, calamity, is much too weak to admit of this. Even the word איד, which occurs three times in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Obadiah 1:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", does not signify destruction, but (from the root אוּד, to fall heavily, to load) simply pressure, a burden, then weight of suffering, distress, misfortune (see Delitzsch on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 18:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Obadiah 1:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Obadiah warns against taking part in the plundering of Jerusalem. The gate of my people: for the city in which the people dwell, the capital (see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 1:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Look not thou also, a brother nation, upon his calamity, as enemies do, i.e., do not delight thyself thereat, nor snatch at his possessions. The form tishlachnâh, for which we should expect tishlach, is not yet satisfactorily explained (for the different attempts that have been made to explain it, see Caspari). The passages in which nâh is appended to the third pers. fem. sing., to distinguish it from the second person, do not help us to explain it. Ewald and Olshausen would therefore alter the text, and read תּשׁלח יד. But יד is not absolutely necessary, since it is omitted in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 6:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 22:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", or ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 18:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where shâlach occurs in the sense of stretching out the hand. חילו, his possessions. On the fact itself, compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joel 3:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The prominence given to the day of misfortune at the end of every sentence is very emphatic; \"inasmuch as the selection of the time of a brother's calamity, as that in which to rage against him with such cunning and malicious pleasure, was doubly culpable\" (Ewald). In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Obadiah 1:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the warning proceeds to the worst crime of all, their seizing upon the Judaean fugitives, for the purpose of murdering them or delivering them up to the enemy. Pereq signifies here the place where the roads break or divide, the cross-road. In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nahum 3:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the only other place in which it occurs, it signifies tearing in pieces, violence. Hisgı̄r, to deliver up (lit., concludendum tradidit), is generally construed with  אל  (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 23:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") or  בּיד (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 31:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 23:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Here it is written absolutely with the same meaning: not \"to apprehend, or so overpower that there is no escape left\" (Hitzig). This would affirm too little after the preceding הכרית, and cannot be demonstrated from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 11:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where hisgı̄r means to keep in custody. ",
            "children": []
          }
        ]
      }
    ]
  }
]