[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(3) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Wherefore hath the Lord smitten us?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The people and the elders who, as we have seen above, had undertaken the war of liberty at the instigation or the young man of God, amazed at their defeat, were puzzled to understand why God was evidently not in their midst; they showed by their next procedure how thoroughly they had gone astray from the old pure religion.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Let us fetch the ark of the covenant.—Whether or not Samuel acquiesced in this fatal proposition we have no information. It evidently did not emanate from him. but, as we are expressly told, from the “elders of the people.” Probably the lesson of the first defeat had deeply impressed him, and he saw that a thorough reformation throughout the land was needed before the invisible King would again be present among the people.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Let us fetch the ark of the covenant.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Whether or not Samuel acquiesced in this fatal proposition we have no information. It evidently did not emanate from him. but, as we are expressly told, from the ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "“",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "elders of the people.” Probably the lesson of the first defeat had deeply impressed him, and he saw that a thorough reformation throughout the land was needed before the invisible King would again be present among the people.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "It may save us.—It was a curious delusion, this baseless hope of the elders, that the unseen God was inseparably connected with that strange and beautiful symbol of His presence, with that coffer of perishable wood and metal overshadowed by the lifeless golden angels carved on the shining seat which closed this sacred Ark—that glittering mercy seat, as it was called, round which so many hallowed memories of the glory vision had gathered. Far on in the people’s story, one of the greatest of Samuel’s successors, Jeremiah, presses home the same truth the people were so slow in learning, when he passionately urges his Israel, “Trust ye not in lying words, saying The temple of the Lord, the temple of the Lord, the temple of the Lord are these. For if ye thoroughly amend your ways and your doings, then will I cause you to dwell in this place, in the land that 1 gave to your fathers, for ever and ever” (Jeremiah 7:4-5; Jeremiah 7:7).",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "It may save us.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—It was a curious delusion, this baseless hope of the elders, that the unseen God was inseparably connected with that strange and beautiful symbol of His presence, with that coffer of perishable wood and metal overshadowed by the lifeless golden angels carved on the shining seat which closed this sacred Ark—that glittering mercy seat, as it was called, round which so many hallowed memories of the glory vision had gathered. Far on in the people’s story, one of the greatest of Samuel’s successors, Jeremiah, presses home the same truth the people were so slow in learning, when he passionately urges his Israel, “Trust ye not in lying words, saying The temple of the Lord, the temple of the Lord, the temple of the Lord are these. For if ye thoroughly amend your ways and your doings, then will I cause you to dwell in this place, in the land that 1 gave to your fathers, for ever and ever” (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 7:4-5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 7:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Wordsworth here, with great force, thus writes:—“Probably David remembered this history when, with a clearer faith, he refused to allow the Ark to be carried with him in his retreat before Absalom out of Jerusalem; and even when the priests had brought it forth, he commanded them to carry it back to its place, saying, ‘If I shall find favour in the eyes of the Lord, He will bring me again, and show me both it and His habitation.’ (2Samuel 15:25.)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Wordsworth here, with great force, thus writes:—“Probably David remembered this history when, with a clearer faith, he refused to allow the Ark to be carried with him in his retreat before Absalom out of Jerusalem; and even when the priests had brought it forth, he commanded them to carry it back to its place, saying, ‘If I shall find favour in the eyes of the Lord, He will bring me again, and show me both it and His habitation.’ (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2Samuel 15:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "“David, without the Ark visibly present, but with the unseen help of Him who was enthroned on the mercy-seat, triumphed, and was restored to Jerusalem; but Israel, with the Ark visibly present, but without the blessing of Him whose throne the Ark was, fell before their enemies, and were deprived of the sacred symbol, which was taken by the Philistines.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1 Samuel 4:3-4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 4:3-4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Wherefore hath the Lord smitten us? ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— This was strange blindness, that when there was so great a corruption in their worship and manners, they could not see sufficient reason why God should suffer them to fall by their enemies. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Let us fetch the ark — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That great pledge of God’s presence and help, by whose conduct our ancestors obtained success. Instead of humbling themselves for, and purging themselves from their sins, for which God was displeased with them, they take an easier and cheaper course, and put their trust in their ceremonial observances, not doubting but the very presence of the ark would give them the victory. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "That they might bring the ark — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "This they should not have done without asking counsel of God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "4:1-9 Israel is smitten before the Philistines. Sin, the accursed thing, was in the camp, and gave their enemies all the advantage they could wish for. They own the hand of God in their trouble; but, instead of submitting, they speak angrily, as not aware of any just provocation they had given him. The foolishness of man perverts his way, and then his heart frets against the Lord, Pr 19:3, and finds fault with him. They supposed that they could oblige God to appear for them, by bringing the ark into their camp. Those who have gone back in the life of religion, sometimes discover great fondness for the outward observances of it, as if those would save them; and as if the ark, God's throne, in the camp, would bring them to heaven, though the world and the flesh are on the throne in the heart.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In the evening of the defeat of the Israelites the elders held a council, and resolved to send for the ark, which is described in full, as implying that in virtue of the covenant God could not but give them the victory (compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 10:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 3:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3-9. Let us fetch the ark of the covenant of the Lord out of Shiloh unto us—Strange that they were so blind to the real cause of the disaster and that they did not discern, in the great and general corruption of religion and morals (1Sa 2:22-25; 7:3; Ps 78:58), the reason why the presence and aid of God were not extended to them. Their first measure for restoring the national spirit and energy ought to have been a complete reformation—a universal return to purity of worship and morals. But, instead of cherishing a spirit of deep humiliation and sincere repentance, instead of resolving on the abolition of existing abuses, and the re-establishing of the pure faith, they adopted what appeared an easier and speedier course—they put their trust in ceremonial observances, and doubted not but that the introduction of the ark into the battlefield would ensure their victory. In recommending this extraordinary step, the elders might recollect the confidence it imparted to their ancestors (Nu 10:35; 14:44), as well as what had been done at Jericho. But it is more probable that they were influenced by the heathenish ideas of their idolatrous neighbors, who carried their idol Dagon, or his sacred symbols, to their wars, believing that the power of their divinities was inseparably associated with, or residing in, their images. In short, the shout raised in the Hebrew camp, on the arrival of the ark, indicated very plainly the prevalence among the Israelites at this time of a belief in national deities—whose influence was local, and whose interest was especially exerted in behalf of the people who adored them. The joy of the Israelites was an emotion springing out of the same superstitious sentiments as the corresponding dismay of their enemies; and to afford them a convincing, though painful proof of their error, was the ulterior object of the discipline to which they were now subjected—a discipline by which God, while punishing them for their apostasy by allowing the capture of the ark, had another end in view—that of signally vindicating His supremacy over all the gods of the nations.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Wherefore hath the Lord smitten us today before the Philistines, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " seeing our cause is so just, our own just and necessary defence from God’s and our enemies, and we came not forth to battle by our own motion, but by God’s command delivered by Samuel? This was strange blindness, that when there was so great a corruption in their worship and manners, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": " 1Sa 2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and such a defection to idolatry, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " 1 Samuel 7:3 Psalm 78:58",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 7:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 78:58",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", they could not see sufficient reason why God should suffer them to fall by their enemies. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The ark of the covenant of the Lord; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that great pledge of God’s presence and help, by whose conduct our ancestors obtained success, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Numbers 10:35 14:44 Joshua 6:4",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 10:35",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 14:44 ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 6:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". Instead of the performance of moral duties, humbling themselves deeply for and purging themselves speedily and thoroughly from all their sins, for which God was displeased with them, and now had chastised them, they take an easier and cheaper course, and put their trust in their ceremonial observances, not doubting but the very presence of the ark would give them the victory; and therefore it is no wonder they meet with so sad a disappointment. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And when the people came into the camp,.... At Ebenezer, where they pitched their tents, and from whence they went out to battle, and whither they returned after their defeat: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the elders of Israel said, wherefore hath the Lord smitten us today before the Philistines? they were right in ascribing it to the Lord, who had suffered them to be defeated by their enemies, but it is strange they should be so insensible of the cause of it; there was a reason ready at hand, their sins and iniquities were the cause of it, the corruption of manners among them, their neglect of bringing their offerings to the Lord, and the idolatry that many of them were guilty of, at least secretly, 1 Samuel 2:24 to punish them for which, they were brought into this war, and smitten in it; and yet they wonder at it, that so it should be, that they the people of God should be smitten before Heathens and uncircumcised Philistines; and the rather, since they went to battle with them according to the word of the Lord by Samuel; not considering that they went into this war without humiliation for their sins, and without praying to God for success, and that it was intended as a correction of them for their offences against God: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "the elders of Israel said, wherefore hath the Lord smitten us today before the Philistines? they were right in ascribing it to the Lord, who had suffered them to be defeated by their enemies, but it is strange they should be so insensible of the cause of it; there was a reason ready at hand, their sins and iniquities were the cause of it, the corruption of manners among them, their neglect of bringing their offerings to the Lord, and the idolatry that many of them were guilty of, at least secretly, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 2:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " to punish them for which, they were brought into this war, and smitten in it; and yet they wonder at it, that so it should be, that they the people of God should be smitten before Heathens and uncircumcised Philistines; and the rather, since they went to battle with them according to the word of the Lord by Samuel; not considering that they went into this war without humiliation for their sins, and without praying to God for success, and that it was intended as a correction of them for their offences against God: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "let us fetch the ark of the covenant of the Lord out of Shiloh unto us; in which the law was, sometimes called the covenant between God and them; and which was a symbol of the divine Presence, for want of which they supposed they had not the presence of God with them, and so had not success; and the rather they were encouraged to take this step and method, because that formerly Israel had success against their enemies when the ark was with them, Numbers 31:6 though no doubt in this there was an overruling providence of God, by which they were led to take such a step as this, in order to bring the two sons of Eli into the camp, that they might be slain in one day, according to the divine prediction: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "let us fetch the ark of the covenant of the Lord out of Shiloh unto us; in which the law was, sometimes called the covenant between God and them; and which was a symbol of the divine Presence, for want of which they supposed they had not the presence of God with them, and so had not success; and the rather they were encouraged to take this step and method, because that formerly Israel had success against their enemies when the ark was with them, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 31:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " though no doubt in this there was an overruling providence of God, by which they were led to take such a step as this, in order to bring the two sons of Eli into the camp, that they might be slain in one day, according to the divine prediction: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "that when it cometh among us, it may save us out of the hand of our enemies; foolishly placing their confidence in an external symbol, and not in the Lord himself; ascribing salvation to that, which only belongs to him, whether of a temporal or spiritual kind: and such folly and vanity are men guilty of when they seek to, make use of, and trust in anything short of Christ for salvation; as in carnal descent; in the rituals of the law; in the ordinances of the Gospel; in any religious exercises, private or public; or in any works of righteousness done by them: in Christ alone is salvation from spiritual enemies; and indeed from the Lord only is salvation and deliverance from temporal enemies. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "that when it cometh among us, it may save us out of the hand of our enemies; foolishly placing their confidence in an external symbol, and not in the Lord himself; ascribing salvation to that, which only belongs to him, whether of a temporal or spiritual kind: and such folly and vanity are men guilty of when they seek to, make use of, and trust in anything short of Christ for salvation; as in carnal descent; in the rituals of the law; in the ordinances of the Gospel; in any religious exercises, private or public; or in any works of righteousness done by them: in Christ alone is salvation from spiritual enemies; and indeed from the Lord only is salvation and deliverance from temporal enemies. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And when the people were come into the camp, the elders of Israel said, {a} Wherefore hath the LORD smitten us to day before the Philistines? Let us fetch the ark of the covenant of the LORD out of Shiloh unto us, that, when it cometh among us, it may save us out of the hand of our enemies.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And when the people were come into the camp, the elders of Israel said, ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{a}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Wherefore hath the LORD smitten us to day before the Philistines? Let us fetch the ark of the covenant of the LORD out of Shiloh unto us, that, when it cometh among us, it may save us out of the hand of our enemies.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) For it seems that this war was undertaken by Samuel's commandment.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And when",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.] Connect closely with ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "1 Samuel 4:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 4:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " by rendering, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And the people came to the camp, and the elders",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c. The use of the term ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "people",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "army",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is characteristic of the time when there was no standing army, but a levy of all the men capable of bearing arms in time of war.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the elders of Israel said",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The officers of the army held a council of war, and resolved to fetch the Ark. On the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Elders",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " see note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 8:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Wherefore hath the Lord smitten us",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The Israelites assume that their defeat came from Jehovah. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 7:7-8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". But instead of enquiring the cause of His displeasure, they fancy that His aid can be secured by the presence of the Ark. They may have recollected the words which Moses used when the Ark set forward, “Rise up, Lord, and let thine enemies be scattered; and let them that hate thee flee before thee” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 10:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "): and how the Ark had led them to victory against Jericho (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 6:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Possibly the Philistines, as upon a later occasion (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 5:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), had brought the images of their gods into the field, and this suggested the idea of fetching the Ark. The superstition which confused the Symbol with the Presence was the natural result of the decay of religion.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 3.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "When the people were come into the camp.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Before the battle Israel had entrenched itself, so that upon its defeat it had a place capable of defence into which to retire. We find also that their communications were open, so that they could send to Shiloh. The army is called ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "the people",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " because battles were not fought in those days by men specially trained, but by all the inhabitants of the country of the proper age. The question, ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Wherefore hath Jehovah smitten us?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " expresses surprise. The elders had evidently expected victory, and therefore the domination of the Philistines could not have been so complete as it certainly was in the days of Samson. There must have been an intermediate period of successful warfare during which Eli had been their leader. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Let us fetch the ark of the covenant of Jehovah.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " This, the remedy suggested by the elders, was to employ their God as a talisman or charm. The ark was the symbol of Jehovah's presence among them, and of their being his especial people, and by exposing it to danger they supposed that they would compel their God to interfere in their behalf. They would have done right in appealing to their covenant relation to Jehovah; and had they repented of the sins which had grown up among them, fostered by the evil example of Eli's sons, he would have shown them mercy. But for God to have given Israel the victory because of the presence of his ark in their camp would have been to overthrow all moral government, and would have insured their spiritual ruin as inevitably as would the granting to any order of men now the power of working miracles or of infallibly declaring the truth. 1 Samuel 4:3",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "On the return of the people to the camp, the elders held a council of war as to the cause of the defeat they had suffered. \"Why hath Jehovah smitten us to-day before the Philistines?\" As they had entered upon the war by the word and advice of Samuel, they were convinced that Jehovah had smitten them. The question presupposes at the same time that the Israelites felt strong enough to enter upon the war with their enemies, and that the reason for their defeat could only be that the Lord, their covenant God, had withdrawn His help. This was no doubt a correct conclusion; but the means which they adopted to secure the help of their God in continuing the war were altogether wrong. Instead of feeling remorse and seeking the help of the Lord their God by a sincere repentance and confession of their apostasy from Him, they resolved to fetch the ark of the covenant out of the tabernacle at Shiloh into the camp, with the delusive idea that God had so inseparably bound up His gracious presence in the midst of His people with this holy ark, which He had selected as the throne of His gracious appearance, that He would of necessity come with it into the camp and smite the foe. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 4:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the ark is called \"the ark of the covenant of Jehovah of hosts, who is enthroned above the cherubim,\" partly to show the reason why the people had the ark fetched, and partly to indicate the hope which they founded upon the presence of this sacred object. (See the commentary on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 25:20-22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The remark introduced here, \"and the two sons of Eli were there with the ark of the covenant of God,\" is not merely intended to show who the guardians of the ark were, viz., priests who had hitherto disgraced the sanctuary, but also to point forward at the very outset to the result of the measures adopted. ",
        "children": []
      }
    ]
  }
]