[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(7) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "God is come into the camp.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The joy manifested by the Israelites at the arrival of the Ark from the sanctuary made the Philistines suspect that their enemies’ God was now present with the defeated army.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The city of Aphek, near to which the camp of Israel was pitched, was close to the western entrance of the Pass of Beth-horon. The two defeats of Israel are termed in this Commentary the Battles of Aphek. The name of Eben-ezer, by which the scene was known in after days, was only given to the locality some twenty years later, on the occasion of the victory of Samuel near the same spot.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Philistines and Israelites, then, were equally superstitious in their belief both supposing that Deity was in some way connected with the lifeless gold and wood of the symbol Ark and Cherubim. But the Philistines had some excuse for their fears. Tradition was, no doubt, current among the old inhabitants of Canaan how this sacred Ark had been carried before the conquering armies of Israel in many a battle and siege in those bygone days, when the strange shepherd hordes under Joshua had. first invaded and taken possession of their beautiful land. The next verse explains more clearly some of the reasons for their fear.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1 Samuel 4:7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 4:7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "God is come into the camp — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Thus these ignorant idolaters termed the mere symbol of God’s presence God, imagining, no doubt, that the Israelites worshipped it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "They said, Wo unto us — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The name of the God of Israel was formidable even to those that worshipped other gods, and some apprehensions even the infidels had of the danger of contending with him. And, indeed, those are in a woful condition who have God against them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "There hath not been such a thing heretofore — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Not in our times; for the fore-mentioned removals of the ark were before it came to Shiloh. And in all the battles which they or their neighbours had fought with the Israelites, they had never heard of such a thing as this. They thought, therefore, that it must produce some extraordinary effects.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "4:1-9 Israel is smitten before the Philistines. Sin, the accursed thing, was in the camp, and gave their enemies all the advantage they could wish for. They own the hand of God in their trouble; but, instead of submitting, they speak angrily, as not aware of any just provocation they had given him. The foolishness of man perverts his way, and then his heart frets against the Lord, Pr 19:3, and finds fault with him. They supposed that they could oblige God to appear for them, by bringing the ark into their camp. Those who have gone back in the life of religion, sometimes discover great fondness for the outward observances of it, as if those would save them; and as if the ark, God's throne, in the camp, would bring them to heaven, though the world and the flesh are on the throne in the heart.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Of the Hebrews - This was the name by which the Israelites were known to foreign nations (compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 1:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 2:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3-9. Let us fetch the ark of the covenant of the Lord out of Shiloh unto us—Strange that they were so blind to the real cause of the disaster and that they did not discern, in the great and general corruption of religion and morals (1Sa 2:22-25; 7:3; Ps 78:58), the reason why the presence and aid of God were not extended to them. Their first measure for restoring the national spirit and energy ought to have been a complete reformation—a universal return to purity of worship and morals. But, instead of cherishing a spirit of deep humiliation and sincere repentance, instead of resolving on the abolition of existing abuses, and the re-establishing of the pure faith, they adopted what appeared an easier and speedier course—they put their trust in ceremonial observances, and doubted not but that the introduction of the ark into the battlefield would ensure their victory. In recommending this extraordinary step, the elders might recollect the confidence it imparted to their ancestors (Nu 10:35; 14:44), as well as what had been done at Jericho. But it is more probable that they were influenced by the heathenish ideas of their idolatrous neighbors, who carried their idol Dagon, or his sacred symbols, to their wars, believing that the power of their divinities was inseparably associated with, or residing in, their images. In short, the shout raised in the Hebrew camp, on the arrival of the ark, indicated very plainly the prevalence among the Israelites at this time of a belief in national deities—whose influence was local, and whose interest was especially exerted in behalf of the people who adored them. The joy of the Israelites was an emotion springing out of the same superstitious sentiments as the corresponding dismay of their enemies; and to afford them a convincing, though painful proof of their error, was the ulterior object of the discipline to which they were now subjected—a discipline by which God, while punishing them for their apostasy by allowing the capture of the ark, had another end in view—that of signally vindicating His supremacy over all the gods of the nations.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "God is come, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to wit, in and with his ark; or they give the name of God to the ark, before which he was worshipped, as they used to do to the images of their false gods. There hath not been such a thing heretofore; not to our knowledge, or not in our times; for the forementioned removals of the ark were before it came to Shiloh. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the Philistines were afraid,.... When the spies returned, and reported to them the reason of the shouting: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for they said, God is come into the camp; into the camp of Israel, because the ark represented him, and was the symbol of his presence; and these Heathens might take the ark itself for an idol of the Israelites; the Targum is,\"the ark of God is come\" ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and they said, woe unto us; it is all over with us, destruction and ruin will be our case, victory will go on their side now their God is among them: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for there hath not been such a thing heretofore; if by this they meant that the ark had never been in the camp of Israel before, they were mistaken; and it is no great wonder they should, being not so well acquainted with the affairs of Israel, and their customs; or rather, it was not so yesterday, or three days ago, when they were defeated; there was no shouting then: or the state of the war is altered; before we fought with the men of Israel, but now we must fight with the God of Israel also. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "for there hath not been such a thing heretofore; if by this they meant that the ark had never been in the camp of Israel before, they were mistaken; and it is no great wonder they should, being not so well acquainted with the affairs of Israel, and their customs; or rather, it was not so yesterday, or three days ago, when they were defeated; there was no shouting then: or the state of the war is altered; before we fought with the men of Israel, but now we must fight with the God of Israel also. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And the Philistines were afraid, for they said, God is come into the camp. And they said, {c} Woe unto us! for there hath not been such a thing heretofore.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And the Philistines were afraid, for they said, God is come into the camp. And they said, ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{c}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Woe unto us! for there hath not been such a thing heretofore.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) Before we fought against men, and now God has come to fight against us.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "When the Philistines heard the noise, and learned on inquiry that the ark of Jehovah had come into the camp, they were thrown into alarm, for \"they thought (lit. said), God (Elohim) is come into the camp, and said, 'Woe unto us! For such a thing has not happened yesterday and the day before (i.e., never till now). Woe to us! Who will deliver us from the hand of these mighty gods? These are the very gods that smote Egypt with all kinds of plagues in the wilderness.' \" The Philistines spoke of the God of Israel in the plural., האדּירים האלהים, as heathen who only knew of gods, and not of one Almighty God. Just as all the heathen feared the might of the gods of other nations in a certain degree, so the Philistines also were alarmed at the might of the God of the Israelites, and that all the more because the report of His deeds in the olden time had reached their ears (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 15:14-15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The expression \"in the wilderness\" does not compel us to refer the words \"smote with all the plagues\" exclusively to the destruction of Pharaoh and his army in the Red Sea (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 14:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".). \"All the plagues\" include the rest of the plagues which God inflicted upon Egypt, without there being any necessity to supply the copula ו before בּמּדבּר, as in the lxx and Syriac. By this addition an antithesis is introduced into the words, which, if it really were intended, would require to be indicated by a previous בּארץ or בּארצם. According to the notions of the Philistines, all the wonders of God for the deliverance of Israel out of Egypt took place in the desert, because even when Israel was in Goshen they dwelt on the border of the desert, and were conducted thence to Canaan. ",
        "children": []
      }
    ]
  }
]