[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(8) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "These are the Gods that smote the Egyptians.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—No doubt the compiler of these “Memoirs of Samuel” has given us the very words of the Philistines, preserved in their national traditions of this sad time. They are the expression of idolaters who knew of “Gods” and dreaded their malevolent influence, but who had no conception of the One Most High God. The plural form Elohim, so often found in the sacred record for God, is used here; but whereas the inspired compilers would have written ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "their ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "qualifying adjective in the singular, the Philistine idolaters write ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "theirs ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "in the plural—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Elohim addirim: ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Mighty Gods.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "It is noticeable that the Philistine exclamation of awe and terror is based outwardly upon the Egyptian traditions of the acts of the Lord. They studiedly ignore what they were all in that camp painfully conscious of—His acts in their own land of Canaan. The Septuagint and Syriac Versions, and some commentators, add “and” before the words “in the wilderness,” to make the Philistine exclamation more in harmony with history, seeing that the plagues were inflicted before the Israelites entered the wilderness; but the very vagueness of the exclamation of fear speaks for its truth. They were little concerned with exact historical accuracy, and were simply conscious of some terrible judgment having fallen on the foes of this Israel, a judgment they not unnaturally connected with the Ark of the Covenant just arrived in the enemy’s camp: that Ark their ancestors remembered so often at the head of the armies of this Israel in their days of triumph.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "It is noticeable that the Philistine exclamation of awe and terror is based outwardly upon the Egyptian traditions of the acts of the Lord. They studiedly ignore what they were all in that camp painfully conscious of—His acts in their own land of Canaan. The Septuagint and Syriac Versions, and some commentators, add “and” before the words “in the wilderness,” to make the Philistine exclamation more in harmony with history, seeing that the plagues were inflicted ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "before ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "the Israelites entered the wilderness; but the very vagueness of the exclamation of fear speaks for its truth. They were little concerned with exact historical accuracy, and were simply conscious of some terrible judgment having fallen on the foes of this Israel, a judgment they not unnaturally connected with the Ark of the Covenant just arrived in the enemy’s camp: that Ark their ancestors remembered so often at the head of the armies of this Israel in their days of triumph.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1 Samuel 4:8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 4:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Who shall deliver us, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — They had fought with men before; but now they thought they should have to fight with God, before whom none could stand. Here we see their unreasonableness and folly. They secretly confess the Lord to be greater than their gods, and yet presume to oppose him! ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "That smote the Egyptians in the wilderness ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— They seem to have had but a very imperfect and incorrect knowledge of the Israelitish affairs, and to have supposed that all those plagues which are recorded in their history had fallen on the Egyptians while the Israelites were in the wilderness, where they were when the last of these plagues befell them, and they were drowned in the Red sea. But it is not strange that these heathen should mistake some circumstances relating to the affairs of another people, with whom they had no friendly intercourse, but were in a state of almost continual hostility, especially as some hundreds of years had now elapsed since these events had taken place.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "4:1-9 Israel is smitten before the Philistines. Sin, the accursed thing, was in the camp, and gave their enemies all the advantage they could wish for. They own the hand of God in their trouble; but, instead of submitting, they speak angrily, as not aware of any just provocation they had given him. The foolishness of man perverts his way, and then his heart frets against the Lord, Pr 19:3, and finds fault with him. They supposed that they could oblige God to appear for them, by bringing the ark into their camp. Those who have gone back in the life of religion, sometimes discover great fondness for the outward observances of it, as if those would save them; and as if the ark, God's throne, in the camp, would bring them to heaven, though the world and the flesh are on the throne in the heart.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "This is a remarkable testimony on the part of the Philistines to the truth of the events which are recorded in the Pentateuch. The Philistines would of course hear of them, just as Balak and the people of Jericho did ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 22:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 2:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "With all the plagues ... - Rather, \"with every kind of plague\" equivalent to \"with utter destruction. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "With all the plagues ... - Rather, \"with every kind of plague\" equivalent to \"with utter destruction. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3-9. Let us fetch the ark of the covenant of the Lord out of Shiloh unto us—Strange that they were so blind to the real cause of the disaster and that they did not discern, in the great and general corruption of religion and morals (1Sa 2:22-25; 7:3; Ps 78:58), the reason why the presence and aid of God were not extended to them. Their first measure for restoring the national spirit and energy ought to have been a complete reformation—a universal return to purity of worship and morals. But, instead of cherishing a spirit of deep humiliation and sincere repentance, instead of resolving on the abolition of existing abuses, and the re-establishing of the pure faith, they adopted what appeared an easier and speedier course—they put their trust in ceremonial observances, and doubted not but that the introduction of the ark into the battlefield would ensure their victory. In recommending this extraordinary step, the elders might recollect the confidence it imparted to their ancestors (Nu 10:35; 14:44), as well as what had been done at Jericho. But it is more probable that they were influenced by the heathenish ideas of their idolatrous neighbors, who carried their idol Dagon, or his sacred symbols, to their wars, believing that the power of their divinities was inseparably associated with, or residing in, their images. In short, the shout raised in the Hebrew camp, on the arrival of the ark, indicated very plainly the prevalence among the Israelites at this time of a belief in national deities—whose influence was local, and whose interest was especially exerted in behalf of the people who adored them. The joy of the Israelites was an emotion springing out of the same superstitious sentiments as the corresponding dismay of their enemies; and to afford them a convincing, though painful proof of their error, was the ulterior object of the discipline to which they were now subjected—a discipline by which God, while punishing them for their apostasy by allowing the capture of the ark, had another end in view—that of signally vindicating His supremacy over all the gods of the nations.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "These mighty Gods; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " they secretly confess the Lord to be higher and greater than their gods, and yet against their knowledge presume to oppose him. They mention the wilderness, not as if all the plagues of the Egyptians came upon them in the wilderness, but because the last and sorest of all, which is therefore put for all, to wit, the destruction of Pharaoh and all his host, happened in the wilderness, namely, in the Red Sea, which having the wilderness on both sides of it, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Exodus 13:18,20 15:3,11 15:22",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 13:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",20 15:3,11 15:22",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c., may well be said to be in the wilderness. Although it is not strange if these heathens did mistake and misreport some circumstance in a relation of the Israelitish affairs, especially some hundreds of years after they were done, such mistakes being frequent in divers heathen authors treating of those matters, as Justin, and Tacitus, and others. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Woe unto us, who shall deliver us out of the hand of these mighty gods?.... Of whom they spoke in an ironical and sneering manner; or if seriously and through fear, they use their own Heathenish language, as if the Israelites had many gods, as they had, though mightier than theirs; though the Syriac and Arabic versions read in the singular, out of the hand of God, or the most strong God; and so the Targum, out of the hand of the Word of the Lord: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "these are the gods that smote the Egyptians with all the plagues in the wilderness: the ten plagues were inflicted on the Egyptians in the land of Egypt, and not in the wilderness; wherefore the Philistines may be supposed to be mistaken in this circumstance; which is not to be wondered at, since many historians who have written of the affairs of the Jews have been mistaken in them, as Justin, Tacitus, and others; nay, even Josephus himself in some things: but perhaps respect is had to the drowning of Pharaoh and his host in the Red sea, which had the wilderness of Etham on both sides of it; and this stroke was the finishing one of the plagues on the Egyptians. R. Joseph Kimchi supposes the word for wilderness has the signification of speech, as in Sol 4:3 and that the sense of the Philistines is, that God smote the Egyptians with all the plagues he did by his word, his orders, and commands; but now he was come in person, and would smite them by himself; this sense Abarbinel calls a beautiful one. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "these are the gods that smote the Egyptians with all the plagues in the wilderness: the ten plagues were inflicted on the Egyptians in the land of Egypt, and not in the wilderness; wherefore the Philistines may be supposed to be mistaken in this circumstance; which is not to be wondered at, since many historians who have written of the affairs of the Jews have been mistaken in them, as Justin, Tacitus, and others; nay, even Josephus himself in some things: but perhaps respect is had to the drowning of Pharaoh and his host in the Red sea, which had the wilderness of Etham on both sides of it; and this stroke was the finishing one of the plagues on the Egyptians. R. Joseph Kimchi supposes the word for wilderness has the signification of speech, as in Sol 4:3 and that the sense of the Philistines is, that God smote the Egyptians with all the plagues he did by his word, his orders, and commands; but now he was come in person, and would smite them by himself; this sense Abarbinel calls a beautiful one. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Woe unto us! who shall deliver us out of the hand of these mighty Gods? these are the Gods that smote the Egyptians with all the plagues in the {d} wilderness.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Woe unto us! who shall deliver us out of the hand of these mighty Gods? these ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "are",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the Gods that smote the Egyptians with all the plagues in the ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{d}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " wilderness.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(d) For in the Red Sea in the wilderness the Egyptians were destroyed, which was the last of all his plagues.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "these mighty Gods",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The heathen polytheists naturally suppose that Israel like themselves had ‘gods many.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "with all the plagues",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Better, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "with an utter overthrow",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", lit. ‘with every kind of smiting.’ The word used is the same as that rendered ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "slaughter",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "1 Samuel 4:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 4:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and the allusion is to the overthrow of Pharaoh in the Red Sea, the shores of which are called ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "wilderness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 13:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", not to the ten plagues, for which a different word is used in Exodus. The effect of the news of the destruction of Pharaoh ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "upon the Philistines",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is alluded to in the Song of Moses, “Sorrow shall take hold upon the inhabitants of Palestina” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 15:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "): and Rahab speaks of it as inspiring the Canaanites with terror (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 2:9-11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 8.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "These mighty Gods.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " In Hebrew ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "\"Elohim",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", though plural, is used of the one true God, but in this sense has always the verb or adjective belonging to it in the singular. In ver. 7 the Philistines conform to this rule, and say, ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Elohim is come;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " but here the verb, pronoun, and adjective are all plural, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " they speak as heathen, to whom polytheism was natural (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 12:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "With all the plagues.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Rather, \"with every plague,\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " with every kind of plague. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "In the wilderness.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " God did not really smite the Egyptians in the wilderness. The plagues, including the destruction of Pharaoh and his host in the Red Sea, had all happened before the Israelites had entered it. But probably the Philistines confused together the plagues of Egypt and the miracles in the wilderness, and even the conquest of Canaan, in one grand but vague whole, and so were ready to give way to despair, as they called to mind the traditions they had heard of these mighty interpositions of God for his people. 1 Samuel 4:8",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "When the Philistines heard the noise, and learned on inquiry that the ark of Jehovah had come into the camp, they were thrown into alarm, for \"they thought (lit. said), God (Elohim) is come into the camp, and said, 'Woe unto us! For such a thing has not happened yesterday and the day before (i.e., never till now). Woe to us! Who will deliver us from the hand of these mighty gods? These are the very gods that smote Egypt with all kinds of plagues in the wilderness.' \" The Philistines spoke of the God of Israel in the plural., האדּירים האלהים, as heathen who only knew of gods, and not of one Almighty God. Just as all the heathen feared the might of the gods of other nations in a certain degree, so the Philistines also were alarmed at the might of the God of the Israelites, and that all the more because the report of His deeds in the olden time had reached their ears (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 15:14-15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The expression \"in the wilderness\" does not compel us to refer the words \"smote with all the plagues\" exclusively to the destruction of Pharaoh and his army in the Red Sea (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 14:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".). \"All the plagues\" include the rest of the plagues which God inflicted upon Egypt, without there being any necessity to supply the copula ו before בּמּדבּר, as in the lxx and Syriac. By this addition an antithesis is introduced into the words, which, if it really were intended, would require to be indicated by a previous בּארץ or בּארצם. According to the notions of the Philistines, all the wonders of God for the deliverance of Israel out of Egypt took place in the desert, because even when Israel was in Goshen they dwelt on the border of the desert, and were conducted thence to Canaan. ",
        "children": []
      }
    ]
  }
]