[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(3) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Let not him that eateth.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The two classes of men are exposed to two opposite faults. The strong ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "despise",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the weak; the weak ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "judge",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the strong. In the one case there is contempt for what is thought to be narrowness and pedantry. In the other case censorious judgments are passed on what is regarded as levity and irreligion. Human nature alters very little.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "God hath received him.—Strictly, received him, admitted him into His Church when he was baptised, and so took him for His own.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "God hath received him.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Strictly, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "received him,",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " admitted him into His Church when he was baptised, and so took him for His own.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14:1-6 Differences of opinion prevailed even among the immediate followers of Christ and their disciples. Nor did St. Paul attempt to end them. Compelled assent to any doctrine, or conformity to outward observances without being convinced, would be hypocritical and of no avail. Attempts for producing absolute oneness of mind among Christians would be useless. Let not Christian fellowship be disturbed with strifes of words. It will be good for us to ask ourselves, when tempted to disdain and blame our brethren; Has not God owned them? and if he has, dare I disown them? Let not the Christian who uses his liberty, despise his weak brother as ignorant and superstitious. Let not the scrupulous believer find fault with his brother, for God accepted him, without regarding the distinctions of meats. We usurp the place of God, when we take upon us thus to judge the thoughts and intentions of others, which are out of our view. The case as to the observance of days was much the same. Those who knew that all these things were done away by Christ's coming, took no notice of the festivals of the Jews. But it is not enough that our consciences consent to what we do; it is necessary that it be certified from the word of God. Take heed of acting against a doubting conscience. We are all apt to make our own views the standard of truth, to deem things certain which to others appear doubtful. Thus Christians often despise or condemn each other, about doubtful matters of no moment. A thankful regard to God, the Author and Giver of all our mercies, sanctifies and sweetens them.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Let not him that eateth - That is, he who has no scruples about eating \"meat,\" etc., who is not restrained by the Law of the Jews respecting the Clean and unclean, or by the fact that meat \"may\" have been offered to idols.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Despise him - Hold him in contempt, as being unnecessarily scrupulous, etc. The word \"despise\" here is happily chosen. The Gentile would be very likely to \"despise\" the Jew as being restrained by foolish scruples and mere distinctions in matters of no importance.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Him that eateth not - Him that is restrained by scruples of conscience, and that will eat only \"vegetables;\" Romans 14:2. The reference here is doubtless to the \"Jew.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Him that eateth not - Him that is restrained by scruples of conscience, and that will eat only \"vegetables;\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 14:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The reference here is doubtless to the \"Jew.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Judge him - To \"judge\" here has the force of \"condemn.\" This word also is very happily chosen. The Jew would not be so likely to \"despise\" the Gentile for what he did as to \"judge\" or condemn him. He would deem it too serious a matter for contempt. He would regard it as a violation of the Law of God, and would be likely to assume the right of judging his brother, and pronouncing him guilty. The apostle here has happily met the whole case in all disputes about rites, and dress, and scruples in religious matters that are not essential. One party commonly \"despises\" the other as being needlessly and foolishly scrupulous; and the other makes it a matter of \"conscience,\" too serious for ridicule and contempt; and a matter, to neglect which, is, in their view, deserving of condemnation. The true direction to be given in such a case is, \"to the one party,\" not to treat the scruples of the other with derision and contempt, but with tenderness and indulgence. Let him have his way in it. If he can be \"reasoned\" out of it, it is well; but to attempt to \"laugh\" him out of it is unkind, and will tend only to confirm him in his views. And \"to the other party,\" it should be said they have no \"right\" to judge or condemn another. If I cannot see that the Bible requires a particular cut to my coat, or makes it my duty to observe a particular festival, he has no right to judge me harshly, or to suppose that I am to be rejected and condemned for it. He has a right to \"his\" opinion; and while I do not \"despise\" him, he has no right to \"judge\" me. This is the foundation of true charity; and if this simple rule had been followed, how much strife, and even bloodshed, would it have spared in the church. Most of the contentions among Christians have been on subjects of this nature. Agreeing substantially in the \"doctrines\" of the Bible, they have been split up into sects on subjects just about as important as those which the apostle discusses in this chapter.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "For God hath received him - This is the same word that is translated \"receive\" in Romans 14:1. It means here that God hath received him kindly; or has acknowledged him as his own friend; or he is a true Christian. These scruples, on the one side or the other, are not inconsistent with true piety; and as \"God\" has acknowledged him as \"his,\" notwithstanding his opinions on these subjects, so \"we\" also ought to recognise him as a Christian brother. Other denominations, though they may differ from us on some subjects, may give evidence that they are recognised by God as his, and where there is this evidence, we should neither despise nor judge them. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "For God hath received him - This is the same word that is translated \"receive\" in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 14:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". It means here that God hath received him kindly; or has acknowledged him as his own friend; or he is a true Christian. These scruples, on the one side or the other, are not inconsistent with true piety; and as \"God\" has acknowledged him as \"his,\" notwithstanding his opinions on these subjects, so \"we\" also ought to recognise him as a Christian brother. Other denominations, though they may differ from us on some subjects, may give evidence that they are recognised by God as his, and where there is this evidence, we should neither despise nor judge them. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3. Let not him that eateth despise—look down superciliously upon \"him that eateth not.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and let not him that eateth not judge—sit in judgment censoriously upon \"him that eateth.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for God hath received him—as one of His dear children, who in this matter acts not from laxity, but religious principle.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Let not him that eateth despise him that eateth not; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. Let not him that makes use of his liberty in eating any thing indifferently, vilify or contemn him that is of a contrary mind, as one that is ignorant and over scrupulous; and let not him that forbears such meats as were of old forbidden, judge and condemn him that is contrary-minded, as profane and over-venturous; notwithstanding such little difference in opinion, let one Christian love and communicate with another. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "For God hath received him:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it is disputed, whether this be meant of the weak or strong Christian; the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "judge, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which immediately goes before and follows after, carries it rather for the latter. But some think it is meant of both. He that eateth, and he that eateth not, is received by God into his church and family, and indiffercnlly accepted with him, uponanother and a higher account. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Let not him that eateth, despise him that eateth not,.... Such who had a greater degree of Gospel light and knowledge, and made use of their Christian liberty in eating any sort of food, were not to despise as they were apt to do, such as abstained therefrom on account of the ceremonial law, as weak, ignorant; superstitious, and bigoted persons; or were not to set them at naught, or make nothing of them, as the word signifies, have no regard to their peace and comfort; but, on the other hand, were to consider them as brethren in Christ, though weak; and as having a work of God upon their souls, and therefore to be careful how they grieved them, destroyed their peace, or laid stumblingblocks in their way: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and let not him which eateth not, judge him that eateth: such who thought it not their duty to eat anything, but to forbear the use of some things directed to in the law, were not to censure and condemn, as they were apt to do, those who used their liberty in these things, as profane persons, and transgressors of the law of God; but leave them to the last and righteous judgment, when every one must be accountable to God for the various actions of life: the reason used to enforce this advice on both parties is, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for God hath received him: which respects both him that eateth, and him that eateth not, him that is despised, and him that is judged; and is a reason why one should not despise, nor the other judge, because God had received both the one and the other into his heart's love and affection, into the covenant of grace, and into his family by adoption: they were received by Christ, coming to him as perishing sinners, according to the will of God; whose will it likewise was, that they should be received into church fellowship, as being no more strangers and foreigners, but fellow citizens with the saints, and of the household of God; and God had also received them into his service, and they were made willing to serve him, as well as to be saved by him; and did serve him acceptably with reverence and godly fear, in righteousness and holiness; and this is the rather to be taken into the sense of this passage, because of what follows. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "for God hath received him: which respects both him that eateth, and him that eateth not, him that is despised, and him that is judged; and is a reason why one should not despise, nor the other judge, because God had received both the one and the other into his heart's love and affection, into the covenant of grace, and into his family by adoption: they were received by Christ, coming to him as perishing sinners, according to the will of God; whose will it likewise was, that they should be received into church fellowship, as being no more strangers and foreigners, but fellow citizens with the saints, and of the household of God; and God had also received them into his service, and they were made willing to serve him, as well as to be saved by him; and did serve him acceptably with reverence and godly fear, in righteousness and holiness; and this is the rather to be taken into the sense of this passage, because of what follows. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "{3} Let not him that eateth despise him that eateth not; and let not him which eateth not judge him that eateth: for {4} God hath received him.",
        "children": [
          {
            "element": "span",
            "class": "cverse3",
            "text": "{3}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Let not him that eateth despise him that eateth not; and let not him which eateth not judge him that eateth: for ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{4}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " God hath received him.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(3) In such a matter, says the apostle, let neither those who know their liberty proudly despise their weak brother, neither let the unlearned wickedly or perversely condemn that which they do not understand.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(4) The first reason: because both he that eats and he that does not eat is nonetheless the member of Christ, neither he who does not eat can justly be condemned, neither he who eats be justly condemned: now the first proposition is declared in the sixth verse which follows Ro 14:6.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Meyer's NT Commentary",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 14:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Prohibition for each of the two parties. The self-consciousness of strength misleads into looking down with ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "contempt",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " on the weak; the narrowness of weakness is unable to comprehend the free thinking of the strong one, and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "judges",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "κρινέτω",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] defined by the connection as a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "condemning",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " judgment, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "pronouncing against",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the true Christian character, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 2:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and frequently.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὁ Θεὸς γὰρ κ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "λ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".] ground assigned for ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "μὴ κρινέτω",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; hence ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "αὐτόν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is to be referred to ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τὸν ἐσθίοντα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " him who eats all things), not with Reiche (following Calvin and others) to both, the strong and the weak, against which ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 14:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is also decisive.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "προσελάβετο",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "has taken him to Himself",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", namely, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "into His fellowship",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 14:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") through Christ; not: into His ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "house",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as servant (see on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 14:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), as Vatablus, Reiche, and Hofmann hold.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "In ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὁ Θεὸς γὰρ κ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "λ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". is contained the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "contrariety to God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of this ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "κρίνειν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and its consequent ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "impiety;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 14:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὁ ἐσθίων",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " … ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "μὴ ἐξουθενείτω κ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "λ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Paul passes no sentence on either party, but warns both of the temptations to which they are exposed. He who eats will be inclined to contempt—to sneer at the scruples of the weak as mere prejudice or obscurantism; he who does not eat will be inclined to censoriousness—to pronounce the strong, who uses his liberty, no better than he should be. This censoriousness is forbidden, because ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὁ θεὸς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is emphatic by position) has received the strong into the Church, and therefore his place in it is not to be questioned.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3. It is unmistakable, from all the passages in question, on which side apostolic truth lay. St Paul clearly decides against the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "principle",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of the “weak brethren;” though he treats it as an error which might lawfully and usefully be met by toleration and the quiet influence of tolerant example.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "God hath received him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Lit. ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "God did receive him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; i.e. at the crisis of his conversion; on the sole revealed condition of his accepting and confessing Christ as his Saviour and Lord. Same verb as that in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 14:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "This clause may probably refer to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "both",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the two preceding clauses; but its main reference (see next verse) is to the fact that the “",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "strong",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "” Christian, in spite of his apparent laxity, had been welcomed by God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 14:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "αὐτὸν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "him) who eats",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in faith.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "προσελάβετο",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "hath received",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") [taken to Himself] for example, from among the Gentiles.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Romans 14:3",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Despise (ἐξουθενείτω)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The verb means literally to throw out as nothing. Rev., better, set at nought.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Judge (κρινέτω)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Judgment is assigned to the weak brother, contempt to the stronger. Censoriousness is the peculiar error of the ascetic, contemptuousness of the liberal. A distinguished minister once remarked: \"The weak brother is the biggest bully in the universe!\" Both extremes are allied to spiritual pride.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Hath received (προσελάβετο)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The aorist points to a definite time - when he believed on Christ, though there is still a reference to his present relation to God as determined by the fact of his reception then, which may warrant the rendering by the perfect. ",
        "children": []
      }
    ]
  }
]