[{"num":18,"verse":"A long time passed. Then, in the third year, the word of Adonai came to Eliyahu: “Go, present yourself to Ach’av, and I will send rain down on the land.” "},{"num":2,"verse":"When Eliyahu went to present himself to Ach’av, the famine in Shomron had become severe. "},{"num":3,"verse":"Ach’av called ‘Ovadyah, who was in charge of the palace. Now ‘Ovadyah greatly revered Adonai; "},{"num":4,"verse":"for example, when Izevel was murdering Adonai’s prophets, ‘Ovadyah took a hundred prophets, hid them in two caves, fifty in each, and supplied them with food and water. "},{"num":5,"verse":"Ach’av said to ‘Ovadyah, “Go throughout the land, and check all the springs and vadis; maybe we can find grass somewhere, so that we can keep the horses and mules alive and not lose all the animals.” "},{"num":6,"verse":"So they divided between them the territory to be visited; Ach’av went one way by himself, and ‘Ovadyah went another way by himself."},{"num":7,"verse":"‘Ovadyah was on the road when suddenly Eliyahu encountered him. ‘Ovadyah recognized him, fell on his face and said, “Is it really you, my lord Eliyahu?” "},{"num":8,"verse":"He answered, “Yes, it is I; go, tell your master, ‘Eliyahu is here.’” "},{"num":9,"verse":"‘Ovadyah replied, “How have I sinned, that you would hand your servant over to Ach’av to kill me? "},{"num":10,"verse":"As Adonai your God lives, there can’t be a single nation or kingdom where my master hasn’t sent to search you out; and in each kingdom or nation where they said, ‘He isn’t here,’ he made them take an oath that they hadn’t found you. "},{"num":11,"verse":"Now you say, ‘Go tell your master, “Eliyahu is here.”’ "},{"num":12,"verse":"But as soon as I leave you, the Spirit of Adonai will carry you off to I don’t know where; so that when I come and tell Ach’av, and he can’t find you, he will kill me. But I your servant have revered Adonai from my youth — "},{"num":13,"verse":"wasn’t my lord told what I did when Izevel killed Adonai’s prophets, how I hid a hundred of Adonai’s prophets by fifties in caves and supplied their food and water? "},{"num":14,"verse":"Now you say, ‘Go tell your master, “Look, Eliyahu is here.”’ Why, he’ll kill me!” "},{"num":15,"verse":"Eliyahu said, “As Adonai-Tzva’ot lives, before whom I stand, I will present myself to him today.”"},{"num":16,"verse":"So ‘Ovadyah went, found Ach’av and told him; and Ach’av went to meet Eliyahu. "},{"num":17,"verse":"When Ach’av saw Eliyahu, Ach’av said to him, “Is it really you, you troubler of Isra’el?” "},{"num":18,"verse":"He answered, “I haven’t troubled Isra’el, you have, you and your father’s house, by abandoning Adonai’s mitzvot and following the ba‘alim. "},{"num":19,"verse":"Now order all Isra’el to assemble before me on Mount Karmel, along with the 450 prophets of Ba‘al and the 400 prophets of the asherah who eat at Izevel’s table.”"},{"num":20,"verse":"Ach’av sent word to all the people of Isra’el and assembled the prophets together on Mount Karmel. "},{"num":21,"verse":"Eliyahu stepped forward before all the people and said, “How long are you going to jump back and forth between two positions? If Adonai is God, follow him; but if it’s Ba‘al, follow him!” The people answered him not a word. "},{"num":22,"verse":"Then Eliyahu said to the people, “I, I alone, am the only prophet of Adonai who is left, while Ba‘al’s prophets number 450. "},{"num":23,"verse":"Let them give us two young bulls, and they can choose the bull they want for themselves. Then let them cut it in pieces and lay it on the wood but put no fire under it. I will prepare the other bull, lay it on the wood and put no fire under it. "},{"num":24,"verse":"Then, you, call on the name of your god; and I will call on the name of Adonai; and the God who answers with fire, let him be God!” All the people answered, “Good idea! Agreed!”"},{"num":25,"verse":"Then Eliyahu said to the prophets of Ba‘al, “Choose one bull for yourselves, and prepare it first; because there are many of you. Then call on the name of your god, but put no fire under it.” "},{"num":26,"verse":"They took the bull that was given to them, prepared it and called on the name of Ba‘al from morning till noon — “Ba‘al! Answer us!” But no voice was heard; and no one answered, as they jumped around on the altar they had made. "},{"num":27,"verse":"Around noon Eliyahu began ridiculing them: “Shout louder! After all, he’s a god, isn’t he? Maybe he’s daydreaming, or he’s on the potty, or he’s away on a trip. Maybe he’s asleep, and you have to wake him up.” "},{"num":28,"verse":"So they shouted louder and slashed themselves with swords and knives, as their custom was, until blood gushed out all over them. "},{"num":29,"verse":"By now it was afternoon, and they went on ranting and raving until it was time for the evening offering. But no voice came, no one answered, no one paid any attention."},{"num":30,"verse":"Then Eliyahu said to all the people, “Come here to me.” All the people came up to him, as he set about repairing the altar of Adonai that had been broken down. "},{"num":31,"verse":"Eliyahu took twelve stones, in keeping with the number of tribes of the sons of Ya‘akov, to whom the word of Adonai had come, saying, “Your name is to be Isra’el.” "},{"num":32,"verse":"With the stones he built an altar in the name of Adonai. Then he dug a trench around the altar large enough for half a bushel of grain. "},{"num":33,"verse":"He arranged the wood, cut up the bull and laid it on the wood. "},{"num":34,"verse":"Then he said, “Fill four pots with water, and pour it on the burnt offering and on the wood.” They did it. “Do it again,” he said, and they did it again. “Do it a third time,” he said, and they did it a third time. "},{"num":35,"verse":"By now the water was flowing around the altar, and it had filled the trench. "},{"num":36,"verse":"Then, when it came time for offering the evening offering, Eliyahu the prophet approached and said, “Adonai, God of Avraham, Yitz’chak and Isra’el, let it be known today that you are God in Isra’el, and that I am your servant, and that I have done all these things at your word. "},{"num":37,"verse":"Hear me, Adonai, hear me, so that this people may know that you, Adonai, are God, and that you are turning their hearts back to you.”"},{"num":38,"verse":"Then the fire of Adonai fell. It consumed the burnt offering, the wood, the stones and the dust; and it licked up the water in the trench. "},{"num":39,"verse":"When all the people saw it, they fell on their faces and said, “Adonai is God! Adonai is God!” "},{"num":40,"verse":"Eliyahu said to them, “Seize the prophets of Ba‘al! Don’t let one of them escape!” They seized them; and Eliyahu brought them down to Vadi Kishon and killed them there."},{"num":41,"verse":"Then Eliyahu said to Ach’av, “Get up, eat, and drink, because I hear the sound of heavy rain.” "},{"num":42,"verse":"Ach’av went up to eat and drink, while Eliyahu went up to the top of the Karmel. He bowed down to the ground and put his face between his knees. "},{"num":43,"verse":"“Now,” he said to his servant, “go up, and look out toward the sea.” He went up, looked, and said, “There’s nothing there.” Seven times he said, “Go again.” "},{"num":44,"verse":"The seventh time, the servant said, “Now there’s a cloud coming up out of the sea, no bigger than a man’s hand.” Eliyahu said, “Go up, and say to Ach’av, ‘Prepare your chariot, and get down the mountain before the rain stops you!” "},{"num":45,"verse":"A little later, the sky grew black with clouds and wind; and heavy rain began falling; as Ach’av, riding in his chariot, made for Yizre‘el. "},{"num":46,"verse":"The hand of Adonai was on Eliyahu; he tucked up his clothing and ran ahead of Ach’av to the entrance of Yizre‘el."}]