[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(1) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "That they should kill David.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The literal translation of the original gives a much better sense: “that he intended to kill David,” or “about killing David.” The latter is the rendering of the LXX. and the Syriac. The murderous impulse of the unhappy Saul gradually increased in intensity. First, it showed itself only in the paroxysms of insanity, when the half distraught king would grasp and poise his heavy spear, as though he would hurl it at the kindly musician as he tried to calm the troubled spirit. Then it would plot and scheme against the hated life, trying to involve this young soldier in some enterprise fraught with deadly peril. Now he speaks openly to his heir and his counsellors of the risk incurred by suffering so dangerous a man to live.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1 Samuel 19:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 19:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Saul spake to Jonathan, and all his servants — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "When he could not destroy David by craft, he declares open enmity to him; and commands his son and his whole court to make him away; some of whom he thought would obey him. It is strange he should speak to Jonathan to murder David, if he knew the friendship he had for him; and he could not well be ignorant of it, since he had so publicly declared it, as we read chap. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 18:3-4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". But he imagined his love to a father would overcome his love to a friend; and there was a great providence of God in his disclosing his mind so freely to Jonathan, as by that means David came to be certainly informed of his danger.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "19:1-10 How forcible are right words! Saul was, for a time, convinced of the unreasonableness of his enmity to David; but he continued his malice against David. So incurable is the hatred of the seed of the serpent against that of the woman; so deceitful and desperately wicked is the heart of man without the grace of God, Jer 17:9.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The days were not expired - David was so rapid in his attack upon the Philistines that he was able to bring the required dowry within the time, and to receive his wife (Michal), before the time had expired within which he was to receive Merab. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "CHAPTER 19",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1Sa 19:1-7. Jonathan Discloses His Father's Purpose to Kill David.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. Saul spake to Jonathan his son, and to all his servants, that they should kill David—The murderous design he had secretly cherished he now reveals to a few of his intimate friends. Jonathan was among the number. He prudently said nothing at the time, but secretly apprised David of his danger; and waiting till the morning, when his father's excited temper would be cooled, he stationed his friend in a place of concealment, where, overhearing the conversation, he might learn how matters really stood and take immediate flight, if necessary.Saul purposeth to kill David; Jonathan discloseth it; speaketh in his behalf to Saul, who sweareth not to kill him; he returneth to court,  1 Samuel 19:1-7. By reason of his success in a new war, Saul again seeketh to kill him; Michal acquainteth him with it; he flieth; she deceiveth her father,  1 Samuel 19:8-17. David cometh to Samuel at Ramah; Saul sendeth messengers twice to apprehend him; they both prophesy,  1 Samuel 19:18-21. He goeth himself thither, and prophesieth likewise,  1 Samuel 19:22-24.  Saul spake to Jonathan;  whom, though lately engaged in a league of friendship with David, he thought to oblige to it by sense of his own interest, as being the next heir of the crown, and likely to suffer most by David’s advancement. And to all his servants: what before he secretly designed, now he openly and impudently avowed. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "1. Saul spake to Jonathan his son, and to all his servants, that they should kill David—The murderous design he had secretly cherished he now reveals to a few of his intimate friends. Jonathan was among the number. He prudently said nothing at the time, but secretly apprised David of his danger; and waiting till the morning, when his father's excited temper would be cooled, he stationed his friend in a place of concealment, where, overhearing the conversation, he might learn how matters really stood and take immediate flight, if necessary.Saul purposeth to kill David; Jonathan discloseth it; speaketh in his behalf to Saul, who sweareth not to kill him; he returneth to court, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bldvs",
            "text": " 1 Samuel 19:1-7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". By reason of his success in a new war, Saul again seeketh to kill him; Michal acquainteth him with it; he flieth; she deceiveth her father, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bldvs",
            "text": " 1 Samuel 19:8-17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". David cometh to Samuel at Ramah; Saul sendeth messengers twice to apprehend him; they both prophesy, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bldvs",
            "text": " 1 Samuel 19:18-21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". He goeth himself thither, and prophesieth likewise, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bldvs",
            "text": " 1 Samuel 19:22-24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Saul spake to Jonathan; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " whom, though lately engaged in a league of friendship with David, he thought to oblige to it by sense of his own interest, as being the next heir of the crown, and likely to suffer most by David’s advancement. ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "And to all his servants:",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " what before he secretly designed, now he openly and impudently avowed. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Saul spake to Jonathan his son,.... Who was heir to his crown; and though he knew he loved David, and was in strict friendship with him, yet he might hope, that as his succession to the kingdom was in danger, as he thought, and that David was his rival in it, his mind would be alienated from him; and that he would listen rather to a father than a friend, and would see where his true interest lay, and abandon David, yea, seek his ruin, which Saul was intent upon ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and to all his servants; who yet pretended to love David, and as he himself said they did, and some of them might; with these he might rather hope to succeed, as they were attached to him, and might be secretly enemies of David, and therefore to these, as well as to his son, he spake, and gave his orders: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that they should kill David; as if he was a traitor, and an usurper of his throne, and one that had a design upon that, and upon his life; finding he could do nothing by the schemes, and snares, and stratagems, he used in a private manner, he grew outrageous and furious, and openly declared his views, and laid his injunctions on his son and servants to take away David's life, as a very dangerous person to his crown and government. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "that they should kill David; as if he was a traitor, and an usurper of his throne, and one that had a design upon that, and upon his life; finding he could do nothing by the schemes, and snares, and stratagems, he used in a private manner, he grew outrageous and furious, and openly declared his views, and laid his injunctions on his son and servants to take away David's life, as a very dangerous person to his crown and government. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Saul spake to Jonathan his son, and to all his servants, that they should {a} kill David.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And Saul spake to Jonathan his son, and to all his servants, that they should ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{a}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " kill David.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) Before Saul sought David's life secretly, but now his hypocrisy grows to open cruelty.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 19:1-7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Jonathan’s intercession with his father on David’s behalf",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Saul spake",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.] Perhaps in some outburst of passion like Henry the Second’s against Thomas à Becket. No definite command seems to have been given.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 1.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Saul spake to Jonathan his son...that they should kill David.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The translation of the last clause is untenable; it really means \"about killing David,\" and so both the Septuagint and the Syriac render it. The descent of men once full of noble impulses, as was the case with Saul, into open crime is gradual, and with many halts on the way. Saul first gave way to envy, and instead of struggling against his bad feelings, nourished them. Then, when scarcely accountable for his actions, he threatened David's life; and next, with growing malice, encouraged him in dangerous undertakings, in the hope that in one of them he might be slain. And now he goes one step farther. He talks to Jonathan and his officers concerning the many reasons there were for David's death; argues that without it there will be no security for himself and his dynasty; represents David probably as a traitor, with secret purposes of usurping the throne; and reveals what hitherto had been but the half-formed wishes of his heart. But even now, probably, he still spoke of David's death as a painful necessity, and had many misgivings in his own mind. But he was really encouraging himself in crime, and by cherishing thoughts of murder he was gradually descending towards the dark abyss into which he finally fell. 1 Samuel 19:1",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Jonathan warded off the first outbreak of deadly enmity on the part of Saul towards David. When Saul spoke to his son Jonathan and all his servants about his intention to kill David (את־דּוד להמית, i.e., not that they should kill David, but \"that he intended to kill him\"), Jonathan reported this to David, because he was greatly attached to him, and gave him this advice: \"Take heed to thyself in the morning; keep thyself in a secret place, and hide thyself. I will go out and stand beside my father in the field where thou art, and I will talk to my father about thee (בּ דּבּר, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 6:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 87:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc., to talk of or about a person), and see what (sc., he will say), and show it to thee.\" David was to conceal himself in the field near to where Jonathan would converse with his father about him; not that he might hear the conversation in his hiding-place, but that Jonathan might immediately report to him the result of his conversation, without there being any necessity for going far away from his father, so as to excite suspicion that he was in league with David. ",
        "children": []
      }
    ]
  }
]