[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1 Samuel 19:11",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 19:11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "To slay him in the morning — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "As he went out of the door of his house. By this it is apparent, when Saul missed his blow, he was the more enraged, and implacably pursued David’s destruction. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And Michal, David’s wife, told him — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "She had intelligence either from her brother Jonathan, or some other friend at court: or, perhaps, she saw suspicious persons hovering about the house.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "19:11-24 Michal's stratagem to gain time till David got to a distance was allowable, but her falsehood had not even the plea of necessity to excuse it, and manifests that she was not influenced by the same spirit of piety which had dictated Jonathan's language to Saul. In flying to Samuel, David made God his refuge. Samuel, as a prophet, was best able to advise him what to do in this day of distress. He met with little rest or satisfaction in Saul's court, therefore went to seek it in Samuel's church. What little pleasure is to be had in this world, those have who live a life of communion with God; to that David returned in the time of trouble. So impatient was Saul after David's blood, so restless against him, that although baffled by one providence after another, he could not see that David was under the special protection of God. And when God will take this way to protect David, even Saul prophesies. Many have great gifts, yet no grace; they may prophesy in Christ's name, yet are disowned by him. Let us daily seek for renewing grace, which shall be in us as a well of water springing up into everlasting life. Let us cleave to truth and holiness with full purpose of heart. In every danger and trouble, let us seek protection, comfort, and direction in God's ordinances.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Saul's plan was to surround the house at night, and to have David killed as soon as he came abroad unsuspectingly in the morning. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11, 12. Saul sent messengers unto David's house, to watch him, and to slay him—The fear of causing a commotion in the town, or favoring his escape in the darkness, seemed to have influenced the king in ordering them to patrol till the morning. This infatuation was overruled by Providence to favor David's escape; for his wife, secretly apprised by Jonathan, who was aware of the design, or by spying persons in court livery watching the gate, let him down through a window (see on [247]Jos 2:15).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "To slay him in the morning:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " why not in the night? ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Answ.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Partly, because it would have been barbarous, and most dishonourable to Saul, to break into David’s house by night, and kill him in his own house and bed; and it seemed more expedient to kill him as he came out of his house in the morning; partly, because the night might give David some opportunity of escaping, which the day-light would prevent; and principally, by God’s singular providence, infatuating Saul’s mind to take the worst course, that David might be delivered from him. Tomorrow thou shalt be slain; which she might learn, either by information from Jonathan, or some other courtier that was privy to rite design; or from her own observation of some suspicious or dangerous persons hovering about the house. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Saul sent messengers unto David's house,.... Supposing that he was gone thither; where this was is not said, very likely in Gibeah, where Saul lived: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "to watch him; that he might not get out from thence in the night: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and to slay him in the morning; the reason why he did not order them to break into the house, and slay him at once, but wait till morning, seems to be, lest should he be alarmed by their breaking in, he might take the advantage of the night, and easily escape, or another person through mistake might be slain for him; and therefore, that they might be sure of him, they were to watch till it was broad daylight, when they could not well miss him. Josephus (d) says, the orders to watch him until morning were, that he might be taken and brought to a court of judicature, and be condemned and put to death, which was usually held in a morning; but Saul's orders to the messengers were to put him to death themselves, and he had no notion of dealing with him according to a formal process of judgment: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and Michal, David's wife, told him, saying, if thou save not thy life tonight, tomorrow thou shalt be slain; meaning, if he did not take the benefit and advantage of the night to make his escape, he would not be able to do it in the morning; the house being so beset, as she perceived, by persons whom she might suspect were sent by Saul to destroy him, knowing the ill will her father bore to him, or a messenger at the same time might be dispatched to her, either from her brother Jonathan, or from one of her friends at court, acquainting her with the design against David, and the danger he was in. Upon this occasion David penned the fifty ninth psalm, see Psalm 59:1. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and Michal, David's wife, told him, saying, if thou save not thy life tonight, tomorrow thou shalt be slain; meaning, if he did not take the benefit and advantage of the night to make his escape, he would not be able to do it in the morning; the house being so beset, as she perceived, by persons whom she might suspect were sent by Saul to destroy him, knowing the ill will her father bore to him, or a messenger at the same time might be dispatched to her, either from her brother Jonathan, or from one of her friends at court, acquainting her with the design against David, and the danger he was in. Upon this occasion David penned the fifty ninth psalm, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 59:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(d) Antiqu. l. 6. c. 11. sect. 4. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(d) Antiqu. l. 6. c. 11. sect. 4. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Saul also sent messengers unto David's house, to watch him, and to slay him in the morning: and Michal David's wife told him, saying, If thou save not thy life to night, to morrow thou shalt be slain.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in the morning",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] As he left his house. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jdg 16:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". “We may guess that only the fear of alarming the town, and of rousing the people to rescue their favourite hero, prevented him from directing them to break into the house, and to slay David there.” Kitto’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Bibl. Illustr",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Psalms 59 is referred by its title to the present occasion. If this is correct, the Psalm supplements the history, shewing that David was in danger not from Saul only, but from ruffians among Saul’s followers who prowled about the streets of Gibeah threatening his life.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1 Samuel 19:11",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "\"Saul sent messengers to David's house,\" to which David had first fled, \"to watch him (that he might not get away again), and to put him to death in the (next) morning.\" Michal made him acquainted with this danger, and then let him down through the window, so that he escaped. The danger in which David was at that time is described by him in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 59",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", from which we may see how Saul was surrounded by a number of cowardly courtiers, who stirred up his hatred against David, and were busily engaged in getting the dreaded rival out of the way. ",
        "children": []
      }
    ]
  }
]