[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(20) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The company of the prophets.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—(On the general question of this company of prophets see ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Excursus ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "H, at the end of this Book.) The Hebrew word rendered “company” occurs only in this place, but the ancient versions agree in rendering it “company,” or “assembly.” The Chaldee paraphrases here “they saw the company of the scribes praising, and Samuel standing over them teaching.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And they also prophesied.—Like so much that happened among the chosen people during their eventful trial period, the circumstance here related does not belong to ordinary natural experience. The words which immediately precede suggest the only possible explanation of the strange occurrence: “The Spirit of God was upon these messengers of Saul.” Ewald thus graphically paraphrases the Biblical record of this scene:—“It is related of those who started with the most hostile intentions against the prophets and their pupils, that as they approached they suddenly stood still, spell-bound by the music and solemn dance of the devotees; then, more and more powerfully drawn by the same Spirit into the charmed circle, they broke forth into similar words and gestures; and then, flinging away their upper garments, they joined in the dance and the music, and sinking down into ecstatic quivering, utterly forgot the hostile spirit in which they had come. . . . The same thing befell fresh messengers a second, nay, a third time. Then Saul himself, enraged, rushed to Ramah, . . . and as he looked down from the hill upon the school, and heard the loud pealing songs rising from it, he was seized by the Divine Spirit; and when he at last reached the spot he sank into the same condition of enthusiasm still more deeply than all the messengers whom he had previously despatched.”",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "And they also prophesied.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Like so much that happened among the chosen people during their eventful trial period, the circumstance here related does not belong to ordinary natural experience. The words which immediately precede suggest the only possible explanation of the strange occurrence: “The Spirit of God was upon these messengers of Saul.” Ewald thus graphically paraphrases the Biblical record of this scene:—“It is related of those who started with the most hostile intentions against the prophets and their pupils, that as they approached they suddenly stood still, spell-bound by the music and solemn dance of the devotees; then, more and more powerfully drawn by the same Spirit into the charmed circle, they broke forth into similar words and gestures; and then, flinging away their upper garments, they joined in the dance and the music, and sinking down into ecstatic quivering, utterly forgot the hostile spirit in which they had come. . . . The same thing befell fresh messengers a second, nay, a third time. Then Saul himself, enraged, rushed to Ramah, . . . and as he looked down from the hill upon the school, and heard the loud pealing songs rising from it, he was seized by the Divine Spirit; and when he at last reached the spot he sank into the same condition of enthusiasm still more deeply than all the messengers whom he had previously despatched.”",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1 Samuel 19:20",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 19:20",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Saul sent messengers to take David — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "His implacable hatred had abolished all respect and reverence for Samuel, (under whose protection David now was,) and for the college of the prophets, which was a kind of sanctuary to those that fled to it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Samuel standing as appointed over them — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "To instruct and direct them in their holy exercises. For though they prophesied by divine inspiration, yet they were both to prepare themselves for it beforehand, and to make good improvement of it afterward, in both which they needed Samuel’s counsel and assistance. And whereas some might falsely pretend to those raptures, or the devil might transform himself into an angel of light, Samuel’s presence and judgment were necessary to prevent and to detect such impostures. Besides, Samuel would, by his present conjunction with them in those holy exercises, encourage them, and stir up others to the coveting of those gifts, and to the performance of such religious duties. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The Spirit of God was upon the messengers of Saul — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That, being rapt up into an ecstasy, and no longer masters of themselves, their minds might be wholly taken off from their design of seizing David. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "They prophesied — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Praised God in hymns, by a sudden impulse, which they could not resist.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "19:11-24 Michal's stratagem to gain time till David got to a distance was allowable, but her falsehood had not even the plea of necessity to excuse it, and manifests that she was not influenced by the same spirit of piety which had dictated Jonathan's language to Saul. In flying to Samuel, David made God his refuge. Samuel, as a prophet, was best able to advise him what to do in this day of distress. He met with little rest or satisfaction in Saul's court, therefore went to seek it in Samuel's church. What little pleasure is to be had in this world, those have who live a life of communion with God; to that David returned in the time of trouble. So impatient was Saul after David's blood, so restless against him, that although baffled by one providence after another, he could not see that David was under the special protection of God. And when God will take this way to protect David, even Saul prophesies. Many have great gifts, yet no grace; they may prophesy in Christ's name, yet are disowned by him. Let us daily seek for renewing grace, which shall be in us as a well of water springing up into everlasting life. Let us cleave to truth and holiness with full purpose of heart. In every danger and trouble, let us seek protection, comfort, and direction in God's ordinances.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Samuel standing as appointed - Rather, \"as Overseer, or leader.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1Sa 19:18-23. David Flees to Samuel.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "18-23. David fled, … and came to Samuel to Ramah—Samuel was living in great retirement, superintending the school of the prophets, established in the little hamlet of Naioth, in the neighborhood of Ramah. It was a retreat congenial to the mind of David; but Saul, having found out his asylum, sent three successive bodies of men to apprehend him. The character of the place and the influence of the sacred exercises produced such an effect on them that they were incapable of discharging their commission, and were led, by a resistless impulse, to join in singing the praises of God. Saul, in a fit of rage and disappointment, determined to go himself. But, before reaching the spot, his mental susceptibilities were roused even more than his messengers, and he was found, before long, swelling the ranks of the young prophets. This singular change can be ascribed only to the power of Him who can turn the hearts of men even as the rivers of water.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Saul sent messengers to take David:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " thus Saul’s wickedness and fury increased; and he that at first used only secret practices against David, now breaks forth into open and impudent hostilities; plainly declaring that he neither feared God nor reverenced man. He would have punished Samuel, as afterwards he did Abimelech, for giving David entertainment, but that he feared the people, who had so great and unanimous a veneration for him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Prophesying, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. speaking of God, or of the things of God, by Divine inspiration; either praising God, or instructing men. Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Numbers 11:25 1 Samuel 10:5",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 11:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 10:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Appointed over them, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to instruct, moderate, and direct them in those holy exercises. For though they prophesied by Divine inspiration, which Samuel could not govern; yet they were both to prepare and dispose themselves for it beforehand, and to make good improvement of it afterwards, in both which they needed Samuel’s counsel and assistance. And whereas some might falsely pretend to those raptures, or the devil might transform himself into an angel of light, and convey some evil or false suggestions into some of their minds, Samuel’s presence and judgment was necessary to prevent and to detect such impostures. Besides, Samuel would by his present conjunction with them in those holy exercises encourage them, and stir up others to the coveting of those gifts, and the performance of such religious duties. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "They also prophesied; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " being inspired by God to do so, as wicked Balaam also was; that, being rapt up into such an ecstasy, their minds might be wholly taken up with those matters, and quite taken off from their design of seizing David. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Saul sent messengers to take David,.... Notwithstanding the sacred place he was in, so bent was he upon his destruction: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and when they saw the company of the prophets prophesying; or praising, as the Targum; singing hymns and songs of praise to God, under the inspiration and influence of the Spirit of God, who endited these songs for them, and excited them to sing them; these prophets belonged to the school or college of prophets at Naioth, whom the messengers saw when they came thither, and found them thus employed; or \"when he saw\" (m), for the word is singular, that is, the chief of the messengers, or everyone of them, so Kimchi: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and Samuel standing as appointed over them; he was president of the college, and he stood to instruct and teach them in the knowledge of divine things: so the Targum,\"standing, teaching over them or by them,''and to direct and assist them in singing their songs of praise: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the Spirit of the Lord was upon the messengers of Saul, and they also prophesied: or praised, as the Targum; sung hymns and songs of praise as the prophets did, and were so taken up with these religious exercises, that they forgot, or were inattentive to the business they were sent to do. Ben Gersom thinks they foretold things to come, and so Abarbinel; and particularly that they prophesied that David should rule over all Israel, and that God would not suffer Saul to slay him; and so were indifferent to, and negligent of doing the errand they were sent on, yea, purposely avoided it. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(m) \"et vidit\", Montanus, Vatablus, Tigurine version; \"et vidit quisque vel unusquisque illorum\", Junius & Tremellius, Piscator. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(m) \"et vidit\", Montanus, Vatablus, Tigurine version; \"et vidit quisque vel unusquisque illorum\", Junius & Tremellius, Piscator. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Saul sent messengers to take David: and when they saw the company of the prophets prophesying, and Samuel standing {h} as appointed over them, the Spirit of God was upon the messengers of Saul, and they also {i} prophesied.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And Saul sent messengers to take David: and when they saw the company of the prophets prophesying, and Samuel standing ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{h}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "as",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " appointed over them, the Spirit of God was upon the messengers of Saul, and they also ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{i}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " prophesied.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(h) Being their chief instructor.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(i) Changed their minds and praised God.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "prophets prophesying",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Some common religious exercise conducted by Samuel, who is described as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "standing as president",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " over the prophets, is meant by “prophesying.” See on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 10:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Targum paraphrases: “They saw the company of scribes praising, and Samuel standing as instructor over them.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1 Samuel 19:20",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "When Saul was told where this place was, he sent messengers to fetch David. But as soon as the messengers saw the company of prophets prophesying, and Samuel standing there as their leader, the Spirit of God came upon them, so that they also prophesied. The singular ויּרא is certainly very striking here; but it is hardly to be regarded as merely a copyist's error for the plural ויּראוּ, because it is extremely improbable that such an error as this should have found universal admission into the MSS; so that it is in all probability to be taken as the original and correct reading, and understood either as relating to the leader of the messengers, or as used because the whole company of messengers were regarded as one body. The ἁπ. λεγ. להקה signifies, according to the ancient versions, an assembly, equivalent to קהלה, from which it arose according to Kimchi and other Rabbins by simple inversion.",
        "children": []
      }
    ]
  }
]