[{"header":"Instructions for the Coming of the Kingdom[a]"},{"header":"Chapter 24"},{"num":1,"verse":"Jesus Announces the Destruction of the Temple. As Jesus left the temple and was walking away, his disciples came up to him to call his attention to the buildings of the temple."},{"num":2,"verse":"He thereupon said to them, “Do you see all these? Amen, I say to you, not one stone here will be left upon another; every one will be thrown down.”"},{"num":3,"verse":"The End Has Not Yet Come. As he was sitting on the Mount of Olives, the disciples approached and spoke to him when they were alone. “Tell us,” they said, “when will this happen, and what will be the sign of your coming and of the end of the age?”"},{"num":4,"verse":"Jesus answered them, “Take care that no one deceives you."},{"num":5,"verse":"For many will come in my name, saying, ‘I am the Christ,’ and they will lead many astray."},{"num":6,"verse":"You will hear of wars and rumors of wars. Do not be alarmed, for those things are bound to happen, but the end is still to come."},{"num":7,"verse":"For nation will rise against nation and kingdom against kingdom, and there will be famines and earthquakes in various places."},{"num":8,"verse":"All these are only the beginning of the labor pains."},{"num":9,"verse":"“Then you will be handed over to be tortured and put to death, and you will be hated by all nations because of my name."},{"num":10,"verse":"At that time, many will fall away from the faith; they will betray and hate one another."},{"num":11,"verse":"Many false prophets will appear and lead many astray,"},{"num":12,"verse":"and with the increase of lawlessness, the love of many will grow cold."},{"num":13,"verse":"But whoever endures to the end will be saved."},{"num":14,"verse":"And the good news of the kingdom will be proclaimed throughout the entire world as a testimony offered to all the nations. And then the end will come."},{"num":15,"verse":"The Great Trial.“Therefore, when you see the abomination of desolation, about which the prophet Daniel spoke, standing in the Holy Place (let the reader understand),"},{"num":16,"verse":"then those who are in Judea must flee to the mountains,"},{"num":17,"verse":"the one who is standing on the roof must not come down to collect what is in his house,"},{"num":18,"verse":"and someone who is in the field must not turn back to retrieve his coat."},{"num":19,"verse":"“Woe to those who are pregnant and to those who are nursing infants in those days!"},{"num":20,"verse":"Pray that you will not have to take flight in the winter or on a Sabbath."},{"num":21,"verse":"For at that time there will be great suffering that has not been equaled since the beginning of the world until now, and will never again be duplicated."},{"num":22,"verse":"And if those days had not been cut short, no one would be saved; but for the sake of the elect they will be shortened."},{"num":23,"verse":"False Messiahs and False Prophets.“Therefore, if anyone says to you, ‘Look, here is the Christ,’ or ‘There he is,’ do not believe it."},{"num":24,"verse":"For false christs and false prophets will arise, and they will perform great signs and wonders that are impressive enough to deceive even the elect, if that were possible."},{"num":25,"verse":"“Remember, I have forewarned you about this."},{"num":26,"verse":"So if anyone says to you, ‘Behold, he is in the wilderness,’ do not go out there. If they say, ‘Behold, he is in the inner rooms,’ do not believe it."},{"num":27,"verse":"For just as lightning comes from the east and is visible even in the west, so will the coming of the Son of Man be."},{"num":28,"verse":"Wherever the corpse is, there the vultures will gather."},{"num":29,"verse":"The Coming of the Son of Man.“Immediately after the distress of those days,"},{"num":30,"verse":"“Then the sign of the Son of Man will appear in heaven, and all the peoples of the earth will mourn, and they will see the Son of Man coming on the clouds of heaven with power and great glory."},{"num":31,"verse":"And he will send forth his angels with a trumpet blast, and they will gather his elect from the four winds, from one end of the heavens to the other."},{"header":"Be Vigilant in Expectation of the End[h]"},{"num":32,"verse":"The Parable of the Fig Tree.“Learn this lesson from the fig tree. As soon as its twigs become tender and its leaves begin to sprout, you know that summer is near."},{"num":33,"verse":"In the same way, when you see all these things take place, know that he is near, at the very gates."},{"num":34,"verse":"Amen, I say to you, this generation will not pass away until all these things have taken place."},{"num":35,"verse":"Heaven and earth will pass away, but my words will never pass away."},{"num":36,"verse":"The Day and Hour Unknown.“As for the exact day and hour, no one knows, neither the angels in heaven, nor the Son, but only the Father."},{"num":37,"verse":"For as it was in the days of Noah, so will it be at the coming of the Son of Man."},{"num":38,"verse":"In the days before the flood, people were eating and drinking, marrying and being given in marriage, up to the day that Noah entered the ark."},{"num":39,"verse":"They knew nothing about what would happen until the flood came and swept them all away."},{"num":43,"verse":"The Parable of the Owner of the House.“But keep this in mind: if the owner of the house had known at what time of night the thief was coming, he would have stayed awake and not allowed his house to be broken into."},{"num":44,"verse":"Therefore, you must also be prepared, because the Son of Man will come at an hour when you do not expect him."},{"num":45,"verse":"The Parable of the Faithful Servant.“Who, then, is the faithful and wise servant whom his master has put in charge of his household to give its members their food at the proper time?"},{"num":46,"verse":"Blessed is that servant if his master finds him doing so when he returns home."},{"num":47,"verse":"Amen, I say to you, he will put him in charge of all his property."},{"num":48,"verse":"“But if that servant is wicked and says to himself, ‘My master is detained,’"},{"num":49,"verse":"and he proceeds to beat his fellow servants and eats and drinks with drunkards,"},{"num":50,"verse":"the master of that servant will return on a day when he does not expect him and at an hour he does not know."},{"num":51,"verse":"He will punish him and assign him a place with the hypocrites, where there will be weeping and gnashing of teeth."}]