[{"header":"When the Temple Will Be Destroyed and the Signs of the End"},{"num":24,"verse":"Jesus left the temple. He was walking away when his disciples came up to him. They wanted to call his attention to the temple buildings. "},{"num":2,"verse":"“Do you see all these things?” Jesus asked. “What I’m about to tell you is true. Not one stone here will be left on top of another. Every stone will be thrown down.”"},{"num":3,"verse":"Jesus was sitting on the Mount of Olives. There the disciples came to him in private. “Tell us,” they said. “When will this happen? And what will be the sign of your coming? What will be the sign of the end?”"},{"num":4,"verse":"Jesus answered, “Keep watch! Be careful that no one fools you. "},{"num":5,"verse":"Many will come in my name. They will claim, ‘I am the Messiah!’ They will fool many people. "},{"num":6,"verse":"You will hear about wars. You will also hear people talking about future wars. Don’t be alarmed. Those things must happen. But the end still isn’t here. "},{"num":7,"verse":"Nation will fight against nation. Kingdom will fight against kingdom. People will go hungry. There will be earthquakes in many places. "},{"num":8,"verse":"All these are the beginning of birth pains."},{"num":9,"verse":"“Then people will hand you over to be treated badly and killed. All nations will hate you because of me. "},{"num":10,"verse":"At that time, many will turn away from their faith. They will hate each other. They will hand each other over to their enemies. "},{"num":11,"verse":"Many false prophets will appear. They will fool many people. "},{"num":12,"verse":"Because evil will grow, most people’s love will grow cold. "},{"num":13,"verse":"But the one who remains strong in the faith will be saved. "},{"num":14,"verse":"This good news of the kingdom will be preached in the whole world. It will be a witness to all nations. Then the end will come."},{"num":15,"verse":"“The prophet Daniel spoke about ‘the hated thing that destroys.’ (Daniel 9:27; 11:31; 12:11) Someday you will see it standing in the holy place. The reader should understand this. "},{"num":16,"verse":"Then those who are in Judea should escape to the mountains. "},{"num":17,"verse":"No one on the housetop should go down into the house to take anything out. "},{"num":18,"verse":"No one in the field should go back to get their coat. "},{"num":19,"verse":"How awful it will be in those days for pregnant women! How awful for nursing mothers! "},{"num":20,"verse":"Pray that you will not have to escape in winter or on the Sabbath day. "},{"num":21,"verse":"There will be terrible suffering in those days. It will be worse than any other from the beginning of the world until now. And there will never be anything like it again."},{"num":22,"verse":"“If the time had not been cut short, no one would live. But because of God’s chosen people, it will be shortened. "},{"num":23,"verse":"At that time someone may say to you, ‘Look! Here is the Messiah!’ Or, ‘There he is!’ Do not believe it. "},{"num":24,"verse":"False messiahs and false prophets will appear. They will do great signs and miracles. They will try to fool God’s chosen people if possible. "},{"num":25,"verse":"See, I have told you ahead of time."},{"num":26,"verse":"“So if anyone tells you, ‘He is a long way out in the desert,’ do not go out there. Or if anyone says, ‘He is deep inside the house,’ do not believe it. "},{"num":27,"verse":"Lightning that comes from the east can be seen in the west. It will be the same when the Son of Man comes. "},{"num":28,"verse":"The vultures will gather wherever there is a dead body."},{"num":29,"verse":"“Right after the terrible suffering of those days,"},{"num":30,"verse":"“Then the sign of the Son of Man will appear in heaven. At that time, all the peoples of the earth will mourn. They will mourn when they see the Son of Man coming on the clouds of heaven. He will come with power and great glory. "},{"num":31,"verse":"He will send his angels with a loud trumpet call. They will gather his chosen people from all four directions. They will bring them from one end of the heavens to the other."},{"num":32,"verse":"“Learn a lesson from the fig tree. As soon as its twigs get tender and its leaves come out, you know that summer is near. "},{"num":33,"verse":"In the same way, when you see all these things happening, you know that the end is near. It is right at the door. "},{"num":34,"verse":"What I’m about to tell you is true. The people living now will certainly not pass away until all these things have happened. "},{"num":35,"verse":"Heaven and earth will pass away. But my words will never pass away."},{"header":"The Day and Hour Are Not Known"},{"num":36,"verse":"“But no one knows about that day or hour. Not even the angels in heaven know. The Son does not know. Only the Father knows. "},{"num":37,"verse":"Remember how it was in the days of Noah. It will be the same when the Son of Man comes. "},{"num":38,"verse":"In the days before the flood, people were eating and drinking. They were getting married. They were giving their daughters to be married. They did all those things right up to the day Noah entered the ark. "},{"num":39,"verse":"They knew nothing about what would happen until the flood came and took them all away. That is how it will be when the Son of Man comes. "},{"num":40,"verse":"Two men will be in the field. One will be taken and the other left. "},{"num":41,"verse":"Two women will be grinding with a hand mill. One will be taken and the other left."},{"num":42,"verse":"“So keep watch. You do not know on what day your Lord will come. "},{"num":43,"verse":"You must understand something. Suppose the owner of the house knew what time of night the robber was coming. Then he would have kept watch. He would not have let his house be broken into. "},{"num":44,"verse":"So you also must be ready. The Son of Man will come at an hour when you don’t expect him."},{"num":45,"verse":"“Suppose a master puts one of his slaves in charge of the other slaves in his house. The slave’s job is to give them their food at the right time. The master wants a faithful and wise slave for this. "},{"num":46,"verse":"It will be good for the slave if the master finds him doing his job when the master returns. "},{"num":47,"verse":"What I’m about to tell you is true. The master will put that slave in charge of everything he owns. "},{"num":48,"verse":"But suppose that slave is evil. Suppose he says to himself, ‘My master is staying away a long time.’ "},{"num":49,"verse":"Suppose he begins to beat the other slaves. And suppose he eats and drinks with those who drink too much. "},{"num":50,"verse":"The master of that slave will come back on a day the slave doesn’t expect him. He will return at an hour the slave does not know. "},{"num":51,"verse":"Then the master will cut him to pieces. He will send him to the place where pretenders go. There people will weep and grind their teeth."}]