[{"header":"Healing and forgiveness"},{"num":2,"verse":"After a few days, Jesus went back to Capernaum, and people heard that he was at home."},{"num":2,"verse":"So many gathered that there was no longer space, not even near the door. Jesus was speaking the word to them."},{"num":3,"verse":"Some people arrived, and four of them were bringing to him a man who was paralyzed."},{"num":4,"verse":"They couldn’t carry him through the crowd, so they tore off part of the roof above where Jesus was. When they had made an opening, they lowered the mat on which the paralyzed man was lying."},{"num":5,"verse":"When Jesus saw their faith, he said to the paralytic, “Child, your sins are forgiven!”"},{"num":6,"verse":"Some legal experts were sitting there, muttering among themselves,"},{"num":7,"verse":"“Why does he speak this way? He’s insulting God. Only the one God can forgive sins.”"},{"num":8,"verse":"Jesus immediately recognized what they were discussing, and he said to them, “Why do you fill your minds with these questions?"},{"num":9,"verse":"Which is easier—to say to a paralyzed person, ‘Your sins are forgiven,’ or to say, ‘Get up, take up your bed, and walk’?"},{"num":10,"verse":"But so you will know that the Human One has authority on the earth to forgive sins”—he said to the man who was paralyzed,"},{"num":11,"verse":"“Get up, take your mat, and go home.”"},{"num":12,"verse":"Jesus raised him up, and right away he picked up his mat and walked out in front of everybody. They were all amazed and praised God, saying, “We’ve never seen anything like this!”"},{"header":"Eating with sinners"},{"num":13,"verse":"Jesus went out beside the lake again. The whole crowd came to him, and he began to teach them."},{"num":14,"verse":"As he continued along, he saw Levi, Alphaeus’ son, sitting at a kiosk for collecting taxes. Jesus said to him, “Follow me.” Levi got up and followed him."},{"num":15,"verse":"Jesus sat down to eat at Levi’s house. Many tax collectors and sinners were eating with Jesus and his disciples. Indeed, many of them had become his followers."},{"num":16,"verse":"When some of the legal experts from among the Pharisees saw that he was eating with sinners and tax collectors, they asked his disciples, “Why is he eating with sinners and tax collectors?”"},{"num":17,"verse":"When Jesus heard it, he said to them, “Healthy people don’t need a doctor, but sick people do. I didn’t come to call righteous people, but sinners.”"},{"header":"When to fast"},{"num":18,"verse":"John’s disciples and the Pharisees had a habit of fasting. Some people asked Jesus, “Why do John’s disciples and the Pharisees’ disciples fast, but yours don’t?”"},{"num":19,"verse":"Jesus said, “The wedding guests can’t fast while the groom is with them, can they? As long as they have the groom with them, they can’t fast."},{"num":20,"verse":"But the days will come when the groom will be taken away from them, and then they will fast."},{"num":21,"verse":"“No one sews a piece of new, unshrunk cloth on old clothes; otherwise, the patch tears away from it, the new from the old, and makes a worse tear."},{"num":22,"verse":"No one pours new wine into old leather wineskins; otherwise, the wine would burst the wineskins and the wine would be lost and the wineskins destroyed. But new wine is for new wineskins.”"},{"header":"Scripture and the Sabbath"},{"num":23,"verse":"Jesus went through the wheat fields on the Sabbath. As the disciples made their way, they were picking the heads of wheat."},{"num":24,"verse":"The Pharisees said to Jesus, “Look! Why are they breaking the Sabbath law?”"},{"num":25,"verse":"He said to them, “Haven’t you ever read what David did when he was in need, when he and those with him were hungry?"},{"num":26,"verse":"During the time when Abiathar was high priest, David went into God’s house and ate the bread of the presence, which only the priests were allowed to eat. He also gave bread to those who were with him.”"},{"num":27,"verse":"Then he said, “The Sabbath was created for humans; humans weren’t created for the Sabbath."},{"num":28,"verse":"This is why the Human One is Lord even over the Sabbath.”"}]