[{"num":2,"verse":"After a few days he came back to Capernaum. People soon heard that he was at home."},{"num":2,"verse":"Many came together right away. The house was full. There was no more room, not even outside near the door. Jesus was telling them God's message."},{"num":3,"verse":"Four men brought a sick man to Jesus. The man could not move his arms or legs."},{"num":4,"verse":"But they could not get in the house where Jesus was, because there were so many people. So they went up on the roof. They made a hole in the roof. Then they let down the mat with the sick man on it."},{"num":5,"verse":"Jesus saw that they believed he would be healed. So he said to the sick man, `Son, the wrong things you have done are forgiven.'"},{"num":6,"verse":"Some of the scribes were sitting there."},{"num":7,"verse":"They were thinking, `Why does this man say such wrong things against God? He is not giving God respect! Who can forgive the wrong things people do? No one but God can do that.'"},{"num":8,"verse":"Jesus understood in his spirit what the scribes were thinking. He said right away, `Why do you think these wrong things in your hearts?"},{"num":9,"verse":"Which is easier, to say to the sick man, \"The wrong things you have done are forgiven,\" or to say, \"Get up. Take up your mat and walk\"?"},{"num":10,"verse":"I want you to know that the Son of Man has power on earth to forgive the wrong things people do.' So he said to the sick man,"},{"num":11,"verse":"`I tell you, get up! Take up your mat and go home.'"},{"num":12,"verse":"Right away the man stood up in front of them. He took up his mat and went home. They were all very much surprised, and they praised God. They said, `We have never seen anything like this before.'"},{"num":13,"verse":"Jesus went out again by the seaside. Many people came to him. So he taught them."},{"num":14,"verse":"As he went along, he saw Levi, the son of Alphaeus. He was sitting at the place where people come to pay taxes. Jesus said to him, `Come with me.' Levi stood up and went with him."},{"num":15,"verse":"Jesus was eating in Levi's house. Many tax collectors and bad people also came. They sat down to eat with Jesus and his disciples. There were many who went with him."},{"num":16,"verse":"The scribes and Pharisees saw that Jesus ate with these people. They said to the disciples, `Why does he eat and drink with bad people?'"},{"num":17,"verse":"Jesus heard it. He said to them, `People who are well do not need a doctor. But sick people need him. I did not come to call good people. I came to call bad people to stop doing wrong things.'"},{"num":18,"verse":"John's disciples and the Pharisees' disciples were fasting [not eating food for a time]. Some people came to Jesus and said, `The disciples of John and of the Pharisees fast. Why do your disciples not do the same?'"},{"num":19,"verse":"Jesus answered them, `The people at a wedding cannot be sad while the man who is married is with them."},{"num":20,"verse":"But the time will come when he will be taken away from them. Then they will fast."},{"num":21,"verse":"No person sews a piece of new cloth on an old coat. If he does, the new cloth will tear the old coat. Then the hole is bigger than it was before."},{"num":22,"verse":"No person puts new wine into old wine skins. If he does, the new wine will break the skins. Then the wine will be lost and the skins will be spoiled. New wine is put into new skins.'"},{"num":23,"verse":"Jesus was walking through the grainfields on the Sabbath day. His disciples began to pick some of the seed (to eat) as they went along."},{"num":24,"verse":"The Pharisees said to Jesus, `Why do your disciples do what is not right on the Sabbath day?'"},{"num":25,"verse":"Jesus answered them, `Have you not read what David did? He and his men who were with him were hungry."},{"num":26,"verse":"He went into God's house when Abiathar was the high priest. Some bread was there for God. It was not right for them to eat it. Only the priests have the right to eat it. But David took the bread and ate it. He also gave some of it to the people who were with him.'"},{"num":27,"verse":"Jesus went on to say, `The Sabbath was made for the good of man. Man was not made for the Sabbath."},{"num":28,"verse":"So the Son of Man rules over the Sabbath day.'"}]