[{"num":24,"verse":"Wherefore from the Mighty One Times have not been hidden, And those knowing Him have not seen His days."},{"num":2,"verse":"The borders they reach, A drove they have taken violently away, Yea, they do evil."},{"num":3,"verse":"The ass of the fatherless they lead away, They take in pledge the ox of the widow,"},{"num":4,"verse":"They turn aside the needy from the way, Together have hid the poor of the earth."},{"num":5,"verse":"Lo, wild asses in a wilderness, They have gone out about their work, Seeking early for prey, A mixture for himself -- food for young ones."},{"num":6,"verse":"In a field his provender they reap, And the vineyard of the wicked they glean."},{"num":7,"verse":"The naked they cause to lodge Without clothing. And there is no covering in the cold."},{"num":8,"verse":"From the inundation of hills they are wet, And without a refuge -- have embraced a rock."},{"num":9,"verse":"They take violently away From the breast the orphan, And on the poor they lay a pledge."},{"num":10,"verse":"Naked, they have gone without clothing, And hungry -- have taken away a sheaf."},{"num":11,"verse":"Between their walls they make oil, Wine-presses they have trodden, and thirst."},{"num":12,"verse":"Because of enmity men do groan, And the soul of pierced ones doth cry, And God doth not give praise."},{"num":13,"verse":"They have been among rebellious ones of light, They have not discerned His ways, Nor abode in His paths."},{"num":14,"verse":"At the light doth the murderer rise, He doth slay the poor and needy, And in the night he is as a thief."},{"num":15,"verse":"And the eye of an adulterer Hath observed the twilight, Saying, `No eye doth behold me.' And he putteth the face in secret."},{"num":16,"verse":"He hath dug in the darkness -- houses; By day they shut themselves up, They have not known light."},{"num":17,"verse":"When together, morning [is] to them death shade, When he discerneth the terrors of death shade."},{"num":18,"verse":"Light he [is] on the face of the waters, Vilified is their portion in the earth, He turneth not the way of vineyards."},{"num":19,"verse":"Drought -- also heat -- consume snow-waters, Sheol [those who] have sinned."},{"num":20,"verse":"Forget him doth the womb, Sweeten [on] him doth the worm, No more is he remembered, And broken as a tree is wickedness."},{"num":21,"verse":"Treating evil the barren [who] beareth not, And [to] the widow he doth no good,"},{"num":22,"verse":"And hath drawn the mighty by his power, He riseth, and none believeth in life."},{"num":23,"verse":"He giveth to him confidence, and he is supported, And his eyes [are] on their ways."},{"num":24,"verse":"High they were [for] a little, and they are not, And they have been brought low. As all [others] they are shut up, And as the head of an ear of corn cut off."},{"num":25,"verse":"And if not now, who doth prove me a liar, And doth make of nothing my word?"}]