[{"header":"The Descendants of Reuben"},{"num":5,"verse":"Reuben was the oldest son of Jacob, but he lost his rights as the first-born son because he slept with one of his father’s wives. The honor of the first-born son was then given to Joseph, "},{"num":2,"verse":"even though it was the Judah tribe that became the most powerful and produced a leader."},{"num":3,"verse":"Reuben had four sons: Hanoch, Pallu, Hezron, and Carmi."},{"num":4,"verse":"The descendants of Joel included Shemaiah, Gog, Shimei, Micah, Reaiah, Baal, and Beerah, a leader of the Reuben tribe. Later, King Tiglath Pileser of Assyria took Beerah away as prisoner."},{"num":7,"verse":"The family records also include Jeiel, who was a clan leader, Zechariah, and Bela son of Azaz and grandson of Shema of the Joel clan. They lived in the territory around the town of Aroer, as far north as Nebo and Baal-Meon, "},{"num":9,"verse":"and as far east as the desert just west of the Euphrates River. They needed this much land because they owned too many cattle to keep them all in Gilead."},{"num":10,"verse":"When Saul was king, the Reuben tribe attacked and defeated the Hagrites, then took over their land east of Gilead."},{"header":"The Descendants of Gad"},{"num":11,"verse":"The tribe of Gad lived in the region of Bashan, north of the Reuben tribe. Gad’s territory extended all the way to the town of Salecah. "},{"num":12,"verse":"Some of the clan leaders were Joel, Shapham, Janai, and Shaphat. "},{"num":13,"verse":"Their relatives included Michael, Meshullam, Sheba, Jorai, Jacan, Zia, and Eber."},{"num":14,"verse":"They were all descendants of Abihail, whose family line went back through Huri, Jaroah, Gilead, Michael, Jeshishai, Jahdo, and Buz. "},{"num":15,"verse":"Ahi, the son of Abdiel and the grandson of Guni, was the leader of their clan."},{"num":16,"verse":"The people of Gad lived in the towns in the regions of Bashan and Gilead, as well as in the pastureland of Sharon. "},{"num":17,"verse":"Their family records were written when Jotham was king of Judah and Jeroboam was king of Israel."},{"num":18,"verse":"The tribes of Reuben, Gad, and East Manasseh had 44,760 soldiers trained to fight in battle with shields, swords, bows, and arrows. "},{"num":19,"verse":"They fought against the Hagrites and the tribes of Jetur, Naphish, and Nodab. "},{"num":20,"verse":"Whenever these soldiers went to war against their enemies, they prayed to God and trusted him to help. That’s why the tribes of Reuben, Gad, and East Manasseh defeated the Hagrites and their allies. "},{"num":21,"verse":"These Israelite tribes captured fifty thousand camels, two hundred fifty thousand sheep, two thousand donkeys, and one hundred thousand people. "},{"num":22,"verse":"Many of the Hagrites died in battle, because God was fighting this battle against them. The tribes of Reuben, Gad, and East Manasseh lived in that territory until they were taken as prisoners to Assyria."},{"header":"The Tribe of East Manasseh"},{"num":23,"verse":"East Manasseh was a large tribe, so its people settled in the northern region of Bashan, as far north as Baal-Hermon, Senir, and Mount Hermon. "},{"num":24,"verse":"Epher, Ishi, Eliel, Azriel, Jeremiah, Hodaviah, and Jahdiel were their clan leaders; they were well-known leaders and brave soldiers."},{"header":"The Tribes of Reuben, Gad, and East Manasseh Are Defeated"},{"num":25,"verse":"The people of the tribes of Reuben, Gad, and East Manasseh were unfaithful to the God their ancestors had worshiped, and they started worshiping the gods of the nations that God had forced out of Canaan. "},{"num":26,"verse":"So God sent King Tiglath Pileser of Assyria to attack these Israelite tribes. The king led them away as prisoners to Assyria, and from then on, he forced them to live in Halah, Habor, Hara, and near the Gozan River."}]