[{"num":1,"verse":"Bringing all this to a climax, King Solomon called in the leaders of Israel, all the heads of the tribes and the family patriarchs, to bring up the Chest of the Covenant of God from Zion, the City of David. And they came, all Israel before King Solomon in the month of Ethanim, the seventh month, for the great autumn festival."},{"num":3,"verse":"With all Israel’s leaders present, the priests took up the Chest of God and carried up the Chest and the Tent of Meeting and all the holy vessels that went with the Tent. King Solomon and the entire congregation of Israel were there at the Chest worshiping and sacrificing huge numbers of sheep and cattle—so many that no one could keep track."},{"num":6,"verse":"Then the priests brought the Chest of the Covenant of God to its place in the Inner Sanctuary, the Holy of Holies, under the wings of the cherubim. The outspread wings of the cherubim stretched over the Chest and its poles. The poles were so long that their ends could be seen from the entrance to the Inner Sanctuary, but were not noticeable farther out. They’re still there today. There was nothing in the Chest but the two stone tablets that Moses had placed in it at Horeb where God made a covenant with Israel after bringing them up from Egypt."},{"header":"The Temple Finished, Dedicated, Filled"},{"num":10,"verse":"When the priests left the Holy Place, a cloud filled The Temple of God. The priests couldn’t carry out their priestly duties because of the cloud—the glory of God filled The Temple of God!"},{"num":12,"verse":"Then Solomon spoke:"},{"num":14,"verse":"The king then turned to face the congregation and blessed them:"},{"num":15,"verse":"“Blessed be God, the God of Israel, who spoke personally to my father David. Now he has kept the promise he made when he said, ‘From the day I brought my people Israel from Egypt, I haven’t set apart one city among the tribes of Israel to build a Temple to fix my Name there. But I did choose David to rule my people Israel.’"},{"num":17,"verse":"“My father David had it in his heart to build a Temple honoring the Name of God, the God of Israel. But God told him ‘It was good that you wanted to build a Temple in my honor—most commendable! But you are not the one to do it—your son will build it to honor my Name.’"},{"num":20,"verse":"“God has done what he said he would do: I have succeeded David my father and ruled over Israel just as God promised; and now I’ve built a Temple to honor God, the God of Israel, and I’ve secured a place for the Chest that holds the covenant of God, the covenant that he made with our ancestors when he brought them up from the land of Egypt.”"},{"num":22,"verse":"Before the entire congregation of Israel, Solomon took a position before the Altar, spread his hands out before heaven, and prayed,"},{"num":27,"verse":"Can it be that God will actually move into our neighborhood? Why, the cosmos itself isn’t large enough to give you breathing room, let alone this Temple I’ve built. Even so, I’m bold to ask: Pay attention to these my prayers, both intercessory and personal, O God, my God. Listen to my prayers, energetic and devout, that I’m setting before you right now. Keep your eyes open to this Temple night and day, this place of which you said, “My Name will be honored there,” and listen to the prayers that I pray at this place."},{"num":33,"verse":"When your people Israel are beaten by an enemy because they’ve sinned against you, but then turn to you and acknowledge your rule in prayers desperate and devout in this Temple,"},{"num":35,"verse":"When the skies shrivel up and there is no rain because your people have sinned against you, but then they pray at this place, acknowledging your rule and quitting their sins because you have scourged them,"},{"num":37,"verse":"When disasters strike, famine or catastrophe, crop failure or disease, locust or beetle, or when an enemy attacks their defenses—calamity of any sort—any prayer that’s prayed from anyone at all among your people Israel, hearts penetrated by the disaster, hands and arms thrown out to this Temple for help,"},{"num":41,"verse":"And don’t forget the foreigner who is not a member of your people Israel but has come from a far country because of your reputation. People are going to be attracted here by your great reputation, your wonder-working power, who come to pray at this Temple."},{"num":44,"verse":"When your people go to war against their enemies at the time and place you send them and they pray to God toward the city you chose and this Temple I’ve built to honor your Name,"},{"num":52,"verse":"O be alert and attentive to the needy prayers of me, your servant, and your dear people Israel; listen every time they cry out to you! You handpicked them from all the peoples on earth to be your very own people, as you announced through your servant Moses when you, O God, in your masterful rule, delivered our ancestors from Egypt."},{"num":54,"verse":"Having finished praying to God—all these bold and passionate prayers—Solomon stood up before God’s Altar where he had been kneeling all this time, his arms stretched upward to heaven. Standing, he blessed the whole congregation of Israel, blessing them at the top of his lungs:"},{"num":56,"verse":"“Blessed be God, who has given peace to his people Israel just as he said he’d do. Not one of all those good and wonderful words that he spoke through Moses has misfired. May God, our very own God, continue to be with us just as he was with our ancestors—may he never give up and walk out on us. May he keep us centered and devoted to him, following the life path he has cleared, watching the signposts, walking at the pace and rhythms he laid down for our ancestors."},{"num":59,"verse":"“And let these words that I’ve prayed in the presence of God be always right there before him, day and night, so that he’ll do what is right for me, to guarantee justice for his people Israel day after day after day. Then all the people on earth will know God is the true God; there is no other God. And you, your lives must be totally obedient to God, our personal God, following the life path he has cleared, alert and attentive to everything he has made plain this day.”"},{"num":62,"verse":"The king and all Israel with him then worshiped, offering sacrifices to God. Solomon offered Peace-Offerings, sacrificing to God 22,000 cattle and 120,000 sheep. This is how the king and all Israel dedicated The Temple of God."},{"num":64,"verse":"That same day, the king set apart the central area of the Courtyard in front of God’s Temple for sacred use and there sacrificed the Whole-Burnt-Offerings, Grain-Offerings, and fat from the Peace-Offerings—the bronze Altar was too small to handle all these offerings."},{"num":65,"verse":"This is how Solomon kept the great autumn feast, and all Israel with him, people there all the way from the far northeast (the Entrance to Hamath) to the far southwest (the Brook of Egypt)—a huge congregation. They started out celebrating for seven days—and then did it another seven days! Two solid weeks of celebration! Then he dismissed them. They blessed the king and went home, exuberant with heartfelt gratitude for all the good God had done for his servant David and for his people Israel."}]