[{"header":"Solomon Moves the Ark into the Temple"},{"num":8,"verse":" Then Solomon convened in Jerusalem Israel’s elders, all the leaders of the Israelite tribes and families, so they could witness the transferal of the ark of the Lord’s covenant from the City of David (that is, Zion). "},{"num":2,"verse":"All the men of Israel assembled before King Solomon during the festival in the month of Ethanim (the seventh month). "},{"num":3,"verse":"When all Israel’s elders had arrived, the priests lifted the ark. "},{"num":4,"verse":"The priests and Levites carried the ark of the Lord, the tent of meeting, and all the holy items in the tent. "},{"num":5,"verse":"Now King Solomon and all the Israelites who had assembled with him went on ahead of the ark and sacrificed more sheep and cattle than could be counted or numbered."},{"num":6,"verse":"The priests brought the ark of the Lord’s covenant to its assigned place in the inner sanctuary of the temple, in the Most Holy Place, under the wings of the cherubim. "},{"num":7,"verse":"The cherubim’s wings extended over the place where the ark sat; the cherubim overshadowed the ark and its poles. "},{"num":8,"verse":"The poles were so long their ends were visible from the Holy Place in front of the inner sanctuary, but they could not be seen from beyond that point. They have remained there to this very day. "},{"num":9,"verse":"There was nothing in the ark except the two stone tablets Moses had placed there in Horeb. It was there that the Lord made a covenant with the Israelites after he brought them out of the land of Egypt. "},{"num":10,"verse":"Once the priests left the Holy Place, a cloud filled the Lord’s temple. "},{"num":11,"verse":"The priests could not carry out their duties because of the cloud; the Lord’s glory filled his temple."},{"num":12,"verse":"Then Solomon said, “The Lord has said that he lives in thick darkness. "},{"num":13,"verse":"O Lord, truly I have built a lofty temple for you, a place where you can live permanently.” "},{"num":14,"verse":"Then the king turned around and pronounced a blessing over the whole Israelite assembly as they stood there. "},{"num":15,"verse":"He said, “The Lord God of Israel is worthy of praise because he has fulfilled what he promised my father David. "},{"num":16,"verse":"He told David, ‘Since the day I brought my people Israel out of Egypt, I have not chosen a city from all the tribes of Israel to build a temple in which to live. But I have chosen David to lead my people Israel.’ "},{"num":17,"verse":"Now my father David had a strong desire to build a temple to honor the Lord God of Israel. "},{"num":18,"verse":"The Lord told my father David, ‘It is right for you to have a strong desire to build a temple to honor me. "},{"num":19,"verse":"But you will not build the temple; your very own son will build the temple for my honor.’ "},{"num":20,"verse":"The Lord has kept the promise he made. I have taken my father David’s place and have occupied the throne of Israel, as the Lord promised. I have built this temple for the honor of the Lord God of Israel "},{"num":21,"verse":"and set up in it a place for the ark containing the covenant the Lord made with our ancestors when he brought them out of the land of Egypt.”"},{"header":"Solomon Prays for Israel"},{"num":22,"verse":"Solomon stood before the altar of the Lord in front of the entire assembly of Israel and spread out his hands toward the sky. "},{"num":23,"verse":"He prayed: “O Lord, God of Israel, there is no god like you in heaven above or on earth below! You maintain covenantal loyalty to your servants who obey you with sincerity. "},{"num":24,"verse":"You have kept your word to your servant, my father David; this very day you have fulfilled what you promised. "},{"num":25,"verse":"Now, O Lord, God of Israel, keep the promise you made to your servant, my father David, when you said, ‘You will never fail to have a successor ruling before me on the throne of Israel, provided that your descendants watch their step and serve me as you have done.’ "},{"num":26,"verse":"Now, O God of Israel, may the promise you made to your servant, my father David, be realized."},{"num":27,"verse":"“God does not really live on the earth! Look, if the sky and the highest heaven cannot contain you, how much less this temple I have built! "},{"num":28,"verse":"But respond favorably to your servant’s prayer and his request for help, O Lord my God. Answer the desperate prayer your servant is presenting to you today. "},{"num":29,"verse":"Night and day may you watch over this temple, the place where you promised you would live. May you answer your servant’s prayer for this place. "},{"num":30,"verse":"Respond to the request of your servant and your people Israel for this place. Hear from inside your heavenly dwelling place and respond favorably."},{"num":31,"verse":"“When someone is accused of sinning against his neighbor and the latter pronounces a curse on the alleged offender before your altar in this temple, be willing to forgive the accused if the accusation is false. "},{"num":32,"verse":"Listen from heaven and make a just decision about your servants’ claims. Condemn the guilty party, declare the other innocent, and give both of them what they deserve."},{"num":33,"verse":"“The time will come when your people Israel are defeated by an enemy because they sinned against you. If they come back to you, renew their allegiance to you, and pray for your help in this temple, "},{"num":34,"verse":"then listen from heaven, forgive the sin of your people Israel, and bring them back to the land you gave to their ancestors."},{"num":35,"verse":"“The time will come when the skies are shut up tightly and no rain falls because your people sinned against you. When they direct their prayers toward this place, renew their allegiance to you, and turn away from their sin because you punish them, "},{"num":36,"verse":"then listen from heaven and forgive the sin of your servants, your people Israel. Certainly you will then teach them the right way to live and send rain on your land that you have given your people to possess."},{"num":37,"verse":"“The time will come when the land suffers from a famine, a plague, blight and disease, or a locust invasion, or when their enemy lays siege to the cities of the land, or when some other type of plague or epidemic occurs. "},{"num":38,"verse":"When all your people Israel pray and ask for help, as they acknowledge their pain and spread out their hands toward this temple, "},{"num":39,"verse":"then listen from your heavenly dwelling place, forgive their sin, and act favorably toward each one based on your evaluation of his motives. (Indeed you are the only one who can correctly evaluate the motives of all people.) "},{"num":40,"verse":"Then they will obey you throughout their lifetimes as they live on the land you gave to our ancestors."},{"num":41,"verse":"“Foreigners, who do not belong to your people Israel, will come from a distant land because of your reputation. "},{"num":42,"verse":"When they hear about your great reputation and your ability to accomplish mighty deeds, they will come and direct their prayers toward this temple. "},{"num":43,"verse":"Then listen from your heavenly dwelling place and answer all the prayers of the foreigners. Then all the nations of the earth will acknowledge your reputation, obey you as your people Israel do, and recognize that this temple I built belongs to you."},{"num":44,"verse":"“When you direct your people to march out and fight their enemies, and they direct their prayers to the Lord toward his chosen city and this temple I built for your honor, "},{"num":45,"verse":"then listen from heaven to their prayers for help and vindicate them."},{"num":46,"verse":"“The time will come when your people will sin against you (for there is no one who is sinless!) and you will be angry with them and deliver them over to their enemies, who will take them as prisoners to their own land, whether far away or close by. "},{"num":47,"verse":"When your people come to their senses in the land where they are held prisoner, they will repent and beg for your mercy in the land of their imprisonment, admitting, ‘We have sinned and gone astray; we have done evil.’ "},{"num":48,"verse":"When they return to you with all their heart and being in the land where they are held prisoner, and direct their prayers to you toward the land you gave to their ancestors, your chosen city, and the temple I built for your honor, "},{"num":49,"verse":"then listen from your heavenly dwelling place to their prayers for help and vindicate them. "},{"num":50,"verse":"Forgive all the rebellious acts of your sinful people and cause their captors to have mercy on them. "},{"num":51,"verse":"After all, they are your people and your special possession whom you brought out of Egypt, from the middle of the iron-smelting furnace."},{"num":52,"verse":"“May you be attentive to your servant’s and your people Israel’s requests for help and may you respond to all their prayers to you. "},{"num":53,"verse":"After all, you picked them out of all the nations of the earth to be your special possession, just as you, O Sovereign Lord, announced through your servant Moses when you brought our ancestors out of Egypt.”"},{"num":54,"verse":"When Solomon finished presenting all these prayers and requests to the Lord, he got up from before the altar of the Lord where he had kneeled and spread out his hands toward the sky. "},{"num":55,"verse":"When he stood up, he pronounced a blessing over the entire assembly of Israel, saying in a loud voice: "},{"num":56,"verse":"“The Lord is worthy of praise because he has made Israel his people secure just as he promised! Not one of all the faithful promises he made through his servant Moses is left unfulfilled! "},{"num":57,"verse":"May the Lord our God be with us, as he was with our ancestors. May he not abandon us or leave us. "},{"num":58,"verse":"May he make us submissive, so we can follow all his instructions and obey the commandments, rules, and regulations he commanded our ancestors. "},{"num":59,"verse":"May the Lord our God be constantly aware of these requests of mine I have presented to him, so that he might vindicate his servant and his people Israel as the need arises. "},{"num":60,"verse":"Then all the nations of the earth will recognize that the Lord is the only genuine God. "},{"num":61,"verse":"May you demonstrate wholehearted devotion to the Lord our God by following his rules and obeying his commandments, as you are now doing.”"},{"header":"Solomon Dedicates the Temple"},{"num":62,"verse":"The king and all Israel with him were presenting sacrifices to the Lord. "},{"num":63,"verse":"Solomon offered as peace offerings to the Lord 22,000 cattle and 120,000 sheep. Then the king and all the Israelites dedicated the Lord’s temple. "},{"num":64,"verse":"That day the king consecrated the middle of the courtyard that is in front of the Lord’s temple. He offered there burnt sacrifices, grain offerings, and the fat from the peace offerings, because the bronze altar that stood before the Lord was too small to hold all these offerings. "},{"num":65,"verse":"At that time Solomon and all Israel with him celebrated a festival before the Lord our God for two entire weeks. This great assembly included people from all over the land, from Lebo Hamath in the north to the Stream of Egypt in the south. "},{"num":66,"verse":"On the fifteenth day after the festival started, he dismissed the people. They asked God to empower the king and then went to their homes, happy and content because of all the good the Lord had done for his servant David and his people Israel."}]