[{"header":"Prologue"},{"num":1,"verse":"The revelation of Jesus Christ that God gave him to show his servants what must soon take place. He made it known by sending his angel to his servant John, "},{"num":2,"verse":"who testified to the word of God and to the testimony of Jesus Christ, whatever he saw. "},{"num":3,"verse":"Blessed is the one who reads aloud the words of this prophecy, and blessed are those who hear the words of this prophecy and keep what is written in it, because the time is near."},{"num":4,"verse":"John: To the seven churches in Asia. Grace and peace to you from the one who is, who was, and who is to come, and from the seven spirits before his throne, "},{"num":5,"verse":"and from Jesus Christ, the faithful witness, the firstborn from the dead and the ruler of the kings of the earth."},{"num":6,"verse":"and made us a kingdom, priests to his God and Father—to him be glory and dominion forever and ever. Amen."},{"num":8,"verse":"“I am the Alpha and the Omega,” says the Lord God, “the one who is, who was, and who is to come, the Almighty.”"},{"header":"John’s Vision of the Risen Lord"},{"num":9,"verse":"I, John, your brother and partner in the affliction, kingdom, and endurance that are in Jesus, was on the island called Patmos because of the word of God and the testimony of Jesus. "},{"num":10,"verse":"I was in the Spirit on the Lord’s day, and I heard a loud voice behind me like a trumpet "},{"num":11,"verse":"saying, “Write on a scroll what you see and send it to the seven churches: Ephesus, Smyrna, Pergamum, Thyatira, Sardis, Philadelphia, and Laodicea.”"},{"num":12,"verse":"Then I turned to see whose voice it was that spoke to me. When I turned I saw seven golden lampstands, "},{"num":13,"verse":"and among the lampstands was one like the Son of Man, dressed in a robe and with a golden sash wrapped around his chest. "},{"num":14,"verse":"The hair of his head was white as wool—white as snow—and his eyes like a fiery flame. "},{"num":15,"verse":"His feet were like fine bronze as it is fired in a furnace, and his voice like the sound of cascading waters. "},{"num":16,"verse":"He had seven stars in his right hand; a sharp double-edged sword came from his mouth, and his face was shining like the sun at full strength."},{"num":17,"verse":"When I saw him, I fell at his feet like a dead man. He laid his right hand on me and said, “Don’t be afraid. I am the First and the Last, "},{"num":18,"verse":"and the Living One. I was dead, but look—I am alive forever and ever, and I hold the keys of death and Hades. "},{"num":19,"verse":"Therefore write what you have seen, what is, and what will take place after this. "},{"num":20,"verse":"The mystery of the seven stars you saw in my right hand and of the seven golden lampstands is this: The seven stars are the angels of the seven churches, and the seven lampstands are the seven churches."}]