[{"num":1,"verse":"¶ The Revelation of Jesus Christ, which God gave unto him, to show unto his slaves things which are convenient to do quickly, and he sent and signified it by his angel unto his slave John,"},{"num":2,"verse":"who bore witness of the word of God and of the testimony of Jesus Christ, and of all things that he saw."},{"num":3,"verse":"¶ Blessed is he that reads and those that hear the words of this prophecy and keep those things which are written therein, for the time is at hand."},{"num":4,"verse":"John, to the seven congregations {Gr. ekklesia – called out ones} which are in Asia: Grace be unto you and peace from him who is and who was and who is to come and from the seven Spirits which are before his throne"},{"num":5,"verse":"and from Jesus, the Christ, who is the faithful witness and the first begotten of the dead and the prince of the kings of the earth. Unto him that loved us and washed us from our sins with his own blood"},{"num":6,"verse":"and has made us kings and priests unto God and his Father; to him be glory and dominion for ever and ever. Amen."},{"num":7,"verse":"Behold, he comes with the clouds, and every eye shall see him and those also who pierced him; and all kindreds of the earth shall wail over him. Even so, Amen."},{"num":8,"verse":"I AM the Alpha and the Omega, beginning and end, saith the Lord, who is and who was and who is to come, the Almighty."},{"num":9,"verse":"¶ I John, your brother and participant in the tribulation and in the kingdom and in the patience of Jesus Christ, was in the isle that is called Patmos for the word of God, and for the testimony of Jesus Christ."},{"num":10,"verse":"I was in the Spirit in the day of the Lord and heard behind me a great voice as of a trumpet,"},{"num":11,"verse":"that said, I AM the Alpha and the Omega, the first and the last, and What thou seest, write in a book and send it unto the seven congregations {Gr. ekklesia – called out ones} which are in Asia: unto Ephesus and unto Smyrna and unto Pergamos and unto Thyatira and unto Sardis and unto Philadelphia and unto Laodicea."},{"num":12,"verse":"And I turned to see the voice that spoke with me. And being turned, I saw seven golden lampstands"},{"num":13,"verse":"and in the midst of the seven lampstands one like unto the Son of man, clothed with a garment down to the feet and girt about the breasts with a golden girdle."},{"num":14,"verse":"His head and his hairs were white like white wool, as the snow, and his eyes were as a flame of fire"},{"num":15,"verse":"and his feet like unto brilliant metal as if they burned in a furnace and his voice as the sound of many waters."},{"num":16,"verse":"And he had in his right hand seven stars, and out of his mouth went a sharp two-edged sword, and his countenance was as the sun when it shines in its strength."},{"num":17,"verse":"And when I saw him, I fell at his feet as dead. And he laid his right hand upon me, saying unto me, Fear not; I AM the first and the last,"},{"num":18,"verse":"and he that lives and was dead; and, behold, I am alive for evermore, Amen, and have the keys of Hades and of death."},{"num":19,"verse":"Write the things which thou hast seen and the things which are and the things which must be after these."},{"num":20,"verse":"The mystery of the seven stars which thou sawest in my right hand and the seven golden lampstands: The seven stars are the angels of the seven congregations, {Gr. ekklesia – called out ones} and the seven lampstands which thou sawest are the seven congregations. {Gr. ekklesia – called out ones}"}]