[{"num":1,"verse":"The Hisgalus [Revelation, Appearance, Exposure of what is Nistar (Hidden), Sod (Secret), Raz (Mystery)] of Rebbe, Melech HaMoshiach Yehoshua which Hashem gave to him to show to his mesharetim (servants, klei kodesh, ministers) MAH DI LEHEVE (“what will happen,” Dan 2:28f), the things which are destined to take place, and speedily; Rebbe, Melech HaMoshiach made it known by sending his malach (angel) to his mesharet (servant, keli kodesh, minister), Yochanan. [AMOS 3:7]"},{"num":2,"verse":"Yochanan gave solemn eidus (testimony) to the Dvar Hashem and to the eidus of Rebbe, Melech HaMoshiach, even to all that Yochanan saw."},{"num":3,"verse":"Ashrey (Blessed, Happy) is the one reading and the ones hearing the divrei hanevu’ah (words of [this] prophecy) and remaining shomer regarding what is written in it, for karov (near) is HaYom [the time of crisis and the events related to the Bias HaMoshiach]."},{"num":4,"verse":"Yochanan to the sheva (seven) hakehillot (congregations) in Asia: Chen v’Chesed Hashem to you and Shalom from the One who is [SHEMOT 3:14], who was, and who is to come [YESHAYAH 41:4], and from the shevat haruchot which are before Hashem’s Kes (Throne) [merkavah chariot throne in Shomayim, YECHEZKEL 1:4-28]."},{"num":5,"verse":"And from Rebbe, Melech HaMoshiach, the ed hane’eman (faithful witness), the BECHOR (Firstborn, TEHILLIM 89:28 [27]) of the Mesim and the Nagid, ELYON L’MALKHEI A’RETZ (\"Leader, Most exalted of Kings of the earth, TEHILLIM 89:27). To the One who has ahavah for us and has freed us [from the Golus of, YESHAYAH 59:2; 53:3] peyshaeinu [our transgressions, YESHAYAH 53:5] by [Geulah redemption through the kofer pedut ransom korban of his nefesh (YESHAYAH 53:10) in the kapporah atonement of] the dahm of him, [TEHILLIM 130:8; YESHAYAH 40:2; TEHILLIM 89:38; YIRMEYAH 42:5; YESHAYAH 55:4; BERESHIS 22:8; SHEMOT 12:13; YESHAYAH 53:7; VAYIKRA 17:11]"},{"num":6,"verse":"And made us a Malchut (Kingdom), a Mamlekhet kohanim (a Kingdom of priests, SHEMOT 19:6), kohanim doing avodas kodesh sherut to his Elohim HaAv, lo hakavod v’hagevurah l’olmey olamim. Omein (to him be glory and powerful dominion forever and ever. Omein). [SHEMOT 19:6; 23:22; YESHAYAH 61:6]"},{"num":7,"verse":"Hinei, Hu habah (He comes) with HA’ANANIM (glory clouds) and kol ayin (every eye) will see him, even the ones who PIERCED HIM, and all the mishpachot (families) of ha’aretz will MOURN for Him. Ken, even so. Omein. [DANIEL 7:13; ZECHARYAH 12:10f; BERESHIS 12:3;28:14]"},{"num":8,"verse":"Ani Hu the Aleph and the Tav, says Hashem Adonoi, the One who is and the One who was and the One coming, Adonoi Tzivos (L-rd of armies). [SHEMOT 3:14; YESHAYAH 41:4; AMOS 3:13; 4:13 TARGUM HA-SHIVIM]"},{"num":9,"verse":"I, Yochanan, your Ach b’Moshiach and your fellow partaker taking the chelek (inheritance) in the tzarah (trouble, Mt 24:15f), the Chevlai Moshiach (birthpangs of Moshiach), and the Malchut (Kingdom) and the savlanut (patient endurance) in Moshiach‖I was on the island called Patmos because of the Dvar Hashem and the eidus (witness) of [Rebbe, Melech HaMoshiach] Yehoshua. [SHEMOT 20:18; DANIEL 8:1]"},{"num":10,"verse":"I was in the Ruach Hakodesh on Yom HaAdon, and I heard behind me a kol gadol (a loud voice), like the blast of a shofar, [YECHEZKEL 3:12; SHEMOT 19:16]"},{"num":11,"verse":"Saying, Ani Hu the Aleph and the Tav, HaRishon (The first) and HaAcharon (The last): and, What you see [in the chazon], write in a sefer and send it to the sheva (seven) HaKehillot, to Ephesus and to Smyrna and to Pergamum and to Thyatira and to Sardis and to Philadelphia and to Laodicea. [YESHAYAH 30:8]"},{"num":12,"verse":"Then I turned to see the kol which was speaking with me, and, having turned, I saw sheva menorot zahav (seven golden menorahs). [ZECHARYAH 4:2; SHEMOT 25:31-40]"},{"num":13,"verse":"And in the midst of the menorot stood One like the Ben HaAdam [DANIEL 7:13-14; YECHEZKEL 1:26], having been clothed in a Beketch (long coat) reaching to the feet and having been wrapped around at the chest with a golden gartel. [DANIEL 7:13; YECHEZKEL 1:26; 9:2,11 TARGUM HA-SHIVIM; DANIEL 10:5,16; YESHAYAH 6:1]"},{"num":14,"verse":"And the rosh of him and the hair were lavan (white), like wool, like snow, and the eynayim (eyes) of him were like a flame of eish (fire), [DANIEL 7:9]"},{"num":15,"verse":"And the feet of him were like burnished bronze as if in a furnace having been made to glow, and the kol (voice) of him as the sound of mayim rabbim (many waters). [DANIEL 10:6; YECHEZKEL 1:7,24; 43:2; YESHAYAH 1:20; 49:2; SHOFETIM 5:31]"},{"num":16,"verse":"And he had in the yad yamin (right hand) of him shevat hakokhavim (seven stars) and out of the mouth of him a sharp two-edged cherev (sword) going forth and the face of him was like the shemesh (sun) shining in its power. [YESHAYAH 1:20; 49:2; SHOFETIM 5:31]"},{"num":17,"verse":"And when I saw him [Moshiach], I fell at the feet of him as though dead, and he placed the yad yamin [right hand] of him upon me saying, Do not fear; I am HaRishon (The First) and HaAcharon (The Last) [YESHAYAH 41:4; 44:6; 48:12; YECHEZKEL 1:28; DANIEL 8:17,18;]"},{"num":18,"verse":"And HaChai (The Living One), and I became Niftar, I had my histalkus (passing), and, hinei, Chai Ani l’Olam va’ed (I am alive forevermore) and I have the maftekhot haMavet (keys of Death) and the maftekhot haShe’ol (keys of the abode of the Dead). [YESHAYAH 41:4; 44:2,6; 48:12; YECHEZKEL 1:28; DANIEL 4:34; 12:7; 8:17-18; DEVARIM 32:40; IYOV 38:17]"},{"num":19,"verse":"Therefore, write down the Chazon (Revelation, Prophecy, Vision, Hisgalus, CHABAKUK 2:2), that is, the things you saw and the things which are and the things which are about to happen after these things. [YESHAYAH 48:6 TARGUM HA-SHIVIM; DANIEL 2:28,29,45]"},{"num":20,"verse":"The raz (mystery, sod) of the shevat hakokhavim (seven stars) which you saw in the yad yamin (right hand) of me and the sheva golden menorot: the shevat hakokhavim are the malachim (angels) of the Kehillot (Congregations) and the sheva menorot are the sheva Kehillot."}]