[{"header":"The Diagnosis of Impurity From Skin Diseases"},{"num":13,"verse":"The Lord spoke to Moses and Aaron:"},{"num":2,"verse":"When a person has a discoloration or a scab or a shiny patch on the skin of his body, which may become an outbreak of an impure skin disease on the skin of his body, he shall be brought to Aaron the priest or to one of his sons who are priests. "},{"num":3,"verse":"The priest shall examine the infection on the skin of his body. If the hair on the infection has turned white and if the infection appears to be deeper than the skin of his body, it is an outbreak of an impure skin disease. After the priest has examined it, he shall declare it unclean."},{"num":4,"verse":"But if there is a white shiny patch on the skin of his body that does not appear to be any deeper than the skin and if its hair has not turned white, the priest shall quarantine the person with the infection for seven days. "},{"num":5,"verse":"On the seventh day the priest shall examine him, and if, in his judgment, the infection has stayed the same and has not spread in the skin, the priest shall quarantine him for seven days a second time. "},{"num":6,"verse":"On the seventh day the priest shall examine him a second time. If the infection has faded and has not spread in the skin, the priest shall declare it clean. It is only a scab. After he washes his clothes, he will be clean. "},{"num":7,"verse":"But if the scab on his skin spreads after he has shown himself to the priest for his purification, he shall show himself to the priest once again. "},{"num":8,"verse":"The priest shall examine him. If the scab has spread on the skin, the priest shall declare him unclean. It is an impure skin disease."},{"num":9,"verse":"When a person has an outbreak of a skin disease, he shall be brought to the priest. "},{"num":10,"verse":"The priest shall examine him. If there is white discoloration in the skin that has turned the hair white, and there is a sore of raw flesh in the discoloration, "},{"num":11,"verse":"it is a persistent skin disease on his body. The priest shall declare him unclean. He shall not hold him in quarantine, because he is unclean."},{"num":12,"verse":"But if the disease breaks out all over the skin, so that a diseased condition covers all the skin with the infection, from his head to his feet, as far as the priest can see, "},{"num":13,"verse":"then the priest shall examine him. If the condition covers the whole of his body, he shall declare the infected area clean, since the whole of it has turned white. He is clean. "},{"num":14,"verse":"But as soon as raw flesh reappears on him, he becomes unclean. "},{"num":15,"verse":"The priest shall examine the raw flesh and declare it unclean. The raw flesh is unclean. It is an impure skin disease. "},{"num":16,"verse":"If, however, the raw flesh once again turns white, he shall come to the priest again. "},{"num":17,"verse":"The priest shall examine it. If the infected area has turned white, the priest shall declare the infection clean. He is clean."},{"num":18,"verse":"When someone’s body has a boil on the skin that has healed, "},{"num":19,"verse":"and a white discoloration or shiny, reddish-white patch develops on the site of the boil, he shall show himself to the priest. "},{"num":20,"verse":"The priest shall examine him. If the infection appears deeper than the skin and if its hair has turned white, the priest shall declare him unclean. It is an outbreak of an impure skin disease. It has broken out in the boil. "},{"num":21,"verse":"But if the priest examines it and finds that the hair in it is not white, and it is not deeper than the skin, but it has faded, the priest shall quarantine him for seven days. "},{"num":22,"verse":"If the outbreak spreads on the skin, the priest shall declare him unclean. It is an infection. "},{"num":23,"verse":"But if the shiny patch remains the same and it does not spread, it is the scar of a boil. The priest shall declare him clean."},{"num":24,"verse":"When someone’s body has a burn on the skin, and the sore from the burn becomes a shiny, reddish-white or white patch, "},{"num":25,"verse":"the priest shall examine it. If the hair in the shiny patch has turned white and it appears to be deeper than the skin, it is an impure skin disease. It has broken out in the burn. The priest shall declare him unclean. It is an outbreak of an impure skin disease. "},{"num":26,"verse":"But if the priest examines it and finds that the hair in the shiny patch is not white or it is not deeper than the skin, but it has faded, the priest shall quarantine him for seven days. "},{"num":27,"verse":"On the seventh day the priest shall examine it. If it should spread on the skin, the priest shall declare him unclean. It is an outbreak of a skin disease. "},{"num":28,"verse":"But if the patch remains the same, without spreading on the skin, and if it has faded, it is the discoloration from a burn. The priest shall declare him clean, because it is the scar of a burn."},{"num":29,"verse":"When a man or a woman has an outbreak on the head or on the chin, "},{"num":30,"verse":"the priest shall examine the outbreak. If it appears deeper than the skin and if the hair in it is yellow and thin, the priest shall declare the person unclean. It is a lesion. It is an impure skin disease of the head or the chin. "},{"num":31,"verse":"If the priest examines the infected area of the sore and it appears no deeper than the skin and there is no black hair in it, the priest shall quarantine the person who has the outbreak of the sore for seven days. "},{"num":32,"verse":"On the seventh day the priest shall examine the infected area. If the lesion has not spread and there is no yellow hair in it and if the outbreak appears no deeper than the skin, "},{"num":33,"verse":"the man shall shave himself, without shaving the infected area. The priest shall quarantine the person with the lesion a second time for seven days. "},{"num":34,"verse":"On the seventh day the priest shall examine the lesion. If the lesion has not spread on the skin and it appears no deeper than the skin, the priest shall declare him clean. After he washes his clothes, he will be clean. "},{"num":35,"verse":"If, however, the lesion spreads on the skin after his purification, "},{"num":36,"verse":"the priest shall examine it. If the lesion has spread on the skin, the priest does not need to look for the yellow hair. The person is unclean. "},{"num":37,"verse":"But, if in the priest’s judgment the lesion has stayed the same and black hair has grown in it, the lesion is healed. That person is clean. The priest shall declare him clean."},{"num":38,"verse":"When a man or a woman has many shiny white patches on the skin of his or her body, "},{"num":39,"verse":"the priest shall examine that person. If the patches on the skin of the body are a faded white, it is a rash that has broken out on the skin. That person is clean."},{"num":40,"verse":"When a man loses hair from the top of his head, he is bald, but he is clean. "},{"num":41,"verse":"If he loses hair from his forehead, he has a receding hairline, but he is clean. "},{"num":42,"verse":"But if he has a reddish-white infection on his bald crown or on his bald forehead, it is an impure skin disease that has broken out on his bald head or on his bald forehead. "},{"num":43,"verse":"The priest shall examine it. If the discoloration of the infection is reddish-white on his bald head or on his bald forehead and it looks like the disease on the skin of the body, "},{"num":44,"verse":"he has an impure skin disease. He is unclean. The priest shall declare him completely unclean. It is an infection on his head."},{"num":45,"verse":"The person with the skin disease who has an infection on him must wear torn clothes and let his hair be disheveled. He must cover his upper lip and cry out, “Unclean! Unclean!” "},{"num":46,"verse":"For as long as the infection is on him he shall remain unclean. He is unclean. He must live alone in a place outside the camp."},{"header":"Contamination of Clothing"},{"num":47,"verse":"When an outbreak of mold occurs on any piece of clothing, on woolen or linen cloth, "},{"num":48,"verse":"on the warp or the woof of linen or wool, on leather or anything made of leather, "},{"num":49,"verse":"and if the contamination on the cloth or the leather, or in the warp or the woof, or on any article made of leather is bright yellow-green or bright red, it is an outbreak of mold. It shall be shown to the priest. "},{"num":50,"verse":"The priest shall examine the contaminated area and shall quarantine the contaminated article for seven days. "},{"num":51,"verse":"On the seventh day he shall examine the contaminated article. If the contamination has spread on the cloth, or in the warp or the woof, or on the leather, or on any article that is made of leather, the contamination is a persistent mold. It is unclean. "},{"num":52,"verse":"He must burn the clothing and the warp or the woof, whether it is made of wool or of linen, or whether it is any article made of leather that has the contamination on it. Because it has a persistent mold, it must be burned in fire. "},{"num":53,"verse":"But if the priest examines it and discovers that the contamination has not spread on the clothing, or in the warp or the woof, or on any leather article, "},{"num":54,"verse":"the priest shall command that the material with the contamination on it is to be washed, and he shall quarantine it for seven days a second time. "},{"num":55,"verse":"Then after the contaminated material has been laundered, and the priest examines it, even if he discovers that the contamination has not changed its appearance and the contamination has not spread, it is unclean. You must burn it in fire, whether the rot is on its front or its back. "},{"num":56,"verse":"But if the priest examines it and discovers that the contamination has faded after it has been washed, he shall tear it out of the clothing or the leather or the warp or the woof. "},{"num":57,"verse":"If it reappears in the clothing or the warp or the woof or any leather article, it is a new outbreak. You must burn the material with the contamination on it with fire. "},{"num":58,"verse":"If, however, the contamination vanishes from the clothing, or the warp or the woof, or any leather article that you wash, it shall be washed a second time; then, it will be clean."},{"num":59,"verse":"These are the laws about a contamination of mold in woolen or linen clothing, in the warp or the woof, or on any leather article, in order to determine whether it is clean or unclean."}]