[{"header":"Chapter 13"},{"num":1,"verse":"Infections of the Skin. The Lord said to Moses and to Aaron,"},{"num":2,"verse":"“When someone has a swelling or a scab or a spot on his skin, and it turns out to be leprosy, then he shall be brought to the priest Aaron or one of his sons who is a priest."},{"num":3,"verse":"The priest shall examine the diseased spot on his skin. If the hair of the diseased spot has become white and the sore seems to be deeper than the surface of the skin, then the disease is leprosy. When the priest has examined it, he shall pronounce him unclean."},{"num":4,"verse":"But if the spot on his skin is white and is not deeper than the skin and the hair on it has not become white, the priest shall quarantine the person with the sore for seven days."},{"num":5,"verse":"On the seventh day the priest shall examine that person again. If he sees that the sore has not changed, and the sore has not spread, he shall quarantine that person for another seven days."},{"num":6,"verse":"The priest shall examine that person again on the seventh day. If the sore has darkened, and the sore has not spread, then the priest shall declare that person clean. It was only a scab. He shall wash his clothes and shall be considered to be clean."},{"num":7,"verse":"But if the scab spreads after the priest has examined him and declared him to be clean, then he must be examined by the priest again."},{"num":8,"verse":"The priest shall examine it, and if the sore has spread, the priest shall pronounce him to be unclean for it is leprosy."},{"num":9,"verse":"“When a person has a leprous sore, he shall be brought to the priest"},{"num":10,"verse":"and the priest shall examine him. If there is a white bump on the skin and the hair on it has turned white, and there is tender, raw flesh on the bump,"},{"num":11,"verse":"then it is a chronic leprosy of the skin of his body. The priest shall declare him unclean, but he shall not quarantine him for he is unclean."},{"num":12,"verse":"If the leprosy breaks out upon the skin so that the leprosy covers all of the skin of the diseased person wherever the priest examined him, from head to foot,"},{"num":13,"verse":"then the priest shall examine the person whose flesh is covered with leprosy. He shall declare him clean when it has all turned white, for he is clean."},{"num":14,"verse":"But when some raw skin appears on him, he shall be held to be unclean."},{"num":15,"verse":"The priest, when he sees the raw skin, shall declare him unclean. The raw skin is unclean; it is leprosy."},{"num":16,"verse":"But if the raw skin becomes white, then he shall come before the priest"},{"num":17,"verse":"and the priest shall examine him. If he sees that the sore has turned white, the priest shall declare the person with the sore to be clean, for he is clean."},{"num":18,"verse":"“When someone has a boil on the skin that has healed,"},{"num":19,"verse":"and then a whitish-red bump or spot appears where the boil was, he shall show it to the priest."},{"num":20,"verse":"The priest shall examine it. If he sees that it is deeper than the skin and the hair has turned white, then the priest shall declare him to be unclean. It is a leprous sore that has broken out from the boil."},{"num":21,"verse":"But if the priest, upon examining it, sees that it does not have white hair and it is not deeper than the skin, but rather it is a bit darker, then the priest shall quarantine him for seven days."},{"num":22,"verse":"If it spreads over the skin, then the priest shall declare him to be unclean, for the spot is leprous."},{"num":23,"verse":"But if the spot stays put and does not spread, then it is a scar from the boil and the priest shall declare him to be clean."},{"num":24,"verse":"“When someone has a burn, and the raw burn becomes a reddish-white spot,"},{"num":25,"verse":"then the priest shall examine it. If the hair of the spot has turned white and it appears to be deeper than the skin, then it is leprosy. It has broken out of the burn. The priest shall declare him unclean, for it is a leprous sore."},{"num":26,"verse":"But if the priest examines it and there is no white hair on the spot and it is not deeper than the skin, but is a bit darker, then the priest shall quarantine him for seven days."},{"num":27,"verse":"On the seventh day the priest shall examine him again. If it has spread over the skin, then the priest shall pronounce him to be unclean. It is a leprous sore."},{"num":28,"verse":"But if the spot has remained where it was and it has not spread on the skin, but it is somewhat darker, then it is only the swelling of a burn. The priest shall declare him to be clean, because it is only the scar from a burn."},{"num":29,"verse":"“When a man or a woman has a sore on the head or the beard,"},{"num":30,"verse":"the priest will examine the sore. If it is deeper than the skin and the hair on it is yellow and thin, then the priest shall pronounce it to be unclean. It is the scab of leprosy of the head or the beard."},{"num":31,"verse":"But if the priest examines the scab and it is not deeper than the skin and there is no black hair on it, then the priest shall quarantine the person with the scab for seven days."},{"num":32,"verse":"On the seventh day the priest shall examine the sore. If the scab has not spread and there is no yellow hair on it, and the scab does not appear to be deeper than the skin,"},{"num":33,"verse":"then the man shall be shaven, but the scab is not to be shaved. He is to be quarantined another seven days."},{"num":34,"verse":"On the seventh day the priest shall examine the scab. If the scab has not spread on the skin and it does not appear to be deeper than the skin, then the priest shall declare him to be clean. He shall wash his clothes, for he is clean."},{"num":35,"verse":"But if the scab spreads after his cleansing,"},{"num":36,"verse":"the priest shall examine him. If the scab has spread, the priest need not look for yellow hair. He is unclean."},{"num":37,"verse":"But if, from his viewpoint, the scab has not grown larger and black hair has grown upon it, then the scab is clean. The priest shall declare him clean."},{"num":38,"verse":"When a man or a woman has white spots on the skin of the body,"},{"num":39,"verse":"the priest shall examine that person. If the spots on the skin of the body are dull white, it is only a skin rash. The person is clean."},{"num":40,"verse":"“When a man has lost the hair on his head and he is bald, he is clean."},{"num":41,"verse":"If he has lost the hair from the front of his head, and he has a bald forehead, he is clean."},{"num":42,"verse":"But if there is a white reddish sore on his bald head or his bald forehead, it is leprosy that has broken out on his bald head or his bald forehead."},{"num":43,"verse":"The priest shall examine him. If the swollen sore on his bald head or his bald forehead is reddish-white, looking like leprosy on the skin,"},{"num":44,"verse":"then he has leprosy and he is unclean. The priest shall declare him unclean because of the sore on his head."},{"num":45,"verse":"“Anyone who is infected with leprosy shall wear torn clothes, his head is to be uncovered, and he is to cover his moustache. He shall cry out, ‘Unclean, unclean!’"},{"num":46,"verse":"As long as he is infected, he shall be utterly unclean. He will live alone; his dwelling shall be outside of the camp."},{"num":47,"verse":"Infections in Fabrics.“When a garment has a leprous mark on it, whether it be a woolen garment or a linen garment,"},{"num":48,"verse":"whether it is in the weave or the knit of the wool or the linen, or if it is a skin or anything made of a skin,"},{"num":49,"verse":"if there is a green or red spot on the garment or the skin, whether in the weave or the knit or on anything made of skin, it is to be considered a mark of leprosy and it is to be shown to the priest."},{"num":50,"verse":"The priest shall look at the spot, and shall secure that thing that is infected for seven days."},{"num":51,"verse":"He shall examine the mark on the seventh day. If the spot on the garment has spread, whether it be in the weave or the knit, or on the skin or on anything that is made of skin, then the spot is an active leprosy. It is unclean."},{"num":52,"verse":"He shall burn the garment, whether the spot is in the weave or the knit, whether it is made of wool or linen or is anything made of skin. It has an active leprosy, and it shall be burned in the fire."},{"num":53,"verse":"But if the priest examines it and the spot has not spread on the garment, either in the weave or the knit or on anything made of skin,"},{"num":54,"verse":"then the priest shall order that the thing with the mark be washed, and he shall secure it for seven more days."},{"num":55,"verse":"The priest shall examine the thing with the spot after it has been washed. If the color of the spot has not changed, even if it has not spread, it is unclean. It shall be burned in the fire whether the bare spot is on the inside or outside."},{"num":56,"verse":"If the priest examines the garment and the spot has faded after the washing, then he shall tear it out of the garment, whether it be made of skin or woven or knitted."},{"num":57,"verse":"But if it reappears on the garment, whether in the weave or the knit or on anything made of skin, it is spreading. Whatever is infected shall be burned in the fire."},{"num":58,"verse":"The garment, whether of weave or knit or anything made of skin, that has been washed and no longer has the spot, shall be washed a second time and it will then be clean."},{"num":59,"verse":"These are the statutes concerning infections of leprosy upon garments, whether woolen or linen, woven or knitted, or on anything made of skin, on how to declare it clean or to declare it unclean.”"}]