[{"num":1,"verse":"The Lord said to Moses and Aaron, “If anyone notices a swelling in his skin, or a scab or boil or pimple with transparent skin, leprosy is to be suspected. He must be brought to Aaron the priest or to one of his sons "},{"num":3,"verse":"for the spot to be examined. If the hair in this spot turns white, and if the spot looks to be more than skin-deep, it is leprosy, and the priest must declare him a leper."},{"num":4,"verse":"“But if the white spot in the skin does not seem to be deeper than the skin and the hair in the spot has not turned white, the priest shall quarantine him for seven days. "},{"num":5,"verse":"At the end of that time, on the seventh day, the priest will examine him again, and if the spot has not changed and has not spread in the skin, then the priest must quarantine him seven days more. "},{"num":6,"verse":"Again on the seventh day the priest will examine him, and if the marks of the disease have become fainter and have not spread, then the priest shall pronounce him cured; it was only a scab, and the man need only wash his clothes and everything will be normal again. "},{"num":7,"verse":"But if the spot spreads in the skin after he has come to the priest to be examined, he must come back to the priest again, "},{"num":8,"verse":"and the priest shall look again, and if the spot has spread, then the priest must pronounce him a leper."},{"num":9,"verse":"“When anyone suspected of having leprosy is brought to the priest, the priest is to look to see if there is a white swelling in the skin with white hairs in the spot, and an ulcer developing. "},{"num":11,"verse":"If he finds these symptoms, it is an established case of leprosy, and the priest must pronounce him defiled. The man is not to be quarantined for further observation, for he is definitely diseased. "},{"num":12,"verse":"But if the priest sees that the leprosy has erupted and spread all over his body from head to foot wherever he looks, "},{"num":13,"verse":"then the priest shall pronounce him cured of leprosy, for it has all turned white; he is cured. "},{"num":14,"verse":"But if there is raw flesh anywhere, the man shall be declared a leper. It is proved by the raw flesh. "},{"num":16,"verse":"But if the raw flesh later changes to white, the leper will return to the priest to be examined again. If the spot has indeed turned completely white, then the priest will pronounce him cured."},{"num":18,"verse":"“In the case of a man who has a boil in his skin which heals, "},{"num":19,"verse":"but which leaves a white swelling or a bright spot, sort of reddish white, the man must go to the priest for examination. "},{"num":20,"verse":"If the priest sees that the trouble seems to be down under the skin, and if the hair at the spot has turned white, then the priest shall declare him defiled, for leprosy has broken out from the boil. "},{"num":21,"verse":"But if the priest sees that there are no white hairs in this spot, and the spot does not appear to be deeper than the skin, and if the color is gray, then the priest shall quarantine him for seven days. "},{"num":22,"verse":"If during that time the spot spreads, the priest must declare him a leper. "},{"num":23,"verse":"But if the bright spot grows no larger and does not spread, it is merely the scar from the boil, and the priest shall declare that all is well."},{"num":24,"verse":"“If a man is burned in some way, and the burned place becomes bright reddish white or white, "},{"num":25,"verse":"then the priest must examine the spot. If the hair in the bright spot turns white and the problem seems to be more than skin-deep, it is leprosy that has broken out from the burn, and the priest must pronounce him a leper. "},{"num":26,"verse":"But if the priest sees that there are no white hairs in the bright spot and the brightness appears to be no deeper than the skin and is fading, the priest shall quarantine him for seven days "},{"num":27,"verse":"and examine him again the seventh day. If the spot spreads in the skin, the priest must pronounce him a leper.* "},{"num":28,"verse":"But if the bright spot does not move or spread in the skin, and is fading, it is simply a scar from the burn, and the priest shall declare that he does not have leprosy."},{"num":29,"verse":"“If a man or woman has a sore on the head or chin, the priest must examine him; if the infection seems to be below the skin and yellow hair is found in the sore, the priest must pronounce him a leper. "},{"num":31,"verse":"But if the priest’s examination reveals that the spot seems to be only in the skin but there is healthy hair in it, then he shall be quarantined for seven days, "},{"num":32,"verse":"and examined again on the seventh day. If the spot has not spread and no yellow hair has appeared, and if the infection does not seem to be deeper than the skin, "},{"num":33,"verse":"he shall shave off all the hair around the spot (but not on the spot itself) and the priest shall quarantine him for another seven days. "},{"num":34,"verse":"He shall be examined again on the seventh day, and if the spot has not spread, and it appears to be no deeper than the skin, the priest shall pronounce him well, and after washing his clothes, he is free. "},{"num":35,"verse":"But if, later on, this spot begins to spread, "},{"num":36,"verse":"then the priest must examine him again and, without waiting to see if any yellow hair develops, declare him a leper. "},{"num":37,"verse":"But if it appears that the spreading has stopped and black hairs are found in the spot, then he is healed and is not a leper, and the priest shall declare him healed."},{"num":38,"verse":"“If a man or a woman has white, transparent areas in the skin, "},{"num":39,"verse":"but these spots are growing dimmer, this is not leprosy, but an ordinary infection that has broken out in the skin."},{"num":40,"verse":"“If a man’s hair is gone, this does not make him a leper even though he is bald! "},{"num":41,"verse":"If the hair is gone from the front part of his head, he simply has a bald forehead, but this is not leprosy. "},{"num":42,"verse":"However, if in the baldness there is a reddish white spot, it may be leprosy breaking out. "},{"num":43,"verse":"In that case the priest shall examine him, and if there is a reddish white lump that looks like leprosy, "},{"num":44,"verse":"then he is a leper, and the priest must pronounce him such."},{"num":45,"verse":"“Anyone who is discovered to have leprosy must tear his clothes and let his hair grow in wild disarray, and cover his upper lip and call out as he goes, “I am a leper, I am a leper.” "},{"num":46,"verse":"As long as the disease lasts, he is defiled and must live outside the camp."},{"num":47,"verse":"“If leprosy is suspected in a woolen or linen garment or fabric, or in a piece of leather or leatherwork, "},{"num":49,"verse":"and there is a greenish or a reddish spot in it, it is probably leprosy, and must be taken to the priest to be examined. "},{"num":50,"verse":"The priest will put it away for seven days "},{"num":51,"verse":"and look at it again on the seventh day. If the spot has spread, it is a contagious leprosy, "},{"num":52,"verse":"and he must burn the clothing, fabric, linen or woolen covering, or leather article, for it is contagious and must be destroyed by fire."},{"num":53,"verse":"“But if when he examines it again on the seventh day the spot has not spread, "},{"num":54,"verse":"the priest shall order the suspected article to be washed, then isolated for seven more days. "},{"num":55,"verse":"If after that time the spot has not changed its color, even though it has not spread, it is leprosy and shall be burned, for the article is infected through and through. "},{"num":56,"verse":"But if the priest sees that the spot has faded after the washing, then he shall cut it out from the garment or leather goods or whatever it is in. "},{"num":57,"verse":"However, if it then reappears, it is leprosy and he must burn it. "},{"num":58,"verse":"But if after washing it there is no further trouble, it can be put back into service after another washing.”"},{"num":59,"verse":"These are the regulations concerning leprosy in a garment or anything made of skin or leather, indicating whether to pronounce it leprous or not."}]