[{"num":1,"verse":"A soft answer putteth away wrath: but grievous words stir up anger."},{"num":2,"verse":"The tongue of the wise useth knowledge aright: but the mouth of fools babbleth out foolishness."},{"num":3,"verse":"The eyes of the Lord in every place behold the evil and the good."},{"num":4,"verse":"A wholesome tongue is as a tree of life: but the frowardness thereof is the breaking of the mind."},{"num":5,"verse":"A fool despiseth his father’s instruction, but he that regardeth correction, is prudent."},{"num":6,"verse":"The house of the righteous hath much treasure: but in the revenues of the wicked is trouble."},{"num":7,"verse":"The lips of the wise do spread abroad knowledge: but the heart of the foolish doth not so."},{"num":8,"verse":"The sacrifice of the wicked is abomination unto the Lord: but the prayer of the righteous is acceptable unto him."},{"num":9,"verse":"The way of the wicked is an abomination unto the Lord: but he loveth him that followeth righteousness."},{"num":10,"verse":"Instruction is evil to him that forsaketh the way, and he that hateth correction, shall die."},{"num":11,"verse":"Hell and destruction are before the Lord, how much more the hearts of the sons of men?"},{"num":12,"verse":"A scorner loveth not him that rebuketh him, neither will he go unto the wise."},{"num":13,"verse":"A joyful heart maketh a cheerful countenance: but by the sorrow of the heart the mind is heavy."},{"num":14,"verse":"The heart of him that hath understanding, seeketh knowledge: but the mouth of the fool is fed with foolishness."},{"num":15,"verse":"All the days of the afflicted are evil; but a good conscience is a continual feast."},{"num":16,"verse":"Better is a little with the fear of the Lord, than great treasure and trouble therewith."},{"num":17,"verse":"Better is a dinner of green herbs where love is, than a stalled ox and hatred therewith."},{"num":18,"verse":"An angry man stirreth up strife: but he that is slow to wrath, appeaseth strife."},{"num":19,"verse":"The way of a slothful man is as an hedge of thorns: but the way of the righteous is plain."},{"num":20,"verse":"A wise son rejoiceth the father: but a foolish man despiseth his mother."},{"num":21,"verse":"Foolishness is joy to him that is destitute of understanding: but a man of understanding walketh uprightly."},{"num":22,"verse":"Without counsel, thoughts come to nought: but in the multitude of counselors there is steadfastness."},{"num":23,"verse":"A joy cometh to a man by the answer of his mouth: and how good is a word in due season?"},{"num":24,"verse":"The way of life is on high to the prudent, to avoid from hell beneath."},{"num":25,"verse":"The Lord will destroy the house of the proud men: but he will stablish the borders of the widow."},{"num":26,"verse":"The thoughts of the wicked are abomination to the Lord: but the pure have pleasant words."},{"num":27,"verse":"He that is greedy of gain, troubleth his own house: but he that beareth gifts, shall live."},{"num":28,"verse":"The heart of the righteous studieth to answer: but the wicked man’s mouth babbleth evil things."},{"num":29,"verse":"The Lord is far off from the wicked: but he heareth the prayer of the righteous."},{"num":30,"verse":"The light of the eyes rejoiceth the heart, and a good name maketh the bones fat."},{"num":31,"verse":"The ear that hearkeneth to the correction of life, shall lodge among the wise."},{"num":32,"verse":"He that refuseth instruction, despiseth his own soul: but he that obeyeth correction, getteth understanding."},{"num":33,"verse":"The fear of the Lord is the instruction of wisdom: and before honor goeth humility."}]