[{"header":"The Craftsmen"},{"num":31,"verse":"The Lord spoke to Moses: "},{"num":2,"verse":"“Look, here is Bezalel, the son of Uri, the son of Hur, from the tribe of Judah. I have called him by name. "},{"num":3,"verse":"I have filled him with the Spirit of God, with wisdom, understanding, and knowledge, and with skill in all kinds of crafts. "},{"num":4,"verse":"He has the ability to create designs. He works with gold, silver, and bronze. "},{"num":5,"verse":"He is able to cut and engrave precious stones and mount them. He can also carve wood. He works skillfully in all kinds of crafts."},{"num":6,"verse":"“Not only that, but I have also appointed Oholiab son of Ahisamak, from the tribe of Dan, to work with him. I have put wisdom into the heart of all the skilled craftsmen, so that they may make everything that I have commanded you: "},{"num":7,"verse":"the Tent of Meeting, the Ark of the Testimony, the atonement seat that is on it, all the furnishings for the tent, "},{"num":8,"verse":"the table and its vessels and accessories, the pure gold lampstand with all its utensils, the altar for incense, "},{"num":9,"verse":"the altar for burnt offerings with all its utensils, the basin and its pedestal, "},{"num":10,"verse":"the finely woven garments (the holy garments for Aaron the priest), the garments for his sons to minister in the priest’s office, "},{"num":11,"verse":"the anointing oil, and the incense made of fragrant spices for the Holy Place. The skilled craftsmen shall do everything just as I commanded.”"},{"header":"The Sabbath"},{"num":12,"verse":"The Lord spoke to Moses. He said, "},{"num":13,"verse":"“Speak to the people of Israel. Tell them, ‘You must observe my Sabbaths diligently, because the Sabbath is a sign between me and you throughout your generations, so that you may know that I am the Lord, who sets you apart as holy. "},{"num":14,"verse":"So you shall observe the Sabbath, for it is holy to you. Everyone who profanes it must certainly be put to death, for if anyone does any work on the Sabbath, his life shall be cut off from among his people. "},{"num":15,"verse":"On six days work may be done, but the seventh day is a sabbath of complete rest, holy to the Lord. Whoever does any work on the Sabbath day must certainly be put to death. "},{"num":16,"verse":"Therefore the people of Israel shall observe the Sabbath by keeping the Sabbath throughout their generations as a perpetual covenant. "},{"num":17,"verse":"It is a permanent sign between me and the people of Israel, for in six days the Lord made heaven and earth, and on the seventh day he rested and was refreshed.’”"},{"num":18,"verse":"When the Lord had finished speaking with Moses on Mount Sinai, he gave him the two tablets of the Testimony, stone tablets, written with God’s finger."}]