[[],[{"type":"header","content":"The Skilled Craftsmen"},{"type":"prose","content":"Now the  spoke to Moses, saying,"}],[{"type":"prose","content":"“See, I have called by name Bezalel, the son of Uri, the son of Hur, of the tribe of Judah."}],[{"type":"prose","content":"And I have filled him with the Spirit of God in wisdom, in understanding, in knowledge, and in all  craftsmanship,"}],[{"type":"prose","content":"to create artistic designs for work in gold, in silver, and in bronze,"}],[{"type":"prose","content":"and in the cutting of stones for settings, and in the carving of wood, so that he may work in all  craftsmanship."}],[{"type":"prose","content":"And behold, I Myself have appointed with him Oholiab, the son of Ahisamach, of the tribe of Dan; and in the hearts of all who are skillful I have put skill, so that they may make everything that I have commanded you:"}],[{"type":"prose","content":"the tent of meeting, the ark of testimony, the atoning cover that is on it, and all the furniture of the tent,"}],[{"type":"prose","content":"the table and its utensils, the pure  lampstand with all its utensils, and the altar of incense,"}],[{"type":"prose","content":"the altar of burnt offering with all its utensils, and the basin and its stand,"}],[{"type":"prose","content":"the woven garments as well: the holy garments for Aaron the priest and the garments of his sons,  to carry out their priesthood;"}],[{"type":"prose","content":"the anointing oil also, and the fragrant incense for the Holy Place, they are to make  according to everything that I have commanded you.”"},{"type":"header","content":"The Sign of the Sabbath"}],[{"type":"prose","content":"Now the  spoke to Moses, saying,"}],[{"type":"prose","content":"“Now as for you, speak to the sons of Israel, saying, ‘You must keep My Sabbaths; for  is a sign between Me and you throughout your generations, so that you may know that I am the  who sanctifies you."}],[{"type":"prose","content":"Therefore you are to keep the Sabbath, for it is holy to you. Everyone who profanes it must be put to death; for whoever does  work on it, that person shall be cut off from among his people."}],[{"type":"prose","content":"For six days work may be done, but on the seventh day there is a Sabbath of complete rest, holy to the ; whoever does  work on the Sabbath day must be put to death."}],[{"type":"prose","content":"So the sons of Israel shall keep the Sabbath, to celebrate the Sabbath throughout their generations as a permanent covenant.’"}],[{"type":"prose","content":"It is a sign between Me and the sons of Israel forever; for in six days the  made heaven and earth, but on the seventh day He ceased , and was refreshed.”"}],[{"type":"prose","content":"When He had finished speaking with him on Mount Sinai, He gave Moses the two tablets of the testimony, tablets of stone, written by the finger of God."}]]