[{"num":31,"verse":"And the Lord spake to Moses, saying,"},{"num":2,"verse":"Lo! I have called Bezaleel by name, the son of Uri, son of Hur, of the lineage of Judah; (Lo! I have called by name Bezaleel, the son of Uri, the son of Hur, of the tribe of Judah;)"},{"num":3,"verse":"and I have filled him with the spirit of God, with wisdom, and understanding, and knowing in all (manner of) work,"},{"num":4,"verse":"to find out, or cast, whatever thing may be made subtly of gold, and silver, and brass, (to design whatever things may be made out of gold, and silver, and bronze,)"},{"num":5,"verse":"and marble, and gems, and of (the) diversity of woods."},{"num":6,"verse":"And I have given to him a fellow, Aholiab, the son of Ahisamach, of the kindred of Dan; and I have put in their hearts the wisdom of each learned man, that they make all things which I have commanded to thee; (And I have given for fellowship to him, Aholiab, the son of Ahisamach, of the family, or the tribe, of Dan; and I have put wisdom in the heart of other learned men, so that they know how to make all the things which I have commanded to thee;)"},{"num":7,"verse":"the tabernacle of [the] bond of peace, and the ark of witnessing, and the propitiatory, or the table, that is thereon, and all the vessels of the tabernacle; (the Tabernacle of the Covenant, that is, the Tabernacle of the Witnessing, and the Ark of the Witnessing, and the propitiatory, that is the lid, that covereth the Ark, and all the vessels of the Tabernacle;)"},{"num":8,"verse":"also the board, and the vessels thereof, the cleanest candlestick with his vessels, and the altars of incense, (and the table, and its vessels, the lamp-stand of pure gold, and its vessels, and the altar of incense,)"},{"num":9,"verse":"and of burnt sacrifice, and all the vessels of them; the great washing vessel with his foundament; (and the altar of burnt sacrifice, and all their vessels; the great washing vessel, and its foundation, or its base;)"},{"num":10,"verse":"[the] holy clothes in service to Aaron the priest, and to his sons, that they be set in their office in holy things; (the holy clothes of ministry for Aaron the priest, and for his sons, to use when they serve as my priests;)"},{"num":11,"verse":"the oil of anointing, and the incense of sweet smelling spiceries in the saintuary (the anointing oil, and the incense of sweet smelling spices for the sanctuary); they shall make all these things that I have commanded to thee."},{"num":12,"verse":"And the Lord spake to Moses, saying,"},{"num":13,"verse":"Speak thou to the sons of Israel, and thou shalt say to them, See ye that ye keep my sabbath, for it is a sign betwixt me and you in your generations; that ye know, that I am the Lord, which hallow[eth] you. (Speak thou to the Israelites, and thou shalt say to them, See ye that ye keep my sabbath, for it is a sign between me and you for all generations to come; so that ye know, that I am the Lord, who halloweth you.)"},{"num":14,"verse":"Keep ye my sabbath, for it is holy to you; he that defouleth it, shall die by death (he who defileth it, must be put to death); (yea,) the soul of him, that doeth work in the sabbath, shall perish from the midst of his people."},{"num":15,"verse":"Six days ye shall do work; in the seventh day is sabbath, the holy rest to the Lord; each man that doeth work in this day shall die. (For six days ye shall do work; but on the seventh day is the sabbath of rest, which is holy to the Lord; any person who doeth work on this day must be put to death.)"},{"num":16,"verse":"The sons of Israel keep [the] sabbath, and hallow it in their generations; it is a covenant everlasting (The Israelites shall keep the sabbath, and make it holy in all their generations; it is an everlasting covenant)"},{"num":17,"verse":"betwixt me and the sons of Israel, and it is a sign everlasting; for in six days God made heaven and earth, and in the seventh day he ceased of work. (between me and the Israelites, and it is an everlasting sign; for in six days God made the heavens and the earth, and on the seventh day he ceased from all his work.)"},{"num":18,"verse":"And when he had [ful]filled to speak to Moses, the Lord gave to Moses, in the hill of Sinai, two stone tables of witnessing, written with the finger of God. (And when he had finished speaking with Moses on Mount Sinai, the Lord gave Moses the two stone tablets of the Witnessing, that is, the Law, written with the finger of God.)"}]