[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13:6-11 It is the policy of Satan to try to lead us to evil by those whom we love, whom we least suspect of any ill design, and whom we are desirous to please, and apt to conform to. The enticement here is supposed to come from a brother or child, who are near by nature; from a wife or friend, who are near by choice, and are to us as our souls. But it is our duty to prefer God and religion, before the nearest and dearest friends we have in the world. We must not, to please our friends, break God's law. Thou shalt not consent to him, nor go with him, not for company, or curiosity, not to gain his affections. It is a general rule, If sinners entice thee, consent thou not, Pr 1:10. And we must not hinder the course of God's justice.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "If thy brother, the son of thy mother, or thy son, or thy daughter, or the wife of thy bosom, or thy friend, which is as thine own soul, entice thee secretly, saying, Let us go and serve other gods, which thou hast not known, thou, nor thy fathers; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9. thou shalt surely kill him—not hastily, or in a private manner, but after trial and conviction; and his relative, as informer, was to cast the first stone (see on [126]De 17:2; [127]Ac 7:58). It is manifest that what was done in secret could not be legally proved by a single informer; and hence Jewish writers say that spies were set in some private part of the house, to hear the conversation and watch the conduct of a person suspected of idolatrous tendencies.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And thou shalt stone him with stones, that he die,.... It was not sufficient to answer the end of the law to cast a few stones at him, but he was to be stoned to death: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "because he hath sought to thrust thee away from the Lord thy God; to compel by force of argument, or the dint of persuasion, to relinquish the profession of the true God, faith in him, and the worship of him: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "which brought thee out of the land of Egypt, from the house of bondage; which aggravated the sin of the enticer, and would have made the sin of the enticed the more heinous had he fallen into it. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "which brought thee out of the land of Egypt, from the house of bondage; which aggravated the sin of the enticer, and would have made the sin of the enticed the more heinous had he fallen into it. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And thou shalt stone him with stones, that he die; because he hath sought to thrust thee away from the LORD thy God, which brought thee out of the land of Egypt, from the house of bondage.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "To such persuasion Israel was not to yield, nor were they to spare the tempters. The accumulation of synonyms (pity, spare, conceal) serves to make the passage more emphatic. כּסּה, to cover, i.e., to keep secret, conceal. They were to put him to death without pity, viz., to stone him (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 20:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). That the execution even in this case was to be carried out by the regular authorities, is evident from the words, \"thy hand shall be first against him to put him to death, and the hand of all the people afterwards,\" which presuppose the judicial procedure prescribed in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 17:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", that the witnesses were to cast the first stones at the person condemned. ",
        "children": []
      }
    ]
  }
]