[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Deuteronomy 13:2-3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 13:2-3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And the sign or wonder come to pass ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— God permitting Satan or his agents to do what is above the ordinary course of nature for thy trial. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Saying, Let us go after other gods — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That is, who, upon the sign’s coming to pass which he gave thee to confirm his doctrine, would persuade thee to go after other gods. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Thou shalt not hearken unto that prophet — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Shalt not receive his doctrine; but, though the event confirm the prediction, thou shalt look upon him as a liar, and teacher of false doctrine. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For the Lord your God proveth you ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— That is, trieth your faith, love, and obedience, and examineth your sincerity by your constancy in his service, in opposition to all temptations to desert it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "To know — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Or make known publicly and openly, namely, that both you and others may know and see it, in order that the justice of his dispensations toward you, whether in judgment or mercy, may be evident and glorious. The reasonableness of what Moses here enjoins is manifest. For the existence and infinite perfections of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "one living and true God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "the truth and goodness of his religion, and the authority of his laws being already so fully demonstrated by evidences of all kinds, evidences continued, and beyond all exception; and, on the contrary, the gods of the heathen being so evidently either nonentities or false pretenders to divinity, and their worship so full of absurdity, folly, and the worst kinds of wickedness, it was not to be thought that a mere miracle, or a number of miracles or wonders, for the performance of which, if really performed, they could not account, or the fulfilling of a prediction, by any opposer of the true God, was a sufficient reason why they should abandon God’s worship, call in question the truth of his religion, or go after any other god. Moses properly teaches them that the true divinity of miracles and wonders ought to be judged of by the doctrines, designs, and purposes, for the abetting and confirming whereof they were wrought; that every pretender to miracles, who would seduce men to false and irrational principles of religion, was to be looked upon as an impostor, and notwithstanding all he could do or say, they were steadily to adhere to the service of Him who had given them so many proofs that he, and he alone, was the true God, and to his religion and worship, which had been so amply confirmed; concluding that God, by permitting such impostors, intended only to try their faith and sincerity. Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 12:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 John 4:1-6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". We may infer from hence, that the attempts of the Roman Catholics to prove their peculiar doctrines by miracles are vain; for they ought first to show them to be agreeable to reason and religion, before they attempt to prove them by miracles. For so long as they appear contrary to reason and Scripture, and repugnant to common sense, it will never be in the power of miracles, how numerous and stupendous soever, to establish the truth of them. Far less of their pretended miracles, which are nothing else but mere tricks and impostures.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13:1-5 Moses had cautioned against the peril that might arise from the Canaanites. Here he cautions against the rise of idolatry among themselves. It is needful for us to be well acquainted with the truths and precepts of the Bible; for we may expect to be proved by temptations of evil under the appearance of good, of error in the guise of truth; nor can any thing rightly oppose such temptations, but the plain, express testimony of God's word to the contrary. And it would be a proof of sincere affection for God, that, notwithstanding specious pretences, they should not be wrought upon the forsake God, and follow other gods to serve them.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The Lord had said, \"Thou shalt have none other gods but Me.\" A prophet is here supposed who invites the people \"to go after other gods.\" To such a one no credit is under any circumstances to be given, even should he show signs and wonders to authenticate his doctrine. The standing rule of faith and practice had been laid down once for all - that the people were to hold fast. The prophet who propounded another rule could only be an impostor.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "A different case is considered in Deuteronomy 18:18, etc. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "A different case is considered in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 18:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", etc. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "CHAPTER 13",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "De 13:1-5. Enticers to Idolatry to Be Put to Death.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. If there arise among you a prophet—The special counsels which follow arose out of the general precept contained in De 12:32; and the purport of them is, that every attempt to seduce others from the course of duty which that divine standard of faith and worship prescribes must not only be strenuously resisted, but the seducer punished by the law of the land. This is exemplified in three cases of enticement to idolatry.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "a prophet—that is, some notable person laying claim to the character and authority of the prophetic office (Nu 12:6; 1Sa 10:6), performing feats of dexterity or power in support of his pretensions, or even predicting events which occurred as he foretold; as, for instance, an eclipse which a knowledge of natural science might enable him to anticipate (or, as Caiaphas, Joh 18:14). Should the aim of such a one be to seduce the people from the worship of the true God, he is an impostor and must be put to death. No prodigy, however wonderful, no human authority, however great, should be allowed to shake their belief in the divine character and truth of a religion so solemnly taught and so awfully attested (compare Ga 1:8). The modern Jews appeal to this passage as justifying their rejection of Jesus Christ. But He possessed all the characteristics of a true prophet, and He was so far from alienating the people from God and His worship that the grand object of His ministry was to lead to a purer, more spiritual and perfect observance of the law.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And the sign or the wonder come to pass; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which God may suffer for the reason after mentioned. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Saying:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " this word is to be joined with the beginning of ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Deu 13:1",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deu 13:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "If there arise among you a prophet, or dreamer of dreams, saying, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " what there follows, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "and giveth thee a sign, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "& c., to confirm his doctrine; such transpositions are frequent. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the sign and wonder come to pass whereof he spake unto thee,.... The sign he promised to give, or the miracle he proposed to do, to show the reality of his mission, and the truth of his doctrine, which is performed, or seemingly performed, by legerdemain, by magic art, or by the help of the devil; which the Lord sometimes suffered for the trial of the faith and obedience of his people, and for the hardening of others in their unbelief, and which issues in their destruction; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Thessalonians 2:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "saying, let us go after other gods (which thou hast not known), and let us serve them; other gods besides the one living and true God, the Creator of all things; strange gods, the idols of the people, as the Targum of Jonathan; such as they had never heard of, nor had any knowledge of, nor any benefit from, as they had of the Lord their God. Now the doctrines of these, and of their worship, are what the false prophet or dreamer is supposed to come with, and inculcate into the minds of the people; and for the confirmation of which, and in order to draw them into the reception of them, and act according to them, he proposed to give a sign or wonder. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "saying, let us go after other gods (which thou hast not known), and let us serve them; other gods besides the one living and true God, the Creator of all things; strange gods, the idols of the people, as the Targum of Jonathan; such as they had never heard of, nor had any knowledge of, nor any benefit from, as they had of the Lord their God. Now the doctrines of these, and of their worship, are what the false prophet or dreamer is supposed to come with, and inculcate into the minds of the people; and for the confirmation of which, and in order to draw them into the reception of them, and act according to them, he proposed to give a sign or wonder. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And the sign or the wonder come to pass, whereof he spake unto thee, saying, {b} Let us go after other gods, which thou hast not known, and let us serve them;",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And the sign or the wonder come to pass, whereof he spake unto thee, saying, ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{b}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Let us go after other gods, which thou hast not known, and let us serve them;",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) He shows that to which the false prophets tend.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The first case. If a prophet, or one who had dreams, should rise up to summon to the worship of other gods, with signs and wonders which came to pass, the Israelites were not to hearken to his words, but to put him to death. The introduction of חלום חלם, \"a dreamer of dreams,\" along with the prophet, answers the two media of divine revelation, the vision and the dream, by which, according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 12:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", God made known His will. With regard to the signs and wonders (mopheth, see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 4:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") with which such a prophet might seek to accredit his higher mission, it is taken for granted that they come to pass (בּוא); yet for all that, the Israelites were to give no heed to such a prophet, to walk after other gods. It follows from this, that the person had not been sent by God, but as a false prophet, and that the signs and wonders which he gave were not wonders effected by God, but σημεῖα καὶ τέρατα ψεύδους (\"lying sings and wonders,\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Thessalonians 2:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); i.e., not merely seeming miracles, but miracles wrought in the power of the wicked one, Satan, the possibility and reality of which even Christ attests (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 24:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). - The word לאמר, saying, is dependent upon the principal verb of the sentence: \"if a prophet rise up...saying, We will go after other gods.\" ",
        "children": []
      }
    ]
  }
]