[{"header":"Signatories of the Covenant"},{"num":10,"verse":"Now the names of those on the sealed agreement were:"},{"header":"Summary of the Covenant"},{"num":28,"verse":"The remainder of the people, the priests, the Levites, the gatekeepers, the singers, the temple servants, and all those who on the basis of the Law of God separated themselves from the people of the lands—their wives, their sons, and their daughters, that is, every one capable of knowledge and understanding— "},{"num":29,"verse":"have decisively joined in with their countrymen and their nobles, and obligated themselves—by both a curse and an oath—to walk in the Law of God, which was given by Moses the servant of God, and to observe and do all the commandments of the Lord who is our Lord, along with His judgments and His statutes "},{"num":30,"verse":"so that we will not give our daughters to the people of the land nor take their daughters for our sons."},{"num":31,"verse":"If the people of the land bring merchandise or any grain on the Sabbath day to sell, we will not buy from them on the Sabbath or a holy day. We will also renounce the seventh year harvest and the full payment of every debt."},{"num":32,"verse":"We also establish for ourselves the ordinance to collect from ourselves annually one-third of a shekel for the service of the house of our God: "},{"num":33,"verse":"for the showbread, the continual grain offering, the continual burnt offering, the Sabbaths, the New Moons, the appointed feasts, the holy things, and the sin offerings to make an atonement for Israel, as well as for all the work of the house of our God."},{"num":34,"verse":"Also, we cast lots to determine the duty of the supply of wood that the priests, the Levites, and the people—according to the houses of our fathers, being set by annually appointed times—might bring to the house of our God, in order to burn it on the altar of the Lord our God, as it is written in the Law; "},{"num":35,"verse":"and, likewise, for the annual bringing of the first fruits of our ground and the first fruits of all fruit of all trees to the house of the Lord; "},{"num":36,"verse":"and for bringing to the priests who are ministering at the house of God, the firstborn of our sons and livestock, as it is written in the Law, plus the firstborn of our herds and flocks."},{"num":37,"verse":"Moreover, the first of our fresh dough, our contributions, the fruit of every tree, and the new wine and oil we will bring to the priests at the chambers of the house of our God, but the tithe of our crops we will bring to the Levites, since they themselves receive the tithes in all our agricultural cities. "},{"num":38,"verse":"There must be a priest, a descendant of Aaron, with the Levites when they are collecting tithes, and the Levites will offer a tenth of the tithes to the house of our God, for the chambers of the storehouse. "},{"num":39,"verse":"Both the children of Israel and the Levites should bring the contribution of the grain, new wine, and the fresh oil to the chambers because the vessels of the sanctuary and the ministering priests, the gatekeepers, and the singers are there."}]