[{"num":10,"verse":"Now those that sealed were, Nechemyah the tirshata ben Chachalyah, and Tzedekyah,"},{"num":3,"verse":"Serayah, Azaryah, Yirmeyah,"},{"num":4,"verse":"Pashchur, Amaryah, Malkiyah,"},{"num":5,"verse":"Chattush, Shevanyah, Maluch,"},{"num":6,"verse":"Charim, Meremot, Ovadyah,"},{"num":7,"verse":"Daniel, Ginton, Baruch,"},{"num":8,"verse":"Meshullam, Aviyah, Miyamin,"},{"num":9,"verse":"Ma’azyah, Bilgai, Shemayah; these were the kohanim."},{"num":10,"verse":"And the Levi’im; both Yeshua ben Azanyah, Binnui of the Bnei Chenadad, Kadmiel;"},{"num":11,"verse":"And their brethren, Shevanyah, Hodiyah, Kelita, Pelayah, Chanan,"},{"num":12,"verse":"Micha, Rechov, Chashavyah,"},{"num":13,"verse":"Zakkur, Sherevyah, Shevanyah,"},{"num":14,"verse":"Hodiyah, Bani, and Beninu."},{"num":15,"verse":"The chief of the people: Parosh, Pachat-Moav, Elam, Zattu, Bani,"},{"num":16,"verse":"Bunni, Azgad, Bevai,"},{"num":17,"verse":"Adoniyah, Bigvai, Adin,"},{"num":18,"verse":"Ater, Chizkiyah, Azzur,"},{"num":19,"verse":"Hodiyah, Chashum, Betzai,"},{"num":20,"verse":"Chariph, Anatot, Neivai,"},{"num":21,"verse":"Magpiash, Meshullam, Chezir,"},{"num":22,"verse":"Meshezav’el, Tzadok, Yaddua,"},{"num":23,"verse":"Pelatyah, Chanan, Anayah,"},{"num":24,"verse":"Hoshea, Chananyah, Chashuv,"},{"num":25,"verse":"Halochesh, Pilcha, Shovek,"},{"num":26,"verse":"Rechum, Chashavnah, Ma’aseiyah,"},{"num":27,"verse":"And Achiyah, Chanan, Anan,"},{"num":28,"verse":"Maluch, Charim, Ba’anah."},{"num":29,"verse":"And the rest of the people, the Kohanim, the Levi’im, the gatekeepers, the singers, the Netinim, and all they that had separated themselves from the peoples of the lands unto the Torat HaElohim, their wives, their banim, and their banot, every one having knowledge, and having understanding;"},{"num":30,"verse":"They were the machazikim (the ones joining) with their brethren, their nobles, and bound themselves with a curse, and into an oath, to walk in Torat HaElohim, which was given by Moshe Eved HaElohim, and to be shomer to do all the mitzvot of Hashem Adoneinu, and His mishpatim and His chukkot;"},{"num":31,"verse":"And that we would not give our banot unto the peoples of the land, not take their banot for our banim;"},{"num":32,"verse":"And if the people of the land bring merchandise or any grain on Shabbos or on Yom Kodesh to sell, that we would not buy it of them on Shabbos, or on Yom Kodesh; and that we would every Shanah HaShevi’it [Ex 23:11] forgo working the land and will cancel all debts."},{"num":33,"verse":"Also we will assume on us mitzvot, to charge ourselves yearly with the third part of a shekel for the Avodat Beis Eloheinu [Mt 17:24];"},{"num":34,"verse":"For the Lechem HaMa’arekhet, and for the Minchat HaTamid, and for the Olat HaTamid, of the Shabbatot, of the Chodashim, for the Mo’adim, and for the Kodashim, and for the Chatta’ot to make kapporah for Yisroel, and for all the work of the Beis Eloheinu."},{"num":35,"verse":"And we cast the goralot among the Kohanim, the Levi’im, and the people, for the korban of the wood, to bring it into the Beis Eloheinu, after the batim of Avoteinu, at times appointed year by year, to burn upon the Mizbe’ach of Hashem Eloheinu, as it is written in the Torah [Lv 6:12-13];"},{"num":36,"verse":"And to bring the bikkurei admateinu, and the bikkurei kol pri kol etz, year by year, unto Beis Hashem;"},{"num":37,"verse":"Also the bechorot baneinu, and of our cattle, as it is written in the Torah, and the firstlings of our herds and of our flocks, to bring to the Beis Eloheinu, unto the Kohanim that minister in the Beis Eloheinu;"},{"num":38,"verse":"And that we should bring the reshit arisoteinu, and our offerings, and the fruit of all manner of trees, of tirosh and of oil, unto the Kohanim, to the storerooms of the Beis Eloheinu; and the ma’aser of our land unto the Levi’im, that the same Levi’im might collect me’a’serim in all the cities of avodateinu."},{"num":39,"verse":"And the Kohen Ben Aharon shall be with the Levi’im, when the Levi’im receive tithes; and the Levi’im shall bring up the ma’aser hama’aser unto the Beis Eloheinu, to the storerooms, into the Beis HaOtzar."},{"num":40,"verse":"For the Bnei Yisroel and the Bnei Levi shall bring the terumah of the grain, of the tirosh, and the oil, unto the storerooms, where are Keli HaMikdash, and the Kohanim that minister, and the gatekeepers, and the singers; and we will not forsake the Beis Eloheinu."}]