[{"num":1,"verse":"I, Nehemiah the governor, signed the covenant. The others who signed it were: Zedekiah, Seraiah, Azariah, Jeremiah, Pashhur, Amariah, Malchijah, Hattush, Shebaniah, Malluch, Harim, Meremoth, Obadiah, Daniel, Ginnethon, Baruch, Meshullam, Abijah, Mijamin, Maaziah, Bilgai, Shemaiah. (All those listed above were priests.)"},{"num":9,"verse":"These were the Levites who signed: Jeshua (son of Azaniah), Binnui (son of Henadad), Kadmiel, Shebaniah, Hodiah, Kelita, Pelaiah, Hanan, Mica, Rehob, Hashabiah, Zaccur, Sherebiah, Shebaniah, Hodiah, Bani, Beninu."},{"num":14,"verse":"The political leaders who signed: Parosh, Pahath-moab, Elam, Zattu, Bani, Bunni, Azgad, Bebai, Adonijah, Bigvai, Adin, Ater, Hezekiah, Azzur, Hodiah, Hashum, Bezai, Hariph, Anathoth, Nebai, Magpiash, Meshullam, Hezir, Meshezabel, Zadok, Jaddua, Pelatiah, Hanan, Anaiah, Hoshea, Hananiah, Hasshub, Hallohesh, Pilha, Shobek, Rehum, Hashabnah, Maaseiah, Ahiah, Hanan, Anan, Malluch, Harim, Baanah."},{"num":28,"verse":"These men signed on behalf of the entire nation—for the common people, the priests, the Levites, the gatekeepers, the choir members, the Temple servants, and all the rest who, with their wives and sons and daughters who were old enough to understand, had separated themselves from the heathen people of the land in order to serve God. "},{"num":29,"verse":"For we all heartily agreed to this oath and vowed to accept the curse of God unless we obeyed God’s laws as issued by his servant Moses."},{"num":30,"verse":"We also agreed not to let our daughters marry non-Jewish men and not to let our sons marry non-Jewish girls."},{"num":31,"verse":"We further agreed that if the heathen people in the land should bring any grain or other produce to be sold on the Sabbath or on any other holy day, we would refuse to buy it. And we agreed not to do any work every seventh year and to forgive and cancel the debts of our brother Jews."},{"num":32,"verse":"We also agreed to charge ourselves annually with a Temple tax so that there would be enough money to care for the Temple of our God; "},{"num":33,"verse":"for we needed supplies of the special Bread of the Presence, as well as grain offerings and burnt offerings for the Sabbaths, the new moon feasts, and the annual feasts. We also needed to purchase the other items necessary for the work of the Temple and for the atonement of Israel."},{"num":34,"verse":"Then we tossed a coin to determine when—at regular times each year—the families of the priests, Levites, and leaders should supply the wood for the burnt offerings at the Temple as required in the law."},{"num":35,"verse":"We also agreed always to bring the first part of every crop to the Temple—whether it be a ground crop or from our fruit and olive trees."},{"num":36,"verse":"We agreed to give to God our oldest sons and the firstborn of all our cattle, herds, and flocks, just as the law requires; we presented them to the priests who minister in the Temple of our God. "},{"num":37,"verse":"They stored the produce in the Temple of our God—the best of our grain crops, and other contributions, the first of our fruit, and the first of the new wine and olive oil. And we promised to bring to the Levites a tenth of everything our land produced, for the Levites were responsible to collect the tithes in all our rural towns. "},{"num":38,"verse":"A priest—a descendant of Aaron—would be with the Levites as they received these tithes, and a tenth of all that was collected as tithes was delivered to the Temple and placed in the storage areas. "},{"num":39,"verse":"The people and the Levites were required by law to bring these offerings of grain, new wine, and olive oil to the Temple and place them in the sacred containers for use by the ministering priests, the gatekeepers, and the choir singers."}]