[{"num":1,"verse":"Paul, Silvanus (Silas), and Timothy, to the church (assembly) of the Thessalonians in God our Father and the Lord Jesus Christ (the Messiah, the Anointed One):"},{"num":2,"verse":"Grace (unmerited favor) be to you and [heart] peace from God the Father and the Lord Jesus Christ (the Messiah, the Anointed One)."},{"num":3,"verse":"We ought and indeed are obligated [as those in debt] to give thanks always to God for you, brethren, as is fitting, because your faith is growing exceedingly and the love of every one of you each toward the others is increasing and abounds."},{"num":4,"verse":"And this is a cause of our mentioning you with pride among the churches (assemblies) of God for your steadfastness (your unflinching endurance and patience) and your firm faith in the midst of all the persecutions and crushing distresses and afflictions under which you are holding up."},{"num":5,"verse":"This is positive proof of the just and right judgment of God to the end that you may be deemed deserving of His kingdom [a plain token of His fair verdict which designs that you should be made and counted worthy of the kingdom of God], for the sake of which you are also suffering."},{"num":6,"verse":"[It is a fair decision] since it is a righteous thing with God to repay with distress and affliction those who distress and afflict you,"},{"num":7,"verse":"And to [recompense] you who are so distressed and afflicted [by granting you] relief and rest along with us [your fellow sufferers] when the Lord Jesus is revealed from heaven with His mighty angels in a flame of fire,"},{"num":8,"verse":"To deal out retribution (chastisement and vengeance) upon those who do not know or perceive or become acquainted with God, and [upon those] who ignore and refuse to obey the Gospel of our Lord Jesus Christ."},{"num":9,"verse":"Such people will pay the penalty and suffer the punishment of everlasting ruin (destruction and perdition) and eternal exclusion and banishment from the presence of the Lord and from the glory of His power,"},{"num":10,"verse":"When He comes to be glorified in His saints [on that day He will be made more glorious in His consecrated people], and [He will] be marveled at and admired [in His glory reflected] in all who have believed [who have adhered to, trusted in, and relied on Him], because our witnessing among you was confidently accepted and believed [and confirmed in your lives]."},{"num":11,"verse":"With this in view we constantly pray for you, that our God may deem and count you worthy of [your] calling and [His] every gracious purpose of goodness, and with power may complete in [your] every particular work of faith (faith which is that leaning of the whole human personality on God in absolute trust and confidence in His power, wisdom, and goodness)."},{"num":12,"verse":"Thus may the name of our Lord Jesus Christ be glorified and become more glorious through and in you, and may you [also be glorified] in Him according to the grace (favor and blessing) of our God and the Lord Jesus Christ (the Messiah, the Anointed One)."}]