[{"num":5,"verse":"Everyone pas who ho believes pisteuō that hoti Jesus Iēsous is eimi the ho Christ Christos has  been  born gennaō of ek · ho God theos,  and kai everyone pas who ho loves agapaō the ho father gennaō loves agapaō · kai · ho his autos child gennaō. "},{"num":2,"verse":"By en this houtos we  know ginōskō that hoti we  love agapaō the ho children teknon of ho God theos:  whenever hotan we  love agapaō · ho God theos and kai obey poieō · ho his autos commandments entolē. "},{"num":3,"verse":"For gar this houtos is eimi the ho love agapē of ho God theos:  that hina we  keep tēreō · ho his autos commandments entolē.  And kai · ho his autos commandments entolē are eimi not ou burdensome barys, "},{"num":4,"verse":"because hoti everyone pas who ho has  been  born gennaō of ek · ho God theos conquers nikaō the ho world kosmos.  And kai this houtos is eimi the ho victorious  power nikē that ho has  conquered nikaō the ho world kosmos— · ho our hēmeis faith pistis. "},{"num":5,"verse":"Who tis · de is eimi it  that ho conquers nikaō the ho world kosmos,  but ei mē the ho one  who  believes pisteuō that hoti Jesus Iēsous is eimi the ho Son hyios of ho God theos? "},{"num":6,"verse":"This houtos is eimi the ho one  who  came erchomai by dia water hydōr and kai blood haima— Jesus Iēsous Christ Christos;  not ou by en · ho water hydōr only monon but alla by en · ho water hydōr and kai · ho blood haima.  And kai the ho Spirit pneuma is eimi the ho one  who  testifies martyreō,  because hoti the ho Spirit pneuma is eimi the ho truth alētheia. "},{"num":7,"verse":"For hoti there  are eimi three treis that ho testify martyreō: "},{"num":8,"verse":"the ho Spirit pneuma and kai the ho water hydōr and kai the ho blood haima;  and kai the ho three treis are eimi in eis · ho accord heis. "},{"num":9,"verse":"If ei we  receive lambanō the ho testimony martyria of ho men anthrōpos,  the ho testimony martyria of ho God theos is eimi greater megas,  because hoti this houtos is eimi the ho testimony martyria of ho God theos that hoti he  has  borne martyreō concerning peri · ho his autos Son hyios. "},{"num":10,"verse":"The ho one  who  believes pisteuō in eis the ho Son hyios of ho God theos has echō the ho testimony martyria in en himself heautou;  the ho one  who  does  not mē believe pisteuō · ho God theos has  made poieō him autos out to be a  liar pseustēs,  because hoti he  has  not ou believed pisteuō in eis the ho testimony martyria that hos God theos has  borne martyreō · ho concerning peri · ho his autos Son hyios. "},{"num":11,"verse":"And kai this houtos is eimi the ho testimony martyria:  God theos gave didōmi us hēmeis eternal aiōnios life zōē,  · ho and kai this houtos · ho life zōē is eimi in en · ho his autos Son hyios. "},{"num":12,"verse":"The ho one  who  has echō the ho Son hyios has echō · ho life zōē;  the ho one  who  does  not mē have echō the ho Son hyios of ho God theos does echō not ou have echō · ho life zōē. "},{"num":13,"verse":"I  am  writing graphō these  things houtos to  you hymeis so  that hina you  may  know oida that hoti you  have echō eternal aiōnios life zōē—you  who ho believe pisteuō in eis the ho name onoma of  the ho Son hyios of ho God theos. "},{"num":14,"verse":"And kai this houtos is eimi the ho confidence parrēsia we  have echō as  we  approach pros him autos:  that hoti if ean we  ask aiteō anything tis according  to kata · ho his autos will thelēma,  he  hears akouō us hēmeis. "},{"num":15,"verse":"And kai if ean we  know oida that hoti he  hears akouō us hēmeis regarding  whatever hos we  ask aiteō,  we  know oida that hoti we  have echō the ho requests aitēma that hos we  have  asked aiteō of apo him autos. "},{"num":16,"verse":"If ean someone tis sees  · ho his autos brother adelphos committing hamartanō a  sin hamartia that  does  not mē lead  to pros death thanatos,  he  should  ask aiteō and kai God  will  give didōmi him autos life zōē— to  those ho whose  sins hamartanō do  not mē lead  to pros death thanatos.  There  is eimi sin hamartia that  leads  to pros death thanatos;  I  do legō not ou say legō that hina he  should  pray erōtaō about peri that ekeinos. "},{"num":17,"verse":"All pas wrongdoing adikia is eimi sin hamartia,  but kai there  is eimi sin hamartia that  does  not ou lead  to pros death thanatos. "},{"num":18,"verse":"We  know oida that hoti everyone pas who ho has  been  born gennaō of ek · ho God theos does  not ou continue  to  sin hamartanō,  but alla the ho one  who  was  born gennaō of ek · ho God theos protects tēreō him autos and kai the ho evil  one ponēros will  not ou harm haptō him autos. "},{"num":19,"verse":"We  know oida that hoti we  are eimi children  of ek · ho God theos,  and kai that  the ho whole holos world kosmos lies keimai in en the power of  the ho evil  one ponēros. "},{"num":20,"verse":"And de we  know oida that hoti the ho Son hyios of ho God theos has  come hēkō and kai has  given didōmi us hēmeis discernment dianoia so  that hina we  may  know ginōskō him ho who  is  true alēthinos;  and kai we  are eimi in en him ho who  is  true alēthinos,  in en · ho his autos Son hyios Jesus Iēsous Christ Christos.  This  one houtos is eimi the ho true alēthinos God theos and kai eternal aiōnios life zōē. "},{"num":21,"verse":"Little  children teknion,  keep phylassō yourselves heautou from apo · ho idols eidōlon. "}]