[{"header":"Those Who Believe in Jesus Are God’s Children"},{"num":5,"verse":"Everyone who believes that Yeshua is the Messiah has been born from God. Everyone who loves the Father also loves his children. "},{"num":2,"verse":"We know that we love God’s children when we love God by obeying his commandments. "},{"num":3,"verse":"To love God means that we obey his commandments. Obeying his commandments isn’t difficult "},{"num":4,"verse":"because everyone who has been born from God has won the victory over the world. Our faith is what wins the victory over the world. "},{"num":5,"verse":"Who wins the victory over the world? Isn’t it the person who believes that Yeshua is the Son of God?"},{"num":6,"verse":"This Son of God is Yeshua Christ, who came by water and blood. He didn’t come with water only, but with water and with blood. The Spirit is the one who verifies this, because the Spirit is the truth. "},{"num":7,"verse":"There are three witnesses: "},{"num":8,"verse":"the Spirit, the water, and the blood. These three witnesses agree."},{"num":9,"verse":"We accept human testimony. God’s testimony is greater because it is the testimony that he has given about his Son. "},{"num":10,"verse":"Those who believe in the Son of God have the testimony of God in them. Those who don’t believe God have made God a liar. They haven’t believed the testimony that God has given about his Son."},{"num":11,"verse":"This is the testimony: God has given us eternal life, and this life is found in his Son. "},{"num":12,"verse":"The person who has the Son has this life. The person who doesn’t have the Son of God doesn’t have this life."},{"header":"Conclusion"},{"num":13,"verse":"I’ve written this to those who believe in the Son of God so that they will know that they have eternal life."},{"num":14,"verse":"We are confident that God listens to us if we ask for anything that has his approval. "},{"num":15,"verse":"We know that he listens to our requests. So we know that we already have what we ask him for."},{"num":16,"verse":"If you see another believer committing a sin that doesn’t lead to death, you should pray that God would give that person life. This is true for those who commit sins that don’t lead to death. There is a sin that leads to death. I’m not telling you to pray about that. "},{"num":17,"verse":"Every kind of wrongdoing is sin, yet there are sins that don’t lead to death."},{"num":18,"verse":"We know that those who have been born from God don’t go on sinning. Rather, the Son of God protects them, and the evil one can’t harm them."},{"num":19,"verse":"We know that we are from God, and that the whole world is under the control of the evil one."},{"num":20,"verse":"We know that the Son of God has come and has given us understanding so that we know the real God. We are in the one who is real, his Son Yeshua Christ. This Yeshua Christ is the real God and eternal life."},{"num":21,"verse":"Dear children, guard yourselves from false gods."}]