[{"header":"Paul’s defense before his accusers"},{"num":22,"verse":"“Brothers and fathers, listen now to my defense.”"},{"num":2,"verse":"When they heard him address them in Aramaic, they became even more quiet."},{"num":3,"verse":"Paul continued, “I’m a Jew, born in Tarsus in Cilicia but raised in this city. Under Gamaliel’s instruction, I was trained in the strict interpretation of our ancestral Law. I am passionately loyal to God, just like you who are gathered here today."},{"num":4,"verse":"I harassed those who followed this Way to their death, arresting and delivering both men and women into prison."},{"num":5,"verse":"The high priest and the whole Jerusalem Council can testify about me. I received letters from them, addressed to our associates in Damascus, then went there to bring those who were arrested to Jerusalem so they could be punished."},{"num":6,"verse":"“During that journey, about noon, as I approached Damascus, suddenly a bright light from heaven encircled me."},{"num":7,"verse":"I fell to the ground and heard a voice asking me, ‘Saul, Saul, why are you harassing me?’"},{"num":8,"verse":"I answered, ‘Who are you, Lord?’ ‘I am Jesus the Nazarene, whom you are harassing,’ he replied."},{"num":9,"verse":"My traveling companions saw the light, but they didn’t hear the voice of the one who spoke to me."},{"num":10,"verse":"I asked, ‘What should I do, Lord?’ ‘Get up,’ the Lord replied, ‘and go into Damascus. There you will be told everything you have been appointed to do.’"},{"num":11,"verse":"I couldn’t see because of the brightness of that light, so my companions led me by the hand into Damascus."},{"num":12,"verse":"“There was a certain man named Ananias. According to the standards of the Law, he was a pious man who enjoyed the respect of all the Jews living there."},{"num":13,"verse":"He came and stood beside me. ‘Brother Saul, receive your sight!’ he said. Instantly, I regained my sight and I could see him."},{"num":14,"verse":"He said, ‘The God of our ancestors has selected you to know his will, to see the righteous one, and to hear his voice."},{"num":15,"verse":"You will be his witness to everyone concerning what you have seen and heard."},{"num":16,"verse":"What are you waiting for? Get up, be baptized, and wash away your sins as you call on his name.’"},{"num":17,"verse":"“When I returned to Jerusalem and was praying in the temple, I had a visionary experience."},{"num":18,"verse":"I saw the Lord speaking to me. ‘Hurry!’ he said. ‘Leave Jerusalem at once because they won’t accept your testimony about me.’"},{"num":19,"verse":"I responded, ‘Lord, these people know I used to go from one synagogue to the next, beating those who believe in you and throwing them into prison."},{"num":20,"verse":"When Stephen your witness was being killed, I stood there giving my approval, even watching the clothes that belonged to those who were killing him.’"},{"num":21,"verse":"Then the Lord said to me, ‘Go! I will send you far away to the Gentiles.’”"},{"num":22,"verse":"The crowd listened to Paul until he said this. Then they shouted, “Away with this man! He’s not fit to live!”"},{"num":23,"verse":"As they were screaming, throwing off their garments, and flinging dust into the air,"},{"num":24,"verse":"the commander directed that Paul be taken into the military headquarters. He ordered that Paul be questioned under the whip so that he could find out why they were shouting at him like this."},{"num":25,"verse":"As they were stretching him out and tying him down with straps, Paul said to the centurion standing there, “Can you legally whip a Roman citizen who hasn’t been found guilty in court?”"},{"num":26,"verse":"When the centurion heard this, he went to the commander and reported it. He asked, “What are you about to do? This man is a Roman citizen!”"},{"num":27,"verse":"The commander went to Paul and demanded, “Tell me! Are you a Roman citizen?”"},{"num":28,"verse":"The commander replied, “It cost me a lot of money to buy my citizenship.”"},{"num":29,"verse":"At once those who were about to examine him stepped away. The commander was alarmed when he realized he had bound a Roman citizen."},{"header":"Paul appears before the Jewish council"},{"num":30,"verse":"The commander still wanted to know the truth about why Paul was being accused by the Jews. Therefore, the next day he ordered the chief priests and the entire Jerusalem Council to assemble. Then he took Paul out of prison and had him stand before them."}]