[{"num":22,"verse":"Men, brethren and fathers, hear my answer, which I make to you."},{"num":2,"verse":"When they heard that he spoke in the Hebrew tongue to them, they kept the more silence."},{"num":3,"verse":"I am indeed a Jew, born in Tarsus, a city in Cilicia, but brought up in this city at the feet of Gamaliel, and thoroughly taught in the law of the fathers. And I was fervent-minded toward God, as you all are this same day. "},{"num":4,"verse":"And I persecuted this Way to the death, binding and delivering into prison both men and women, "},{"num":5,"verse":"as the chief priest bears me witness, and all the elders – from whom also I received letters to the brethren, and went to Damascus to bring those who were there as prisoners to Jerusalem, to be punished."},{"num":6,"verse":"But it came to pass, as I made my journey and had come near to Damascus about noon, that suddenly a great light from heaven shone round about me. "},{"num":7,"verse":"And I fell to the earth and heard a voice saying to me, Saul, Saul, why do you persecute me? "},{"num":8,"verse":"And I answered, Who are you, Lord? And he said to me, I am Jesus of Nazareth, whom you persecute."},{"num":9,"verse":"And those who were with me saw a light and were afraid, but they did not hear the voice of him who spoke with me. "},{"num":10,"verse":"And I said, What shall I do Lord? And the Lord said to me, Arise and go into Damascus, and there it will be told you all the things that are appointed for you to do."},{"num":11,"verse":"And when I could not see anything due to the brightness of the light, I was led by the hand by those who were with me, and came into Damascus. "},{"num":12,"verse":"And one Ananias, a godly man, and as pertaining to the law having a good report among all the Jews who dwelt there, "},{"num":13,"verse":"came to me. And he stood and said to me, Brother Saul, look up! And that same hour I received my sight, and could see him. "},{"num":14,"verse":"And he said, The God of our fathers has fore-ordained you to know his will, and to see that which is rightful, and to hear the voice of his mouth. "},{"num":15,"verse":"For you shall be his witness to all people of those things that you have seen and heard. "},{"num":16,"verse":"And now, why tarry? Arise and be baptized, and wash away your sins, in calling on the name of the Lord."},{"num":17,"verse":"And it happened, when I returned again to Jerusalem and was praying in the temple, that I was in a trance, "},{"num":18,"verse":"and saw him saying to me, Make haste, and get quickly out of Jerusalem, for they will not receive the witness that you bear of me."},{"num":19,"verse":"And I said, Lord, they know that I imprisoned and beat in every synagogue those who believed on you. "},{"num":20,"verse":"And when the blood of your witness Stephen was shed, I also stood by and consented to his death, and minded the garments of those who slew him. "},{"num":21,"verse":"Then he said to me, Depart, for I will send you far from here, to the Gentiles."},{"num":22,"verse":"The people listened to him until these words, and then lifted up their voices and said, Away with such a fellow from the earth! It is a pity that he should live! "},{"num":23,"verse":"And as they cried out and cast off their clothes and threw dust into the air, "},{"num":24,"verse":"the high captain ordered him to be brought into the castle, and commanded him to be scourged and examined in order to find out why the people cried out so against him. "},{"num":25,"verse":"And as they bound him with thongs, Paul said to the centurion that stood by, Is it lawful for you to scourge a man that is a Roman, and without a trial? "},{"num":26,"verse":"When the centurion heard that, he went and told the high captain, saying, What do you intend to do? This man is a Roman."},{"num":27,"verse":"Then the high captain came and said to him, Tell me, are you a Roman? He said, Yes. "},{"num":28,"verse":"And the captain answered, With a great sum I obtained this freedom. And Paul said, I was free born."},{"num":29,"verse":"Then the soldiers who were to have examined him straightaway drew back from him. And the high captain also was afraid, after he knew that he was a Roman, because he had bound him."},{"num":30,"verse":"On the day following, because he wanted to know exactly what Paul was accused of by the Jews, the captain released him from his bonds, and commanded the high priests and all the council to come together, and brought Paul and set him before them."}]