[{"header":"Impending Judgment"},{"num":22,"verse":"Thus says the Lord: Go down to the house of the king of Judah, and speak this word there, "},{"num":2,"verse":"and say: Hear the word of the Lord, O king of Judah who sits on the throne of David, you and your servants and your people who enter by these gates. "},{"num":3,"verse":"Thus says the Lord: Execute justice and righteousness, and deliver the robbed out of the hand of the oppressor. And do no wrong or violence to the stranger, the fatherless, or the widow, neither shed innocent blood in this place. "},{"num":4,"verse":"For if you indeed do these things, then kings sitting on the throne of David will enter by the gates of this house, riding in chariots and on horses, he and his servants and his people. "},{"num":5,"verse":"But if you will not obey these words, I swear by Myself, says the Lord, that this house will become a desolation."},{"num":6,"verse":"For thus says the Lord to the king’s house of Judah:"},{"num":8,"verse":"Many nations will pass by this city, and every man will say to his neighbor, “Why has the Lord done thus to this great city?” "},{"num":9,"verse":"Then they will answer, “Because they have forsaken the covenant of the Lord their God, and worshipped other gods, and served them.”"},{"num":11,"verse":"For thus says the Lord concerning Shallum the son of Josiah king of Judah, who became king instead of Josiah his father, who went from this place: He will not return any more, "},{"num":12,"verse":"but will die in the place where they have led him captive and will see this land no more."},{"num":18,"verse":"Therefore thus says the Lord concerning Jehoiakim the son of Josiah, king of Judah:"},{"num":24,"verse":"As I live, says the Lord, though Koniah the son of Jehoiakim king of Judah were the signet on My right hand, yet would I pluck you from there. "},{"num":25,"verse":"And I will give you into the hand of those who seek your life and into the hand of those whose face you fear, even into the hand of Nebuchadnezzar king of Babylon and into the hand of the Chaldeans. "},{"num":26,"verse":"I will cast you and your mother that bore you out into another country where you were not born, and there you shall die. "},{"num":27,"verse":"But to the land where they desire to return, they will not return there."}]