[{"header":"Warning of Jerusalem’s Fall"},{"num":22,"verse":"This is what the Lord says: “Go down to the house of the king of Judah and there speak this word,"},{"num":2,"verse":"and say, ‘Hear the word of the Lord, O king of Judah, who sits on David’s throne, you and your servants and your people who enter these gates."},{"num":3,"verse":"This is what the Lord says: “Do justice and righteousness, and save one who has been robbed from the power of his oppressor. And do not mistreat or do violence to the stranger, the orphan, or the widow; and do not shed innocent blood in this place."},{"num":4,"verse":"For if you will indeed perform this instruction, then kings will enter the gates of this house, sitting in David’s place on his throne, riding in chariots and on horses, the king himself, his servants, and his people."},{"num":5,"verse":"But if you will not obey these words, I swear by Myself,” declares the Lord, “that this house will become a place of ruins.”’”"},{"num":6,"verse":"For this is what the Lord says concerning the house of the king of Judah:"},{"num":8,"verse":"“Many nations will pass by this city; and they will say to one another, ‘Why has the Lord done this to this great city?’"},{"num":9,"verse":"Then they will answer, ‘Because they abandoned the covenant of the Lord their God and bowed down to other gods and served them.’”"},{"num":11,"verse":"For this is what the Lord says regarding Shallum the son of Josiah, king of Judah, who became king in the place of his father Josiah, who went out from this place: “He will never return there;"},{"num":12,"verse":"but in the place where they took him into exile, there he will die and he will not see this land again."},{"header":"Messages about the Kings"},{"num":18,"verse":"Therefore this is what the Lord says regarding Jehoiakim the son of Josiah, king of Judah:"},{"num":24,"verse":"“As I live,” declares the Lord, “even if Coniah the son of Jehoiakim king of Judah were a signet ring on My right hand, yet I would pull you off;"},{"num":25,"verse":"and I will hand you over to those who are seeking your life, yes, to those of whom you are frightened, that is, to Nebuchadnezzar king of Babylon and the Chaldeans."},{"num":26,"verse":"I will hurl you and your mother who gave birth to you into another country where you were not born, and there you will die."},{"num":27,"verse":"But as for the land to which they long to return, they will not return to it."},{"num":30,"verse":"This is what the Lord says:"}]