[{"header":"Sending Out the Seventy"},{"num":10,"verse":"After this, the Lord appointed 70 others, and He sent them ahead of Him in pairs to every town and place where He Himself was about to go. "},{"num":2,"verse":"He told them: “The harvest is abundant, but the workers are few. Therefore, pray to the Lord of the harvest to send out workers into His harvest. "},{"header":"Unrepentant Towns"},{"header":"The Return of the Seventy"},{"num":17,"verse":"The Seventy returned with joy, saying, “Lord, even the demons submit to us in Your name.”"},{"num":18,"verse":"He said to them, “I watched Satan fall from heaven like a lightning flash. "},{"header":"The Son Reveals the Father"},{"num":21,"verse":"In that same hour He rejoiced in the Holy Spirit and said, “I praise You, Father, Lord of heaven and earth, because You have hidden these things from the wise and the learned and have revealed them to infants. Yes, Father, because this was Your good pleasure. "},{"num":23,"verse":"Then turning to His disciples He said privately, “The eyes that see the things you see are blessed! "},{"header":"The Parable of the Good Samaritan"},{"num":25,"verse":"Just then an expert in the law stood up to test Him, saying, “Teacher, what must I do to inherit eternal life?”"},{"num":27,"verse":"He answered:"},{"num":29,"verse":"But wanting to justify himself, he asked Jesus, “And who is my neighbor?”"},{"num":30,"verse":"Jesus took up the question and said: “A man was going down from Jerusalem to Jericho and fell into the hands of robbers. They stripped him, beat him up, and fled, leaving him half dead. "},{"num":37,"verse":"“The one who showed mercy to him,” he said."},{"header":"Martha and Mary"},{"num":38,"verse":"While they were traveling, He entered a village, and a woman named Martha welcomed Him into her home. "},{"num":39,"verse":"She had a sister named Mary, who also sat at the Lord’s feet and was listening to what He said. "},{"num":40,"verse":"But Martha was distracted by her many tasks, and she came up and asked, “Lord, don’t You care that my sister has left me to serve alone? So tell her to give me a hand.”"},{"num":41,"verse":"The Lord answered her, “Martha, Martha, you are worried and upset about many things, "}]