[{"header":"The Mission of the Seventy"},{"num":10,"verse":"After this, the Lord appointed 70 other disciples and was about to send them ahead of him in pairs to every town and place that he intended to go. "},{"num":2,"verse":"So he instructed them, “The harvest is vast, but the workers are few. So ask the Lord of the harvest to send workers out into his harvest. "},{"num":3,"verse":"Get going! See, I am sending you out like lambs among wolves. "},{"num":4,"verse":"Don’t carry a wallet, a traveling bag, or sandals, and don’t greet anyone on the way."},{"num":5,"verse":"“Whatever house you go into, first say, ‘May there be peace in this house.’ "},{"num":6,"verse":"If a peaceful person lives there, your greeting of peace will remain with him. But if that’s not the case, your greeting will come back to you. "},{"num":7,"verse":"Stay with the same family, eating and drinking whatever they provide, because the worker deserves his pay. Don’t move from house to house."},{"num":8,"verse":"“Whenever you go into a town and the people welcome you, eat whatever they serve you, "},{"num":9,"verse":"heal the sick that are there, and tell them, ‘The kingdom of God is near you!’ "},{"num":10,"verse":"But whenever you go into a town and people don’t welcome you, go out into its streets and say, "},{"num":11,"verse":"‘We’re wiping off your town’s dust that clings to our feet in protest against you! But realize this: the kingdom of God is near!’ "},{"num":12,"verse":"I tell you, on the last day it will be easier for Sodom than for that town!”"},{"header":"Jesus Denounces Unrepentant Cities(A)"},{"num":13,"verse":"“How terrible it will be for you, Chorazin! How terrible it will be for you, Bethsaida! If the miracles that happened in you had taken place in Tyre and Sidon, they would have repented long ago, sitting in sackcloth and ashes. "},{"num":14,"verse":"It will be easier for Tyre and Sidon at the judgment than for you!"},{"num":15,"verse":"And you, Capernaum! You won’t be lifted up to heaven, will you? You’ll go down to Hell! "},{"num":16,"verse":"The person who listens to you listens to me, and the person who rejects you rejects me. The person who rejects me rejects the one who sent me.”"},{"header":"The Return of the Seventy"},{"num":17,"verse":"The 70 disciples came back and joyously reported, “Lord, even the demons are submitting to us in your name!”"},{"num":18,"verse":"He told them, “I watched Satan falling from heaven like lightning. "},{"num":19,"verse":"Look! I have given you the authority to trample on snakes and scorpions and to destroy all the enemy’s power, and nothing will ever hurt you. "},{"num":20,"verse":"However, stop rejoicing because the spirits are submitting to you. Instead, rejoice because your names are written in heaven.”"},{"header":"Jesus Praises the Father(B)"},{"num":21,"verse":"At that moment, the Holy Spirit made Jesus extremely joyful, so Jesus said, “I praise you, Father, Lord of heaven and earth, because you have hidden these things from wise and intelligent people and have revealed them to infants. Yes, Father, because this is what was pleasing to you. "},{"num":22,"verse":"All things have been entrusted to me by my Father. No one knows who the Son is except the Father, and no one knows who the Father is except the Son and the person to whom the Son chooses to reveal him.”"},{"num":23,"verse":"Then turning to his disciples in private, he told them, “How blessed are the eyes that see what you see! "},{"num":24,"verse":"Because I tell you, many prophets and kings wanted to see the things you see but didn’t see them, and to hear the things you hear but didn’t hear them.”"},{"header":"The Good Samaritan"},{"num":25,"verse":"Just then an expert in the Law stood up to test Jesus. He asked, “Teacher, what must I do to inherit eternal life?”"},{"num":26,"verse":"Jesus answered him, “What is written in the Law? What do you read there?”"},{"num":27,"verse":"He answered, “You must love the Lord your God with all your heart, with all your soul, with all your strength, and with all your mind. And you must love your neighbor as yourself.”"},{"num":28,"verse":"Jesus told him, “You have answered correctly. ‘Do this, and you will live.’”"},{"num":29,"verse":"But the man wanted to justify himself, so he asked Jesus, “And who is my neighbor?”"},{"num":30,"verse":"After careful consideration, Jesus replied, “A man was going down from Jerusalem to Jericho when he fell into the hands of bandits. They stripped him, beat him, and went away, leaving him half dead. "},{"num":31,"verse":"By chance, a priest was traveling along that road. When he saw the man, he went by on the other side. "},{"num":32,"verse":"Similarly, a descendant of Levi came to that place. When he saw the man, he also went by on the other side. "},{"num":33,"verse":"But as he was traveling along, a Samaritan came across the man. When the Samaritan saw him, he was moved with compassion. "},{"num":34,"verse":"He went to him and bandaged his wounds, pouring oil and wine on them. Then he put him on his own animal, brought him to an inn, and took care of him. "},{"num":35,"verse":"The next day, he took out two denarii and gave them to the innkeeper, saying, ‘Take good care of him. If you spend more than that, I’ll repay you when I come back.’"},{"num":36,"verse":"“Of these three men, who do you think was a neighbor to the man who fell into the hands of the bandits?”"},{"num":37,"verse":"He said, “The one who showed mercy to him.”"},{"header":"Jesus Visits Mary and Martha"},{"num":38,"verse":"Now as they were traveling along, Jesus went into a village. A woman named Martha welcomed him into her home. "},{"num":39,"verse":"She had a sister named Mary, who sat down at the Lord’s feet and kept listening to what he was saying. "},{"num":40,"verse":"But Martha was worrying about all the things she had to do, so she came to him and asked, “Lord, you do care that my sister has left me to do the work all by myself, don’t you? Then tell her to help me.”"},{"num":41,"verse":"The Lord answered her, “Martha, Martha! You worry and fuss about a lot of things. "},{"num":42,"verse":"But there’s only one thing you need. Mary has chosen what is better, and it is not to be taken away from her.”"}]