[{"num":10,"verse":"After these things the Lord appointed seventy others also, and sent them two by two ahead of Him into every city and place whither He Himself would come."},{"num":2,"verse":"Therefore He said unto them, “The harvest truly is great, but the laborers are few; pray ye therefore the Lord of the harvest, that He would send forth laborers into His harvest."},{"num":3,"verse":"Go your ways; behold, I send you forth as lambs among wolves,"},{"num":4,"verse":"carrying neither purse, nor pack, nor shoes; and salute no man by the way."},{"num":5,"verse":"And into whatsoever house ye enter, first say, ‘Peace be to this house.’"},{"num":6,"verse":"And if the son of peace be there, your peace shall rest upon it; if not, it shall return to you again."},{"num":7,"verse":"And in the same house remain, eating and drinking such things as they give, for the laborer is worthy of his hire. Go not from house to house."},{"num":8,"verse":"And into whatsoever city ye enter and they receive you, eat such things as are set before you."},{"num":9,"verse":"And heal the sick that are therein and say unto them, ‘The Kingdom of God is come nigh unto you.’"},{"num":10,"verse":"But into whatsoever city ye enter and they receive you not, go your ways out into the streets of the same and say,"},{"num":11,"verse":"‘Even the very dust of your city, which cleaveth on us, we do wipe off against you. Notwithstanding, be ye sure of this: that the Kingdom of God is come nigh unto you.’"},{"num":12,"verse":"But I say unto you that it shall be more tolerable in that Day for Sodom than for that city."},{"num":13,"verse":"“Woe unto thee, Chorazin! Woe unto thee, Bethsaida! For if the mighty works had been done in Tyre and Sidon, which have been done in you, they would have a great while ago repented, sitting in sackcloth and ashes."},{"num":14,"verse":"But it shall be more tolerable for Tyre and Sidon at the Judgment than for you."},{"num":15,"verse":"And thou, Capernaum, which art exalted to heaven, shall be thrust down to hell."},{"num":16,"verse":"He that heareth you heareth Me, and he that despiseth you despiseth Me, and he that despiseth Me despiseth Him that sent Me.”"},{"num":17,"verse":"And the seventy returned again with joy, saying, “Lord, even the devils are subject unto us through Thy name.”"},{"num":18,"verse":"And He said unto them, “I beheld Satan as lightning fall from heaven."},{"num":19,"verse":"Behold, I give unto you power to tread on serpents and scorpions and over all the power of the enemy, and nothing shall by any means hurt you."},{"num":20,"verse":"Notwithstanding, in this rejoice not that the spirits are subject unto you; but rather rejoice because your names are written in Heaven.”"},{"num":21,"verse":"In that hour Jesus rejoiced in Spirit and said, “I thank Thee, O Father, Lord of Heaven and earth, that Thou hast hid these things from the wise and prudent, and hast revealed them unto babes. Even so, Father, for so it seemed good in Thy sight."},{"num":22,"verse":"All things are delivered to Me by My Father, and no man knoweth who the Son is, but the Father; and who the Father is, but the Son and he to whom the Son will reveal Him.”"},{"num":23,"verse":"And He turned unto His disciples and said privately, “Blessed are the eyes which see the things that ye see."},{"num":24,"verse":"For I tell you that many prophets and kings have desired to see those things which ye see, and have not seen them; and to hear those things which ye hear, and have not heard them.”"},{"num":25,"verse":"And behold, a certain lawyer stood up and tested Him, saying, “Master, what shall I do to inherit eternal life?”"},{"num":26,"verse":"He said unto him, “What is written in the law? How readest thou?”"},{"num":27,"verse":"And he answering said, “‘Thou shalt love the Lord thy God with all thy heart, and with all thy soul, and with all thy strength, and with all thy mind, and thy neighbor as thyself.’”"},{"num":28,"verse":"And He said unto him, “Thou hast answered right; this do, and thou shalt live.”"},{"num":29,"verse":"But he, wanting to justify himself, said unto Jesus, “And who is my neighbor?”"},{"num":30,"verse":"And Jesus answering said, “A certain man went down from Jerusalem to Jericho and fell among thieves, who stripped him of his raiment and wounded him and departed, leaving him half dead."},{"num":31,"verse":"And by chance there came down a certain priest that way. And when he saw him, he passed by on the other side."},{"num":32,"verse":"And likewise a Levite, when he was at the place, came and looked on him and passed by on the other side."},{"num":33,"verse":"But a certain Samaritan, as he journeyed, came to where he was. And when he saw him he had compassion on him,"},{"num":34,"verse":"and went to him and bound up his wounds, pouring on oil and wine; and he set him on his own beast, and brought him to an inn and took care of him."},{"num":35,"verse":"And on the morrow when he departed, he took out two pence, and gave them to the host and said unto him, ‘Take care of him; and whatsoever thou spendest more, when I come again I will repay thee.’"},{"num":36,"verse":"Which now of these three, thinkest thou, was neighbor unto him that fell among the thieves?”"},{"num":37,"verse":"And he said, “He that showed mercy on him.” Then said Jesus unto him, “Go and do thou likewise.”"},{"num":38,"verse":"Now it came to pass, as they went, that He entered into a certain village; and a certain woman named Martha received Him into her house."},{"num":39,"verse":"And she had a sister called Mary, who also sat at Jesus’ feet and heard His Word."},{"num":40,"verse":"But Martha was encumbered with much serving, and came to Him and said, “Lord, dost Thou not care that my sister hath left me to serve alone? Bid her therefore that she help me.”"},{"num":41,"verse":"And Jesus answered and said unto her, “Martha, Martha, thou art anxious and troubled about many things."},{"num":42,"verse":"But one thing is needful, and Mary hath chosen that good part, which shall not be taken away from her.”"}]