[{"header":"The Mission of All the Disciples"},{"header":"Chapter 10"},{"num":1,"verse":"The Mission of the Seventy-Two After this, the Lord appointed seventy-two others and sent them on ahead of him in pairs to every town and place he intended to visit."},{"num":2,"verse":"He said to them: “The harvest is abundant, but the laborers are few. Therefore, ask the Lord of the harvest to send forth laborers for his harvest."},{"num":3,"verse":"“Go on your way. Behold, I am sending you out like lambs among wolves."},{"num":4,"verse":"Carry no money bag or sack and wear no sandals. Greet no one on the road."},{"num":5,"verse":"Whatever house you enter, let your first words be, ‘Peace to this house!’"},{"num":6,"verse":"If a man of peace lives there, your peace will rest on him; if not, it will return to you."},{"num":7,"verse":"“Remain in the same house, and eat and drink whatever is offered to you, for the laborer deserves his wages. Do not move around from house to house."},{"num":8,"verse":"Whenever you enter a town and its people welcome you, eat whatever is set before you."},{"num":9,"verse":"Cure the sick who are there, and say, ‘The kingdom of God has come unto you.’"},{"num":10,"verse":"“But whenever you enter a town and the people do not welcome you, go out into the streets and say,"},{"num":11,"verse":"‘Even the dust of your town that clings to us we wipe off our feet as a sign against you. Yet know this: the kingdom of God is at hand.’"},{"num":12,"verse":"I tell you, on that day it will be more bearable for Sodom than for that town."},{"num":13,"verse":"Woe to the Cities of Galilee.“Woe to you, Chorazin! Woe to you, Bethsaida! If the mighty deeds performed in your midst had been done in Tyre and Sidon, they would have come to repentance long ago, sitting in sackcloth and ashes."},{"num":14,"verse":"But at the judgment it will be more tolerable for Tyre and Sidon than for you."},{"num":15,"verse":"And as for you, Capernaum:"},{"num":16,"verse":"“Whoever listens to you listens to me, and whoever rejects you rejects me. And whoever rejects me rejects the one who sent me.”"},{"num":17,"verse":"Joy of the Missionaries. The seventy-two returned rejoicing, and they said, “Lord, in your name even the demons are subject to us.”"},{"num":18,"verse":"He said to them, “I watched Satan fall from heaven like lightning."},{"num":19,"verse":"Behold, I have given you the power to tread upon snakes and scorpions and all the forces of the enemy, and nothing will ever harm you."},{"num":20,"verse":"Nevertheless, do not rejoice in the knowledge that the spirits are subject to you. Rejoice rather that your names are inscribed in heaven.”"},{"num":21,"verse":"Joy of Jesus.At that very hour, Jesus rejoiced in the Holy Spirit and said, “I thank you, Father, Lord of heaven and earth, because you have hidden these things from the wise and the learned and have revealed them to children. Yes, Father, such has been your gracious will."},{"num":22,"verse":"“All things have been entrusted to me by my Father. No one knows who the Son is except the Father, or who the Father is except the Son and those to whom the Son wishes to reveal him.”"},{"num":23,"verse":"The Privilege of Discipleship. Then he turned to his disciples and said privately, “Blessed are the eyes that see what you see."},{"num":24,"verse":"I tell you, many prophets and kings desired to see what you see but did not see it, and to hear what you hear but did not hear it.”"},{"num":25,"verse":"The Greatest Commandment.And behold, a lawyer came forward to test Jesus by asking, “Teacher, what must I do to gain eternal life?”"},{"num":26,"verse":"Jesus said to him, “What is written in the Law? How do you read it?”"},{"num":27,"verse":"He answered, “You shall love the Lord your God with all your heart, and with all your soul, and with all your strength, and with all your mind, and your neighbor as yourself.”"},{"num":28,"verse":"Jesus then said to him, “You have answered correctly. Do this and you will live.”"},{"num":29,"verse":"The Parable of the Good Samaritan. But because the man wished to justify himself, he asked, “And who is my neighbor?”"},{"num":30,"verse":"Jesus replied, “A man was going down from Jerusalem to Jericho, when he was attacked by robbers. They stripped him and beat him, and then went off leaving him half-dead."},{"num":31,"verse":"A priest happened to be traveling along that same road, but when he saw him he passed by on the other side."},{"num":32,"verse":"A Levite likewise came to that spot and saw him, but he too passed by on the other side."},{"num":33,"verse":"“But a Samaritan who was traveling along that road came upon him, and when he saw him he was moved with compassion."},{"num":34,"verse":"He went up to him and bandaged his wounds after having poured oil and wine on them. Then he brought him upon his own animal to an inn and looked after him."},{"num":35,"verse":"“The next day, he took out two denarii and gave them to the innkeeper, saying, ‘Look after him, and when I return I will repay you for anything more you might spend.’"},{"num":36,"verse":"“Which of those three, do you think, was a neighbor to the man who fell into the hands of the robbers?”"},{"num":37,"verse":"He answered, “The one who showed him mercy.” Jesus said to him, “Go and do likewise.”"},{"num":38,"verse":"Martha and Mary. In the course of their journey, he came to a village where a woman named Martha welcomed him into her home."},{"num":39,"verse":"She had a sister named Mary who sat at the Lord’s feet and listened to what he was saying."},{"num":40,"verse":"But Martha was distracted by her many tasks. So she came to him and said, “Lord, do you not care that my sister has left me to do all the work by myself? Tell her to come and help me.”"},{"num":41,"verse":"The Lord answered her: “Martha, Martha, you are anxious and upset about many things,"},{"num":42,"verse":"when only one thing is necessary. Mary has chosen the better part, and it will not be taken away from her.”"}]