[{"header":"Jesus Sends Out the Seventy"},{"num":10,"verse":"After this the master commissioned seventy others, and sent them ahead of him in pairs to every town and place where he was intending to come."},{"num":2,"verse":"‘There’s a great harvest out there,’ he said to them, ‘but there aren’t many workers. So plead with the harvest-master to send out workers for the harvest."},{"num":3,"verse":"‘Off you go now. Remember, I’m sending you out like lambs among wolves. "},{"num":4,"verse":"Take no money-bag, no pack, no sandals – and don’t stop to pass the time with anyone on the road. "},{"num":5,"verse":"Whenever you go into a house, first say, “Peace on this house.” "},{"num":6,"verse":"If a child of peace lives there, your peace will rest on them; but if not, it will return to you."},{"num":7,"verse":"‘Stay in the same house, and eat and drink what they provide. The worker deserves to be paid, you see. Don’t go from house to house. "},{"num":8,"verse":"If you go into a town and they welcome you, eat what is provided, "},{"num":9,"verse":"heal the sick who are there, and say to them, “God’s kingdom has come close to you.” "},{"num":10,"verse":"But if you go into a town and they don’t welcome you, go out into the streets of the town and say, "},{"num":11,"verse":"“Here is the very dust of your town clinging to our feet – and we’re wiping it off in front of your eyes! "},{"num":12,"verse":"But you should know this: God’s kingdom has come close to you!” Let me tell you, on that day it will be more tolerable for Sodom than for that town."},{"num":13,"verse":"‘Woe betide you, Chorazin! Woe betide you, Bethsaida! If the powerful deeds done in you had been done in Tyre and Sidon, they would have repented long ago, sitting in sackcloth and ashes. "},{"num":14,"verse":"But it will be more tolerable for Tyre and Sidon in the judgment than for you. "},{"num":15,"verse":"And you, Capernaum – you want to be lifted up to heaven, do you? No: you’ll be sent down to Hades!"},{"num":16,"verse":"‘Anyone who hears you, hears me; anyone who rejects you, rejects me; and anyone who rejects me, rejects the one who sent me.’"},{"header":"The Celebration of Jesus"},{"num":17,"verse":"The seventy came back exhilarated."},{"num":18,"verse":"‘I saw the satan fall like lightning from heaven,’ he replied. "},{"num":19,"verse":"‘Look: I’ve given you authority to tread on snakes and scorpions, and over every power of the enemy. Nothing will ever be able to harm you. "},{"num":20,"verse":"But – don’t celebrate having spirits under your authority. Celebrate this, that your names are written in heaven.’"},{"num":21,"verse":"Then and there Jesus celebrated in the holy spirit."},{"num":22,"verse":"Everything has been given me by my father. Nobody knows who the son is except the father, and nobody knows who the father is except the son, and anyone to whom the son wishes to reveal him.’"},{"num":23,"verse":"Jesus then turned to the disciples privately."},{"num":24,"verse":"Let me tell you, many prophets and kings wanted to see what you see, and they didn’t see it; and to hear what you hear, and they didn’t hear it!’"},{"header":"The Parable of the Good Samaritan"},{"num":25,"verse":"A lawyer got up and put Jesus on the spot."},{"num":26,"verse":"‘Well,’ replied Jesus, ‘what is written in the law? What’s your interpretation of it?’"},{"num":27,"verse":"‘You shall love the Lord your God’, he replied, ‘with all your heart, all your soul, all your strength, and all your understanding; and your neighbour as yourself.’"},{"num":28,"verse":"‘Well said!’ replied Jesus. ‘Do that and you will live.’"},{"num":29,"verse":"‘Ah,’ said the lawyer, wanting to win the point, ‘but who is my neighbour?’"},{"num":30,"verse":"Jesus rose to the challenge. ‘Once upon a time,’ he said, ‘a man was going down from Jerusalem to Jericho, and was set upon by brigands. They stripped him and beat him and ran off leaving him half dead. "},{"num":31,"verse":"A priest happened to be going down that road, and when he saw him he went past on the opposite side. "},{"num":32,"verse":"So too a Levite came by the place; he saw him too, and went past on the opposite side."},{"num":33,"verse":"‘But a travelling Samaritan came to where he was. When he saw him he was filled with pity. "},{"num":34,"verse":"He came over to him and bound up his wounds, pouring in oil and wine. Then he put him on his own beast, took him to an inn, and looked after him. "},{"num":35,"verse":"The next morning, as he was going on his way, he gave the innkeeper two dinars. “Take care of him,” he said, “and on my way back I’ll pay you whatever else you need to spend on him.”"},{"num":36,"verse":"‘Which of these three do you think turned out to be the neighbour of the man who was set upon by the brigands?’"},{"num":37,"verse":"‘The one who showed mercy on him,’ came the reply."},{"header":"Martha and Mary"},{"num":38,"verse":"On their journey, Jesus came into a village. There was a woman there named Martha, who welcomed him. "},{"num":39,"verse":"She had a sister named Mary, who sat at the master’s feet and listened to his teaching."},{"num":40,"verse":"Martha was frantic with all the work in the kitchen."},{"num":41,"verse":"‘Martha, Martha,’ he replied, ‘you are fretting and fussing about so many things. "},{"num":42,"verse":"Only one thing matters. Mary has chosen the best part, and it’s not going to be taken away from her.’"}]