[[],[{"type":"header","content":"The Report of Saul’s Death"},{"type":"prose","content":"Now it came to pass after the death of Saul, when David had returned from the slaughter of the Amalekites, and David had stayed two days in Ziklag, "}],[{"type":"prose","content":"on the third day, behold, it happened that a man came from Saul’s camp with his clothes torn and dust on his head. So it was, when he came to David, that he fell to the ground and prostrated himself."}],[{"type":"prose","content":"And David said to him, “Where have you come from?”So he said to him, “I have escaped from the camp of Israel.”"}],[{"type":"prose","content":"Then David said to him, “How did the matter go? Please tell me.”And he answered, “The people have fled from the battle, many of the people are fallen and dead, and Saul and Jonathan his son are dead also.”"}],[{"type":"prose","content":"So David said to the young man who told him, “How do you know that Saul and Jonathan his son are dead?”"}],[{"type":"prose","content":"Then the young man who told him said, “As I happened by chance  on Mount Gilboa, there was Saul, leaning on his spear; and indeed the chariots and horsemen followed hard after him. "}],[{"type":"prose","content":"Now when he looked behind him, he saw me and called to me. And I answered, ‘Here I am.’ "}],[{"type":"prose","content":"And he said to me, ‘Who  you?’ So I answered him, ‘I  an Amalekite.’ "}],[{"type":"prose","content":"He said to me again, ‘Please stand over me and kill me, for anguish has come upon me, but my life still  in me.’ "}],[{"type":"prose","content":"So I stood over him and killed him, because I was sure that he could not live after he had fallen. And I took the crown that  on his head and the bracelet that  on his arm, and have brought them here to my lord.”"}],[{"type":"prose","content":"Therefore David took hold of his own clothes and tore them, and  all the men who  with him. "}],[{"type":"prose","content":"And they mourned and wept and fasted until evening for Saul and for Jonathan his son, for the people of the  and for the house of Israel, because they had fallen by the sword."}],[{"type":"prose","content":"Then David said to the young man who told him, “Where  you from?”And he answered, “I  the son of an alien, an Amalekite.”"}],[{"type":"prose","content":"So David said to him, “How was it you were not afraid to put forth your hand to destroy the ’s anointed?” "}],[{"type":"prose","content":"Then David called one of the young men and said, “Go near,  execute him!” And he struck him so that he died. "}],[{"type":"prose","content":"So David said to him, “Your blood  on your own head, for your own mouth has testified against you, saying, ‘I have killed the ’s anointed.’ ”"},{"type":"header","content":"The Song of the Bow"}],[{"type":"prose","content":"Then David lamented with this lamentation over Saul and over Jonathan his son, "}],[{"type":"prose","content":"and he told  to teach the children of Judah  the Bow; indeed  written in the Book of Jasher:"}]]