[{"header":"David Hears of Saul’s Death"},{"num":1,"verse":"Now after the death of Saul, David returned from killing the Amalekites and stayed two days in Ziklag. "},{"num":2,"verse":"On the third day, a man came from the tents of Saul. His clothes were torn and he had dust on his head. When he came to David, he fell with his face to the ground. "},{"num":3,"verse":"David said to him, “Where do you come from?” And he answered, “I have run away from the tents of Israel.” "},{"num":4,"verse":"David said to him, “How did it go? Tell me.” And the man said, “The people have run from the battle. Many have fallen and are dead. Saul and his son Jonathan are dead also.” "},{"num":5,"verse":"David said to the young man, “How do you know that Saul and his son Jonathan are dead?” "},{"num":6,"verse":"The young man said, “I happened to be on Mount Gilboa. There I saw Saul holding himself up with his spear. The war-wagons and the horsemen were coming close after him. "},{"num":7,"verse":"When he looked behind him, he saw me. He called to me and I said, ‘Here I am.’ "},{"num":8,"verse":"He said to me, ‘Who are you?’ And I answered, ‘I am an Amalekite.’ "},{"num":9,"verse":"Then he said to me, ‘I beg you, stand beside me and kill me. I am in pain, and yet I am still alive.’ "},{"num":10,"verse":"So I stood beside him and killed him, because I knew he could not live after he had fallen. Then I took the crown which was on his head and the beautiful gold band which he wore on his arm, and I have brought them here to my lord.”"},{"num":11,"verse":"Then David took hold of his clothes and tore them, and so did all the men who were with him. "},{"num":12,"verse":"They cried in sorrow and did not eat until evening, because of Saul and his son Jonathan, and of the people of the Lord and of the family of Israel. For they had fallen by the sword. "},{"num":13,"verse":"David said to the young man, “Where are you from?” And he answered, “I am the son of one from another land, an Amalekite.” "},{"num":14,"verse":"Then David said to him, “Why were you not afraid to put out your hand to destroy the Lord’s chosen one?” "},{"num":15,"verse":"Then David called one of the young men and said, “Go, cut him down.” So he hit him and he died. "},{"num":16,"verse":"David said to him, “Your blood is on your head. Because your mouth has spoken against you, saying, ‘I have killed the Lord’s chosen one.’”"},{"header":"David’s Song of Sorrow for Saul and Jonathan"},{"num":17,"verse":"Then David sang a song of sorrow for Saul and his son Jonathan. "},{"num":18,"verse":"He told them to teach the song of the bow to the people of Judah. See, it is written in the book of Jashar. "},{"num":19,"verse":"“O Israel, your beauty is destroyed on your high places! How have the powerful fallen! "},{"num":20,"verse":"Do not tell about it in Gath. Do not tell about it in the streets of Ashkelon, or the daughters of the Philistines might be filled with joy. The daughters of those who have not gone through our religious act might be filled with joy. "},{"num":21,"verse":"O mountains of Gilboa, do not let the water that is on the grass in the early morning or rain be on you. Let not grass be grown on your fields. For there the covering of the powerful was made dirty, the covering of Saul, as if he had not been set apart with oil. "},{"num":22,"verse":"The bow of Jonathan did not turn away. The sword of Saul did not return empty. They did not turn from the blood of the dead and the fat of the powerful. "},{"num":23,"verse":"Saul and Jonathan were loved and pleasing in their life. And they were not divided in their death. They were faster than eagles. They were stronger than lions. "},{"num":24,"verse":"O daughters of Israel, cry for Saul. He dressed you in fine red clothing. He put on your clothing objects of gold. "},{"num":25,"verse":"How have the powerful fallen in the center of the battle! Jonathan has been killed on your high places. "},{"num":26,"verse":"I am troubled because of you, my brother Jonathan. You have been very pleasing to me. Your love to me was greater than the love of women. "},{"num":27,"verse":"How have the powerful fallen, and the bows and swords of war destroyed!”"}]