[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(13) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "God will not hear vanity.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Some understand this as part of the cry in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 35:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : “Seeing it is all in vain, God doth not hear, neither doth the Almighty regard it.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Job 35:13",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 35:13",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Surely God will not hear vanity — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Either, 1st, Vain and light persons, that have no true wisdom nor solid piety in them: but are wholly addicted to vain and worldly things, rejoicing immoderately when they have them, and crying out in distress when they have them not. Or, 2d, Vain cries; which proceed not from true penitence, faith, or piety, but only from self-love, and such a sense of misery as is common to men with brute beasts. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Neither will the Almighty regard it — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Though God be able to help them, as this title of God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the Almighty, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "implies; and though he be the Judge of the world, as the former name of God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "אל",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "eel, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "signifies, to whom therefore it belongs to right the oppressed against the oppressor; yet, in this case, he justly refuseth to help them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "35:9-13 Job complained that God did not regard the cries of the oppressed against their oppressors. This he knew not how to reconcile the justice of God and his government. Elihu solves the difficulty. Men do not notice the mercies they enjoy in and under their afflictions, nor are thankful for them, therefore they cannot expect that God should deliver them out of affliction. He gives songs in the night; when our condition is dark and melancholy, there is that in God's providence and promise, which is sufficient to support us, and to enable us even to rejoice in tribulation. When we only pore upon our afflictions, and neglect the consolations of God which are treasured up for us, it is just in God to reject our prayers. Even the things that will kill the body, cannot hurt the soul. If we cry to God for the removal of an affliction, and it is not removed, the reason is, not because the Lord's hand is shortened, or his ear heavy; but because we are not sufficiently humbled.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Surely God will not hear vanity - A vain, hollow, heartless petition. The object of Elihu here is to account for the reason why sufferers are not relieved - having his eye, doubtless, on the case of Job as one of the most remarkable of the kind. The solution which he here gives of the difficulty is, that it is not consistent for God to hear a prayer where there is no sincerity. Of the \"truth\" of the remark there can be no doubt, but he seems to have taken it for granted that all prayers offered by unrelieved sufferers are thus insincere and hollow. This was needfull in his view to account for the fact under consideration, and this he \"assumes\" as being unquestionable. Yet the very point indispensable to make out his case was, that \"in fact\" the prayers offered by such persons were insincere. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13. vanity—that is, cries uttered in an unhumbled spirit, Job 35:12, which applies in some degree to Job's cries; still more to those of the wicked (Job 27:9; Pr 15:29).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Either, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. Vain and light persons, that have no true wisdom or solid piety in them, but are wholly addicted to vain and worldly things, rejoicing immoderately when they have them, and crying out for want of them, as here they do. Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. Vain cries, which proceed not from faith or piety, but only from self-love and a natural sense of their misery; which is common to them with brute beasts. The abstract is here put for the concrete, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "wickedness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is oft put for wicked men, and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "pride",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for proud persons, and the like. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Neither will the Almighty regard it:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " though God be able to help them, as this title of God implies, and though he be the Judge of the world, as the former name of God signifies, to whom therefore it belongs to right the oppressed against the oppressor, yet in this case he justly refuseth to help them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Surely God will not hear vanity,.... Or \"a lie\" (z), than which nothing is more an abomination to him; if men come to him with a lie in their mouths, they cannot expect to be heard by him; he is only nigh to those who call upon him in truth: or that which is \"rash\" (a); which is rashly uttered, and in a passionate wrathful manner, savouring of a revengeful spirit, too often the case of those that cry under oppression; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ecclesiastes 5:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; or vain and empty prayers, a speech of vanity, as Aben Ezra; which as to the matter of them are about vain and empty things; only for outward mercies, worldly goods; and not for spiritual mercies, or such things as are according to the will of God; but what are pleasing to the flesh, and sought for to consume on the lusts of it, and therefore such prayers are not heard, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 4:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and as to the manner of them, they are not put up in the name of Christ, nor under the influence of the spirit of Christ, nor in the exercise of any grace, nor with reverence of God, nor with sincerity of soul, not in faith, nor with fervency: or \"vanity\" is put for vain men, as sin for sinners; such as are proud men, and are vainly puffed up in their fleshly mind. God hears humble penitent sinners, who find mercy with him; and humble saints, to whom he gives more grace; but not proud Pharisees, or men not humbled by afflictions; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 18:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; nor light and empty persons, who are without God and Christ, destitute of the spirit, devoid of all grace, and full of all unrighteousness; unstable ones, who are vanity itself, and lighter than vanity, tossed to and fro like a wave of the sea, and double minded, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "James 1:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; nor men of vain conversations, that walk in the vanity of their minds, whose words are vain, and especially such as take the name of God in vain; and all whose actions are vain, or such that live a vain and sinful course of life; God hears not sinners, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 9:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "neither will the Almighty regard it; vanity, vain prayers and vain persons; he regards the prayer of the destitute, the lowly, and the humble, but not the prayer of such as before described; he cannot \"look\" at, it (b), nor at them: he looks to the poor and contrite, and desires to see their countenance and hear their voice in prayer; but he is of purer eyes thou to look on vain persons and their vain prayers; and a greater contempt cannot be shown to petitioners and their petitions than when those to whom they apply will not so much as look at them, but turn both a deaf ear to them, and their eyes away from them. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(z) \"falsitatem\", Beza; \"mendacium\", Pagninus, Montanus. (a) \"Quod temerarium est\", Cocceius. (b)  \"non intuatur illud\", Pagninus, Montanus; \"non videt illud\", Cocceius; so Michaelis and Schultens. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(z) \"falsitatem\", Beza; \"mendacium\", Pagninus, Montanus. (a) \"Quod temerarium est\", Cocceius. (b)  \"non intuatur illud\", Pagninus, Montanus; \"non videt illud\", Cocceius; so Michaelis and Schultens. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Surely God will not hear vanity, neither will the Almighty regard it.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 13.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Surely God will not hear vanity",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". God will not hear prayers that are rendered \"vain\" by sin or defect in those who offer them, as by a want of faith, piety, humility, or resignation. Neither will the Almighty regard any such petitions. Job 35:13",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "  9  By reason of the multitude of oppressions they raise a cry,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "They call for help by reason of the arm of the great,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "10  But none saith: Where is Eloah my Creator,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Who giveth songs of praise in the night,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "11  Who teacheth us by the beasts of the earth,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And maketh us wise by the fowls of heaven?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "12  Then they cry, yet He answereth not,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Because of the pride of evil men.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "13  Vanity alone God heareth not,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And the Almighty observeth it not.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In Job 35:9 the accentuation of מרוב with Dech, according to which Dachselt interprets: prae multitudine (oppressionum) oppressi clamabunt, is erroneous; it is to be written מרב, as everywhere else, and this (according to Codd. and the editions of Jablonski, Majus, Michaelis, and others) is to be accented with Munach, which is followed by עשׁוּקים with a vicarious Munach: prae multitudine oppressionum (עשׁוקים like Ecclesiastes 4:1, and probably also Amos 3:9) edunt clamorem (Hiph. in the intensive Kal signification, as e.g., הזנה, to commit fornication, Hosea 4:10). On זרוע, Job 35:9; רבּים are the great or lords (Arab. arbâb). The plur. with a general subj. is followed by the sing. in Job 35:10: and no one says (exactly as in האמר, Job 34:31). Elihu weakens the doubt expressed by Job in Job 24:12, that God allows injustice to prevail, and oppressed innocence remains without vindication. The failure of the latter arises from the fact of the sufferers complaining, but not seeking earnestly the only true helper, God their maker (עשׂים, intensive plur., as Isaiah 22:11; Isaiah 54:5; Psalm 149:2), who gives (to which may be compared a passage of the Edda: \"Wuodan gives songs to the Scalds\") songs (זמרות, from the onomatopoetic זמר) in the night, i.e., who in the night of sorrow puts songs of praise concerning the dawning light of help into the mouth of the sufferers. The singing of the glory of the nightly heavens (Stick., Hahn) is to be as little thought of as the music of the spheres; the night is, as Job 34:20, Job 34:25, the time of unexpectedly sudden change.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 35:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the accentuation of מרוב with Dech, according to which Dachselt interprets: prae multitudine (oppressionum) oppressi clamabunt, is erroneous; it is to be written מרב, as everywhere else, and this (according to Codd. and the editions of Jablonski, Majus, Michaelis, and others) is to be accented with Munach, which is followed by עשׁוּקים with a vicarious Munach: prae multitudine oppressionum (עשׁוקים like ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ecclesiastes 4:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and probably also ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 3:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") edunt clamorem (Hiph. in the intensive Kal signification, as e.g., הזנה, to commit fornication, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 4:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). On זרוע, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 35:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; רבּים are the great or lords (Arab. arbâb). The plur. with a general subj. is followed by the sing. in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 35:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ": and no one says (exactly as in האמר, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 34:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Elihu weakens the doubt expressed by Job in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 24:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", that God allows injustice to prevail, and oppressed innocence remains without vindication. The failure of the latter arises from the fact of the sufferers complaining, but not seeking earnestly the only true helper, God their maker (עשׂים, intensive plur., as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 22:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 54:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 149:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), who gives (to which may be compared a passage of the Edda: \"Wuodan gives songs to the Scalds\") songs (זמרות, from the onomatopoetic זמר) in the night, i.e., who in the night of sorrow puts songs of praise concerning the dawning light of help into the mouth of the sufferers. The singing of the glory of the nightly heavens (Stick., Hahn) is to be as little thought of as the music of the spheres; the night is, as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 34:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 34:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the time of unexpectedly sudden change.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "In Job 35:11 most expositors (last of all Schlottm.) take the two מן as comparative. Elihu would then, since he feels the absence of the asking after this God on the part of the sufferers, mean the conscious relation in which He has placed us to Himself, and in accordance with which the sufferer should not merely instinctively complain, but humbly bow himself and earnestly offer up prayer. But according to Job 12:7 (comp. Proverbs 6:6, וחכם), it is to be translated: who teaches (מלּפנוּ  equals  מאלּפנוּ, comp. 2 Samuel 22:40, Psalter i. 160) us from the beasts of the earth (so that from them as a means of instruction teaching comes to us), and makes us wise from the birds of heaven. The fut. interchanging with the part. better accords with this translation, according to which Job 35:11 is a continuation of the assertion of a divine instruction, by means of the animal creation; the thought also suits the connection better, for of the many things that may be learned from the animal creation, prayer here comes under consideration, - the lions roar, Psalm 104:21; the thirsty cattle cry to God, Joel 1:20; the ravens call upon God, Psalm 147:9. It we now determine the collective thought of Job 35:10, that affliction does not drive most men to God the almighty Helper, who will be humbly entreated for help: it is more natural to take שׁם (vid., on Job 23:7) in the sense of then (τότε), than, with reference to the scene of oppression, in the sense of there (lxx, Jer.: ibi). The division of the verse is correct, and H. B. Starcke has correctly interpreted: Tunc clamabunt (sed non respondebit) propter superbiam (insolentiam) malorum. מפּני is not to be connected with יענה in the sense of non exaudiet et servabit, by which constr. praegnans one would expect מן, Psalm 22:22, instead of מפני, nor in the sense of non exaudiet propter (Hirz., Schlottm.), for the arrogant רעים are not those who complain unheard: but, as the connection shows, those from whom the occasion of complaint proceeds. Therefore: not allowing themselves to be driven to God by oppression, they cry then, without, however, being heard of God, by reason of the arrogance of evil men which they have to endure. Job 35:13 gives the reason of their obtaining no answer: Only emptiness (i.e., mere motion of the lips without the true spirit of prayer) God heareth not, and the Almighty observeth it not. Hahn wrongly denies אך the significations certo and verumtamen; but we prefer the restrictive signification (sheer emptiness or hollowness) which proceeds from the affirmative primary signification",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 35:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " most expositors (last of all Schlottm.) take the two מן as comparative. Elihu would then, since he feels the absence of the asking after this God on the part of the sufferers, mean the conscious relation in which He has placed us to Himself, and in accordance with which the sufferer should not merely instinctively complain, but humbly bow himself and earnestly offer up prayer. But according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 12:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 6:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", וחכם), it is to be translated: who teaches (מלּפנוּ  equals  מאלּפנוּ, comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 22:40",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", Psalter i. 160) us from the beasts of the earth (so that from them as a means of instruction teaching comes to us), and makes us wise from the birds of heaven. The fut. interchanging with the part. better accords with this translation, according to which ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 35:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is a continuation of the assertion of a divine instruction, by means of the animal creation; the thought also suits the connection better, for of the many things that may be learned from the animal creation, prayer here comes under consideration, - the lions roar, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 104:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; the thirsty cattle cry to God, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joel 1:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; the ravens call upon God, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 147:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". It we now determine the collective thought of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 35:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", that affliction does not drive most men to God the almighty Helper, who will be humbly entreated for help: it is more natural to take שׁם (vid., on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 23:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") in the sense of then (τότε), than, with reference to the scene of oppression, in the sense of there (lxx, Jer.: ibi). The division of the verse is correct, and H. B. Starcke has correctly interpreted: Tunc clamabunt (sed non respondebit) propter superbiam (insolentiam) malorum. מפּני is not to be connected with יענה in the sense of non exaudiet et servabit, by which constr. praegnans one would expect מן, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 22:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", instead of מפני, nor in the sense of non exaudiet propter (Hirz., Schlottm.), for the arrogant רעים are not those who complain unheard: but, as the connection shows, those from whom the occasion of complaint proceeds. Therefore: not allowing themselves to be driven to God by oppression, they cry then, without, however, being heard of God, by reason of the arrogance of evil men which they have to endure. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 35:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " gives the reason of their obtaining no answer: Only emptiness (i.e., mere motion of the lips without the true spirit of prayer) God heareth not, and the Almighty observeth it not. Hahn wrongly denies אך the significations certo and verumtamen; but we prefer the restrictive signification (sheer emptiness or hollowness) which proceeds from the affirmative primary signification",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Vid., Hupfeld in the Zeitschr. fr Kunde des Morgenl. ii.441f.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...",
        "children": []
      }
    ]
  }
]