[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "35:1-8 Elihu reproves Job for justifying himself more than God, and called his attention to the heavens. They are far above us, and God is far above them; how much then is he out of the reach, either of our sins or of our services! We have no reason to complain if we have not what we expect, but should be thankful that we have better than we deserve.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "For thou saidst - Another sentiment of a similar kind which Elihu proposes to examine. He had already adverted to this sentiment of Job in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 34:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and examined it at some length, and had shown in reply to it that God could not be unjust, and that there was great impropriety when man presumed to arraign the justice of the Most High. He now adverts to it again in order to show that God could not be benefited or injured by the conduct of man, and that he was, therefore, under no inducement to treat him otherwise than impartially.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "What advantage will it be unto thee? - see the notes at Job 34:9. The phrase \"unto thee,\" refers to Job himself. He had said this to himself; or to his own soul. Such a mode of expression is not uncommon in the Scriptures.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "What advantage will it be unto thee? - see the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 34:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The phrase \"unto thee,\" refers to Job himself. He had said this to himself; or to his own soul. Such a mode of expression is not uncommon in the Scriptures.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And, What profit shall I have if I be cleansed from my sin - Margin, \"or, by it\" more than by my sin.\"\" The Hebrew will admit of either of these interpretations, and the sense is not materially varied. The idea is, that as to good treatment or securing the favor of God under the arrangements of his government, a man might just as well be wicked as righteous. He would be as likely to be prosperous in the world, and to experience the tokens of the divine favor. Job had by no means advanced such a sentiment; but he had maintained that he was treated \"as if\" he were a sinner; that the dealings of Providence were \"not\" in this world in accordance with the character of people; and this was interpreted by Elihu as maintaining that there was no advantage in being righteous, or that a man might as well be a sinner. It was for such supposed sentiments as these, that Elihu and the three friends of Job charged him with giving \"answers\" for wicked people, or maintaining opinions which went to sustain and encourage the wicked; see Job 34:36. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And, What profit shall I have if I be cleansed from my sin - Margin, \"or, by it\" more than by my sin.\"\" The Hebrew will admit of either of these interpretations, and the sense is not materially varied. The idea is, that as to good treatment or securing the favor of God under the arrangements of his government, a man might just as well be wicked as righteous. He would be as likely to be prosperous in the world, and to experience the tokens of the divine favor. Job had by no means advanced such a sentiment; but he had maintained that he was treated \"as if\" he were a sinner; that the dealings of Providence were \"not\" in this world in accordance with the character of people; and this was interpreted by Elihu as maintaining that there was no advantage in being righteous, or that a man might as well be a sinner. It was for such supposed sentiments as these, that Elihu and the three friends of Job charged him with giving \"answers\" for wicked people, or maintaining opinions which went to sustain and encourage the wicked; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 34:36",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3. Rather, explanatory of \"this\" in Job 35:2, \"That thou sayest (to thyself, as if a distinct person) What advantage is it (thy integrity) to thee? What profit have I (by integrity) more than (I should have) by my sin?\" that is, more than if I had sinned (Job 34:9). Job had said that the wicked, who use these very words, do not suffer for it (Job 21:13-15); whereby he virtually sanctioned their sentiments. The same change of persons from oblique to direct address occurs (Job 19:28; 22:17).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " This verse contains the proof of the foregoing charges. Job had oft affirmed that he was, and still continued to be, righteous, though he had no present benefit by it, but much bitterness with it; and God was not kind to Job, notwithstanding all his former and present piety, but dealt with him as if he had been a most wicked man; which was in effect to say, that he was more righteous than God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "What advantage will it, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to wit, his righteousness last mentioned, be unto thee, i.e. unto me; such changes of persons being very frequent in the Hebrew language. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "If I be cleansed from my sin; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "by the expiation of my sin",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; for the same Hebrew word signifies both ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to sin",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to purge out or expiate sin",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Or, by it (to wit, by my righteousness) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "more than by my sin",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". So the sense is, I have no more present benefit by all my care to please and serve God, than wicked men have by their sins against him. God regards my cries no more than theirs, and shows no more kindness or pity to me than he doth to the most profligate wretches. But still remember Job speaks not here of the future life, wherein he knew he should have much advantage, as he professed before, but only of this present state. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "For thou saidst, what advantage will it be unto thee?.... Meaning that his righteousness, his holy life and conversation, were of no avail to him: he received no more benefit by being righteous than if he was wicked, since God destroyed one as well as another; and since his righteousness did not secure him from afflictions and calamities, it was of no advantage to him; he had not said so in so many words, but it is inferred from what he had said, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 9:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Man's own righteousness is of no advantage to him as to justification before God, and acceptance with him, nor in the business of salvation, or with respect to heaven and happiness, so as to give a right and title to it; bat is of great advantage in other respects; is for self-defence against the imputations and calumnies of wicked men; it makes a man honourable and respectable among men, when to live a vicious course of life is scandalous and reproachful; it gives pleasure and satisfaction to the mind, the testimony of a good conscience is matter of rejoicing; and such a man is free from the racks and tortures of an evil conscience others are distressed with; besides, good works are an evidence of the truth and genuineness of faith to others, and ornament the doctrines of the Gospel and a profession of them: and though a righteous man may be afflicted as others, yet in a different manner, in love and not in wrath, and always for his good; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and, what profit shall one have, if I be cleansed from my sin? The words, \"if I be cleansed\", are a supplement, and seem necessary; so Mr. Broughton supplies. Sin is of a defiling nature, yet man may be cleansed from it, not by anything he can do, but only by the grace of. God and blood of Christ; and from such a cleansing profit arises. This fits a man for the service and worship of God, and for communion with him; gives him peace of mind, and makes him meet for heaven. This Job had not expressly said, and not at all in this sense, but it seems to be inferred from Job 9:29; where he is speaking of outward purity of life, and yet was plunged into the ditch of afflictions. Some render the words to this sense, as if there was no profit \"by expiation of atonement for sin\" (u); the same word signifying both sin and atonement for it: there is none but by the blood and sacrifice of Christ, and much profit arises from that; pardon of sin proceeds upon it, and this furnishes out much solid peace, joy, and comfort, Romans 5:10. Others, what profit by punishment for sin (w), unless to God? so sin is sometimes put for punishment; or through leaving sin and repenting of it (x). Now though these are not the causes of the pardon of sin, yet it is given and applied to such who do repent of it, confess and forsake it, Proverbs 28:13. Or by being \"without sin\" (y): no man is without sin; but a man may be without any gross and enormous crime he is chargeable with, or without living a vicious course of life; and this is profitable, as has been before observed. Jarchi's paraphrase is, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and, what profit shall one have, if I be cleansed from my sin? The words, \"if I be cleansed\", are a supplement, and seem necessary; so Mr. Broughton supplies. Sin is of a defiling nature, yet man may be cleansed from it, not by anything he can do, but only by the grace of. God and blood of Christ; and from such a cleansing profit arises. This fits a man for the service and worship of God, and for communion with him; gives him peace of mind, and makes him meet for heaven. This Job had not expressly said, and not at all in this sense, but it seems to be inferred from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 9:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; where he is speaking of outward purity of life, and yet was plunged into the ditch of afflictions. Some render the words to this sense, as if there was no profit \"by expiation of atonement for sin\" (u); the same word signifying both sin and atonement for it: there is none but by the blood and sacrifice of Christ, and much profit arises from that; pardon of sin proceeds upon it, and this furnishes out much solid peace, joy, and comfort, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 5:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Others, what profit by punishment for sin (w), unless to God? so sin is sometimes put for punishment; or through leaving sin and repenting of it (x). Now though these are not the causes of the pardon of sin, yet it is given and applied to such who do repent of it, confess and forsake it, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 28:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Or by being \"without sin\" (y): no man is without sin; but a man may be without any gross and enormous crime he is chargeable with, or without living a vicious course of life; and this is profitable, as has been before observed. Jarchi's paraphrase is, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"what shall I profit more by my righteousness than by my sin?'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "which sense is followed by others: I may as well be wicked as righteous; I am not the better for it, since I am afflicted in the manner I:am: my righteousness is of no profit to me; if to any, it is to God. To this Elihu returns an answer in the following verses. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(u) \"de expiatione mea\", Mercerus, &c. \"in expiando peccatum\", Grotius; \"pro piaculo venit\", Cocceius; so Simeon Bar Tzemach in loc. (w) \"Supplicio meo\", Junius & Tremellius; \"mucta pro illo aut poena\", Cocceius; \"ex poena peccati mei\", Drusius; so Ben Gersom. (x) \"Subaudi relicto\", so Mercerus, Drusius; \"remisso et per poenitentiam diluto\", Munster. (y) \"Absque peccato\", i.e. \"ita vivendo ut non perccom\"; so some in Michaelis. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(u) \"de expiatione mea\", Mercerus, &c. \"in expiando peccatum\", Grotius; \"pro piaculo venit\", Cocceius; so Simeon Bar Tzemach in loc. (w) \"Supplicio meo\", Junius & Tremellius; \"mucta pro illo aut poena\", Cocceius; \"ex poena peccati mei\", Drusius; so Ben Gersom. (x) \"Subaudi relicto\", so Mercerus, Drusius; \"remisso et per poenitentiam diluto\", Munster. (y) \"Absque peccato\", i.e. \"ita vivendo ut non perccom\"; so some in Michaelis. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "For thou saidst, What advantage will it be unto thee? and, What profit shall I have, if I be cleansed from my sin?",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 3.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "For thou saidst What advantage will it be unto thee?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " What advantage will thy righteousness be unto thee? Job had certainly argued that his righteousness brought him no ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "temporal",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " advantage; but he had always a conviction that he would ultimately be the better for it. Elihu, however, does not acknowledge this; and, assuming that Job expects to receive no advantage at all from his integrity, argues that God is not bound to afford him any. And, ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "What profit shall I have, if I be cleansed from my sin?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "And what profit shall f have",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "more than if I had sinned?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (see the Revised Version, and compare the comments of Rosenmuller and Canon Cook). Job 35:3",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "  1  Then began Elihu, and said:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "  2  Dost thou consider this to be right,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Sayest thou: my righteousness exceedeth God's,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "  3  That thou sayest, what advantage is it to thee,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "What doth it profit me more than my sin?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "  4  I will answer thee words,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And thy companions with thee.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The neutral זאת, Job 35:2, refers prospectively to כּי־תאמר, Job 35:3: this that thou sayest. חשׁב with acc. of the obj. and ל of the predicate, as Job 33:10, comp. Job 13:24, and freq. The second interrogative clause, Job 35:2, is co-ordinate with the first, and the collective thought of this ponderous construction, Job 35:2, Job 35:3, is this: Considerest thou this to be right, and thinkest thou on this account to be able to put thy righteousness above the divine, that, as thou maintainest, no righteousness on the side of God corresponds to this thy righteousness, because God makes no distinction between righteousness and the sin of man, and allows the former to go unrewarded? צדקי (for which Olsh. wishes to read צדקתּי, as Job 9:27 אמרתי for אמרי) forms with מאל a substantival clause: justitia mea est prae Deo (prae divina); מן comparative as Job 32:2, comp. on the matter Job 34:5, not equivalent to ἀπό as Job 4:17. כי־תאמר is first followed by the oratio obliqua: what it (viz., צדקך) advantageth thee, then by the or. directa (on this change vid., Ew. 338, a): what profit have I((viz., בצדקי), prae peccato meo; this מן is also comparative; the constantly ambiguous combination would be allowable from the fact that, according to the usage of the language, \"to obtain profit from anything\" is expressed by הועיל בּ, not by הועיל מן. Moreover, prae peccato meo is equivalent to plus quam inde quod pecco, comp. Psalm 18:24, מעוני, Hosea 4:8 אל־עונם. We have already on Job 34:9 observed that Job has not directly said (he cites it, Job 21:15, as the saying of the ungodly) what Elihu in Job 35:3 puts into his mouth, but as an inference it certainly is implied in such utterances as Job 9:22. Elihu's polemic against Job and his companions (רעיך are not the three, as lxx and Jer. translate, but the אנשׁי און, to whom Job is likened by such words as Job 34:8, Job 34:36) is therefore not unauthorized; especially since he assails the conclusion together with its premises. In the second strophe the vindication of the conclusion is now refuted. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The neutral זאת, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 35:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", refers prospectively to כּי־תאמר, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 35:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ": this that thou sayest. חשׁב with acc. of the obj. and ל of the predicate, as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 33:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 13:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and freq. The second interrogative clause, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 35:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", is co-ordinate with the first, and the collective thought of this ponderous construction, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 35:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 35:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", is this: Considerest thou this to be right, and thinkest thou on this account to be able to put thy righteousness above the divine, that, as thou maintainest, no righteousness on the side of God corresponds to this thy righteousness, because God makes no distinction between righteousness and the sin of man, and allows the former to go unrewarded? צדקי (for which Olsh. wishes to read צדקתּי, as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 9:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " אמרתי for אמרי) forms with מאל a substantival clause: justitia mea est prae Deo (prae divina); מן comparative as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 32:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", comp. on the matter ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 34:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", not equivalent to ἀπό as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 4:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". כי־תאמר is first followed by the oratio obliqua: what it (viz., צדקך) advantageth thee, then by the or. directa (on this change vid., Ew. 338, a): what profit have I((viz., בצדקי), prae peccato meo; this מן is also comparative; the constantly ambiguous combination would be allowable from the fact that, according to the usage of the language, \"to obtain profit from anything\" is expressed by הועיל בּ, not by הועיל מן. Moreover, prae peccato meo is equivalent to plus quam inde quod pecco, comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 18:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", מעוני, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 4:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " אל־עונם. We have already on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 34:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " observed that Job has not directly said (he cites it, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 21:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", as the saying of the ungodly) what Elihu in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 35:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " puts into his mouth, but as an inference it certainly is implied in such utterances as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 9:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Elihu's polemic against Job and his companions (רעיך are not the three, as lxx and Jer. translate, but the אנשׁי און, to whom Job is likened by such words as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 34:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 34:36",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") is therefore not unauthorized; especially since he assails the conclusion together with its premises. In the second strophe the vindication of the conclusion is now refuted. ",
            "children": []
          }
        ]
      }
    ]
  }
]