[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "30:1-13 Rachel envied her sister: envy is grieving at the good of another, than which no sin is more hateful to God, or more hurtful to our neighbours and ourselves. She considered not that God made the difference, and that in other things she had the advantage. Let us carefully watch against all the risings and workings of this passion in our minds. Let not our eye be evil towards any of our fellow-servants, because our Master's is good. Jacob loved Rachel, and therefore reproved her for what she said amiss. Faithful reproofs show true affection. God may be to us instead of any creature; but it is sin and folly to place any creature in God's stead, and to place that confidence in any creature, which should be placed in God only. At the persuasion of Rachel, Jacob took Bilhah her handmaid to wife, that, according to the usage of those times, her children might be owned as her mistress's children. Had not Rachel's heart been influenced by evil passions, she would have thought her sister's children nearer to her, and more entitled to her care than Bilhah's. But children whom she had a right to rule, were more desirable to her than children she had more reason to love. As an early instance of her power over these children, she takes pleasure in giving them names that carry in them marks of rivalry with her sister. See what roots of bitterness envy and strife are, and what mischief they make among relations. At the persuasion of Leah, Jacob took Zilpah her handmaid to wife also. See the power of jealousy and rivalship, and admire the wisdom of the Divine appointment, which joins together one man and one woman only; for God hath called us to peace and purity.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Leah having stayed from bearing, resorts to the same expedient. Her fourth son was seemingly born in the fourth year of Jacob's marriage. Bearing her first four sons so rapidly, she would the sooner observe the temporary cessation. After the interval of a year she may have given Zilpah to Jacob. \"Gad.\" \"Victory cometh.\" She too claims a victory. \"Asher.\" Daughters will pronounce her happy who is so rich in sons. Leah is seemingly conscious that she is here pursuing a device of her own heart; and hence there is no explicit reference to the divine name or influence in the naming of the two sons of her maid.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3-9. Bilhah … Zilpah—Following the example of Sarah with regard to Hagar, an example which is not seldom imitated still, she adopted the children of her maid. Leah took the same course. A bitter and intense rivalry existed between them, all the more from their close relationship as sisters; and although they occupied separate apartments, with their families, as is the uniform custom where a plurality of wives obtains, and the husband and father spends a day with each in regular succession, that did not allay their mutual jealousies. The evil lies in the system, which being a violation of God's original ordinance, cannot yield happiness.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "A troop cometh, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "good luck cometh; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " my design hath well succeeded; a happy star hath shone upon me; and such a star in the opinion of astrologers is that of Jupiter, which by the Arabians is called Gad. This may well agree to Leah and her heathenish education, and the manners of the Chaldeans, who were much given to the study of the stars. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Leah said, a troop cometh,.... A troop of children, having bore four herself, and now her maid another, and more she expected; or the commander of a troop cometh, one that shall head an army and overcome his enemies; which agrees with the prophecy of Jacob, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 49:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and she called his name Gad: which signifies a \"troop\", glorying in the multitude of her children, that she had or hoped to have. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and she called his name Gad: which signifies a \"troop\", glorying in the multitude of her children, that she had or hoped to have. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Leah said, {d} A troop cometh: and she called his name Gad.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And Leah said, ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{d}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " A troop cometh: and she called his name Gad.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(d) That is, God increases me with a multitude of children for so Jacob explains this name Gad Ge 49:19.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Fortunate",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "with fortune",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "! Another reading is, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Fortune is come",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The versions (LXX ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐν τύχῃ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " = “with fortune,” Lat. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "feliciter",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") follow the reading of the Hebrew text (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ke’thîb",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The other reading, followed by the Massoretic tradition (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ḳerî",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), is found in the Targum of Onkelos. Gad seems to have been the name of an ancient Aramaean god of fortune, whose worship existed among the Canaanites. Cf. the names Baal-gad (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 11:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and Migdal-gad (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 15:37",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The Jews in Babylon made offerings to this god of good fortune; cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 65:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jdg 5:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Gilead takes the place of Gad.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Genesis 30:11",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Zilpah's Sons. - But Leah also was not content with the divine blessing bestowed upon her by Jehovah. The means employed by Rachel to retain the favour of her husband made her jealous; and jealousy drove her to the employment of the same means. Jacob begat two sons by Zilpah her maid. The one Leah named Gad, i.e., \"good fortune,\" saying, בּגד, \"with good fortune,\" according to the Chethib, for which the Masoretic reading is גּד בּא, \"good fortune has come,\" - not, however, from any ancient tradition, for the Sept. reads ἐν τύχῃ, but simply from a subjective and really unnecessary conjecture, since בּגד  equals  \"to my good fortune,\" sc., a son is born, gives a very suitable meaning. The second she named Asher, i.e., the happy one, or bringer of happiness; for she said, בּאשׁרי, \"to my happiness, for daughters call me happy,\" i.e., as a mother with children. The perfect אשּׁרני relates to \"what she had now certainly reached\" (Del.). Leah did not think of God in connection with these two births. They were nothing more than the successful and welcome result of the means she had employed. ",
        "children": []
      }
    ]
  }
]