[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "30:25-43 The fourteen years being gone, Jacob was willing to depart without any provision, except God's promise. But he had in many ways a just claim on Laban's substance, and it was the will of God that he should be provided for from it. He referred his cause to God, rather than agree for stated wages with Laban, whose selfishness was very great. And it would appear that he acted honestly, when none but those of the colours fixed upon should be found among his cattle. Laban selfishly thought that his cattle would produce few different in colour from their own. Jacob's course after this agreement has been considered an instance of his policy and management. But it was done by intimation from God, and as a token of his power. The Lord will one way or another plead the cause of the oppressed, and honour those who simply trust his providence. Neither could Laban complain of Jacob, for he had nothing more than was freely agreed that he should have; nor was he injured, but greatly benefitted by Jacob's services. May all our mercies be received with thanksgiving and prayer, that coming from his bounty, they may lead to his praise.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Jacob enters into a new contract of service with Laban. \"When Rachel had borne Joseph.\" Jacob cannot ask his dismissal until the twice seven years of service were completed. Hence, the birth of Joseph, which is the date of his request, took place at the earliest in the fifteenth year of his sojourn with Laban. Jacob now wishes to return home, from which he had been detained so long by serving for Rachel. He no doubt expects of Laban the means at least of accomplishing his journey. Laban is loath to part with him. \"I have divined\" - I have been an attentive observer. The result of his observation is expressed in the following words. \"Appoint.\" Laban offers to leave the fixing of the hire to Jacob. \"Thy hire upon me,\" which I will take upon me as binding. Jacob touches upon the value of his services, perhaps with the tacit feeling that Laban in equity owed him at least the means of returning to his home. \"Brake forth\" - increased. \"At my foot\" - under my guidance and tending of thy flocks.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Do\" - provide. \"Thou shalt not give me anything.\" This shows that Jacob had no stock from Laban to begin with. \"I will pass through all thy flock today\" with thee. \"Remove thou thence every speckled and spotted sheep, and every brown sheep among the lambs, and the spotted and speckled among the goats.\" These were the rare colors, as in the East the sheep are usually white, and the goats black or dark brown. \"And such shall be my hire.\" Such as these uncommon party-colored cattle, when they shall appear among the flock already cleared of them; and not those of this description that are now removed. For in this case Laban would have given Jacob something; whereas Jacob was resolved to be entirely dependent on the divine providence for his hire. \"And my righteousness will answer for me.\" The color will determine at once whose the animal is. Laban willingly consents to so favorable a proposal, removes the party-colored animals from the flock, gives them into the hands of his sons, and puts an interval of three days' journey between them and the pure stock which remains in Jacob's hands. Jacob is now to begin with nothing, and have for his hire any party-colored lambs or kids that appear in those flocks, from which every specimen of this rare class has been carefully removed.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"Do\" - provide. \"Thou shalt not give me anything.\" This shows that Jacob had no stock from Laban to begin with. \"I will pass through all thy flock today\" with thee. \"Remove thou thence every speckled and spotted sheep, and every brown sheep among the lambs, and the spotted and speckled among the goats.\" These were the rare colors, as in the East the sheep are usually white, and the goats black or dark brown. \"And such shall be my hire.\" Such as these uncommon party-colored cattle, when they shall appear among the flock already cleared of them; and not those of this description that are now removed. For in this case Laban would have given Jacob something; whereas Jacob was resolved to be entirely dependent on the divine providence for his hire. \"And my righteousness will answer for me.\" The color will determine at once whose the animal is. Laban willingly consents to so favorable a proposal, removes the party-colored animals from the flock, gives them into the hands of his sons, and puts an interval of three days' journey between them and the pure stock which remains in Jacob's hands. Jacob is now to begin with nothing, and have for his hire any party-colored lambs or kids that appear in those flocks, from which every specimen of this rare class has been carefully removed.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ge 30:25-43. Jacob's Covenant with Laban.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "25. when Rachel had born Joseph—Shortly after the birth of this son, Jacob's term of servitude expired, and feeling anxious to establish an independence for his family, he probably, from knowing that Esau was out of the way, announced his intention of returning to Canaan (Heb 13:14). In this resolution the faith of Jacob was remarkable, for as yet he had nothing to rely on but the promise of God (compare Ge 28:15).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Give me my wives,.... His two wives, Leah and Rachel, and the two maids, Bilhah and Zilpah, which he had given him for wives also; he desires leave not to have them, but to take them away with him: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and my children; his twelve children; he did not desire his father-in- law to take any of them, and keep them for him, but was desirous of having them with him: no doubt, for the sake of their education, though he had nothing of his own wherewith to support them; not doubting that God would make good his promise in giving him food and raiment, and returning him to his country; and which his faith applied to his family as well as to himself: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for whom I have served thee; not for his children, but for his wives, his two wives: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and let me go; free from thy service, and to my own country: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for thou knowest my service which I have done thee: how much and great it is, and with what diligence and faithfulness it has been performed, and that the time of it fixed and agreed upon was at an end. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "for thou knowest my service which I have done thee: how much and great it is, and with what diligence and faithfulness it has been performed, and that the time of it fixed and agreed upon was at an end. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Give me my wives and my children, for whom I have served thee, and let me go: for thou knowest my service which I have done thee.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "my wives and my children",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Jacob’s request implies that Laban as the head of the family possessed control over his married daughters and their children, who were included in Jacob’s wages.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 26.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Give me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (suffer me to take) ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "my wives and my children, for whom I have served thee, and let me go",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (literally, and I ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "will",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " go): ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "for thou knowest my service which I have done thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - implying that he had faithfully implemented his engagement, and that Laban was aware of the justness of his demand to be released from further servitude. Genesis 30:26",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "New Contract of Service Between Jacob and Laban. - As the second period of seven years terminated about the time of Joseph's birth, Jacob requested Laban to let him return to his own place and country, i.e., to Canaan. Laban, however, entreated him to remain, for he had perceived that Jehovah, Jacob's God, had blessed him for his sake; and told him to fix his wages for further service. The words, \"if I have found favour in thine eyes\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 30:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), contain an aposiopesis, sc., then remain. נחשׁתּי \"a heathen expression, like augurando cognovi\" (Delitzsch). עלי שׂכרך thy wages, which it will be binding upon me to give. Jacob reminded him, on the other hand, what service he had rendered him, how Jehovah's blessing had followed \"at his foot,\" and asked when he should begin to provide for his own house. But when Laban repeated the question, what should he give him, Jacob offered to feed and keep his flock still, upon one condition, which was founded upon the fact, that in the East the goats, as a rule, are black or dark-brown, rarely white or spotted with white, and that the sheep for the most part are white, very seldom black or speckled. Jacob required as wages, namely, all the speckled, spotted, and black among the sheep, and all the speckled, spotted, and white among the goats; and offered \"even to-day\" to commence separating them, so that \"to-morrow\" Laban might convince himself of the uprightness of his proceedings. הסר (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 30:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") cannot be imperative, because of the preceding אעבר, but must be infinitive: \"I will go through the whole flock to-day to remove from thence all...;\" and שׂכרי היה signifies \"what is removed shall be my wages,\" but not everything of an abnormal colour that shall hereafter be found in the flock. This was no doubt intended by Jacob, as the further course of the narrative shows, but it is not involved in the words of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 30:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Either the writer has restricted himself to the main fact, and omitted to mention that it was also agreed at the same time that the separation should be repeated at certain regular periods, and that all the sheep of an abnormal colour in Laban's flock should also be set aside as part of Jacob's wages; or this point was probably not mentioned at first, but taken for granted by both parties, since Jacob took measures with that idea to his own advantage, and even Laban, notwithstanding the frequent alteration of the contract with which Jacob charged him (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 31:7-8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 31:41",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), does not appear to have disputed this right. ",
        "children": []
      }
    ]
  }
]