[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(35) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And he removed.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The question has been asked whether it was Jacob or Laban who made the division, and whether Jacob was to have all such sheep and goats as were parti-coloured already, or such only as should be born afterwards. The authors of the Authorised Version evidently thought that Laban himself removed all speckled sheep and goats, and kept them; but the Hebrew is by no means so much in favour of this view as their own translation. Thus, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 30:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " they insert “of such” in italics; the Hebrew distinctly says, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And it shall be my hire: ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "that is, every one speckled or spotted shall be ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "mine, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "the singular number being used throughout. Next, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 30:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " they translate, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in time to come: ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "according to this, if the particoloured sheep and goats at any time produced white or black lambs, as they generally would, such would revert to Laban; the Hebrew says, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "My righteousness shall answer for me to-morrow. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Jacob was to make the selection at once, but the next day Laban was to look over all those put aside, and if he found among them any white sheep, or black or brown goats, he was to regard them as stolen—that is, not merely might he take them back, but require the usual fine or compensation.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And gave them into the hand of his sons.—It has been assumed that these were Laban’s sons, on the ground that Jacob’s sons were not old enough to undertake the charge; but as Reuben was twenty-six, this was not the case. Jacob’s flocks would have fared but badly if they had been entrusted to Laban’s sons, nor could he, six years later, have escaped, had his property been in their keeping, without Laban being immediately aware of it.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "And gave them into the hand of his sons.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—It has been assumed that these were Laban’s sons, on the ground that Jacob’s sons were not old enough to undertake the charge; but as Reuben was twenty-six, this was not the case. Jacob’s flocks would have fared but badly if they had been entrusted to Laban’s sons, nor could he, six years later, have escaped, had his property been in their keeping, without Laban being immediately aware of it.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 30:35-36. ",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 30:35-36",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He gave them into the hands of his sons — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "To be fed apart by themselves, lest Jacob should get any of them to mix with those of one colour. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He set three days’ journey betwixt himself and Jacob — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Such journeys as flocks are able to make, that they might not so much as see one another. Between this and the 37th verse, the Samaritan copy inserts a paragraph about the angel’s appearing to Jacob in a dream, which is not found in any other version; but is related by Jacob himself in the following chapter, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 30:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as a thing which had happened to him, and which justifies the policy which the subsequent verses represent him as using.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "30:25-43 The fourteen years being gone, Jacob was willing to depart without any provision, except God's promise. But he had in many ways a just claim on Laban's substance, and it was the will of God that he should be provided for from it. He referred his cause to God, rather than agree for stated wages with Laban, whose selfishness was very great. And it would appear that he acted honestly, when none but those of the colours fixed upon should be found among his cattle. Laban selfishly thought that his cattle would produce few different in colour from their own. Jacob's course after this agreement has been considered an instance of his policy and management. But it was done by intimation from God, and as a token of his power. The Lord will one way or another plead the cause of the oppressed, and honour those who simply trust his providence. Neither could Laban complain of Jacob, for he had nothing more than was freely agreed that he should have; nor was he injured, but greatly benefitted by Jacob's services. May all our mercies be received with thanksgiving and prayer, that coming from his bounty, they may lead to his praise.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Jacob enters into a new contract of service with Laban. \"When Rachel had borne Joseph.\" Jacob cannot ask his dismissal until the twice seven years of service were completed. Hence, the birth of Joseph, which is the date of his request, took place at the earliest in the fifteenth year of his sojourn with Laban. Jacob now wishes to return home, from which he had been detained so long by serving for Rachel. He no doubt expects of Laban the means at least of accomplishing his journey. Laban is loath to part with him. \"I have divined\" - I have been an attentive observer. The result of his observation is expressed in the following words. \"Appoint.\" Laban offers to leave the fixing of the hire to Jacob. \"Thy hire upon me,\" which I will take upon me as binding. Jacob touches upon the value of his services, perhaps with the tacit feeling that Laban in equity owed him at least the means of returning to his home. \"Brake forth\" - increased. \"At my foot\" - under my guidance and tending of thy flocks.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Do\" - provide. \"Thou shalt not give me anything.\" This shows that Jacob had no stock from Laban to begin with. \"I will pass through all thy flock today\" with thee. \"Remove thou thence every speckled and spotted sheep, and every brown sheep among the lambs, and the spotted and speckled among the goats.\" These were the rare colors, as in the East the sheep are usually white, and the goats black or dark brown. \"And such shall be my hire.\" Such as these uncommon party-colored cattle, when they shall appear among the flock already cleared of them; and not those of this description that are now removed. For in this case Laban would have given Jacob something; whereas Jacob was resolved to be entirely dependent on the divine providence for his hire. \"And my righteousness will answer for me.\" The color will determine at once whose the animal is. Laban willingly consents to so favorable a proposal, removes the party-colored animals from the flock, gives them into the hands of his sons, and puts an interval of three days' journey between them and the pure stock which remains in Jacob's hands. Jacob is now to begin with nothing, and have for his hire any party-colored lambs or kids that appear in those flocks, from which every specimen of this rare class has been carefully removed.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"Do\" - provide. \"Thou shalt not give me anything.\" This shows that Jacob had no stock from Laban to begin with. \"I will pass through all thy flock today\" with thee. \"Remove thou thence every speckled and spotted sheep, and every brown sheep among the lambs, and the spotted and speckled among the goats.\" These were the rare colors, as in the East the sheep are usually white, and the goats black or dark brown. \"And such shall be my hire.\" Such as these uncommon party-colored cattle, when they shall appear among the flock already cleared of them; and not those of this description that are now removed. For in this case Laban would have given Jacob something; whereas Jacob was resolved to be entirely dependent on the divine providence for his hire. \"And my righteousness will answer for me.\" The color will determine at once whose the animal is. Laban willingly consents to so favorable a proposal, removes the party-colored animals from the flock, gives them into the hands of his sons, and puts an interval of three days' journey between them and the pure stock which remains in Jacob's hands. Jacob is now to begin with nothing, and have for his hire any party-colored lambs or kids that appear in those flocks, from which every specimen of this rare class has been carefully removed.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "32. I will pass through all thy flock to-day—Eastern sheep being generally white, the goats black, and spotted or speckled ones comparatively few and rare, Jacob proposed to remove all existing ones of that description from the flock, and to be content with what might appear at the next lambing time. The proposal seemed so much in favor of Laban, that he at once agreed to it. But Jacob has been accused of taking advantage of his uncle, and though it is difficult to exculpate him from practising some degree of dissimulation, he was only availing himself of the results of his great skill and experience in the breeding of cattle. But it is evident from the next chapter (Ge 31:5-13) that there was something miraculous and that the means he had employed had been suggested by a divine intimation.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The he-goats that were ring-straked, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which had lines or strakes like bands about them of diverse colours from the rest of their body. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Every one that had some white:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " this word ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "some",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is oft understood in other texts of Scripture, and here it is so necessarily; as appears both from the thing itself, as it is related, and from the phrase; for he saith not ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that was white, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " but ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that had white in it, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to wit, mixed with other colours. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And he removed that day the he goats that were ringstraked and spotted,.... That had strakes of a different colour from the rest on their shoulders, thighs, logs, or feet, or in any part of the body: the word here used stands in the room of that before translated \"speckled\"; this Laban did, as the context shows; he went about it immediately at the motion of Jacob, with which he was pleased: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and all the she goats that were speckled and spotted; so that there might be neither male nor female of those mixed colours; this he did to prevent any generation of them: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and everyone that had some white in it; any white spot in it, as the Targum of Jonathan; that is, everyone of the brown or black colour, that had any white in it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and all the brown among the sheep: that were entirely so: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and, gave them into the hands of his sons; not the sons of Jacob, as some in Aben Ezra; for they were not fit for the care of a flock, the eldest son, Reuben, not being seven years of age; but the sons of Laban, who were now grown up and fit for such service. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and, gave them into the hands of his sons; not the sons of Jacob, as some in Aben Ezra; for they were not fit for the care of a flock, the eldest son, Reuben, not being seven years of age; but the sons of Laban, who were now grown up and fit for such service. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And he removed that day the he goats that were ring-streaked and spotted, and all the she goats that were speckled and spotted, and every one that had some white in it, and all the brown among the sheep, and gave them into the hand of his sons.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "into the hand of his sons",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Laban in accepting Jacob’s offer determines to make the very best of the new arrangement. Any parti-coloured goats, and any black sheep in his flock, “he removed that day,” and put into the keeping of his own sons, so that they might not afterwards be claimed by Jacob. Jacob will begin the new term of service with nothing in his favour. All the sheep that he will tend will be white, and all the goats black.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 35.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And he",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - Laban (Rosenmüller, Keil, Delitzsch, Kalisch, Murphy, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "et alii",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); Jacob (Lange) - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "removed that day",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (that the smallest possible chance of success might remain to his nephew) ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "the he-goats that were ringstraked",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (striped or banded) ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "and spotted, and all the she-goats that were speckled and spotted, and every one that had some white in it, and all the brown among the sheep,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - four sorts of animals were to be removed: ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(1)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the dotted, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(2)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the patched, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(3)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the ring-marked or striped, and ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(4)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the black or brown - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "and gave them into the hand of his",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Laban's or Jacob's, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "ut supra",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "sons",
        "children": [
          {
            "element": "span",
            "class": "cmt_word",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "sons",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". Genesis 30:35",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Laban cheerfully accepted the proposal, but did not leave Jacob to make the selection. He undertook that himself, probably to make more sure, and then gave those which were set apart as Jacob's wages to his own sons to tend, since it was Jacob's duty to take care of Laban's flock, and \"set three days' journey betwixt himself and Jacob,\" i.e., between the flock to be tended by himself through his sons, and that to be tended by Jacob, for the purpose of preventing any copulation between the animals of the two flocks. Nevertheless he was overreached by Jacob, who adopted a double method of increasing the wages agreed upon. In the first place (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 30:37-39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), he took fresh rods of storax, maple, and walnut-trees, all of which have a dazzling white wood under their dark outside, and peeled white stripes upon them, הלּבן מחשׂף (the verbal noun instead of the inf. abs. חשׂף), \"peeling the white naked in the rods.\" These partially peeled, and therefore mottled rods, he placed in the drinking-troughs (רהטים lit., gutters, from רהט  equals  רוּץ to run, is explained by המּים שׁקתות water-troughs), to which the flock came to drink, in front of the animals, in order that, if copulation took place at the drinking time, it might occur near the mottled sticks, and the young be speckled and spotted in consequence. ויּחמנה a rare, antiquated form for ותּחמנה from חמם, and ויּחמוּ for ויּחמוּ imperf. Kal of יחם  equals  חמם. This artifice was founded upon a fact frequently noticed, particularly in the case of sheep, that whatever fixes their attention in copulation is marked upon the young (see the proofs in Bochart, Hieroz. 1, 618, and Friedreich zur Bibel 1, 37ff.). - Secondly (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 30:40",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), Jacob separated the speckled animals thus obtained from those of a normal colour, and caused the latter to feed so that the others would be constantly in sight, in order that he might in this way obtain a constant accession of mottled sheep. As soon as these had multiplied sufficiently, he formed separate flocks (viz., of the speckled additions), \"and put them not unto Laban's cattle;\" i.e., he kept them apart in order that a still larger number of speckled ones might be procured, through Laban's one-coloured flock having this mottled group constantly in view. ",
        "children": []
      }
    ]
  }
]