[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "30:25-43 The fourteen years being gone, Jacob was willing to depart without any provision, except God's promise. But he had in many ways a just claim on Laban's substance, and it was the will of God that he should be provided for from it. He referred his cause to God, rather than agree for stated wages with Laban, whose selfishness was very great. And it would appear that he acted honestly, when none but those of the colours fixed upon should be found among his cattle. Laban selfishly thought that his cattle would produce few different in colour from their own. Jacob's course after this agreement has been considered an instance of his policy and management. But it was done by intimation from God, and as a token of his power. The Lord will one way or another plead the cause of the oppressed, and honour those who simply trust his providence. Neither could Laban complain of Jacob, for he had nothing more than was freely agreed that he should have; nor was he injured, but greatly benefitted by Jacob's services. May all our mercies be received with thanksgiving and prayer, that coming from his bounty, they may lead to his praise.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Jacob devises means to provide himself with a flock in these unfavorable circumstances. His first device is to place party-colored rods before the eyes of the cattle at the rutting season, that they might drop lambs and kids varied with speckles, patches, or streaks of white. He had learned from experience that there is a congruence between the colors of the objects contemplated by the dams at that season and those of their young. At all events they bare many straked, speckled, and spotted lambs and kids. He now separated the lambs, and set the faces of the flock toward the young of the rare colors, doubtless to affect them in the same way as the pilled rods. \"Put his own folds by themselves.\" These are the party-colored cattle that from time to time appeared in the flock of Laban. In order to secure the stronger cattle, Jacob added the second device of employing the party-colored rods only when the strong cattle conceived. The sheep in the East lamb twice a year, and it is supposed that the lambs dropped in autumn are stronger than those dropped in the spring. On this supposition Jacob used his artifice in the spring, and not in the autumn. It is probable, however, that he made his experiments on the healthy and vigorous cattle, without reference to the season of the year. The result is here stated. \"The man brake forth exceedingly\" - became rapidly rich in hands and cattle.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "It is obvious that the preceding and present chapters form one continuous piece of composition; as otherwise we have no account of the whole family of Jacob from one author. But the names אלהים  'ĕlohı̂ym and יהוה yehovâh are both employed in the piece, and, hence, their presence and interchange cannot indicate diversity of authorship. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": " - Jacob's Flight from Haran",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "19. תרפים  terāpı̂ym, Teraphim. This word occurs fifteen times in the Old Testament. It appears three times in this chapter, and nowhere else in the Pentateuch. It is always in the plural number. The root does not appear in Biblical Hebrew. It perhaps means \"to live well,\" intransitively (Gesenius, Roedig.), \"to nourish,\" transitively (Furst). The teraphim were symbols or representatives of the Deity, as Laban calls them his gods. They seem to have been busts (προτομαί  protomai, Aquila) of the human form, sometimes as large as life 1 Samuel 19:13. Those of full size were probably of wood; the smaller ones may have been of metal. In two passages Judges 17:1-13; 18; Hosea 3:4 they are six times associated with the ephod. This intimates either that they were worn on the ephod, like the Urim and Thummim, or more probably that the ephod was worn on them; in accordance with which they were employed for the purposes of divination Genesis 30:27; Zechariah 10:2. The employment of them in the worship of God, which Laban seems to have inherited from his fathers Joshua 24:2, is denounced as idolatry 1 Samuel 15:23; and hence, they are classed with the idols and other abominations put away by Josiah 2 Kings 23:24.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "19. תרפים  terāpı̂ym, Teraphim. This word occurs fifteen times in the Old Testament. It appears three times in this chapter, and nowhere else in the Pentateuch. It is always in the plural number. The root does not appear in Biblical Hebrew. It perhaps means \"to live well,\" intransitively (Gesenius, Roedig.), \"to nourish,\" transitively (Furst). The teraphim were symbols or representatives of the Deity, as Laban calls them his gods. They seem to have been busts (προτομαί  protomai, Aquila) of the human form, sometimes as large as life ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 19:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Those of full size were probably of wood; the smaller ones may have been of metal. In two passages ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 17:1-13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; 18; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 3:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " they are six times associated with the ephod. This intimates either that they were worn on the ephod, like the Urim and Thummim, or more probably that the ephod was worn on them; in accordance with which they were employed for the purposes of divination ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 30:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 10:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The employment of them in the worship of God, which Laban seems to have inherited from his fathers ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 24:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", is denounced as idolatry ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 15:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and hence, they are classed with the idols and other abominations put away by Josiah ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 23:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "47. שׂהדוּתא יגר  yegar-śâhădûtā', Jegar-sahadutha, \"cairn of witness\" in the Aramaic dialect of the old Hebrew or Shemite speech. גלעד  gal‛ēd, Gal'ed; and גלעד  gı̂l‛ād, Gil'ad, \"cairn of witness\" in Hebrew especially so called (see Genesis 11:1-9).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "47. שׂהדוּתא יגר  yegar-śâhădûtā', Jegar-sahadutha, \"cairn of witness\" in the Aramaic dialect of the old Hebrew or Shemite speech. גלעד  gal‛ēd, Gal'ed; and גלעד  gı̂l‛ād, Gil'ad, \"cairn of witness\" in Hebrew especially so called (see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 11:1-9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "49. מצפה  mı̂tspâh, Mizpah, \"watch-tower.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Jacob had now been twenty years in Laban's service, and was therefore, ninety-six years of age. It has now become manifest that he cannot obtain leave of Laban to return home. He must, therefore, either come off by the high hand, or by secret flight. Jacob has many reasons for preferring the latter course.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Jacob had now been twenty years in Laban's service, and was therefore, ninety-six years of age. It has now become manifest that he cannot obtain leave of Laban to return home. He must, therefore, either come off by the high hand, or by secret flight. Jacob has many reasons for preferring the latter course.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "38. watering troughs—usually a long stone block hollowed out, from which several sheep could drink at once, but sometimes so small as to admit of only one drinking at a time.   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The flocks conceived; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "were heated, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. inflamed or excited, and disposed to conceive, and this in a more than ordinary manner by the Divine disposal. The event hath some foundation in nature, because of the great power of imagination; and there are divers instances in many authors, both of women and of beasts, who either by the strong fancying, or by the actual and frequent contemplation, of some certain objects, have brought forth young ones exactly of the same colour and complexion, as one did an Ethiopian, &c. But the providence of God was the principal cause of this effect, without which the productions of that kind would neither have been so many nor so certain. This policy of Jacob’s could scarcely be excused from deceit and injustice, if it were not manifest that it was done by the direction and authority of the sovereign Lord of all estates, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Genesis 31:9,11",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 31:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c., who may take them from one, and give them to another, as it pleaseth him; who also observed Laban’s injustice, and gave to Jacob no more than he abundantly deserved from Laban. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the flocks conceived before the rods,.... At them, and in sight of them; which had such influence upon them through thee force of imagination, and a divine power and providence so directing and succeeding this device, that they ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "brought forth cattle ringstraked, speckled, and spotted; such as Jacob was to have for his hire; and, though there was no doubt a more than ordinary concourse of divine Providence attending this affair; yet there have been many strange things brought about in a natural way by the strength of imagination, as may be observed in those marks which women are said to mark their children with, while with child of them; as also in conceiving and bearing such like unto them they have fancied, as the woman that bore a blackamoor, through often looking at the picture of one in her chamber; and an Ethiopian queen, who by the same means bore a white child, fair and beautiful, which she exposed, lest she should be thought an adulteress (r): and what comes nearer to the case here, Jerom reports (s) the like things done in Spain among horses and mares, by placing beautiful horses before mares at the time of leaping; and the Apis, or Egyptian ox, which had peculiar spots in it, was produced in like manner, so that there was always in succession one of the same form and colour, as Austin asserts (t); and it may be observed, what is affirmed by some writers (u), that sheep will change their colours according to the different waters they drink of at the time of their being covered; and that some rivers drank of will make white sheep black, and black white, and others red and yellow. But as Jacob was directed of God to take this method, this is sufficient to justify him, and upon his blessing and providence the success depended, whatever there may be in nature to bring about such an effect; and as it was to do himself justice, who had been greatly injured by Laban, it was equally as just and righteous a thing to take this course, as it was for the Israelites by a divine direction to borrow jewels, &c. of the Egyptians, whereby they were repaid for their hard service. (This was written over one hundred years before the laws of genetics were discovered. We know that the result was from God not of Jacob's schemes. Ed.) ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(r) Heliodor. Ethiopic. l. 4. c. 8. (s) Quaest. Heb. in Gen. fol. 70. L. M. (t) De Civit. Dei, l. 18. c. 5. (u) Aelian. de Animal. l. 8. c. 21. Plin. Nat. Hist. l. 2. c. 103. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(r) Heliodor. Ethiopic. l. 4. c. 8. (s) Quaest. Heb. in Gen. fol. 70. L. M. (t) De Civit. Dei, l. 18. c. 5. (u) Aelian. de Animal. l. 8. c. 21. Plin. Nat. Hist. l. 2. c. 103. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And the flocks conceived before the rods, and brought forth cattle ring-streaked, speckled, and spotted.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 39.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And the flocks conceived",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "ut supra",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "before the rods, and brought forth cattle ringstraked, speckled, and spotted",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The fact is said to have been frequently observed that, particularly in the case of sheep, whatever fixes their attention in copulation is marked upon the young. That Jacob believed in the efficacy of the artifice he adopted is apparent; but the multiplication of Parti-colored animals it will be safer to ascribe to Divine blessing than to human craft. Genesis 30:39",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Laban cheerfully accepted the proposal, but did not leave Jacob to make the selection. He undertook that himself, probably to make more sure, and then gave those which were set apart as Jacob's wages to his own sons to tend, since it was Jacob's duty to take care of Laban's flock, and \"set three days' journey betwixt himself and Jacob,\" i.e., between the flock to be tended by himself through his sons, and that to be tended by Jacob, for the purpose of preventing any copulation between the animals of the two flocks. Nevertheless he was overreached by Jacob, who adopted a double method of increasing the wages agreed upon. In the first place (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 30:37-39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), he took fresh rods of storax, maple, and walnut-trees, all of which have a dazzling white wood under their dark outside, and peeled white stripes upon them, הלּבן מחשׂף (the verbal noun instead of the inf. abs. חשׂף), \"peeling the white naked in the rods.\" These partially peeled, and therefore mottled rods, he placed in the drinking-troughs (רהטים lit., gutters, from רהט  equals  רוּץ to run, is explained by המּים שׁקתות water-troughs), to which the flock came to drink, in front of the animals, in order that, if copulation took place at the drinking time, it might occur near the mottled sticks, and the young be speckled and spotted in consequence. ויּחמנה a rare, antiquated form for ותּחמנה from חמם, and ויּחמוּ for ויּחמוּ imperf. Kal of יחם  equals  חמם. This artifice was founded upon a fact frequently noticed, particularly in the case of sheep, that whatever fixes their attention in copulation is marked upon the young (see the proofs in Bochart, Hieroz. 1, 618, and Friedreich zur Bibel 1, 37ff.). - Secondly (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 30:40",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), Jacob separated the speckled animals thus obtained from those of a normal colour, and caused the latter to feed so that the others would be constantly in sight, in order that he might in this way obtain a constant accession of mottled sheep. As soon as these had multiplied sufficiently, he formed separate flocks (viz., of the speckled additions), \"and put them not unto Laban's cattle;\" i.e., he kept them apart in order that a still larger number of speckled ones might be procured, through Laban's one-coloured flock having this mottled group constantly in view. ",
        "children": []
      }
    ]
  }
]