[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(9-13) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Leah ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". . . ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "took Zilpah . . . —",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "By ceasing to bear, Leah had lost her one hold upon her husband’s affection, and to regain it she follows Rachel’s example. The struggle of these two women for the husband gives us a strange picture of manners and morals, but must not be judged by our standard. Leah herself regards the bestowal of her handmaid upon Jacob as a deserving act of self-sacrifice (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 30:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The names, moreover, which she gives to Zilpah’s children show that the happier frame of mind to which she had attained when she called her fourth son “Judah,” ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "praise, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "remained unbroken. On the birth of the first, she says, “With good luck!” and calls his name “Gad,” that is, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "luck. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The Jews read, in their synagogue, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Luck cometh, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "whence the rendering of the Authorised Version, “A troop cometh;” but there is no justification for the change. With regard to the meaning of the word “Gad,” all the Versions render it ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "prosperity, good fortune. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Nor is the Samaritan, as has been alleged, an exception; for though the worthless Latin translation of it has “a troop cometh,” the Samaritan itself has ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "with good luck. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 65:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " we find Gad used as the name of an idol. Zilpah’s other son is called Asher, that is, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "happy, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "in Latin Felix, and Leah says, “With my happiness,” using just the same turn of speech as before. The first child came bringing ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "her ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "good luck; the second brought her happiness.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 30:9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 30:9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". Rachel had absurdly and preposterously put her maid into her husband’s bed; and now Leah, because she missed one year in bearing children, doth the same, to be even with her. See the power of rivalship, and admire the wisdom of the divine appointment, which joins together one man and one woman only. Two sons Zilpah bare to Jacob, whom Leah looked upon herself as entitled to, in token of which, she called one Gad, promising herself a little ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "troop ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "of children. The other she called Asher, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "happy, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "thinking herself happy in him, and promising herself that her neighbours would think so too.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "30:1-13 Rachel envied her sister: envy is grieving at the good of another, than which no sin is more hateful to God, or more hurtful to our neighbours and ourselves. She considered not that God made the difference, and that in other things she had the advantage. Let us carefully watch against all the risings and workings of this passion in our minds. Let not our eye be evil towards any of our fellow-servants, because our Master's is good. Jacob loved Rachel, and therefore reproved her for what she said amiss. Faithful reproofs show true affection. God may be to us instead of any creature; but it is sin and folly to place any creature in God's stead, and to place that confidence in any creature, which should be placed in God only. At the persuasion of Rachel, Jacob took Bilhah her handmaid to wife, that, according to the usage of those times, her children might be owned as her mistress's children. Had not Rachel's heart been influenced by evil passions, she would have thought her sister's children nearer to her, and more entitled to her care than Bilhah's. But children whom she had a right to rule, were more desirable to her than children she had more reason to love. As an early instance of her power over these children, she takes pleasure in giving them names that carry in them marks of rivalry with her sister. See what roots of bitterness envy and strife are, and what mischief they make among relations. At the persuasion of Leah, Jacob took Zilpah her handmaid to wife also. See the power of jealousy and rivalship, and admire the wisdom of the Divine appointment, which joins together one man and one woman only; for God hath called us to peace and purity.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Leah having stayed from bearing, resorts to the same expedient. Her fourth son was seemingly born in the fourth year of Jacob's marriage. Bearing her first four sons so rapidly, she would the sooner observe the temporary cessation. After the interval of a year she may have given Zilpah to Jacob. \"Gad.\" \"Victory cometh.\" She too claims a victory. \"Asher.\" Daughters will pronounce her happy who is so rich in sons. Leah is seemingly conscious that she is here pursuing a device of her own heart; and hence there is no explicit reference to the divine name or influence in the naming of the two sons of her maid.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3-9. Bilhah … Zilpah—Following the example of Sarah with regard to Hagar, an example which is not seldom imitated still, she adopted the children of her maid. Leah took the same course. A bitter and intense rivalry existed between them, all the more from their close relationship as sisters; and although they occupied separate apartments, with their families, as is the uniform custom where a plurality of wives obtains, and the husband and father spends a day with each in regular succession, that did not allay their mutual jealousies. The evil lies in the system, which being a violation of God's original ordinance, cannot yield happiness.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "When Leah saw that she had left bearing,.... For a little while, for she afterwards bore again, and observing also what her sister had done: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "she took Zilpah her maid, and gave her Jacob to wife: in this she was less excusable than Rachel, since she had four children of her own, and therefore might have been content without desiring others by her maid; nor had she long left off bearing, and therefore had no reason to give up hope of having any more. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "she took Zilpah her maid, and gave her Jacob to wife: in this she was less excusable than Rachel, since she had four children of her own, and therefore might have been content without desiring others by her maid; nor had she long left off bearing, and therefore had no reason to give up hope of having any more. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "When Leah saw that she had left bearing, she took Zilpah her maid, and gave her Jacob to wife.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 9.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "When Leah saw that she had left bearing",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "stood from bearing",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 29:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "she took Zilpah her maid, and gave her to Jacob to wife",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - being in this led astray by Rachel's sinful example, both as to the spirit of unholy rivalry she cherished, and the questionable means she employed for its gratification. Genesis 30:9",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Zilpah's Sons. - But Leah also was not content with the divine blessing bestowed upon her by Jehovah. The means employed by Rachel to retain the favour of her husband made her jealous; and jealousy drove her to the employment of the same means. Jacob begat two sons by Zilpah her maid. The one Leah named Gad, i.e., \"good fortune,\" saying, בּגד, \"with good fortune,\" according to the Chethib, for which the Masoretic reading is גּד בּא, \"good fortune has come,\" - not, however, from any ancient tradition, for the Sept. reads ἐν τύχῃ, but simply from a subjective and really unnecessary conjecture, since בּגד  equals  \"to my good fortune,\" sc., a son is born, gives a very suitable meaning. The second she named Asher, i.e., the happy one, or bringer of happiness; for she said, בּאשׁרי, \"to my happiness, for daughters call me happy,\" i.e., as a mother with children. The perfect אשּׁרני relates to \"what she had now certainly reached\" (Del.). Leah did not think of God in connection with these two births. They were nothing more than the successful and welcome result of the means she had employed. ",
        "children": []
      }
    ]
  }
]