[{"header":"David’s Battles"},{"num":18,"verse":"After this David won the war against the Philistines and put them under his power. He took Gath and its towns from the Philistines. "},{"num":2,"verse":"He won the war against Moab. And the Moabites were made to work for David, bringing taxes to him. "},{"num":3,"verse":"David won the war against King Hadadezer of Zobah as far as Hamath, as he went to bring his power to the Euphrates River. "},{"num":4,"verse":"David took from him 1,000 war-wagons, 7,000 horsemen, and 20,000 foot soldiers. And he cut the legs of all but 100 war-wagon horses."},{"num":5,"verse":"The Syrians of Damascus came to help King Hadadezer of Zobah. But David killed 22,000 of the Syrian men. "},{"num":6,"verse":"Then David put soldiers in Syria of Damascus. And the Syrians became servants to David, paying taxes. The Lord helped David in every place he went. "},{"num":7,"verse":"David took the battle-coverings of gold which were carried by Hadadezer’s servants, and brought them to Jerusalem. "},{"num":8,"verse":"He took a very large amount of brass from Hadadezer’s cities, Tibhath and Cun. This was the brass Solomon used to make the brass pool, the pillars, and the brass pots."},{"num":9,"verse":"King Tou of Hamath heard that David had won the war against all the army of King Hadadezer of Zobah. "},{"num":10,"verse":"So he sent his son Hadoram to King David, to greet him and give honor to him, because David had fought against Hadadezer and won. For Hadadezer had been at war with Tou. Hadoram brought all kinds of things of gold and silver and brass. "},{"num":11,"verse":"King David set these apart to the Lord, with the silver and gold he had carried away from all the nations. He took things from Edom, Moab, the sons of Ammon, the Philistines, and Amalek."},{"num":12,"verse":"Abishai the son of Zeruiah won the war from 18,000 Edomites in the Valley of Salt. "},{"num":13,"verse":"Then he put soldiers in Edom. And the Edomites became servants to David. The Lord helped David every place he went."},{"num":14,"verse":"So David ruled over all Israel. He did what was fair and right and good for all his people. "},{"num":15,"verse":"Joab the son of Zeruiah was captain of the army. Jehoshaphat the son of Ahilud wrote down the things of the nation. "},{"num":16,"verse":"Zadok the son of Ahitub and Abimelech the son of Abiathar were religious leaders. Shavsha was the one who writes everything down. "},{"num":17,"verse":"Benaiah the son of Jehoiada was over the Cherethites and the Pelethites. And the sons of David were leaders at the king’s side."}]