[{"header":"The Passover Feast"},{"num":16,"verse":"Celebrate the Passover Feast of the Lord your God in the month of Aviv. In that month he brought you out of Egypt at night. "},{"num":2,"verse":"Sacrifice an animal from your flock or herd. It is the Passover sacrifice to honor the Lord your God. Sacrifice it at the special place the Lord will choose. He will put his Name there. "},{"num":3,"verse":"Don’t eat the animal along with bread made with yeast. Instead, for seven days eat bread made without yeast. It’s the bread that reminds you of how much you suffered. Remember that you left Egypt in a hurry. Remember it all the days of your life. Don’t forget the day you left Egypt. "},{"num":4,"verse":"Don’t keep any yeast anywhere in your land for seven days. You will sacrifice the Passover animal on the evening of the first day. Do not let any of its meat be left over until the next morning."},{"num":5,"verse":"You must not sacrifice the Passover animal in just any town the Lord your God is giving you. "},{"num":6,"verse":"Sacrifice it only in the special place he will choose for his Name. Sacrifice it there in the evening when the sun goes down. Do it on the same day every year. Be sure it’s the day you left Egypt. "},{"num":7,"verse":"Cook the animal and eat it. Do it at the place the Lord your God will choose. Then in the morning return to your tents. "},{"num":8,"verse":"For six days eat bread made without yeast. On the seventh day come together for a service to honor the Lord your God. Don’t do any work on that day."},{"header":"The Feast of Weeks"},{"num":9,"verse":"Count off seven weeks from the time you begin to cut your grain in the field. "},{"num":10,"verse":"Then celebrate the Feast of Weeks to honor the Lord your God. Give to the Lord anything you choose to give as an offering. Give, just as the Lord has given to you. "},{"num":11,"verse":"Be filled with joy in the sight of the Lord your God. Be joyful at the special place he will choose for his Name. You, your children, and your male and female servants should be joyful. So should the Levites living in your towns. So should the outsiders and widows living among you. And so should the children whose fathers have died. "},{"num":12,"verse":"Remember that you were slaves in Egypt. Be careful to obey the rules I’m giving you."},{"header":"The Feast of Booths"},{"num":13,"verse":"Gather the grain from your threshing floors. Take the fresh wine from your winepresses. Then celebrate the Feast of Booths for seven days. "},{"num":14,"verse":"Be filled with joy at your feast. You, your children, and your male and female servants should be joyful. So should the Levites, the outsiders, and the widows living in your towns. And so should the children whose fathers have died. "},{"num":15,"verse":"For seven days celebrate the feast to honor the Lord your God. Do it at the place he will choose. The Lord will bless you when you gather all your crops. He’ll bless you in everything you do. And you will be full of joy. "},{"num":16,"verse":"All your men must appear in front of the Lord your God at the holy tent. They must go to the place he will choose. They must do it three times a year. They must go there to celebrate the Feast of Unleavened Bread, the Feast of Weeks and the Feast of Booths. None of your men should appear in front of the Lord without bringing something with him. "},{"num":17,"verse":"Each of you must bring a gift. Give to the Lord your God, just as he has given to you."},{"header":"Appoint Judges and Officials"},{"num":18,"verse":"Appoint judges and officials for each of your tribes. Do it in every town the Lord your God is giving you. They must judge the people fairly. "},{"num":19,"verse":"Do what is right. Treat everyone the same. Don’t take money from people who want special favors. It makes those who are wise close their eyes to the truth. It twists the words of those who have done nothing wrong. "},{"num":20,"verse":"Do only what is right. Then you will live. You will take over the land the Lord your God is giving you."},{"header":"Don’t Worship Other Gods"},{"num":21,"verse":"Don’t set up a wooden pole used to worship the female god named Asherah. Don’t set it up beside the altar you build to worship the Lord your God. "},{"num":22,"verse":"Don’t set up a sacred stone to honor another god. The Lord your God hates Asherah poles and sacred stones."}]