[{"num":18,"verse":"¶ Then Bildad, the Shuhite, answered and said,"},{"num":2,"verse":"How long will it be ere ye make an end of words? Understand, and afterwards we will speak."},{"num":3,"verse":"Why are we counted as beasts? Are we vile in your sight?"},{"num":4,"verse":"O thou that dost tear thy soul in thine anger; shall the earth be forsaken because of thee and shall the rocks be removed out of their place?"},{"num":5,"verse":"¶ The light of the wicked shall certainly be put out, and the spark of his fire shall not shine."},{"num":6,"verse":"The light shall be dark in his tabernacle, and his lamp shall be put out with him."},{"num":7,"verse":"The steps of his strength shall be cut down, and his own counsel shall cast him down."},{"num":8,"verse":"For a net shall be cast at his feet, and he shall walk upon a network."},{"num":9,"verse":"The snare shall take him by the heel, and the robber shall prevail against him."},{"num":10,"verse":"The cord is hidden in the ground and a trap for him in the way."},{"num":11,"verse":"¶ Terrors shall make him afraid on every side, and his own feet shall drive him away."},{"num":12,"verse":"His strength shall be hungerbitten, and destruction shall be ready at his side."},{"num":13,"verse":"They shall devour the protection of his skin; the firstborn of death shall devour his members."},{"num":14,"verse":"His confidence shall be rooted out of his tent, and he shall be brought to the king of terrors."},{"num":15,"verse":"He shall dwell in his tent, as if it were not his; brimstone shall be scattered upon his habitation."},{"num":16,"verse":"His roots shall be dried up beneath, and above his branch shall be cut off."},{"num":17,"verse":"His memory shall perish from the earth, and he shall have no name in the streets."},{"num":18,"verse":"He shall be driven from the light into the darkness and chased out of the world."},{"num":19,"verse":"He shall have neither son nor grandson among his people, nor any to succeed him in his dwellings."},{"num":20,"verse":"Those that come after him shall be dismayed at his day, as those that went before were overcome with fear."},{"num":21,"verse":"Surely such are the dwellings of the wicked, and this is the place of him that does not know God."}]