[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(33) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Till Moses had done speaking with them, he put a vail on his face.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—This translation exactly inverts the meaning, which is that “",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "when ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Moses had done speaking with them, he put a vail on his face.” The vail became part of his ordinary costume, and was worn excepting upon occasions of two kinds: (1) When Moses was alone with God, either in the temporary “tent of meeting” or in the permanent Tabernacle, he ceased to wear the vail, and spoke with God face to face; (2) when he had a message to the people from God, and spoke to them as God’s representative, he authenticated his message by uncovering himself, and allowing the glory of his face to be seen. Otherwise, in his ordinary dealings with the people he went about veiled.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Exodus 34:33",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 34:33",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And Moses put a veil on his face — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "This veil signified the darkness of that dispensation; the ceremonial institutions had in them much of Christ and the gospel, but a veil was drawn over it, so that the children of Israel could not distinctly and steadfastly see those good things to come which the law had a shadow of. It was beauty veiled, gold in the mine, a pearl in the shell; but thanks be to God, by the gospel, the veil is taken away from off the Old Testament; yet still it remains upon the hearts of those who shut their eyes against the light.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "34:28-35 Near and spiritual communion with God improves the graces of a renewed and holy character. Serious godliness puts a lustre upon a man's countenance, such as commands esteem and affection. The vail which Moses put on, marked the obscurity of that dispensation, compared with the gospel dispensation of the New Testament. It was also an emblem of the natural vail on the hearts of men respecting spiritual things. Also the vail that was and is upon the nation of Israel, which can only be taken away by the Spirit of the Lord showing to them Christ, as the end of the law for righteousness to every one that believeth. Fear and unbelief would put the vail before us, they would hinder our free approach to the mercy-seat above. We should spread our wants, temporal and spiritual, fully before our heavenly Father; we should tell him our hinderances, struggles, trails, and temptations; we should acknowledge our offences.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Paul refers to this passage as showing forth the glory of the law, though it was but a \"ministration of condemnation,\" and was to be done away, in order to enhance the glory of the gospel, \"the ministration of the spirit,\" which is concealed by no veil from the eyes of believers, and is to last forever ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Corinthians 3:7-15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Exodus 34:33",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 34:33",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "When rather than until should be supplied. Moses did not wear the veil when he was speaking to the people, but when he was silent. See Exodus 34:35.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "When rather than until should be supplied. Moses did not wear the veil when he was speaking to the people, but when he was silent. See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 34:35",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "33. he put a veil on his face—That veil was with the greatest propriety removed when speaking with the Lord, for every one appears unveiled to the eye of Omniscience; but it was replaced on returning to the people—and this was emblematic of the dark and shadowy character of that dispensation (2Co 3:13, 14).   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " In condescension to their weakness ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And till Moses had done speaking with them,.... Not when he had done, as the Septuagint version, for then there would have been no occasion for it; but when he first began to speak to Aaron and the \"rulers\", and continued to speak to the congregation until he had finished what he had to say; even he did what follows, as soon as he perceived there was a glory on his face, which they could not bear to look at: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "he put a vail on his face; something that covered it in a good measure, a mask, or linen cloth, or some such thing. The obscurity of the law may be signified by this vail, both of the moral and ceremonial law; the moral law, which though it makes known the mind and will of God, with respect to what is to be done, or not done, yet not with respect to the affair of life and salvation: it makes known the one God as the object of worship, but gives no account of a trinity of persons in the Godhead; no hint of God in Christ, nor revelation of the Son of God; no view of a Saviour, no notion of pardon; nor does it point out the righteousness of Christ unto us; nor do we from it hear anything of the Spirit of God, and his grace, nor of eternal life and glory: the ceremonial law, and its ordinances, did give some light into evangelical things, and did point out Christ, and the blessings of his grace, yet but darkly and obscurely; they were shadows of good things to come, and gave some dark and distant views of them, but were not so much as the image of the things, and did not bring them near, and set them in a clear light: likewise this vail may be an emblem of the darkness of the minds of men, with respect to the law, and the knowledge of divine things; especially of the Jews, who, as the apostle says, \"could not steadfastly look at the end of that which is abolished\": of the ceremonial law, which is disannulled, the end of which was Christ; he is the end for which it was made, the scope or mark at which it aimed, the term in which it issued, and in whom it had its complete fulfilment; but this they had not a perfect view of, and could not steadfastly behold: the moral law also is in some sense abolished by Christ, as the ministration of Moses, as a covenant of works, and as to the curse and condemnation of it to those that believe; and Christ he is the end of this, the fulfilling end of it, by conformity of nature, and obedience of life unto it, and by suffering the penalty of it; but such was the blindness of the Jews, that they were ignorant of the nature of this law, of the spirituality and perfection of it, of its use to convince men of sin, to condemn for it, but not to justify from it; were ignorant of the righteousness of God which the law required, and of Christ, and of the way of life and righteousness by him; and so of the Spirit of God, and his work, and of the mysteries of the Gospel, and of the books of the Old Testament; see 2 Corinthians 3:14. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "he put a vail on his face; something that covered it in a good measure, a mask, or linen cloth, or some such thing. The obscurity of the law may be signified by this vail, both of the moral and ceremonial law; the moral law, which though it makes known the mind and will of God, with respect to what is to be done, or not done, yet not with respect to the affair of life and salvation: it makes known the one God as the object of worship, but gives no account of a trinity of persons in the Godhead; no hint of God in Christ, nor revelation of the Son of God; no view of a Saviour, no notion of pardon; nor does it point out the righteousness of Christ unto us; nor do we from it hear anything of the Spirit of God, and his grace, nor of eternal life and glory: the ceremonial law, and its ordinances, did give some light into evangelical things, and did point out Christ, and the blessings of his grace, yet but darkly and obscurely; they were shadows of good things to come, and gave some dark and distant views of them, but were not so much as the image of the things, and did not bring them near, and set them in a clear light: likewise this vail may be an emblem of the darkness of the minds of men, with respect to the law, and the knowledge of divine things; especially of the Jews, who, as the apostle says, \"could not steadfastly look at the end of that which is abolished\": of the ceremonial law, which is disannulled, the end of which was Christ; he is the end for which it was made, the scope or mark at which it aimed, the term in which it issued, and in whom it had its complete fulfilment; but this they had not a perfect view of, and could not steadfastly behold: the moral law also is in some sense abolished by Christ, as the ministration of Moses, as a covenant of works, and as to the curse and condemnation of it to those that believe; and Christ he is the end of this, the fulfilling end of it, by conformity of nature, and obedience of life unto it, and by suffering the penalty of it; but such was the blindness of the Jews, that they were ignorant of the nature of this law, of the spirituality and perfection of it, of its use to convince men of sin, to condemn for it, but not to justify from it; were ignorant of the righteousness of God which the law required, and of Christ, and of the way of life and righteousness by him; and so of the Spirit of God, and his work, and of the mysteries of the Gospel, and of the books of the Old Testament; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Corinthians 3:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And till Moses had done speaking with them, he put a vail on his face.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a veil",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The Heb. word (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "masweh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") occurs only here and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "vv.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " 34, 35.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "33–35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The glow alarmed the Israelites: Moses, therefore, put a veil on his face, which he wore ever afterwards, except when he went in to speak with God, or while he was communicating to the people the Divine message which he had received: in ordinary life the reflexion of the Divine glory upon his face was thus hidden from the people.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 33-35.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Till",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Moses had done speaking with them",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Hebrew text will not bear this rendering. All the ancient versions (LXX. Vulg. Syr. etc.) and the Targums agree that the meaning is - \"when Moses had done speaking, he put a veil on his face.\" And this agrees with the plain meaning of vers. 34 and 35, which are to be taken connectedly. Moses first delivered his message with face unveiled, then he veiled himself, and thenceforth he wore a veil at all times except when he sought the Divine presence in the \"tent of meeting\" or the tabernacle, and when he delivered to the people any message sent them from God by him. He wore the veil ordinarily to prevent them from being dazzled. He took it off when he entered the tabernacle, that the Divine presence might shine fully on him and renew his strength. He kept it off when he returned, if he had any message to the people, until he had delivered it, in order the more fully to authenticate the message and shew to the people that it was from God. Then the ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "children of Israel saw",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "the face of Moses, that the skin of Moses' face shone",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (ver. 35). Having discharged himself of the message intrusted to him, he once more covered himself, and continued veiled until he again entered the tabernacle. The only objection that can be taken to this exegesis is derived from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Corinthians 3:7-16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which has been thought to imply that Moses wore the veil whenever he was in the sight of the people.  But the passage does not really assert any such thing. It is quite enough for the argument, that under the old covenant a veil had been worn to conceal some of its glory. This concealment St. Paul contrasts with the openness of Christianity (vers. 13, 18); while at the same time he argues that it may be viewed as typical of that blindness and darkness which was characteristic of the Jewish nation of his day. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Exodus 34:33",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The sight of the glory of Jehovah, though only of the back or reflection of it, produced such an effect upon Moses' face, that the skin of it shone, though without Moses observing it. When he came down from the mountain with the tables of the law in his hand, and the skin of his face shone אתּו בּדבּרו, i.e., on account of his talking with God, Aaron and the people were afraid to go near him when they saw the brightness of his face. But Moses called them to him, - Viz. first of all Aaron and the princes of the congregation to speak to them, and then all the people to give them the commandments of Jehovah; but on doing this (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 34:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), he put a veil upon (before) his face, and only took it away when he went in before Jehovah to speak with Him, and then, when he came out (from the Lord out of the tabernacle, of course after the erection of the tabernacle), he made known His commands to the people. But while doing this, he put the veil upon his face again, and always wore it in his ordinary intercourse with the people (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 34:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 34:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). This reflection of the splendour thrown back by the glory of God was henceforth to serve as the most striking proof of the confidential relation in which Moses stood to Jehovah, and to set forth the glory of the office which Moses filled. The Apostle Paul embraces this view in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Corinthians 3:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., and lays stress upon the fact that the glory was to be done away, which he was quite justified in doing, although nothing is said in the Old Testament about the glory being transient, from the simple fact that Moses died. The apostle refers to it for the purpose of contrasting the perishable glory of the law with the far higher and imperishable glory of the Gospel. At the same time he regards the veil which covered Moses' face as a symbol of the obscuring of the truth revealed in the Old Testament. But this does not exhaust the significance of this splendour. The office could only confer such glory upon the possessor by virtue of the glory of the blessings which it contained, and conveyed to those for whom it was established. Consequently, the brilliant light on Moses' face also set forth the glory of the Old Covenant, and was intended both for Moses and the people as a foresight and pledge of the glory to which Jehovah had called, and would eventually exalt, the people of His possession. ",
        "children": []
      }
    ]
  }
]