[{"header":"The Resurrection of Jesus"},{"num":20,"verse":"Early on the first day of the week, while it was still dark, Mary Magdalene came to the tomb and saw that the stone had been removed from the tomb. "},{"num":2,"verse":"So she ran and went to Simon Peter and the other disciple, the one whom Jesus loved, and said to them, ‘They have taken the Lord out of the tomb, and we do not know where they have laid him.’ "},{"num":3,"verse":"Then Peter and the other disciple set out and went towards the tomb. "},{"num":4,"verse":"The two were running together, but the other disciple outran Peter and reached the tomb first. "},{"num":5,"verse":"He bent down to look in and saw the linen wrappings lying there, but he did not go in. "},{"num":6,"verse":"Then Simon Peter came, following him, and went into the tomb. He saw the linen wrappings lying there, "},{"num":7,"verse":"and the cloth that had been on Jesus’ head, not lying with the linen wrappings but rolled up in a place by itself. "},{"num":8,"verse":"Then the other disciple, who reached the tomb first, also went in, and he saw and believed; "},{"num":9,"verse":"for as yet they did not understand the scripture, that he must rise from the dead. "},{"num":10,"verse":"Then the disciples returned to their homes."},{"header":"Jesus Appears to Mary Magdalene"},{"num":11,"verse":"But Mary stood weeping outside the tomb. As she wept, she bent over to look into the tomb; "},{"num":12,"verse":"and she saw two angels in white, sitting where the body of Jesus had been lying, one at the head and the other at the feet. "},{"num":13,"verse":"They said to her, ‘Woman, why are you weeping?’ She said to them, ‘They have taken away my Lord, and I do not know where they have laid him.’ "},{"num":14,"verse":"When she had said this, she turned round and saw Jesus standing there, but she did not know that it was Jesus. "},{"num":15,"verse":"Jesus said to her, ‘Woman, why are you weeping? For whom are you looking?’ Supposing him to be the gardener, she said to him, ‘Sir, if you have carried him away, tell me where you have laid him, and I will take him away.’ "},{"num":16,"verse":"Jesus said to her, ‘Mary!’ She turned and said to him in Hebrew, ‘Rabbouni!’ (which means Teacher). "},{"num":17,"verse":"Jesus said to her, ‘Do not hold on to me, because I have not yet ascended to the Father. But go to my brothers and say to them, “I am ascending to my Father and your Father, to my God and your God.”’ "},{"num":18,"verse":"Mary Magdalene went and announced to the disciples, ‘I have seen the Lord’; and she told them that he had said these things to her."},{"header":"Jesus Appears to the Disciples"},{"num":19,"verse":"When it was evening on that day, the first day of the week, and the doors of the house where the disciples had met were locked for fear of the Jews, Jesus came and stood among them and said, ‘Peace be with you.’ "},{"num":20,"verse":"After he said this, he showed them his hands and his side. Then the disciples rejoiced when they saw the Lord. "},{"num":21,"verse":"Jesus said to them again, ‘Peace be with you. As the Father has sent me, so I send you.’ "},{"num":22,"verse":"When he had said this, he breathed on them and said to them, ‘Receive the Holy Spirit. "},{"num":23,"verse":"If you forgive the sins of any, they are forgiven them; if you retain the sins of any, they are retained.’"},{"header":"Jesus and Thomas"},{"num":24,"verse":"But Thomas (who was called the Twin), one of the twelve, was not with them when Jesus came. "},{"num":25,"verse":"So the other disciples told him, ‘We have seen the Lord.’ But he said to them, ‘Unless I see the mark of the nails in his hands, and put my finger in the mark of the nails and my hand in his side, I will not believe.’"},{"num":26,"verse":"A week later his disciples were again in the house, and Thomas was with them. Although the doors were shut, Jesus came and stood among them and said, ‘Peace be with you.’ "},{"num":27,"verse":"Then he said to Thomas, ‘Put your finger here and see my hands. Reach out your hand and put it in my side. Do not doubt but believe.’ "},{"num":28,"verse":"Thomas answered him, ‘My Lord and my God!’ "},{"num":29,"verse":"Jesus said to him, ‘Have you believed because you have seen me? Blessed are those who have not seen and yet have come to believe.’"},{"header":"The Purpose of This Book"},{"num":30,"verse":"Now Jesus did many other signs in the presence of his disciples, which are not written in this book. "},{"num":31,"verse":"But these are written so that you may come to believe that Jesus is the Messiah, the Son of God, and that through believing you may have life in his name."}]