[{"num":4,"verse":"He made an altar of bronze thirty-five feet long, thirty-five feet wide and seventeen-and-a-half feet high."},{"num":2,"verse":"He made the cast metal “Sea” circular, seventeen-and-a-half feet from rim to rim, eight-and-three quarters feet high and fifty-two-and-a-half feet in circumference. "},{"num":3,"verse":"Below the rim a ring of ox-like figures encircled it, ten for every twenty-one inches all the way around the Sea. The oxen were in two rows; they were cast when the Sea was cast. "},{"num":4,"verse":"It rested on twelve oxen, three looking north, three looking west, three looking south and three looking east, all with their hindquarters toward the center. The Sea was set on top of them. "},{"num":5,"verse":"It was a handbreadth thick, its rim was made like the rim of a cup, like the flower of a lily; and its capacity was 16,500 gallons. "},{"num":6,"verse":"He also made ten basins for washing and put five on the right and five on the left. Items needed for the burnt offerings would be cleansed in these, but the Sea was for the cohanim to wash in."},{"num":7,"verse":"He made the ten menorahs of gold in accordance with their specifications and set them in the temple, five on the right and five on the left. "},{"num":8,"verse":"He also made ten tables and put them in the temple, five on the right and five on the left. And he made a hundred basins of gold."},{"num":9,"verse":"He made the courtyard for the cohanim and the great courtyard, also the doors to the courtyard, which he overlaid with bronze."},{"num":10,"verse":"The Sea he placed on the right side [of the house], toward the southeast."},{"num":11,"verse":"Huram made the ash pots, shovels and sprinkling basins. With that, Huram completed the work he had been doing for King Shlomo in the house of God — "},{"num":12,"verse":"the two columns, the two moldings, the two capitals on top of the columns, the two nettings covering the two moldings of the capitals atop the columns, "},{"num":13,"verse":"and the 400 pomegranates for the two nettings, two rows of pomegranates for each netting, to cover the two moldings of the capitals atop the columns. "},{"num":14,"verse":"He also made the trolleys, the basins on the trolleys, "},{"num":15,"verse":"the one Sea, the twelve oxen under it, "},{"num":16,"verse":"the ash pots, the shovels, the forks and all the other equipment for it. All these articles that Huram the master craftsman made for King Shlomo in the house of Adonai were of brilliant bronze. "},{"num":17,"verse":"The king cast them in the plain of the Yarden, in the clay ground between Sukkot and Tz’redah. "},{"num":18,"verse":"Shlomo made so many of these objects that the total weight of the bronze could not be determined."},{"num":19,"verse":"Shlomo made all the objects that were inside the house of God: the gold altar; the table on which the showbread was displayed; "},{"num":20,"verse":"the menorahs with their lamps to burn in front of the sanctuary as specified, of pure gold; "},{"num":21,"verse":"the flowers, lamps and tongs of gold, solid gold; "},{"num":22,"verse":"and the snuffers, bowls, cups and fire pans of pure gold. As for the entryway to the house, the inner doors for the Especially Holy Place and the doors of the house (that is, of the temple) were of gold."}]