[{"header":"Equipment for the Temple(A)"},{"num":4,"verse":"King Solomon had a bronze altar made, which was 30 feet square and 15 feet high. "},{"num":2,"verse":"He also made a round tank of bronze, 7½ feet deep, 15 feet in diameter, and 45 feet in circumference. "},{"num":3,"verse":"All around the outer edge of the rim of the tank were two rows of decorations, one above the other. The decorations were in the shape of bulls, which had been cast all in one piece with the rest of the tank. "},{"num":4,"verse":"The tank rested on the backs of twelve bronze bulls that faced outward, three facing in each direction. "},{"num":5,"verse":"The sides of the tank were 3 inches thick. Its rim was like the rim of a cup, curving outward like the petals of a flower. The tank held about 15,000 gallons. "},{"num":6,"verse":"They also made ten basins, five to be placed on the south side of the Temple and five on the north side. They were to be used to rinse the parts of the animals that were burned as sacrifices. The water in the large tank was for the priests to use for washing."},{"num":7,"verse":"They made ten gold lampstands according to the usual pattern, and ten tables, and placed them in the main room of the Temple, five lampstands and five tables on each side. They also made a hundred gold bowls."},{"num":9,"verse":"They made an inner courtyard for the priests, and also an outer courtyard. The doors in the gates between the courtyards were covered with bronze. "},{"num":10,"verse":"The tank was placed near the southeast corner of the Temple."},{"num":11,"verse":"Huram also made pots, shovels, and bowls. He completed all the objects that he had promised King Solomon he would make for the Temple:"},{"num":17,"verse":"The king had them all made in the foundry between Sukkoth and Zeredah in the Jordan Valley. "},{"num":18,"verse":"So many objects were made that no one determined the total weight of the bronze used."},{"num":19,"verse":"King Solomon also had gold furnishings made for the Temple: the altar and the tables for the bread offered to God; "},{"num":20,"verse":"the lampstands and the lamps of fine gold that were to burn in front of the Most Holy Place, according to plan; "},{"num":21,"verse":"the flower decorations, the lamps, and the tongs; "},{"num":22,"verse":"the lamp snuffers, the bowls, the dishes for incense, and the pans used for carrying live coals. All these objects were made of pure gold. The outer doors of the Temple and the doors to the Most Holy Place were overlaid with gold."}]