[{"header":"The Creation of the World"},{"num":1,"verse":"In the beginning, God created the heavens and the earth. "},{"num":2,"verse":"The earth was undeveloped and empty. Darkness covered the surface of the deep, and the Spirit of God was hovering over the surface of the waters."},{"num":3,"verse":"God said, “Let there be light,” and there was light. "},{"num":4,"verse":"God saw that the light was good. He separated the light from the darkness. "},{"num":5,"verse":"God called the light “day,” and the darkness he called “night.” There was evening and there was morning—the first day."},{"num":6,"verse":"God said, “Let there be an expanse between the waters, and let it separate the water from the water.” "},{"num":7,"verse":"God made the expanse, and he separated the water that was below the expanse from the water that was above the expanse, and it was so. "},{"num":8,"verse":"God called the expanse “sky.” There was evening and there was morning—the second day."},{"num":9,"verse":"God said, “Let the waters under the sky be gathered together to one place, and let the dry land appear,” and it was so. ⎣The waters under the sky gathered to their own places, and the dry land appeared.⎦ "},{"num":10,"verse":"God called the dry ground “land,” and the gathering places of the waters he called “seas.” God saw that it was good. "},{"num":11,"verse":"God said, “Let the earth produce plants—vegetation that produces seed, and trees that bear fruit with its seed in it—each according to its own kind on the earth,” and it was so. "},{"num":12,"verse":"The earth brought forth plants, vegetation that produces seed according to its own kind, and trees that bear fruit with its seed in it, each according to its own kind, and God saw that it was good. "},{"num":13,"verse":"There was evening and there was morning—the third day."},{"num":14,"verse":"God said, “Let there be lights in the expanse of the sky to divide the day from the night, and let them serve as markers to indicate seasons, days, and years. "},{"num":15,"verse":"Let them serve as lights in the expanse of the sky to give light to the earth,” and it was so. "},{"num":16,"verse":"God made the two great lights: the greater light to rule the day, and the lesser light to rule the night. He also made the stars. "},{"num":17,"verse":"God set these lights in place in the expanse of the sky to provide light for the earth, "},{"num":18,"verse":"to rule over the day and over the night, and to divide the light from the darkness. God saw that it was good. "},{"num":19,"verse":"There was evening and there was morning—the fourth day."},{"num":20,"verse":"God said, “Let the waters swarm with living creatures, and let birds and other winged creatures fly above the earth in the open expanse of the sky.” "},{"num":21,"verse":"God created the large sea creatures and every living creature that moves, with which the waters swarm, according to their own kind, and every winged bird according to its own kind. God saw that it was good. "},{"num":22,"verse":"God blessed them when he said, “Be fruitful and multiply. Fill the waters of the seas, and let birds multiply on the earth.” "},{"num":23,"verse":"There was evening and there was morning—the fifth day."},{"num":24,"verse":"God said, “Let the earth produce living creatures according to their own kind, livestock, creeping things, and wild animals according to their own kind,” and it was so. "},{"num":25,"verse":"God made the wild animals according to their own kind, and the livestock according to their own kind, and everything that creeps on the ground according to its own kind. God saw that it was good."},{"num":26,"verse":"God said, “Let us make man in our image, according to our likeness, and let them have dominion over the fish of the sea, and over the birds of the sky, and over the livestock, and over all the earth, and over every creeping thing that crawls on the earth.”"},{"num":28,"verse":"God blessed them and said to them, “Be fruitful, multiply, fill the earth, and subdue it. Have dominion over the fish of the sea, over the birds of the sky, and over every living thing that moves on the earth.” "},{"num":29,"verse":"God said, “Look, I have given you every plant that produces seed on the face of the whole earth, and every tree that bears fruit that produces seed. It will be your food. "},{"num":30,"verse":"To every animal of the earth, and to every bird of the sky, and to everything that creeps on the earth, in which there is the breath of life, I have given every green plant for food.” And it was so."},{"num":31,"verse":"God saw everything that he had made, and indeed, it was very good. There was evening and there was morning—the sixth day."}]