[[],[{"type":"header","content":"The History of Creation(A)"},{"type":"prose","content":"In the beginning God created the heavens and the earth. "}],[{"type":"prose","content":"The earth was without form, and void; and darkness  on the face of the deep. And the Spirit of God was hovering over the face of the waters."}],[{"type":"prose","content":"Then God said, “Let there be light”; and there was light. "}],[{"type":"prose","content":"And God saw the light, that  good; and God divided the light from the darkness. "}],[{"type":"prose","content":"God called the light Day, and the darkness He called Night. So the evening and the morning were the first day."}],[{"type":"prose","content":"Then God said, “Let there be a firmament in the midst of the waters, and let it divide the waters from the waters.” "}],[{"type":"prose","content":"Thus God made the firmament, and divided the waters which  under the firmament from the waters which  above the firmament; and it was so. "}],[{"type":"prose","content":"And God called the firmament Heaven. So the evening and the morning were the second day."}],[{"type":"prose","content":"Then God said, “Let the waters under the heavens be gathered together into one place, and let the dry  appear”; and it was so. "}],[{"type":"prose","content":"And God called the dry  Earth, and the gathering together of the waters He called Seas. And God saw that  good."}],[{"type":"prose","content":"Then God said, “Let the earth bring forth grass, the herb  yields seed,  the fruit tree  yields fruit according to its kind, whose seed  in itself, on the earth”; and it was so. "}],[{"type":"prose","content":"And the earth brought forth grass, the herb  yields seed according to its kind, and the tree  yields fruit, whose seed  in itself according to its kind. And God saw that  good. "}],[{"type":"prose","content":"So the evening and the morning were the third day."}],[{"type":"prose","content":"Then God said, “Let there be lights in the firmament of the heavens to divide the day from the night; and let them be for signs and seasons, and for days and years; "}],[{"type":"prose","content":"and let them be for lights in the firmament of the heavens to give light on the earth”; and it was so. "}],[{"type":"prose","content":"Then God made two great lights: the greater light to rule the day, and the lesser light to rule the night.  the stars also. "}],[{"type":"prose","content":"God set them in the firmament of the heavens to give light on the earth, "}],[{"type":"prose","content":"and to rule over the day and over the night, and to divide the light from the darkness. And God saw that  good. "}],[{"type":"prose","content":"So the evening and the morning were the fourth day."}],[{"type":"prose","content":"Then God said, “Let the waters abound with an abundance of living creatures, and let birds fly above the earth across the face of the firmament of the heavens.” "}],[{"type":"prose","content":"So God created great sea creatures and every living thing that moves, with which the waters abounded, according to their kind, and every winged bird according to its kind. And God saw that  good. "}],[{"type":"prose","content":"And God blessed them, saying, “Be fruitful and multiply, and fill the waters in the seas, and let birds multiply on the earth.” "}],[{"type":"prose","content":"So the evening and the morning were the fifth day."}],[{"type":"prose","content":"Then God said, “Let the earth bring forth the living creature according to its kind: cattle and creeping thing and beast of the earth,  according to its kind”; and it was so. "}],[{"type":"prose","content":"And God made the beast of the earth according to its kind, cattle according to its kind, and everything that creeps on the earth according to its kind. And God saw that  good."}],[{"type":"prose","content":"Then God said, “Let Us make man in Our image, according to Our likeness; let them have dominion over the fish of the sea, over the birds of the air, and over the cattle, over all the earth and over every creeping thing that creeps on the earth.” "}],[{"type":"prose","content":"So God created man in His  image; in the image of God He created him; male and female He created them. "}],[{"type":"prose","content":"Then God blessed them, and God said to them, “Be fruitful and multiply; fill the earth and subdue it; have dominion over the fish of the sea, over the birds of the air, and over every living thing that moves on the earth.”"}],[{"type":"prose","content":"And God said, “See, I have given you every herb  yields seed which  on the face of all the earth, and every tree whose fruit yields seed; to you it shall be for food. "}],[{"type":"prose","content":"Also, to every beast of the earth, to every bird of the air, and to everything that creeps on the earth, in which  life,  every green herb for food”; and it was so. "}],[{"type":"prose","content":"Then God saw everything that He had made, and indeed  very good. So the evening and the morning were the sixth day."}]]