[{"header":"The Beginning"},{"num":1,"verse":"In the beginning God made from nothing the heavens and the earth. "},{"num":2,"verse":"The earth was an empty waste and darkness was over the deep waters. And the Spirit of God was moving over the top of the waters. "},{"num":3,"verse":"Then God said, “Let there be light,” and there was light. "},{"num":4,"verse":"God saw that the light was good. He divided the light from the darkness. "},{"num":5,"verse":"Then God called the light day, and He called the darkness night. There was evening and there was morning, one day."},{"num":6,"verse":"Then God said, “Let there be an open space between the waters. Let it divide waters from waters.” "},{"num":7,"verse":"God made the open space, and divided the waters under the open space from the waters above the open space. And it was so. "},{"num":8,"verse":"Then God called the open space Heaven. There was evening and there was morning, the second day."},{"num":9,"verse":"Then God said, “Let the waters under the heavens be gathered into one place. Let the dry land be seen.” And it was so. "},{"num":10,"verse":"Then God called the dry land Earth. He called the gathering of the waters Seas. And God saw that it was good. "},{"num":11,"verse":"Then God said, “Let plants grow from the earth, plants that have seeds. Let fruit trees grow on the earth that bring their kind of fruit with their own seeds.” And it was so. "},{"num":12,"verse":"Plants grew out of the earth, giving their own kind of seeds. Trees grew with their fruit, and their kind of seeds. And God saw that it was good. "},{"num":13,"verse":"There was evening and there was morning, the third day."},{"num":14,"verse":"Then God said, “Let there be lights in the open space of the heavens to divide day from night. Let them tell the days and years and times of the year. "},{"num":15,"verse":"Let them be lights in the open space of the heavens to give light on the earth.” And it was so. "},{"num":16,"verse":"Then God made the two great lights, the brighter light to rule the day, and the smaller light to rule the night. He made the stars also. "},{"num":17,"verse":"God put them in the open space of the heavens to give light on the earth, "},{"num":18,"verse":"to rule the day and the night. He divided the light from the darkness. And God saw that it was good. "},{"num":19,"verse":"There was evening and there was morning, the fourth day."},{"num":20,"verse":"Then God said, “Let the waters be full of living things. Let birds fly above the earth in the open space of the heavens.” "},{"num":21,"verse":"God made the big animals that live in the sea, and every living thing that moves through the waters by its kind, and every winged bird after its kind. And God saw that it was good. "},{"num":22,"verse":"God wanted good to come to them, saying, “Give birth to many. Grow in number. Fill the waters in the seas. Let birds grow in number on the earth.” "},{"num":23,"verse":"There was evening and there was morning, the fifth day."},{"num":24,"verse":"Then God said, “Let the earth bring into being living things after their kind: Cattle and things that move upon the ground, and wild animals of the earth after their kind.” And it was so. "},{"num":25,"verse":"Then God made the wild animals of the earth after their kind, and the cattle after their kind, and every thing that moves upon the ground after its kind. And God saw that it was good."},{"num":26,"verse":"Then God said, “Let Us make man like Us and let him be head over the fish of the sea, and over the birds of the air, and over the cattle, and over all the earth, and over every thing that moves on the ground.” "},{"num":27,"verse":"And God made man in His own likeness. In the likeness of God He made him. He made both male and female. "},{"num":28,"verse":"And God wanted good to come to them, saying, “Give birth to many. Grow in number. Fill the earth and rule over it. Rule over the fish of the sea, over the birds of the sky, and over every living thing that moves on the earth.” "},{"num":29,"verse":"Then God said, “See, I have given you every plant that gives seeds that is on the earth, and every tree that has fruit that gives seeds. They will be food for you. "},{"num":30,"verse":"I have given every green plant for food to every animal of the earth, and to every bird of the sky, and to every thing that moves on the earth that has life.” And it was so. "},{"num":31,"verse":"God saw all that He had made and it was very good. There was evening and there was morning, the sixth day."}]