[{"header":"Six Days of Creation and the Sabbath"},{"num":1,"verse":"In the beginning God created the heavens and the earth. "},{"num":2,"verse":"The earth was without form and void, and darkness was upon the face of the deep; and the Spirit of God was moving over the face of the waters."},{"num":3,"verse":"And God said, “Let there be light”; and there was light. "},{"num":4,"verse":"And God saw that the light was good; and God separated the light from the darkness. "},{"num":5,"verse":"God called the light Day, and the darkness he called Night. And there was evening and there was morning, one day."},{"num":6,"verse":"And God said, “Let there be a firmament in the midst of the waters, and let it separate the waters from the waters.” "},{"num":7,"verse":"And God made the firmament and separated the waters which were under the firmament from the waters which were above the firmament. And it was so. "},{"num":8,"verse":"And God called the firmament Heaven. And there was evening and there was morning, a second day."},{"num":9,"verse":"And God said, “Let the waters under the heavens be gathered together into one place, and let the dry land appear.” And it was so. "},{"num":10,"verse":"God called the dry land Earth, and the waters that were gathered together he called Seas. And God saw that it was good. "},{"num":11,"verse":"And God said, “Let the earth put forth vegetation, plants yielding seed, and fruit trees bearing fruit in which is their seed, each according to its kind, upon the earth.” And it was so. "},{"num":12,"verse":"The earth brought forth vegetation, plants yielding seed according to their own kinds, and trees bearing fruit in which is their seed, each according to its kind. And God saw that it was good. "},{"num":13,"verse":"And there was evening and there was morning, a third day."},{"num":14,"verse":"And God said, “Let there be lights in the firmament of the heavens to separate the day from the night; and let them be for signs and for seasons and for days and years, "},{"num":15,"verse":"and let them be lights in the firmament of the heavens to give light upon the earth.” And it was so. "},{"num":16,"verse":"And God made the two great lights, the greater light to rule the day, and the lesser light to rule the night; he made the stars also. "},{"num":17,"verse":"And God set them in the firmament of the heavens to give light upon the earth, "},{"num":18,"verse":"to rule over the day and over the night, and to separate the light from the darkness. And God saw that it was good. "},{"num":19,"verse":"And there was evening and there was morning, a fourth day."},{"num":20,"verse":"And God said, “Let the waters bring forth swarms of living creatures, and let birds fly above the earth across the firmament of the heavens.” "},{"num":21,"verse":"So God created the great sea monsters and every living creature that moves, with which the waters swarm, according to their kinds, and every winged bird according to its kind. And God saw that it was good. "},{"num":22,"verse":"And God blessed them, saying, “Be fruitful and multiply and fill the waters in the seas, and let birds multiply on the earth.” "},{"num":23,"verse":"And there was evening and there was morning, a fifth day."},{"num":24,"verse":"And God said, “Let the earth bring forth living creatures according to their kinds: cattle and creeping things and beasts of the earth according to their kinds.” And it was so. "},{"num":25,"verse":"And God made the beasts of the earth according to their kinds and the cattle according to their kinds, and everything that creeps upon the ground according to its kind. And God saw that it was good."},{"num":26,"verse":"Then God said, “Let us make man in our image, after our likeness; and let them have dominion over the fish of the sea, and over the birds of the air, and over the cattle, and over all the earth, and over every creeping thing that creeps upon the earth.” "},{"num":27,"verse":"So God created man in his own image, in the image of God he created him; male and female he created them. "},{"num":28,"verse":"And God blessed them, and God said to them, “Be fruitful and multiply, and fill the earth and subdue it; and have dominion over the fish of the sea and over the birds of the air and over every living thing that moves upon the earth.” "},{"num":29,"verse":"And God said, “Behold, I have given you every plant yielding seed which is upon the face of all the earth, and every tree with seed in its fruit; you shall have them for food. "},{"num":30,"verse":"And to every beast of the earth, and to every bird of the air, and to everything that creeps on the earth, everything that has the breath of life, I have given every green plant for food.” And it was so. "},{"num":31,"verse":"And God saw everything that he had made, and behold, it was very good. And there was evening and there was morning, a sixth day."}]