[{"num":28,"verse":"To David. [The psalm to this David.] Lord, I shall cry to thee; my God, be thou not still from me, be thou not still any time from me; and I shall be made like to them, that go down into the pit. (The song of David. Lord, I shall cry to thee. My God, be thou not deaf to me, and never be thou silent with me; or I shall be made like those who go down into the pit.)"},{"num":2,"verse":"Lord, hear thou the voice of my beseeching, while I pray to thee; while I raise mine hands to(ward) thine holy temple. (Lord, hear thou the words of my plea, when I pray to thee; when I raise up my hands toward thy holy Temple.)"},{"num":3,"verse":"Betake thou not me together with sinners; and lose thou not me with them that work wickedness. Which speak peace to their neighbour(s); but evils be in their hearts. (Take thou me not away with the sinners; and destroy thou me not with those who do evil. Yea, those who speak peacefully to their neighbours; but evil is in their hearts.)"},{"num":4,"verse":"Give thou to them after the works of them; and after the wickedness of their findings. Give thou to them after the works of their hands; yield thou their yielding to them. (Punish thou them according to their works; yea, according to the wickedness of their deeds. Punish thou them according to the works of their hands; give thou them their just reward.)"},{"num":5,"verse":"For they understood not the works of the Lord, and by the works of his hands thou shalt destroy them; and thou shalt not build them. (Because they do not respect the works of the Lord, or the works of his hands, he shall destroy them; and he shall not build them up again.)"},{"num":6,"verse":"Blessed be the Lord; for he heard the voice of my beseeching (for he heard the words of my plea)."},{"num":7,"verse":"The Lord is mine helper and my defender; and mine heart hoped in him, and I am helped. And my flesh flowered again; and (out) of my will I shall acknowledge to him. (The Lord is my helper and my defender; and my heart trusted him, and I was helped. And my heart full out joyed, or rejoiced; and I shall praise him with my song.)"},{"num":8,"verse":"The Lord is the strength of his people; and he is the defender of the savings of his christ (The Lord is the strength of his people; and he is the defender and the saviour of his anointed king/and he is the defender and the safe place, or the refuge, for his anointed king.)"},{"num":9,"verse":"Lord, make thou safe thy people, and bless thou thine heritage; and rule thou them, and enhance thou them till into without end. (Lord, save thou thy people, and bless thou thy inheritance; and rule thou over them, and lift thou them up, yea, take good care of them, forever.)"}]