[{"num":7,"verse":"¶ When I was healing Israel, the iniquity of Ephraim was uncovered, and the wickedness of Samaria; for they worked deceit; and the thief comes in, and the troop of robbers spoils without."},{"num":2,"verse":"And they do not consider in their hearts that I remember all their wickedness; now their own doings have beset them about; they are before my face."},{"num":3,"verse":"They make the king glad with their wickedness and the princes with their lies."},{"num":4,"verse":"They are all adulterers as an oven heated by the baker who shall cease from waking after he has kneaded the dough until it is leavened."},{"num":5,"verse":"In the day of our king the princes have made him sick with a wineskin; he stretched out his hand with the scorners."},{"num":6,"verse":"For they have made ready their heart like an oven while they lie in wait; their baker sleeps all night; in the morning it burns as a flaming fire."},{"num":7,"verse":"They are all hot as an oven and have devoured their judges; all their kings are fallen; there is no one among them that calls unto me."},{"num":8,"verse":"¶ Ephraim, he has mixed himself among the peoples; Ephraim is a cake not turned."},{"num":9,"verse":"Strangers have devoured his strength, and he does not know it; yea, gray hairs are here and there upon him, yet he does not understand."},{"num":10,"verse":"And the pride of Israel shall testify to his face, and they have not returned to the LORD their God, nor have they sought him with all this."},{"num":11,"verse":"Ephraim also was like a deceived dove, without understanding; they shall call to Egypt, they shall go to Assyria."},{"num":12,"verse":"When they shall go, I will spread my net upon them; I will bring them down as the fowls of the heaven; I will chastise them according to what has been heard in their congregations."},{"num":13,"verse":"Woe unto them! for they have fled from me: destruction upon them! because they have rebelled against me; though I have ransomed them, yet they have spoken lies against me."},{"num":14,"verse":"And they have not cried unto me with their heart when they howled upon their beds; they congregated themselves for the wheat and the wine, and they rebelled against me."},{"num":15,"verse":"Though I have bound and strengthened their arms, yet they imagine evil against me."},{"num":16,"verse":"They returned, but not to the most High; they were like a deceitful bow; their princes fell by the sword for the arrogance of their tongue; this shall be their derision in the land of Egypt."}]