[{"num":23,"verse":"Then kai the ho whole hapas assembly plēthos of  them autos rose anistēmi up  and  brought agō Jesus autos before epi · ho Pilate Pilatos. "},{"num":2,"verse":"And de they  began archō to  accuse katēgoreō him autos,  saying legō, “ We  found heuriskō this houtos man  trying  to  mislead diastrephō · ho our hēmeis nation ethnos,  · kai opposing kōlyō the  payment didōmi of  taxes phoros to  Caesar Kaisar,  and kai claiming legō himself heautou to  be eimi Christ Christos, a  king basileus.” "},{"num":3,"verse":"· ho So de Pilate Pilatos asked erōtaō Jesus autos,  saying legō, “ Are eimi you sy the ho king basileus of  the ho Jews Ioudaios?”  In  response apokrinomai Jesus ho · de said phēmi to  him autos, “ You sy say legō so.” "},{"num":4,"verse":"· ho Then de Pilate Pilatos said legō to pros the ho chief archiereus priests  and kai the ho crowds ochlos, “ I  find heuriskō no oudeis basis  for a  charge aitios against en · ho this houtos man anthrōpos.” "},{"num":5,"verse":"But de they ho kept  insisting epischuō,  saying legō, “ He  stirs anaseiō up  the ho people laos,  teaching didaskō throughout kata all holos · ho Judea Ioudaia,  · kai starting archō from apo · ho Galilee Galilaia even heōs to  this hōde place .” "},{"num":6,"verse":"Now de when  Pilate Pilatos heard akouō this,  he  asked eperōtaō whether ei the ho man anthrōpos was eimi a  Galilean Galilaios. "},{"num":7,"verse":"· kai Learning epiginōskō that hoti he  was eimi from ek · ho Herod’ s hērōdēs jurisdiction exousia,  he  sent anapempō him autos off  to pros Herod hērōdēs,  who autos was eimi also kai in en Jerusalem Hierosolyma during en those houtos · ho days hēmera. "},{"num":8,"verse":"Upon seeing  Jesus Iēsous,  · ho · de Herod hērōdēs · ho was  very lian glad chairō,  since gar for ek a  long hikanos time chronos he  had  been eimi wanting thelō to see  him autos,  because dia of  what ho he  had  heard akouō about peri him autos,  and kai he  was  hoping elpizō to see  some tis miraculous  sign sēmeion done ginomai by hypo him autos. "},{"num":9,"verse":"So de Herod  questioned eperōtaō him autos with en many hikanos words logos;  but de Jesus autos gave  him autos no oudeis answer apokrinomai, "},{"num":10,"verse":"even though  the ho chief  priests archiereus and kai the ho scribes grammateus stood histēmi by ,  · de vehemently eutonōs accusing katēgoreō him autos. "},{"num":11,"verse":"Then de, when  Herod hērōdēs,  along  with syn his autos soldiers strateuma, had  treated exoutheneō him autos with  contempt  · kai · ho · ho and kai ridiculed empaizō him,  they  put periballō an  elegant lampros robe esthēs on  him, and  sent anapempō him autos back  to ho Pilate Pilatos. "},{"num":12,"verse":"And de Herod hērōdēs and kai Pilate Pilatos became ginomai friends philos · ho · ho with meta each  other allēlōn that en very autos · ho day hēmera,  for gar before prouparchō this  they  had  been eimi hostile en echthra toward pros each autos other . "},{"num":13,"verse":"Pilate Pilatos then de called synkaleō together  the ho chief archiereus priests ,  · kai the ho rulers archōn,  and kai the ho people laos, "},{"num":14,"verse":"and  said legō to pros them autos, “ You  brought prospherō me egō · ho this houtos man anthrōpos as hōs one  who  was  trying apostrephō to  mislead  the ho people laos.  And kai indeed idou,  having  examined anakrinō him  in enōpion your hymeis presence enōpion,  I egō found heuriskō no outheis basis aitios for hos your  charges katēgoreō against en · ho this houtos man anthrōpos. "},{"num":15,"verse":"For  that  matter alla,  neither oude did  Herod hērōdēs,  for gar he  sent anapempō him autos back  to pros us hēmeis.  · kai Look idou,  nothing oudeis deserving axios death thanatos has  been eimi done prassō by  him autos. "},{"num":16,"verse":"So oun I  will  have  him autos flogged paideuō and  release apolyō him.” "},{"num":18,"verse":"But de they  cried anakrazō out  together pamplēthei,  saying legō, “ Take airō this houtos man  away!  Release apolyō · de for  us hēmeis · ho Barabbas Barabbas!” "},{"num":19,"verse":"who hostis was eimi thrown ballō into en prison phylakē because dia of  a  certain tis riot stasis that  had  occurred ginomai in en the ho city polis and kai for  murder phonos.  · ho"},{"num":20,"verse":"Once  again palin · de · ho Pilate Pilatos,  wanting thelō to  release apolyō Jesus Iēsous,  called prosphōneō out  to  them autos,  · ho"},{"num":21,"verse":"but de they ho kept  shouting epiphōneō,  saying legō, “ Crucify stauroō,  crucify stauroō him autos!” "},{"num":22,"verse":"A  third  time triton he ho · de spoke legō to pros them autos, “ What tis evil kakos did poieō this houtos man  do?  I  have  found heuriskō in en him autos no oudeis guilt aitios deserving  death thanatos.  I  will  therefore oun punish paideuō and  release apolyō him autos.” "},{"num":23,"verse":"But de they ho were  insistent epikeimai,  demanding aiteō with  loud megas cries phōnē that  he autos should  be  crucified stauroō,  and kai their autos cries phōnē prevailed katischuō.  · ho"},{"num":24,"verse":"So kai Pilate Pilatos decided epikrinō that  their autos demand aitēma should  be  granted ginomai.  · ho"},{"num":25,"verse":"He  released apolyō · de the ho man  who  had  been  thrown ballō into eis prison phylakē for dia insurrection stasis and kai murder phonos,  for  whom hos they  asked aiteō,  but de he  handed  over paradidōmi · ho Jesus Iēsous to ho their autos will thelēma. "},{"num":26,"verse":"· kai As hōs they  led apagō him autos away , they  took epilambanomai hold  of  a  certain tis Simon Simōn of  Cyrene Kyrēnaios,  who  was  coming erchomai in  from apo the  countryside agros, and  put epitithēmi the ho cross stauros on  him autos to  carry pherō it  behind opisthen · ho Jesus Iēsous. "},{"num":27,"verse":"And de there  followed akoloutheō him autos a  great polys crowd plēthos of  the ho people laos,  and kai among them were  women gynē who hos were  mourning koptō and kai wailing thrēneō for  him autos. "},{"num":28,"verse":"Turning strephō · de to pros them autos,  · ho Jesus Iēsous said legō, “ Daughters thugatēr of  Jerusalem Ierousalēm,  do  not mē weep klaiō for epi me egō,  but plēn weep klaiō for epi yourselves heautou and kai for epi · ho your hymeis children teknon. "},{"num":29,"verse":"For hoti the  days hēmera are  surely  coming erchomai when en hos they  will  say legō, ‘ Blessed makarios are  the ho barren steira and kai the ho wombs koilia that hos never ou gave  birth gennaō and kai the  breasts mastos that hos never ou nursed trephō!’ "},{"num":30,"verse":"Then tote they  will  begin archō to  say legō to  the ho mountains oros, ‘ Fall piptō on epi us hēmeis!’  and kai to  the ho hills bounos, ‘ Cover kalyptō us hēmeis!’ "},{"num":31,"verse":"For hoti if ei they  do poieō these  things houtos when en the ho wood xylon is  green hygros,  what tis will  happen ginomai when en · ho it is  dry xēros?” "},{"num":32,"verse":"And de they  also kai led agō away  two dyo others heteros,  who  were  criminals kakourgos,  to  be  put  to  death anaireō with syn him autos. "},{"num":33,"verse":"And kai when hote they  came erchomai to epi the ho place topos · ho called kaleō “The  Skull kranion,”  there ekei they  crucified stauroō him autos and kai the ho criminals kakourgos— one hos on ek his  right dexios and de one hos on ek his  left aristeros. "},{"num":34,"verse":"· ho And de Jesus Iēsous was  saying legō, “ Father patēr,  forgive aphiēmi them autos;  for gar they  do  not ou know oida what tis they  are  doing poieō.”  Then de in  order  to  divide diamerizō up  · ho his autos clothing himation they  cast ballō lots klēros. "},{"num":35,"verse":"· kai The ho people laos stood histēmi by ,  watching theōreō.  The ho rulers archōn even kai scoffed ekmyktērizō · de at him,  saying legō, “ He  saved sōzō others allos;  let  him  save sōzō himself heautou,  if ei he houtos is eimi the ho Christ Christos of ho God theos,  the ho Chosen eklektos One !” "},{"num":36,"verse":"The ho soldiers stratiōtēs,  also kai,  mocked empaizō · de him autos,  coming proserchomai up  and  offering prospherō him autos sour oxos wine "},{"num":37,"verse":"and kai saying legō, “ If ei you sy are eimi the ho king basileus of  the ho Jews Ioudaios,  save sōzō yourself seautou!” "},{"num":38,"verse":"In  fact kai,  there  was eimi · de an  inscription epigraphē above epi him autos, “ This houtos is  the ho King basileus of  the ho Jews Ioudaios.” "},{"num":39,"verse":"One heis · de of  the ho criminals kakourgos hanging kremannymi there  kept  deriding blasphēmeō him autos,  saying legō, “ Are eimi you sy not ouchi the ho Messiah Christos?  Save sōzō yourself seautou and kai us hēmeis!” "},{"num":40,"verse":"But de the ho other heteros responded apokrinomai to  him autos with  a  rebuke epitimaō,  saying phēmi, “ Do  you sy not oude fear phobeomai · ho God theos,  since hoti you  are eimi under en the ho same autos sentence krima? "},{"num":41,"verse":"And kai we hēmeis indeed men justly dikaiōs.  For gar we  are  receiving apolambanō what  we  deserve axios for  what hos we  did prassō;  but de this houtos man  has  done prassō nothing oudeis improper atopos.” "},{"num":42,"verse":"Then kai he  said legō, “ Jesus Iēsous,  remember mimnēskomai me egō when hotan you  come erchomai in eis · ho your sy kingdom basileia.” "},{"num":43,"verse":"And kai Jesus  said legō to  him autos, “ In  solemn  truth amēn I  tell legō you sy:  today sēmeron you  will  be eimi with meta me egō in en · ho paradise paradeisos.” "},{"num":44,"verse":"· kai It  was eimi already ēdē only  about hōsei the  sixth hektos hour hōra but kai darkness skotos covered ginomai epi the  whole holos · ho land gē until heōs the  ninth enatos hour hōra, "},{"num":45,"verse":"because  the light  of  the ho sun hēlios had  been  eclipsed ekleipō.  The ho curtain katapetasma of  the ho temple naos was  torn schizō · de down  the  middle mesos. "},{"num":46,"verse":"Then kai Jesus Iēsous,  crying phōneō out  in  a  loud megas voice phōnē,  · ho said legō, “ Father patēr,  into eis your sy hands cheir I  commit paratithēmi · ho my egō spirit pneuma!”  Having  said legō this houtos,  · de he  breathed ekpneō his  last . "},{"num":47,"verse":"Now de when  the ho centurion hekatontarchēs saw  what ho had  happened ginomai,  he  praised doxazō · ho God theos,  saying legō, “ Truly ontōs · ho this houtos man anthrōpos was eimi righteous dikaios!” "},{"num":48,"verse":"And kai when  all pas the ho crowds ochlos who  had  gathered symparaginomai for epi · ho this houtos spectacle theōria saw theōreō what ho had  happened ginomai,  they  returned hypostrephō home,  beating typtō their ho breasts stēthos. "},{"num":49,"verse":"And de all pas who ho knew gnōstos Jesus autos,  including kai the  women gynē who ho had  followed synakoloutheō him autos from apo · ho Galilee Galilaia,  were  standing histēmi at apo a  distance makrothen,  watching horaō these houtos things . "},{"num":50,"verse":"Now kai there idou was  a  man anēr named onoma Joseph Iōsēph, a  member hyparchō of the  Council bouleutēs,  · kai a  good agathos and kai righteous dikaios man anēr. "},{"num":51,"verse":"( He houtos had eimi not ou agreed synkatatithēmi with  their ho decision boulē or kai · ho their autos action praxis.) He was  from apo the ho Jewish Ioudaios town polis of  Arimathea Harimathaia, and  he hos was  waiting prosdechomai expectantly  for  the ho kingdom basileia of ho God theos. "},{"num":52,"verse":"This houtos man  went proserchomai to ho Pilate Pilatos and  asked aiteō for  the ho body sōma of ho Jesus Iēsous; "},{"num":53,"verse":"then kai taking kathaireō it  down ,  he  wrapped entylissō it autos in  a  linen sindōn cloth ,  and kai laid tithēmi him autos in en a  tomb mnēma cut laxeutos in  stone ,  where hou no  one oudeis had  yet oupō been eimi laid keimai. "},{"num":54,"verse":"· kai It  was eimi the  day hēmera of  preparation paraskeuē and kai the  Sabbath sabbaton was  about  to  begin epiphōskō. "},{"num":55,"verse":"The ho women gynē who hostis had eimi come  with synerchomai him autos from ek Galilee Galilaia followed  along  behind katakoloutheō · de · ho and  saw theaomai the ho tomb mnēmeion,  and kai how hōs his autos body sōma was  laid tithēmi in it  · ho"},{"num":56,"verse":"Then de they  returned hypostrephō and  prepared hetoimazō anointing  spices arōma and kai perfumes myron.  · kai On  the ho Sabbath sabbaton they  rested hēsychazō according kata to  the ho commandment entolē. "}]