[{"num":23,"verse":"Then the entire Council took Jesus over to Pilate, the governor. "},{"num":2,"verse":"They began at once accusing him: “This fellow has been leading our people to ruin by telling them not to pay their taxes to the Roman government and by claiming he is our Messiah—a King.”"},{"num":3,"verse":"So Pilate asked him, “Are you their Messiah—their King?”"},{"num":4,"verse":"Then Pilate turned to the chief priests and to the mob and said, “So? That isn’t a crime!”"},{"num":5,"verse":"Then they became desperate. “But he is causing riots against the government everywhere he goes, all over Judea, from Galilee to Jerusalem!”"},{"num":6,"verse":"“Is he then a Galilean?” Pilate asked."},{"num":7,"verse":"When they told him yes, Pilate said to take him to King Herod, for Galilee was under Herod’s jurisdiction; and Herod happened to be in Jerusalem at the time. "},{"num":8,"verse":"Herod was delighted at the opportunity to see Jesus, for he had heard a lot about him and had been hoping to see him perform a miracle."},{"num":9,"verse":"He asked Jesus question after question, but there was no reply. "},{"num":10,"verse":"Meanwhile, the chief priests and the other religious leaders stood there shouting their accusations."},{"num":11,"verse":"Now Herod and his soldiers began mocking and ridiculing Jesus; and putting a kingly robe on him, they sent him back to Pilate. "},{"num":12,"verse":"That day Herod and Pilate—enemies before—became fast friends."},{"num":13,"verse":"Then Pilate called together the chief priests and other Jewish leaders, along with the people, "},{"num":14,"verse":"and announced his verdict:"},{"num":15,"verse":"Herod came to the same conclusion and sent him back to us—nothing this man has done calls for the death penalty. "},{"num":16,"verse":"I will therefore have him scourged with leaded thongs and release him.”"},{"num":17,"verse":"But now a mighty roar rose from the crowd as with one voice they shouted. “Kill him, and release Barabbas to us!” "},{"num":19,"verse":"(Barabbas was in prison for starting an insurrection in Jerusalem against the government, and for murder.) "},{"num":20,"verse":"Pilate argued with them, for he wanted to release Jesus. "},{"num":21,"verse":"But they shouted, “Crucify him! Crucify him!”"},{"num":22,"verse":"Once more, for the third time, he demanded, “Why? What crime has he committed? I have found no reason to sentence him to death. I will therefore scourge him and let him go.” "},{"num":23,"verse":"But they shouted louder and louder for Jesus’ death, and their voices prevailed."},{"num":24,"verse":"So Pilate sentenced Jesus to die as they demanded. "},{"num":25,"verse":"And he released Barabbas, the man in prison for insurrection and murder, at their request. But he delivered Jesus over to them to do with as they would."},{"num":26,"verse":"As the crowd led Jesus away to his death, Simon of Cyrene, who was just coming into Jerusalem from the country, was forced to follow, carrying Jesus’ cross. "},{"num":27,"verse":"Great crowds trailed along behind, and many grief-stricken women."},{"num":28,"verse":"But Jesus turned and said to them, “Daughters of Jerusalem, don’t weep for me, but for yourselves and for your children. "},{"num":29,"verse":"For the days are coming when the women who have no children will be counted fortunate indeed. "},{"num":30,"verse":"Mankind will beg the mountains to fall on them and crush them, and the hills to bury them. "},{"num":31,"verse":"For if such things as this are done to me, the Living Tree, what will they do to you?”"},{"num":32,"verse":"Two others, criminals, were led out to be executed with him at a place called “The Skull.” There all three were crucified—Jesus on the center cross, and the two criminals on either side."},{"num":34,"verse":"“Father, forgive these people,” Jesus said, “for they don’t know what they are doing.”"},{"num":35,"verse":"The crowd watched. And the Jewish leaders laughed and scoffed. “He was so good at helping others,” they said, “let’s see him save himself if he is really God’s Chosen One, the Messiah.”"},{"num":36,"verse":"The soldiers mocked him, too, by offering him a drink—of sour wine. "},{"num":37,"verse":"And they called to him, “If you are the King of the Jews, save yourself !”"},{"num":38,"verse":"A signboard was nailed to the cross above him with these words: “This is the King of the Jews.”"},{"num":39,"verse":"One of the criminals hanging beside him scoffed, “So you’re the Messiah, are you? Prove it by saving yourself—and us, too, while you’re at it!”"},{"num":40,"verse":"But the other criminal protested. “Don’t you even fear God when you are dying? We deserve to die for our evil deeds, but this man hasn’t done one thing wrong.” "},{"num":42,"verse":"Then he said, “Jesus, remember me when you come into your Kingdom.”"},{"num":43,"verse":"And Jesus replied, “Today you will be with me in Paradise. This is a solemn promise.”"},{"num":44,"verse":"By now it was noon, and darkness fell across the whole land for three hours, until three o’clock. "},{"num":45,"verse":"The light from the sun was gone—and suddenly the thick veil hanging in the Temple split apart."},{"num":46,"verse":"Then Jesus shouted, “Father, I commit my spirit to you,” and with those words he died."},{"num":47,"verse":"When the captain of the Roman military unit handling the executions saw what had happened, he was stricken with awe before God and said, “Surely this man was innocent.”"},{"num":48,"verse":"And when the crowd that came to see the crucifixion saw that Jesus was dead, they went home in deep sorrow. "},{"num":49,"verse":"Meanwhile, Jesus’ friends, including the women who had followed him down from Galilee, stood in the distance watching."},{"num":50,"verse":"Then a man named Joseph, a member of the Jewish Supreme Court, from the city of Arimathea in Judea, went to Pilate and asked for the body of Jesus. He was a godly man who had been expecting the Messiah’s coming and had not agreed with the decision and actions of the other Jewish leaders. "},{"num":53,"verse":"So he took down Jesus’ body and wrapped it in a long linen cloth and laid it in a new, unused tomb hewn into the rock at the side of a hill. "},{"num":54,"verse":"This was done late on Friday afternoon, the day of preparation for the Sabbath."},{"num":55,"verse":"As the body was taken away, the women from Galilee followed and saw it carried into the tomb. "},{"num":56,"verse":"Then they went home and prepared spices and ointments to embalm him; but by the time they were finished it was the Sabbath, so they rested all that day as required by the Jewish law."}]