[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(15) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And their meat offering, and their drink offerings.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e., ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "the offerings of fine flour and oil and wine which belonged to the burnt-offerings and the peace-offerings (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 15:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6:1-21 The word Nazarite signifies separation. Some were appointed of God, before their birth, to be Nazarites all their days, as Samson and John the Baptist. But, in general, it was a vow of separation from the world and devotedness to the services of religion, for a limited time, and under certain rules, which any person might make if they pleased. A Nazarite is spoken of as well known; but his obligation is brought to a greater certainty than before. That the fancies of superstitious men might not multiply the restraints endlessly, God gives them rules. They must not drink wine or strong drink, nor eat grapes. Those who separate themselves to God, must not gratify the desires of the body, but keep it under. Let all Christians be very moderate in the use of wine and strong drink; for if the love of these once gets the mastery of a man, he becomes an easy prey to Satan. The Nazarites were to eat nothing that came of the vine; this may teach the utmost care to avoid sin, and all that borders upon it, and leads to it, or may be a temptation to us. They must not cut their hair. They must neither poll their heads, nor shave their beards; this was the mark of Samson being a Nazarite. This signified neglect of the body, and of the ease and ornament of it. Those who separate themselves to God, must keep their consciences pure from dead works, and not touch unclean things. All the days of their separation they must be holy to the Lord. This was the meaning of those outward observances, and without this they were of no account. No penalty or sacrifice was appointed for those who wilfully broke their vow of being Nazarites; they must answer another day for such profane trifling with the Lord their God; but those were to be relieved who did not sin wilfully. There is nothing in Scripture that bears the least resemblance to the religious orders of the church of Rome, except these Nazarites. But mark the difference, or rather how completely opposed! The religious of that church are forbidden to marry; but no such restriction is laid upon the Nazarites. They are commanded to abstain from meats; but the Nazarites might eat any food allowed other Israelites. They are not generally forbidden wine, not even on their fasting days; but the Nazarites might not have wine at any time. Their vow is lasting, even to the end of their lives; the Nazarites' vow was only for a limited time, at their own will; and in certain cases not unless allowed by husbands or parents. Such a thorough difference there is between rules of man's invention and those directed in Scripture, Let us not forget that the Lord Jesus is not only our Surety, but also our example. For his sake we must renounce worldly pleasures, abstain from fleshy lusts, be separate from sinners, make open profession of our faith, moderate natural affections, be spiritually-minded, and devoted to God's service, and desirous to be an example all around us.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The sin-offering (compare the marginal references), though named second, was in practice offered first, being intended to expiate involuntary sins committed during the period of separation. The burnt-offering (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 1:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff) denoted the self-surrender on which alone all acceptableness in the Nazarite before God must rest; the peace-offerings (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 3:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff) expressed thankfulness to God by whose grace the vow had been fulfilled. The offerings, both ordinary and additional, required on the completion of the Nazarite vow involved considerable expense, and it was regarded as a pious work to provide the poor with the means of making them (compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 21:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff; 1 Macc. 3:49).",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13-20. when the days of his separation are fulfilled, &c.—On the accomplishment of a limited vow of Nazaritism, Nazarites might cut their hair wherever they happened to be (Ac 18:18); but the hair was to be carefully kept and brought to the door of the sanctuary. Then after the presentation of sin offerings and burnt offerings, it was put under the vessel in which the peace offerings were boiled; and the priest, taking the shoulder (Le 7:32), when boiled, and a cake and wafer of the meat offering, put them on the hands of the Nazarites to wave before the Lord, as a token of thanksgiving, and thus released them from their vow.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Such as did generally accompany the sacrifices; of which see ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Leviticus 2:1 Num 28",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 2:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Num 28",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And a basket of unleavened bread,.... As at the consecration of Aaron and his sons, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 29:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; though for peace offerings for thanksgiving leavened bread was offered, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 7:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "cakes of fine flour mingled with oil, and wafers of unleavened bread anointed with oil; ten of each sort, as Jarchi says, ten cakes and ten wafers, see Exodus 29:9, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "cakes of fine flour mingled with oil, and wafers of unleavened bread anointed with oil; ten of each sort, as Jarchi says, ten cakes and ten wafers, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 29:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and their meat offering and their drink offering; which always used to attend every sacrifice. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and their meat offering and their drink offering; which always used to attend every sacrifice. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And a basket of unleavened bread, cakes of fine flour mingled with oil, and wafers of unleavened bread anointed with oil, and their meat offering, and their drink offerings.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 15.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "A",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "basket of unleavened bread...  anointed with oil.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Required for every sacrifice of thanksgiving, as this was (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 7:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "their meat offering, and their",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " drink offerings, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the gifts of meal, oil, and wine which belonged to burnt offerings and peace offerings (see below, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 15:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "sqq.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ). Numbers 6:15",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The directions as to the release from consecration are called \"the law of the Nazarite\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 6:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), because the idea of the Nazarite's vows culminated in the sacrificial festival which terminated the consecration, and it was in this that it attained to its fullest manifestation. \"On the day of the completion of the days of his consecration,\" i.e., on the day when the time of consecration expired, the Nazarite was to bring to the tabernacle, or offer as his gifts to the Lord, a sheep of a year old as a burnt-offering, and an ewe of a year old as a sin-offering; the latter as an expiation for the sins committed involuntarily during the period of consecration, the former as an embodiment of that surrender of himself, body and soul, to the Lord, upon which every act of worship should rest. In addition to this he was to bring a ram without blemish as a peace-offering, together with a basket of unleavened cakes and wafers baked, which were required, according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 7:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", for every praise-offering, \"and their meat and drink-offerings,\" i.e., the gifts of meal, oil, and wine, which belonged, according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 15:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., to the burnt-offerings and peace-offerings.",
        "children": []
      }
    ]
  }
]