[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Numbers 6:19",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 6:19",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The shoulder — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The left shoulder, as it appears from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 6:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where this is joined with the heave-shoulder, which was the right shoulder, and which was the priests’ due in all sacrifices, (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 7:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) and in this also. But here the other shoulder was added to it, as a special token of thankfulness from the Nazarites for God’s singular favours vouchsafed unto them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The hands — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That he may give them to the priest, as his peculiar gift.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6:1-21 The word Nazarite signifies separation. Some were appointed of God, before their birth, to be Nazarites all their days, as Samson and John the Baptist. But, in general, it was a vow of separation from the world and devotedness to the services of religion, for a limited time, and under certain rules, which any person might make if they pleased. A Nazarite is spoken of as well known; but his obligation is brought to a greater certainty than before. That the fancies of superstitious men might not multiply the restraints endlessly, God gives them rules. They must not drink wine or strong drink, nor eat grapes. Those who separate themselves to God, must not gratify the desires of the body, but keep it under. Let all Christians be very moderate in the use of wine and strong drink; for if the love of these once gets the mastery of a man, he becomes an easy prey to Satan. The Nazarites were to eat nothing that came of the vine; this may teach the utmost care to avoid sin, and all that borders upon it, and leads to it, or may be a temptation to us. They must not cut their hair. They must neither poll their heads, nor shave their beards; this was the mark of Samson being a Nazarite. This signified neglect of the body, and of the ease and ornament of it. Those who separate themselves to God, must keep their consciences pure from dead works, and not touch unclean things. All the days of their separation they must be holy to the Lord. This was the meaning of those outward observances, and without this they were of no account. No penalty or sacrifice was appointed for those who wilfully broke their vow of being Nazarites; they must answer another day for such profane trifling with the Lord their God; but those were to be relieved who did not sin wilfully. There is nothing in Scripture that bears the least resemblance to the religious orders of the church of Rome, except these Nazarites. But mark the difference, or rather how completely opposed! The religious of that church are forbidden to marry; but no such restriction is laid upon the Nazarites. They are commanded to abstain from meats; but the Nazarites might eat any food allowed other Israelites. They are not generally forbidden wine, not even on their fasting days; but the Nazarites might not have wine at any time. Their vow is lasting, even to the end of their lives; the Nazarites' vow was only for a limited time, at their own will; and in certain cases not unless allowed by husbands or parents. Such a thorough difference there is between rules of man's invention and those directed in Scripture, Let us not forget that the Lord Jesus is not only our Surety, but also our example. For his sake we must renounce worldly pleasures, abstain from fleshy lusts, be separate from sinners, make open profession of our faith, moderate natural affections, be spiritually-minded, and devoted to God's service, and desirous to be an example all around us.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Shave the head - As the Nazarite had during his vow worn his hair unshorn in honor of God, so when the time was complete it was natural that the hair, the symbol of his vow, should be cut off, and offered to God at the sanctuary. The burning of the hair \"in the fire under the sacrifice of the peace offering \"represented the eucharistic communion with God obtained by those who realised the ideal which the Nazarite set forth (compare the marginal reference).",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13-20. when the days of his separation are fulfilled, &c.—On the accomplishment of a limited vow of Nazaritism, Nazarites might cut their hair wherever they happened to be (Ac 18:18); but the hair was to be carefully kept and brought to the door of the sanctuary. Then after the presentation of sin offerings and burnt offerings, it was put under the vessel in which the peace offerings were boiled; and the priest, taking the shoulder (Le 7:32), when boiled, and a cake and wafer of the meat offering, put them on the hands of the Nazarites to wave before the Lord, as a token of thanksgiving, and thus released them from their vow.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The sodden shoulder; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the left shoulder, as it appears from ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Numbers 6:20",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 6:20",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", where this is joined with the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "heave-shoulder",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which was the right shoulder, and which was the priest’s due in all sacrifices, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Leviticus 7:32",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 7:32",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and in this also. But here the other shoulder was added to it, as a special token of thankfulness from the Nazarites for God’s singular favours vouchsafed into them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Upon the hands of the Nazarite, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that he may give them to the priest, as his peculiar gift. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the priest shall take the sodden shoulder of the ram,.... The left shoulder, for the right shoulder, which is the heave shoulder of every peace offering, belonged to the priest by another law; and by this law of the Nazarite, he had also the other shoulder, and so had both, which was peculiar to this case; the vow of the Nazarite being a very sacred thing and he being enabled to perform it, a greater expression of gratitude for it was expected and required of him: this shoulder was taken out of the pot in which it was boiled: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and one unleavened cake out of the basket, and one unleavened wafer; one of the ten cakes, and one of the ten wafers, both are mentioned; and which appear by this to be together in the basket of unleavened bread, from whence they were now to be taken, the rest having been offered with the other sacrifices: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and shall put them upon the hands of the Nazarite; the boiled shoulder, and the cake and wafer upon it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "after the hair of his separation is shaven; and cast into the fire; for the waving of these seems to be the last and finishing part of this whole affair. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "after the hair of his separation is shaven; and cast into the fire; for the waving of these seems to be the last and finishing part of this whole affair. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And the priest shall take the sodden shoulder of the ram, and one unleavened cake out of the basket, and one unleavened wafer, and shall put them upon the hands of the Nazarite, after the hair of his separation is shaven:",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the sodden shoulder",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] It had been previously sodden, i.e. boiled, elsewhere in readiness.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 19.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "sodden shoulder,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or boiled shoulder; the left. The right, or heave shoulder, was already the priest's, according to the general rule (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 7:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). That the other shoulder was also \"waved\" and accepted by God as his portion, to be consumed in his name by the priest, was a further token of the  gracious acceptance of the self-dedication of the Nazirite, and of the fullness of eucharistic communion into which he had entered with his God. Numbers 6:19",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "When this had been done, the priest took the boiled shoulder of the ram, with an unleavened cake and wafer out of the basket, and placed these pieces in the hands of the Nazarite, and waved them before Jehovah. They then became the portion of the priest, in addition to the wave-breast and heave-leg which fell to the priest in the case of every peace-offering (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 7:32-34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), to set forth the participation of the Lord in the sacrificial meal. But the fact that, in addition to these, the boiled shoulder was given up symbolically to the Lord through the process of waving, together with a cake and wafer, was intended to indicate that the table-fellowship with the Lord, shadowed forth in the sacrificial meal of the peace-offering, took place here in a higher degree; inasmuch as the Lord directed a portion of the Nazarite's meal to be handed over to His representatives and servants for them to eat, that he might thus enjoy the blessedness of having fellowship with his God, in accordance with that condition of priestly sanctity into which the Nazarite had entered through the vow that he had made.",
        "children": []
      }
    ]
  }
]