[{"header":"Paul’s Work in Thessalonica"},{"num":2,"verse":"Brothers, you know that our visit to you was not a failure. "},{"num":2,"verse":"Before we came to you, we suffered in Philippi. People there insulted us. You know about that. And when we came to you, many people were against us. But our God helped us to be brave and to tell you his Good News. "},{"num":3,"verse":"Our message was a message to encourage you. We were not trying to lie. We had no evil plan. We were not trying to trick you. "},{"num":4,"verse":"But we speak the Good News because God tested us and trusted us to do it. When we speak, we are not trying to please men. But we are trying to please God, who tests our hearts. "},{"num":5,"verse":"You know that we never tried to influence you by saying nice things about you. We were not trying to get your money. We had no selfishness to hide from you. God knows that this is true. "},{"num":6,"verse":"We were not looking for praise from you or anyone else. We are apostles of Christ. When we were with you, we could have used our authority to make you do things."},{"num":7,"verse":"But we were very gentle with you. We were like a mother caring for her little children. "},{"num":8,"verse":"Because we loved you, we were happy to share God’s Good News with you. But not only that, we were also happy to share even our own lives with you. "},{"num":9,"verse":"Brothers, I know that you remember how hard we worked. We worked night and day so that we would not burden any of you while we preached God’s Good News to you."},{"num":10,"verse":"When we were with you, we lived in a holy and right way, without fault. You know that this is true, and God knows that this is true. "},{"num":11,"verse":"You know that we treated each of you as a father treats his own children. "},{"num":12,"verse":"We strengthened you, we comforted you, and we told you to live good lives for God. It is God who calls you to his glorious kingdom."},{"num":13,"verse":"Also, we always thank God because of the way you accepted his message. You heard his message from us, and you accepted it as the word of God, not the words of men. And it really is God’s message. And that message works in you who believe. "},{"num":14,"verse":"Brothers, you have been like God’s churches in Christ that are in Judea. God’s people suffered bad things from the other Jews there. And you suffered the same bad things from the people of your own country. "},{"num":15,"verse":"Those Jews killed both the Lord Jesus and the prophets. And they forced us to leave that country. They do not please God. They are against all people. "},{"num":16,"verse":"They try to stop us from teaching the non-Jews so that they may be saved. But those Jews are adding more and more sins to the sins they already have. The anger of God has come to them at last."},{"header":"Paul Wants to Visit Them Again"},{"num":17,"verse":"Brothers, we were separated from you for a short time, but our thoughts were still with you. We wanted very much to see you, and tried very hard to do so. "},{"num":18,"verse":"I, Paul, tried to come many times, but Satan stopped us. "},{"num":19,"verse":"For you are our hope, our joy, and the crown we will be proud of when our Lord Jesus Christ comes. "},{"num":20,"verse":"Truly you are our glory and our joy."}]