[[],[],[{"type":"prose","content":"So, friends, it’s obvious that our visit to you was no waste of time. We had just been given rough treatment in Philippi, as you know, but that didn’t slow us down. We were sure of ourselves in God, and went right ahead and said our piece, presenting God’s Message to you, defiant of the opposition."},{"type":"header","content":"No Hidden Agendas"}],[{"type":"prose","content":"God tested us thoroughly to make sure we were qualified to be trusted with this Message. Be assured that when we speak to you we’re not after crowd approval—only God approval. Since we’ve been put through that battery of tests, you’re guaranteed that both we and the Message are free of error, mixed motives, or hidden agendas. We never used words to butter you up. No one knows that better than you. And God knows we never used words as a smoke screen to take advantage of you."}],[{"type":"prose","content":"Even though we had some standing as Christ’s apostles, we never threw our weight around or tried to come across as important, with you or anyone else. We weren’t standoffish with you. We took you just as you were. We were never patronizing, never condescending, but we cared for you the way a mother cares for her children. We loved you dearly. Not content to just pass on the Message, we wanted to give you our hearts. And we ."}],[{"type":"prose","content":"You remember us in those days, friends, working our fingers to the bone, up half the night, moonlighting so you wouldn’t have the burden of supporting us while we proclaimed God’s Message to you. You saw with your own eyes how discreet and courteous we were among you, with keen sensitivity to you as fellow believers. And God knows we weren’t freeloaders! You experienced it all firsthand. With each of you we were like a father with his child, holding your hand, whispering encouragement, showing you step-by-step how to live well before God, who called us into his own kingdom, into this delightful life."}],[{"type":"prose","content":"And now we look back on all this and thank God, a geyser of thanks! When you got the Message of God we preached, you didn’t pass it off as just one more human opinion, but you took it to heart as God’s true word to you, which it is, God himself at work in you believers!"}],[{"type":"prose","content":"Friends, do you realize that you followed in the exact footsteps of the churches of God in Judea, those who were the first to follow in the footsteps of Jesus Christ? You got the same bad treatment from your countrymen as they did from theirs, the Jews who killed the Master Jesus (to say nothing of the prophets) and followed it up by running us out of town. They make themselves offensive to God and everyone else by trying to keep us from telling people who’ve never heard of our God how to be saved. They’ve made a career of opposing God, and have gotten mighty good at it. But God is fed up, ready to put an end to it.* * *"}],[{"type":"prose","content":"Do you have any idea how very homesick we became for you, dear friends? Even though it hadn’t been that long and it was only our bodies that were separated from you, not our hearts, we tried our very best to get back to see you. You can’t imagine how much we missed you! I, Paul, tried over and over to get back, but Satan thwarted us each time. Who do you think we’re going to be proud of when our Master Jesus appears if it’s not you? You’re our pride and joy!"}]]