[{"header":"God Commands Moses to Take a Census"},{"num":1,"verse":"Yahweh spoke to Moses in the desert of Sinai, in the tent of assembly, on the first of the month, in the second year after they came out of the land of Egypt, saying, "},{"num":2,"verse":"“Take a census of the entire community of the Israelites according to their clans and their families, according to the number of names, every male individually "},{"num":3,"verse":"from twenty years old and above, everyone in Israel who is able to go to war. You and Aaron must muster them for their wars. "},{"num":4,"verse":"A man from each tribe will be with you, each man the head of his family. "},{"num":5,"verse":"And these are the names of the men who will assist you: from Reuben, Elizur son of Shedeur; "},{"num":6,"verse":"from Simeon, Shelumiel son of Zurishaddai; "},{"num":7,"verse":"from Judah, Nahshon son of Amminadab; "},{"num":8,"verse":"from Issachar, Nethanel son of Zuar; "},{"num":9,"verse":"from Zebulun, Eliab son of Helon. "},{"num":10,"verse":"From the descendants of Joseph: from Ephraim, Elishama son of Ammihud; from Manasseh, Gamaliel son of Pedahzur. "},{"num":11,"verse":"From Benjamin, Abidan son of Gideoni; "},{"num":12,"verse":"from Dan, Ahiezer son of Ammishaddai; "},{"num":13,"verse":"from Asher, Pagiel son of Ocran; "},{"num":14,"verse":"from Gad, Eliasaph son of Deuel; "},{"num":15,"verse":"and from Naphtali, Ahira son of Enan.” "},{"num":16,"verse":"These are the ones summoned from the community, the leaders of their ancestors’ tribes; they are the heads of Israel’s clans."},{"num":17,"verse":"So Moses and Aaron took these men who had been designated by name, "},{"num":18,"verse":"and they summoned the entire community on the first day of the second month. And they registered themselves among their clans according to their families, according to the number of names from those twenty years old and above individually, "},{"num":19,"verse":"just as Yahweh commanded Moses. And he counted them in the desert of Sinai."},{"num":20,"verse":"The descendants of Reuben, the firstborn of Israel, their genealogies according to their clans, according to their families, according to the number of names, every male individually from twenty years old and above, everyone who is able to go to war: "},{"num":21,"verse":"those who were counted from the tribe of Reuben were forty-six thousand five hundred."},{"num":22,"verse":"From the descendants of Simeon, their genealogies according to their clans, according to their families, those who were counted according to the number of their names, every individual male from twenty years old and above, everyone who is able to go to war: "},{"num":23,"verse":"those who were counted from the tribe of Simeon were fifty-nine thousand three hundred."},{"num":24,"verse":"From the descendants of Gad, their genealogies according to their clans, according to their families, according to the number of names, from those twenty years old and above, everyone who is able to go to war: "},{"num":25,"verse":"those who were counted from the tribe of Gad were forty-five thousand six hundred and fifty."},{"num":26,"verse":"From the descendants of Judah, their genealogies according to their clans, according to their families, according to the number of names, from those twenty years old and above, everyone who is able to go to war: "},{"num":27,"verse":"those who were counted from the tribe of Judah were seventy-four thousand six hundred."},{"num":28,"verse":"From the descendants of Issachar, their genealogies according to their clans, according to their families, according to the number of names, from those twenty years old and above, everyone who is able to go to war: "},{"num":29,"verse":"those who were counted from the tribe of Issachar were fifty-four thousand four hundred."},{"num":30,"verse":"From the descendants of Zebulun, their genealogies according to their clans, according to their families, according to the number of names, from those twenty years old and above, everyone who is able to go to war: "},{"num":31,"verse":"those who were counted from the tribe of Zebulun were fifty-seven thousand four hundred."},{"num":32,"verse":"From the descendants of Joseph: from the descendants of Ephraim, their genealogies according to their clans, according to their families, according to the number of names, from those twenty years old and above, everyone who is able to go to war: "},{"num":33,"verse":"those who were counted from the tribe of Ephraim were forty thousand five hundred."},{"num":34,"verse":"From the descendants of Manasseh, their genealogies according to their clans, according to their families, according to the number of names, from those twenty years old and above, everyone who is able to go to war: "},{"num":35,"verse":"those who were counted from the tribe of Manasseh were thirty-two thousand two hundred."},{"num":36,"verse":"From the descendants of Benjamin, their genealogies according to their clans, according to their families, according to the number of names, from those twenty years old and above, everyone who is able to go to war: "},{"num":37,"verse":"those who were counted from the tribe of Benjamin were thirty-five thousand four hundred."},{"num":38,"verse":"From the descendants of Dan, their genealogies according to their clans, according to their families, according to the number of names, from those twenty years old and above, everyone who is able to go to war: "},{"num":39,"verse":"those who were counted from the tribe of Dan were sixty-two thousand seven hundred."},{"num":40,"verse":"From the descendants of Asher, their genealogies according to their clans, according to their families, according to the number of names, from those twenty years old and above, everyone who is able to go to war: "},{"num":41,"verse":"those who were counted from the tribe of Asher were forty-one thousand five hundred."},{"num":42,"verse":"From the descendants of Naphtali, their genealogies according to their clans, according to their families, according to the number of names, from those twenty years old and above, everyone who is able to go to war: "},{"num":43,"verse":"those who were counted from the tribe of Naphtali were fifty-three thousand four hundred."},{"num":44,"verse":"These are the ones counted whom Moses and Aaron mustered, with the twelve leaders of Israel, each one from his family. "},{"num":45,"verse":"So all those who were counted from the Israelites according to their families, from those twenty years old and above, everyone in Israel who is able to go to war. "},{"num":46,"verse":"All of the ones counted were six hundred and three thousand, five hundred and fifty. "},{"num":47,"verse":"The Levites from their ancestors’ tribe were not mustered in their midst."},{"num":48,"verse":"And Yahweh spoke to Moses, saying, "},{"num":49,"verse":"“You will not muster the tribe of Levi, and you will not take a census of them in the midst of the Israelites. "},{"num":50,"verse":"You will appoint them over the tabernacle of the testimony, over all its vessels, and over all that belongs to it. They will carry the tabernacle and all its vessels, and they will care for it; and they will camp around the tabernacle. "},{"num":51,"verse":"And when the tabernacle is set out, the Levites will take it down, and when encamping the tabernacle the Levites will set it up; the stranger that approaches it will be put to death. "},{"num":52,"verse":"The Israelites will encamp, each in their own camp, and each by their own banner according to their divisions. "},{"num":53,"verse":"But the Levites will encamp around the tabernacle of the testimony, and there will not be wrath on the community of the Israelites; and the Levites will keep the requirements of the tabernacle of the testimony.” "},{"num":54,"verse":"And the Israelites did thus; they did everything that Yahweh commanded Moses."}]