[{"header":"The census"},{"num":1,"verse":"The Lord spoke to Moses in the tent of meeting in the Desert of Sinai on the first day of the second month of the second year after the Israelites came out of Egypt. He said: "},{"num":2,"verse":"‘Take a census of the whole Israelite community by their clans and families, listing every man by name, one by one. "},{"num":3,"verse":"You and Aaron are to count according to their divisions all the men in Israel who are twenty years old or more and able to serve in the army. "},{"num":4,"verse":"One man from each tribe, each of them the head of his family, is to help you. "},{"num":5,"verse":"These are the names of the men who are to assist you:"},{"num":16,"verse":"These were the men appointed from the community, the leaders of their ancestral tribes. They were the heads of the clans of Israel."},{"num":17,"verse":"Moses and Aaron took these men whose names had been specified, "},{"num":18,"verse":"and they called the whole community together on the first day of the second month. The people registered their ancestry by their clans and families, and the men twenty years old or more were listed by name, one by one, "},{"num":19,"verse":"as the Lord commanded Moses. And so he counted them in the Desert of Sinai:"},{"num":44,"verse":"These were the men counted by Moses and Aaron and the twelve leaders of Israel, each one representing his family. "},{"num":45,"verse":"All the Israelites twenty years old or more who were able to serve in Israel’s army were counted according to their families. "},{"num":46,"verse":"The total number was 603,550."},{"num":47,"verse":"The ancestral tribe of the Levites, however, was not counted along with the others. "},{"num":48,"verse":"The Lord had said to Moses: "},{"num":49,"verse":"‘You must not count the tribe of Levi or include them in the census of the other Israelites. "},{"num":50,"verse":"Instead, appoint the Levites to be in charge of the tabernacle of the covenant law – over all its furnishings and everything belonging to it. They are to carry the tabernacle and all its furnishings; they are to take care of it and camp round it. "},{"num":51,"verse":"Whenever the tabernacle is to move, the Levites are to take it down, and whenever the tabernacle is to be set up, the Levites shall do it. Anyone else who approaches it is to be put to death. "},{"num":52,"verse":"The Israelites are to set up their tents by divisions, each of them in their own camp under their standard. "},{"num":53,"verse":"The Levites, however, are to set up their tents round the tabernacle of the covenant law so that my wrath will not fall on the Israelite community. The Levites are to be responsible for the care of the tabernacle of the covenant law.’"},{"num":54,"verse":"The Israelites did all this just as the Lord commanded Moses."}]