[{"num":1,"verse":"And Hashem spoke unto Moshe in the midbar of Sinai, in the Ohel Mo’ed, on the first day of the second month, in the second year after they were come out of Eretz Mitzrayim, saying,"},{"num":2,"verse":"Take ye the rosh (top amount, census) of kol Adat Bnei Yisroel after their mishpekhot, by the bais of their avot, with the number of their shmot, every zachar by their head count;"},{"num":3,"verse":"From twenty years old and upward, all that are ablebodied to serve in tzava b’Yisroel (army in Yisroel); thou and Aharon shall number them by their tzva’ot (legions)."},{"num":4,"verse":"And with you there shall be a man of every tribe; every one Rosh of the bais of his Avot."},{"num":5,"verse":"And these are the shemot haanashim that shall stand with you: of the tribe of Reuven, Elitzur ben Shedeur;"},{"num":6,"verse":"Of Shim’on, Shelumiel ben Tzurishaddai;"},{"num":7,"verse":"Of Yehudah, Nachshon ben Amminadav;"},{"num":8,"verse":"Of Yissakhar, Netanel ben Tzuar;"},{"num":9,"verse":"Of Zevulun, Eliav ben Chelon;"},{"num":10,"verse":"Of the bnei Yosef: of Ephrayim, Elishama ben Ammihud; of Menasheh, Gamli’el ben Pedahtzur;"},{"num":11,"verse":"Of Binyamin, Avidan ben Gideoni;"},{"num":12,"verse":"Of Dan, Achiezer ben Ammishaddai;"},{"num":13,"verse":"Of Asher, Pagiel ben Ochran;"},{"num":14,"verse":"Of Gad, Elyasaph ben Deuel;"},{"num":15,"verse":"Of Naphtali, Achira ben Enan."},{"num":16,"verse":"These were the called men of the Edah, nasiim of the tribes of their avot, rashei alfei Yisroel (head-men of the clans of Yisroel)."},{"num":17,"verse":"And Moshe and Aharon took these men which had been designated by their names;"},{"num":18,"verse":"And they assembled kol HaEdah together on the first yom of the second month, and they declared their family after their mishpekhot, by the bais of their avot, according to the number of the shmot, from twenty years old and upward, one by one."},{"num":19,"verse":"As Hashem commanded Moshe, so he counted them in the midbar of Sinai."},{"num":20,"verse":"And the bnei Reuven, Yisroel’s bechor, by their toldot, after their mishpekhot, by the bais of their avot, according to the number of the shmot, one by one, every zakhar from twenty years old and upward, all that are ablebodied to serve in tzava;"},{"num":21,"verse":"Those that were numbered of them, even of the tribe of Reuven, were forty and six thousand and five hundred."},{"num":22,"verse":"Of the bnei Shim’on, by their toldot, after their mishpekhot, by the bais of their avot, those that were numbered of them, according to the number of the shmot, one by one, every male from twenty years old and upward, all that were able-bodied to serve in tzava (army);"},{"num":23,"verse":"Those that were numbered of them, even of the tribe of Shim’on, were fifty and nine thousand and three hundred."},{"num":24,"verse":"Of the bnei Gad, by their toldot, after their mishpekhot, by the bais of their avot, according to the number of the shmot, from twenty years old and upward, all that were able-bodied to serve in tzava;"},{"num":25,"verse":"Those that were numbered of them, even of the tribe of Gad, were forty and five thousand six hundred and fifty."},{"num":26,"verse":"Of the bnei Yehudah, by their toldot, after their mishpekhot, by the bais of their avot, according to the number of the shmot, from twenty years old and upward, all that were able-bodied to serve in tzava (army);"},{"num":27,"verse":"Those that were numbered of them, even of the tribe of Yehudah, were threescore and fourteen thousand and six hundred."},{"num":28,"verse":"Of the bnei Yissakhar, by their toldot, after their mishpekhot, by the bais of their avot, according to the number of the shmot, from twenty years old and upward, all that were able-bodied to serve in tzava (army);"},{"num":29,"verse":"Those that were numbered of them, even of the tribe of Yissakhar, were fifty and four thousand and four hundred."},{"num":30,"verse":"Of the bnei Zevulun, by their toldot, after their mishpekhot, by the bais of their avot, according to the number of the shmot, from twenty years old and upward, all that were able-bodied to serve in tzava (army);"},{"num":31,"verse":"Those that were numbered of them, even of the tribe of Zevulun, were fifty and seven thousand and four hundred."},{"num":32,"verse":"Of the bnei Yosef, namely, of the bnei Ephrayim, by their toldot, after their mishpekhot, by the bais of their avot, according to the number of the shmot, from twenty years old and upward, all that were able-bodied to serve in tzava (army);"},{"num":33,"verse":"Those that were numbered of them, even of the tribe of Ephrayim, were forty thousand and five hundred."},{"num":34,"verse":"Of the bnei Menasheh, by their toldot, after their mishpekhot, by the bais of their avot, according to the number of the shmot, from twenty years old and upward, all that were able-bodied to serve in tzava (army);"},{"num":35,"verse":"Those that were numbered of them, even of the tribe of Menasheh, were thirty and two thousand and two hundred."},{"num":36,"verse":"Of the bnei Binyamin, by their toldot, after their mishpekhot, by the bais of their avot, according to the number of the shmot, from twenty years old and upward, all that were able-bodied to serve in tzava (army);"},{"num":37,"verse":"Those that were numbered of them, even of the tribe of Binyamin, were thirty and five thousand and four hundred."},{"num":38,"verse":"Of the bnei Dan, by their toldot, after their mishpekhot, by the bais of their avot, according to the number of the shmot, from twenty years old and upward, all that were able-bodied to serve in tzava (army);"},{"num":39,"verse":"Those that were numbered of them, even of the tribe of Dan, were threescore and two thousand and seven hundred."},{"num":40,"verse":"Of the bnei Asher, by their toldot, after their mishpekhot, by the bais of their avot, according to the number of the shmot, from twenty years old and upward, all that were able-bodied to serve in tzava (army);"},{"num":41,"verse":"Those that were numbered of them, even of the tribe of Asher, were forty and one thousand and five hundred."},{"num":42,"verse":"Of the bnei Naphtali, throughout their toldot, after their mishpekhot, by the bais of their avot, according to the number of the shmot, from twenty years old and upward, all that were able-bodied to serve in tzava (army);"},{"num":43,"verse":"Those that were numbered of them, even of the tribe of Naphtali, were fifty and three thousand and four hundred."},{"num":44,"verse":"These are those that were numbered, which Moshe and Aharon numbered, and the nasiim (princes, rulers, exalted) of Yisroel, being shneym asar (twelve) men, each one representing the bais of his avot."},{"num":45,"verse":"So were all those that were numbered of the Bnei Yisroel, by the bais of their avot, from twenty years old and upward, all that were able-bodied to serve in tzava b’Yisroel (army in Yisroel);"},{"num":46,"verse":"Even all they that were numbered were six hundred thousand and three thousand and five hundred and fifty."},{"num":47,"verse":"But the Levi’im after the tribe of their avot were not numbered among them."},{"num":48,"verse":"For Hashem had spoken unto Moshe saying,"},{"num":49,"verse":"Only thou shalt not number the tribe of Levi, neither take the sum of them among the Bnei Yisroel;"},{"num":50,"verse":"But thou shalt appoint the Levi’im over the Mishkan HaEdut and over all the vessels thereof, and over all things that belong to it; they shall bear the Mishkan, and all the vessels thereof; and they shall take care of it, and shall encamp round about the Mishkan."},{"num":51,"verse":"And when the Mishkan setteth forward, the Levi’im shall take it down; and when the Mishkan is to be pitched, the Levi’im shall set it up; and the zar (stranger, outsider, unauthorized party) that cometh nigh shall be put to death."},{"num":52,"verse":"And the Bnei Yisroel shall pitch their tents, every man by his own machaneh (camp), and every man by his own degel (standard, banner), throughout their tzva’ot (hosts)."},{"num":53,"verse":"But the Levi’im shall encamp around the Mishkan HaEdut, that there be no ketzef (wrath) fall upon the Adat Bnei Yisroel; and the Levi’im shall be shomer mishmeret (watch the watch, attend to, keep the charge, the reverence) of the Mishkan HaEdut."},{"num":54,"verse":"And the Bnei Yisroel did according to all that Hashem commanded Moshe, so did they."}]