[{"num":8,"verse":"In the third year of the realm of Belshazzar, the king, a vision appeared to me. I, Daniel, after that thing that I had seen in the beginning, (In the third year of the reign of King Belshazzar, a vision appeared to me. I, Daniel, after what I had seen before, or at the beginning,)"},{"num":2,"verse":"saw in my vision, when I was in the castle of Susa, which is in the country of Elam; soothly I saw in the vision that I was on the gate (of) Ulai. (saw in my vision, that I was in the castle at Susa, which is in the province of Elam; truly I saw in the vision that I was by the Ulai River.)"},{"num":3,"verse":"And I raised (up) mine eyes, and I saw; and lo! one ram stood before the marsh, and had high horns, and one higher than the other, and under-waxing (and growing)."},{"num":4,"verse":"Afterward I saw the ram winnowing with (his) horns against the east, and against the west, and against the north, and against the south; and all beasts might not against-stand it, neither be delivered from the hands of it (and no beast could stand against it, nor could be saved from its power). And it did by his will, and was magnified."},{"num":5,"verse":"And I understood. Lo! forsooth a buck of goats came from the west on the face of all (the) earth, and touched not the earth (and did not touch the ground); forsooth the buck of goats had a noble horn betwixt his eyes;"},{"num":6,"verse":"and he came till to that horned ram, which I had seen standing before the gate, and he ran in the fierceness of his strength to that ram. (and he came unto that horned ram, which I had seen standing by the river, and he ran in all the fierceness of his strength at that ram.)"},{"num":7,"verse":"And when he had nighed nigh the ram, he hurtled fiercely on him, and he smote the ram, and all-brake (the) twain horns of him, and the ram might not against-stand him. And when he had sent that ram into [the] earth, he defouled [him]; and no man might deliver the ram from his hand. (And when he had come close to the ram, he hurtled fiercely against him, and he struck the ram, and broke its two horns, and the ram could not stand against him. And when he had sent that ram down to the ground, he defiled, or trampled upon, him; and no one could rescue, or could save, the ram from his power.)"},{"num":8,"verse":"Forsooth the buck of goats was made full great; and when he had increased, the great horn was broken, and four horns rised (up) under it, by four winds of heaven (by the four winds of the heavens)."},{"num":9,"verse":"Forsooth of one of them went out one little horn, and it was made great against the south, and against the east, and against the strength. (And out of one of them grew one little horn, and it was made great toward the south, and toward the east, and toward the glorious land, or the Promised Land.)"},{"num":10,"verse":"And it was magnified till to the strength of heaven, and it casted down of the strength and of (the) stars, and defouled those. (And it was magnified unto the host of heaven, and it threw down some of that army, and some of the stars, and it defiled, or trampled upon, them.)"},{"num":11,"verse":"And he was magnified till to the prince of (the) strength, and he took away from him the continual sacrifice, and casted down the place of his hallowing. (And it was magnified unto the Prince of the host, and it took away from him the continual, or the daily, sacrifice, and threw down his sanctuary, or destroyed his Temple.)"},{"num":12,"verse":"Forsooth strength was given to him against the continual sacrifice for sins, and truth shall be cast down in (the) earth; and he shall have prosperity, and shall do. (And the heavenly host was delivered unto it, and it raised itself up against the continual, or the daily, sacrifice for sins, and it threw down the truth to the ground; and it prospered, or was successful, in all that it did.)"},{"num":13,"verse":"And I heard one of [the] holy angels speaking; and one holy angel said to another, I know not to whom speaking, How long the vision, and the continual sacrifice, and the sin of desolation, [or discomfort,] which is made, and the saintuary, and the host, shall be defouled? (And I heard one of the holy ones speaking; and one holy one said to another, I know not speaking to whom, For how long shall the period of this vision last, concerning the continual, or the daily, sacrifice, and the sin of desolation, or the sin of discomfort, that is done, and the sanctuary shall be defiled, and the host shall be trampled upon?)"},{"num":14,"verse":"And he said to him, Till to the eventide and morrowtide, two thousand days and three hundred; and the saintuary shall be cleansed. (And he said to him, Until the evening and the morning, two thousand and three hundred days; and then the sanctuary shall be cleansed.)"},{"num":15,"verse":"Forsooth it was done, when I, Daniel, saw the vision, and asked the understanding, lo! as the likeness of a man stood in my sight. (And it was done, when I, Daniel, saw the vision, and tried to understand it, lo! someone with the appearance of a man stood before me.)"},{"num":16,"verse":"And I heard the voice of a man betwixt (the banks of the) Ulai, and he cried (out), and said, Gabriel, make thou Daniel to understand this vision."},{"num":17,"verse":"And he came, and stood beside where I stood; and when he was come, I dreaded, and fell on my face. And he said to me, Thou, son of man, understand, for the vision shall be [ful]filled in the time of end. (And he came, and stood beside where I stood; and when he came, I was afraid, and fell on my face. And he said to me, O, son of man, understand, for the vision shall be fulfilled at the time of the end.)"},{"num":18,"verse":"And when he spake to me, I slid down groveling, either flat to the earth. And he touched me, and setted me in my degree (And he touched me, and set me upright)."},{"num":19,"verse":"And he said to me, I shall show to thee what things shall come in the last of cursing, for the time hath his end. (And he said to me, I shall tell thee what things shall come at the end of the cursing, for the time hath its end.)"},{"num":20,"verse":"The ram, whom thou sawest have horns, is the king of Medes and of Persians. (The ram, which thou sawest to have two horns, signifieth the kings of Media and of Persia.)"},{"num":21,"verse":"Forsooth the buck of goats is the king of Greeks (And the goat buck is the king of Greece); and the great horn that was betwixt his eyes, he is the first king."},{"num":22,"verse":"Forsooth that when that horn was broken, four horns rised for it, four kings shall rise of the folk of him, but not in the strength of him. (And when that horn was broken, and four horns rose up for it, four kings shall rise up out of his nation, but they shall not have power equal to his.)"},{"num":23,"verse":"And after the realm of them (And after their kingdoms, or their reign), when wickednesses have increased, a king shall rise (up) unshamefast in face, and understanding propositions, either reasons set forth; "},{"num":24,"verse":"and his strength shall be made stalworthy, but not in his [own] strengths. And more than it may be believed, he shall waste all things, and he shall have prosperity, and shall do. And he shall slay strong men, and the people of saints, (and his strength shall be made stalwart, but not by his own power. And more than it can be believed, he shall destroy everything, and he shall prosper, or be successful, in all that he shall do. And he shall kill the strong, and the people of the saints,)"},{"num":25,"verse":"by his will, and guile shall be (ad)dressed in his hand. And he shall magnify his heart, and in abundance of all things, he shall slay full many men. And he shall rise against the prince of princes, and without hand he shall be all-broken. (willfully, and deceit shall be directed in his hand. And he shall magnify his heart, and in the abundance of everything, he shall kill a great many people. And he shall rise up against the Prince of princes, but he shall be broken, without the use of any hands.)"},{"num":26,"verse":"And the vision, which is said in the morrowtide and eventide, is true. Therefore seal thou the vision, for it shall be after many days."},{"num":27,"verse":"And I, Daniel, was astonied, and was sick by full many days; and when I had risen, I did the works of the king; and I was astonied at the vision, and none was, that interpreted, either expounded. (And I, Daniel, was astonished, and was made sick by all of this for a great many days; and then I rose up, and did my work for the king; yea, I was astonished by the vision, but there was no one who could interpret, or who could expound, it for me.)"}]