[{"num":1,"verse":"Be sure to welcome our friend Phoebe in the way of the Master, with all the generous hospitality we Christians are famous for. I heartily endorse both her and her work. She’s a key representative of the church at Cenchrea. Help her out in whatever she asks. She deserves anything you can do for her. She’s helped many a person, including me."},{"num":3,"verse":"Say hello to Priscilla and Aquila, who have worked hand in hand with me in serving Jesus. They once put their lives on the line for me. And I’m not the only one grateful to them. All the non-Jewish gatherings of believers also owe them plenty, to say nothing of the church that meets in their house."},{"num":6,"verse":"Hello to Mary. What a worker she has turned out to be!"},{"num":7,"verse":"Hello to my cousins Andronicus and Junias. We once shared a jail cell. They were believers in Christ before I was. Both of them are outstanding leaders."},{"num":8,"verse":"Hello to Ampliatus, my good friend in the family of God."},{"num":9,"verse":"Hello to Urbanus, our companion in Christ’s work, and my good friend Stachys."},{"num":10,"verse":"Hello to Apelles, a tried-and-true veteran in following Christ."},{"num":11,"verse":"Hello to my cousin Herodion."},{"num":12,"verse":"Hello to Tryphena and Tryphosa—such diligent women in serving the Master."},{"num":13,"verse":"Hello to Rufus—a good choice by the Master!—and his mother. She has also been a dear mother to me."},{"num":14,"verse":"Hello to Asyncritus, Phlegon, Hermes, Patrobas, Hermas, and also to all of their families."},{"num":15,"verse":"Hello to Philologus, Julia, Nereus and his sister, and Olympas—and all the followers of Jesus who live with them."},{"num":16,"verse":"Holy hugs all around! All the churches of Christ send their warmest greetings!"},{"num":17,"verse":"One final word of counsel, friends. Keep a sharp eye out for those who take bits and pieces of the teaching that you learned and then use them to make trouble. Give these people a wide berth. They have no intention of living for our Master Christ. They’re only in this for what they can get out of it, and aren’t above using pious sweet talk to dupe unsuspecting innocents."},{"num":19,"verse":"And so while there has never been any question about your honesty in these matters—I couldn’t be more proud of you!—I want you also to be smart, making sure every “good” thing is the real thing. Don’t be gullible in regard to smooth-talking evil. Stay alert like this, and before you know it the God of peace will come down on Satan with both feet, stomping him into the dirt. Enjoy the best of Jesus!"},{"num":21,"verse":"And here are some more greetings from our end. Timothy, my partner in this work, Lucius, and my cousins Jason and Sosipater all said to tell you hello."},{"num":22,"verse":"I, Tertius, who wrote this letter at Paul’s dictation, send you my personal greetings."},{"num":23,"verse":"Gaius, who is host here to both me and the whole church, wants to be remembered to you."},{"num":25,"verse":"All of our praise rises to the One who is strong enough to make you strong, exactly as preached in Jesus Christ, precisely as revealed in the mystery kept secret for so long but now an open book through the prophetic Scriptures. All the nations of the world can now know the truth and be brought into obedient belief, carrying out the orders of God, who got all this started, down to the final detail."},{"num":27,"verse":"All our praise is focused through Jesus on this incomparably wise God! Yes!"}]