[{"num":5,"verse":"For we have known that if our earthly house of the tabernacle may be thrown down, a building from God we have, an house not made with hands -- age-during -- in the heavens,"},{"num":2,"verse":"for also in this we groan, with our dwelling that is from heaven earnestly desiring to clothe ourselves,"},{"num":3,"verse":"if so be that, having clothed ourselves, we shall not be found naked,"},{"num":4,"verse":"for we also who are in the tabernacle do groan, being burdened, seeing we wish not to unclothe ourselves, but to clothe ourselves, that the mortal may be swallowed up of the life."},{"num":5,"verse":"And He who did work us to this self-same thing [is] God, who also did give to us the earnest of the Spirit;"},{"num":6,"verse":"having courage, then, at all times, and knowing that being at home in the body, we are away from home from the Lord, --"},{"num":7,"verse":"for through faith we walk, not through sight --"},{"num":8,"verse":"we have courage, and are well pleased rather to be away from the home of the body, and to be at home with the Lord."},{"num":9,"verse":"Wherefore also we are ambitious, whether at home or away from home, to be well pleasing to him,"},{"num":10,"verse":"for all of us it behoveth to be manifested before the tribunal of the Christ, that each one may receive the things [done] through the body, in reference to the things that he did, whether good or evil;"},{"num":11,"verse":"having known, therefore, the fear of the Lord, we persuade men, and to God we are manifested, and I hope also in your consciences to have been manifested;"},{"num":12,"verse":"for not again ourselves do we recommend to you, but we are giving occasion to you of glorifying in our behalf, that ye may have [something] in reference to those glorifying in face and not in heart;"},{"num":13,"verse":"for whether we were beside ourselves, [it was] to God; whether we be of sound mind -- [it is] to you,"},{"num":14,"verse":"for the love of the Christ doth constrain us, having judged thus: that if one for all died, then the whole died,"},{"num":15,"verse":"and for all he died, that those living, no more to themselves may live, but to him who died for them, and was raised again."},{"num":16,"verse":"So that we henceforth have known no one according to the flesh, and even if we have known Christ according to the flesh, yet now we know him no more;"},{"num":17,"verse":"so that if any one [is] in Christ -- [he is] a new creature; the old things did pass away, lo, become new have the all things."},{"num":18,"verse":"And the all things [are] of God, who reconciled us to Himself through Jesus Christ, and did give to us the ministration of the reconciliation,"},{"num":19,"verse":"how that God was in Christ -- a world reconciling to Himself, not reckoning to them their trespasses; and having put in us the word of the reconciliation,"},{"num":20,"verse":"in behalf of Christ, then, we are ambassadors, as if God were calling through us, we beseech, in behalf of Christ, `Be ye reconciled to God;'"},{"num":21,"verse":"for him who did not know sin, in our behalf He did make sin, that we may become the righteousness of God in him."}]