[{"num":21,"verse":"2 He describeth new Jerusalem descending from heaven, 6 The bride the Lamb’s wife, 12 and the glorious building of the city, 19 garnished with precious stones, 22 whose Temple the Lamb is."},{"num":1,"verse":"And I saw a new heaven, and a new earth: for the first heaven, and the first earth were passed away, and there was no more sea."},{"num":2,"verse":"And I John saw the holy city new Jerusalem come down from God out of heaven, prepared as a bride trimmed for her husband."},{"num":3,"verse":"And I heard a great voice out of heaven, saying, Behold, the Tabernacle of God is with men, and he will dwell with them: and they shall be his people, and God himself shall be their God with them."},{"num":4,"verse":"And God shall wipe away all tears from their eyes, and there shall be no more death, neither sorrow, neither crying, neither shall there be anymore pain: for the first things are passed."},{"num":5,"verse":"And he that sat upon the throne, said, Behold, I make all things new, and he said unto me, Write: for these things are faithful and true."},{"num":6,"verse":"And he said unto me, It is done, I am Alpha and Omega, the beginning and the end: I will give to him that is athirst, of the well of the water of life freely."},{"num":7,"verse":"He that overcometh, shall inherit all things, and I will be his God, and he shall be my Son."},{"num":8,"verse":"But the fearful and unbelieving, and the abominable and murderers, and whoremongers, and sorcerers, and idolaters, and all liars shall have their part in the lake which burneth with fire and brimstone, which is the second death."},{"num":9,"verse":"And there came unto me one of the seven Angels, which had the seven vials full of the seven last plagues, and talked with me, saying, Come: I will show thee the bride the Lamb’s wife."},{"num":10,"verse":"And he carried me away in the spirit to a great and an high mountain, and he showed me that great city, that holy Jerusalem, descending out of heaven from God,"},{"num":11,"verse":"Having the glory of God, and her shining was like unto a stone most precious, as a jasper stone clear as crystal,"},{"num":12,"verse":"And had a great wall and high, and had twelve gates, and at the gates twelve Angels, and the names written which are the twelve tribes of the children of Israel."},{"num":13,"verse":"On the East part there were three gates, and on the North side three gates, on the South side three gates, and on the West side three gates."},{"num":14,"verse":"And the wall of the city had twelve foundations, and in them the names of the Lamb’s twelve Apostles."},{"num":15,"verse":"And he that walked with me, had a golden reed, to measure the city withal, and the gates thereof, and the wall thereof."},{"num":16,"verse":"And the city lay foursquare, and the length is as large as the breadth of it, and he measured the city with the reed, twelve thousand furlongs: and the length, and the breadth, and the height of it are equal."},{"num":17,"verse":"And he measured the wall thereof an hundred forty and four cubits, by the measure of man, that is, of the Angel."},{"num":18,"verse":"And the building of the wall of it was of jasper: and the city was pure gold, like unto clear glass."},{"num":19,"verse":"And the foundations of the wall of the city were garnished with all manner of precious stones: the first foundation was jasper: the second of Sapphire: the third of a Chalcedony: the fourth of an Emerald:"},{"num":20,"verse":"The fifth of a Sardonyx: the sixth of a Sardius: the seventh of a Chrysolite: the eight of a Beryl: the ninth of a Topaz: the tenth of a Chrysoprase: the eleventh of a Jacinth: the twelfth an Amethyst."},{"num":21,"verse":"And the twelve gates were twelve pearls, and every gate is of one pearl, and the street of the city is pure gold, as shining glass."},{"num":22,"verse":"And I saw no Temple therein: for the Lord God Almighty and the Lamb are the Temple of it."},{"num":23,"verse":"And their city hath no need of the Sun, neither of the Moon to shine in it: for the glory of God did light it: and the Lamb is the light of it."},{"num":24,"verse":"And the people which are saved, shall walk in the light of it: and the kings of the earth shall bring their glory and honor unto it."},{"num":25,"verse":"And the gates of it shall not be shut by day: for there shall be no night there."},{"num":26,"verse":"And the glory and honor of the Gentiles shall be brought unto it."},{"num":27,"verse":"And there shall enter into it none unclean thing, neither whatsoever worketh abomination or lies: but they which are written in the Lamb’s book of life."}]