[{"header":"The New Jerusalem A New World and a New People[a]"},{"header":"Chapter 21"},{"num":2,"verse":"And I saw the holy city, the new Jerusalem, coming down out of heaven from God, like a bride adorned and ready for her husband."},{"num":3,"verse":"And I heard a loud voice proclaim from the throne:"},{"num":5,"verse":"The one seated on the throne then said, “Behold, I am making all things new.” He also said, “Write this down, for these words are trustworthy and true.”"},{"num":6,"verse":"Then he said to me, “It is done. I am the Alpha and the Omega, the Beginning and the End. To those who are thirsty I will give to drink without cost from the spring of life-giving water."},{"num":7,"verse":"“The one who is victorious will inherit these things, and I will be his God and he will be my son."},{"num":8,"verse":"But as for the cowardly, the faithless, the depraved, the murderers, the sexually immoral, the sorcerers, the idolaters, and liars of every kind, their place is the fiery lake of burning sulfur, which is the second death.”"},{"num":9,"verse":"The New Jerusalem. One of the seven angels who had the seven bowls filled with the seven final plagues came forward and said to me, “Come, and I will show you the bride, the wife of the Lamb.”"},{"num":10,"verse":"Then he carried me away in the spirit to the top of a very high mountain and showed me the holy city Jerusalem coming down out of heaven from God."},{"num":11,"verse":"It possessed the glory of God and had the radiance of some priceless jewel, like jasper, clear as crystal."},{"num":12,"verse":"Its wall was of a great height, with twelve gates, and at the gates there were twelve angels. On the gates were written the names of the twelve tribes of Israel."},{"num":13,"verse":"There were three gates to the east, three to the north, three to the south, and three to the west."},{"num":14,"verse":"The city wall had twelve foundation stones, and on them were the names of the twelve apostles of the Lamb."},{"num":15,"verse":"The angel who was speaking to me was carrying a gold measuring rod to measure the city, its gates, and its wall."},{"num":16,"verse":"The city was laid out like a square, with its length and its width identical. He measured the city with his measuring rod: it was fifteen hundred miles in length and width, and equal in height."},{"num":17,"verse":"Then he measured its wall, and it was one hundred and forty-four cubits high by human measurements, which the angel employed."},{"num":18,"verse":"The wall was built of jasper, while the city itself was of pure gold, as bright as clear glass."},{"num":19,"verse":"The foundations of the city wall were adorned with precious stones of every kind. The first of the foundation stones was jasper, the second sapphire, the third turquoise, the fourth emerald,"},{"num":20,"verse":"the fifth onyx, the sixth carnelian, the seventh chrysolite, the eighth beryl, the ninth topaz, the tenth chrysoprase, the eleventh jacinth, and the twelfth amethyst."},{"num":21,"verse":"The twelve gates were twelve pearls, each of the gates fashioned from a single pearl, and the street of the city was pure gold, like transparent glass."},{"num":22,"verse":"I did not see any temple there, for the Lord God Almighty and the Lamb are its temple."},{"num":23,"verse":"And the city had no need for the sun or the moon to shine on it, for it was lit by the glory of God, and its lamp was the Lamb."},{"num":24,"verse":"The nations will walk by its light, and to it the kings of the earth will bring their treasures."},{"num":25,"verse":"The gates of the city will never be shut during the day—and there will be no night there."},{"num":26,"verse":"The nations will come into it bringing their treasures and wealth."},{"num":27,"verse":"However, nothing unclean will ever enter it, nor will anyone who does abominable or deceitful things, but only those who are written in the Lamb’s book of life."}]