[{"header":"All Things New"},{"num":21,"verse":"Then I saw a new heaven and a new earth. The first heaven and the first earth had passed away. There was no more sea. "},{"num":2,"verse":"I saw the Holy City, the new Jerusalem. It was coming down out of heaven from God. It was made ready like a bride is made ready for her husband. "},{"num":3,"verse":"I heard a loud voice coming from heaven. It said, “See! God’s home is with men. He will live with them. They will be His people. God Himself will be with them. He will be their God. "},{"num":4,"verse":"God will take away all their tears. There will be no more death or sorrow or crying or pain. All the old things have passed away.” "},{"num":5,"verse":"Then the One sitting on the throne said, “See! I am making all things new. Write, for these words are true and faithful.” "},{"num":6,"verse":"Then He said to me, “These things have happened! I am the First and the Last. I am the beginning and the end. To anyone who is thirsty, I will give the water of life. It is a free gift. "},{"num":7,"verse":"He who has power and wins will receive these things. I will be his God and he will be My son. "},{"num":8,"verse":"But those who are afraid and those who do not have faith and the sinful-minded people and those who kill other people and those who do sex sins and those who follow witchcraft and those who worship false gods and all those who tell lies will be put into the lake of fire and sulphur. This is the second death.”"},{"header":"The New Jerusalem"},{"num":9,"verse":"Then one of the seven angels who had the seven jars full of the seven last troubles came to me and said, “Come! I will show you the bride, the wife of the Lamb.” "},{"num":10,"verse":"I was carried away in the Spirit by the angel to a very high mountain. He showed me the Holy City of Jerusalem. It was coming out of heaven from God. "},{"num":11,"verse":"It was filled with the shining-greatness of God. It shone like a stone worth much money, like a jasper stone. It was clear like glass. "},{"num":12,"verse":"It had a very high wall, and there were twelve gates. Twelve angels stood by the gates. The names of the twelve family groups of the Jewish nation were written on the gates. "},{"num":13,"verse":"There were three gates on each side. There were three on the east side and three on the north side and three on the south side and three on the west side. "},{"num":14,"verse":"The walls were on twelve stones. The names of the twelve missionaries of the Lamb were written on the stones."},{"num":15,"verse":"The angel had a stick in his hand. It was used to find out how big the city and its gates and the walls were. "},{"num":16,"verse":"He found out that the city was as wide as it was long and it was as high as it was wide. It was as long as a man could walk in fifty days. It was the same each way. "},{"num":17,"verse":"The angel found out that the walls were the same as a man taking seventy-two long steps. The angel used the same way to find out about the city as a man would have used. "},{"num":18,"verse":"The wall was made of jasper. The city was made of pure gold. This gold was as clear as glass. "},{"num":19,"verse":"The city was built on every kind of stone that was worth much money. The first stone was jasper. The second was sapphire. The third was chalcedony. The fourth was emerald. "},{"num":20,"verse":"The fifth was sardonyx. The sixth was sardius. The seventh was chrysolite. The eighth was beryl. The ninth was topaz. The tenth was chrysoprase. The eleventh was jacinth and the twelfth was amethyst. "},{"num":21,"verse":"The twelve gates were twelve pearls. Each gate was made from one pearl. The street of the city was pure gold. It was as clear as glass."},{"num":22,"verse":"I did not see a house of God in the city. The All-powerful Lord God and the Lamb are the house of God in this city. "},{"num":23,"verse":"There is no need for the sun and moon to shine in the city. The shining-greatness of God makes it full of light. The Lamb is its light. "},{"num":24,"verse":"The nations will walk by its light. The kings of the earth will bring their greatness into it. "},{"num":25,"verse":"The gates are open all day. They will never be shut. There will be no night there. "},{"num":26,"verse":"The greatness and honor of all the nations will be brought into it. "},{"num":27,"verse":"Nothing sinful will go into the city. No one who is sinful-minded or tells lies can go in. Only those whose names are written in the Lamb’s book of life can go in."}]