[[],[{"type":"header","content":"Wisdom and Folly Contrasted"},{"type":"poetry","content":"And the day of one’s death better than the day of one’s birth."}],[{"type":"poetry","content":"It is better to go to the house of mourning"},{"type":"poetry","content":"Than to go to the house of feasting,"},{"type":"poetry","content":"For that [day of death] is the end of every man,"},{"type":"poetry","content":"And the living will take it to heart  solemnly ponder its meaning."}],[{"type":"poetry","content":"Sorrow is better than laughter,"},{"type":"poetry","content":"For when a face is sad (deep in thought) the heart may be happy [because it is growing in wisdom]."}],[{"type":"poetry","content":"The heart of the wise [learns when it] is in the house of mourning,"},{"type":"poetry","content":"But the heart of fools is [senseless] in the house of pleasure."}],[{"type":"poetry","content":"It is better to listen to the rebuke of the wise man  pursue wisdom"},{"type":"poetry","content":"Than for one to listen to the song of fools  pursue stupidity."}],[{"type":"poetry","content":"For like the crackling of [burning] thorn bushes under a pot,"},{"type":"poetry","content":"So is the laughter of the fool;"},{"type":"poetry","content":"And this too is vanity (futility)."}],[{"type":"poetry","content":"For oppression makes a wise man foolish,"},{"type":"poetry","content":"And a bribe corrupts the [good judgment of the] heart."}],[{"type":"poetry","content":"The end of a matter is better than its beginning;"},{"type":"poetry","content":"Patience of spirit is better than haughtiness of spirit (pride)."}],[{"type":"poetry","content":"Do not be eager in your heart to be angry,"},{"type":"poetry","content":"For anger dwells in the heart of fools."}],[{"type":"poetry","content":"Do not say, “Why were the old days better than these?”"},{"type":"poetry","content":"For it is not from wisdom that you ask about this."}],[{"type":"poetry","content":"Wisdom along with an inheritance is good"},{"type":"poetry","content":"And an [excellent] advantage for those who see the sun."}],[{"type":"poetry","content":"For wisdom is a protection  money is a protection,"},{"type":"poetry","content":"But the [excellent] advantage of knowledge is that wisdom shields  preserves the lives of its possessors."}],[{"type":"poetry","content":"Consider the work of God:"},{"type":"poetry","content":"Who can make straight what He has bent?"}],[{"type":"poetry","content":"In the day of prosperity be joyful,"},{"type":"poetry","content":"But in the day of adversity consider that"},{"type":"poetry","content":"God has made the one as well as the other,"},{"type":"poetry","content":"So that man will not find out anything  after him."}],[{"type":"prose","content":"I have seen everything during my [fleeting] days of futility; there is a righteous man who perishes in [spite of] his righteousness, and there is a wicked man who lives a long  in [spite of] his wickedness. "}],[{"type":"prose","content":"Do not be excessively righteous [like those given to self-conceit], and do not be overly wise (pretentious)—why should you bring yourself to ruin? "}],[{"type":"prose","content":"Do not be excessively  willfully wicked and do not be a fool. Why should you die before your time? "}],[{"type":"prose","content":"It is good that you take hold of one thing (righteousness) and also not let go of the other (wisdom); for the one who fears  worships God [with awe-filled reverence] will come forth with both of them."}],[{"type":"prose","content":"Wisdom strengthens the wise man more than ten rulers who are in a city. "}],[{"type":"prose","content":"Indeed, there is not a righteous man on earth who  does good and who never sins. "}],[{"type":"prose","content":"Also, do not take seriously everything that is said, so that you will not hear your servant cursing you, "}],[{"type":"prose","content":"for you also know that you too have cursed others many times."}],[{"type":"prose","content":"I have tested all this with wisdom. I said, “I will be wise [independently of God],” but true wisdom was far from me. "}],[{"type":"prose","content":"Whatever has been is far off, deeply remote and exceedingly mysterious. Who can discover it [for it is beyond the grasp of man]? "}],[{"type":"prose","content":"I turned around  directed my heart to know, to investigate and to seek [skillful and godly] wisdom and the reason for things, and to know that wickedness is folly and that foolishness is madness [leading to stupidity and recklessness]. "}],[{"type":"prose","content":"And I discovered that [of all irrational sins none has been so destructive in beguiling one away from God as immoral women for] more bitter than death is the woman whose heart is [composed of] snares and nets, and whose hands are chains. Whoever pleases God will escape from her, but the sinner will be taken captive by her [evil]."}],[{"type":"prose","content":"“Behold, I have discovered this,” says the Preacher, “while  one thing to another to find an explanation, "}],[{"type":"prose","content":"which I am still seeking but have not found. I have found one man among a thousand [who pleases God], but I have not found [such] a woman among all these [a thousand in my harem]. "}],[{"type":"prose","content":"Behold, I have found only this [as a reason]: God made man upright  uncorrupted, but they [both men and women] have sought out many devices [for evil].”"}]]