[{"num":7,"verse":"A good name is better than precious perfume, and the day of death better than the day of one’s birth."},{"num":2,"verse":"It is better to go to the house of mourning than to go to the house of feasting, for that is the end of all men; and the living will lay it to heart."},{"num":3,"verse":"Sorrow is better than laughter, for by the sadness of the countenance the heart is made better and gains gladness."},{"num":4,"verse":"The heart of the wise is in the house of mourning, but the heart of fools is in the house of mirth and sensual joy."},{"num":5,"verse":"It is better for a man to hear the rebuke of the wise than to hear the song of fools."},{"num":6,"verse":"For like the crackling of thorns under a pot, so is the laughter of the fool. This also is vanity (emptiness, falsity, and futility)!"},{"num":7,"verse":"Surely oppression and extortion make a wise man foolish, and a bribe destroys the understanding and judgment."},{"num":8,"verse":"Better is the end of a thing than the beginning of it, and the patient in spirit is better than the proud in spirit."},{"num":9,"verse":"Do not be quick in spirit to be angry or vexed, for anger and vexation lodge in the bosom of fools."},{"num":10,"verse":"Do not say, Why were the old days better than these? For it is not wise or because of wisdom that you ask this."},{"num":11,"verse":"Wisdom is as good as an inheritance, yes, more excellent it is for those [the living] who see the sun."},{"num":12,"verse":"For wisdom is a defense even as money is a defense, but the excellency of knowledge is that wisdom shields and preserves the life of him who has it."},{"num":13,"verse":"Consider the work of God: who can make straight what He has made crooked?"},{"num":14,"verse":"In the day of prosperity be joyful, but in the day of adversity consider that God has made the one side by side with the other, so that man may not find out anything that shall be after him."},{"num":15,"verse":"I have seen everything in the days of my vanity (my emptiness, falsity, vainglory, and futility): there is a righteous man who perishes in his righteousness, and there is a wicked man who prolongs his life in [spite of] his evildoing."},{"num":16,"verse":"Be not [morbidly exacting and externally] righteous overmuch, neither strive to make yourself [pretentiously appear] overwise—why should you [get puffed up and] destroy yourself [with presumptuous self-sufficiency]?"},{"num":17,"verse":"[Although all have sinned] be not wicked overmuch or willfully, neither be foolish—why should you die before your time?"},{"num":18,"verse":"It is good that you should take hold of this and from that withdraw not your hand; for he who [reverently] fears and worships God will come forth from them all."},{"num":19,"verse":"[True] wisdom is a strength to the wise man more than ten rulers or valiant generals who are in the city."},{"num":20,"verse":"Surely there is not a righteous man upon earth who does good and never sins."},{"num":21,"verse":"Do not give heed to everything that is said, lest you hear your servant cursing you—"},{"num":22,"verse":"For often your own heart knows that you have likewise cursed others."},{"num":23,"verse":"All this have I tried and proved by wisdom. I said, I will be wise [independently of God]—but it was far from me."},{"num":24,"verse":"That which is is far off, and that which is deep is very deep—who can find it out [true wisdom independent of the fear of God]?"},{"num":25,"verse":"I turned about [penitent] and my heart was set to know and to search out and to seek [true] wisdom and the reason of things, and to know that wickedness is folly and that foolishness is madness [and what had led me into such wickedness and madness]."},{"num":26,"verse":"And I found that [of all sinful follies none has been so ruinous in seducing one away from God as idolatrous women] more bitter than death is the woman whose heart is snares and nets and whose hands are bands. Whoever pleases God shall escape from her, but the sinner shall be taken by her."},{"num":27,"verse":"Behold, this I have found, says the Preacher, while weighing one thing after another to find out the right estimate [and the reason]—"},{"num":28,"verse":"Which I am still seeking but have not found—one upright man among a thousand have I found, but an upright woman among all those [one thousand in my harem] have I not found."},{"num":29,"verse":"Behold, this is the only [reason for it that] I have found: God made man upright, but they [men and women] have sought out many devices [for evil]."}]