[[],[{"type":"header","content":"Wisdom and Foolishness Contrasted"},{"type":"poetry","content":"And the day of  death  than the day of one’s birth."},{"type":"poetry","content":""}],[{"type":"poetry","content":"It is better to go to a house of mourning"},{"type":"poetry","content":"Than to go to a house of feasting,"},{"type":"poetry","content":"Because that is the end of every person,"},{"type":"poetry","content":"And the living takes  to heart."},{"type":"poetry","content":""}],[{"type":"poetry","content":"Sorrow is better than laughter,"},{"type":"poetry","content":"For when a face is sad a heart may be happy."},{"type":"poetry","content":""}],[{"type":"poetry","content":"The mind of the wise is in the house of mourning,"},{"type":"poetry","content":"While the mind of fools is in the house of pleasure."},{"type":"poetry","content":""}],[{"type":"poetry","content":"It is better to listen to the rebuke of a wise person"},{"type":"poetry","content":"Than for one to listen to the song of fools."},{"type":"poetry","content":""}],[{"type":"poetry","content":"For as the crackling of thorn bushes under a pot,"},{"type":"poetry","content":"So is the laughter of the fool;"},{"type":"poetry","content":"And this too is futility."},{"type":"poetry","content":""}],[{"type":"poetry","content":"For oppression makes a wise person look foolish,"},{"type":"poetry","content":"And a bribe corrupts the heart."},{"type":"poetry","content":""}],[{"type":"poetry","content":"The end of a matter is better than its beginning;"},{"type":"poetry","content":"Patience of spirit is better than arrogance of spirit."},{"type":"poetry","content":""}],[{"type":"poetry","content":"Do not be eager in your spirit to be angry,"},{"type":"poetry","content":"For anger resides in the heart of fools."},{"type":"poetry","content":""}],[{"type":"poetry","content":"Do not say, “Why is it that the former days were better than these?”"},{"type":"poetry","content":"For it is not from wisdom that you ask about this."},{"type":"poetry","content":""}],[{"type":"poetry","content":"Wisdom along with an inheritance is good,"},{"type":"poetry","content":"And an advantage to those who see the sun."},{"type":"poetry","content":""}],[{"type":"poetry","content":"For wisdom is protection  money is protection,"},{"type":"poetry","content":"But the advantage of knowledge is that wisdom keeps its possessors alive."},{"type":"poetry","content":""}],[{"type":"poetry","content":"Consider the work of God,"},{"type":"poetry","content":"For who is able to straighten what He has bent?"},{"type":"poetry","content":""}],[{"type":"poetry","content":"On the day of prosperity be happy,"},{"type":"poetry","content":"But on the day of adversity consider:"},{"type":"poetry","content":"God has made the one as well as the other"},{"type":"poetry","content":"So that a person will not discover anything  after him."}],[{"type":"prose","content":"I have seen everything during my lifetime of futility; there is a righteous person who perishes in his righteousness, and there is a wicked person who prolongs  in his wickedness."}],[{"type":"prose","content":"Do not be excessively righteous, and do not be overly wise. Why should you ruin yourself?"}],[{"type":"prose","content":"Do not be excessively wicked, and do not be foolish. Why should you die before your time?"}],[{"type":"prose","content":"It is good that you grasp one thing while not letting go of the other; for one who fears God comes out with both of them."}],[{"type":"prose","content":"Wisdom strengthens a wise person more than ten rulers who are in a city."}],[{"type":"prose","content":"Indeed, there is not a righteous person on earth who  does good and does not  sin."}],[{"type":"prose","content":"Also, do not take seriously all the words which are spoken, so that you do not hear your servant cursing you,"}],[{"type":"prose","content":"for you know that even you have cursed others many times as well."}],[{"type":"prose","content":"I tested all this with wisdom,  I said, “I will be wise,” but  was far from me."}],[{"type":"prose","content":"What has been is remote and very mysterious. Who can discover it?"}],[{"type":"prose","content":"I directed my mind to know and to investigate, and to seek wisdom and an explanation, and to know the evil of foolishness and the foolishness of insanity."}],[{"type":"prose","content":"And I discovered as more bitter than death the woman whose heart is snares and nets, whose hands are chains. One who is pleasing to God will escape from her, but the sinner will be captured by her."}],[{"type":"prose","content":"“Behold, I have discovered this,” says the Preacher, “ one thing to another to find an explanation,"}],[{"type":"prose","content":"which I am still seeking but have not found. I have found one man among a thousand, but I have not found a woman among all these."}],[{"type":"prose","content":"Behold, I have found only this, that God made people upright, but they have sought out many schemes.”"}]]