[{"header":"Jesus Is Alive"},{"num":28,"verse":"The Sabbath was over, and it was almost daybreak on Sunday when Mary Magdalene and the other Mary went to see the tomb. "},{"num":2,"verse":"Suddenly a strong earthquake struck, and the Lord’s angel came down from heaven. He rolled away the stone and sat on it. "},{"num":3,"verse":"The angel looked as bright as lightning, and his clothes were white as snow. "},{"num":4,"verse":"The guards shook from fear and fell down, as though they were dead."},{"num":5,"verse":"The angel said to the women, “Don’t be afraid! I know you are looking for Jesus, who was nailed to a cross. "},{"num":6,"verse":"He isn’t here! God has raised him to life, just as Jesus said he would. Come, see the place where his body was lying. "},{"num":7,"verse":"Now hurry! Tell his disciples that he has been raised to life and is on his way to Galilee. Go there, and you will see him. That is what I came to tell you.”"},{"num":8,"verse":"The women were frightened and yet very happy, as they hurried from the tomb and ran to tell his disciples. "},{"num":9,"verse":"Suddenly Jesus met them and greeted them. They went near him, held on to his feet, and worshiped him. "},{"num":10,"verse":"Then Jesus said, “Don’t be afraid! Tell my followers to go to Galilee. They will see me there.”"},{"header":"Report of the Guard"},{"num":11,"verse":"While the women were on their way, some soldiers who had been guarding the tomb went into the city. They told the chief priests everything that had happened. "},{"num":12,"verse":"So the chief priests met with the leaders and decided to bribe the soldiers with a lot of money. "},{"num":13,"verse":"They said to the soldiers, “Tell everyone that Jesus' disciples came during the night and stole his body while you were asleep. "},{"num":14,"verse":"If the governor hears about this, we will talk to him. You won’t have anything to worry about.” "},{"num":15,"verse":"The soldiers took the money and did what they were told. The Jewish people still tell each other this story."},{"header":"What Jesus' Followers Must Do"},{"num":16,"verse":"Jesus' eleven disciples went to a mountain in Galilee, where Jesus had told them to meet him. "},{"num":17,"verse":"They saw him and worshiped him, but some of them doubted."},{"num":18,"verse":"Jesus came to them and said:"}]