[{"header":"The Resurrection"},{"num":28,"verse":"Now after the Sabbath, towards the dawn of the first day of the week, Mary Magdalene and the other Mary went to see the tomb."},{"num":2,"verse":"And behold, there was a great earthquake, for an angel of the Lord descended from heaven and came and rolled back the stone and sat on it."},{"num":3,"verse":"His appearance was like lightning, and his clothing white as snow."},{"num":4,"verse":"And for fear of him the guards trembled and became like dead men."},{"num":5,"verse":"But the angel said to the women, “Do not be afraid, for I know that you seek Jesus who was crucified."},{"num":6,"verse":"He is not here, for he has risen, as he said. Come, see the place where he lay."},{"num":7,"verse":"Then go quickly and tell his disciples that he has risen from the dead, and behold, he is going before you to Galilee; there you will see him. See, I have told you.”"},{"num":8,"verse":"So they departed quickly from the tomb with fear and great joy, and ran to tell his disciples."},{"num":9,"verse":"And behold, Jesus met them and said, “Greetings!” And they came up and took hold of his feet and worshipped him."},{"num":10,"verse":"Then Jesus said to them, “Do not be afraid; go and tell my brothers to go to Galilee, and there they will see me.”"},{"header":"The Report of the Guard"},{"num":11,"verse":"While they were going, behold, some of the guard went into the city and told the chief priests all that had taken place."},{"num":12,"verse":"And when they had assembled with the elders and taken counsel, they gave a sufficient sum of money to the soldiers"},{"num":13,"verse":"and said, “Tell people, ‘His disciples came by night and stole him away while we were asleep.’"},{"num":14,"verse":"And if this comes to the governor's ears, we will satisfy him and keep you out of trouble.”"},{"num":15,"verse":"So they took the money and did as they were directed. And this story has been spread among the Jews to this day."},{"header":"The Great Commission"},{"num":16,"verse":"Now the eleven disciples went to Galilee, to the mountain to which Jesus had directed them."},{"num":17,"verse":"And when they saw him they worshipped him, but some doubted."},{"num":18,"verse":"And Jesus came and said to them, “All authority in heaven and on earth has been given to me."}]