[{"num":28,"verse":"Now at the end of the Sabbath, when the first day of the week began to dawn, Mary Magdalene and the other Mary came to see the sepulcher."},{"num":2,"verse":"And behold, there was a great earthquake. For the Angel of the Lord descended from Heaven and came and rolled back the stone from the door and sat upon it."},{"num":3,"verse":"And his face was like lightning. And his clothing white as snow."},{"num":4,"verse":"And for fear of him, the keepers were astonished, and became as dead men."},{"num":5,"verse":"But the angel answered, and said to the women, “Do not fear. For I know that you seek Jesus, Who was crucified."},{"num":6,"verse":"“He is not here. For He is risen, as He said. Come, see the place where the Lord was laid."},{"num":7,"verse":"“And go, quickly, and tell His disciples that He is risen from the dead. And behold, He goes before you into Galilee. There you shall see Him. Lo, I have told you.”"},{"num":8,"verse":"So they quickly departed from the sepulcher, with fear and great joy, and ran to bring His disciples word."},{"num":9,"verse":"And as they went to tell His disciples, behold, Jesus also met them, saying, “Rejoice!” And they came, and took Him by the feet, and worshipped Him."},{"num":10,"verse":"Then Jesus said to them, “Do not be afraid! Go, and tell My brothers, so that they would go into Galilee. And there they shall see Me.”"},{"num":11,"verse":"Now when they had gone, behold, some of the guards came into the city, and reported to the chief priests all the things that had been done."},{"num":12,"verse":"And they gathered together with the elders, and took counsel, and gave considerable money to the soldiers,"},{"num":13,"verse":"saying, “Say, ‘His disciples came by night and stole Him away while we slept.’"},{"num":14,"verse":"“And if this matter comes before the governor to be heard, we will persuade him, so that you need not worry.”"},{"num":15,"verse":"So they took the money and did as they were instructed. And this story is told among the Jews to this day."},{"num":16,"verse":"Then the eleven disciples went into Galilee, and to a mountain where Jesus had directed them."},{"num":17,"verse":"And when they saw Him, they worshipped Him. But some doubted."},{"num":18,"verse":"And Jesus came, and spoke to them, saying, “All power is given to Me, in Heaven, and on Earth."},{"num":19,"verse":"“Go, therefore, and disciple all nations; baptizing them in the Name of the Father, and the Son, and the Holy Ghost;"},{"num":20,"verse":"“teaching them to observe all things, whatever I have commanded you. And lo, I am with you always, until the end of the age. Amen.”"}]