[{"num":9,"verse":"Then He cried also in mine oznayim with a kol gadol (loud voice), saying, Cause them that have charge over the Ir to draw near, even every ish with his keli mashcheh (destroying weapon) in his yad."},{"num":2,"verse":"And, hinei, shishah anashim (six men) came from the derech of the Sha’ar HaElyon, which lieth toward the north, and every ish a keli mapatz (slaughter weapon) of his in his yad; and one ish among them was clothed with linen, with a keset hasofer (writing case) at his side; and they went in, and stood beside the Mizbe’ach HaNechoshet."},{"num":3,"verse":"And the Kavod Elohei Yisroel was gone up from the Keruv (Cherub), whereupon it was, to the miftan HaBeis [HaMikdash] (the Threshold of the Beis HaMikdash). And He called to the ish clothed with linen, which had the keset hasofer at his side;"},{"num":4,"verse":"And Hashem said unto him, Go through the midst of the Ir, through the midst of Yerushalayim, and put a TAV upon the mitzekhot (foreheads) of the anashim that grieve and lament for kol hato’evot that are being done in the midst thereof."},{"num":5,"verse":"And to the others He said in mine hearing, Go ye through the Ir after him [i.e., the man with the scribal kit], and strike down; let not your eye have pity, and do not spare;"},{"num":6,"verse":"Slay utterly zaken (old man) and bochur (young man), betulah, little children, and nashim; but come not near any ish upon whom is the TAV; and begin at My Mikdash. Then they began with the anashim hazekenim which were before the Beis [HaMikdash][1K 4:17]."},{"num":7,"verse":"And He said unto them, Make the Beis [HaMikdash] tameh, and fill the khatzerot (coutyards) with chalalim (slain ones); go ye forth. And they went forth, and slaughtered in the Ir."},{"num":8,"verse":"And it came to pass, while they were slaying them, and I was left, that I fell upon my face, and cried out, and said, Ah, Adonoi Hashem! Wilt Thou destroy kol She’erit Yisroel in Thy pouring out of Thy chemah (wrath, fury) upon Yerushalayim?"},{"num":9,"verse":"Then He said unto me, The avon Bais Yisroel and Yehudah is exceeding great, and HaAretz is full of damim, and the Ir full of injustice; for they say, Hashem hath forsaken Ha’Aretz, and Hashem seeth not."},{"num":10,"verse":"And as for Me, Mine eye shall show no pity, neither will I spare, but I will recompense their derech upon their rosh."},{"num":11,"verse":"And, hinei, the ish clothed with linen, which had the keset ([writing] case) at his side, reported, saying, I have done as Thou hast commanded me."}]