[{"num":19,"verse":"The second lot fell to Simeon, to the tribe of the Simeonites according to their families; and their inheritance lay within that of the people of Judah."},{"num":2,"verse":"And they had for their inheritance: Beersheba or Sheba, Moladah,"},{"num":3,"verse":"Hazarshual, Balah, Ezem,"},{"num":4,"verse":"Eltolad, Bethul, Hormah,"},{"num":5,"verse":"Ziklag, Beth-marcaboth, Hazar-susah,"},{"num":6,"verse":"Beth-lebaoth, and Sharuhen; [making] thirteen cities and their villages;"},{"num":7,"verse":"Ain [with] Rimmon, Ether, and Ashan; [making] four cities and their villages;"},{"num":8,"verse":"And all the villages around these cities as far as Baalath-beer, or Ramah of the Negeb. This was the possession of the Simeonites according to their families."},{"num":9,"verse":"Out of the part assigned to the Judahites was the inheritance of the tribe of Simeon, for the portion of the tribe of Judah was too large for them. Therefore the tribe of Simeon had its inheritance in the midst of Judah’s inheritance."},{"num":10,"verse":"The third lot came up for the tribe of Zebulun according to their families. The border of its inheritance extended to Sarid."},{"num":11,"verse":"Then its boundary went up westward and on to Maralah and reached to Dabbesheth and to the brook east of Jokneam."},{"num":12,"verse":"And it turned from Sarid eastward to the border of Chisloth-tabor and it went out to Daberath and on up to Japhia,"},{"num":13,"verse":"Then passed eastward to Gath-hepher [Jonah’s birthplace] and to Eth-kazin, and went on to Rimmon bending toward Neah."},{"num":14,"verse":"The boundary circled on the north to Hannathon, ending at the Valley of Iphtah-el."},{"num":15,"verse":"Included were Kattath, Nahalal, Shimron, Idalah, and Bethlehem; twelve cities with their villages."},{"num":16,"verse":"This is the inheritance of the people of Zebulun according to their families, these cities with their villages."},{"num":17,"verse":"The fourth lot fell to Issachar, to its people according to their families."},{"num":18,"verse":"Their territory included: Jezreel, Chesulloth, Shunem,"},{"num":19,"verse":"Hapharaim, Shion, Anaharath,"},{"num":20,"verse":"Rabbith, Kishion, Ebez,"},{"num":21,"verse":"Remeth, En-gannim, En-haddah, and Beth-pazzez."},{"num":22,"verse":"The boundary reached to Tabor, Shahazumah, and Beth-shemesh, and ended at the Jordan; sixteen cities with their villages."},{"num":23,"verse":"This is the inheritance of the tribe of Issachar according to their families, the cities and their villages."},{"num":24,"verse":"The fifth lot fell to the tribe of Asher according to their families."},{"num":25,"verse":"Their territory included: Helkath, Hali, Beten, Achshaph,"},{"num":26,"verse":"Allammelech, Amad, and Mishal; and on the west it touched Carmel and Shihor-libnath."},{"num":27,"verse":"Then it turned eastward to Beth-dagon, touching Zebulun and the Valley of Iphtah-el northward to Beth-emek and Neiel, and continued in the north to Cabul,"},{"num":28,"verse":"Ebron, Rehob, Hammon, and Kanah, even to populous Sidon."},{"num":29,"verse":"Then the boundary turned to Ramah, reaching to the fortified city of Tyre; and it turned to Hosah, and ended at the sea—Mahalab, Achzib,"},{"num":30,"verse":"Ummah, Aphek, and Rehob; twenty-two cities with their villages."},{"num":31,"verse":"This is the inheritance of the tribe of Asher according to their families, these cities with their villages."},{"num":32,"verse":"The sixth lot fell to the tribe of Naphtali according to their families."},{"num":33,"verse":"Their boundary ran from Heleph, from the oak in Zaanannim and Adami-nekeb and Jabneel as far as Lakkum; and it ended at the Jordan."},{"num":34,"verse":"Then the boundary turned westward to Aznoth-tabor and went from there to Hukkok, touching Zebulun on the south, Asher on the west, and Judah on the east at the Jordan."},{"num":35,"verse":"The fortified cities included Ziddim, Zer, Hammath, Rakkath, Chinnereth,"},{"num":36,"verse":"Adamah, Ramah, Hazor,"},{"num":37,"verse":"Kedesh, Edrei, En-hazor,"},{"num":38,"verse":"Yiron, Migdal-el, Horem, Beth-anath, and Beth-shemesh; nineteen cities and their villages."},{"num":39,"verse":"This is the inheritance of the tribe of Naphtali according to their families, the cities and their villages."},{"num":40,"verse":"And the seventh lot fell to the tribe of Dan according to their families."},{"num":41,"verse":"The territory of their inheritance included: Zorah, Eshtaol, Ir-shemesh,"},{"num":42,"verse":"Shaalabbin, Aijalon, Ithlah,"},{"num":43,"verse":"Elon, Timnah, Ekron,"},{"num":44,"verse":"Eltekeh, Gibbethon, Baalath,"},{"num":45,"verse":"Jehud, Bene-berak, Gath-rimmon,"},{"num":46,"verse":"Me-jarkon, and Rakkon, with the territory before Joppa."},{"num":47,"verse":"The territory of the tribe of Dan had to be extended [because of the crowding in of the Amorites and Philistines]; so the sons of Dan went up to fight against Leshem (Laish) and took it and smote it with the sword and possessed it and dwelt there, and they called Leshem (Laish) Dan after Dan their [forefather]."},{"num":48,"verse":"This is the inheritance of the tribe of Dan according to their families, these cities with their villages."},{"num":49,"verse":"When they had finished dividing the land for inheritance by their boundaries, the Israelites gave an inheritance among them to Joshua son of Nun."},{"num":50,"verse":"According to the word of the Lord they gave him the city for which he asked—Timnath-serah in the hills of Ephraim. And he built the city and dwelt in it."},{"num":51,"verse":"These are the inheritances which Eleazar the priest, Joshua son of Nun, and the heads of the fathers’ houses of the tribes of Israel distributed by lot in Shiloh before the Lord at the door of the Tent of Meeting. So they finished dividing the land."}]