[{"header":"Land for Simeon"},{"num":19,"verse":"Then Joshua gave all the families in the tribe of Simeon their share of the land. The land they got was inside the area that belonged to Judah."},{"num":2,"verse":"This is the land that was given to that tribe: Beersheba (also called Sheba), Moladah,"},{"num":3,"verse":"Hazar Shual, Balah, Ezem,"},{"num":4,"verse":"Eltolad, Bethul, Hormah,"},{"num":5,"verse":"Ziklag, Beth Marcaboth, Hazar Susah,"},{"num":6,"verse":"Beth Lebaoth, and Sharuhen. There were 13 towns and all the fields around them."},{"num":7,"verse":"They also got the towns of Ain, Rimmon, Ether, and Ashan. There were four towns and all the fields around them."},{"num":8,"verse":"They also got all the fields around the cities as far as Baalath Beer (Ramah in the Negev). So this was the area that was given to the tribe of Simeon. Each family got its land."},{"num":9,"verse":"Simeon’s share of land was within the area that Judah got. The people of Judah had more land than they needed, so the people of Simeon got part of their land."},{"header":"Land for Zebulun"},{"num":10,"verse":"The next tribe to get their land was Zebulun. Each family in Zebulun got the land that was promised to them. The border of Zebulun went as far as Sarid."},{"num":11,"verse":"Then the border went west to Maralah and just touched Dabbesheth. Then it went along the ravine near Jokneam."},{"num":12,"verse":"Then the border turned to the east. It went from Sarid to Kisloth Tabor. Then it went on to Daberath and to Japhia."},{"num":13,"verse":"Then the border continued to the east to Gath Hepher and Eth Kazin. It ended at Rimmon. Then it turned and went to Neah."},{"num":14,"verse":"At Neah the border turned again, went north to Hannathon, and then continued to the Valley of Iphtah El."},{"num":15,"verse":"Inside this border were the cities of Kattath, Nahalal, Shimron, Idalah, and Bethlehem. In all, there were twelve towns and all the fields around them."},{"num":16,"verse":"So these are the towns and fields around them that were given to Zebulun. Each family in Zebulun got its part of the land."},{"header":"Land for Issachar"},{"num":17,"verse":"The fourth part of the land was given to the tribe of Issachar. Each family in that tribe got its part of the land."},{"num":18,"verse":"This is the land that was given to that tribe: Jezreel, Kesulloth, Shunem,"},{"num":19,"verse":"Hapharaim, Shion, Anaharath,"},{"num":20,"verse":"Rabbith, Kishion, Ebez,"},{"num":21,"verse":"Remeth, En Gannim, En Haddah, and Beth Pazzez."},{"num":22,"verse":"The border of their land touched Tabor, Shahazumah, and Beth Shemesh. It ended at the Jordan River. In all, there were 16 towns and the fields around them."},{"num":23,"verse":"These cities and towns were part of the land that was given to the tribe of Issachar. Each family got its part of the land."},{"header":"Land for Asher"},{"num":24,"verse":"The fifth part of land was given to the tribe of Asher. Each family in that tribe got its part of the land."},{"num":25,"verse":"This is the land that was given to that tribe: Helkath, Hali, Beten, Acshaph,"},{"num":26,"verse":"Allammelech, Amad, and Mishal."},{"num":27,"verse":"Then the border turned to the east. It went to Beth Dagon. The border touched Zebulun and the Valley of Iphtah El. Then it went north of Beth Emek and Neiel. It passed north of Cabul."},{"num":28,"verse":"Then the border went to Abdon, Rehob, Hammon, and Kanah. It continued to the Greater Sidon area."},{"num":29,"verse":"Then the border went back south to Ramah. It continued to the strong city of Tyre. Then the border turned and went to Hosah. It ended at the sea, near Aczib,"},{"num":30,"verse":"Ummah, Aphek, and Rehob."},{"num":31,"verse":"These cities and the fields around them were given to the tribe of Asher. Each family in that tribe got its share of the land."},{"header":"Land for Naphtali"},{"num":32,"verse":"The sixth part of land was given to the tribe of Naphtali. Each family in that tribe got its share of the land."},{"num":33,"verse":"The border of their land started at the large tree near Zaanannim. This is near Heleph. Then the border went through Adami Nekeb and Jabneel. It continued to Lakkum and ended at the Jordan River."},{"num":34,"verse":"Then the border went to the west through Aznoth Tabor. It ended at Hukkok. The southern border touched Zebulun and the western border touched Asher. The border went to Judah, at the Jordan River to the east."},{"num":35,"verse":"There were some very strong cities inside these borders. They were Ziddim, Zer, Hammath, Rakkath, Kinnereth,"},{"num":36,"verse":"Adamah, Ramah, Hazor,"},{"num":37,"verse":"Kedesh, Edrei, En Hazor,"},{"num":38,"verse":"Iron, Migdal El, Horem, Beth Anath, and Beth Shemesh. In all, there were 19 towns and all the fields around them."},{"num":39,"verse":"These cities and the fields around them were given to the tribe of Naphtali. Each family in that tribe got its land."},{"header":"Land for Dan"},{"num":40,"verse":"Then land was given to the tribe of Dan. Each family in that tribe got its land."},{"num":41,"verse":"This is the land that was given to them: Zorah, Eshtaol, Ir Shemesh,"},{"num":42,"verse":"Shaalabbin, Aijalon, Ithlah,"},{"num":43,"verse":"Elon, Timnah, Ekron,"},{"num":44,"verse":"Eltekeh, Gibbethon, Baalath,"},{"num":45,"verse":"Jehud, Bene Berak, Gath Rimmon,"},{"num":46,"verse":"Me Jarkon, Rakkon, and the area near Joppa."},{"num":47,"verse":"But the people of Dan had trouble taking their land. There were strong enemies there and the people of Dan could not easily defeat them. So the people of Dan went to the northern part of Israel and fought against Laish. They defeated Laish and killed the people who lived there. So the people of Dan lived in the town of Laish. They changed the name to Dan because that was the name of the father of their tribe."},{"num":48,"verse":"All these cities and fields around them were given to the tribe of Dan. Each family got its share of the land."},{"header":"Land for Joshua"},{"num":49,"verse":"So the leaders finished dividing the land and giving it to the different tribes. After they finished, all the Israelites decided to give Joshua son of Nun some land too. This was land that was promised to him."},{"num":50,"verse":"The Lord had commanded that he get this land. So they gave Joshua the town of Timnath Serah in the hill country of Ephraim. This was the town that Joshua told them he wanted. So he built the town stronger and lived there."},{"num":51,"verse":"All these lands were given to the different tribes of Israel. Eleazar the priest, Joshua son of Nun, and the leaders of each tribe met together at Shiloh to divide the land. They met before the Lord at the entrance of the Meeting Tent. So they finished dividing the land."}]