[{"header":"Land for Simeon"},{"num":19,"verse":"The second part of the land was given to the tribe of Simeon. Each family group received some of the land. It was inside the area of Judah. "},{"num":2,"verse":"They received Beersheba (also called Sheba), Moladah, "},{"num":3,"verse":"Hazar Shual, Balah, Ezem, "},{"num":4,"verse":"Eltolad, Bethul and Hormah. "},{"num":5,"verse":"They also received Ziklag, Beth Marcaboth, Hazar Susah, "},{"num":6,"verse":"Beth Lebaoth and Sharuhen. There were 13 towns and all their fields."},{"num":7,"verse":"They also received the towns of Ain, Rimmon, Ether and Ashan. There were 4 towns and all their fields. "},{"num":8,"verse":"They also received all the very small areas with people living in them as far as Baalath Beer. (This is the same as Ramah in southern Canaan.) So these were the lands given to the tribe of Simeon. Each family group received some of the land. "},{"num":9,"verse":"The land of the Simeonites was taken from part of the land of Judah. Judah had much more land than they needed. So the Simeonites received part of their land."},{"header":"Land for Zebulun"},{"num":10,"verse":"The third part of the land was given to the tribe of Zebulun. Each family group of Zebulun received some of the land. The border of Zebulun went as far as Sarid. "},{"num":11,"verse":"Then it went west to Maralah and came near Dabbesheth. Then it went near Jokneam. "},{"num":12,"verse":"Then it turned to the east. It went from Sarid to the area of Kisloth Tabor. From there it went on to Daberath and to Japhia. "},{"num":13,"verse":"It continued eastward to Gath Hepher and Eth Kazin. Then it ended at Rimmon. Then the border turned and went toward Neah. "},{"num":14,"verse":"At Neah it turned again and went to the north. It went to Hannathon and continued to the Valley of Iphtah El. "},{"num":15,"verse":"Inside this border were the cities of Kattath, Nahalal, Shimron, Idalah and Bethlehem. There were 12 towns and all their fields."},{"num":16,"verse":"So these are the towns and the areas that were given to Zebulun. Each family group received some of the land."},{"header":"Land for Issachar"},{"num":17,"verse":"The fourth part of the land was given to the tribe of Issachar. Each family group of Issachar received some of the land. "},{"num":18,"verse":"Their land included Jezreel, Kesulloth, Shunem, "},{"num":19,"verse":"Hapharaim, Shion and Anaharath; "},{"num":20,"verse":"Rabbith, Kishion, Ebez, "},{"num":21,"verse":"Remeth, En Gannim, En Haddah and Beth Pazzez."},{"num":22,"verse":"The border of their land touched the area called Tabor, Shahazumah and Beth Shemesh. It stopped at the Jordan River. There were 16 towns and their fields."},{"num":23,"verse":"These cities and towns were part of the land that was given to the tribe of Issachar. Each family group received part of this land."},{"header":"Land for Asher"},{"num":24,"verse":"The fifth part of the land was given to the tribe of Asher. Each family group of Asher received some of the land. "},{"num":25,"verse":"Their land included Helkath, Hali, Beten, Acshaph, "},{"num":26,"verse":"Allammelech, Amad and Mishal."},{"num":27,"verse":"Then it turned toward the east. It went to Beth Dagon. It touched Zebulun and the Valley of Iphtah El. Then it went north of Beth Emek and Neiel. It passed north to Cabul. "},{"num":28,"verse":"Then it went to Abdon, Rehob, Hammon and Kanah. It continued to Greater Sidon. "},{"num":29,"verse":"Then the border went back south toward Ramah. It continued to the strong, walled city of Tyre. Then it turned and went toward Hosah. It ended at the sea. This was in the area of Aczib, "},{"num":30,"verse":"Ummah, Aphek and Rehob. There were 22 towns and their fields."},{"num":31,"verse":"These cities and their fields were part of the land that was given to the tribe of Asher. Each family group in that tribe received some of this land."},{"header":"Land for Naphtali"},{"num":32,"verse":"The sixth part of the land was given to the tribe of Naphtali. Each family group of Naphtali received some of the land. "},{"num":33,"verse":"The border of their land started at the large tree in the area of Zaanannim. This is near Heleph. Then it went through Adami Nekeb and Jabneel. It continued to the area of Lakkum and ended at the Jordan River. "},{"num":34,"verse":"Then it went to the west through Aznoth Tabor. It stopped at Hukkok. It went to the area of Zebulun on the south. And it went to the area of Asher on the west. It went to Judah, at the Jordan River, on the east. "},{"num":35,"verse":"There were some strong, walled cities inside these borders. Those cities were Ziddim, Zer, Hammath, Rakkath and Kinnereth; "},{"num":36,"verse":"Adamah, Ramah, Hazor, "},{"num":37,"verse":"Kedesh, Edrei and En Hazor; "},{"num":38,"verse":"Iron, Migdal El, Horem, Beth Anath and Beth Shemesh. There were 19 towns and all their fields."},{"num":39,"verse":"The cities and the towns around them were in the land that was given to the tribe of Naphtali. Each family group in that tribe got some of this land."},{"header":"Land for Dan"},{"num":40,"verse":"The seventh part of the land was given to the tribe of Dan. Each family group of Dan received some of the land. "},{"num":41,"verse":"Their land included Zorah, Eshtaol, Ir Shemesh, "},{"num":42,"verse":"Shaalabbin, Aijalon and Ithlah; "},{"num":43,"verse":"Elon, Timnah, Ekron, "},{"num":44,"verse":"Eltekeh, Gibbethon, Baalath, "},{"num":45,"verse":"Jehud, Bene Berak and Gath Rimmon; "},{"num":46,"verse":"Me Jarkon, Rakkon and the area near Joppa."},{"num":47,"verse":"(But the Danites had trouble taking their land. There were strong enemies there. And the Danites could not easily defeat them. So the Danites went and fought against Leshem. They defeated Leshem and killed the people who lived there. So the Danites lived in the town of Leshem. They changed its name to Dan because he was the father of their tribe.) "},{"num":48,"verse":"All of these cities and towns were given to the tribe of Dan. Each family group got part of this land."},{"header":"Land for Joshua"},{"num":49,"verse":"So the Israelite leaders finished dividing the land and giving it to the different tribes. After they finished, all the Israelites decided to give Joshua son of Nun some land, too. This was land that had been promised to him. "},{"num":50,"verse":"The Lord had commanded that he be given this land. So they gave Joshua the town of Timnath Serah in the mountains of Ephraim. This was the town that Joshua told them he wanted. So he built up the town and lived there."},{"num":51,"verse":"So all of these lands were given to the different tribes of Israel. Eleazar the priest, Joshua son of Nun and the leaders of each tribe worked together. They divided up the land while they were at Shiloh. They met before the Lord at the entrance to the Meeting Tent to do this. Now they had finished dividing the land."}]