[{"num":19,"verse":"¶ And the second lot came forth to Simeon, for the tribe of the sons of Simeon according to their families; and their inheritance was within the inheritance of the sons of Judah."},{"num":2,"verse":"And they had in their inheritance Beersheba or Sheba, Moladah,"},{"num":3,"verse":"Hazarshual, Balah, Azem,"},{"num":4,"verse":"Eltolad, Bethul, Hormah,"},{"num":5,"verse":"Ziklag, Bethmarcaboth, Hazarsusah,"},{"num":6,"verse":"Bethlebaoth, and Sharuhen: thirteen cities and their villages;"},{"num":7,"verse":"Ain, Remmon, Ether, and Ashan: four cities and their villages,"},{"num":8,"verse":"with all the villages that were round about these cities unto Baalathbeer, which is Ramath of the Negev. This is the inheritance of the tribe of the sons of Simeon according to their families."},{"num":9,"verse":"Out of the portion of the sons of Judah was taken the inheritance of the sons of Simeon; for the part of the sons of Judah was too much for them; therefore, the sons of Simeon had their inheritance within the inheritance of Judah."},{"num":10,"verse":"¶ The third lot came up for the sons of Zebulun according to their families, and the border of their inheritance was unto Sarid."},{"num":11,"verse":"And their border goes up towards the sea and to Maralah and reaches unto Dabbasheth and from there comes to the river that is before Jokneam,"},{"num":12,"verse":"and turning from Sarid eastward toward the sunrising to the border of Chislothtabor and then goes out to Daberath and up to Japhia,"},{"num":13,"verse":"and from there passes eastward toward the sunrising to Gittahhepher, to Ittahkazin, and goes out to Remmonmethoar around Neah;"},{"num":14,"verse":"and from here this border turns to the north to Hannathon, coming out in the valley of Jiphthahel"},{"num":15,"verse":"and including Kattath, Nahallal, Shimron, Idalah, and Bethlehem: twelve cities with their villages."},{"num":16,"verse":"This is the inheritance of the sons of Zebulun according to their families, these cities with their villages."},{"num":17,"verse":"¶ And the fourth lot came out to Issachar, for the sons of Issachar according to their families."},{"num":18,"verse":"And their border was Jezreel, Chesulloth, Shunem,"},{"num":19,"verse":"Hapharaim, Shion, Anaharath,"},{"num":20,"verse":"Rabbith, Kishion, Abez,"},{"num":21,"verse":"Remeth, Engannim, Enhaddah, and Bethpazzez;"},{"num":22,"verse":"and this border reaches to Tabor, and Shahazimah, and Bethshemesh; and their border comes out to the Jordan; sixteen cities with their villages."},{"num":23,"verse":"This is the inheritance of the tribe of the sons of Issachar according to their families, these cities with their villages."},{"num":24,"verse":"¶ And the fifth lot came out for the tribe of the sons of Asher according to their families."},{"num":25,"verse":"And their border was Helkath, Hali, Beten, Achshaph,"},{"num":26,"verse":"Alammelech, Amad, and Misheal, and reaches to Carmel westward and to Shihorlibnath"},{"num":27,"verse":"and turns toward the sunrising to Bethdagon and reaches to Zebulun and to the valley of Jiphthahel to the north, to Bethemek, and to Neiel, and goes out to Cabul on the left hand,"},{"num":28,"verse":"and includes Abran, {Hebron} Rehob, Hammon, and Kanah, even unto great Zidon;"},{"num":29,"verse":"and this border turns from there to Horma {Ramah} and to the strong city of Zor; {Tyre} and this border turns to Hosah and comes out to the sea from the stronghold of Achzib,"},{"num":30,"verse":"including Ummah, Aphek, and Rehob: twenty-two cities with their villages."},{"num":31,"verse":"This is the inheritance of the tribe of the sons of Asher according to their families, these cities with their villages."},{"num":32,"verse":"¶ The sixth lot came out to the sons of Naphtali, for the sons of Naphtali according to their families."},{"num":33,"verse":"And their border was from Heleph, Allon, Zaanannim, Adami, Nekeb, and Jabneel, unto Lakum, and comes out at the Jordan,"},{"num":34,"verse":"and turning westward this border goes to Aznothtabor and passes from there to Hukkok and reaches to Zebulun towards the Negev and reaches to Asher on the west side and to Judah upon the Jordan toward the sunrising."},{"num":35,"verse":"And the strong cities are Ziddim, Zer, Hammath, Rakkath, Chinnereth,"},{"num":36,"verse":"Adamah, Ramah, Hazor,"},{"num":37,"verse":"Kedesh, Edrei, Enhazor,"},{"num":38,"verse":"Iron, Migdalel, Horem, Bethanath, and Bethshemesh: nineteen cities with their villages."},{"num":39,"verse":"This is the inheritance of the tribe of the sons of Naphtali according to their families, these cities with their villages."},{"num":40,"verse":"¶ And the seventh lot came out for the tribe of the sons of Dan according to their families."},{"num":41,"verse":"And the border of their inheritance was Zorah, Eshtaol, Irshemesh,"},{"num":42,"verse":"Shaalabbin, Ajalon, Jethlah,"},{"num":43,"verse":"Elon, Thimnathah, Ekron,"},{"num":44,"verse":"Eltekeh, Gibbethon, Baalath,"},{"num":45,"verse":"Jehud, Beneberak, Gathrimmon,"},{"num":46,"verse":"Mejarkon, Rakkon, with the border before Joppa."},{"num":47,"verse":"And the border of the sons of Dan went out too little for them; therefore, the sons of Dan went up to fight against Leshem and took it and smote it with the edge of the sword and possessed it and dwelt therein and called Leshem, Dan, after the name of Dan their father."},{"num":48,"verse":"This is the inheritance of the tribe of the sons of Dan according to their families, these cities with their villages."},{"num":49,"verse":"¶ Thus they finished dividing the land in inheritance by their borders, and the sons of Israel gave an inheritance to Joshua the son of Nun in their midst."},{"num":50,"verse":"According to the word of the LORD they gave him the city which he asked for, which was Timnathserah in mountain of Ephraim; and he rebuilt the city and dwelt therein."},{"num":51,"verse":"These are the inheritances, which Eleazar the priest and Joshua, the son of Nun, and the heads of the fathers of the tribes of the sons of Israel, divided for an inheritance by lot in Shiloh before the LORD, at the door of the tabernacle of the testimony. So they finished dividing the land."}]