[{"header":"The Lord Returns to the Temple"},{"num":43,"verse":"The man took me to the gate that faces east, "},{"num":2,"verse":"and there I saw coming from the east the dazzling light of the presence of the God of Israel. God's voice sounded like the roar of the sea, and the earth shone with the dazzling light. "},{"num":3,"verse":"This vision was like the one I had seen when God came to destroy Jerusalem, and the one I saw by the Chebar River. Then I threw myself face downward on the ground. "},{"num":4,"verse":"The dazzling light passed through the east gate and went into the Temple."},{"num":5,"verse":"The Lord's spirit lifted me up and took me into the inner courtyard, where I saw that the Temple was filled with the glory of the Lord. "},{"num":6,"verse":"The man stood beside me there, and I heard the Lord speak to me out of the Temple: "},{"num":7,"verse":"“Mortal man, here is my throne. I will live here among the people of Israel and rule them forever. Neither the people of Israel nor their kings will ever again disgrace my holy name by worshiping other gods or by burying the corpses of their dead kings. "},{"num":8,"verse":"The kings built the doorsills and doorposts of their palace right against the doorsills and doorposts of my Temple, so that there was only a wall between us. They disgraced my holy name by all the disgusting things they did, and so in my anger I destroyed them. "},{"num":9,"verse":"Now they must stop worshiping other gods and remove the corpses of their kings. If they do, I will live among them forever.”"},{"num":10,"verse":"And the Lord continued, “Mortal man, tell the people of Israel about the Temple, and let them study its plan. Make them ashamed of their sinful actions. "},{"num":11,"verse":"Then if they are ashamed of what they have done, explain the plan of the Temple to them: its design, its entrances and exits, its shape, the arrangement of everything, and all its rules and regulations. Write all this down for them so that they can see how everything is arranged and can carry out all the rules. "},{"num":12,"verse":"This is the law of the Temple: All the area surrounding it on the top of the mountain is sacred and holy.”"},{"header":"The Altar"},{"num":13,"verse":"These are the measurements of the altar, using the same unit of measure as in measuring the Temple. All around the base of the altar there was a gutter 20 inches deep and 20 inches wide, with a rim at the outside edge 10 inches high. "},{"num":14,"verse":"The lowest section of the altar, from the top of the base, was 4 feet high. The next section was set back from the edge 20 inches all around, and was 7 feet high. The section after that was also set back from the edge 20 inches all around. "},{"num":15,"verse":"This top section, on which the sacrifices were burned, was also 7 feet high. The projections on the four corners were higher than the rest of the top. "},{"num":16,"verse":"The top of the altar was a square, 20 feet on each side. "},{"num":17,"verse":"The middle section was also a square, 24 feet on each side, with a rim at the outside edge 10 inches high. (The gutter was 20 inches wide.) The steps going up the altar were on the east side."},{"header":"The Consecration of the Altar"},{"num":18,"verse":"The Sovereign Lord said to me, “Mortal man, listen to what I tell you. When the altar is built, you are to dedicate it by burning sacrifices on it and by sprinkling on it the blood of the animals that were sacrificed. "},{"num":19,"verse":"Those priests belonging to the tribe of Levi who are descended from Zadok are the only ones who are to come into my presence to serve me. I, the Sovereign Lord, command this. You will give them a young bull to offer as a sacrifice for sin. "},{"num":20,"verse":"You are to take some of its blood and put it on the projections on the top corners of the altar, on the corners of the middle section of the altar, and all around its edges. In this way you will purify the altar and consecrate it. "},{"num":21,"verse":"You are to take the bull that is offered as a sacrifice for sin and burn it at the specified place outside the Temple area. "},{"num":22,"verse":"The next day you are to take a male goat without any defects and offer it as a sacrifice for sin. Purify the altar with its blood the same way you did with the bull. "},{"num":23,"verse":"When you have finished doing that, take a young bull and a young ram, both of them without any defects, "},{"num":24,"verse":"and bring them to me. The priests will sprinkle salt on them and burn them as an offering to me. "},{"num":25,"verse":"Each day for seven days you are to offer a goat, a bull, and a ram as sacrifices for sin. All of them must be without any defects. "},{"num":26,"verse":"For seven days the priests are to consecrate the altar and make it ready for use. "},{"num":27,"verse":"When the week is over, the priests are to begin offering on the altar the burnt offerings and the fellowship offerings of the people. Then I will be pleased with all of you. I, the Sovereign Lord, have spoken.”"}]