[{"num":43,"verse":"2 He seeth the glory of God going into the Temple, from whence it had before departed. 7 He mentioneth the idolatry of the children of Israel, for the which they were consumed and brought to naught. 9 He is commanded to call them again to repentance."},{"num":1,"verse":"Afterward he brought me to the gate even the gate that turneth toward the East."},{"num":2,"verse":"And behold, the glory of the God of Israel, came from out of the East, whose voice was like a noise of great waters, and the earth was made light with his glory."},{"num":3,"verse":"And the vision which I saw was like the vision, even as the vision that I saw when I came to destroy the city: and the visions were like the vision that I saw by the river Chebar, and I fell upon my face."},{"num":4,"verse":"And the glory of the Lord came into the house by the way of the gate, whose prospect is toward the East."},{"num":5,"verse":"So the Spirit took me up and brought me into the inner court, and behold, the glory of the Lord filled the house."},{"num":6,"verse":"And I heard one speaking unto me out of the house: and there stood a man by me,"},{"num":7,"verse":"Which said unto me, Son of man this place is my throne, and the place of the soles of my feet, whereas I will dwell among the children of Israel forever, and the house of Israel shall no more defile mine holy Name, neither they, nor their kings by their fornication, nor by the carcasses of their kings in their high places."},{"num":8,"verse":"Albeit they set their thresholds by my thresholds, and their posts by my posts (for there was but a wall between me and them) yet have they defiled mine holy Name with their abominations, that they have committed: wherefore I have consumed them in my wrath."},{"num":9,"verse":"Now therefore let them put away their fornication, and the carcasses of their kings far from me, and I will dwell among them forever."},{"num":10,"verse":"¶ Thou son of man, show this House to the house of Israel, that they may be ashamed of their wickedness, and let them measure the pattern."},{"num":11,"verse":"And if they be ashamed of all that they have done, show them the form of the house, and the pattern thereof, and the going out thereof, and the coming in thereof, and the whole fashion thereof, and all the ordinances thereof, and all the figures thereof, and all the laws thereof: and write it in their sight, that they may keep the whole fashion thereof, and all the ordinances thereof, and do them."},{"num":12,"verse":"This is the description of the house, It shall be upon the top of the mount: all the limits thereof round about shall be most holy. Behold, this is the description of the house."},{"num":13,"verse":"And these are the measures of the Altar, after the cubits, the cubit is a cubit, and an hand breadth, even the bottom shall be a cubit, and the breadth a cubit, and the border thereof by the edge thereof round about shall be a span: and this shall be the height of the Altar."},{"num":14,"verse":"And from the bottom which toucheth the ground to the lower piece shall be two cubits and the breadth one cubit, and from the little piece to the great piece shall be four cubits, and the breadth one cubit."},{"num":15,"verse":"So the altar shall be four cubits, and from the altar upward shall be four horns."},{"num":16,"verse":"And the altar shall be twelve cubits long and twelve broad, and foursquare in the four corners thereof."},{"num":17,"verse":"And the frame shall be fourteen cubits long, and fourteen broad in the foursquare corners thereof, and the border about it shall be half a cubit, and the bottom thereof shall be a cubit about, and the steps thereof shall be turned toward the East."},{"num":18,"verse":"¶ And he said unto me, Son of man, thus saith the Lord God, These are the ordinances of the altar in the day when they shall make it to offer the burnt offering thereon, and to sprinkle blood thereon."},{"num":19,"verse":"And thou shalt give to the Priests, and to the Levites that be of the seed of Zadok, which approach unto me, to minister unto me, saith the Lord God, a young bullock for a sin offering."},{"num":20,"verse":"And thou shalt take of the blood thereof, and put it on the four horns of it, and on the four corners of the frame, and upon the border round about: thus shalt thou cleanse it, and reconcile it."},{"num":21,"verse":"Thou shalt take the bullock also of the sin offering, and burn it in the appointed place of the house without the Sanctuary."},{"num":22,"verse":"But the second day thou shalt offer an he goat without blemish for a sin offering, and they shall cleanse the altar, as they did cleanse it with the bullock."},{"num":23,"verse":"When thou hast made an end of cleansing it, thou shalt offer a young bullock without blemish, and a ram out of the flock without blemish."},{"num":24,"verse":"And thou shalt offer them before the Lord, and the Priests shall cast salt upon them, and they shall offer them for a burnt offering unto the Lord."},{"num":25,"verse":"Seven days shalt thou prepare every day an he goat for a sin offering: they shall also prepare a young bullock and a ram out of the flock without blemish."},{"num":26,"verse":"Thus shall they seven days purify the altar, and cleanse it, and consecrate it."},{"num":27,"verse":"And when these days are expired upon the eighth day and so forth, the Priests shall make your burnt offerings upon the altar, and your peace offerings, and I will accept you, saith the Lord God."}]