[{"num":43,"verse":"¶ Afterward he brought me to the gate, even the gate that looks toward the east:"},{"num":2,"verse":"And, behold, the glory of the God of Israel that was coming from the east; and his noise was like the noise of many waters: and the earth shined with his glory."},{"num":3,"verse":"And it was according to the appearance of the vision which I saw, even according to the vision that I saw when I came to destroy the city; and the visions were like the vision that I saw by the river Chebar; and I fell upon my face."},{"num":4,"verse":"And the glory of the LORD came into the house by the way of the gate facing toward the east."},{"num":5,"verse":"So the Spirit took me up and brought me into the inner court; and, behold, the glory of the LORD filled the house."},{"num":6,"verse":"And I heard him speaking unto me out of the house; and the man stood by me."},{"num":7,"verse":"¶ And he said unto me, Son of man, this is the place of my throne, and the place of the soles of my feet, in which I will dwell in the midst of the sons of Israel for ever, and my holy name, the house of Israel shall no longer defile, neither they, nor their kings, by their whoredom, nor by the carcasses of their kings in their altars."},{"num":8,"verse":"In their setting of their threshold by my threshold, and their post by my post, and a wall between me and them, they have even defiled my holy name by their abominations that they have committed; therefore I have consumed them in my anger."},{"num":9,"verse":"Now let them put away their whoredom, and the carcasses of their kings, far from me, and I will dwell in the midst of them for ever."},{"num":10,"verse":"Thou son of man, show this house to the house of Israel that they may be ashamed of their iniquities; and let them understand the pattern."},{"num":11,"verse":"And if they are ashamed of all that they have done, show them the form of the house, and its pattern, and the goings out thereof, and the comings in thereof, and all its figures, and all its descriptions, and all its paintings, and all its laws; and write it in their sight that they may keep the whole form thereof and all the ordinances thereof and do them."},{"num":12,"verse":"This is the law of the house; Upon the top of the mountain it shall be built; the whole limit thereof round about shall be most holy. Behold, this is the law of the house."},{"num":13,"verse":"¶ And these are the measures of the altar in cubits: The cubit is a cubit and a hand breadth; the middle rim, one cubit, and the breadth a cubit, and the border thereof by the edge thereof round about of a span. This shall be the high bottom of the altar."},{"num":14,"verse":"And from the middle rim of the ground even to the lower settle, two cubits, and the breadth one cubit; and from the lesser settle to the greater settle, four cubits, and the breadth a cubit."},{"num":15,"verse":"So the altar, of four cubits; and above the altar, four horns."},{"num":16,"verse":"And the altar was twelve cubits long, twelve broad, square on its four sides."},{"num":17,"verse":"And the patio was fourteen cubits long and fourteen broad on all four sides; and the border about it was half a cubit; and the middle which had a rim of a cubit on all sides; and its stairs were toward the east."},{"num":18,"verse":"And he said unto me, Son of man, thus hath the Lord GOD said: These are the ordinances of the altar in the day when they shall make it, to offer burnt offerings thereon, and to sprinkle blood thereon."},{"num":19,"verse":"And thou shalt give to the priests the Levites that be of the seed of Zadok, which approach unto me, to minister unto me, said the Lord GOD, a young bullock as sin."},{"num":20,"verse":"And thou shalt take of its blood and put it on the four horns of the altar and on the four corners of the patio and upon the border round about: thus shalt thou remove the sin and reconcile it."},{"num":21,"verse":"Then thou shalt take the bullock of the sin and burn it according to the law of the house, outside the sanctuary."},{"num":22,"verse":"And on the second day thou shalt offer a he goat without blemish as sin; and they shall remove the sin from the altar, as they removed it with the bullock."},{"num":23,"verse":"When thou hast finished removing the sin, thou shalt offer a young bullock without blemish and a ram out of the flock without blemish."},{"num":24,"verse":"And thou shalt offer them before the LORD, and the priests shall cast salt upon them, and they shall offer them up for a burnt offering unto the LORD."},{"num":25,"verse":"Seven days shalt thou prepare each day a he goat as sin; and a young bullock and a ram out of the flock, without blemish, shall they sacrifice."},{"num":26,"verse":"Seven days shall they atone the altar, and they shall cleanse it; and they shall extend their hands."},{"num":27,"verse":"And when these days are expired, it shall be, that upon the eighth day, and so forward, the priests shall sacrifice your burnt offerings upon the altar, and your peace offerings; and I will accept you, said the Lord GOD."}]