[{"num":43,"verse":"Afterward he [the angelic being] brought me to the sha’ar, even the sha’ar that looketh toward the east;"},{"num":2,"verse":"And, hinei, the Kavod Elohei Yisroel came from the derech of the east; and His voice was like a kol mayim rabbim and ha’aretz was radiant with His Kavod."},{"num":3,"verse":"And it was according to the appearance of the vision which I saw, even according to the vision that I saw when He came to destroy the Ir; and the visions were like the vision that I saw by the Nahar Kevar; and I fell upon my face."},{"num":4,"verse":"And the Kavod Hashem came into the Beis [HaMikdash] by the derech of the sha’ar whose view is toward the east."},{"num":5,"verse":"So the Ruach [Hakodesh] lifted me up, and brought me into the khatzer hapenimi and, hinei, the Kavod Hashem filled the Beis [HaMikdash]."},{"num":6,"verse":"And I heard Him speaking unto me out of the Beis [HaMikdash]; and the ish was standing beside me."},{"num":7,"verse":"And He said unto me, Ben Adam, this is the makom (place, home) of My Kisse, and the makom of the soles of My feet, where I will dwell in the midst of the Bnei Yisroel l’olam, and My Shem Kadosh, shall Bais Yisroel no more make tameh, neither they, nor their melachim, by their zenut (whoredom), nor by the pegarim (buried dead bodies) of their melachim in their high places."},{"num":8,"verse":"In their setting of their threshold by My threshold, and their mezuzah by My mezuzah, and the wall between Me and them, they have even made tameh My Shem Kodesh by their to’evot that they have committed; therefore I have consumed them in Mine anger."},{"num":9,"verse":"Now let them put away their zenut (whoredom), and the pegarim (buried dead bodies) of their melachim, far from Me, and I will dwell in the midst of them l’olam."},{"num":10,"verse":"Thou Ben Adam, declare the Beis [HaMikdash] to Bais Yisroel, that they may be ashamed of their avonot; and let them measure the tachnit (perfection, design)."},{"num":11,"verse":"And if they be ashamed of all that they have done, make known to them the tzurah (form, fashion) of the Beis [HaMikdash], and the techunah (arrangement) thereof, and the exits thereof, and the entrances thereof, and all the tzurot thereof, and all the chukkot thereof, and all the tzurot thereof, and all the torot thereof; and write it before their eyes, that they may be shomer over the whole tzurah thereof, and all the chukkot thereof, and do them."},{"num":12,"verse":"This is the torat HaBeis [HaMikdash]: upon the rosh hahar the entire boundary thereof round about shall be kodesh kadashim. Hinei, this is the torat HaBeis [HaMikdash]."},{"num":13,"verse":"And these are the middot HaMizbe’ach (measurements of the Mizbe’ach) in cubits. The cubit is a cubit and a handbreadth; even the base shall be a cubit (in height), and the width a cubit, and the moulding thereof by the edge thereof round about shall be a span; and this shall be for the gav (height, back) of the Mizbe’ach."},{"num":14,"verse":"And from the base upon ha’aretz even to the lower enclosure shall be two cubits, and the width one cubit; and from the lesser enclosure even to the greater enclosure shall be four cubits, and the width one cubit."},{"num":15,"verse":"So the ariel (surface of the altar, hearth) shall be four cubits; and from the hearth and upward shall be four keranot (horns)."},{"num":16,"verse":"And the hearth shall be square, twelve cubits long, by twelve wide."},{"num":17,"verse":"And the enclosure shall be square, fourteen cubits long and fourteen wide; and the moulding about it shall be half a cubit; and the base thereof shall be a cubit about; and its ma’alot (steps, stairs) shall look toward the east."},{"num":18,"verse":"And He said unto me, Ben Adam, thus saith Adonoi Hashem: These are the chukkot HaMizbe’ach in the Yom when they shall build it, to offer olah thereon, and to sprinkle dahm thereon."},{"num":19,"verse":"And thou shalt give to the Kohanim the Levi’im that are of the Zera Tzadok, which approach unto Me, to minister unto Me, saith Adonoi Hashem, a young bull for a chattat."},{"num":20,"verse":"And thou shalt take of the dahm thereof, and put it on the four karnot of it, and on the four pinnot of the enclosure, and upon the moulding round about; thus shalt thou cleanse and make kapporah for it."},{"num":21,"verse":"Thou shalt take the bull also of the chattat, and shall burn it in the mifkad (appointed place) of the Beis [HaMikdash], outside the Mikdash."},{"num":22,"verse":"And on the second day thou shalt offer a male of the goats tamim (without blemish) for a chattat; and they shall purify the Mitzbe’ach, as they did purify it with the bull."},{"num":23,"verse":"When thou hast made an end of purifying it, thou shalt offer a young bull tamim (without blemish), and a ram out of the tzon (flock) tamim (without blemish)."},{"num":24,"verse":"And thou shalt offer them before Hashem, and the Kohanim shall cast melach upon them, and they shall offer them up for an olah unto Hashem."},{"num":25,"verse":"Shivat yamim shalt thou prepare daily a se’ir (goat) for a chattat; they shall also prepare a young bull, and a ram out of the tzon (flock), temimim (ones without blemish)."},{"num":26,"verse":"Shivat yamim shall they make kapporah for the Mizbe’ach and make it tahor and so consecrate it."},{"num":27,"verse":"And when these yamim are expired, it shall be, that upon the Yom HaShemini, and so forward, the Kohanim shall make your olot upon the Mizbe’ach, and your Shelamim; and I will accept you, saith Adonoi Hashem."}]