[{"num":8,"verse":"At that time, says the Lord, [the Babylonian army will break open the sepulchers, and] they shall bring out the bones of the kings of Judah, the bones of its princes, the bones of the priests, the bones of the prophets, and the bones of the inhabitants of Jerusalem from their graves."},{"num":2,"verse":"And they will [carelessly] scatter [the corpses] before the sun and the moon and all the host of heaven, which [the dead] have loved and which they have served and after which they have walked and which they have sought, inquired of, and required and which they have worshiped. They shall not be gathered, or be buried; they shall be like dung upon the face of the earth."},{"num":3,"verse":"And death shall be chosen rather than life by all the residue of those who remain of this evil family (nation), who remain in all the places to which I have driven them, says the Lord of hosts."},{"num":4,"verse":"Moreover, you [Jeremiah] shall say to them, Thus says the Lord: Shall men fall and not rise up again? Shall one turn away [from God] and not repent and return [to Him]?"},{"num":5,"verse":"Why then is this people of Jerusalem turned away with a perpetual turning away [from Me]? They hold fast to deceit (idolatry); they refuse to repent and return [to God]."},{"num":6,"verse":"I have listened and heard, but they have not spoken aright; no man repents of his wickedness, saying, What have I done? Everyone turns to his [individual] course, as the horse rushes like a torrent into battle."},{"num":7,"verse":"[Even the migratory birds are punctual to their seasons.] Yes, the stork [excelling in the great height of her flight] in the heavens knows her appointed times [of migration], and the turtledove, the swallow, and the crane observe the time of their return. But My people do not know the law of the Lord [which the lower animals instinctively recognize in so far as it applies to them]."},{"num":8,"verse":"How can you say, We are wise, and we have the written law of the Lord [and are learned in its language and teachings]? Behold, the truth is, the lying pen of the scribes has made of the law a falsehood (a mere code of ceremonial observances)."},{"num":9,"verse":"The wise men shall be put to shame; they shall be dismayed and taken [captive]. Behold, they have rejected the word of the Lord, and what wisdom and broad, full intelligence is in them?"},{"num":10,"verse":"Therefore will I give their wives to others and their fields to those who gain possession of them; for everyone, from the least even to the greatest, is given to covetousness (is greedy for unjust gain); from the prophet even to the priest, everyone deals falsely."},{"num":11,"verse":"For they have healed the wound of the daughter of My people only lightly and slightingly, saying, Peace, peace, when there is no peace."},{"num":12,"verse":"They are brought to shame because they have committed abominations (extremely disgusting and shamefully vile things). And yet they were not at all ashamed, nor could they blush. Therefore they shall fall among those who fall; at the time of their punishment they shall be overthrown, says the Lord."},{"num":13,"verse":"I will gather and sweep them away, utterly consuming them, says the Lord. [I will find] no grapes on the vine, nor figs on the fig tree, and even the leaf is withered; and the things that I have given them shall pass away from them [for I have appointed to them those who shall pass over them]."},{"num":14,"verse":"[Then say the people to each other] Why do we sit still? Assemble yourselves, and let us enter into the fortified cities and be silent or perish there! For the Lord our God has decreed our ruin and given us bitter and poisonous water to drink, because we have sinned against the Lord."},{"num":15,"verse":"We looked for peace and completeness, but no good came, and for a time of healing, but behold, dismay, trouble, and terror!"},{"num":16,"verse":"The snorting of [Nebuchadnezzar’s] horses is heard from Dan [on the northern border of Palestine]. At the sound of the neighing of his strong war-horses the whole land quakes; for they come and devour the land and all that is in it, the city and those who dwell in it."},{"num":17,"verse":"For behold, I am sending among you serpents, adders which cannot be charmed, and they shall bite you, says the Lord."},{"num":18,"verse":"Oh, that I [Jeremiah] could comfort myself against sorrow, [for my grief is beyond healing], my heart is sick and faint within me!"},{"num":19,"verse":"Behold [says the prophet, listen to the voice of] the cry of the daughter of my people [for help] because of those who dwell in a far country: Is not the Lord in Zion? Is not her King in her? [But the Lord answers] Why have they provoked Me to anger with their carved images and with foreign idols?"},{"num":20,"verse":"The harvest is past, the summer has ended and the gathering of fruit is over, yet we are not saved! [comes again the voice of the people.]"},{"num":21,"verse":"For the hurt of the daughter of my people am I [Jeremiah] hurt; I go around mourning; dismay has taken hold on me."},{"num":22,"verse":"Is there no balm in Gilead? Is there no physician there? Why then is not the health of the daughter of my people restored? [Because Zion no longer enjoyed the presence of the Great Physician!]"}]