[{"num":8,"verse":"In that time, saith the Lord, they shall cast out the bones of the kings of Judah, and the bones of princes thereof, and the bones of priests, and the bones of prophets, and the bones of them that dwelled in Jerusalem, from their sepulchres; (At that time, saith the Lord, they shall cast out the bones of the kings of Judah, and the bones of its princes, or of its leaders, and the bones of its priests, and the bones of its prophets, and the bones of those who lived in Jerusalem, from their tombs, or out of their graves;)"},{"num":2,"verse":"and they shall lay abroad those bones to the sun, and [the] moon, and to all the knighthood of (the) heaven(s), which they loved, and which they served, and after which they went, and which they sought, and worshipped; they shall not be gathered, and shall not be buried; they shall be into a dunghill on the face of [the] earth. (and they shall lay abroad those bones before the sun, and the moon, and all the host of heaven, which they loved, and which they sought after, and which they worshipped, and served; they shall not be gathered, and shall not be buried; they shall be like a mound of dung upon the face of the earth.)"},{"num":3,"verse":"And all men shall choose death more than life, which be residue, either left, of this worst kindred, in all (the) places that be left, to which places I casted them out, saith the Lord of hosts."},{"num":4,"verse":"And thou shalt say to them, The Lord saith these things, Whether he that shall fall, shall not rise again? and whether he that is turned away, shall not turn again?"},{"num":5,"verse":"Why therefore is this people in Jerusalem turned away by turning away full of strife? They have taken leasing, and would not turn again (They have taken hold of lies, and would not return to me)."},{"num":6,"verse":"I perceived, and harkened; no man speaketh that that is good, none there is that doeth penance for his sin, and saith, What have I done? All be turned together to their course, as an horse going by fierceness to battle. (I perceived, and harkened; there is no one who speaketh what is good, there is no one who doeth penance for his sin, and saith, What have I done? They all be altogether turned to their course, like a horse going by fierceness to battle.)"},{"num":7,"verse":"A kite in the air knew his time; a turtle, and a swallow, and a ciconia, kept the time of their coming; but my people knew not the doom of the Lord, (A kite in the air knew its time; a turtledove, and a swallow, and a stork, kept the time of their coming back, or of their return; but my people did not know the judgement of the Lord/did not know the justice, or the laws, of the Lord,)"},{"num":8,"verse":"How say ye, We be wise men, and the law of the Lord is with us? Verily the false stylus, either writing, of scribes wrought leasing. (How can ye say, We be wise men, and the Law of the Lord is with us? Truly the false stylus, or the deceitful writing, of the writers hath wrought lies.)"},{"num":9,"verse":"[The] Wise men be shamed, they be made afeared and taken. For they cast away the word of the Lord, and no wisdom is in them."},{"num":10,"verse":"Therefore I shall give the women of them to strangers, and the fields of them to alien heirs; for from the least unto the most all follow avarice, from a prophet unto the priest all make leasing; (And so I shall give their women to strangers, and their fields to foreign heirs; for from the least unto the most all follow avarice, or greed, from the prophet to the priest all make lies, or deception;)"},{"num":11,"verse":"and they healed the sorrow of the daughter of my people to (their) shame, saying, Peace, peace, when no peace was. (and they tried to heal the sorrow of the daughter of my people with shallow words, by simply saying, Peace, peace, when there was no peace.)"},{"num":12,"verse":"They be shamed, for they did abomination; yea, rather they were not shamed by shame, and could not be ashamed. Therefore they shall fall among fallers, in the time of their visitation they shall fall, saith the Lord. (Be they ashamed, they who did these abominations? nay, they were not ashamed, and they could not be ashamed. And so they shall fall among the fallen; they shall fall down at the time of their punishment, saith the Lord.)"},{"num":13,"verse":"I gathering shall gather them, saith the Lord; no grape is in the vines, and figs be not in the fig tree; a leaf fell down, and I gave to them those things that be gone out over (them). (I gathering shall gather them, saith the Lord; no grapes be on the vines, and no figs be on the fig trees; a leaf fell down, and those things that I gave to them shall pass away from them.)"},{"num":14,"verse":"Why sit we? come ye together, enter we into a strong city, and be we still there; for our Lord hath made us to be still, and gave to us (to) drink the water of gall; for we have sinned to the Lord (for we have sinned against the Lord)."},{"num":15,"verse":"We abided peace, and no good was; we abided time of medicine, and lo! dread is. (We waited for peace, but no good came; we waited for a time of respite, and lo! there is only fear.)"},{"num":16,"verse":"[The] Gnashing of horses thereof is heard from Dan; all the land is moved of the voice of neighings of his warriors; and they came, and devoured the land, and the plenty thereof, the city, and the dwellers thereof. (The gnashing of his horses is heard from Dan; all the land shaketh at the sound of the neighings of his warriors; and they came, and devoured the land, and its plenty, and the city, and its inhabitants.)"},{"num":17,"verse":"For lo! I shall send to you the worst serpents, to which is no charming (which cannot be charmed); and they shall bite you, saith the Lord."},{"num":18,"verse":"My sorrow is on sorrow, mine heart is mourning in me."},{"num":19,"verse":"And lo! the voice of cry of the daughter of my people cometh from a far land. Whether the Lord is not in Zion, either the king thereof is not therein? Why therefore stirred they me to wrathfulness by their graven images, and by alien vanities? (And lo! the sound of the cry of the daughter of my people cometh from a far land. Is the Lord not in Zion, or is its King not there? And so why have they stirred me to anger with their carved images, and their strange vanities?/and their useless foreign gods?)"},{"num":20,"verse":"Harvest is passed, summer is ended; and we be not saved."},{"num":21,"verse":"I am tormented, and sorry on the sorrow of the daughter of my people; astonishing held me."},{"num":22,"verse":"Whether resin, that is, a gum of great odour and medicinal, is not in Gilead, either a leech is not there? Why therefore the wound of the daughter of my people is not healed perfectly? (Is there not resin, that is, a medicinal gum of strong odour, in Gilead, or is a physician not there? And so why is the wound of the daughter of my people not perfectly healed?)"}]