[{"header":"Jesus in his hometown"},{"num":6,"verse":"Jesus left that place and came to his hometown. His disciples followed him."},{"num":2,"verse":"On the Sabbath, he began to teach in the synagogue. Many who heard him were surprised. “Where did this man get all this? What’s this wisdom he’s been given? What about the powerful acts accomplished through him?"},{"num":3,"verse":"Isn’t this the carpenter? Isn’t he Mary’s son and the brother of James, Joses, Judas, and Simon? Aren’t his sisters here with us?” They were repulsed by him and fell into sin."},{"num":4,"verse":"Jesus said to them, “Prophets are honored everywhere except in their own hometowns, among their relatives, and in their own households.”"},{"num":5,"verse":"He was unable to do any miracles there, except that he placed his hands on a few sick people and healed them."},{"num":6,"verse":"He was appalled by their disbelief."},{"header":"Sending out the disciples"},{"num":7,"verse":"He called for the Twelve and sent them out in pairs. He gave them authority over unclean spirits."},{"num":8,"verse":"He instructed them to take nothing for the journey except a walking stick—no bread, no bags, and no money in their belts."},{"num":9,"verse":"He told them to wear sandals but not to put on two shirts."},{"num":10,"verse":"He said, “Whatever house you enter, remain there until you leave that place."},{"num":11,"verse":"If a place doesn’t welcome you or listen to you, as you leave, shake the dust off your feet as a witness against them.”"},{"num":12,"verse":"So they went out and proclaimed that people should change their hearts and lives."},{"num":13,"verse":"They cast out many demons, and they anointed many sick people with olive oil and healed them."},{"header":"Death of John the Baptist"},{"num":14,"verse":"Herod the king heard about these things, because the name of Jesus had become well-known. Some were saying, “John the Baptist has been raised from the dead, and this is why miraculous powers are at work through him.”"},{"num":15,"verse":"Others were saying, “He is Elijah.” Still others were saying, “He is a prophet like one of the ancient prophets.”"},{"num":16,"verse":"But when Herod heard these rumors, he said, “John, whom I beheaded, has been raised to life.”"},{"num":17,"verse":"He said this because Herod himself had arranged to have John arrested and put in prison because of Herodias, the wife of Herod’s brother Philip. Herod had married her,"},{"num":18,"verse":"but John told Herod, “It’s against the law for you to marry your brother’s wife!”"},{"num":19,"verse":"So Herodias had it in for John. She wanted to kill him, but she couldn’t."},{"num":20,"verse":"This was because Herod respected John. He regarded him as a righteous and holy person, so he protected him. John’s words greatly confused Herod, yet he enjoyed listening to him."},{"num":21,"verse":"Finally, the time was right. It was on one of Herod’s birthdays, when he had prepared a feast for his high-ranking officials and military officers and Galilee’s leading residents."},{"num":22,"verse":"Herod’s daughter Herodias came in and danced, thrilling Herod and his dinner guests. The king said to the young woman, “Ask me whatever you wish, and I will give it to you.”"},{"num":23,"verse":"Then he swore to her, “Whatever you ask I will give to you, even as much as half of my kingdom.”"},{"num":24,"verse":"She left the banquet hall and said to her mother, “What should I ask for?”"},{"num":25,"verse":"Hurrying back to the ruler, she made her request: “I want you to give me John the Baptist’s head on a plate, right this minute.”"},{"num":26,"verse":"Although the king was upset, because of his solemn pledge and his guests, he didn’t want to refuse her."},{"num":27,"verse":"So he ordered a guard to bring John’s head. The guard went to the prison, cut off John’s head,"},{"num":28,"verse":"brought his head on a plate, and gave it to the young woman, and she gave it to her mother."},{"num":29,"verse":"When John’s disciples heard what had happened, they came and took his dead body and laid it in a tomb."},{"header":"Jesus feeds five thousand people"},{"num":30,"verse":"The apostles returned to Jesus and told him everything they had done and taught."},{"num":31,"verse":"Many people were coming and going, so there was no time to eat. He said to the apostles, “Come by yourselves to a secluded place and rest for a while.”"},{"num":32,"verse":"They departed in a boat by themselves for a deserted place."},{"num":33,"verse":"Many people saw them leaving and recognized them, so they ran ahead from all the cities and arrived before them."},{"num":34,"verse":"When Jesus arrived and saw a large crowd, he had compassion on them because they were like sheep without a shepherd. Then he began to teach them many things."},{"num":35,"verse":"Late in the day, his disciples came to him and said, “This is an isolated place, and it’s already late in the day."},{"num":36,"verse":"Send them away so that they can go to the surrounding countryside and villages and buy something to eat for themselves.”"},{"num":37,"verse":"He replied, “You give them something to eat.”"},{"num":38,"verse":"He said to them, “How much bread do you have? Take a look.”"},{"num":39,"verse":"He directed the disciples to seat all the people in groups as though they were having a banquet on the green grass."},{"num":40,"verse":"They sat down in groups of hundreds and fifties."},{"num":41,"verse":"He took the five loaves and the two fish, looked up to heaven, blessed them, broke the loaves into pieces, and gave them to his disciples to set before the people. He also divided the two fish among them all."},{"num":42,"verse":"Everyone ate until they were full."},{"num":43,"verse":"They filled twelve baskets with the leftover pieces of bread and fish."},{"num":44,"verse":"About five thousand had eaten."},{"header":"Jesus walks on water"},{"num":45,"verse":"Right then, Jesus made his disciples get into a boat and go ahead to the other side of the lake, toward Bethsaida, while he dismissed the crowd."},{"num":46,"verse":"After saying good-bye to them, Jesus went up onto a mountain to pray."},{"num":47,"verse":"Evening came and the boat was in the middle of the lake, but he was alone on the land."},{"num":48,"verse":"He saw his disciples struggling. They were trying to row forward, but the wind was blowing against them. Very early in the morning, he came to them, walking on the lake. He intended to pass by them."},{"num":49,"verse":"When they saw him walking on the lake, they thought he was a ghost and they screamed."},{"num":50,"verse":"Seeing him was terrifying to all of them. Just then he spoke to them, “Be encouraged! It’s me. Don’t be afraid.”"},{"num":51,"verse":"He got into the boat, and the wind settled down. His disciples were so baffled they were beside themselves."},{"num":52,"verse":"That’s because they hadn’t understood about the loaves. Their minds had been closed so that they resisted God’s ways."},{"header":"Healings at Gennesaret"},{"num":53,"verse":"When Jesus and his disciples had crossed the lake, they landed at Gennesaret, anchored the boat,"},{"num":54,"verse":"and came ashore. People immediately recognized Jesus"},{"num":55,"verse":"and ran around that whole region bringing sick people on their mats to wherever they heard he was."},{"num":56,"verse":"Wherever he went—villages, cities, or farming communities—they would place the sick in the marketplaces and beg him to allow them to touch even the hem of his clothing. Everyone who touched him was healed."}]