[{"header":"Chapter 6"},{"num":1,"verse":"The Rejection at Nazareth. He departed from there and came to his native place, accompanied by his disciples. "},{"num":2,"verse":"When the sabbath came he began to teach in the synagogue, and many who heard him were astonished. They said, “Where did this man get all this? What kind of wisdom has been given him? What mighty deeds are wrought by his hands! "},{"num":3,"verse":"Is he not the carpenter, the son of Mary, and the brother of James and Joses and Judas and Simon? And are not his sisters here with us?” And they took offense at him. "},{"num":4,"verse":"Jesus said to them, “A prophet is not without honor except in his native place and among his own kin and in his own house.” "},{"num":5,"verse":"So he was not able to perform any mighty deed there, apart from curing a few sick people by laying his hands on them. "},{"num":6,"verse":"He was amazed at their lack of faith."},{"num":7,"verse":"He summoned the Twelve and began to send them out two by two and gave them authority over unclean spirits. "},{"num":8,"verse":"He instructed them to take nothing for the journey but a walking stick—no food, no sack, no money in their belts. "},{"num":9,"verse":"They were, however, to wear sandals but not a second tunic. "},{"num":10,"verse":"He said to them, “Wherever you enter a house, stay there until you leave from there. "},{"num":11,"verse":"Whatever place does not welcome you or listen to you, leave there and shake the dust off your feet in testimony against them.” "},{"num":12,"verse":"So they went off and preached repentance. "},{"num":13,"verse":"They drove out many demons, and they anointed with oil many who were sick and cured them."},{"num":14,"verse":"King Herod heard about it, for his fame had become widespread, and people were saying, “John the Baptist has been raised from the dead; that is why mighty powers are at work in him.” "},{"num":15,"verse":"Others were saying, “He is Elijah”; still others, “He is a prophet like any of the prophets.” "},{"num":16,"verse":"But when Herod learned of it, he said, “It is John whom I beheaded. He has been raised up.”"},{"num":17,"verse":"Herod was the one who had John arrested and bound in prison on account of Herodias, the wife of his brother Philip, whom he had married. "},{"num":18,"verse":"John had said to Herod, “It is not lawful for you to have your brother’s wife.” "},{"num":19,"verse":"Herodias harbored a grudge against him and wanted to kill him but was unable to do so. "},{"num":20,"verse":"Herod feared John, knowing him to be a righteous and holy man, and kept him in custody. When he heard him speak he was very much perplexed, yet he liked to listen to him. "},{"num":21,"verse":"She had an opportunity one day when Herod, on his birthday, gave a banquet for his courtiers, his military officers, and the leading men of Galilee. "},{"num":22,"verse":"Herodias’s own daughter came in and performed a dance that delighted Herod and his guests. The king said to the girl, “Ask of me whatever you wish and I will grant it to you.” "},{"num":23,"verse":"He even swore [many things] to her, “I will grant you whatever you ask of me, even to half of my kingdom.” "},{"num":24,"verse":"She went out and said to her mother, “What shall I ask for?” She replied, “The head of John the Baptist.” "},{"num":25,"verse":"The girl hurried back to the king’s presence and made her request, “I want you to give me at once on a platter the head of John the Baptist.” "},{"num":26,"verse":"The king was deeply distressed, but because of his oaths and the guests he did not wish to break his word to her. "},{"num":27,"verse":"So he promptly dispatched an executioner with orders to bring back his head. He went off and beheaded him in the prison. "},{"num":28,"verse":"He brought in the head on a platter and gave it to the girl. The girl in turn gave it to her mother. "},{"num":29,"verse":"When his disciples heard about it, they came and took his body and laid it in a tomb."},{"num":30,"verse":"The Return of the Twelve. The apostles gathered together with Jesus and reported all they had done and taught. "},{"num":31,"verse":"He said to them, “Come away by yourselves to a deserted place and rest a while.” People were coming and going in great numbers, and they had no opportunity even to eat. "},{"num":32,"verse":"So they went off in the boat by themselves to a deserted place. "},{"num":33,"verse":"People saw them leaving and many came to know about it. They hastened there on foot from all the towns and arrived at the place before them."},{"num":34,"verse":"The Feeding of the Five Thousand. When he disembarked and saw the vast crowd, his heart was moved with pity for them, for they were like sheep without a shepherd; and he began to teach them many things. "},{"num":35,"verse":"By now it was already late and his disciples approached him and said, “This is a deserted place and it is already very late. "},{"num":36,"verse":"Dismiss them so that they can go to the surrounding farms and villages and buy themselves something to eat.” "},{"num":37,"verse":"He said to them in reply, “Give them some food yourselves.” But they said to him, “Are we to buy two hundred days’ wages worth of food and give it to them to eat?” "},{"num":38,"verse":"He asked them, “How many loaves do you have? Go and see.” And when they had found out they said, “Five loaves and two fish.” "},{"num":39,"verse":"So he gave orders to have them sit down in groups on the green grass. "},{"num":40,"verse":"The people took their places in rows by hundreds and by fifties. "},{"num":41,"verse":"Then, taking the five loaves and the two fish and looking up to heaven, he said the blessing, broke the loaves, and gave them to [his] disciples to set before the people; he also divided the two fish among them all. "},{"num":42,"verse":"They all ate and were satisfied. "},{"num":43,"verse":"And they picked up twelve wicker baskets full of fragments and what was left of the fish. "},{"num":44,"verse":"Those who ate [of the loaves] were five thousand men."},{"num":45,"verse":"Then he made his disciples get into the boat and precede him to the other side toward Bethsaida, while he dismissed the crowd. "},{"num":46,"verse":"And when he had taken leave of them, he went off to the mountain to pray. "},{"num":47,"verse":"When it was evening, the boat was far out on the sea and he was alone on shore. "},{"num":48,"verse":"Then he saw that they were tossed about while rowing, for the wind was against them. About the fourth watch of the night, he came toward them walking on the sea. He meant to pass by them. "},{"num":49,"verse":"But when they saw him walking on the sea, they thought it was a ghost and cried out. "},{"num":50,"verse":"They had all seen him and were terrified. But at once he spoke with them, “Take courage, it is I, do not be afraid!” "},{"num":51,"verse":"He got into the boat with them and the wind died down. They were [completely] astounded. "},{"num":52,"verse":"They had not understood the incident of the loaves. On the contrary, their hearts were hardened."},{"num":53,"verse":"The Healings at Gennesaret. After making the crossing, they came to land at Gennesaret and tied up there. "},{"num":54,"verse":"As they were leaving the boat, people immediately recognized him. "},{"num":55,"verse":"They scurried about the surrounding country and began to bring in the sick on mats to wherever they heard he was. "},{"num":56,"verse":"Whatever villages or towns or countryside he entered, they laid the sick in the marketplaces and begged him that they might touch only the tassel on his cloak; and as many as touched it were healed."}]