[{"header":"A Prophet in His Own Town"},{"num":6,"verse":"Jesus went away from there, and came to his home region. His disciples followed him. "},{"num":2,"verse":"On the sabbath, he began to teach in the synagogue. When they heard him, lots of people were astonished."},{"num":3,"verse":"Isn’t he the handyman, Mary’s son? Isn’t he the brother of James, Joses, Judah and Simon? And aren’t his sisters here with us?’ They took offence at him."},{"num":4,"verse":"‘Prophets have honour everywhere’, said Jesus, ‘except in their own country, their own family, and their own home.’"},{"num":5,"verse":"He couldn’t do anything remarkable there, except that he laid hands on a few sick people and cured them. "},{"num":6,"verse":"Their unbelief dumbfounded him."},{"header":"The Twelve Sent Out"},{"num":7,"verse":"Jesus called the Twelve, and began to send them out in pairs, giving them authority over unclean spirits. "},{"num":8,"verse":"These were his instructions: they were not to take anything for the road, just one staff; no bread, no bag, no cash in the belt; "},{"num":9,"verse":"to wear sandals, and not to wear a second tunic."},{"num":10,"verse":"‘Whenever you go into a house,’ he told them, ‘stay there until you leave the district. "},{"num":11,"verse":"If any place doesn’t welcome you, or won’t listen to you, go away and wipe the dust from your feet as evidence against them.’"},{"num":12,"verse":"They went off and announced that people should repent. "},{"num":13,"verse":"They cast out several demons; and they anointed many sick people with oil, and cured them."},{"header":"The Speculations of Herod"},{"num":14,"verse":"Jesus’ name became well known, and reached the ears of King Herod."},{"num":15,"verse":"Other people said, ‘It’s Elijah!’"},{"num":16,"verse":"‘No,’ said Herod when he heard this. ‘It’s John. I cut off his head, and he’s been raised.’"},{"header":"Herod and John the Baptist"},{"num":17,"verse":"What had happened was this. Herod had married Herodias, his brother Philip’s wife. "},{"num":18,"verse":"John regularly told Herod it wasn’t right for him to take his brother’s wife; so Herod gave the word, arrested him and tied him up in prison. "},{"num":19,"verse":"Herodias kept up a grudge against him and wanted to kill him, but couldn’t; "},{"num":20,"verse":"Herod was afraid of John, knowing that he was a just and holy man. So he protected him, and used to listen to him regularly. What he heard disturbed him greatly, and yet he enjoyed listening to him."},{"num":21,"verse":"And then, one day, the moment came. There was a great party. It was Herod’s birthday, and he gave a feast for his leading retainers, militia officers, and the great and good of Galilee. "},{"num":22,"verse":"Herodias’s daughter came in and danced, and Herod and his guests were delighted."},{"num":23,"verse":"He swore to her, over and over again, ‘Whatever you ask me, I’ll give it you – right up to half my kingdom!’"},{"num":24,"verse":"She went out, and said to her mother, ‘What shall I ask for?’"},{"num":25,"verse":"So she went back at once to the king, all eager, and made her request: ‘I want you to give me, right now, on a dish – the head of John the Baptist!’"},{"num":26,"verse":"The king was distraught. But his oaths on the one hand, and his guests on the other, meant he hadn’t the guts to refuse her. "},{"num":27,"verse":"So he sent a gaoler straight away with orders to bring John’s head. He went and beheaded him in the prison, "},{"num":28,"verse":"brought the head on a dish, and gave it to the girl. The girl gave it to her mother."},{"num":29,"verse":"When John’s followers heard about it, they came and took his body, and buried it in a tomb."},{"header":"The Feeding of the Five Thousand"},{"num":30,"verse":"The apostles came back to Jesus and told him all they had done and taught. "},{"num":31,"verse":"‘All right,’ he said, ‘it’s time for a break. Come away, just you, and we’ll go somewhere lonely and private.’ (Crowds of people were coming and going and they didn’t even have time to eat.)"},{"num":32,"verse":"So they went off privately in the boat to a deserted spot. "},{"num":33,"verse":"And . . . crowds saw them going, realized what was happening, hurried on foot from all the towns, and arrived there first. "},{"num":34,"verse":"When Jesus got out of the boat he saw the huge crowd, and was deeply sorry for them, because they were like a flock without a shepherd. So he started to teach them many things."},{"num":35,"verse":"It was already getting late when his disciples came to him and said, ‘Look: there’s nothing here. It’s getting late. "},{"num":36,"verse":"Send them away. They need to go off into the countryside and the villages and buy themselves some food.’"},{"num":37,"verse":"‘Why don’t you give them something?’ Jesus replied."},{"num":38,"verse":"‘Well,’ said Jesus, ‘how many loaves have you got? Go and see.’"},{"num":39,"verse":"Jesus told them to sit everyone down, group by group, on the green grass. "},{"num":40,"verse":"So they sat down in companies, by hundreds and by fifties. "},{"num":41,"verse":"Then he took the five loaves and the two fishes, looked up to heaven, blessed the bread, broke it, and gave it to his disciples to give to the crowd. Then he divided the two fish for them all. "},{"num":42,"verse":"Everyone ate, and had plenty. "},{"num":43,"verse":"They picked up the leftovers, and there were twelve baskets of broken pieces, and of the fish."},{"num":44,"verse":"The number of men who had eaten was five thousand."},{"header":"Jesus Walks on Water"},{"num":45,"verse":"At once Jesus made his disciples get into the boat and set sail across towards Bethsaida, while he dismissed the crowd. "},{"num":46,"verse":"He took his leave of them and went off up the mountain to pray."},{"num":47,"verse":"When evening came, the boat was in the middle of the sea, and he was alone on the shore. "},{"num":48,"verse":"He saw they were having to work hard at rowing, because the wind was against them; and he came to them, about the fourth watch of the night, walking on the sea. He intended to go past them, "},{"num":49,"verse":"but they saw him walking on the sea and thought it was an apparition. They yelled out; "},{"num":50,"verse":"all of them saw him, and they were scared stiff."},{"num":51,"verse":"He came up to them and got into the boat, and the wind stopped. They were overwhelmed with astonishment; "},{"num":52,"verse":"they hadn’t understood about the loaves, because their hearts were hardened."},{"num":53,"verse":"They made landfall at Gennesaret, and tied the boat up. "},{"num":54,"verse":"People recognized Jesus as soon as they got out of the boat, "},{"num":55,"verse":"and scurried about the whole region to bring sick people on stretchers to wherever they heard that he was. "},{"num":56,"verse":"And wherever he went, in villages, towns or in the open country, they placed the sick in the market-places and begged him to let them touch even the hem of his garment. And all who touched it were healed."}]