[{"header":"David Counts Israel"},{"num":21,"verse":"Satan was against Israel. He encouraged David to count the people of Israel. "},{"num":2,"verse":"So David gave an order to Joab and the commanders of the troops. He said, “Go and count all the Israelites. Count everyone from Beersheba to Dan. Then tell me so I will know how many people there are.”"},{"num":3,"verse":"But Joab answered, “May the Lord make the nation 100 times as large. My master the king, all the Israelites are your servants. Why do you want to do this, my master? You will make Israel guilty of sin.”"},{"num":4,"verse":"But King David made Joab follow his order. So Joab left and went through all Israel, counting the people. Then he returned to Jerusalem. "},{"num":5,"verse":"He told David how many people there were. In Israel there were 1,100,000 men who could use a sword. And there were 470,000 men in Judah who could use a sword. "},{"num":6,"verse":"But Joab did not count the tribes of Levi and Benjamin. He didn’t count them because he didn’t like King David’s order. "},{"num":7,"verse":"David had done something God had said was wrong. So God punished Israel."},{"num":8,"verse":"Then David said to God, “I have done something very foolish. It was a terrible sin. Now, I beg you to forgive me, your servant.”"},{"num":9,"verse":"Gad was David’s seer. The Lord said to Gad, "},{"num":10,"verse":"“Go and tell David: ‘This is what the Lord says: I am going to give you three choices. Choose one, and I will punish you in that way.’”"},{"num":11,"verse":"So Gad went to David and said to him, “This is what the Lord says: ‘Choose which punishment you want. "},{"num":12,"verse":"You may choose three years without enough food for the nation. Or choose three months of running from your enemies as they chase you with their swords. Or choose three days of punishment from the Lord. A terrible disease will spread through the country. The angel of the Lord will go through Israel destroying the people.’ Now, David, decide which answer I will give to the Lord, who sent me.”"},{"num":13,"verse":"David said to Gad, “I am in trouble. I don’t want some man to punish me. The Lord is very merciful. So let the Lord punish me.”"},{"num":14,"verse":"So the Lord sent a terrible disease on Israel, and 70,000 people died. "},{"num":15,"verse":"God sent an angel to destroy Jerusalem. But when the angel started to destroy it, the Lord saw it and felt sorry. So he said to the angel who was destroying, “That is enough! Stop!” The angel of the Lord was then standing at the threshing floor of Araunah the Jebusite."},{"num":16,"verse":"David looked up and saw the angel of the Lord in the sky. The angel was holding his sword over Jerusalem. Then David and the elders bowed facedown on the ground. They were wearing rough cloth to show their sadness. "},{"num":17,"verse":"David said to God, “I am the one who sinned. I gave the order for the people to be counted. I have done wrong. These people are only sheep. What wrong have they done? Lord my God, punish me and my family. But stop the terrible disease that is killing your people.”"},{"num":18,"verse":"Then the angel of the Lord gave an order to Gad. He told Gad to tell David to build an altar to worship the Lord. It was to be at the threshing floor of Araunah the Jebusite. "},{"num":19,"verse":"Gad told David these things from the Lord. So David went to Araunah’s threshing floor."},{"num":20,"verse":"Araunah was separating the straw from the wheat. When he turned around, he saw the angel. Araunah’s four sons who were with him hid. "},{"num":21,"verse":"David went to Araunah. When Araunah saw David, he left the threshing floor. He bowed facedown on the ground before David."},{"num":22,"verse":"David said to him, “Sell me your threshing floor. Then I can build an altar to worship the Lord here. Then the terrible disease will be stopped. Sell it to me for the full price.”"},{"num":23,"verse":"Araunah said to David, “Take this threshing floor. You are my master the king. Do anything you want. Look, I will also give you oxen for the burnt offering. I will give you boards as wood for the fire. And I will give the wheat for the grain offering. I will give all this to you.”"},{"num":24,"verse":"But King David answered Araunah, “No, I must pay the full price. I won’t take anything that is yours and give it to the Lord. I won’t give an offering that costs me nothing.”"},{"num":25,"verse":"So David paid Araunah about 15 pounds of gold for the place. "},{"num":26,"verse":"David built an altar to worship the Lord there. He offered burnt offerings and fellowship offerings. David prayed to the Lord. And the Lord answered him by sending down fire from heaven. It came down on the altar of burnt offering. "},{"num":27,"verse":"Then the Lord commanded the angel to put his sword back into its holder."},{"num":28,"verse":"David saw that the Lord had answered him on the threshing floor of Araunah. So he offered sacrifices to the Lord there. "},{"num":29,"verse":"The Holy Tent and the altar of burnt offerings were in Gibeon. They were at the place of worship there. Moses had made the Holy Tent while the Israelites were in the desert. "},{"num":30,"verse":"But David could not go to the Holy Tent to speak with God. He was afraid of the angel of the Lord and his sword."}]