[{"num":1,"verse":"God visited Sarah exactly as he said he would; God did to Sarah what he promised: Sarah became pregnant and gave Abraham a son in his old age, and at the very time God had set. Abraham named him Isaac. When his son was eight days old, Abraham circumcised him just as God had commanded."},{"num":5,"verse":"Abraham was a hundred years old when his son Isaac was born."},{"num":7,"verse":"She also said,"},{"num":8,"verse":"The baby grew and was weaned. Abraham threw a big party on the day Isaac was weaned."},{"num":9,"verse":"One day Sarah saw the son that Hagar the Egyptian had borne to Abraham, poking fun at her son Isaac. She told Abraham, “Get rid of this slave woman and her son. No child of this slave is going to share inheritance with my son Isaac!”"},{"num":11,"verse":"The matter gave great pain to Abraham—after all, Ishmael was his son. But God spoke to Abraham, “Don’t feel badly about the boy and your maid. Do whatever Sarah tells you. Your descendants will come through Isaac. Regarding your maid’s son, be assured that I’ll also develop a great nation from him—he’s your son, too.”"},{"num":14,"verse":"Abraham got up early the next morning, got some food together and a canteen of water for Hagar, put them on her back and sent her away with the child. She wandered off into the desert of Beersheba. When the water was gone, she left the child under a shrub and went off, fifty yards or so. She said, “I can’t watch my son die.” As she sat, she broke into sobs."},{"num":17,"verse":"Meanwhile, God heard the boy crying. The angel of God called from Heaven to Hagar, “What’s wrong, Hagar? Don’t be afraid. God has heard the boy and knows the fix he’s in. Up now; go get the boy. Hold him tight. I’m going to make of him a great nation.”"},{"num":19,"verse":"Just then God opened her eyes. She looked. She saw a well of water. She went to it and filled her canteen and gave the boy a long, cool drink."},{"num":20,"verse":"God was on the boy’s side as he grew up. He lived out in the desert and became a skilled archer. He lived in the Paran wilderness. And his mother got him a wife from Egypt."},{"num":22,"verse":"At about that same time, Abimelech and the captain of his troops, Phicol, spoke to Abraham: “No matter what you do, God is on your side. So swear to me that you won’t do anything underhanded to me or any of my family. For as long as you live here, swear that you’ll treat me and my land as well as I’ve treated you.”"},{"num":24,"verse":"Abraham said, “I swear it.”"},{"num":25,"verse":"At the same time, Abraham confronted Abimelech over the matter of a well of water that Abimelech’s servants had taken. Abimelech said, “I have no idea who did this; you never told me about it; this is the first I’ve heard of it.”"},{"num":27,"verse":"So the two of them made a covenant. Abraham took sheep and cattle and gave them to Abimelech. Abraham set aside seven sheep from his flock."},{"num":29,"verse":"Abimelech said, “What does this mean? These seven sheep you’ve set aside.”"},{"num":30,"verse":"Abraham said, “It means that when you accept these seven sheep, you take it as proof that I dug this well, that it’s my well.”"},{"num":31,"verse":"That’s how the place got named Beersheba (the Oath-Well), because the two of them swore a covenant oath there. After they had made the covenant at Beersheba, Abimelech and his commander, Phicol, left and went back to Philistine territory."},{"num":33,"verse":"Abraham planted a tamarisk tree in Beersheba and worshiped God there, praying to the Eternal God. Abraham lived in Philistine country for a long time."}]