[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(5) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Aaron . . . built an altar before it.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Having once yielded to the popular cry. Aaron was carried on from one compliance to another. He caused the mould to be made for the idol, and the gold to be melted and run into it; and now he constructed, perhaps with his own hands, an altar of rough stones or turf (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 20:24-25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and placed it directly in front of the Image, thus encouraging the offering of sacrifice to it. Perhaps he flattered himself that by heading the movement he could control it, and hinder it from becoming downright apostacy from Jehovah. In his view no doubt the calf was an emblem of Jehovah, and the worship paid it was the worship of Jehovah. Hence the festival which he proclaimed was to be “a feast to Jehovah.” But how little able he was to guide events, or to hinder the worst evils of idolatry from speedily manifesting themselves, appears from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 32:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 32:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Exodus 32:5",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 32:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Aaron built an altar — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Being borne down with the stream; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and proclaimed a feast — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Namely, of dedication; yet he calls it ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a feast to Jehovah — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "By which it is still more evident that the people did not intend to terminate their adoration in the image, but designed to worship the true God in and by this calf, which they meant to consider as only a visible token of God’s presence with them, and a medium by which to convey their worship to him. And yet this did not excuse them from the sin of gross idolatry any more than it will excuse the Papists, whose plea it is that they do not worship the images which they use, but God, or Christ, by the images, so making themselves just such idolaters as the worshippers of the golden calf, whose feast was a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "feast to Jehovah, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and proclaimed to be so, that the most ignorant and unthinking might not mistake it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "32:1-6 While Moses was in the mount, receiving the law from God, the people made a tumultuous address to Aaron. This giddy multitude were weary of waiting for the return of Moses. Weariness in waiting betrays to many temptations. The Lord must be waited for till he comes, and waited for though he tarry. Let their readiness to part with their ear-rings to make an idol, shame our stubbornness in the service of the true God. They did not draw back on account of the cost of their idolatry; and shall we grudge the expenses of religion? Aaron produced the shape of an ox or calf, giving it some finish with a graving tool. They offered sacrifice to this idol. Having set up an image before them, and so changed the truth of God into a lie, their sacrifices were abomination. Had they not, only a few days before, in this very place, heard the voice of the Lord God speaking to them out of the midst of the fire, Thou shalt not make to thyself any graven image? Had they not themselves solemnly entered into covenant with God, that they would do all he had said to them, and would be obedient? ch. 24:7. Yet before they stirred from the place where this covenant had been solemnly made, they brake an express command, in defiance of an express threatening. It plainly shows, that the law was no more able to make holy, than it was to justify; by it is the knowledge of sin, but not the cure of sin. Aaron was set apart by the Divine appointment to the office of the priesthood; but he, who had once shamed himself so far as to build an altar to a golden calf, must own himself unworthy of the honour of attending at the altar of God, and indebted to free grace alone for it. Thus pride and boasting were silenced.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The sense approved by most modern critics is: and he received the gold at their hand and collected it in a bag and made it a molten calf. The Israelites must have been familiar with the ox-worship of the Egyptians; perhaps many of them had witnessed the rites of Mnevis at Heliopolis, almost; on the borders of the land of Goshen, and they could not have been unacquainted with the more famous rites of Apis at Memphis. It is expressly said that they yielded to the idolatry of Egypt while they were in bondage ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 24:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 20:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 23:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 23:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and this is in keeping with the earliest Jewish tradition (Philo). In the next verse, Aaron appears to speak of the calf as if it was a representative of Yahweh - \"Tomorrow is a feast to the Lord.\" The Israelites did not, it should be noted, worship a living Mnevis, or Apis, having a proper name, but only the golden type of the animal. The mystical notions connected with the ox by the Egyptian priests may have possessed their minds, and, when expressed in this modified and less gross manner, may have been applied to the Lord, who had really delivered them out of the hand of the Egyptians. Their sin then lay, not in their adopting another god, but in their pretending to worship a visible symbol of Him whom no symbol could represent. The close connection between the calves of Jeroboam and this calf is shown by the repetition of the formula, \"which brought thee up out of the land of Egypt\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 12:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "These be thy gods - This is thy god. See Exodus 32:1 note. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "These be thy gods - This is thy god. See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 32:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " note. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5, 6. Aaron made proclamation, and said, To-morrow is a feast to the Lord—a remarkable circumstance, strongly confirmatory of the view that they had not renounced the worship of Jehovah, but in accordance with Egyptian notions, had formed an image with which they had been familiar, to be the visible symbol of the divine presence. But there seems to have been much of the revelry that marked the feasts of the heathen.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "When Aaron saw",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", i.e. observed with what applause they received it, and with what fury and resolution they prosecuted their former desire, he was borne down with the stream, and, as it is probable, by the people’s instigation, built an altar to it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "To the Lord",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to Jehovah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; which title being peculiar to the true God, and being here given by Aaron to the calf, with the approbation of the people, makes it more than probable that the people designed to worship the true God in this calf, which they made only as a visible token of God’s presence with them, and an image by which they might convey their worship to God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And when Aaron saw it,.... In what form it was, and what a figure it made, and how acceptable it was to the Israelites. The Targums of Jonathan and Jerusalem paraphrase it,\"and Aaron saw Hur slain before him;''for reproving them for their idolatry, as the Midrash (e), quoted by Jarchi, says: and Aaron fearing they would take away his life if he opposed them: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "he built an altar before it; that sacrifice might be offered on it to it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and Aaron made proclamation, and said, tomorrow is a feast to the Lord; that is, he gave orders to have it published throughout the camp, there would be solemn sacrifices offered up to the Lord, as represented by this calf, and a feast thereon, which was a public invitation of them to the solemnity: though some think this was a protracting time, and putting the people off till the morrow, who would have been for offering sacrifice immediately, hoping that Moses would come down from the mount before that time, and prevent their idolatry. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) So Pirke Eliezer, c. 45. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(e) So Pirke Eliezer, c. 45. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And when Aaron saw it, he built an altar before it; and Aaron made proclamation, and said, To morrow is a feast to the LORD.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Seeing the impression which the image made upon Israel, Aaron at once builds an altar before it, and proclaims a feast to Jehovah. The calf is thus clearly regarded, not as exclusive of Jehovah, but as ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "representing",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 5.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "He built an altar before it",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Aaron thus proceeded to \"follow a multitude to evil\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 23:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and encouraged the idolatry which he felt himself powerless to restrain. Still, he did not intend that the people should drift away from the worship of Jehovah, or view the calf as anything but a symbol of him. He therefore ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "made proclamation",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and said, ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Tomorrow is a feast to the Lord",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (literally, \"to Jehovah \"). Exodus 32:5",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "When Aaron saw it, he built an altar in front of the image, and called aloud to the people, \"To-morrow is a feast of Jehovah;\" and the people celebrated this feast with burnt-offerings and thank-offerings, with eating and drinking, i.e., with sacrificial meals and sports (צחק), or with loud rejoicing, shouting, antiphonal songs, and dances (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 32:17-19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), in the same manner in which the Egyptians celebrated their feast of Apis (Herod. 2, 60, and 3, 27). But this intimation of an Egyptian custom is no proof that the feast was not intended for Jehovah; for joyous sacrificial meals, and even sports and dances, are met with in connection with the legitimate worship of Jehovah (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 15:20-21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Nevertheless the making of the calf, and the sacrificial meals and other ceremonies performed before it, were a shameful apostasy from Jehovah, a practical denial of the inimitable glory of the true God, and a culpable breach of the second commandment of the covenant words (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 20:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), whereby Israel had broken the covenant with the Lord, and fallen back to the heathen customs of Egypt. Aaron also shared the guilt of this transgression, although it was merely out of sinful weakness that he had assented to the proposals of the people and gratified their wishes (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 9:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). He also fell with the people, and denied the God who had chosen him, though he himself was unconscious of it, to be His priest, to bear the sins of the people, and to expiate them before Jehovah. The apostasy of the nation became a temptation to him, in which the unfitness of his nature for the office was to be made manifest, in order that he might ever remember this, and not excuse himself from the office, to which the Lord had not called him because of his own worthiness, but purely as an act of unmerited grace. ",
        "children": []
      }
    ]
  }
]