[{"header":"Sennacherib Threatens Jerusalem(A)"},{"num":32,"verse":"After these things and these acts of faithfulness, Sennacherib king of Assyria came to Judah and encamped against the fortified cities thinking that he would break through them for himself. "},{"num":2,"verse":"When Hezekiah observed that Sennacherib had come and that he turned to war against Jerusalem, "},{"num":3,"verse":"he consulted with his officials and military men to stop up the waters of the springs that were outside the city, and they helped in this. "},{"num":4,"verse":"So, many people assembled and worked to stop up all the springs and the stream flowing through the area. They reasoned, “Why should the king of Assyria come and find a great amount of water?” "},{"num":5,"verse":"He then worked hard to build up all the walls that were broken down and to raise up towers. Then he built another wall outside that one and strengthened the Millo in the City of David. And he made weapons and shields in abundance."},{"num":6,"verse":"And he designated commanders for fighting over the people, and he gathered them to himself at the open square of the gate of the city and spoke encouragingly to them saying, "},{"num":7,"verse":"“Be strong and brave. Do not fear or have terror before the king of Assyria or before all this army that is with him because there are more who are with us than with him. "},{"num":8,"verse":"With this king is a strong arm of flesh, but with us is the Lord our God who will help us and fight our battles.” So the people leaned on the words of Hezekiah king of Judah."},{"num":9,"verse":"After all this Sennacherib king of Assyria sent his servants to Jerusalem—while he was at Lachish with all his military force that was with him—to Hezekiah king of Judah and to all Judah that was in Jerusalem stating,"},{"num":10,"verse":"“Thus says Sennacherib king of Assyria: By what do you all trust that you remain in a besieged Jerusalem? "},{"num":11,"verse":"Is not Hezekiah leading you all astray to give you over to death by famine and thirst when he tells you, ‘The Lord our God will deliver us from the hand of the king of Assyria’? "},{"num":12,"verse":"Has not Hezekiah himself taken down this god’s high places and altars by ordering Judah and Jerusalem, ‘You all will bow down at one altar and on it burn sacrifices’?"},{"num":13,"verse":"“Do you not know what I and my fathers have done to all the peoples of other lands? Were the gods of the nations of these lands surely able to rescue their lands from my hand? "},{"num":14,"verse":"Who from among all the gods of these nations that my fathers utterly destroyed was able to rescue his people from my hand? For will your god be able to rescue you all from my hand? "},{"num":15,"verse":"Now do not let Hezekiah trick or lead you all astray in this. And do not believe him, for no god from any nation or kingdom has been able to deliver his people from my hand or the hand of my fathers. How much less will your God deliver you from my hand?”"},{"num":16,"verse":"And his servants continued to speak against the Lord God and Hezekiah his servant. "},{"num":17,"verse":"He also wrote letters to insult the Lord God of Israel, speaking against Him, “As the gods of the nations of other lands did not rescue their people from my hand, so the god of Hezekiah will not rescue his people from my hand.” "},{"num":18,"verse":"And they proclaimed it also in a loud voice in the Judean language against the people of Jerusalem who were on the wall to frighten and terrify them in order to capture the city. "},{"num":19,"verse":"They spoke about the God of Jerusalem like the gods of the other peoples of the earth, which are only objects made by men’s hands."},{"header":"The Death of Sennacherib"},{"num":20,"verse":"So Hezekiah the king and Isaiah the prophet son of Amoz prayed concerning this. And they called out to heaven. "},{"num":21,"verse":"So the Lord sent an angel and destroyed the mighty army, leaders, and officials in the camp of the king of Assyria. So the king returned in shame to his own land. When he entered the temple of his god, some of his sons fell on him there with the sword."},{"num":22,"verse":"So the Lord saved Hezekiah and the inhabitants of Jerusalem from the hand of Sennacherib king of Assyria, and from the hand of all others, and gave them rest on every side. "},{"num":23,"verse":"Many brought tribute to the Lord in Jerusalem and choice gifts to Hezekiah king of Judah so that he was lifted up before the eyes of all the nations from then on."},{"header":"Hezekiah’s Pride"},{"num":24,"verse":"In those days Hezekiah became ill even to the point of death, so he prayed to the Lord. He spoke to the king and gave him a sign. "},{"num":25,"verse":"But Hezekiah did not make recompense for what was given to him because his heart was proud. So divine anger was on him, Judah, and Jerusalem. "},{"num":26,"verse":"Then Hezekiah humbled himself from his arrogant heart, both he and those who lived in Jerusalem, and the anger of the Lord did not come over them in the days of Hezekiah."},{"num":27,"verse":"And Hezekiah had a vast amount of riches and honor, and he made treasures for himself from silver, gold, costly stones, spices, shields, and all types of precious items. "},{"num":28,"verse":"He made storehouses for the produce of grain, wine, and oil; and stalls for all types of livestock and flocks. "},{"num":29,"verse":"He also built cities for himself and acquired numbers of flocks and herds, for God had given to him a vast amount of possessions."},{"num":30,"verse":"And Hezekiah shut up the upper outlet of the waters of the Gihon and directed them downward to the western side of the City of David. And Hezekiah found success in all his works. "},{"num":31,"verse":"But the envoys came from the officials of Babylon who were sent to him to inquire about the sign that had been given in the land. God left him alone in order to test Hezekiah, to know what was in his heart."},{"header":"The Death of Hezekiah(B)"},{"num":32,"verse":"And the remainder of the acts of Hezekiah and his kind acts, they are written in the vision of Isaiah the prophet, son of Amoz, in the book of the kings of Judah and Israel. "},{"num":33,"verse":"So Hezekiah slept with his fathers, and they buried him in the upper tombs of the sons of David. And all those from Judah and those living in Jerusalem paid him honor at his death. Then Manasseh his son reigned in his place."}]