[[],[{"type":"header","content":"Assyria Invades Judah"},{"type":"prose","content":"After Hezekiah had faithfully carried out this work, King Sennacherib of Assyria invaded Judah. He laid siege to the fortified towns, giving orders for his army to break through their walls."}],[{"type":"prose","content":"When Hezekiah realized that Sennacherib also intended to attack Jerusalem,"}],[{"type":"prose","content":"he consulted with his officials and military advisers, and they decided to stop the flow of the springs outside the city."}],[{"type":"prose","content":"They organized a huge work crew to stop the flow of the springs, cutting off the brook that ran through the fields. For they said, “Why should the kings of Assyria come here and find plenty of water?”"}],[{"type":"prose","content":"Then Hezekiah worked hard at repairing all the broken sections of the wall, erecting towers, and constructing a second wall outside the first. He also reinforced the supporting terraces in the City of David and manufactured large numbers of weapons and shields."}],[{"type":"prose","content":"He appointed military officers over the people and assembled them before him in the square at the city gate. Then Hezekiah encouraged them by saying:"}],[{"type":"prose","content":"“Be strong and courageous! Don’t be afraid or discouraged because of the king of Assyria or his mighty army, for there is a power far greater on our side!"}],[{"type":"prose","content":"He may have a great army, but they are merely men. We have the  our God to help us and to fight our battles for us!” Hezekiah’s words greatly encouraged the people."},{"type":"header","content":"Sennacherib Threatens Jerusalem"}],[{"type":"prose","content":"While King Sennacherib of Assyria was still besieging the town of Lachish, he sent his officers to Jerusalem with this message for Hezekiah and all the people in the city:    "}],[{"type":"prose","content":"And Sennacherib’s officers further mocked the  God and his servant Hezekiah, heaping insult upon insult."}],[{"type":"prose","content":"The king also sent letters scorning the , the God of Israel. He wrote, “Just as the gods of all the other nations failed to rescue their people from my power, so the God of Hezekiah will also fail.”"}],[{"type":"prose","content":"The Assyrian officials who brought the letters shouted this in Hebrew to the people gathered on the walls of the city, trying to terrify them so it would be easier to capture the city."}],[{"type":"prose","content":"These officers talked about the God of Jerusalem as though he were one of the pagan gods, made by human hands."}],[{"type":"prose","content":"Then King Hezekiah and the prophet Isaiah son of Amoz cried out in prayer to God in heaven."}],[{"type":"prose","content":"And the  sent an angel who destroyed the Assyrian army with all its commanders and officers. So Sennacherib was forced to return home in disgrace to his own land. And when he entered the temple of his god, some of his own sons killed him there with a sword."}],[{"type":"prose","content":"That is how the  rescued Hezekiah and the people of Jerusalem from King Sennacherib of Assyria and from all the others who threatened them. So there was peace throughout the land."}],[{"type":"prose","content":"From then on King Hezekiah became highly respected among all the surrounding nations, and many gifts for the  arrived at Jerusalem, with valuable presents for King Hezekiah, too."},{"type":"header","content":"Hezekiah’s Sickness and Recovery"}],[{"type":"prose","content":"About that time Hezekiah became deathly ill. He prayed to the , who healed him and gave him a miraculous sign."}],[{"type":"prose","content":"But Hezekiah did not respond appropriately to the kindness shown him, and he became proud. So the ’s anger came against him and against Judah and Jerusalem."}],[{"type":"prose","content":"Then Hezekiah humbled himself and repented of his pride, as did the people of Jerusalem. So the ’s anger did not fall on them during Hezekiah’s lifetime."}],[{"type":"prose","content":"Hezekiah was very wealthy and highly honored. He built special treasury buildings for his silver, gold, precious stones, and spices, and for his shields and other valuable items."}],[{"type":"prose","content":"He also constructed many storehouses for his grain, new wine, and olive oil; and he made many stalls for his cattle and pens for his flocks of sheep and goats."}],[{"type":"prose","content":"He built many towns and acquired vast flocks and herds, for God had given him great wealth."}],[{"type":"prose","content":"He blocked up the upper spring of Gihon and brought the water down through a tunnel to the west side of the City of David. And so he succeeded in everything he did."}],[{"type":"prose","content":"However, when ambassadors arrived from Babylon to ask about the remarkable events that had taken place in the land, God withdrew from Hezekiah in order to test him and to see what was really in his heart."},{"type":"header","content":"Summary of Hezekiah’s Reign"}],[{"type":"prose","content":"The rest of the events in Hezekiah’s reign and his acts of devotion are recorded in  which is included in "}],[{"type":"prose","content":"When Hezekiah died, he was buried in the upper area of the royal cemetery, and all Judah and Jerusalem honored him at his death. And his son Manasseh became the next king."}]]