[{"num":32,"verse":"After which things and such truth (After these things and such loyalty, or such faithfulness), Sennacherib, the king of Assyrians, came and entered into Judah; and he besieged (the) strong cities, and would take those."},{"num":2,"verse":"And when Hezekiah had heard this thing, that is, that Sennacherib had come, and that all the fierceness of his battle was turned against Jerusalem,"},{"num":3,"verse":"he took counsel with [the] princes and with (the) most strong men, that they should stop the heads of wells, which were without the city; and when the sentence of all men deemed this profitable, (he took counsel with the leaders and the most strong men, who said that they should stop up, or close up, the heads of the wells, which were outside the city; and when the judgement of all the men judged this profitable,)"},{"num":4,"verse":"he gathered together a full great multitude of men, and they stopped (up) all the wells, and the river, that flowed in the midst of the land; and said, Lest the kings of Assyrians come, and find (an) abundance of waters (here)."},{"num":5,"verse":"Also Hezekiah did wittingly, and he builded all the wall that was destroyed, and he builded towers on the wall, and another wall withoutforth. And he repaired Millo in the city of David; and made armour of all kind, and shields. (And Hezekiah did knowingly, or with intent, and he rebuilt all the wall that was destroyed, and he built towers on the wall, and another wall outside it. And he repaired the Millo in the City of David; and he made all kinds of arms, or weapons, and shields.)"},{"num":6,"verse":"And he ordained princes of warriors in the host; and he called together all (the) men in(to) the street of the gate of the city, and spake to the heart(s) of them, and said,"},{"num":7,"verse":"Do ye manly, and be ye comforted (Be ye brave, and be ye strong); do not ye dread, neither be ye afeared of the king of Assyrians, nor of all the multitude that is with him; for many more be with us than with him."},{"num":8,"verse":"A fleshly arm is with him; and the Lord our God is with us, which is our helper, and shall fight for us. And the people was comforted with such words of Hezekiah, king of Judah. (An arm of flesh is with him; but the Lord our God is with us, he is our helper, and shall fight for us. And the people were encouraged by such words from Hezekiah, the king of Judah.)"},{"num":9,"verse":"And after that these things were done, Sennacherib, [the king of Assyria,] sent his servants to Jerusalem; for he himself (but he himself), with all the host, besieged Lachish. He sent (them) to Hezekiah, king of Judah, and to all the people that was in the city of Jerusalem, and (they) said,"},{"num":10,"verse":"Sennacherib, king of Assyrians, saith these things, In whom have ye trust, and sit besieged in Jerusalem? (Sennacherib, the king of Assyria, saith these things, In whom do ye trust, when ye now sit besieged in Jerusalem?)"},{"num":11,"verse":"Whether not Hezekiah deceiveth you, that ye betake you to death in hunger and thirst, and he affirmeth, that the Lord your God shall deliver you from the hand of the king of Assyrians? (Did not Hezekiah deceive you, so that now ye deliver yourselves unto death by hunger and thirst, while he yet affirmeth, that the Lord your God shall rescue you from the hands of the king of Assyria?)"},{"num":12,"verse":"Whether this is not Hezekiah, that destroyed (the) high places, and altars of him, and commanded to Judah and Jerusalem, and said, Ye shall worship before one altar, and therein ye shall burn incense? (Is this not the same Hezekiah, who destroyed the Lord’s hill shrines, and his altars, and commanded to Judah and Jerusalem, and said, Ye shall worship before one altar, and ye shall burn incense on it?)"},{"num":13,"verse":"Whether ye know not what things I have done, and my fathers, to all the peoples of (other) lands? Whether the gods of (those) folks and of all (those) lands might deliver their country from mine hand? (Do ye not know what I and my forefathers have done, to all the peoples of other lands? Did the gods of those nations deliver their lands out of my hands?)"},{"num":14,"verse":"Who is, of all the gods of (those) folks, which my fathers destroyed, that might deliver his people from mine hand, that also your God may deliver you from mine hand? (Who was there, of all the gods of the nations whom my forefathers destroyed, that could rescue his people out of my hands? no one! yet ye think that your God shall rescue you out of my hands?)"},{"num":15,"verse":"Therefore Hezekiah deceive not you, neither scorn he you by vain counselling, neither believe ye to him; for if no god of all (those) folks and countries might deliver his people from mine hand, and from the hand of my fathers, followingly neither your God shall be able to deliver you from this mine hand. (And so do not let Hezekiah deceive you, nor scorn he you with vain counselling, nor believe ye him; for if no god of any of those other nations or lands could rescue his people out of my hands, or out of the hands of my forefathers, then it followeth, that your God shall not be able to rescue you out of my hands either.)"},{"num":16,"verse":"But also his servants spake many other things against the Lord God, and against Hezekiah, his servant."},{"num":17,"verse":"Also he wrote epistles full of blasphemy against the Lord God of Israel, and he spake against God, and said, As the gods of other folks might not deliver their people from mine hand, so and the God of Hezekiah may not deliver his people from mine hand."},{"num":18,"verse":"Furthermore, and with [a] great cry in the language of Jews, he sounded against the people, that sat on the walls of Jerusalem, to make them afeared, and to take the city. (And furthermore, with a great cry in the language of the Jews, they shouted at the people who sat on the walls of Jerusalem, to make them afraid, so it would be easier to take the city.)"},{"num":19,"verse":"And he spake against [the] God of Israel, as against the gods of the peoples of [the] earth, the works of men’s hands. (And they spoke against the God of Jerusalem, like they spoke against the gods of the other peoples of the earth, which were the work of men’s hands.)"},{"num":20,"verse":"Therefore Hezekiah, the king, and Isaiah, the prophet, the son of Amoz, prayed against this blasphemy, and cried [out] till into heaven (and cried out to heaven)."},{"num":21,"verse":"And the Lord sent his angel, the which killed each strong man and warrior, and the prince of the host of the king of Assyrians; and he/Sennacherib turned again with shame to his land. And when he had entered into the house of his god, the sons, which went out of his womb, killed him there with sword. (And the Lord sent his angel, who killed each strong man and warrior, and the leader of the army of the king of Assyria; and he/Sennacherib returned with shame to his own land. And when he had gone into the house of his god, the sons, who went out of his womb, killed him there with the sword.)"},{"num":22,"verse":"And the Lord saved Hezekiah, and the dwellers of Jerusalem, from the hand of Sennacherib, king of Assyrians, and from the hand of all men; and he gave to them rest by compass. (And the Lord saved Hezekiah, and the inhabitants of Jerusalem, from the hands, or the power, of Sennacherib, the king of Assyria, and from the hands of all men; and he gave them peace all around.)"},{"num":23,"verse":"Also many men brought offerings and sacrifices to the Lord into Jerusalem, and gifts to Hezekiah, king of Judah; which was enhanced after these things before all folks. (And many people brought offerings and sacrifices for the Lord to Jerusalem, and gifts for Hezekiah, the king of Judah; and after these things he was exalted, or held in high honour, before all the nations.)"},{"num":24,"verse":"In those days Hezekiah was sick unto the death, and he prayed the Lord; and he heard him, and gave to him a sign;"},{"num":25,"verse":"but he yielded not thankings to the Lord after the benefits which he had taken, for his heart was raised into pride (but Hezekiah did not give thanks to the Lord for the benefits which he had received, for his heart was raised up in pride); and (then the) wrath of the Lord was made against him, and against Judah, and against Jerusalem."},{"num":26,"verse":"And he was meeked afterward, for-thy that his heart was raised; both he was meeked, and the dwellers of Jerusalem (And he was humbled afterward, because his heart had been raised up; both he, and the inhabitants of Jerusalem, were humbled); and therefore the wrath of the Lord came not upon them in the days of Hezekiah."},{"num":27,"verse":"And Hezekiah was rich, and full noble, and he gathered to himself full many treasures of silver, and of gold, and of precious stones, and of sweet smelling spices, and of armours of all kind, and of vessels of great price. (And Hezekiah was rich, and very glorious, and he made for himself many treasuries for his silver, and gold, and precious stones, and sweet smelling spices, and for all kinds of arms, or weapons, and for his vessels of great value.)"},{"num":28,"verse":"Also he builded large (store)houses of wheat, [and] of wine, and of oil, and cratches of all beasts, and folds to sheep, (And he built large storehouses for his wheat, and wine, and oil, and stalls for all kinds of beasts, and sheepfolds,)"},{"num":29,"verse":"and he builded six cities. And he had unnumberable flocks of sheep and of great beasts; for the Lord had given to him full much chattel."},{"num":30,"verse":"That is Hezekiah, that stopped the higher well of the waters of Gihon, and he turned those away under the earth at the west side of the city of David; in all his works he did by prosperity, whatever thing he would (and he prospered in all his works, whatever he did)."},{"num":31,"verse":"Nevertheless in the message of the princes of Babylon, that were sent to him for to ask of the great wonder, that befelled on the land, God forsook him, that he were assayed, and that all things were known that were in his heart. (Even when the messengers of the leaders of Babylon came, who were sent to ask him about the great wonder, that befell the land, and God abandoned him, so that he was tested, or tried, and so that all things could be known that were in his heart.)"},{"num":32,"verse":"Soothly the residue of [the] words of Hezekiah, and of his mercies, be written in the prophecy of Isaiah, the prophet, the son of Amoz, and in the book of kings of Judah and of Israel. (And the rest of the deeds, and the mercies, or the righteous works, of Hezekiah, be written in the prophecy of the prophet Isaiah, the son of Amoz, and in The Book of the Kings of Judah and of Israel.)"},{"num":33,"verse":"And Hezekiah slept with his fathers, and they buried him above the sepulchres of the sons of David. And all Judah and all the dwellers of Jerusalem made solemn the services of his burying; and Manasseh, his son, reigned for him. (And Hezekiah joined his ancestors, and they buried him in the uppermost of the tombs of the sons of David. And all Judah and all the inhabitants of Jerusalem paid him honour at the services for his burial; and his son Manasseh reigned for him.)"}]