[{"header":"Finding a Bride for Isaac"},{"num":24,"verse":"Now Abraham had grown old, was well advanced in age, and the Lord had blessed Abraham in every way. "},{"num":2,"verse":"So Abraham instructed his servant, who was the oldest member of his household and in charge of everything he owned, “Make this solemn oath to me "},{"num":3,"verse":"as a promise to the Lord, the God of heaven and earth, that you won’t acquire a wife for my son from the Canaanite women among whom I’m living. "},{"num":4,"verse":"Instead, you are to go to my country and to my family and acquire a wife for my son Isaac.”"},{"num":5,"verse":"“What if the woman doesn’t want to come back with me to this land?” the servant asked. “Shouldn’t I have your son go to the land from which you came?”"},{"num":6,"verse":"“Make sure not to take my son there,” Abraham replied. "},{"num":7,"verse":"“The Lord God of heaven, who brought me from my father’s house and from my family’s land, who spoke to me and promised me ‘I will give this land to your descendants,’ will send his angel ahead of you, and you are to acquire a wife for my son from there. "},{"num":8,"verse":"If the woman isn’t willing to follow you, then you’ll be free from this oath to me. Just don’t take my son back there!” "},{"num":9,"verse":"So the servant made a solemn oath to his master Abraham regarding this matter."},{"header":"The Servant Encounters Rebekah"},{"num":10,"verse":"Then Abraham’s servant took ten camels from his master’s herd of camels and left on his journey with all kinds of gifts from his master’s inventory. Eventually, he traveled as far as Aram-naharaim, Nahor’s home town. "},{"num":11,"verse":"As evening approached, he had the camels kneel outside the town at the water well, right about the time when women customarily went out to draw water."},{"num":12,"verse":"That’s when he prayed, “Lord God of my master Abraham, help me to succeed today. Please show your gracious love to my master Abraham. "},{"num":13,"verse":"I’ve stationed myself here by the spring as the women of the town come to draw water. "},{"num":14,"verse":"May it be that the young woman to whom I ask, ‘Please, lower your jug so that I may drink,’ responds, ‘Have a drink, and I’ll water your camels as well.’ May she be the one whom you have chosen for your servant Isaac. This is how I’ll know that you have shown your gracious love to my master.”"},{"num":15,"verse":"Before he had finished speaking, Rebekah appeared. She was a daughter of Milcah’s son Bethuel. (Milcah was the wife of Abraham’s brother Nahor.) She approached the well, carrying a jug on her shoulder. "},{"num":16,"verse":"The woman was very beautiful, young, and had not had sexual relations with a man. Going down to the spring, she filled her jug and turned for home. "},{"num":17,"verse":"Then Abraham’s servant ran to meet her and asked her, “Please, let me have a sip of water from your jug.”"},{"num":18,"verse":"“Drink, sir!” she replied as she quickly lowered her jug on her arm to offer him a drink. "},{"num":19,"verse":"When she had finished giving him a drink, she also said, “I’ll also draw water for your camels until they’ve had enough to drink.”"},{"num":20,"verse":"She quickly emptied her jug into the trough and ran to the well to draw again until she had drawn enough water for all ten of the servant’s camels. "},{"num":21,"verse":"The man stared at her in silence, waiting to see whether or not the Lord had made his journey successful. "},{"num":22,"verse":"When the camels had finished drinking, the man took out a gold nose ring weighing a half shekel and two bracelets for her wrists, weighing 10 shekels and presented them to her."},{"num":23,"verse":"He asked her, “Whose daughter are you? Please tell me, is there room in your father’s house for us to spend the night?”"},{"num":24,"verse":"“I am the daughter of Bethuel,” she answered. “He’s the son of Milcah and Nahor. "},{"num":25,"verse":"And yes,” she continued, “we have plenty of straw and feed, as well as a place to spend the night.”"},{"num":26,"verse":"At this, the man bowed down and worshipped the Lord. "},{"num":27,"verse":"“Blessed be the Lord God of my master Abraham, who hasn’t held back his gracious love and faithfulness from my master! The Lord has led me to the house of my master’s relatives!”"},{"num":28,"verse":"The young woman then ran ahead and informed her mother’s household what had happened."},{"header":"Rebekah’s Brother Laban"},{"num":29,"verse":"Now Rebekah had a brother named Laban, who ran out to the man and met him at the spring. "},{"num":30,"verse":"And so it was, as soon as he saw the nose ring and bracelets on his sister’s wrists, and as soon as he heard what his sister Rebekah was saying about what the man had spoken to her, he went out to the man who was still standing by the camels at the spring! "},{"num":31,"verse":"“Come on,” Laban said. “The Lord has blessed you! So why are you standing out here when I’ve prepared some space in the house and a place for the camels?”"},{"num":32,"verse":"So the servant went to the house and unbridled the camels. They provided straw and feed for the camels and water for washing his feet and those of the men with him. "},{"num":33,"verse":"But when they had prepared a meal and set it in front of him, he said, “I’m not eating until I’ve spoken.”"},{"header":"The Servant Relates His Adventures"},{"num":34,"verse":"“I’m Abraham’s servant,” he said. "},{"num":35,"verse":"“The Lord has greatly blessed my master, so that he has become wealthy. He has provided him sheep and cattle, silver and gold, male and female servants, camels and donkeys. "},{"num":36,"verse":"My master’s wife Sarah gave birth to my master’s son in her old age, and Abraham has given him everything that belongs to him. "},{"num":37,"verse":"My master made me swear this oath: ‘You are not to select a wife for my son from among the daughters of the Canaanites in this land where I live. "},{"num":38,"verse":"Instead, you are to go to my father’s household, to my relatives, and choose a wife for my son there.’"},{"num":39,"verse":"“So I asked my master, ‘What if the woman won’t come back with me?’"},{"num":40,"verse":"“Abraham told me, ‘The Lord, who is with me wherever I go, will send his angel with you to make your journey successful. So you are to choose a wife for my son from my family, from my father’s household. "},{"num":41,"verse":"Only then will you be released from fulfilling my oath. However, when you come to my family, if they don’t give her to you, you’ll be released from fulfilling my oath.’"},{"num":42,"verse":"“So today I arrived at the spring and prayed, ‘Lord God of my master Abraham, if you wish to make the journey that I have traveled successful, "},{"num":43,"verse":"here I am standing by the spring. May it be that the young woman who comes out to draw water, from whom I request a little water from her jug to drink, "},{"num":44,"verse":"if she tells me to drink and also draws water for the camels, may she be the woman that the Lord has chosen for my master’s son.’"},{"num":45,"verse":"“Before I had finished praying, along came Rebekah with her jug on her shoulder! She went to the spring and drew some water. I asked her to please let me have a drink. "},{"num":46,"verse":"She quickly lowered her jug from her shoulder and told me, ‘Have a drink while I also water your camels.’ So I drank, and she also gave my camels water to drink."},{"num":47,"verse":"“That’s when I asked, ‘Whose daughter are you?’"},{"num":48,"verse":"I bowed down and worshipped the Lord, and I praised the Lord God of my master Abraham, who led me on the true way to request the daughter of my master’s brother for his son. "},{"num":49,"verse":"So now, if you wish to show gracious love and truth toward my master, tell me so. But if not, tell me, so that I may go elsewhere.”"},{"header":"Laban and Bethuel Acquiesce"},{"num":50,"verse":"“Since this has come from the Lord,” Laban and Bethuel both replied, “we cannot speak one way or another. "},{"num":51,"verse":"So here’s Rebekah—she’s right in front of you. Take her and go, so she can become a wife for your master’s son, just as the Lord has decreed.”"},{"num":52,"verse":"When Abraham’s servant heard what they had said, he bowed down to the ground before the Lord. "},{"num":53,"verse":"Then the servant brought out some silver and gold items, along with some clothing, and gave them to Rebekah. He also gave gifts to her brother and to her mother. "},{"num":54,"verse":"He and the men with him ate and drank, and then they spent the night."},{"header":"The Servant Prepares to Leave"},{"num":55,"verse":"But her brother and mother said, “Let the young lady stay with us a few days—at least ten—and after that she may go.”"},{"num":56,"verse":"“Please don’t delay me,” the servant answered them. “The Lord has made my journey successful. Send me off so I can return to my master.”"},{"num":57,"verse":"But they said, “We’ll call the young lady and see what she has to say about this.”"},{"num":58,"verse":"So they called Rebekah and asked her, “Do you want to go with this man?”"},{"num":59,"verse":"So they sent off their sister Rebekah, along with her personal assistant, Abraham’s servant, and his men. "},{"num":60,"verse":"As they were leaving, they all blessed Rebekah by saying,"},{"num":61,"verse":"Then Rebekah and her young servant women got up, mounted their camels, and followed Abraham’s servant, who took Rebekah and went on his way."},{"header":"Isaac Marries Rebekah"},{"num":62,"verse":"Later on, as Isaac was returning one evening from Beer-lahai-roi (he had been living in the Negev), "},{"num":63,"verse":"Isaac went out walking in a field. He looked up, and all of a sudden there were some camels coming. "},{"num":64,"verse":"Rebekah looked up, and when she saw Isaac, she quickly dismounted from her camel "},{"num":65,"verse":"and asked the servant, “Who is that man coming in the field to meet us?”"},{"num":66,"verse":"Then the servant informed Isaac about everything he had done. "},{"num":67,"verse":"Later, Isaac brought Rebekah into the tent that had belonged to his mother Sarah and married her. Isaac loved her, and that’s how he was comforted following the loss of his mother."}]