[{"num":24,"verse":"Abraham was now very old. He had seen many years come and go. The Eternal One had blessed his life in every imaginable way. "},{"num":2,"verse":"One day, Abraham spoke to his oldest and most-trusted servant, the man in charge of all his affairs."},{"num":9,"verse":"The trusted servant took the oath, holding in his hand Abraham’s power to give life. He swore to do what his master required."},{"num":10,"verse":"Then the servant gathered together 10 of his master’s camels and left, taking all kinds of valuable gifts from his master to give to his relatives. He traveled all the way to Mesopotamia, to the city of Nahor. "},{"num":11,"verse":"Outside of the city, he made the camels kneel down by a well of water to rest after the long journey. It was nearly dusk, the time when all of the women were coming out to draw water from the well. "},{"num":12,"verse":"He said a prayer."},{"num":15,"verse":"Before he could finish his prayer, it happened that Rebekah, the daughter of Bethuel (Milcah’s and Nahor’s son—Nahor, you remember, was Abraham’s brother) approached the spring with her water jar on her shoulder. "},{"num":16,"verse":"She was a very beautiful girl and still a virgin. No man had ever touched her. He watched her go down to the spring, fill her jar, and come back up the hill. "},{"num":17,"verse":"The servant wasted no time; he ran down to meet her."},{"num":19,"verse":"After she had finished giving him water, she offered to do more."},{"num":20,"verse":"She quickly emptied her jar into the trough and ran again to the well to draw more water. She continued to draw water until all of the camels had drunk their fill. "},{"num":21,"verse":"The man gazed at her in silence, waiting and wondering if she was the one the Eternal One intended for Isaac, the one who would make his journey a success. "},{"num":22,"verse":"When the camels had finished drinking, the man took out from his things a gold nose ring weighing about a fifth of an ounce, plus two gold bracelets for her arms weighing four ounces."},{"num":26,"verse":"The servant bowed his head and worshiped the Eternal One."},{"num":28,"verse":"The girl ran ahead and told her mother’s household everything that had happened. "},{"num":29,"verse":"Now Rebekah had a brother named Laban. As soon as Laban saw the nose ring and bracelets on his sister’s arms and heard what his sister, Rebekah, had to say about how this man had spoken to her, he ran to the man and found him waiting by the spring with the camels."},{"num":32,"verse":"The servant did exactly as Laban asked. When they arrived at the house, Laban unloaded the camels, gave the man straw and feed for his camels, and gave him enough fresh water to wash his feet and the feet of the men who traveled with him. "},{"num":33,"verse":"Then food was prepared and set in front of him to eat."},{"num":52,"verse":"When Abraham’s servant heard this, he bowed low to the ground before the Eternal. "},{"num":53,"verse":"He brought out silver and gold jewelry and beautiful clothes, and the servant presented them to Rebekah. He also gave her brother and her mother expensive ornaments to pay her bride-price. "},{"num":54,"verse":"Then he and the men who traveled with him ate and drank heartily, and they spent the night there. After everyone had risen the next morning, he asked his hosts for permission to leave and return to his master with Rebekah."},{"num":58,"verse":"They called for Rebekah."},{"num":59,"verse":"So the family gathered and sent Rebekah, their sister, along with her nurse to go with Abraham’s servant and his men. "},{"num":60,"verse":"They all blessed Rebekah, saying,"},{"num":61,"verse":"At last Rebekah and her maidservants all went out, mounted the camels, and followed Abraham’s trusted servant back toward Canaan. This is how the servant found Rebekah and took her to be Isaac’s wife."},{"num":62,"verse":"Meanwhile, Isaac had come back from a trip to Beer-lahai-roi and was living in the Negev. "},{"num":63,"verse":"Isaac went outside toward evening to take a walk in the field. As he was deep in thought, he looked up and saw the camels coming toward him. "},{"num":64,"verse":"At the same time, Rebekah looked up; and when she saw Isaac, she slipped down quickly from the camel "},{"num":65,"verse":"and spoke softly to the servant."},{"num":66,"verse":"When Isaac reached them, the servant told him all of the amazing things that had happened. "},{"num":67,"verse":"Then Isaac brought Rebekah into his mother Sarah’s tent. He took her as his wife and slept with her, and grew to love her deeply. In this way, Isaac found comfort in the wake of his mother’s death."}]