[{"header":"The Israelites Worship Baal"},{"num":25,"verse":"While the Israelites were camped at Acacia, some of the men had sex with Moabite women. "},{"num":2,"verse":"These women then invited the men to ceremonies where sacrifices were offered to their gods. The men ate the meat from the sacrifices and worshiped the Moabite gods."},{"num":3,"verse":"The Lord was angry with Israel because they had worshiped the god Baal Peor. "},{"num":4,"verse":"So he said to Moses, “Take the Israelite leaders who are responsible for this and have them killed in front of my sacred tent where everyone can see. Maybe then I will stop being angry with the Israelites.”"},{"num":5,"verse":"Moses told Israel’s officials, “Each of you must put to death any of your men who worshiped Baal.”"},{"num":6,"verse":"Later, Moses and the people were at the sacred tent, crying, when one of the Israelite men brought a Midianite woman to meet his family. "},{"num":7,"verse":"Phinehas, the grandson of Aaron the priest, saw the couple and left the crowd. He found a spear "},{"num":8,"verse":"and followed the man into his tent, where he ran the spear through the man and into the woman’s stomach. The Lord immediately stopped punishing Israel with a deadly disease, "},{"num":9,"verse":"but twenty-four thousand Israelites had already died."},{"num":10,"verse":"The Lord said to Moses, "},{"num":11,"verse":"“In my anger, I would have wiped out the Israelites if Phinehas had not been faithful to me. "},{"num":12,"verse":"But instead of punishing them, I forgave them. So because of the loyalty that Phinehas showed, I solemnly promise that he and his descendants will always be my priests.”"},{"num":14,"verse":"The Israelite man that was killed was Zimri son of Salu, who was one of the leaders of the Simeon tribe. "},{"num":15,"verse":"And the Midianite woman killed with him was Cozbi, the daughter of a Midianite clan leader named Zur."},{"num":16,"verse":"The Lord told Moses, "},{"num":17,"verse":"“The Midianites are now enemies of Israel, so attack and defeat them! They tricked the people of Israel into worshiping their god at Peor, and they are responsible for the death of Cozbi, the daughter of one of their own leaders.”"}]