[{"header":"The Sin of Peor"},{"num":25,"verse":"While Israel remained at Shittim, the people began to commit infidelity with the daughters of Moab."},{"num":2,"verse":"For they invited the people to the sacrifices of their gods, and the people ate and bowed down to their gods."},{"num":3,"verse":"So Israel became followers of Baal of Peor, and the Lord was angry with Israel."},{"num":4,"verse":"And the Lord said to Moses, “Take all the leaders of the people and execute them in broad daylight before the Lord, so that the fierce anger of the Lord may turn away from Israel.”"},{"num":5,"verse":"So Moses said to the judges of Israel, “Each of you kill his men who have become followers of Baal of Peor.”"},{"num":6,"verse":"Then behold, one of the sons of Israel came and brought to his relatives a Midianite woman, in the sight of Moses and in the sight of the whole congregation of the sons of Israel, while they were weeping at the entrance of the tent of meeting."},{"num":7,"verse":"When Phinehas the son of Eleazar, the son of Aaron the priest, saw it, he rose up from the midst of the congregation and took a spear in his hand,"},{"num":8,"verse":"and he went after the man of Israel into the inner room of the tent and pierced both of them, the man of Israel and the woman, through the abdomen. So the plague on the sons of Israel was brought to a halt."},{"num":9,"verse":"But those who died from the plague were twenty-four thousand in number."},{"header":"The Zeal of Phinehas"},{"num":10,"verse":"Then the Lord spoke to Moses, saying,"},{"num":11,"verse":"“Phinehas the son of Eleazar, the son of Aaron the priest, has averted My wrath from the sons of Israel in that he was jealous with My jealousy among them, so that I did not destroy the sons of Israel in My jealousy."},{"num":12,"verse":"Therefore say, ‘Behold, I am giving him My covenant of peace;"},{"num":13,"verse":"and it shall be for him and for his descendants after him, a covenant of a permanent priesthood, because he was jealous for his God and made atonement for the sons of Israel.’”"},{"num":14,"verse":"Now the name of the dead man of Israel who was killed with the Midianite woman, was Zimri the son of Salu, a leader of a father’s household among the Simeonites."},{"num":15,"verse":"And the name of the Midianite woman who was killed was Cozbi the daughter of Zur, who was head of the people of a father’s household in Midian."},{"num":16,"verse":"Then the Lord spoke to Moses, saying,"},{"num":17,"verse":"“Be hostile to the Midianites and attack them;"},{"num":18,"verse":"for they have been hostile to you with their tricks, with which they have deceived you in the matter of Peor and in the matter of Cozbi, the daughter of the leader of Midian, their sister who was killed on the day of the plague because of Peor.”"}]