[{"num":68,"verse":"Let God arise, let his enemies be scattered, and let them that hate him flee before him."},{"num":2,"verse":"As smoke is driven, thou wilt drive them away; as wax melteth before the fire, the wicked shall perish at the presence of God."},{"num":3,"verse":"But the righteous shall rejoice: they shall exult before God and be glad with joy."},{"num":4,"verse":"Sing unto God, sing forth his name; cast up a way for him that rideth in the deserts: his name is Jah; and rejoice before him."},{"num":5,"verse":"A father of the fatherless, and a judge of the widows, is God in his holy habitation."},{"num":6,"verse":"God maketh the solitary into families; those that were bound he bringeth out into prosperity: but the rebellious dwell in a parched [land]."},{"num":7,"verse":"O God, when thou wentest forth before thy people, when thou didst march through the wilderness—(Selah)—"},{"num":8,"verse":"The earth trembled, the heavens also dropped at the presence of God, yon Sinai, at the presence of God, the God of Israel."},{"num":9,"verse":"Thou, O God, didst pour a plentiful rain upon thine inheritance, and when it was weary thou strengthenedst it."},{"num":10,"verse":"Thy flock hath dwelt therein: thou hast prepared in thy goodness, for the afflicted, O God!"},{"num":11,"verse":"The Lord gives the word: great the host of the publishers."},{"num":12,"verse":"Kings of armies flee; they flee, and she that tarrieth at home divideth the spoil."},{"num":13,"verse":"Though ye have lain among the sheepfolds, [ye shall be as] wings of a dove covered with silver, and her feathers with green gold."},{"num":14,"verse":"When the Almighty scattered kings in it, it became snow-white as Zalmon."},{"num":15,"verse":"[As] mount Bashan is the mount of God, a many-peaked mountain, [as] mount Bashan."},{"num":16,"verse":"Why do ye look with envy, ye many-peaked mountains, upon the mount that God hath desired for his abode? yea, Jehovah will dwell [there] for ever."},{"num":17,"verse":"The chariots of God are twenty thousand, thousands upon thousands; the Lord is among them: it is a Sinai in holiness."},{"num":18,"verse":"Thou hast ascended on high, thou hast led captivity captive: thou hast received gifts in Man, and even [for] the rebellious, for the dwelling [there] of Jah Elohim."},{"num":19,"verse":"Blessed be the Lord: day by day doth he load us [with good], the God who is our salvation. Selah."},{"num":20,"verse":"Our God is the God of salvation; and with Jehovah, the Lord, are the goings forth [even] from death."},{"num":21,"verse":"Verily God will smite the head of his enemies, the hairy scalp of him that goeth on still in his trespasses."},{"num":22,"verse":"The Lord said, I will bring again from Bashan, I will bring [them] again from the depth of the sea;"},{"num":23,"verse":"That thou mayest dip thy foot in blood: the tongue of thy dogs has its portion from enemies."},{"num":24,"verse":"They have seen thy goings, O God, the goings of my God, my King, in the sanctuary."},{"num":25,"verse":"The singers went before, the players on stringed instruments after, in the midst of maidens playing on tabrets."},{"num":26,"verse":"In the congregations bless ye God, the Lord,—[ye] from the fountain of Israel."},{"num":27,"verse":"There is little Benjamin, their ruler; the princes of Judah, their company; the princes of Zebulun, the princes of Naphtali."},{"num":28,"verse":"Thy God hath commanded thy strength: strengthen, O God, that which thou hast wrought for us."},{"num":29,"verse":"Because of thy temple at Jerusalem shall kings bring presents unto thee."},{"num":30,"verse":"Rebuke the beast of the reeds, the assembly of the strong, with the calves of the peoples: [every one] submitteth himself with pieces of silver. Scatter the peoples that delight in war."},{"num":31,"verse":"Great ones shall come out of Egypt; Ethiopia shall quickly stretch out her hands unto God."},{"num":32,"verse":"Ye kingdoms of the earth, sing unto God; sing psalms of the Lord, (Selah,)"},{"num":33,"verse":"Of him that rideth upon the heavens, the heavens which are of old: lo, he uttereth his voice, a mighty voice."},{"num":34,"verse":"Ascribe ye strength unto God: his excellency is over Israel, and his strength is in the clouds."},{"num":35,"verse":"Terrible art thou, O God, out of thy sanctuaries,—the God of Israel! He it is that giveth strength and might unto the people. Blessed be God!"}]