[{"num":68,"verse":"To victory, the psalm of the song of David. God rise up, and his enemies be scattered; and they that hate him, flee from his face. (May God rise up, and his enemies be scattered; and they who hate him, flee from his face.)"},{"num":2,"verse":"As smoke faileth, fail they; as wax floateth (away) from the face of fire, so perish [the] sinners from the face of God. (Like smoke vanisheth, so let them vanish; like wax melteth in the fire, so let the sinners perish in the presence of God.)"},{"num":3,"verse":"And just men eat, and make they fully joy in the sight of God; and delight they in gladness. (But the righteous be glad, and make full out joy, or rejoice, before God; yea, delight they, and be glad.)"},{"num":4,"verse":"Sing ye to God, say ye psalm to his name; make ye [a] way to him, that ascendeth on the going down, the Lord is name of him. Make ye fully joy in his sight, (his) enemies shall be troubled from the face of him, (Sing ye to God, sing ye a song to his name; make ye a way for him, who rideth over the plains of the desert/who rideth upon the clouds, yea, the Lord is his name. Make ye full out joy, or rejoice, before him, but his enemies shall be troubled before him,)"},{"num":5,"verse":"which is the father of fatherless and motherless children; and the judge of widows (who is the father of the fatherless and the motherless; and the judge of widows). God is in his holy place;"},{"num":6,"verse":"God that maketh men of one will to dwell in the house. Which leadeth out by strength them that be bound; in like manner them that make sharp, that dwell in sepulchres. (yea, God who helpeth people to come and live in a house with others. And who leadeth out those who be bound into freedom; but they who rebel shall live in a dry land.)"},{"num":7,"verse":"God, when thou wentest out in the sight of thy people; when thou passedest forth in the desert. (God, when thou wentest out before thy people; yea, when thou wentest forth in the wilderness,)"},{"num":8,"verse":"The earth was moved, for heavens dropped down from the face of God of Sinai; from the face of God of Israel. (the earth shook, and the heavens dropped down rain/and the heavens quaked, before the God of Sinai; yea, before the God of Israel.)"},{"num":9,"verse":"God, thou shalt (im)part willful rain to thine heritage, and it was sick; but thou madest it perfect. (God, thou imparted abundant rain upon the land of thy inheritance; it was enfeebled, or dry, but thou madest it perfect.)"},{"num":10,"verse":"Thy beasts shall dwell therein; God, thou hast made ready in thy sweetness to the poor man. (And thy people shall live there; God, in thy goodness, thou hast prepared it for the poor.)"},{"num":11,"verse":"The Lord shall give a word; to them that preach the gospel with much virtue. (The Lord gave the word; and many women preached this good news.)"},{"num":12,"verse":"The kings of virtues be made loved of the darling; and to the fairness of the house to part spoils. (The kings and their hosts, or their armies, fled away; and she of the house parted the spoils.)"},{"num":13,"verse":"If ye sleep among the midst of sorts, either heritages, (yet ye shall be as) the feathers of the culver (that) be (covered) of silver; and the hinder things of the back thereof be in the shining of gold. (Though ye have slept among the pots, yet ye shall be like the wings of the dove that be covered with silver; and the feathers on its back that be covered with shining gold.)"},{"num":14,"verse":"While the king of heaven deemeth kings thereon, they shall be made whiter than snow in Salmon; (When the King of heaven scattered the kings there; they fell like the snow in Salmon.)"},{"num":15,"verse":"the hill of God is a fat hill. The crudded hill is a fat hill; (The hill of God is like Mount Bashan; yea, the curdled hill is like Mount Bashan, with many peaks.)"},{"num":16,"verse":"whereto believe ye falsely, (ye) crudded hills? The hill in which it pleaseth well God to dwell therein; for the Lord shall dwell (there) into the end. (But why, ye curdled hills, gaze ye with envy at the hill where it well pleaseth God to live? for the Lord shall live there forever!)"},{"num":17,"verse":"The chariot of God is manyfold with ten thousand, a thousand of them that be glad; the Lord was in them, in Sinai, in the holy (place). (The chariots of God be twice ten thousand, yea, many thousands; the Lord came with them, from Sinai, to the holy place.)"},{"num":18,"verse":"Thou ascendedest on high, thou tookest captivity (captive); thou receivedest gifts among men. For why thou tookest (also from) them that believed not; for to dwell in the Lord God. (Thou ascendedest on high, thou tookest the captivity captive; thou receivedest gifts, or tribute, from people. But thou also receivedest gifts from those who believed not/from those who were rebellious; so that the Lord God might live among them.)"},{"num":19,"verse":"Blessed be the Lord each day; the God of our healths shall make an easy way to us. (Blessed be the Lord; each day the God of our salvation shall make our way easier for us.)"},{"num":20,"verse":"Our God is God to make men safe; and out-going from death is of the Lord God. (Our God is the God who saveth people; and our escape from death is by the Lord God.)"},{"num":21,"verse":"Nevertheless God shall break the heads of his enemies; the top of the hair of them that go in their trespasses. (But God shall break the heads of his enemies; yea, the top of their hair who go in their trespasses.)"},{"num":22,"verse":"The Lord said, I shall turn (again) from Bashan; I shall turn (again) into the depth of the sea. (The Lord said, I shall return from Bashan; I shall return from the depths of the sea./The Lord said, I shall bring back my people from Bashan; I shall bring them back from the depths of the sea.)"},{"num":23,"verse":"That thy foot be dipped in blood; the tongue of thy dogs be dipped in (the) blood of the enemies of him. (So that thy feet can be dipped in the blood of thy enemies; and so that the tongues of thy dogs can also be dipped in their blood.)"},{"num":24,"verse":"God, they saw thy goings in; the goings in of my God, of my king, which is in the holy (place). (God, they saw thy procession; yea, the procession of my God, of my King, who is in the holy place, or in the sanctuary.)"},{"num":25,"verse":"Princes joined with singers came before; in the middle/in the midst of young damsels singing in tympans. (First came the singers; then the players of the instruments, and after them the young women, singing with tympans/playing tambourines.)"},{"num":26,"verse":"In churches bless ye God; bless ye the Lord from the wells of Israel. (Bless ye God in the congregations; bless the Lord all ye tribes of Israel.)"},{"num":27,"verse":"There (is) Benjamin, a young man; in the ravishing of mind. The princes of Judah were the dukes of them; the princes of Zebulun, the princes of Naphtali. (There is Benjamin, the smallest tribe, in the lead. Then the leaders of Judah with their company, and the leaders of Zebulun, and the leaders of Naphtali.)"},{"num":28,"verse":"God, command thou to thy virtue; God, confirm thou this thing, which thou hast wrought in us. (God, command thou to thy strength, or thy power; God, show thy strength, in what thou has wrought for us.)"},{"num":29,"verse":"From thy temple, which is in Jerusalem; kings shall offer gifts to thee. (For thy Temple, which is in Jerusalem, kings shall offer gifts to thee.)"},{"num":30,"verse":"Blame thou the wild beasts of the reed, the gathering together of bulls is among the kine of peoples; that they exclude them that be proved by silver. Destroy thou folks that will battles, (Rebuke thou the wild beasts of the reeds, that gathering together of bulls, that herd of peoples; until they all bow low, and offer thee their silver. Yea, destroy thou the nations that delight in battles.)"},{"num":31,"verse":"legates shall come from Egypt; Ethiopia shall come before the hands thereof to God. (Ambassadors shall come from Egypt; Ethiopia shall raise up her hands to God.)"},{"num":32,"verse":"Realms of the earth, sing ye to God; say ye psalm to the Lord. Sing ye to God; (Kingdoms of the earth, sing ye to God; sing ye a song to the Lord. Sing ye to God;)"},{"num":33,"verse":"that ascended on the heaven of heaven at the east. Lo! he shall give to his voice the voice of virtue, (who rideth upon the heavens of the heavens, from the old days. Lo! he sendeth out his voice, a strong voice.)"},{"num":34,"verse":"give ye glory to God on Israel; his great doing and his virtue is in the clouds. (Tell ye out the strength of God; yea, his glory, or his majesty, is over Israel, and his power, or his might, is in the heavens.)"},{"num":35,"verse":"God is wonderful in his saints; God of Israel, he shall give virtue, and strength, to his people; blessed be God. (God is wonderful as he cometh from his sanctuary; the God of Israel, he shall give power, and strength, to his people; blessed be God.)"}]