[{"header":"God’s Judgment on Wicked Counselors"},{"num":11,"verse":"Moreover the Spirit lifted me up and brought me to the east gate of the house of the Lord which faces eastward. And at the door of the gate were twenty-five men, among whom I saw Jaazaniah the son of Azzur and Pelatiah the son of Benaiah, officials of the people. "},{"num":2,"verse":"Then He said to me, “Son of man, these are the men who devise mischief and give wicked counsel in this city, "},{"num":3,"verse":"who say, ‘The time is not near to build houses. This city is the cauldron, and we are the flesh.’ "},{"num":4,"verse":"Therefore prophesy against them; prophesy, son of man!”"},{"num":5,"verse":"Then the Spirit of the Lord fell upon me, and He said to me, Say, Thus says the Lord: Thus you have said, O house of Israel, for I know the things that come into your mind, every one of them. "},{"num":6,"verse":"You have multiplied your slain in this city, and you have filled the streets with them."},{"num":7,"verse":"Therefore thus says the Lord God: Your slain whom you have laid in the midst of it, they are the flesh and this city is the cauldron. But I will bring you out of the midst of it. "},{"num":8,"verse":"You have feared the sword, so I will bring a sword upon you, says the Lord God. "},{"num":9,"verse":"I will bring you out of the midst of the city and deliver you into the hands of strangers and execute judgments against you. "},{"num":10,"verse":"You shall fall by the sword. I will judge you in the border of Israel. Then you shall know that I am the Lord. "},{"num":11,"verse":"This city shall not be your cauldron, nor shall you be the flesh in the midst of it, but I will judge you in the border of Israel. "},{"num":12,"verse":"Thus you shall know that I am the Lord. For you have not walked in My statutes, or executed My judgments, but have done after the customs of the nations all around you."},{"num":13,"verse":"Now while I was prophesying, Pelatiah the son of Benaiah died. Then fell I down upon my face and cried out with a loud voice and said, “Ah, Lord God! Will You make a full end of the remnant of Israel?”"},{"header":"The Exiles’ Return Promised"},{"num":14,"verse":"Again the word of the Lord came to me, saying: "},{"num":15,"verse":"Son of man, your brothers, your kindred, your fellow captives, and all the house of Israel, all of them, are they to whom the inhabitants of Jerusalem have said, “Go far from the Lord. This land has been given to us as a possession.”"},{"num":16,"verse":"Therefore say, Thus says the Lord God: Although I have cast them far off among the nations, and although I have scattered them among the countries, yet I will be a sanctuary to them for a little while in the countries where they have gone."},{"num":17,"verse":"Therefore say, Thus says the Lord God: I will gather you from the peoples and assemble you out of the countries where you have been scattered, and I will give you the land of Israel."},{"num":18,"verse":"When they come there, they shall take away all the detestable things and all the abominations from it. "},{"num":19,"verse":"I will give them one heart, and I will put a new spirit within them. And I will take the stony heart out of their flesh, and give them a heart of flesh, "},{"num":20,"verse":"that they may walk in My statutes, and keep My ordinances, and do them. And they shall be My people, and I will be their God. "},{"num":21,"verse":"But as for those whose hearts walk after the hearts of their detestable things and their abominations, I will recompense their way upon their own heads, says the Lord God."},{"num":22,"verse":"Then the cherubim lifted up their wings with the wheels beside them. And the glory of the God of Israel was over them. "},{"num":23,"verse":"The glory of the Lord went up from the midst of the city and stood on the mountain which is on the east side of the city. "},{"num":24,"verse":"Afterwards the Spirit took me up and brought me in a vision by the Spirit of God into Chaldea to those of the captivity."},{"num":25,"verse":"Then I spoke to those of the captivity all the things that the Lord had shown me."}]