[{"header":"Judgment on the Rulers of Israel"},{"num":11,"verse":"Then the Ruach lifted me and took me to the east gate of Yahweh’s temple. (It’s the gate that faces east.) Twenty-five men were at the entrance of the gate. I saw among them Azzur’s son Jaazaniah and Benaiah’s son Pelatiah. They were leaders of the people."},{"num":2,"verse":"Then Yahweh said to me, “Son of man, these are the men who plan evil and give bad advice in this city. "},{"num":3,"verse":"They say, ‘It’s almost time to rebuild homes. This city is a cooking pot, and we’re the meat.’ "},{"num":4,"verse":"So prophesy against them. Prophesy, son of man.”"},{"num":5,"verse":"The Ruach Yahweh came to me and told me to say, “This is what Yahweh says: You are saying these things, nation of Israel. But I know what’s going through your mind. "},{"num":6,"verse":"You have killed many people in this city and have filled its streets with corpses."},{"num":7,"verse":"“So this is what Adonay Yahweh says: The corpses that you put in the middle of the city are the meat, and the city is the cooking pot. I will force you out of the city. "},{"num":8,"verse":"You are afraid of swords, so I will bring swords to attack you, declares Adonay Yahweh. "},{"num":9,"verse":"I will force you out of the city. I will hand you over to foreigners, and I will punish you. "},{"num":10,"verse":"You will die in battle. I will judge you at Israel’s borders. Then you will know that I am Yahweh. "},{"num":11,"verse":"The city will not be your cooking pot, and you will not be the meat in it. I will judge you at Israel’s borders. "},{"num":12,"verse":"Then you will know that I am Yahweh. You haven’t lived by my laws, and you haven’t obeyed my rules. You have followed the standards set by the nations around you.”"},{"num":13,"verse":"While I was prophesying, Benaiah’s son Pelatiah died."},{"header":"The Lord’s Promise to Gather Israel from the Nations"},{"num":14,"verse":"Then Yahweh spoke his word to me. He said, "},{"num":15,"verse":"“Son of man, the people who live in Jerusalem are talking about your own relatives and about the entire nation of Israel. The people who live in Jerusalem say, ‘They are far away from Yahweh. This land has been given to us as our own property.’"},{"num":16,"verse":"“So tell them, ‘This is what Adonay Yahweh says: Although I sent them far away among the nations and scattered them among the countries, I have been their sanctuary for a little while among the countries where they’ve gone.’"},{"num":17,"verse":"“So tell them, ‘This is what Adonay Yahweh says: I will bring them together from the nations and gather them from the countries where I’ve scattered them. I will give them the land of Israel. "},{"num":18,"verse":"They will come and remove all the disgusting and detestable things that are there. "},{"num":19,"verse":"I will give them a single purpose and put a new spirit in them. I will remove their stubborn hearts and give them obedient hearts. "},{"num":20,"verse":"Then they will live by my laws and obey my rules. They will be my people, and I will be their Elohim. "},{"num":21,"verse":"But as for those whose minds are set on following detestable and disgusting idols, I will pay them back for what they have done, declares Adonay Yahweh.’”"},{"header":"The Glory of the Lord Leaves Jerusalem"},{"num":22,"verse":"Then the angels raised their wings, with the wheels beside them. The glory of the Elohim of Israel was above them. "},{"num":23,"verse":"Yahweh’s glory left the middle of the city and stopped above the mountain east of the city."},{"num":24,"verse":"In this vision from the Ruach Elohim, the Ruach lifted me and brought me to the exiles in Babylonia. Then the vision I saw left me."},{"num":25,"verse":"I told the exiles everything Yahweh had shown me."}]