[{"num":11,"verse":"Then the Ruach lifted me up and brought me to the east gate of Adonai’s House, facing east. Behold, at the door of the gate, were 25 men. I saw among them Jaazaniah son of Azzur and Pelatiah son of Benaiah, leaders of the people. "},{"num":2,"verse":"He said to me, “Son of man, these are the men that devise sin and give wicked counsel in this city, "},{"num":3,"verse":"who say, ‘This is not the time to build houses! This city is the cooking pot and we are the meat!’ "},{"num":4,"verse":"Therefore, prophesy against them, prophesy, son of man.”"},{"num":5,"verse":"Then the Ruach Adonai fell upon me and said to me, “Speak! Thus Adonai says: So you are thinking, house of Israel—for I know the thoughts that come into your mind. "},{"num":6,"verse":"You have multiplied your slain in this city and you filled the streets with corpses.”"},{"num":7,"verse":"Therefore, thus says Adonai Elohim, “Your corpses you have laid in the midst of it, they are the meat and this city is the cooking pot! But I will bring you out of it. "},{"num":8,"verse":"You feared the sword, so I will bring the sword against you.” It is a declaration of Adonai Elohim."},{"num":9,"verse":"“I will bring you out of the midst of it, give you into the hands of strangers and execute judgments against you. "},{"num":10,"verse":"You will fall by the sword. I will judge you at the border of Israel. So you will know that I am Adonai. "},{"num":11,"verse":"This city will not be your cooking pot nor will you be the meat in the midst of it—I will judge you at Israel’s border. "},{"num":12,"verse":"So you will know that I am Adonai, whose laws you did not follow and whose ordinances you did not obey. Instead, you have acted in accord with the ordinances of the nations around you.”"},{"num":13,"verse":"As I prophesied, Pelatiah son of Benaiah dropped dead. I fell upon my face and cried out with a loud voice and said, “Ah, Adonai! Are you going to completely eradicate the remnant of Israel?”"},{"num":14,"verse":"The word of Adonai came to me saying: "},{"num":15,"verse":"“Son of man, as for your kinsmen, your kinsmen, fellow exiles and the whole house of Israel—all of them—are those about whom the inhabitants of Jerusalem said, ‘Keep far away from Adonai! This land has been given to us for a possession!’” "},{"num":16,"verse":"Therefore say, thus says Adonai Elohim, “Though I removed them far away, among the nations, though I scattered them among the countries, yet for a little while I was a sanctuary for them in the countries where they have gone.”"},{"header":"Heart of Stone to Heart of Flesh"},{"num":17,"verse":"Therefore say, thus says Adonai Elohim, “I will gather you from the peoples and collect you out of the countries where you have been scattered, and I will give you the land of Israel. "},{"num":18,"verse":"When they come there, they will remove all of its detestable things and all of its abominations. "},{"num":19,"verse":"Then I will give them one heart. I will put a new Spirit within them. I will remove the heart of stone from their flesh and give them a heart of flesh, "},{"num":20,"verse":"so that they may follow My laws, keep My ordinances and practice them. They will be My people and I will be their God. "},{"num":21,"verse":"As for those whose heart walks after the heart of their detestable things and abominations, I will bring their ways upon their heads.” It is a declaration of Adonai Elohim."},{"header":"The Glory Departs Jerusalem"},{"num":22,"verse":"Then the cheruvim lifted up their wings. The wheels were beside them. The glory of the God of Israel was over them from above. "},{"num":23,"verse":"The glory of Adonai went up from within the city and then stood still on the mountain that is to the east of the city. "},{"num":24,"verse":"The Ruach lifted me and brought me in the vision by the Ruach Elohim to Chaldea, to the exiles. Then the vision that I had seen left me. "},{"num":25,"verse":"So I told the exiles all the things that Adonai had shown me."}]