[[],[],[{"type":"header","content":"Get Serious"},{"type":"prose","content":"Where do you think all these appalling wars and quarrels come from? Do you think they just happen? Think again. They come about because you want your own way, and fight for it deep inside yourselves. You lust for what you don’t have and are willing to kill to get it. You want what isn’t yours and will risk violence to get your hands on it."}],[{"type":"prose","content":"You wouldn’t think of just asking God for it, would you? And why not? Because you know you’d be asking for what you have no right to. You’re spoiled children, each wanting your own way."}],[{"type":"prose","content":"You’re cheating on God. If all you want is your own way, flirting with the world every chance you get, you end up enemies of God and his way. And do you suppose God doesn’t care? The proverb has it that “he’s a fiercely jealous lover.” And what he gives in love is far better than anything else you’ll find. It’s common knowledge that “God goes against the willful proud; God gives grace to the willing humble.”"}],[{"type":"prose","content":"So let God work his will in you. Yell a loud  to the Devil and watch him make himself scarce. Say a quiet  to God and he’ll be there in no time. Quit dabbling in sin. Purify your inner life. Quit playing the field. Hit bottom, and cry your eyes out. The fun and games are over. Get serious, really serious. Get down on your knees before the Master; it’s the only way you’ll get on your feet."}],[{"type":"prose","content":"Don’t bad-mouth each other, friends. It’s God’s Word, his Message, his Royal Rule, that takes a beating in that kind of talk. You’re supposed to be honoring the Message, not writing graffiti all over it. God is in charge of deciding human destiny. Who do you think you are to meddle in the destiny of others?"}],[{"type":"header","content":"Nothing but a Wisp of Fog"},{"type":"prose","content":"And now I have a word for you who brashly announce, “Today—at the latest, tomorrow—we’re off to such and such a city for the year. We’re going to start a business and make a lot of money.” You don’t know the first thing about tomorrow. You’re nothing but a wisp of fog, catching a brief bit of sun before disappearing. Instead, make it a habit to say, “If the Master wills it and we’re still alive, we’ll do this or that.”"}],[{"type":"prose","content":"As it is, you are full of your grandiose selves. All such vaunting self-importance is evil. In fact, if you know the right thing to do and don’t do it, that, for you,  evil."}]]