[{"header":"Job Speaks Angry Words to God"},{"num":3,"verse":"After this Job opened his mouth and cursed the day he was born. "},{"num":2,"verse":"He said, "},{"num":3,"verse":"“Let the day be lost on which I was born, and the night which said, ‘A boy is born.’ "},{"num":4,"verse":"May that day be darkness. May God above not care for it. May light not shine on it. "},{"num":5,"verse":"Let darkness and a heavy shadow take it for their own. Let a cloud come upon it. Let the darkness of the day bring fear upon it. "},{"num":6,"verse":"As for that night, let darkness take hold of it. Let it not have joy among the days of the year. Let it not come into the number of months. "},{"num":7,"verse":"Yes, let that night be alone and empty. Let no sound of joy come into it. "},{"num":8,"verse":"Let those curse it who curse the day, who are able to wake up the Leviathan. "},{"num":9,"verse":"Let the early morning stars be made dark. Let it wait for light but have none. Do not let it see the light of day. "},{"num":10,"verse":"Because it did not keep my mother from giving birth to me, or hide trouble from my eyes."},{"num":11,"verse":"“Why did I not die at birth? Why did I not come from my mother and die? "},{"num":12,"verse":"Why did the knees receive me, or why the breasts, that I should have milk? "},{"num":13,"verse":"For now I would have lain down and been quiet. I would have slept then. I would have been at rest, "},{"num":14,"verse":"with kings and wise men of the earth who built cities for themselves that are now destroyed. "},{"num":15,"verse":"I would have been at rest with princes who had gold, who filled their houses with silver. "},{"num":16,"verse":"Why did I not die before I was born, hidden and put away, as babies that never see the light? "},{"num":17,"verse":"There the troubles of the sinful stop. There the tired are at rest. "},{"num":18,"verse":"Those in prison are at rest together. They do not hear the voice of the one who rules over their work. "},{"num":19,"verse":"The small and the great are there. And the servant is free from his owner."},{"num":20,"verse":"“Why is light given to him who suffers? Why is life given to those who feel sad in their soul? "},{"num":21,"verse":"They wait for death, but there is none. They dig for it more than for hidden riches. "},{"num":22,"verse":"They are filled with much joy and are glad, when they find the grave. "},{"num":23,"verse":"Why is light given to a man whose way is hidden, and around whom God has built a wall? "},{"num":24,"verse":"For I cry inside myself in front of my food. My cries pour out like water. "},{"num":25,"verse":"What I was afraid of has come upon me. What filled me with fear has happened. "},{"num":26,"verse":"I am not at rest, and I am not quiet. I have no rest, but only trouble.”"}]