[{"num":3,"verse":"At last Job spoke and cursed the day of his birth."},{"num":2,"verse":"“Let the day of my birth be cursed,” he said, “and the night when I was conceived. "},{"num":4,"verse":"Let that day be forever forgotten. Let it be lost even to God, shrouded in eternal darkness. "},{"num":5,"verse":"Yes, let the darkness claim it for its own, and may a black cloud overshadow it. "},{"num":6,"verse":"May it be blotted off the calendar, never again to be counted among the days of the month of that year. "},{"num":7,"verse":"Let that night be bleak and joyless. "},{"num":8,"verse":"Let those who are experts at cursing curse it. "},{"num":9,"verse":"Let the stars of the night disappear. Let it long for light but never see it, never see the morning light. "},{"num":10,"verse":"Curse it for its failure to shut my mother’s womb, for letting me be born to come to all this trouble."},{"num":11,"verse":"“Why didn’t I die at birth? "},{"num":12,"verse":"Why did the midwife let me live? Why did she nurse me at her breasts? "},{"num":13,"verse":"For if only I had died at birth, then I would be quiet now, asleep and at rest, "},{"num":14,"verse":"along with prime ministers and kings with all their pomp, and wealthy princes whose castles are full of rich treasures. "},{"num":16,"verse":"Oh, to have been stillborn!—to have never breathed or seen the light. "},{"num":17,"verse":"For there in death the wicked cease from troubling, and there the weary are at rest. "},{"num":18,"verse":"There even prisoners are at ease, with no brutal jailer to curse them. "},{"num":19,"verse":"Both rich and poor alike are there, and the slave is free at last from his master."},{"num":20,"verse":"“Oh, why should light and life be given to those in misery and bitterness, who long for death, and it won’t come; who search for death as others search for food or money? "},{"num":22,"verse":"What blessed relief when at last they die! "},{"num":23,"verse":"Why is a man allowed to be born if God is only going to give him a hopeless life of uselessness and frustration? "},{"num":24,"verse":"I cannot eat for sighing; my groans pour out like water. "},{"num":25,"verse":"What I always feared has happened to me. "},{"num":26,"verse":"I was not fat and lazy, yet trouble struck me down.”"}]