[{"header":"Making the Altar of Burnt Offering(A)"},{"num":38,"verse":"He made the altar of burnt offering of acacia wood; five cubits was its length and five cubits its width—it was square—and its height was three cubits. "},{"num":2,"verse":"He made its horns on its four corners; the horns were of one piece with it. And he overlaid it with bronze. "},{"num":3,"verse":"He made all the utensils for the altar: the pans, the shovels, the basins, the forks, and the firepans; all its utensils he made of bronze. "},{"num":4,"verse":"And he made a grate of bronze network for the altar, under its rim, midway from the bottom. "},{"num":5,"verse":"He cast four rings for the four corners of the bronze grating, as holders for the poles. "},{"num":6,"verse":"And he made the poles of acacia wood, and overlaid them with bronze. "},{"num":7,"verse":"Then he put the poles into the rings on the sides of the altar, with which to bear it. He made the altar hollow with boards."},{"header":"Making the Bronze Laver"},{"num":8,"verse":"He made the laver of bronze and its base of bronze, from the bronze mirrors of the serving women who assembled at the door of the tabernacle of meeting."},{"header":"Making the Court of the Tabernacle(D)"},{"num":9,"verse":"Then he made the court on the south side; the hangings of the court were of fine woven linen, one hundred cubits long. "},{"num":10,"verse":"There were twenty pillars for them, with twenty bronze sockets. The hooks of the pillars and their bands were silver. "},{"num":11,"verse":"On the north side the hangings were one hundred cubits long, with twenty pillars and their twenty bronze sockets. The hooks of the pillars and their bands were silver. "},{"num":12,"verse":"And on the west side there were hangings of fifty cubits, with ten pillars and their ten sockets. The hooks of the pillars and their bands were silver. "},{"num":13,"verse":"For the east side the hangings were fifty cubits. "},{"num":14,"verse":"The hangings of one side of the gate were fifteen cubits long, with their three pillars and their three sockets, "},{"num":15,"verse":"and the same for the other side of the court gate; on this side and that were hangings of fifteen cubits, with their three pillars and their three sockets. "},{"num":16,"verse":"All the hangings of the court all around were of fine woven linen. "},{"num":17,"verse":"The sockets for the pillars were bronze, the hooks of the pillars and their bands were silver, and the overlay of their capitals was silver; and all the pillars of the court had bands of silver. "},{"num":18,"verse":"The screen for the gate of the court was woven of blue, purple, and scarlet thread, and of fine woven linen. The length was twenty cubits, and the height along its width was five cubits, corresponding to the hangings of the court. "},{"num":19,"verse":"And there were four pillars with their four sockets of bronze; their hooks were silver, and the overlay of their capitals and their bands was silver. "},{"num":20,"verse":"All the pegs of the tabernacle, and of the court all around, were bronze."},{"header":"Materials of the Tabernacle"},{"num":21,"verse":"This is the inventory of the tabernacle, the tabernacle of the Testimony, which was counted according to the commandment of Moses, for the service of the Levites, by the hand of Ithamar, son of Aaron the priest."},{"num":22,"verse":"Bezalel the son of Uri, the son of Hur, of the tribe of Judah, made all that the Lord had commanded Moses. "},{"num":23,"verse":"And with him was Aholiab the son of Ahisamach, of the tribe of Dan, an engraver and designer, a weaver of blue, purple, and scarlet thread, and of fine linen."},{"num":24,"verse":"All the gold that was used in all the work of the holy place, that is, the gold of the offering, was twenty-nine talents and seven hundred and thirty shekels, according to the shekel of the sanctuary. "},{"num":25,"verse":"And the silver from those who were numbered of the congregation was one hundred talents and one thousand seven hundred and seventy-five shekels, according to the shekel of the sanctuary: "},{"num":26,"verse":"a bekah for each man (that is, half a shekel, according to the shekel of the sanctuary), for everyone included in the numbering from twenty years old and above, for six hundred and three thousand, five hundred and fifty men. "},{"num":27,"verse":"And from the hundred talents of silver were cast the sockets of the sanctuary and the bases of the veil: one hundred sockets from the hundred talents, one talent for each socket. "},{"num":28,"verse":"Then from the one thousand seven hundred and seventy-five shekels he made hooks for the pillars, overlaid their capitals, and made bands for them."},{"num":29,"verse":"The offering of bronze was seventy talents and two thousand four hundred shekels. "},{"num":30,"verse":"And with it he made the sockets for the door of the tabernacle of meeting, the bronze altar, the bronze grating for it, and all the utensils for the altar, "},{"num":31,"verse":"the sockets for the court all around, the bases for the court gate, all the pegs for the tabernacle, and all the pegs for the court all around."}]