[{"header":"Vision of Israel’s Corrupt Leaders"},{"num":11,"verse":"The Spirit then lifted me up and brought me to the eastern gate of the Lord’s house, which faces east, and at the gate’s entrance were 25 men. Among them I saw Jaazaniah son of Azzur, and Pelatiah son of Benaiah, leaders of the people. "},{"num":2,"verse":"The Lord said to me, “Son of man, these are the men who plan evil and give wicked advice in this city. "},{"num":3,"verse":"They are saying, ‘Isn’t the time near to build houses? The city is the pot, and we are the meat.’ "},{"num":4,"verse":"Therefore, prophesy against them. Prophesy, son of man!”"},{"num":5,"verse":"Then the Spirit of the Lord came on me, and He told me, “You are to say: This is what the Lord says: That is what you are thinking, house of Israel; and I know the thoughts that arise in your mind. "},{"num":6,"verse":"You have multiplied your slain in this city, filling its streets with the dead."},{"num":7,"verse":"“Therefore, this is what the Lord God says: The slain you have put within it are the meat, and the city is the pot, but I will remove you from it. "},{"num":8,"verse":"You fear the sword, so I will bring the sword against you.” This is the declaration of the Lord God. "},{"num":9,"verse":"“I will bring you out of the city and hand you over to foreigners; I will execute judgments against you. "},{"num":10,"verse":"You will fall by the sword, and I will judge you at the border of Israel. Then you will know that I am Yahweh. "},{"num":11,"verse":"The city will not be a pot for you, and you will not be the meat within it. I will judge you at the border of Israel, "},{"num":12,"verse":"so you will know that I am Yahweh, whose statutes you have not followed and whose ordinances you have not practiced. Instead, you have acted according to the ordinances of the nations around you.”"},{"num":13,"verse":"Now while I was prophesying, Pelatiah son of Benaiah died. Then I fell facedown and cried out with a loud voice: “Oh, Lord God! Will You bring to an end the remnant of Israel?”"},{"header":"Promise of Israel’s Restoration"},{"num":14,"verse":"The word of the Lord came to me again: "},{"num":15,"verse":"“Son of man, your own relatives, those who have the right to redeem you, and the entire house of Israel, all of them, are those that the residents of Jerusalem have said this to, ‘Stay away from the Lord; this land has been given to us as a possession.’"},{"num":16,"verse":"“Therefore say: This is what the Lord God says: Though I sent them far away among the nations and scattered them among the countries, yet for a little while I have been a sanctuary for them in the countries where they have gone."},{"num":17,"verse":"“Therefore say: This is what the Lord God says: I will gather you from the peoples and assemble you from the countries where you have been scattered, and I will give you the land of Israel."},{"num":18,"verse":"“When they arrive there, they will remove all its detestable things and practices from it. "},{"num":19,"verse":"And I will give them one heart and put a new spirit within them; I will remove their heart of stone from their bodies and give them a heart of flesh, "},{"num":20,"verse":"so they may follow My statutes, keep My ordinances, and practice them. Then they will be My people, and I will be their God. "},{"num":21,"verse":"But as for those whose hearts pursue their desire for detestable things and practices, I will bring their actions down on their own heads.” This is the declaration of the Lord God."},{"header":"God’s Glory Leaves Jerusalem"},{"num":22,"verse":"Then the cherubim, with the wheels beside them, lifted their wings, and the glory of the God of Israel was above them. "},{"num":23,"verse":"The glory of the Lord rose up from within the city and stood on the mountain east of the city. "},{"num":24,"verse":"The Spirit lifted me up and brought me to Chaldea and to the exiles in a vision from the Spirit of God. After the vision I had seen left me, "},{"num":25,"verse":"I spoke to the exiles about all the things the Lord had shown me."}]