[{"header":"The Vision of Babylon the Great"},{"num":17,"verse":"Then one of the seven angels who held the seven bowls came and told me, “Come, I will show you how the notorious prostitute who sits on many waters will be judged. "},{"num":2,"verse":"The kings of the earth committed sexual immorality with her, and those living on earth became drunk with the wine of her immorality.”"},{"num":3,"verse":"Then the angel carried me away in the Spirit into a wilderness. I saw a woman sitting on a scarlet beast that was controlled by blasphemy. It had seven heads and ten horns. "},{"num":4,"verse":"The woman wore purple and scarlet clothes and was adorned with gold, gems, and pearls. In her hand she was holding a gold cup filled with detestable things and the impurities of her immorality. "},{"num":5,"verse":"On her forehead was written a secret name:"},{"num":6,"verse":"I saw that the woman was drunk with the blood of the saints and the blood of the witnesses to Jesus. I was very surprised when I saw her."},{"num":7,"verse":"“Why are you surprised?” The angel asked me. “I will tell you the secret of the woman and the beast with the seven heads and the ten horns that carries her. "},{"num":8,"verse":"The beast that you saw existed once, but is no longer, and is going to crawl out of the bottomless pit and then proceed to its destruction. Those living on earth, whose names were not written in the Book of Life from the foundation of the world, will be surprised when they see the beast because it was, is no longer, and will come again. "},{"num":9,"verse":"This calls for a mind that has wisdom. The seven heads are seven mountains on which the woman is sitting. They are also seven kings. "},{"num":10,"verse":"Five of them have fallen, one is living, and the other has not yet come. When he comes, he must remain in power for a little while. "},{"num":11,"verse":"The beast that was and is no longer is the eighth king, but it belongs with the seven kings and goes to its destruction. "},{"num":12,"verse":"The ten horns that you saw are ten kings who have not yet received a kingdom. They will receive authority to rule as kings with the beast for one hour. "},{"num":13,"verse":"They have one purpose: to give their power and authority to the beast. "},{"num":14,"verse":"They will wage war against the lamb, but the lamb will conquer them because he is Lord of lords and King of kings. Those who are called, chosen, and faithful are with him.”"},{"num":15,"verse":"The angel also told me, “The bodies of water you saw, on which the prostitute is sitting, are people, multitudes, nations, and languages. "},{"num":16,"verse":"The ten horns and the beast you saw will hate the prostitute. They will leave her abandoned and naked. They will eat her flesh and burn her up with fire, "},{"num":17,"verse":"for God has placed within them a desire to carry out his purpose by uniting to give their kingdom to the beast until God’s words are fulfilled. "},{"num":18,"verse":"The woman you saw is the great city that rules over the kings of the earth.”"}]