[{"num":17,"verse":"Then kai one heis of ek the ho seven hepta angels angelos who ho had echō the ho seven hepta bowls phialē came erchomai and kai talked laleō with meta me egō,  saying legō, “ Come deuro,  I  will  show deiknymi you sy the ho judgment krima of  the ho great megas prostitute pornē · ho who ho is  seated kathēmai on epi many polys waters hydōr. "},{"num":2,"verse":"The ho kings basileus of  the ho earth gē committed  acts  of  immorality porneuō with meta her hos,  and kai those ho who  dwell katoikeō upon  the ho earth gē became  intoxicated methyskō with ek the ho wine oinos of ho her autos immorality porneia.” "},{"num":3,"verse":"So kai he  carried apopherō me egō away  in en the  spirit pneuma into eis a  wilderness erēmos,  and kai there I saw a  woman gynē sitting kathēmai on epi a  scarlet kokkinos beast thērion covered gemō with  blasphemous blasphēmia names onoma.  It  had echō seven hepta heads kephalē and kai ten deka horns keras. "},{"num":4,"verse":"· kai The ho woman gynē was eimi clothed periballō in  purple porphyrous and kai scarlet kokkinos,  and kai adorned chrysoō with  gold chrysion and kai jewels lithos timios and kai pearls margaritēs.  In en her autos hand cheir she  held echō a  golden chrysous cup potērion · ho full gemō of  abominations bdelygma,  · kai the ho impurities akathartos of ho her autos fornication porneia. "},{"num":5,"verse":"And kai on epi · ho her autos forehead metōpon was  written graphō a  name onoma, a  mystery mystērion: “ Babylon Babylōn the ho great megas,  · ho mother mētēr of ho prostitutes pornē and kai of  the ho abominations bdelygma of  the ho earth gē.” "},{"num":6,"verse":"And kai I saw  the ho woman gynē drunk methyō with ek the ho blood haima of  the ho saints hagios,  · kai the ho blood haima of  those ho who  bore  witness martys to  Jesus Iēsous.  · kai When I saw  her autos,  I  was thaumazō greatly thauma megas astounded thaumazō. "},{"num":7,"verse":"Then kai the ho angel angelos said legō to  me egō, “ Why dia tis are  you  astounded thaumazō?  I egō will  explain legō to  you sy the ho mystery mystērion of  the ho woman gynē and kai of  the ho beast thērion with echō seven hepta heads kephalē and kai ten deka horns keras that ho carries bastazō her autos.  · ho · ho · ho"},{"num":8,"verse":"The ho beast thērion that hos you saw  was eimi,  and kai now  is eimi not ou,  but kai is  about mellō to  rise anabainō from ek the ho abyss abyssos and kai go hypagō to eis destruction apōleia.  And kai those ho who  dwell katoikeō on epi the ho earth gē,  whose hos names onoma have  not ou been  written graphō · ho in epi the ho Book biblion of ho Life zōē from apo the  foundation katabolē of  the  world kosmos,  will  be  astounded thaumazō when  they  see blepō the ho beast thērion,  because hoti he  was eimi and kai is eimi not ou,  but kai is  to  come pareimi. "},{"num":9,"verse":"“ This hōde calls for  a ho mind nous · ho with echō wisdom sophia.  The ho seven hepta heads kephalē are eimi seven hepta mountains oros on epi which autos the ho woman gynē sits kathēmai.  They  are eimi also kai seven hepta kings basileus: "},{"num":10,"verse":"· ho five pente have  fallen piptō,  · ho one heis is eimi,  the ho other allos has  not  yet oupō come erchomai;  and kai when hotan he  does  come erchomai,  he autos must dei remain menō for  only  a  brief  time oligos. "},{"num":11,"verse":"· kai The ho beast thērion that hos was eimi,  and kai now  is eimi not ou,  · kai is eimi himself autos an  eighth ogdoos king,  but kai also  one  of ek the ho seven hepta,  and kai is  on  his  way hypagō to eis destruction apōleia. "},{"num":12,"verse":"And kai the ho ten deka horns keras that hos you saw  are eimi ten deka kings basileus who hostis as  yet oupō have lambanō not oupō received lambanō royal  power basileia,  but alla will  receive lambanō ruling  authority exousia as hōs kings basileus for  one heis hour hōra,  along  with meta the ho beast thērion. "},{"num":13,"verse":"These houtos are echō of  one heis mind gnōmē and kai will  hand  over didōmi · ho their autos power dynamis and kai authority exousia to  the ho beast thērion. "},{"num":14,"verse":"They houtos will  make  war polemeō on meta the ho Lamb arnion,  but kai the ho Lamb arnion will  conquer nikaō them autos because hoti he  is eimi Lord kyrios of  lords kyrios and kai King basileus of  kings basileus;  and kai with meta him autos will be  the ho called klētos,  · kai the  chosen eklektos,  and kai the  faithful pistos.” "},{"num":15,"verse":"Then kai the angel  said legō to  me egō, “ The ho waters hydōr that hos you saw,  where hou the ho prostitute pornē is  seated kathēmai,  are eimi peoples laos,  · kai multitudes ochlos,  · kai nations ethnos,  and kai languages glōssa. "},{"num":16,"verse":"As  for kai the ho ten deka horns keras that hos you saw,  they  and kai the ho beast thērion will  hate miseō the ho prostitute pornē and kai make poieō her autos desolate erēmoō and kai naked gymnos.  · kai They  will  devour esthiō · ho her autos flesh sarx and kai burn katakaiō her autos up  with en fire pyr, "},{"num":17,"verse":"· ho for gar God theos has  put didōmi it  into eis · ho their autos hearts kardia to  carry  out poieō · ho his autos purpose gnōmē · kai by  agreeing  together poieō · kai to  turn  over didōmi · ho their autos royal  power basileia to  the ho beast thērion,  until achri the ho words logos of ho God theos are  fulfilled teleō. "},{"num":18,"verse":"And kai the ho woman gynē you saw  is eimi the ho great megas city polis · ho that ho has echō dominion basileia over epi the ho kings basileus of  the ho earth gē.” "}]