[[],[{"type":"header","content":"Blessings of Obedience"},{"type":"prose","content":"‘You shall not make idols for yourselves, nor shall you erect an image, a sacred pillar  an obelisk, nor shall you place any figured stone in your land so that you may bow down to it; for I am the LORD your God. "}],[{"type":"prose","content":"You shall keep My Sabbaths and have reverence for My sanctuary. I am the LORD. "}],[{"type":"prose","content":"If you walk in My statutes and keep My commandments and [obediently] do them, "}],[{"type":"prose","content":"then I will give you rain in its season, and the land will yield her produce and the trees of the field bear their fruit. "}],[{"type":"prose","content":"And your threshing season will last until grape gathering and the grape gathering [time] will last until planting, and you will eat your bread and be filled and live securely in your land. "}],[{"type":"prose","content":"I will also grant peace in the land, so that you may lie down and there will be no one to make you afraid. I will also eliminate harmful animals from the land, and no sword will pass through your land. "}],[{"type":"prose","content":"And you will chase your enemies, and they will fall before you by the sword. "}],[{"type":"prose","content":"Five of you will chase a hundred, and a hundred of you will put ten thousand to flight; your enemies will fall before you by the sword. "}],[{"type":"prose","content":"For I will turn toward you [with favor and regard] and make you fruitful and multiply you, and I will establish  confirm My covenant with you. "}],[{"type":"prose","content":"You will eat the old supply of [abundant] produce, and clear out the old [to make room] for the new. "}],[{"type":"prose","content":"I will make My dwelling among you, and My soul will not reject  separate itself from you. "}],[{"type":"prose","content":"I will walk among you and be your God, and you shall be My people. "}],[{"type":"prose","content":"I am the LORD your God, who brought you out of the land of Egypt so that you would not be their slaves; and I broke the bars of your yoke and made you walk upright [with heads held high as free men]."}],[{"type":"header","content":"Penalties of Disobedience"},{"type":"prose","content":"‘But if you do not obey Me and do not [obediently] do all these commandments, "}],[{"type":"prose","content":"if, instead, you reject My statutes, and if your soul rejects My ordinances, so that you will not [obediently] do all My commandments, and in this way break My covenant, "}],[{"type":"prose","content":"I, in turn, will do this to you: I will appoint over you sudden terror, consumption, and fever that will waste away the eyes and cause the soul to languish also. And you will sow your seed uselessly, for your enemies will eat what you plant. "}],[{"type":"prose","content":"I will set My face against you so that you will be struck down before your enemies; those who hate you will rule over you, and you will flee when no one is pursuing you. "}],[{"type":"prose","content":"If in spite of all this you still will not listen to Me  be obedient, then I will punish you seven times more for your sins. "}],[{"type":"prose","content":"I will break your pride in your power, and I will make your sky like iron [giving no rain and blocking all prayers] and your ground like bronze [hard to plow and yielding no produce]. "}],[{"type":"prose","content":"Your strength will be spent uselessly, for your land will not yield its produce and the trees of the land will not yield their fruit."}],[{"type":"prose","content":"‘If then, you act with hostility toward Me and are unwilling to obey Me, I will increase the plague on you seven times in accordance with your sins. "}],[{"type":"prose","content":"I will let loose the [wild] animals of the field among you, which will bereave you of your children and destroy your livestock and make you so few in number that your roads will lie deserted  desolate."}],[{"type":"prose","content":"‘And if by these things you are not turned to Me, but act with hostility against Me, "}],[{"type":"prose","content":"then I also will act with hostility against you, and I will strike you seven times for your sins. "}],[{"type":"prose","content":"I will bring a sword on you that will execute vengeance for [breaking] the covenant; and when you gather together in your cities, I will send pestilence (virulent disease) among you, and you shall be handed over to the enemy. "}],[{"type":"prose","content":"When I break your staff of bread [that is, cut off your supply of food], ten women will bake your bread in one oven, and they will ration your bread; and you will eat and not be satisfied."}],[{"type":"prose","content":"‘Yet if in spite of this you will not [attentively] listen to Me but act with hostility against me, "}],[{"type":"prose","content":"then I will act with hostility against you in wrath, and I also will punish you seven times for your sins. "}],[{"type":"prose","content":"You will eat the flesh of your sons and the flesh of your daughters. "}],[{"type":"prose","content":"I will destroy your high places [devoted to idolatrous worship], and cut down your incense altars, and heap your dead bodies upon the [crushed] bodies of your idols, and My soul will detest you [with deep and unutterable loathing]. "}],[{"type":"prose","content":"I will lay waste your cities as well and will make your sanctuaries desolate, and I will not smell your sweet  soothing aromas [of offerings by fire]. "}],[{"type":"prose","content":"I will make the land desolate, and your enemies who settle in it will be appalled at it. "}],[{"type":"prose","content":"I will scatter you among the nations and draw out the sword [of your enemies] after you; your land will become desolate and your cities will become ruins."}],[{"type":"prose","content":"‘Then the land [of Israel] will enjoy its Sabbaths as long as it lies desolate, while you are in your enemies’ land; then the land will rest and enjoy its Sabbaths. "}],[{"type":"prose","content":"As long as it lies desolate, it will have rest, the rest it did not have on your Sabbaths, while you were living on it. "}],[{"type":"prose","content":"As for those who are left of you, I will bring despair (lack of courage, weakness) into their hearts in the lands of their enemies; the sound of a scattered leaf will put them to flight, and they will flee as if [running] from the sword, and will fall even when no one is chasing them. "}],[{"type":"prose","content":"They shall stumble over one another as if  from a sword when no one is chasing them; and you will have no power to stand before your enemies. "}],[{"type":"prose","content":"You will perish among the nations; the land of your enemies will consume you. "}],[{"type":"prose","content":"Those of you who are left will rot away because of their wickedness in the lands of your enemies; also because of the wickedness of their forefathers they will rot away like them."}],[{"type":"prose","content":"‘If they confess their wickedness and the wickedness of their forefathers, in their unfaithfulness which they have committed against Me—and also in their acting with hostility toward Me— "}],[{"type":"prose","content":"I also was acting with hostility toward them and brought them into the land of their enemies—then if their uncircumcised (sin-filled) hearts are humbled and they accept the punishment for their wickedness, "}],[{"type":"prose","content":"then I will remember My covenant with Jacob, and also My covenant with Isaac, and also My covenant with Abraham, and remember the land. "}],[{"type":"prose","content":"But the land will be abandoned by them and will enjoy its Sabbaths while it lies desolate without them; and they will accept the punishment for their wickedness  make amends because they rejected My ordinances and their soul rejected My statutes. "}],[{"type":"prose","content":"Yet in spite of this, when they are in the land of their enemies, I will not reject them, nor will I so despise them as to destroy them, breaking My covenant with them; for I am the LORD their God. "}],[{"type":"prose","content":"But I will, for their sake, [earnestly] remember the covenant with their forefathers, whom I have brought out of the land of Egypt in the sight of the nations, that I might be their God. I am the LORD.’”"}],[{"type":"prose","content":"These are the statutes, ordinances, and laws which the LORD established between Himself and the Israelites through Moses at Mount Sinai."}]]