[{"num":26,"verse":"1 Idolatry forbidden. 3 A blessing to them that keep the commandments. 14 The curse to them that break them. 42 God promiseth to remember his covenant."},{"num":1,"verse":"Ye shall make you none idols nor graven image, neither rear you up any pillar, neither shall ye set any image of stone in your land to bow down to it: for I am the Lord your God."},{"num":2,"verse":"Ye shall keep my Sabbaths, and reverence my Sanctuary: I am the Lord."},{"num":3,"verse":"¶ If ye walk in mine ordinances, and keep my commandments, and do them,"},{"num":4,"verse":"I will then send you rain in due season, and the land shall yield her increase, and the trees of the field shall give their fruit."},{"num":5,"verse":"And your threshing shall reach unto the vintage, and the vintage shall reach unto sowing time, and you shall eat your bread in plenteousness, and dwell in your land safely."},{"num":6,"verse":"And I will send peace in the land, and ye shall sleep, and none shall make you afraid: also I will rid evil beasts out of the land, and the sword shall not go through your land."},{"num":7,"verse":"Also ye shall chase your enemies, and they shall fall before you upon the sword."},{"num":8,"verse":"And five of you shall chase an hundred, and an hundred of you shall put ten thousand to flight, and your enemies shall fall before you upon the sword."},{"num":9,"verse":"For I will have respect unto you, and make you increase, and multiply you, and stablish my covenant with you."},{"num":10,"verse":"Ye shall eat also old store, and carry out old because of the new."},{"num":11,"verse":"And I will set my Tabernacle among you, and my soul shall not loathe you."},{"num":12,"verse":"Also I will walk among you, and I will be your God, and ye shall be my people."},{"num":13,"verse":"I am the Lord your God which have brought you out of the land of Egypt, that ye should not be their bondmen, and I have broken the bonds of your yoke, and made you go upright."},{"num":14,"verse":"¶ But if ye will not obey me, nor do all these commandments,"},{"num":15,"verse":"And if ye shall despise mine ordinances, either if your soul abhor my laws, so that ye will not do all my Commandments, but break my Covenant,"},{"num":16,"verse":"Then will I also do this unto you, I will appoint over you fearfulness, a consumption, and the burning ague to consume the eyes, and make the heart heavy, and you shall sow your seed in vain: for your enemies shall eat it:"},{"num":17,"verse":"And I will set my face against you, and ye shall fall before your enemies, and they that hate you, shall reign over you, and ye shall flee when none pursueth you."},{"num":18,"verse":"And if ye will not for these things obey me, then will I punish you seven times more, according to your sins,"},{"num":19,"verse":"And I will break the pride of your power, and I will make your heaven as iron, and your earth as brass:"},{"num":20,"verse":"And your strength shall be spent in vain: neither shall your land give her increase, neither shall the trees of the land give their fruit."},{"num":21,"verse":"¶ And if ye walk stubbornly against me, and will not obey me, I will then bring seven times more plagues upon you, according to your sins."},{"num":22,"verse":"I will also send wild beasts upon you, which shall spoil you, and destroy your cattle, and make you few in number: so your highways shall be desolate."},{"num":23,"verse":"Yet if by these ye will not be reformed by me, but walk stubbornly against me,"},{"num":24,"verse":"Then will I also walk stubbornly against you, and I will smite you yet seven times for your sins:"},{"num":25,"verse":"And I will send a sword upon you, that shall avenge the quarrel of my Covenant: and when ye are gathered in your cities, I will send the pestilence among you, and ye shall be delivered into the hand of the enemy."},{"num":26,"verse":"When I shall break the staff of your bread, then ten women shall bake your bread in one oven, and they shall deliver your bread again by weight, and ye shall eat, but not be satisfied."},{"num":27,"verse":"Yet if ye will not for this obey me, but walk against me stubbornly,"},{"num":28,"verse":"Then will I walk stubbornly in mine anger against you, and I will also chastise you seven times more according to your sins."},{"num":29,"verse":"And ye shall eat the flesh of your sons, and the flesh of your daughters shall ye devour."},{"num":30,"verse":"I will also destroy your high places, and cut away your images, and cast your carcasses upon the bodies of your idols, and my soul shall abhor you."},{"num":31,"verse":"And I will make your cities desolate, and bring your Sanctuary unto naught, and will not smell the savor of your sweet odors."},{"num":32,"verse":"I will also bring the land unto a wilderness, and your enemies which dwell therein, shall be astonished thereat."},{"num":33,"verse":"Also I will scatter you among the heathen, and will draw out a sword after you, and your land shall be waste, and your cities shall be desolate."},{"num":34,"verse":"Then shall the land enjoy her Sabbaths, as long as it lieth void, and ye shall be in your enemies’ land: then shall the land rest, and enjoy her Sabbaths."},{"num":35,"verse":"All the days that it lieth void, it shall rest, because it did not rest in your Sabbaths, when ye dwelt upon it."},{"num":36,"verse":"And upon them that are left of you, I will send even a faintness into their hearts in the land of your enemies, and the sound of a leaf shaken shall chase them, and they shall flee as fleeing from a sword, and they shall fall, no man pursuing them."},{"num":37,"verse":"They shall fall also one upon another, as before a sword, though none pursue them, and ye shall not be able to stand before your enemies:"},{"num":38,"verse":"And ye shall perish among the heathen, and the land of your enemies shall eat you up."},{"num":39,"verse":"And they that are left of you, shall pine away for their iniquity, in your enemies’ lands, and for the iniquities of their fathers shall they pine away with them also."},{"num":40,"verse":"Then they shall confess their iniquity, and the wickedness of their fathers for their trespass, which they have trespassed against me, and also because they have walked stubbornly against me."},{"num":41,"verse":"Therefore I will walk stubbornly against them, and bring them into the land of their enemies: so then their uncircumcised hearts shall be humbled, and then they shall willingly bear the punishment of their iniquity."},{"num":42,"verse":"Then I will remember my Covenant with Jacob, and my Covenant also with Isaac, and also my Covenant with Abraham will I remember, and will remember the land."},{"num":43,"verse":"The land also in the mean season shall be left of them, and shall enjoy her Sabbaths while she lieth waste without them, but they shall willingly suffer the punishment of their iniquity, because they despised my Laws, and because their soul abhorred mine ordinances."},{"num":44,"verse":"Yet notwithstanding this, when they shall be in the land of their enemies, I will not cast them away, neither will I abhor them, to destroy them utterly, nor to break my Covenant with them: for I am the Lord their God:"},{"num":45,"verse":"But I will remember for them the Covenant of old, when I brought them out of the land of Egypt in the sight of the heathen, that I might be their God: I am the Lord."},{"num":46,"verse":"These are the Ordinances, and the Judgments, and the Laws, which the Lord made between him, and the children of Israel, in mount Sinai by the hand of Moses."}]