[{"header":"Chapter 26"},{"num":1,"verse":"The Reward of Obedience. Do not make idols for yourselves. You shall not erect a carved image or a sacred stone for yourselves, nor shall you set up a carved stone for worship in your land; for I, the Lord, am your God. "},{"num":2,"verse":"Keep my sabbaths, and reverence my sanctuary. I am the Lord."},{"num":3,"verse":"If you live in accordance with my statutes and are careful to observe my commandments, "},{"num":4,"verse":"I will give you your rains in due season, so that the land will yield its crops, and the trees their fruit; "},{"num":5,"verse":"your threshing will last till vintage time, and your vintage till the time for sowing, and you will eat your fill of food, and live securely in your land. "},{"num":6,"verse":"I will establish peace in the land, and you will lie down to rest with no one to cause you anxiety. I will rid the country of ravenous beasts, and no sword shall sweep across your land. "},{"num":7,"verse":"You will rout your enemies, and they shall fall before your sword. "},{"num":8,"verse":"Five of you will put a hundred of your foes to flight, and a hundred of you will put to flight ten thousand, till your enemies fall before your sword. "},{"num":9,"verse":"I will look with favor upon you, and make you fruitful and numerous, as I carry out my covenant with you. "},{"num":10,"verse":"You shall eat the oldest stored harvest, and have to discard it to make room for the new. "},{"num":11,"verse":"I will set my tabernacle in your midst, and will not loathe you. "},{"num":12,"verse":"Ever present in your midst, I will be your God, and you will be my people; "},{"num":13,"verse":"I, the Lord, am your God, who brought you out of the land of Egypt to be their slaves no more, breaking the bars of your yoke and making you walk erect."},{"num":14,"verse":"But if you do not heed me and do not keep all these commandments, "},{"num":15,"verse":"if you reject my statutes and loathe my decrees, refusing to obey all my commandments and breaking my covenant, "},{"num":16,"verse":"then I, in turn, will do this to you: I will bring terror upon you—with consumption and fever to dim the eyes and sap the life. You will sow your seed in vain, for your enemies will consume the crop. "},{"num":17,"verse":"I will turn against you, and you will be beaten down before your enemies and your foes will lord it over you. You will flee though no one pursues you."},{"num":18,"verse":"If even after this you do not obey me, I will increase the chastisement for your sins sevenfold, "},{"num":19,"verse":"to break your proud strength. I will make the sky above you as hard as iron, and your soil as hard as bronze, "},{"num":20,"verse":"so that your strength will be spent in vain; your land will bear no crops, and its trees no fruit."},{"num":21,"verse":"If then you continue hostile, unwilling to obey me, I will multiply my blows sevenfold, as your sins deserve. "},{"num":22,"verse":"I will unleash wild beasts against you, to rob you of your children and wipe out your livestock, till your population dwindles away and your roads become deserted."},{"num":23,"verse":"If, with all this, you still do not accept my discipline and continue hostile to me, "},{"num":24,"verse":"I, too, will continue to be hostile to you and I, for my part, will smite you for your sins sevenfold. "},{"num":25,"verse":"I will bring against you the sword, the avenger of my covenant. Though you then huddle together in your cities, I will send pestilence among you, till you are delivered to the enemy. "},{"num":26,"verse":"When I break your staff of bread, ten women will need but one oven for baking your bread, and they shall dole it out to you by weight; and though you eat, you shall not be satisfied."},{"num":27,"verse":"If, despite all this, you disobey and continue hostile to me, "},{"num":28,"verse":"I will continue in my hostile rage toward you, and I myself will discipline you for your sins sevenfold, "},{"num":29,"verse":"till you begin to eat the flesh of your own sons and daughters. "},{"num":30,"verse":"I will demolish your high places, overthrow your incense stands, and cast your corpses upon the corpses of your idols. In my loathing of you, "},{"num":31,"verse":"I will lay waste your cities and desolate your sanctuaries, refusing your sweet-smelling offerings. "},{"num":32,"verse":"So devastated will I leave the land that your enemies who come to live there will stand aghast at the sight of it. "},{"num":33,"verse":"And you I will scatter among the nations at the point of my drawn sword, leaving your countryside desolate and your cities deserted. "},{"num":34,"verse":"Then shall the land, during the time it lies waste, make up its lost sabbaths, while you are in the land of your enemies; then shall the land have rest and make up for its sabbaths "},{"num":35,"verse":"during all the time that it lies desolate, enjoying the rest that you would not let it have on your sabbaths when you lived there."},{"num":36,"verse":"Those of you who survive in the lands of their enemies, I will make so fainthearted that the sound of a driven leaf will pursue them, and they shall run as if from the sword, and fall though no one pursues them; "},{"num":37,"verse":"stumbling over one another as if to escape a sword, while no one is after them—so helpless will you be to take a stand against your foes! "},{"num":38,"verse":"You shall perish among the nations, swallowed up in your enemies’ country. "},{"num":39,"verse":"Those of you who survive will waste away in the lands of their enemies, for their own and their ancestors’ guilt."},{"num":40,"verse":"They will confess their iniquity and the iniquity of their ancestors in their treachery against me and in their continued hostility toward me, "},{"num":41,"verse":"so that I, too, had to be hostile to them and bring them into their enemies’ land. Then, when their uncircumcised hearts are humbled and they make amends for their iniquity, "},{"num":42,"verse":"I will remember my covenant with Jacob, and also my covenant with Isaac; and also my covenant with Abraham I will remember. The land, too, I will remember. "},{"num":43,"verse":"The land will be forsaken by them, that in its desolation without them, it may make up its sabbaths, and that they, too, may make good the debt of their guilt for having spurned my decrees and loathed my statutes. "},{"num":44,"verse":"Yet even so, even while they are in their enemies’ land, I will not reject or loathe them to the point of wiping them out, thus making void my covenant with them; for I, the Lord, am their God. "},{"num":45,"verse":"I will remember for them the covenant I made with their forebears, whom I brought out of the land of Egypt before the eyes of the nations, that I might be their God. I am the Lord."},{"num":46,"verse":"These are the statutes, decrees and laws which the Lord established between himself and the Israelites through Moses on Mount Sinai."}]