[{"num":26,"verse":"“You must have no idols; you must never worship carved images, obelisks, or shaped stones, for I am the Lord your God. "},{"num":2,"verse":"You must obey my Sabbath laws of rest, and reverence my Tabernacle, for I am the Lord."},{"num":3,"verse":"“If you obey all of my commandments, "},{"num":4,"verse":"I will give you regular rains, and the land will yield bumper crops, and the trees will be loaded with fruit long after the normal time! And grapes will still be ripening when sowing time comes again. You shall eat your fill, and live safely in the land, "},{"num":6,"verse":"for I will give you peace, and you will go to sleep without fear. I will chase away the dangerous animals. "},{"num":7,"verse":"You will chase your enemies; they will die beneath your swords. "},{"num":8,"verse":"Five of you will chase a hundred, and a hundred of you, ten thousand! You will defeat all of your enemies. "},{"num":9,"verse":"I will look after you, and multiply you, and fulfill my covenant with you. "},{"num":10,"verse":"You will have such a surplus of crops that you won’t know what to do with them when the new harvest is ready! "},{"num":11,"verse":"And I will live among you and not despise you. "},{"num":12,"verse":"I will walk among you and be your God, and you shall be my people. "},{"num":13,"verse":"For I am the Lord your God who brought you out of the land of Egypt, so that you would be slaves no longer; I have broken your chains so that you can walk with dignity."},{"num":14,"verse":"“But if you will not listen to me or obey me, "},{"num":15,"verse":"but reject my laws, "},{"num":16,"verse":"this is what I will do to you: I will punish you with sudden terrors and panic, and with tuberculosis and burning fever; your eyes shall be consumed and your life shall ebb away; you will sow your crops in vain, for your enemies will eat them. "},{"num":17,"verse":"I will set my face against you and you will flee before your attackers; those who hate you will rule you; you will even run when no one is chasing you!"},{"num":18,"verse":"“And if you still disobey me, I will punish you seven times more severely for your sins. "},{"num":19,"verse":"I will break your proud power and make your heavens as iron and your earth as bronze. "},{"num":20,"verse":"Your strength shall be spent in vain; for your land shall not yield its crops, nor your trees their fruit."},{"num":21,"verse":"“And if even then you will not obey me and listen to me, I will send you seven times more plagues because of your sins. "},{"num":22,"verse":"I will send wild animals to kill your children and destroy your cattle and reduce your numbers so that your roads will be deserted."},{"num":23,"verse":"“And if even this will not reform you, but you continue to walk against my wishes, "},{"num":24,"verse":"then I will walk against your wishes, and I, even I, will personally smite you seven times for your sin. "},{"num":25,"verse":"I will revenge the breaking of my covenant by bringing war against you. You will flee to your cities, and I will send a plague among you there; and you will be conquered by your enemies. "},{"num":26,"verse":"I will destroy your food supply so that one oven will be large enough to bake all the bread available for ten entire families; and you will still be hungry after your pittance has been doled out to you."},{"num":27,"verse":"“And if you still won’t listen to me or obey me, "},{"num":28,"verse":"then I will let loose my great anger and send you seven times greater punishment for your sins. "},{"num":29,"verse":"You shall eat your own sons and daughters, "},{"num":30,"verse":"and I will destroy the altars on the hills where you worship your idols, and I will cut down your incense altars, leaving your dead bodies to rot among your idols; and I will abhor you. "},{"num":31,"verse":"I will make your cities desolate, and destroy your places of worship, and will not respond to your incense offerings. "},{"num":32,"verse":"Yes, I will desolate your land; your enemies shall live in it, utterly amazed at what I have done to you."},{"num":33,"verse":"“I will scatter you out among the nations, destroying you with war as you go. Your land shall be desolate and your cities destroyed. "},{"num":34,"verse":"Then at last the land will rest and make up for the many years you refused to let it lie idle; for it will lie desolate all the years that you are captives in enemy lands. Yes, then the land will rest and enjoy its Sabbaths! It will make up for the rest you didn’t give it every seventh year when you lived upon it."},{"num":36,"verse":"“And for those who are left alive, I will cause them to be dragged away to distant lands as prisoners of war and slaves. There they will live in constant fear. The sound of a leaf driven in the wind will send them fleeing as though chased by a man with a sword; they shall fall when no one is pursuing them. "},{"num":37,"verse":"Yes, though none pursue they shall stumble over each other in flight, as though fleeing in battle, with no power to stand before their enemies. "},{"num":38,"verse":"You shall perish among the nations and be destroyed among your enemies. "},{"num":39,"verse":"Those left shall pine away in enemy lands because of their sins, the same sins as those of their fathers."},{"num":40,"verse":"“But at last they shall confess their sins and their fathers’ sins of treachery against me. (Because they were against me, I was against them, and brought them into the land of their enemies.) When at last their evil hearts are humbled and they accept the punishment I send them for their sins, "},{"num":42,"verse":"then I will remember again my promises to Abraham, Isaac, and Jacob, and I will remember the land (and its desolation). "},{"num":43,"verse":"For the land shall enjoy its Sabbaths as it lies desolate. But then at last they shall accept their punishment for rejecting my laws and for despising my rule. "},{"num":44,"verse":"But despite all they have done, I will not utterly destroy them and my covenant with them, for I am Jehovah their God. "},{"num":45,"verse":"For their sakes I will remember my promises to their ancestors to be their God. For I brought their forefathers out of Egypt as all the nations watched in wonder. I am Jehovah.”"},{"num":46,"verse":"These were the laws, ordinances, and instructions that Jehovah gave to the people of Israel, through Moses, on Mount Sinai."}]