[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(1) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "As the hart panteth.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—“I have seen large flocks of these panting harts gather round the water-brooks in the great deserts of central Syria, so subdued by thirst that you could approach quite near them before they fled” (Thomson, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Land and Book, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "p. 172).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 42:1-2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 42:1-2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "As the hart panteth — ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "תערג",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "tagnarog, brayeth: ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "“The word is strong, and expresses that eagerness and fervency of desire, which extreme thirst may be supposed to raise in an animal almost spent in its flight from the pursuing dogs. Nothing can give us a higher idea of the psalmist’s ardent and inexpressible longing to attend the public worship of God than the burning thirst of such a hunted creature for a cooling and refreshing draught of water.” ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "So panteth my soul after thee, O God — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "After the enjoyment of thee in thy sanctuary, as appears from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 42:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "My soul thirsteth for God ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Thirst is more vehement than hunger, and more impatient of dissatisfaction; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for the living God — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Him who is the eternal spring of life and comfort. This he mentions as a just cause of his thirst. He did not thirst after vain, useless idols, but after the only true and living God, who was his ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "life, and the length of his days, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 30:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; without whose presence and favour David accounted himself for a dead and lost man; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "when shall I come and appear before God — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "In the place of his special presence and public worship? When, when will the happy hour return that I shall once more have access to his tabernacle, where he manifests his presence, and from which I am now driven by them who seek my life? Archbishop Sharp’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Sermons, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "vol. 3. p. 2.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "42:1-5 The psalmist looked to the Lord as his chief good, and set his heart upon him accordingly; casting anchor thus at first, he rides out the storm. A gracious soul can take little satisfaction in God's courts, if it do not meet with God himself there. Living souls never can take up their rest any where short of a living God. To appear before the Lord is the desire of the upright, as it is the dread of the hypocrite. Nothing is more grievous to a gracious soul, than what is intended to shake its confidence in the Lord. It was not the remembrance of the pleasures of his court that afflicted David; but the remembrance of the free access he formerly had to God's house, and his pleasure in attending there. Those that commune much with their own hearts, will often have to chide them. See the cure of sorrow. When the soul rests on itself, it sinks; if it catches hold on the power and promise of God, the head is kept above the billows. And what is our support under present woes but this, that we shall have comfort in Him. We have great cause to mourn for sin; but being cast down springs from unbelief and a rebellious will; we should therefore strive and pray against it.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "As the hart panteth after the water-brooks - Margin, brayeth. The word rendered hart - איל  'ayâl - means commonly a stag, hart, male deer: ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 12:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 14:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 35:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The word is masculine, but in this place is joined with a feminine verb, as words of the common gender may be, and thus denotes a hind, or female deer. The word rendered in the text \"panteth,\" and in the margin \"brayeth\" - ערג  ‛ârag - occurs only in this place and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 1:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where it is applied to the beasts of the field as \"crying\" to God in a time of drought. The word properly means to rise; to ascend; and then, to look up toward anything; to long for. It refers here to the intense desire of the hind, in the heat of day, for water; or, in Joel, to the desire of the cattle for water in a time of drought. Luther renders it \"cries;\" the Septuagint and Vulgate render it simply \"desires.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Neither the idea of panting nor braying seems to be in the original word. It is the idea of looking for, longing for, desiring, that is expressed there. By 'water-brooks' are meant the streams that run in vallies. Dr. Thomson (Land and the Book, vol. i., p. 253) says, \"I have seen large flocks of these panting harts gather round the water-brooks in the great deserts of Central Syria, so subdued by thirst that you could approach quite near them before they fled.\" There is an idea of tenderness in the reference to the word \"hart\" here - female deer, gazelle - which would not strike us if the reference had been to any other animal. These are so timid, so gentle, so delicate in their structure, so much the natural objects of love and compassion, that our feelings are drawn toward them as to all other animals in similar circumstances. We sympathize with them; we pity them; we love them; we feel deeply for them when they are pursued, when they fly away in fear, when they are in want. The following engraving will help us more to appreciate the comparison employed by the psalmist. Nothing could more beautifully or appropriately describe the earnest longing of a soul after God, in the circumstances of the psalmist, than this image.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "So panteth my soul after thee, O God - So earnest a desire have I to come before thee, and to enjoy thy presence and thy favor. So sensible am I of want; so much does my soul need something that can satisfy its desires. This was at first applied to the case of one who was cut off from the privileges of public worship, and who was driven into exile far from the place where he had been accustomed to unite with others in that service Psalm 42:4; but it will also express the deep and earnest feelings of the heart of piety at all times, and in all circumstances, in regard to God. There is no desire of the soul more intense than that which the pious heart has for God; there is no want more deeply felt than that which is experienced when one who loves God is cut off by any cause from communion with him. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "So panteth my soul after thee, O God - So earnest a desire have I to come before thee, and to enjoy thy presence and thy favor. So sensible am I of want; so much does my soul need something that can satisfy its desires. This was at first applied to the case of one who was cut off from the privileges of public worship, and who was driven into exile far from the place where he had been accustomed to unite with others in that service ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 42:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; but it will also express the deep and earnest feelings of the heart of piety at all times, and in all circumstances, in regard to God. There is no desire of the soul more intense than that which the pious heart has for God; there is no want more deeply felt than that which is experienced when one who loves God is cut off by any cause from communion with him. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 42:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 42:1",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "PSALM 42",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ps 42:1-11. Maschil—(See on [587]Ps 32:1, title). For, or of (see [588]Introduction) the sons of Korah. The writer, perhaps one of this Levitical family of singers accompanying David in exile, mourns his absence from the sanctuary, a cause of grief aggravated by the taunts of enemies, and is comforted in hopes of relief. This course of thought is repeated with some variety of detail, but closing with the same refrain.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1, 2. Compare (Ps 63:1).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "panteth—desires in a state of exhaustion.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "panteth—desires in a state of exhaustion.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "The Treasury of David",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1 As the hart panteth after the water brooks, so panteth my soul after thee, O God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "2 My soul thirsteth for God, for the living God; when shall I come and appear before God?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "3 My tears have been my meat day and night, while they continually say unto me, Where is thy God?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "4 When I remember these things, I pour out my soul in me: for I had gone with the multitude, I went with them to the house of God, with the voice of joy and praise, with a multitude that kept holyday.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "5 Why art thou cast down, O my soul? and why art thou disquieted in me? hope thou in God: for I shall yet praise him for the help of his countenance.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 42:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 42:1",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"As the hart panteth after the waterbrooks, so panteth my soul after thee, 0 God.\" As after a long drought the poor fainting hind longs for the streams, or rather as the hunted hart instinctively seeks after the river to lave its smoking flanks and to escape the dogs, even so my weary, persecuted soul pants after the Lord my God. Debarred from public worship, David was heartsick. Ease he did not seek, honour he did not covet, but the enjoyment of communion with God was an urgent need of his soul; he viewed it not merely as the sweetest of all luxuries, but as an absolute necessity, like water to a stag. Like the parched traveller in the wilderness, whose skin bottle is empty, and who finds the wells dry, he must drink or die - he must have his God or faint. His soul, his very self, his deepest life, was insatiable for a sense of the divine presence. As the hart brays so his soul prays. Giro him his God and he is as content as the poor deer which at length slakes its thirst and is perfectly happy; but deny him his Lord, and his heart heaves, his bosom palpitates, his whole frame is convulsed, like one who gasps for breath, or pants with long running. Dear reader, dost thou know what this is, by personally having felt the same? It is a sweet bitterness. The next best thing to living in the light of the Lord's love is to be unhappy till we have it, and to pant hourly after it - hourly, did I say? thirst is a perpetual appetite, and not to be forgotten, and even thus continual is the heart's longing after God. When it is as natural for us to long for God as for an animal to thirst, it is well with our souls, however painful our feelings. We may learn from this verse that the eagerness of our desires may be pleaded with God, and the more so, because there are special promises for the importunate and fervent.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 42:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 42:2",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"My soul.\" All my nature, my inmost self. \"Thirsteth.\" Which is more than hungering; hunger you can palliate, but thirst is awful, insatiable, clamorous, deadly. O to have the most intense craving after the highest good! this is no questionable mark of grace. \"For God.\" Not merely for the temple and the ordinances, but for fellowship with God himself. None but spiritual men can sympathise with this thirst. \"For the living God.\" Because he lives, and gives to men the living water; therefore we, with greater eagerness, desire him. A dead God is a mere mockery; we loathe such a monstrous deity; but the ever-living God, the perennial fountain of life and light and love, is our soul's desire. What are gold, honour, pleasure, but dead idols? May we never pant for these. \"When shall I come and appear before God?\" He who loves the Lord loves also the assemblies wherein his name is adored. Vain are all pretences to religion where the outward means of grace have no attraction. David was never so much at home as in the house of the Lord; he was not content with private worship; he did not forsake the place where saints assemble, as the manner of some is. See how pathetically he questions as to the prospect of his again uniting in the joyous gathering! How he repeats and reiterates his desire! After his God, his Elohim (his God to be worshipped, who had entered into covenant with him), he pined even as the drooping flowers for the dew, or the moaning turtle for her mate. It were well if all our resortings to public worship were viewed as appearances before God, it would then be a sure mark of grace to delight in them. Alas, how many appear before the minister, or their fellow men, and think that enough! \"To see the face of God\" is the nearer translation of the Hebrew; but the two ideas may be combined - he would see his God and be seen of him; this is worth thirsting after!",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 42:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 42:3",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"My tears have been my meat day and night.\" Salt meats, but healthful to the soul. When a man comes to tears, constant tears, plenteous tears, tears that fill his cup and trencher, he is in earnest indeed. As the big tears stand in the stag's eyes in her distress, so did the salt drops glitter in the eyes of David. His appetite was gone, his tears not only seasoned his meat, but became his only meat, he had no mind for other diet. Perhaps it was well for him that the heart could open the safety valves; there is a dry grief far more terrible than showery sorrows. His tears since they were shed because God was blasphemed, were \"honourable dew,\" drops of holy water, such as Jehovah putteth into his bottle. \"While they continually say unto me, Where is thy God?\" Cruel taunts come naturally from coward minds. Surely they might have left the mourner alone; he could weep no more than he did - it was a supererogation of malice to pump more tears from a heart which already overflowed. Note how incessant was their jeer, and how artfully they framed it! It cut the good man to the bone to have the faithfulness of his God impugned. They had better have thrust needles into his eyes than have darted insinuations against his God. Shimei may here be alluded to who after this fashion mocked David as he fled from Absalom. He roundly asserted that David was a bloody man, and that God was punishing him for supplanting Saul and his house; his wish was father to his thought. The wicked know that our worst misfortune would be to lose God's favour, hence their diabolical malice leads them-to declare that such is the case. Glory be to God, they lie in their throats, for our God is in the heavens, ay, and in the furnace too, succouring his people.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 42:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 42:4",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"When I remember these things, I pour out my soul in me.\" When he harped upon his woes his heart melted into water and was poured out upon itself. God hidden, and foes raging, a pair of evils enough to bring down the stoutest heart! Yet why let reflections so gloomy engross us, since the result is of no value: merely to turn the soul on itself, to empty it from itself into itself is useless, how much better to pour out the heart before the Lord! The prisoner's treadwheel might sooner land him in the skies than mere inward questioning raise us nearer to consolation. \"For I had gone with the multitude, I went with them to the house of God.\" Painful reflections were awakened by the memory of past joys; he had mingled in the pious throng, their numbers had helped to give him exhilaration and to awaken holy delight, their company had been a charm to him as with them he ascended the hill of Zion. Gently proceeding with holy ease, in comely procession, with frequent strains of song, he and the people of Jehovah had marched in reverent ranks up to the shrine of sacrifice, the dear abode of peace and holiness. Far away from such goodly company the holy man pictures the sacred scene and dwells upon the details of the pious march. \"With the voice of joy and praise, with a multitude that kept holyday.\" The festive noise is in his ears, and the solemn dance before his eyes. Perhaps he alludes to the removal of the ark and to the glorious gatherings of the tribes on that grand national holy day and holiday. How changed his present place! For Zion, a wilderness.; for the priests in white linen, soldiers in garments of war; for the song, the sneer of blasphemy; for the festivity, lamentation; for joy in the Lord, a mournful dirge over his absence.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"I sigh to think of happier days",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...THE ARGUMENT The penman of this Psalm is uncertain. as not being named in the title. It was composed either, 1. By David, when he was banished from the house of God, either by Saul’s tyranny, or by Absalom’s rebellion; or, 2. By the sons of Korah, in the time of the captivity of Babylon; whence some read the words of the title of this Psalm, Maschil of the sons of Korah. But this is not usual in this book, to name the author of a Psalm so obscurely and indefinitely; for the sons of Korah were a numerous company. and it is not likely that either all or divers of them did join in the inditing of this and the following Psalms so called. Nor is there any one Psalm where the author is named. but he is one certain and single person. And therefore it seems more probable that David penned this, as it is confessed he did some other Psalms which have not his name in the title. Who were an eminent order of. singers in the house of God; of whom see 1 Chronicles 6:33 9:19 26:1. The psalmist being deprived of God’s service, ardently desires to be in his house again, Psalm 42:1-4; rouseth up his soul unto a firm hope and confidence in God, Psalm 42:5-9. His enemies reproach him, Psalm 42:10. His faith in God, Psalm 42:11.  The hart is naturally hot and thirsty. And this thirst is increased, partly by its dwelling in desert and dry places, to which it retireth for fear of men and wild beasts; and partly by its long and violent running, when it is pursued by the hunters; and some add, by eating of serpents. After thee;  after the enjoyment of thee in thy sanctuary, as it appears from Psalm 42:4. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "continued...",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "THE ARGUMENT",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "The penman of this Psalm is uncertain. as not being named in the title. It was composed either, ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "1. By David, when he was banished from the house of God, either by Saul’s tyranny, or by Absalom’s rebellion; or, ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "2. By the sons of Korah, in the time of the captivity of Babylon; whence some read the words of the title of this Psalm, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Maschil of the sons of Korah",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". But this is not usual in this book, to name the author of a Psalm so obscurely and indefinitely; for the sons of Korah were a numerous company. and it is not likely that either all or divers of them did join in the inditing of this and the following Psalms so called. Nor is there any one Psalm where the author is named. but he is one certain and single person. And therefore it seems more probable that David penned this, as it is confessed he did some other Psalms which have not his name in the title. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Who were an eminent order of. singers in the house of God; of whom see ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "1 Chronicles 6:33 9:19 26:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "The psalmist being deprived of God’s service, ardently desires to be in his house again, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 42:1-4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; rouseth up his soul unto a firm hope and confidence in God, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 42:5-9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". His enemies reproach him, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 42:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". His faith in God, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 42:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " The hart is naturally hot and thirsty. And this thirst is increased, partly by its dwelling in desert and dry places, to which it retireth for fear of men and wild beasts; and partly by its long and violent running, when it is pursued by the hunters; and some add, by eating of serpents. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "After thee; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " after the enjoyment of thee in thy sanctuary, as it appears from ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 42:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "As the hart panteth after the water brooks,.... Either through a natural thirst that creature is said to have; or through the heat of the summer season; and especially when hunted by dogs, it betakes itself to rivers of water, partly to make its escape, and partly to extinguish its thirst, and refresh itself. The word here used denotes the cry of the hart, when in distress for water, and pants after it, and is peculiar to it; and the verb being of the feminine gender, hence the Septuagint render it the \"hind\"; and Kimchi conjectures that the reason of it may be, because the voice of the female may be stronger than that of the male; but the contrary is asserted by the philosopher (c), who says, that the male harts cry much stronger than the females; and that the voice of the female is short, but that of the male is long, or protracted. Schindler (d) gives three reasons why these creatures are so desirous of water; because they were in desert places, where water was wanting; and another, that being heated by destroying and eating serpents, they coveted water to refresh themselves; and the third, when followed by dogs, they betake themselves into the water, and go into that for safety; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "so panteth my soul after thee, O God; being persecuted by men, and deprived of the word and worship of God, which occasioned a vehement desire after communion with him in his house and ordinances: some render the words, \"as the field\", or \"meadow, desires the shower\", &c. (e); or thirsts after it when parched with drought; see Isaiah 35:7; and by these metaphors, one or the other, is expressed the psalmist's violent and eager thirst after the enjoyment of God in public worship. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "so panteth my soul after thee, O God; being persecuted by men, and deprived of the word and worship of God, which occasioned a vehement desire after communion with him in his house and ordinances: some render the words, \"as the field\", or \"meadow, desires the shower\", &c. (e); or thirsts after it when parched with drought; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 35:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and by these metaphors, one or the other, is expressed the psalmist's violent and eager thirst after the enjoyment of God in public worship. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) Aristot. Hist. Animal. l. 4. c. 11. (d) Lexic. Pentaglott. Colossians 68. so Kimchi. (e) Sept. & Symmachus apud Drusium. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(c) Aristot. Hist. Animal. l. 4. c. 11. (d) Lexic. Pentaglott. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Colossians 68",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". so Kimchi. (e) Sept. & Symmachus apud Drusium. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "<{a}",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "<",
            "children": []
          },
          {
            "element": "to",
            "class": "cverse3",
            "text": "{a}",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " for the sons of Korah.>> As the hart ",
        "children": []
      },
      {
        "element": "span",
        "class": "cverse3",
        "text": "{b}",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " panteth after the water brooks, so panteth my soul after thee, O God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) As a treasure to be kept by them, who were of the number of the Levites.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) By these comparisons of the thirst and panting, he shows his fervent desire to serve God in his temple.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". As a hind which panteth for water-brooks,",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "So panteth my soul for Thee, O God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Render hind, not ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "hart",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", for the verb is feminine, and the timorous hind is the apter emblem for the soul. The parallel in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 1:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (the only other instance of the verb) makes it clear that the figure is suggested by the sufferings of wild animals in a prolonged drought (cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 14:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " f.), not by the hind “heated in the chase,” and deterred by the fear of its pursuers from descending into the valley to slake its thirst.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1, 2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The yearning of the Psalmist’s soul for communion with God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 1.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "As the hart panteth after the water-brooks.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Stags and hinds need abundant water, especially in hot countries, and, in time of drought, may be said, with a slight poetical licence, to \"pant,\" or \"cry\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 1:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") for it. They are still found in Palestine (Tristram, ' Land of Israel,' pp. 418, 447), though rather scarce. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "So panteth my",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "soul after thee, O God.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The \"panting\" of the soul does not mean any physical action, but a longing desire for a Messing that is, at any fate for a time, withheld. Psalm 42:1",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(Heb.: 42:2-6) The poet compares the thirsting of his soul after God to the thirsting of a stag. איּל (like other names of animals is epicoene, so that there is no necessity to adopt Bצttcher's emendation כּעיּלת תערג) is construed with a feminine predicate in order to indicate the stag (hind) as an image of the soul. ערג is not merely a quiet languishing, but a strong, audible thirsting or panting for water, caused by prevailing drought, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 63:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 1:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; the signification desiderare refers back to the primary notion of inclinare (cf. Arab. 'l-mı̂l, the act of inclining), for the primary meaning of the verb Arab. ‛rj is to be slanting, inclined or bent, out of which has been developed the signification of ascending and moving upwards, which is transferred in Hebrew to an upward-directed longing. Moreover, it is not with Luther (lxx, Vulgate and authorized version) to be rendered: as the (a) stag crieth, etc., but (and it is accented accordingly): as a stag, which, etc. אפיק  equals  אפק is, according to its primary signification, a watercourse holding water (vid., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 18:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). By the addition of מים the full and flowing watercourse is distinguished from one that is dried up. על and אל point to the difference in the object of the longing, viz., the hind has this object beneath herself, the soul above itself; the longing of the one goes deorsum, the longing of the other sursum. The soul's longing is a thirsting לאל חי. Such is the name here applied to God (as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 84:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") in the sense in which flowing water is called living, as the spring or fountain of life (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 36:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") from which flows forth a grace that never dries up, and which stills the thirst of the soul. The spot where this God reveals Himself to him who seeks Him is the sanctuary on Zion: when shall I come and appear in the presence of Elohim?! The expression used in the Law for the three appearings of the Israelites in the sanctuary at solemn feasts is אל־פני ה נראה or את־פני, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 23:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 34:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Here we find instead of this expression, in accordance with the license of poetic brevity, the bare acc. localis which is even used in other instances in the definition of localities, e.g., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 40:44",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Bttcher, Olshausen, and others are of opinion that אראה in the mind of the poet is to be read אראה, and that it has only been changed into אראה through the later religious timidity; but the avoidance of the phrase ראה פּני ה is explained from the fundamental assumption of the Tra that a man could not behold God's פנים without dying, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 33:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The poet now tells us in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 42:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " what the circumstances were which drove him to such intense longing. His customary food does not revive him, tears are his daily bread, which day and night run down upon his mouth (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 80:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 102:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and that בּאמר, when say to him, viz., the speakers, all day long, i.e., continually: Where is thy God? Without cessation, these mocking words are continually heard, uttered again and again by those who are found about him, as their thoughts, as it were, in the soul of the poet. This derision, in the Psalms and in the Prophets, is always the keenest sting of pain: ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 79:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 115:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 71:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 2:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 7:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In this gloomy present, in which he is made a mock of, as one who is forsaken of God, on account of his trust in the faithfulness of the promises, he calls to remembrance the bright and cheerful past, and he pours out his soul within him (on the עלי used here and further on instead of בּי or בּקרבּי, and as distinguishing between the ego and the soul, vid., Psychol. S. 152; tr. p. 180), inasmuch as he suffers it to melt entirely away in pain (Job 30:16). As in Psalm 77:4, the cohortatives affirm that he yields himself up most thoroughly to this bittersweet remembrance and to this free outward expression of his pain אלּה (haecce) points forwards; the כּי (quod) which follows opens up the expansion of this word. The futures, as expressing the object of the remembrance, state what was a habit in the time past. עבר frequently signifies not praeterire, but, without the object that is passed over coming into consideration, porro ire. סך (a collateral form of סך), properly a thicket, is figuratively (cf. Isaiah 9:17; Isaiah 10:34) an interwoven mass, a mixed multitude. The rendering therefore is: that I moved on in a dense crowd (here the distinctive Zinnor). The form אדּדּם is Hithpa., as in Isaiah 38:15, after the form הדּמּה from the verb דּדה, \"to pass lightly and swiftly along,\" derived by reduplication from the root דא (cf. Arab. d'ud'u), which has the primary meaning to push, to drive (ἐλαύνειν, pousser), and in various combinations of the ד (דא, Arab. dah, דח, Arab. da‛, דב, דף) expresses manifold shades of onward motion in lighter or heavier thrusts or jerks. The suffix, as in גּדלני  equals  גּדל עמּי, Job 31:18 (Ges. 121, 4), denotes those in reference to whom, or connection with whom, this moving onwards took place, so that consequently אדּדּם includes within itself, together with the subjective notion, the transitive notion of אדדּם, for the singer of the Psalm is a Levite; as an example in support of this אדּדּם, vid., 2 Chronicles 20:27., cf. v. 21. המון חוגג is the apposition to the personal suffix of this אדדם: with them, a multitude keeping holy-day. In Psalm 42:6 the poet seeks to solace and encourage himself at this contrast of the present with the past: Why art thou thus cast down... (lxx ἵνα τί περίλυπος εἶ, κ. τ. λ., cf. Matthew 26:38; John 12:27). It is the spirit which, as the stronger and more valiant part of the man, speaks to the soul as to the σκεῦος ἀσθενέστερον; the spiritual man soothes the natural man. The Hithpa. השׁתּוחח, which occurs only here and in Psalm 43:1-5, signifies to bow one's self very low, to sit down upon the ground like a mourner (Psalm 35:14; Psalm 38:7), and to bend one's self downwards (Psalm 44:26). המה (the future of which Ben-Asher here points ותּהמי, but Ben-Naphtali ותּהמּי), to utter a deep groan, to speak quietly and mumbling to one's self. Why this gnawing and almost desponding grief? I shall yet praise Him with thanksgiving, praise ישׁוּעות פּניו, the ready succour of His countenance turned towards me in mercy. Such is the text handed down to us. Although it is, however, a custom with the psalmists and prophets not to express such refrainlike thoughts in exactly the same form and words (cf. Psalm 24:7, Psalm 24:9; Psalm 49:13, 21; Psalm 56:5, Psalm 56:11; Psalm 59:10, 18), nevertheless it is to be read here by a change in the division both of the words and the verses, according to Psalm 42:5 and Psalm 43:5, ישׁוּעות פּני ואלהי, as is done by the lxx (Cod. Alex.), Syriac, Vulgate, and most modern expositors. For the words ישׁועות פניו, though in themselves a good enough sense (vid., e.g., Psalm 44:4, Isaiah 64:9), produce no proper closing cadence, and are not sufficient to form a line of a verse.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In this gloomy present, in which he is made a mock of, as one who is forsaken of God, on account of his trust in the faithfulness of the promises, he calls to remembrance the bright and cheerful past, and he pours out his soul within him (on the עלי used here and further on instead of בּי or בּקרבּי, and as distinguishing between the ego and the soul, vid., Psychol. S. 152; tr. p. 180), inasmuch as he suffers it to melt entirely away in pain (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 30:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). As in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 77:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the cohortatives affirm that he yields himself up most thoroughly to this bittersweet remembrance and to this free outward expression of his pain אלּה (haecce) points forwards; the כּי (quod) which follows opens up the expansion of this word. The futures, as expressing the object of the remembrance, state what was a habit in the time past. עבר frequently signifies not praeterire, but, without the object that is passed over coming into consideration, porro ire. סך (a collateral form of סך), properly a thicket, is figuratively (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 9:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 10:34",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") an interwoven mass, a mixed multitude. The rendering therefore is: that I moved on in a dense crowd (here the distinctive Zinnor). The form אדּדּם is Hithpa., as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 38:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", after the form הדּמּה from the verb דּדה, \"to pass lightly and swiftly along,\" derived by reduplication from the root דא (cf. Arab. d'ud'u), which has the primary meaning to push, to drive (ἐλαύνειν, pousser), and in various combinations of the ד (דא, Arab. dah, דח, Arab. da‛, דב, דף) expresses manifold shades of onward motion in lighter or heavier thrusts or jerks. The suffix, as in גּדלני  equals  גּדל עמּי, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 31:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (Ges. 121, 4), denotes those in reference to whom, or connection with whom, this moving onwards took place, so that consequently אדּדּם includes within itself, together with the subjective notion, the transitive notion of אדדּם, for the singer of the Psalm is a Levite; as an example in support of this אדּדּם, vid., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 20:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "., cf. v. 21. המון חוגג is the apposition to the personal suffix of this אדדם: with them, a multitude keeping holy-day. In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 42:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the poet seeks to solace and encourage himself at this contrast of the present with the past: Why art thou thus cast down... (lxx ἵνα τί περίλυπος εἶ, κ. τ. λ., cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 26:38",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 12:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). It is the spirit which, as the stronger and more valiant part of the man, speaks to the soul as to the σκεῦος ἀσθενέστερον; the spiritual man soothes the natural man. The Hithpa. השׁתּוחח, which occurs only here and in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 43:1-5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", signifies to bow one's self very low, to sit down upon the ground like a mourner (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 35:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 38:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and to bend one's self downwards (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 44:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). המה (the future of which Ben-Asher here points ותּהמי, but Ben-Naphtali ותּהמּי), to utter a deep groan, to speak quietly and mumbling to one's self. Why this gnawing and almost desponding grief? I shall yet praise Him with thanksgiving, praise ישׁוּעות פּניו, the ready succour of His countenance turned towards me in mercy. Such is the text handed down to us. Although it is, however, a custom with the psalmists and prophets not to express such refrainlike thoughts in exactly the same form and words (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 24:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 24:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 49:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", 21; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 56:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 56:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 59:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", 18), nevertheless it is to be read here by a change in the division both of the words and the verses, according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 42:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 43:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ישׁוּעות פּני ואלהי, as is done by the lxx (Cod. Alex.), Syriac, Vulgate, and most modern expositors. For the words ישׁועות פניו, though in themselves a good enough sense (vid., e.g., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 44:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 64:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), produce no proper closing cadence, and are not sufficient to form a line of a verse.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Even an old Hebrew MS directs attention to the erroneousness of the Soph pasuk here; vid., Pinsker, Einleitung, S. 133 l.) ",
        "children": []
      }
    ]
  }
]