[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(45) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Philip findeth Nathanael.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 1:41",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 1:44",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Nathanael is the Hebrew of the Greek word Theodorus, God’s gift. The former is found in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 1:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Chronicles 2:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The latter is preserved in the names Theodore and Dorothea. He belonged to the town to which Jesus was going (Cana of, Galilee, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 21:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Philip then probably went with Jesus and found Nathanael at or near Cana (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 1:48",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). He is, perhaps, the same person as Bartholomew; but on this, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 21:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and Note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 10:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The more formal statement of the proof in this case, as compared with that of the two brothers (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 1:41",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), agrees with the general character of Philip and with the less close relationship.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Of Nazareth.—Better, from Nazareth. Nothing can be argued from these words, or those which follow, as to ignorance of the fact of, or the events attending, the birth at Bethlehem. It is to be noted that the words are Philip’s, not the writer’s. Very possibly, one who had been in the company of Jesus for a few hours only was then unacquainted with these incidents. In any case he expresses the common belief of the neighbourhood and the time, and it is an instance of St. John’s dramatic accuracy that he gives the words as they were spoken, and does not attempt to interpret them by later events or by his own knowledge. (Comp. John 7:42; John 7:52; John 8:53, et al.)",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Of Nazareth.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Better, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "from",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Nazareth. Nothing can be argued from these words, or those which follow, as to ignorance of the fact of, or the events attending, the birth at Bethlehem. It is to be noted that the words are Philip’s, not the writer’s. Very possibly, one who had been in the company of Jesus for a few hours only was then unacquainted with these incidents. In any case he expresses the common belief of the neighbourhood and the time, and it is an instance of St. John’s dramatic accuracy that he gives the words as they were spoken, and does not attempt to interpret them by later events or by his own knowledge. (Comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 7:42",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 7:52",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 8:53",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "et al.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ")",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "John",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "THE FIRST DISCIPLES: IV. NATHANAELJohn 1:45 - John 1:49",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "THE FIRST DISCIPLES: IV. NATHANAEL",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 1:45",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 1:49",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The words are often the least part of a conversation. The Evangelist can tell us what Nathanael said to Jesus, and what Jesus said to Nathanael, but no Evangelist can reproduce the look, the tone, the magnetic influence which streamed out from Christ, and, we may believe, more than anything He said, riveted these men to Him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " It looks as if Nathanael and his companions were very easily convinced, as if their adhesion to such tremendous claims as those of Jesus Christ was much too facile a thing to be a very deep one. But what can be put down in black and white goes a very short way to solve the secret of the power which drew them to Himself.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The incident which is before us now runs substantially on the same lines as the previous bringing of Peter to Jesus Christ. In both cases the man is brought by a friend, in both cases the friend’s weapon is simply the expression of his own personal experience, ‘We have found the Messias,’ although Philip has a little more to say about Christ’s correspondence with the prophetic word. In both cases the work is finished by our Lord Himself manifesting His own supernatural knowledge to the inquiring spirit, though in the case of Nathanael that process is a little more lengthened out than in the case of Peter, because there was a little ice of hesitation and of doubt to be melted away. And Nathanael, starting from a lower point than Peter, having questions and hesitations which the other had not, rises to a higher point of faith and certitude, and from his lips first of all comes the full articulate confession, beyond which the Apostles never went as long as our Lord was upon earth: ‘Rabbi, Thou art the Son of God; Thou art the King of Israel.’ So that both in regard to the revelation that is given of the character of our Lord, and in regard to the teaching that is given of the development and process of faith in a soul, this last narrative fitly crowns the whole series. In looking at it with you now, I think I shall best bring out its force by asking you to take it as falling into these three portions: first, the preparation-a soul brought to Christ by a brother; then the conversation-a soul fastened to Christ by Himself; and then the rapturous confession-’Rabbi, Thou art the Son of God; Thou art the King of Israel.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. Look, then, first of all, at the preparation-a soul brought to Christ by a brother. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. Look, then, first of all, at the preparation-a soul brought to Christ by a brother.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘Philip findeth Nathanael.’ Nathanael, in all probability, as commentators will tell you, is the Apostle Bartholomew; and in the catalogues of the Apostles in the Gospels, Philip and he are always associated together. So that the two men, friends before, had their friendship riveted and made more close by this sacredest of all bonds, that the one had been to the other the means of bringing him to Jesus Christ. There is nothing that ties men to each other like that. If you want to know the full sweetness of association with friends, and of human love, get some heart knit to yours by this sacred and eternal bond that it owes to you its first knowledge of the Saviour. So all human ties will be sweetened, ennobled, elevated, and made perpetual.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘We have found Him, of whom Moses in the law, and the prophets, did write: Jesus of Nazareth, the Son of Joseph.’ Philip knows nothing about Christ’s supernatural birth, nor about its having been in Bethlehem; to him He is the son of a Nazarene peasant. But, notwithstanding that, He is the great, significant, mysterious Person for whom the whole sacred literature of Israel had been one long yearning for centuries; and he has come to believe that this Man standing beside him is the Person on whom all previous divine communications for a millennium past focussed and centred.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " I need not dwell upon these words, because to do so would be to repeat substantially what I said in a former sermon on these first disciples, about the value of personal conviction as a means of producing conviction in the minds of others, and about the necessity and the possibility of all who have found Christ for themselves saying so to others, and thereby becoming His missionaries and evangelists.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " I do not need to repeat what I said on that occasion; therefore I pass on to the very natural hesitation and question of Nathanael: ‘Can there any good thing come out of Nazareth?’ A prejudice, no doubt, but a very harmless one; a very thin ice which melted as soon as Christ’s smile beamed upon him. And a most natural prejudice. Nathanael came from Cana of Galilee, a little hill village, three or four miles from Nazareth. We all know the bitter feuds and jealousies of neighbouring villages, and how nothing is so pleasant to the inhabitants of one as a gibe about the inhabitants of another. And in Nathanael’s words there simply speaks the rustic jealousy of Cana against Nazareth.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " It is easy to blame him, but do you think that you or I, if we had been in his place, would have been likely to have said anything very different? Suppose you were told that a peasant out of Ross-shire was a man on whom the whole history of this nation hung. Do you think you would be likely to believe it without first saying, ‘That is a strange place for such a person to be born in’? Galilee was the despised part of Palestine, and Nazareth obviously was a proverbially despised village of Galilee; and this Jesus was a carpenter’s son that nobody had ever heard of. It seemed to be a strange head on which the divine dove should flutter down, passing by all the Pharisees and the Scribes, all the great people and wise people. Nathanael’s prejudice was but the giving voice to a fault that is as wide as humanity, and which we have every day of our lives to fight with; not only in regard to religious matters but in regard to all others-namely, the habit of estimating people, and their work, and their wisdom, and their power to teach us, by the class to which they are supposed to belong, or even by the place from which they come.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘Can any good thing come out of Nazareth?’ ‘Can a German teach an Englishman anything that he does not know?’ ‘Is a Protestant to owe anything of spiritual illumination to a Roman Catholic?’ ‘Are we Dissenters to receive any wisdom or example from Churchmen?’ ‘Will a Conservative be able to give any lessons in politics to a Liberal?’ ‘Is there any other bit of England that can teach Lancashire?’ Take care that whilst you are holding up your hands in horror against the prejudices of our Lord’s contemporaries, who stumbled at His origin, you are not doing the same thing in regard to all manner of subjects twenty times a day.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " That is one very plain lesson, and not at all too secular for a sermon. Take another. This three-parts innocent prejudice of Nathanael brings into clear relief for us what a very real obstacle to the recognition of our Lord’s Messianic authority His apparent lowly origin was. We have got over it, and it is no difficulty to us; but it was so then. When Jesus Christ came into this world Judaea was ruled by the most heartless of aristocracies, an aristocracy of cultured pedants. Wherever you get such a class you get people who think that there can be nobody worth looking at, or worth attending to, outside the little limits of their own supercilious superiority. Why did Jesus Christ come from ‘the men of the earth,’ as the Rabbis called all who had not learned to cover every plain precept with spiders’ webs of casuistry? Why, for one thing, in accordance with the general law that the great reformers and innovators always come from outside these classes, that the Spirit of the Lord shall come on a herdsman like Amos, and fishermen and peasants spread the Gospel through the world; and that in politics, in literature, in science, as well as in religion, it is always true that ‘not many wise men after the flesh, not many mighty, not many noble are called.’ To the cultivated classes you have to look for a great deal that is precious and good, but for fresh impulse, in unbroken fields, you have to look outside them. And so the highest of all lives is conformed to the general law.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " More than that, ‘Jesus of Nazareth, the Son of Joseph,’ came thus because He was the poor man’s Christ, because He was the ignorant man’s Christ, because His word was not for any class, but as broad as the world. He came poor, obscure, unlettered, that all who, like Him, were poor and untouched by the finger of earthly culture, might in Him find their Brother, their Helper, and their Friend.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘Philip saith unto him, Come and see.’ He is not going to argue the question. He gives the only possible answer to it-’You ask Me, can any good thing come out of Nazareth?’ ‘Come and see whether it is a good thing or no; and if it is, and if it came out of Nazareth, well then, the question has answered itself.’ The quality of a thing cannot be settled by the origin of the thing.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " As it so happened, this Man did not come out of Nazareth at all, though neither Philip nor Nathanael knew it; but if He had, it would have been all the same. The right answer was ‘Come and see.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Now although, of course, there is no kind of correspondence between the mere prejudice of this man Nathanael and the rooted intellectual doubts of other generations, yet ‘Come and see’ carries in it the essence of all Christian apologetics. By far the wisest thing that any man who has to plead the cause of Christianity can do is to put Christ well forward, and let people look at Him, and trust Him to produce His own impression. We may argue round, and round, and round about Him for evermore, and we shall never convince as surely as by simply holding Him forth. ‘I, if I be lifted up, will draw all men unto Me.’ Yet we are so busy proving Christianity that we sometimes have no time to preach it; so busy demonstrating that Jesus Christ is this, that, and the other thing, or contradicting the notion that He is not this, that, and the other thing, that we forget simply to present Him for men to look at. Depend upon it, whilst argument has its function, and there are men that must be approached thereby; on the whole, and for the general, the best way of propagating Christianity is to proclaim it, and the second best way is to prove it. Our arguments do fare very often very much as did that elaborate discourse that a bishop once preached to prove the existence of a God, at the end of which a simple old woman who had not followed his reasoning very intelligently, exclaimed, ‘Well, for all he says, I can’t help thinking there is a God after all.’ The errors that are quoted to be confuted often remain more clear in the hearers’ minds than the attempted confutations. Hold forth Christ-cry aloud to men, ‘Come and see!’ and some eyes will turn and some hearts cleave to Him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And on the other side, dear brethren, you have not done fairly by Christianity until you have complied with this invitation, and submitted your mind and heart honestly to the influence and the impression that Christ Himself would make upon it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. We come now to the second stage-the conversation between Christ and Nathanael, where we see a soul fastened to Christ by Himself. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. We come now to the second stage-the conversation between Christ and Nathanael, where we see a soul fastened to Christ by Himself.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "In general terms, as I remarked, the method by which our Lord manifests His Messiahship to this single soul is a revelation of His supernatural knowledge of him. But a word or two may be said about the details. Mark the emphasis with which the Evangelist shows us that our Lord speaks this discriminating characterisation of Nathanael before Nathanael had come to Him: ‘He saw him coming.’ So it was not with a swift, penetrating glance of intuition that He read his character in his face. It was not that He generalised rapidly from one action which He had seen him do. It was not from any previous personal knowledge of him, for, obviously, from the words of Philip to Nathanael, the latter had never seen Jesus Christ. As Nathanael was drawing near Him, before he had done anything to show himself, our Lord speaks the words which show that He had read his very heart: ‘Behold an Israelite indeed, in whom is no guile.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " That is to say, here is a man who truly represents that which was the ideal of the whole nation. The reference is, no doubt, to the old story of the occasion on which Jacob’s name was changed to Israel. And we shall see a further reference to the same story in the subsequent verses. Jacob had wrestled with God in that mysterious scene by the brook Jabbok, and had overcome, and had received instead of the name Jacob, ‘a supplanter,’ the name of Israel, ‘for as a Prince hast thou power with God and hast prevailed.’ And, says Christ: ‘This man also is a son of Israel, one of God’s warriors, who has prevailed with Him by prayer.’ ‘In whom is no guile’-Jacob in his early life had been marked and marred by selfish craft. Subtlety and guile had been the very keynote of his character. To drive that out of him, years of discipline and pain and sorrow had been needed. And not until it had been driven out of him could his name be altered, and he become Israel. This man has had the guile driven out of him. By what process? The words are a verbal quotation from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 32:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 32:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : ‘Blessed is he whose transgression is forgiven, whose sin is covered. Blessed is the man unto whom the Lord imputeth not iniquity, and in whose spirit there is no guile.’ Clear, candid openness of spirit, and the freedom of soul from all that corruption which the Psalmist calls ‘guile,’ is the property of him only who has received it, by confession, by pardon, and by cleansing, from God. Thus Nathanael, in his wrestling, had won the great gift. His transgression had been forgiven; his iniquity had been covered; to him God had not imputed his sin; and in his spirit, therefore, there was no guile. Ah, brother! if that black drop is to be cleansed out of your heart, it must be by the same means-confession to God and pardon from God. And then you too will be a prince with Him. and your spirit will be frank and free, and open and candid.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Nathanael, with astonishment, says, ‘Lord, whence knowest Thou me?’ Not that he appropriates the description to himself, or recognises the truthfulness of it, but he is surprised that Christ should have means of forming any judgment with reference to him, and so he asks Him, half expecting an answer which will show the natural origin of our Lord’s knowledge: ‘Whence knowest Thou me?’ Then comes the answer, which, to supernatural insight into Nathanael’s character, adds supernatural knowledge of Nathanael’s secret actions: ‘Before that Philip called thee, when thou wast under the fig tree, I saw thee. And it is because I saw thee under the fig-tree that I knew thee to be “an Israelite indeed, in whom there is no guile.”‘ So then, under the fig-tree, Nathanael must have been wrestling in prayer; under the fig-tree must have been confessing his sins; under the fig-tree must have been longing and looking for the Deliverer who was to ‘turn away ungodliness from Jacob.’ So solitary had been that vigil, and so little would any human eye that had looked upon it have known what had been passing in his mind, that Christ’s knowledge of it and of its significance at once lights up in Nathanael’s heart the fire of the glad conviction, ‘Thou art the Son of God.’ If we had seen Nathanael, we should only have seen a man sitting, sunk in thought, under a fig-tree; but Jesus had seen the spiritual struggle which had no outward marks, and to have known which He must have exercised the divine prerogative of reading the heart.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " I ask you to consider whether Nathanael’s conclusion was not right, and whether that woman of Samaria was not right when she hurried back to the city, leaving her water-pot, and said, ‘Come and see a man that told me all that ever I did.’ That ‘all’ was a little stretch of facts, but still it was true in spirit. And her inference was absolutely true: ‘Is not this the Christ, the Son of God?’ This is the first miracle that Jesus Christ wrought. His supernatural knowledge, which cannot be struck out from the New Testament representations of His character, is as much a mark of divinity as any of the other of His earthly manifestations. It is not the highest; it does not appeal to our sympathies as some of the others do, but it is irrefragable. Here is a man to whom all men with whom He came in contact were like those clocks with a crystal face which shows us all the works. How does He come to have this perfect and absolute knowledge?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " That omniscience, as manifested here, shows us how glad Christ is when He sees anything good, anything that He can praise in any of us. ‘Behold an Israelite indeed, in whom there is no guile.’ Not a word about Nathanael’s prejudice, not a word about any of his faults {though no doubt he had plenty of them}, but the cordial praise that he was an honest, a sincere man, following after God and after truth. There is nothing which so gladdens Christ as to see in us any faint traces of longing for, and love towards, and likeness to, His own self. His omniscience is never so pleased as when beneath heaps and mountains of vanity and sin it discerns in a man’s heart some poor germ of goodness and longing for His grace.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And then again, notice how we have here our Lord’s omniscience set forth as cognisant of all our inward crises and struggles, ‘When thou wast under the fig tree, I saw thee.’ I suppose all of us could look back to some place or other, under some hawthorn hedge, or some boulder by the seashore, or some mountain-top, or perhaps in some back-parlour, or in some crowded street, where some never-to-be-forgotten epoch in our soul’s history passed, unseen by all eyes, and which would have shown no trace to any onlooker, except perhaps a tightly compressed lip. Let us rejoice to feel that Christ sees all these moments which no other eye can see. In our hours of crisis, and in our monotonous, uneventful moments, in the rush of the furious waters, when the stream of our lives is caught among rocks, and in the long, languid reaches of its smoothest flow, when we are fighting with our fears or yearning for His light, or even when sitting dumb and stolid, like snow men, apathetic and frozen in our indifference, He sees us, and pities, and will help the need which He beholds.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘Think not thou canst sigh a sigh,And thy Saviour is not by;Think not thou canst weep a tear,And thy Saviour is not near.’ ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "‘Think not thou canst sigh a sigh,",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "And thy Saviour is not by;",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Think not thou canst weep a tear,",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "And thy Saviour is not near.’",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘When thou wast under the fig tree, I saw thee.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. One word more about this rapturous confession, which crowns the whole: ‘Rabbi, Thou art the Son of God; Thou art the King of Israel.’ ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. One word more about this rapturous confession, which crowns the whole: ‘Rabbi, Thou art the Son of God; Thou art the King of Israel.’",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Where had Nathanael learned these great names? He was a disciple of John the Baptist, and he had no doubt heard John’s testimony as recorded in this same chapter, when he told us how the voice from Heaven had bid him recognise the Messiah by the token of the descending Dove, and how he ‘saw and bare record that this is the Son of God.’ John’s testimony was echoed in Nathanael’s confession. Undoubtedly he attached but vague ideas to the name, far less articulate and doctrinal than we have the privilege of doing. To him ‘Son of God’ could not have meant all that it ought to mean to us, but it meant something that he saw clearly, and a great deal beyond that he saw but dimly. It meant that God had sent, and was in some special sense the Father of, this Jesus of Nazareth.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘Thou art the King of Israel,’ John had been preaching, ‘The Kingdom of Heaven is at hand.’ The Messiah was to be the theocratic King, the King, not of ‘Judah’ nor of ‘the Jews,’ but of ‘Israel,’ the nation that had entered into covenant with God. So the substance of the confession was the Messiahship of Jesus, as resting upon His special divine relationship and leading to His Kingly sway.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Notice also the enthusiasm of the confession; one’s ear hears clearly a tone of rapture in it. The joy-bells of the man’s heart are all a-ringing. It is no mere intellectual acknowledgment of Christ as Messiah. The difference between mere head-belief and heart-faith lies precisely in the presence of these elements of confidence, of enthusiastic loyalty, and absolute submission.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So the great question for each of us is, not, Do I believe as a piece of my intellectual creed that Christ is ‘the Messiah, the Son of God, the King of Israel’? I suppose almost all my hearers here now do that. That will not make you a Christian, my friend. That will neither save your soul nor quiet your heart, nor bring you peace and strength in life, nor open the gates of the Kingdom of Heaven to you. A man may be miserable, wholly sunk in all manner of wickedness and evil, die the death of a dog, and go to punishment hereafter, though he believe that Jesus Christ is the Son of God and the King of Israel. You want something more than that. You want just this element of rapturous acknowledgment, of loyal submission, absolute obedience, of unfaltering trust.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Look at these first disciples, six brave men that had all that loyalty and love to Him; though there was not a soul in the world but themselves to share their convictions. Do they not shame you? When He comes to you, as He does come, with this question, ‘Whom do ye say that I am?’ may God give you grace to answer, ‘Thou art the Christ, the Son of the living God,’ and not only to answer it with your lips, but to trust Him wholly with your hearts, and with enthusiastic devotion to bow your whole being in adoring wonder and glad submission at His feet. If we are ‘Israelites indeed,’ our hearts will crown Him as the ‘King of Israel.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "John 1:45-46",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 1:45-46",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Philip findeth Nathanael ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Nathanael is supposed by many to have been the person, who, in the catalogue of the apostles, is called Bartholomew, that is, as the word signifies, the son of Tholomew, for Matthew joins Bartholomew with Philip, chap. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 10:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and John places Nathanael in the midst of the apostles, immediately after Thomas, (chap. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 21:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) just as Bartholomew is placed, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 1:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And saith, We have found him of whom Moses did write ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— “It seems Peter and Andrew, in their conversation with Philip, had induced him to believe on Jesus, by showing him how the predictions of the law and the prophets were fulfilled in him, a method which, perhaps, Jesus himself had taken to confirm Peter and Andrew, Philip’s instructers, in the good opinion they had conceived of him, by means of the testimony which their master, John the Baptist, had given concerning him.” ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Can any good thing come out of Nazareth? ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— A proverb, by which the rest of the Israelites ridiculed the Nazarenes. Nathanael, on this occasion, applied it the rather, because the Messiah’s nativity had been determined by the Prophet Micah to Bethlehem. As if he had said, Have we ground from Scripture to expect the Messiah, or any eminent prophet, from Nazareth? As Nathanael was a native of Galilee, it appears from hence that the Galileans themselves had but an ill opinion of Nazareth, as worse than the rest of that country; and, indeed, by the figure its inhabitants make in the evangelists, they seem to have deserved it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Philip saith, Come and see ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Come talk with him thyself, and thou wilt soon be convinced that he is the Messiah. How cautiously should we guard against popular prejudices! When these had once possessed so honest a heart as even that of Nathanael, they led him to suspect the blessed Jesus himself for an impostor, because he had been brought up at Nazareth. But his integrity prevailed over that foolish bias, and laid him open to the force of evidence, which a candid inquirer will always be glad to admit, even when it brings the most unexpected discoveries.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1:43-51 See the nature of true Christianity, it is following Jesus; devoting ourselves to him, and treading in his steps. Observe the objection Nathanael made. All who desire to profit by the word of God, must beware of prejudices against places, or denominations of men. They should examine for themselves, and they will sometimes find good where they looked for none. Many people are kept from the ways of religion by the unreasonable prejudices they conceive. The best way to remove false notions of religion, is to make trial of it. In Nathanael there was no guile. His profession was not hypocritical. He was not a dissembler, nor dishonest; he was a sound character, a really upright, godly man. Christ knows what men are indeed. Does He know us? Let us desire to know him. Let us seek and pray to be Israelites indeed, in whom is no guile; truly Christians, approved of Christ himself. Some things weak, imperfect, and sinful, are found in all, but hypocrisy belongs not to a believer's character. Jesus witnessed what passed when Nathanael was under the fig-tree. Probably he was then in fervent prayer, seeking direction as to the Hope and Consolation of Israel, where no human eye observed him. This showed him that our Lord knew the secrets of his heart. Through Christ we commune with, and benefit by the holy angels; and things in heaven and things on earth are reconciled and united together.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Moses, in the law - Moses, in that part of the Old Testament which he wrote, called by the Jews \"the law.\" See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 18:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 18:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 49:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 3:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And the prophets - Isaiah 53:1-12; Isaiah 9:6-7; Daniel 9:24-27; Jeremiah 23:5-6; etc.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And the prophets - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 53:1-12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 9:6-7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 9:24-27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 23:5-6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; etc.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Jesus of Nazareth ... - They spoke according to common apprehension. They spoke of him as the son of Joseph because he was commonly supposed to be. They spoke of him as dwelling at Nazareth, though they might not have been ignorant that he was born at Bethlehem. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Jesus of Nazareth ... - They spoke according to common apprehension. They spoke of him as the son of Joseph because he was commonly supposed to be. They spoke of him as dwelling at Nazareth, though they might not have been ignorant that he was born at Bethlehem. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "45. Nathanael—(See on [1764]Mt 10:3).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Moses—(See Joh 5:46).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "son of Joseph—the current way of speaking. (See Lu 3:23).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Philip having himself discovered Christ, is not willing to eat his morsels alone, but desires to communicate his discovery to others; he finds (whether casually, or upon search, is not said) one Nathanael, he was of Cana in Galilee, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "John 21:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 21:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". (The name is a Hebrew name, signifying, The gift of God; some think it the same with Nethaneel, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1 Chronicles 15:24",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 15:24",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".) Having found him, he tells him with great joy, that they had found him of whom Moses had wrote in the law, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the Shiloh, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " mentioned ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 49:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 49:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", the Prophet, mentioned ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Deu 18:15",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deu 18:15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the Branch of the Lord, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " mentioned ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 4:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 4:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Messiah, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " mentioned by Daniel, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Daniel 9:25,26",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 9:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",26",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and all the other prophets, him whom they usually called ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Jesus of Nazareth, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "( there he was conceived, there he was bred, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Luke 2:4,51",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 2:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",51",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", though he was born in Bethlehem of Judah, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Luke 2:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 2:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "), and who was commonly thought to be ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the son of Joseph.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " If Philip did only ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cum vulgo loqui, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " speak as was commonly said, though himself knew and believed other things, he is not to be blamed; but the most think Philip discovered here his own weakness, both in thinking Christ the son of Joseph, and to have been born at Nazareth. It is certain that the apostles themselves at first, yea, and till Christ’s resurrection from the dead, had a very imperfect notion of Christ as the true Messiah. Grace may consist with great weakness as to knowledge. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Philip findeth Nathanael,.... Who was of Cana of Galilee, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 21:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and where, it is very likely, Philip found him; since we quickly read of Jesus, and his disciples being there. This man is thought, by some, to be the same with Bartholomew; and so he is called Bartholomew, in a Syriac dictionary (o); and the rather, since he and Philip are always mentioned together in the account of the apostles, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 10:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And certain it is, from the above mentioned place, that Nathanael was among the apostles after our Lord's resurrection; and it is highly probable was one of them? his name might be Nathanael bar Tholmai, the son of Tholmai, Ptolomy, or Tholomew. It is the same name with Nethaneel, and which is read Nathanael, as here, in: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"And of the sons of Phaisur; Elionas, Massias Israel, and Nathanael, and Ocidelus and Talsas.'' (1 Esdras 9:22) ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and by the Septuagint on 1 Chronicles 2:14 Nehemiah 12:36; and signifies one given of God; and is the same with Theodore in Greek, and Adeodatus in Latin; a doctor of this name, R. Nathaniel, is mentioned in the Jewish writings (p): ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and by the Septuagint on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 2:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nehemiah 12:36",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and signifies one given of God; and is the same with Theodore in Greek, and Adeodatus in Latin; a doctor of this name, R. Nathaniel, is mentioned in the Jewish writings (p): ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and saith unto him, we have found him of whom Moses, in the law, and the prophets, did write. He does not say, that he, and Andrew, and Simon, had found the Messiah; though he designs him by this circumlocution; Nathanael being, as is generally thought, a person well versed in the law, and the prophets, and so would at once know who Philip meant: for Moses, in the law, or Pentateuch, in the five books written by him, frequently speaks of the Messiah as the seed of the woman, that should break the serpent's head; as the seed of Abraham, in whom all nations should be blessed; and as the Shiloh to whom the gathering of the people should be; and as the great prophet, like to himself, God would raise up among the children of Israel, to whom they were to hearken: and as for the prophets, they wrote of his birth of a virgin; of the place of his birth, Bethlehem; of his sufferings, and the glory, that should follow; of his resurrection from the dead, his ascension to heaven, and session at the right hand of God; and of many things relating to his person, and office, and work. And Philip having given this general account of him, proceeds to name him particularly; and affirms him to be ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Jesus of Nazareth, the son of Joseph; that his name was Jesus, which signifies a saviour; and answers to the promises, and prophecies, and character of him in the Old Testament; that he was of Nazareth, a place not above three hours walk from Cana, as Adrichomius says, where Philip and Nathanael were: Nazareth was the place where Christ had lived almost all his days hitherto, and therefore is said to be of it; though Bethlehem was the place of his birth, which Philip might not as yet know; as Capernaum afterwards was his city, or the more usual place of his residence: and that he was the son of Joseph; this Philip says, according to the common opinion of people, for he was supposed to be the son of Joseph; he having married his mother Mary. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(o) Bar Bahlui apud Castell Lex. Polyglott. col. 2437. (p) Pirke Eliezer, c. 48. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(o) Bar Bahlui apud Castell Lex. Polyglott. col. 2437. (p) Pirke Eliezer, c. 48. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "{18} Philip findeth Nathanael, and saith unto him, We have found him, of whom Moses in the law, and the prophets, did write, Jesus of Nazareth, the son of Joseph.",
        "children": [
          {
            "element": "span",
            "class": "cverse3",
            "text": "{18}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Philip findeth Nathanael, and saith unto him, We have found him, of whom Moses in the law, and the prophets, did write, Jesus of Nazareth, the son of Joseph.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(18) God uses the good endeavours of the unlearned such that he makes them teachers of the learned.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 1:45",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἦν δὲ ὁ φίλιππος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " … ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Πέτρου",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This is inserted to explain how Jesus happened to meet Philip: he was going home also; and to explain how Philip’s mind had been prepared by conversation with Andrew and Peter. The exact position of Bethsaida is doubtful. There was a town or village of this name (Fisher-Home) on the east bank of Jordan, slightly above its fall into the Sea of Galilee. This place was rebuilt by Philip and named Julias, in honour of the daughter of Augustus. Many good authorities think that this was the only Bethsaida (see Dr. G. A. Smith’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Hist. Geog. of Palestine",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", p. 457). Others, however, are of opinion that the manner in which Bethsaida, here and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 12:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is named with an added note of distinction, “the city of Andrew,” “of Galilee,” requires us to postulate two Bethsaidas. This is further confirmed by the movements recorded in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 6:16-22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 6:45",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Those who accept two Bethsaidas locate the one which is here mentioned either opposite Bethsaida Julias and as a kind of suburb of it or farther south at Ain Tabigha (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Rob Roy on the Jordan",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", 342–392).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "45",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Nathanael",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] = ‘Gift of God.’ The name occurs ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 1:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 2:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Es 1:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Es 9:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Nathanael is commonly identified with Bartholomew; (1) Bartholomew is only a patronymic and the bearer would be likely to have another name (comp. Barjona of Simon, Barnabas of Joses); (2) S. John never mentions Bartholomew, the Synoptists never mention Nathanael; (3) the Synoptists in their lists place Bartholomew next to Philip, as James next his probable caller John, and Peter (in Matt. and Luke) next his caller Andrew; (4) all the other disciples mentioned in this chapter become Apostles, and none are so highly commended as Nathanael; (5) All Nathanael’s companions named in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 21:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " were Apostles (see note there). But all these reasons do not make the identification more than probable. The framers of our Liturgy do not countenance the identification: this passage appears neither as the Gospel nor as a Lesson for S. Bartholomew’s Day.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "We have found him, of whom",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.] “A most correct representation of the current phraseology, both in regard to the divisions of the O.T., and the application of the Messianic idea.” S. p. 35.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Moses",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] viz. in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 18:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and in all the Messianic types, promises to Adam, Abraham, &c.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Jesus of Nazareth, the son of Joseph",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The words are Philip’s, and express the common belief about Jesus. It was natural to say He was ‘of’ or ‘from Nazareth,’ as His home had been there; still more natural to call him ‘the son of Joseph.’ The conclusion that the Evangelist is ignorant of the birth at Bethlehem, or of the miraculous nature of that birth, cannot be drawn from this passage. Rather, we may conclude that he is a scrupulously honest historian, who records exactly what was said, without making additions of his own.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 1:45",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Εὑρίσκει",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "findeth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Philip, after being called, immediately sets himself to gain another [makes a gain on his talent, ‘lucrifacit’].—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τὸν Ναθαναήλ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Nathanael",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") It is probable that he was admitted among the apostles, and that he was the same person as he who is called ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Bartholomew",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", by a secondary name derived from his father, Tolomæus, as Simon from Jona [Bar-Jona], James and John from Zebedee [“the sons of Zebedee”]: For Judas also was called Lebbæus or Thaddæus. Certainly at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 10:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [the list of the apostles], he is joined to Philip; and at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 21:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Nathanael is put down in the midst of the apostles, immediately after Thomas; comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 1:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “Philip and Thomas, Bartholomew and Matthew:” and it seems likely, that his name would have been submitted to the apostles casting of lots [as a candidate for the vacant apostleship, to which Matthew was elected by lot], ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 1:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", [whereas Barsabas and Matthias were the only two submitted to it], had he not been already among the apostles. lie was certainly a friend of the Lord equally dear [to Him], as a friend can be dear to a prince, though not employed on his embassies.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "λέγει",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "saith",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") with a loud voice, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 1:48",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",[43] and a joyous voice. [",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Μωσῆς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Moses",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 5:39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 5:46",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “Search the Scriptures, for,” etc., “and they are they which testify of Me:—“Had ye believed Moses, ye would have believed Me; for he wrote of Me.”—V. g.]—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "εὑρήκαμεν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "we have found",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") I, Andrew, and Peter.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[43] “Before that Philip ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "called",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " thee,” ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "φωνῆσαι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", raised his ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "voice",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to thee.—E. and T.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 45.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Further convictions of the disciples.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "b",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "The theme of the Old Testament. Philip findeth Nathanael.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The theme of the Old Testament. ",
            "children": []
          },
          {
            "element": "span",
            "class": "cmt_word",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Philip findeth Nathanael.",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " He has no sooner accepted the Lord who found him, than he is eager to communicate the Divine secret to others. It seems widely accepted, though without any positive proof, that this Nathanael was identical with the Bartholomew (Bar Tolmai, son of Ptolemy) of the four lists of apostles, on the following grounds: ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(1)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 21:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Nathanael once more appears among the innermost circle of the apostles, and is moreover mentioned there in company with Thomas. In the synoptic Gospels Bartholomew is associated also with Philip, although in Acts, Luke ranks him with Matthew. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(2)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " It is probable that Nathanael was one of the twelve, and, this being so, it is more probable that he should have been identical with Bartholomew than with any other, he is distinguished from Thomas and the two sons of Zebedee in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 21:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and the whole circumstance of his call  suggests no resemblance to that of Matthew. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(3)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " His well known name is only that of a patronymic, and suggests the existence of another and a personal name. This identification cannot be proved, but there is no other that is more probable. Nathanael (",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "נִתַגְאֵל",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), as a name in Hebrew, is identical with Theodorus, \"God is giver\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 1:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 2:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; see also 1 Esdras 1:9 1 Esdras 9:22). Thoma ('Die Genesis des Johannes-Evangeliums,' p. 409, etc.) endeavours to identify Nathanael with Matthew, and to institute a series of ingenious comparisons between the synoptic \"Matthew and Zacchaeus\" and this Israelite without guile, and to compare the marriage feast at Nathanael's \"Cana\" with the feast in Matthew's, or Levi's, house. The subtle fancy and dramatic moral which he attributes to every clause of the narrative render the authorship a greater puzzle than ever. Philip ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "saith unto him, We have found",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - we, the group of friends already illumined with the sublime hope - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "him of whom Moses in the Law, and the prophets, wrote.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " This reveals the characteristics of the conversation which had passed between the Lord and the favoured three. It corresponds with what occurred on the way to Emmaus. The Lord rested upon the germinant ideas, and prophetic hopes, suggestive types, and positive predictions of the Old Testament, and met, while he refined and elevated, the current expectations of his time. There was to be no break with the old covenant, except by fulfilling it, establishing its reality and its vast place in the revelation of the supreme will of God. The question naturally arises, \"Well, but who is he? what is his name? whither has he come? whence does he hail?\" The continuation of the sentence is obviously not in apposition with the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ο{ν ἔγραψεν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but the direct object of ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "εὑρήκαμεν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "We have found Jesus",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "the",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Son of Joseph of Nazareth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This is the simple utterance of a matter of fact - a current piece of intelligence now circulating in the group of the earliest disciples. The idea of his being Joseph's Son was widely diffused; the fact that the Lord spent the first thirty years of his human life in Nazareth, was a commonplace of the synoptic story. The argument of the Tubingen and Straussian criticism, that the fourth evangelist was ignorant of Christ's Birth from above, is contradicted by the prologue, with all the assertions of the Lord's pre-existence, and especially by ver. 14 with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 3:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and 13. That he was ignorant of the birth in Bethlehem, with the numberless proofs of his knowledge of Matthew's and Luke's Gospels, is absurd. The language put into Philip's lips does not exhaust the knowledge of the evangelist on this subject (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 7:42",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). John 1:45",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Nathanael",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Probably the same as Bartholomew. See on Bartholomew, Mark 3:18.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Probably the same as Bartholomew. See on Bartholomew, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 3:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Moses in the law, etc.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Note the circumstantial detail of this confession as compared with Andrew's (John 1:42). ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Note the circumstantial detail of this confession as compared with Andrew's (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 1:42",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). ",
            "children": []
          }
        ]
      }
    ]
  }
]