[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "XLV.JOSEPH IS RECONCILED TO HIS BRETHREN, AND ENCOURAGES THEM AND HIS FATHER TO MAKE EGYPT THEIR HOME.(1) Joseph could not refrain himself.—The picture which Judah had drawn of his father’s love for Benjamin, the thought that by separating them he might have made his father die of grief, and the sight of his brethren, and especially of Judah offering to endure a life of slavery in order that Benjamin might go free, overpowered Joseph’s feelings, and he commanded all his attendants to quit the apartment in order that there might be no restraint upon himself or his brethren when he made known to them that he was the brother whom they had so cruelly years ago condemned to be a slave.MacLaren's ExpositionsGenesisRECOGNITION AND RECONCILIATIONGenesis 45:1 - Genesis 45:15.I If the writer of this inimitable scene of Joseph’s reconciliation with his brethren was not simply an historian, he was one of the great dramatic geniuses of the world, master of a vivid minuteness like Defoe’s, and able to touch the springs of tears by a pathetic simplicity like his who painted the death of Lear. Surely theories of legend and of mosaic work fail here. 1. We have, first, disclosure. The point at which the impenetrable, stern ruler breaks down is significant. It is after Judah’s torrent of intercession for Benjamin, and self-sacrificing offer of himself for a substitute and a slave. Why did this touch Joseph so keenly? Was it not because his brother’s speech shows that filial and fraternal affection was now strong enough in him to conquer self? He had sent Joseph to the fate which he is now ready to accept. He and the rest had thought nothing of the dagger they plunged into their father’s heart by selling Joseph; but now he is prepared to accept bondage if he may save his father’s grey head an ache. The whole of Joseph’s harsh, enigmatical treatment had been directed to test them, and to ascertain if they were the same fierce, cruel men as of old. Now, when the doubt is answered, he can no longer dam back the flood of forgiving love. The wisest pardoning kindness seeks the assurance of sorrow and change in the offender, before it can safely and wholesomely enjoy the luxury of letting itself out in tears of reconciliation. We do not call Joseph a type of Christ; but the plain process of forgiveness in his brotherly heart is moulded by the law which applies to God’s pardon as to ours. All the wealth of yearning pardon is there, before contrition and repentance; but it is not good for the offender that it should be lavished on him, impenitent. What a picture that is of the all-powerful ruler, choking down his emotion, and hurriedly ordering the audience chamber to be cleared! How many curious glances would be cast over their shoulders, by the slowly withdrawing crowd, at the strange group-the viceroy, usually so calm, thus inexplicably excited, and the huddled, rude shepherds, bewildered and afraid of what was coming next, in this unaccountable country! How eavesdroppers would linger as near as they durst, and how looks would be exchanged as the sounds of passionate weeping rewarded their open ears! The deepest feelings are not to be flaunted before the world. The man who displays his tears, and the man who is too proud to shed them, are both wrong; but perhaps it is worse to weep in public than not to weep at all. ‘I am Joseph.’ Were ever the pathos of simplicity, and the simplicity of pathos, more nobly expressed than in these two words?-{There are but two in the Hebrew.} Has the highest dramatic genius ever winged an arrow which goes more surely to the heart than that? The question, which hurries after the disclosure, seems strange and needless; but it is beautifully self-revealing, as expressive of agitation, and as disclosing a son’s longing, and perhaps, too, as meant to relieve the brothers’ embarrassment, and, as it were, to wrap the keen edge of the disclosure in soft wool. 2. We have, next, conscience-stricken silence. No wonder his brethren ‘could not answer’ and ‘were troubled at his presence.’ They had found their brother a ruler; they had found the ruler their brother. Their former crime had turned what might have been a joy into a terror. Already they had come to know and regret it. It might seem to their startled consciences as if now they were about to expiate it. They would remember the severity of Joseph’s past intercourse; they see his power, and cannot but be doubtful of his intentions. Had all his strange conduct been manoeuvring to get them, Benjamin and all, into his toils, that one blow might perfect his revenge? Our suspicions are the reflections of our own hearts. So there they stand in open-mouthed, but dumb, wonder and dread. It would task the pencil of him who painted, on the mouldering refectory wall at Milan, the conflicting emotions of the apostles, at the announcement of the betrayer, to portray that silent company of abased and trembling criminals. They are an illustration of the profitlessness of all crime. Sin is, as one of its Hebrew names tells us, missing the mark-whether we think of it as fatally failing to reach the ideal of conduct, or as always, by a divine nemesis, failing to hit even the shabby end it aims at. ‘Every rogue is a roundabout fool.’ They put Joseph in the pit, and here he is on a throne. They have stained their souls, and embittered their father’s life for twenty-two long years, and the dreams have come true, and all their wickedness has not turned the stream of the divine purpose, any more than the mud dam built by a child diverts the Mississippi. One flash has burned up their whole sinful past, and they stand scorched and silent among the ruins. So it always is. Sooner or later the same certainty of the futility of his sin will overwhelm every sinful man, and dumb self-condemnation will stand in silent acknowledgment of evil desert before the throne of the Brother, who is now the Prince and the Judge, on whose fiat hangs life or death. To see Christ enthroned should be joy; but it may be turned into terror and silent anticipation of His just condemnation. 3. We have encouragement and complete forgiveness. That invitation to come close up to him, with which Joseph begins the fuller disclosure of his heart, is a beautiful touch. We can fancy how tender the accents, and how, with some lightening of fear, but still hesitatingly and ashamed, the shepherds, unaccustomed to courtly splendours, approached. The little pause while they draw near helps him to self-command, and he resumes his words in a calmer tone. With one sentence of assurance that he is their brother, he passes at once into that serene region where all passion and revenge die, unable to breathe its keen, pure air. The comfort which he addresses to their penitence would have been dangerous, if spoken to men blind to the enormity of their past. But it will not make a truly repentant conscience less sensitive, though it may alleviate the aching of the wound, to think that God has used even its sin for His own purposes. It will not take away the sense of the wickedness of the motive to know that a wonderful providence has rectified the consequences. It will rather deepen the sense of evil, and give new cause of adoration of the love that pardons the wrong, and the providence that neutralises the harm. Joseph takes the true point of view, which we are all bound to occupy, if we would practise the Christian grace of forgiveness. He looks beyond the mere human hate and envy to the divine purpose. ‘The sword is theirs; the hand is Thine.’ He can even be grateful to his foes who have been unintentionally his benefactors. He thinks of the good that has come out of their malice, and anger dies within him. Highest attainment of all, the good for which he is grateful is not his all-but-regal dignity, but the power to save and gladden those who would fain have slain, and had saddened him for many a weary year. We read in these utterances of a lofty piety and of a singularly gentle heart, the fruit of sorrow and the expression of thoughts which had slowly grown up in his mind, and had now been long familiar there. Such a calm, certain grasp of the divine shaping and meaning of his life could not have sprung up all at once in him, as he looked at the conscience-stricken culprits cowering before him. More than natural sweetness and placability must have gone to the making of such a temper of forgiveness. He must have been living near the Fountain of all mercy to have had so full a cup of it to offer. Because he had caught a gleam of the divine pardon, he becomes a mirror of it; and we may fairly see in this ill-used brother, yearning over the half-sullen sinners, and seeking to open a way for his forgiveness to steal into their hearts, and rejoicing over his very sorrows which have fitted him to save them alive, and satisfy them in the days of famine, an adumbration of our Elder Brother’s forgiving love and saving tenderness. 4. The second part of Joseph’s address is occupied with his message to Jacob, and shows how he longed for his father’s presence. There is something very natural and beautiful in the repeated exhortations to haste, as indicating the impatient love of a long-absent son. If his heart was so true to his father, why had he sent him no message for all these years? Egypt was near enough, and for nine years now he had been in power. Surely he could have gratified his heart. But he could not have learned by any other means his brethren’s feelings, and if they were still what they had been, no intercourse would be possible. He could only be silent, and yearn for the way to open in God’s providence, as it did. The message to Jacob is sent from ‘thy son Joseph,’ in token that the powerful ruler lays his dignity at his father’s feet. No elevation will ever make a true son forget his reverence for his father. If he rise higher in the world, and has to own an old man, away in some simple country home, for his sire, he will be proud to do it. The enduring sanctity of the family ties is not the least valuable lesson from our narrative for this generation, where social conditions are so often widely different in parents and in children. There is an affectionate spreading out of all his glory before his father’s old eyes; not that he cared much about it for himself, since, as we have seen, elevation to him meant mainly work, but because he knew how the eyes would glisten at the sight. His mother, who would have been proud of him, is gone, but he has still the joy of gladdening his father by the exhibition of his dignity. It bespeaks a simple nature, unspoiled by prosperity, to delight thus in his father’s delight, and to wish the details of all his splendour to be told him. A statesman who takes most pleasure in his elevation because of the good he can do by it, and because it will please the old people at home, must be a pure and lovable man. The command has another justification in the necessity to assure his father of the wisdom of so great a change. God had set him in the Promised Land, and a very plain divine injunction was needed to warrant his leaving it. Such a one was afterwards given in vision; but the most emphatic account of his son’s honour and power was none the less required to make the old Jacob willing to abandon so much, and go into such strange conditions. We have another instance of the difference between man’s purposes and God’s counsel in this message. Joseph’s only thought is to afford his family temporary shelter during the coming five years of famine. Neither he nor they knew that this was the fulfilment of the covenant with Abraham, and the bringing of them into the land of their oppression for four centuries. No shadow of that future was cast upon their joy, and yet, the steady march of God’s plan was effected along the path which they were ignorantly preparing. The road-maker does not know what bands of mourners, or crowds of holiday makers, or troops of armed men may pass along it. 5. This wonderfully beautiful scene ends with the kiss of full reconciliation and frank communion. All the fear is out of the brothers’ hearts. It has washed away all the envy along with it. The history of Jacob’s household had hitherto been full of sins against family life. Now, at last, they taste the sweetness of fraternal love. Joseph, against whom they had sinned, takes the initiative, flinging himself with tears on the neck of Benjamin, his own mother’s son, nearer to him than all the others, crowding his pent-up love in one long kiss. Then, with less of passionate affection, but more of pardoning love, he kisses his contrite brothers. The offender is ever less ready to show love than the offended. The first step towards reconciliation, whether of man with man or of man with God, comes from the aggrieved. We always hate those whom we have harmed; and if enmity were ended only by the advances of the wrong-doer, it would be perpetual. The injured has the prerogative of praying the injurer to be reconciled. So was it in Pharaoh’s throne-room on that long past day; so is it still in the audience chamber of heaven. ‘He that might the vantage best have took found out the remedy.’ ‘We love Him, because He first loved us.’ The pardoned men find their tongues at last. Forgiveness has opened their lips, and though their reverence and thanks are no less, their confidence and familiarity are more. How they would talk when once the terror was melted away! So should it be with the soul which has tasted the sweetness of Christ’s forgiving love, and has known ‘the kisses of His mouth.’ Long, unrestrained, and happy should be the intercourse which we forgiven sinners keep up with our Brother, the Prince of all the land. ‘After that his brethren talked with him.’JOSEPH, THE PARDONER AND PRESERVERII THE noble words in which Joseph dissipates his brothers’ doubts have, as their first characteristic, the recognition of the God by whom his career had been shaped, and, for their next, the recognition of the purpose for which it had been. There is a world of tenderness and forgivingness in the addition made to his first words in Genesis 45:4, ‘Joseph, your brother.’ He owns the mystic bond of kindred, and thereby assures them of his pardon for their sin against it. It was right that he should remind them of their crime, even while declaring his pardon. But he rises high above all personal considerations and graciously takes the place of soother, instead of that of accuser. Far from cherishing thoughts of anger or revenge, he tries to lighten the reproaches of their own consciences. Thrice over in four verses he traces his captivity to God. He had learned that wisdom in his long years of servitude, and had not forgotten it in those of rule. There will be little disposition in us to visit offences against ourselves on the offenders, if we discern God’s purpose working through our sorrows, and see, as the Psalmist did, that even our foes are ‘ men which are Thy hand, O Lord.’ True, His overruling providence does not make their guilt less; but the recognition of it destroys all disposition to revenge, and injured and injurer may one day unite in adoring the result of what the One suffered at the other’s hands. Surely, some Christian persecutors and their victims have thus joined hands in heaven. If we would cultivate the habit of seeing God behind second causes, our hearts would be kept free from much wrath and bitterness. Joseph was as certain of the purpose as of the source of his elevation. He saw now what he had been elevated for, and he eagerly embraced the task which was a privilege. No doubt, he had often brooded over the thought, ‘Why am I thus lifted up?’ and had felt the privilege of being a nation’s saviour; but now he realises that he has a part to play in fulfilling God’s designs in regard to the seed of Abraham. Cloudy as his outlook into the future may have been, he knew that great promises affecting all nations were intertwined with his family, separation from whom had been a sorrow for years. But now the thought comes to him with sudden illumination and joy: ‘This, then, is what it all has meant, that I should be a link in the chain of God’s workings.’ He knows himself to be God’s instrument for effecting His covenant promises. How small a thing honour and position became in comparison! We cannot all have great tasks in the line of God’s purposes, but we can all feel that our little ones are made great by being seen to be in it. The less we think about chariots and gold chains, and the more we try to find out what God means by setting us where we are, and to do that, the better for our peace and true dignity. A true man does not care for the rewards of work half as much as for the work itself. Find out what God intends, and never mind whether He puts you in a dungeon or in a palace. Both places lie on the road which He has marked and, in either, the main thing is to do His will. Next comes the swiftly devised plan for carrying out God’s purpose. It sounds as if Joseph, with prompt statesmanship, had struck it out then and there. At all events, he pours it forth with contagious earnestness and haste. Note how he says over and over again ‘My father,’ as if he loved to dwell on the name, but also as if he had not yet completely realised the renewal of the broken ties of brotherhood. It was some trial of the stuff he was made of, to have to bring his father and his family to be stared at, and perhaps mocked at, by the court. Many a successful man would be very much annoyed if his old father, in his country clothes, and hands roughened by toil, sat down beside him in his prosperity. Joseph had none of that baseness. Jacob would come, if at all, as a half-starved immigrant, and would be ‘an abomination to the Egyptians.’ But what of that? He was ‘my father,’ and his son knows no better use to make of his dignity than to compel reverence for Jacob’s grey hairs, which he will take care shall not be ‘brought down with sorrow to the grave.’ It is a very homely lesson-never be ashamed of your father. But in these days, when children are often better educated than their parents, and rise above them in social importance, it is a very needful one. The first overtures of reconciliation should come from the side of the injured party. That is Christ’s law, and if it were Christians’ practice, there would be fewer alienations among them. It is Christ’s law, because it is Christ’s own way of dealing with us. He, too, was envied, and sold by His brethren. His sufferings were meant ‘to preserve life.’ Stephen’s sermon in the Sanhedrin dwells on Joseph as a type of Christ; and the typical character is seen not least distinctly in this, that He against whom we have sinned pleads with us, seeks to draw us nearer to Himself, and to lead us to put away all hard thoughts of Him, and to cherish all loving ones towards Him, by showing us how void His heart is of anger against us, and how full of yearning love and of gracious intention to provide for us a dwelling-place, with abundance of all needful good, beside Himself, while the years of famine shall last.Benson CommentaryGenesis 45:1. Then Joseph could not refrain himself — Several times before he had found great difficulty to refrain himself, but now, being overcome by Judah’s most affecting speech, he was constrained to yield to the emotions of his mind, even before all them that stood before him. He therefore cried, Cause every man to go out from me — That is, all the Egyptians, for he would not have them to be acquainted with the guilt of his brethren, whose reputation he wished to preserve: nor would he have any restraint on those affections and tears which he could no longer repress. How must it have amazed Judah and his brethren, who were waiting for an answer, to discover in him, instead of the gravity of a judge, the natural affection of a father or brother!Matthew Henry's Concise Commentary45:1-15 Joseph let Judah go on, and heard all he had to say. He found his brethren humbled for their sins, mindful of himself, for Judah had mentioned him twice in his speech, respectful to their father, and very tender of their brother Benjamin. Now they were ripe for the comfort he designed, by making himself known. Joseph ordered all his attendants to withdraw. Thus Christ makes himself and his loving-kindness known to his people, out of the sight and hearing of the world. Joseph shed tears of tenderness and strong affection, and with these threw off that austerity with which he had hitherto behaved toward his brethren. This represents the Divine compassion toward returning penitents. I am Joseph, your brother. This would humble them yet more for their sin in selling him, but would encourage them to hope for kind treatment. Thus, when Christ would convince Paul, he said, I am Jesus; and when he would comfort his disciples, he said, It is I, be not afraid. When Christ manifests himself to his people, he encourages them to draw near to him with a true heart. Joseph does so, and shows them, that whatever they thought to do against him, God had brought good out of it. Sinners must grieve and be angry with themselves for their sins, though God brings good out of it, for that is no thanks to them. The agreement between all this, and the case of a sinner, on Christ's manifesting himself to his soul, is very striking. He does not, on this account, think sin a less, but a greater evil; and yet he is so armed against despair, as even to rejoice in what God hath wrought, while he trembles in thinking of the dangers and destruction from which he has escaped. Joseph promises to take care of his father and all the family. It is the duty of children, if the necessity of their parents at any time require it, to support and supply them to the utmost of their ability; this is showing piety at home, 1Ti 5:4. After Joseph had embraced Benjamin, he caressed them all, and then his brethren talked with him freely of all the affairs of their father's house. After the tokens of true reconciliation with the Lord Jesus, sweet communion with him follows.Barnes' Notes on the BibleJoseph now reveals to his brothers the astonishing fact that he himself, their long-lost brother, stands before them. \"He could not refrain himself.\" Judah has painted the scene at home to the life; and Joseph can hold out no longer. \"Have every man out from me.\" Delicacy forbids the presence of strangers at this unrestrained outburst of tender emotion among the brothers. Besides, the workings of conscience, bringing up the recollections of the past, and the errors, to which some reference is now unavoidable, are not to be unveiled to the public eye. \"He lifted up his voice in weeping.\" The expression of the feelings is free and uncontrolled in a simple and primitive state of society. This prevails still in the East. And Mizraim heard. The Egyptians of Joseph's house would hear, and report to others, this unusual utterance of deep feeling. \"I am Joseph.\" The natural voice, the native tongue, the long-remembered features, would, all at once, strike the apprehension of the brothers.The remembrance of their crime, the absolute power of Joseph, and the justice of revenge, would rush upon their minds. No wonder they were silent and troubled at his presence. \"Is my father yet alive?\" This question shows where Joseph's thoughts were. He had been repeatedly assured of his father's welfare. But the long absence and the yearning of a fond heart bring the question up again. It was reassuring to the brethren, as it was far away from any thought of their fault or their punishment. \"Come near unto me.\" Joseph sees the trouble of his brothers, and discerns its cause. He addresses them a second time, and plainly refers to the fact of their having sold him. He points out that this was overruled of God to the saving of life; and, hence, that it was not they, but God who had mercifully sent him to Egypt to preserve all their lives. \"For these two years.\" Hence, we perceive that the sons of Jacob obtained a supply, on the first occasion, which was sufficient for a year. \"To leave to you a remnant in the land.\"This is usually and most naturally referred to a surviving portion of their race. \"Father to Pharaoh;\" a second author of life to him. Having touched very slightly on their transgression, and endeavored to divert their thoughts to the wonderful providence of God displayed in the whole affair, he lastly preoccupies their minds with the duty and necessity of bringing down their father and all their families to dwell in Egypt. \"In the land of Goshen.\" This was a pasture land on the borders of Egypt and Arabia, perhaps at some distance from the Nile, and watered by the showers of heaven, like their own valleys. He then appeals to their recollections and senses, whether he was not their very brother Joseph. \"My mouth that speaketh unto you;\" not by an interpreter, but with his own lips, and in their native tongue. Having made this needful and reassuring explanation, he breaks through all distance, and falls upon Benjamin's neck and kisses him, and all his other brothers; after which their hearts are soothed, and they speak freely with him.Jamieson-Fausset-Brown Bible CommentaryCHAPTER 45Ge 45:1-28. Joseph Making Himself Known.1. Then Joseph could not refrain himself—The severity of the inflexible magistrate here gives way to the natural feelings of the man and the brother. However well he had disciplined his mind, he felt it impossible to resist the artless eloquence of Judah. He saw a satisfactory proof, in the return of all his brethren on such an occasion, that they were affectionately united to one another; he had heard enough to convince him that time, reflection, or grace had made a happy improvement on their characters; and he would probably have proceeded in a calm and leisurely manner to reveal himself as prudence might have dictated. But when he heard the heroic self-sacrifice of Judah [Ge 44:33] and realized all the affection of that proposal—a proposal for which he was totally unprepared—he was completely unmanned; he felt himself forced to bring this painful trial to an end.he cried, Cause every man to go out from me—In ordering the departure of witnesses of this last scene, he acted as a warm-hearted and real friend to his brothers—his conduct was dictated by motives of the highest prudence—that of preventing their early iniquities from becoming known either to the members of his household, or among the people of Egypt.Joseph no longer able to refrain, discovers himself to his brethren, and weeps; asks concerning his father: they are troubled at his presence,  Genesis 45:1-3. He forbids their grief for their sin, and comforts them with God’s gracious design and providence in it,  Genesis 45:4-8. He hastens them to go and acquaint their father, and bring him to Egypt; his message to his father,  Genesis 45:9-13. His kindness to Benjamin and his brethren,  Genesis 45:14,15. Pharaoh is glad, and invites them down to Egypt,  Genesis 45:16-20. Joseph dismisses them with gifts and presents to his father; exhorting them not to fall out by the way,  Genesis 45:21-24. Coming home they relate all to their father, who at last believes them, rejoicing that he should see his son before he died,  Genesis 45:25-28.  Cause every man to go out from me;  remove all the Egyptians out of my presence and chamber. Which he did, partly that he might maintain the honour of his place, and not make himself cheap and contemptible to the Egyptians, by his excessive tears and passions, and by his free, and familiar, and affectionate converse with his brethren; and partly to preserve the reputation of his brethren, by concealing their fault from the Egyptians. Gill's Exposition of the Entire BibleThen Joseph could not refrain himself,.... That he should not weep, as the Targum of Jonathan adds; at least he could not much longer refrain from tears, such an effect Judah's speech had on his passions: before all them that stood before him; his servants that attended him and waited upon him, the steward of his house, and others, upon whose account he put such a force upon himself, to keep in his passions from giving vent, that they might not discover the inward motions of his mind; but not being able to conceal them any longer: and he cried; or called out with a loud voice, and an air of authority: cause every man to go out from me; out of the room in which he and his brethren were; perhaps this order was given to the steward of the house to depart himself, and to remove every inferior officer and servant upon the spot; or other people that might be come in to hear the trial of those men, and to see how they would be dealt with: and there stood no man with him, while Joseph made himself known unto his brethren; not that Joseph was ashamed of them, and of owning before them the relation he stood in to them; but that they might not see the confusion his brethren would be thrown into, and have knowledge of the sin they had been guilty of in selling him which could not fail of being mentioned by him, and confessed by them; and besides, it was not suitable to his grandeur and dignity to be seen in such an extreme passion he was now going into. Geneva Study BibleThen Joseph could not refrain himself before all them that stood by him; and he cried, {a} Cause every man to go out from me. And there stood no man with him, while Joseph made himself known unto his brethren.(a) Not because he was ashamed of his kindred, but rather because he wanted to cover his brother's sin.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "XLV.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "JOSEPH IS RECONCILED TO HIS BRETHREN, AND ENCOURAGES THEM AND HIS FATHER TO MAKE EGYPT THEIR HOME.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "(1) Joseph could not refrain himself.—The picture which Judah had drawn of his father’s love for Benjamin, the thought that by separating them he might have made his father die of grief, and the sight of his brethren, and especially of Judah offering to endure a life of slavery in order that Benjamin might go free, overpowered Joseph’s feelings, and he commanded all his attendants to quit the apartment in order that there might be no restraint upon himself or his brethren when he made known to them that he was the brother whom they had so cruelly years ago condemned to be a slave.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "MacLaren's Expositions",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Genesis",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "RECOGNITION AND RECONCILIATIONGenesis 45:1 - Genesis 45:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "I ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "If the writer of this inimitable scene of Joseph’s reconciliation with his brethren was not simply an historian, he was one of the great dramatic geniuses of the world, master of a vivid minuteness like Defoe’s, and able to touch the springs of tears by a pathetic simplicity like his who painted the death of Lear. Surely theories of legend and of mosaic work fail here.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 1. We have, first, disclosure. The point at which the impenetrable, stern ruler breaks down is significant. It is after Judah’s torrent of intercession for Benjamin, and self-sacrificing offer of himself for a substitute and a slave. Why did this touch Joseph so keenly? Was it not because his brother’s speech shows that filial and fraternal affection was now strong enough in him to conquer self? He had sent Joseph to the fate which he is now ready to accept. He and the rest had thought nothing of the dagger they plunged into their father’s heart by selling Joseph; but now he is prepared to accept bondage if he may save his father’s grey head an ache. The whole of Joseph’s harsh, enigmatical treatment had been directed to test them, and to ascertain if they were the same fierce, cruel men as of old. Now, when the doubt is answered, he can no longer dam back the flood of forgiving love. The wisest pardoning kindness seeks the assurance of sorrow and change in the offender, before it can safely and wholesomely enjoy the luxury of letting itself out in tears of reconciliation. We do not call Joseph a type of Christ; but the plain process of forgiveness in his brotherly heart is moulded by the law which applies to God’s pardon as to ours. All the wealth of yearning pardon is there, before contrition and repentance; but it is not good for the offender that it should be lavished on him, impenitent.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " What a picture that is of the all-powerful ruler, choking down his emotion, and hurriedly ordering the audience chamber to be cleared! How many curious glances would be cast over their shoulders, by the slowly withdrawing crowd, at the strange group-the viceroy, usually so calm, thus inexplicably excited, and the huddled, rude shepherds, bewildered and afraid of what was coming next, in this unaccountable country! How eavesdroppers would linger as near as they durst, and how looks would be exchanged as the sounds of passionate weeping rewarded their open ears! The deepest feelings are not to be flaunted before the world. The man who displays his tears, and the man who is too proud to shed them, are both wrong; but perhaps it is worse to weep in public than not to weep at all.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ‘I am Joseph.’ Were ever the pathos of simplicity, and the simplicity of pathos, more nobly expressed than in these two words?-{There are but two in the Hebrew.} Has the highest dramatic genius ever winged an arrow which goes more surely to the heart than that? The question, which hurries after the disclosure, seems strange and needless; but it is beautifully self-revealing, as expressive of agitation, and as disclosing a son’s longing, and perhaps, too, as meant to relieve the brothers’ embarrassment, and, as it were, to wrap the keen edge of the disclosure in soft wool.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 2. We have, next, conscience-stricken silence. No wonder his brethren ‘could not answer’ and ‘were troubled at his presence.’ They had found their brother a ruler; they had found the ruler their brother. Their former crime had turned what might have been a joy into a terror. Already they had come to know and regret it. It might seem to their startled consciences as if now they were about to expiate it. They would remember the severity of Joseph’s past intercourse; they see his power, and cannot but be doubtful of his intentions. Had all his strange conduct been manoeuvring to get them, Benjamin and all, into his toils, that one blow might perfect his revenge? Our suspicions are the reflections of our own hearts. So there they stand in open-mouthed, but dumb, wonder and dread. It would task the pencil of him who painted, on the mouldering refectory wall at Milan, the conflicting emotions of the apostles, at the announcement of the betrayer, to portray that silent company of abased and trembling criminals. They are an illustration of the profitlessness of all crime. Sin is, as one of its Hebrew names tells us, missing the mark-whether we think of it as fatally failing to reach the ideal of conduct, or as always, by a divine nemesis, failing to hit even the shabby end it aims at. ‘Every rogue is a roundabout fool.’ They put Joseph in the pit, and here he is on a throne. They have stained their souls, and embittered their father’s life for twenty-two long years, and the dreams have come true, and all their wickedness has not turned the stream of the divine purpose, any more than the mud dam built by a child diverts the Mississippi. One flash has burned up their whole sinful past, and they stand scorched and silent among the ruins. So it always is. Sooner or later the same certainty of the futility of his sin will overwhelm every sinful man, and dumb self-condemnation will stand in silent acknowledgment of evil desert before the throne of the Brother, who is now the Prince and the Judge, on whose fiat hangs life or death. To see Christ enthroned should be joy; but it may be turned into terror and silent anticipation of His just condemnation.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 3. We have encouragement and complete forgiveness. That invitation to come close up to him, with which Joseph begins the fuller disclosure of his heart, is a beautiful touch. We can fancy how tender the accents, and how, with some lightening of fear, but still hesitatingly and ashamed, the shepherds, unaccustomed to courtly splendours, approached. The little pause while they draw near helps him to self-command, and he resumes his words in a calmer tone. With one sentence of assurance that he is their brother, he passes at once into that serene region where all passion and revenge die, unable to breathe its keen, pure air. The comfort which he addresses to their penitence would have been dangerous, if spoken to men blind to the enormity of their past. But it will not make a truly repentant conscience less sensitive, though it may alleviate the aching of the wound, to think that God has used even its sin for His own purposes. It will not take away the sense of the wickedness of the motive to know that a wonderful providence has rectified the consequences. It will rather deepen the sense of evil, and give new cause of adoration of the love that pardons the wrong, and the providence that neutralises the harm.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Joseph takes the true point of view, which we are all bound to occupy, if we would practise the Christian grace of forgiveness. He looks beyond the mere human hate and envy to the divine purpose. ‘The sword is theirs; the hand is Thine.’ He can even be grateful to his foes who have been unintentionally his benefactors. He thinks of the good that has come out of their malice, and anger dies within him.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Highest attainment of all, the good for which he is grateful is not his all-but-regal dignity, but the power to save and gladden those who would fain have slain, and had saddened him for many a weary year. We read in these utterances of a lofty piety and of a singularly gentle heart, the fruit of sorrow and the expression of thoughts which had slowly grown up in his mind, and had now been long familiar there. Such a calm, certain grasp of the divine shaping and meaning of his life could not have sprung up all at once in him, as he looked at the conscience-stricken culprits cowering before him. More than natural sweetness and placability must have gone to the making of such a temper of forgiveness. He must have been living near the Fountain of all mercy to have had so full a cup of it to offer. Because he had caught a gleam of the divine pardon, he becomes a mirror of it; and we may fairly see in this ill-used brother, yearning over the half-sullen sinners, and seeking to open a way for his forgiveness to steal into their hearts, and rejoicing over his very sorrows which have fitted him to save them alive, and satisfy them in the days of famine, an adumbration of our Elder Brother’s forgiving love and saving tenderness.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 4. The second part of Joseph’s address is occupied with his message to Jacob, and shows how he longed for his father’s presence. There is something very natural and beautiful in the repeated exhortations to haste, as indicating the impatient love of a long-absent son. If his heart was so true to his father, why had he sent him no message for all these years? Egypt was near enough, and for nine years now he had been in power. Surely he could have gratified his heart. But he could not have learned by any other means his brethren’s feelings, and if they were still what they had been, no intercourse would be possible. He could only be silent, and yearn for the way to open in God’s providence, as it did.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " The message to Jacob is sent from ‘thy son Joseph,’ in token that the powerful ruler lays his dignity at his father’s feet. No elevation will ever make a true son forget his reverence for his father. If he rise higher in the world, and has to own an old man, away in some simple country home, for his sire, he will be proud to do it. The enduring sanctity of the family ties is not the least valuable lesson from our narrative for this generation, where social conditions are so often widely different in parents and in children. There is an affectionate spreading out of all his glory before his father’s old eyes; not that he cared much about it for himself, since, as we have seen, elevation to him meant mainly work, but because he knew how the eyes would glisten at the sight. His mother, who would have been proud of him, is gone, but he has still the joy of gladdening his father by the exhibition of his dignity. It bespeaks a simple nature, unspoiled by prosperity, to delight thus in his father’s delight, and to wish the details of all his splendour to be told him. A statesman who takes most pleasure in his elevation because of the good he can do by it, and because it will please the old people at home, must be a pure and lovable man. The command has another justification in the necessity to assure his father of the wisdom of so great a change. God had set him in the Promised Land, and a very plain divine injunction was needed to warrant his leaving it. Such a one was afterwards given in vision; but the most emphatic account of his son’s honour and power was none the less required to make the old Jacob willing to abandon so much, and go into such strange conditions.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " We have another instance of the difference between man’s purposes and God’s counsel in this message. Joseph’s only thought is to afford his family temporary shelter during the coming five years of famine. Neither he nor they knew that this was the fulfilment of the covenant with Abraham, and the bringing of them into the land of their oppression for four centuries. No shadow of that future was cast upon their joy, and yet, the steady march of God’s plan was effected along the path which they were ignorantly preparing. The road-maker does not know what bands of mourners, or crowds of holiday makers, or troops of armed men may pass along it.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 5. This wonderfully beautiful scene ends with the kiss of full reconciliation and frank communion. All the fear is out of the brothers’ hearts. It has washed away all the envy along with it. The history of Jacob’s household had hitherto been full of sins against family life. Now, at last, they taste the sweetness of fraternal love. Joseph, against whom they had sinned, takes the initiative, flinging himself with tears on the neck of Benjamin, his own mother’s son, nearer to him than all the others, crowding his pent-up love in one long kiss. Then, with less of passionate affection, but more of pardoning love, he kisses his contrite brothers. The offender is ever less ready to show love than the offended. The first step towards reconciliation, whether of man with man or of man with God, comes from the aggrieved. We always hate those whom we have harmed; and if enmity were ended only by the advances of the wrong-doer, it would be perpetual. The injured has the prerogative of praying the injurer to be reconciled. So was it in Pharaoh’s throne-room on that long past day; so is it still in the audience chamber of heaven. ‘He that might the vantage best have took found out the remedy.’ ‘We love Him, because He first loved us.’",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " The pardoned men find their tongues at last. Forgiveness has opened their lips, and though their reverence and thanks are no less, their confidence and familiarity are more. How they would talk when once the terror was melted away! So should it be with the soul which has tasted the sweetness of Christ’s forgiving love, and has known ‘the kisses of His mouth.’ Long, unrestrained, and happy should be the intercourse which we forgiven sinners keep up with our Brother, the Prince of all the land. ‘After that his brethren talked with him.’",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "JOSEPH, THE PARDONER AND PRESERVERII ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "THE noble words in which Joseph dissipates his brothers’ doubts have, as their first characteristic, the recognition of the God by whom his career had been shaped, and, for their next, the recognition of the purpose for which it had been. There is a world of tenderness and forgivingness in the addition made to his first words in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 45:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ‘Joseph, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "your brother",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".’ He owns the mystic bond of kindred, and thereby assures them of his pardon for their sin against it. It was right that he should remind them of their crime, even while declaring his pardon. But he rises high above all personal considerations and graciously takes the place of soother, instead of that of accuser. Far from cherishing thoughts of anger or revenge, he tries to lighten the reproaches of their own consciences. Thrice over in four verses he traces his captivity to God. He had learned that wisdom in his long years of servitude, and had not forgotten it in those of rule.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " There will be little disposition in us to visit offences against ourselves on the offenders, if we discern God’s purpose working through our sorrows, and see, as the Psalmist did, that even our foes are ‘ men which are Thy hand, O Lord.’ True, His overruling providence does not make their guilt less; but the recognition of it destroys all disposition to revenge, and injured and injurer may one day unite in adoring the result of what the One suffered at the other’s hands. Surely, some Christian persecutors and their victims have thus joined hands in heaven. If we would cultivate the habit of seeing God behind second causes, our hearts would be kept free from much wrath and bitterness.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Joseph was as certain of the purpose as of the source of his elevation. He saw now what he had been elevated for, and he eagerly embraced the task which was a privilege. No doubt, he had often brooded over the thought, ‘Why am I thus lifted up?’ and had felt the privilege of being a nation’s saviour; but now he realises that he has a part to play in fulfilling God’s designs in regard to the seed of Abraham. Cloudy as his outlook into the future may have been, he knew that great promises affecting all nations were intertwined with his family, separation from whom had been a sorrow for years. But now the thought comes to him with sudden illumination and joy: ‘This, then, is what it all has meant, that I should be a link in the chain of God’s workings.’ He knows himself to be God’s instrument for effecting His covenant promises. How small a thing honour and position became in comparison!",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " We cannot all have great tasks in the line of God’s purposes, but we can all feel that our little ones are made great by being seen to be in it. The less we think about chariots and gold chains, and the more we try to find out what God means by setting us where we are, and to do that, the better for our peace and true dignity. A true man does not care for the rewards of work half as much as for the work itself. Find out what God intends, and never mind whether He puts you in a dungeon or in a palace. Both places lie on the road which He has marked and, in either, the main thing is to do His will.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Next comes the swiftly devised plan for carrying out God’s purpose. It sounds as if Joseph, with prompt statesmanship, had struck it out then and there. At all events, he pours it forth with contagious earnestness and haste. Note how he says over and over again ‘My father,’ as if he loved to dwell on the name, but also as if he had not yet completely realised the renewal of the broken ties of brotherhood. It was some trial of the stuff he was made of, to have to bring his father and his family to be stared at, and perhaps mocked at, by the court. Many a successful man would be very much annoyed if his old father, in his country clothes, and hands roughened by toil, sat down beside him in his prosperity. Joseph had none of that baseness. Jacob would come, if at all, as a half-starved immigrant, and would be ‘an abomination to the Egyptians.’ But what of that? He was ‘my father,’ and his son knows no better use to make of his dignity than to compel reverence for Jacob’s grey hairs, which he will take care shall ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "not",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " be ‘brought down with sorrow to the grave.’ It is a very homely lesson-never be ashamed of your father. But in these days, when children are often better educated than their parents, and rise above them in social importance, it is a very needful one.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " The first overtures of reconciliation should come from the side of the injured party. That is Christ’s law, and if it were Christians’ practice, there would be fewer alienations among them. It is Christ’s law, because it is Christ’s own way of dealing with us. He, too, was envied, and sold by His brethren. His sufferings were meant ‘to preserve life.’ Stephen’s sermon in the Sanhedrin dwells on Joseph as a type of Christ; and the typical character is seen not least distinctly in this, that He against whom we have sinned pleads with us, seeks to draw us nearer to Himself, and to lead us to put away all hard thoughts of Him, and to cherish all loving ones towards Him, by showing us how void His heart is of anger against us, and how full of yearning love and of gracious intention to provide for us a dwelling-place, with abundance of all needful good, beside Himself, while the years of famine shall last.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Benson Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Genesis 45:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Then Joseph could not refrain himself ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "— Several times before he had found great difficulty to refrain himself, but now, being overcome by Judah’s most affecting speech, he was constrained to yield to the emotions of his mind, even before all them that stood before him. He therefore ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "cried, Cause every man to go out from me ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "— That is, all the Egyptians, for he would not have them to be acquainted with the guilt of his brethren, whose reputation he wished to preserve: nor would he have any restraint on those affections and tears which he could no longer repress. How must it have amazed Judah and his brethren, who were waiting for an answer, to discover in him, instead of the gravity of a judge, the natural affection of a father or brother!",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Matthew Henry's Concise Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "45:1-15 Joseph let Judah go on, and heard all he had to say. He found his brethren humbled for their sins, mindful of himself, for Judah had mentioned him twice in his speech, respectful to their father, and very tender of their brother Benjamin. Now they were ripe for the comfort he designed, by making himself known. Joseph ordered all his attendants to withdraw. Thus Christ makes himself and his loving-kindness known to his people, out of the sight and hearing of the world. Joseph shed tears of tenderness and strong affection, and with these threw off that austerity with which he had hitherto behaved toward his brethren. This represents the Divine compassion toward returning penitents. I am Joseph, your brother. This would humble them yet more for their sin in selling him, but would encourage them to hope for kind treatment. Thus, when Christ would convince Paul, he said, I am Jesus; and when he would comfort his disciples, he said, It is I, be not afraid. When Christ manifests himself to his people, he encourages them to draw near to him with a true heart. Joseph does so, and shows them, that whatever they thought to do against him, God had brought good out of it. Sinners must grieve and be angry with themselves for their sins, though God brings good out of it, for that is no thanks to them. The agreement between all this, and the case of a sinner, on Christ's manifesting himself to his soul, is very striking. He does not, on this account, think sin a less, but a greater evil; and yet he is so armed against despair, as even to rejoice in what God hath wrought, while he trembles in thinking of the dangers and destruction from which he has escaped. Joseph promises to take care of his father and all the family. It is the duty of children, if the necessity of their parents at any time require it, to support and supply them to the utmost of their ability; this is showing piety at home, 1Ti 5:4. After Joseph had embraced Benjamin, he caressed them all, and then his brethren talked with him freely of all the affairs of their father's house. After the tokens of true reconciliation with the Lord Jesus, sweet communion with him follows.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Barnes' Notes on the Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Joseph now reveals to his brothers the astonishing fact that he himself, their long-lost brother, stands before them. \"He could not refrain himself.\" Judah has painted the scene at home to the life; and Joseph can hold out no longer. \"Have every man out from me.\" Delicacy forbids the presence of strangers at this unrestrained outburst of tender emotion among the brothers. Besides, the workings of conscience, bringing up the recollections of the past, and the errors, to which some reference is now unavoidable, are not to be unveiled to the public eye. \"He lifted up his voice in weeping.\" The expression of the feelings is free and uncontrolled in a simple and primitive state of society. This prevails still in the East. And Mizraim heard. The Egyptians of Joseph's house would hear, and report to others, this unusual utterance of deep feeling. \"I am Joseph.\" The natural voice, the native tongue, the long-remembered features, would, all at once, strike the apprehension of the brothers.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "The remembrance of their crime, the absolute power of Joseph, and the justice of revenge, would rush upon their minds. No wonder they were silent and troubled at his presence. \"Is my father yet alive?\" This question shows where Joseph's thoughts were. He had been repeatedly assured of his father's welfare. But the long absence and the yearning of a fond heart bring the question up again. It was reassuring to the brethren, as it was far away from any thought of their fault or their punishment. \"Come near unto me.\" Joseph sees the trouble of his brothers, and discerns its cause. He addresses them a second time, and plainly refers to the fact of their having sold him. He points out that this was overruled of God to the saving of life; and, hence, that it was not they, but God who had mercifully sent him to Egypt to preserve all their lives. \"For these two years.\" Hence, we perceive that the sons of Jacob obtained a supply, on the first occasion, which was sufficient for a year. \"To leave to you a remnant in the land.\"",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "This is usually and most naturally referred to a surviving portion of their race. \"Father to Pharaoh;\" a second author of life to him. Having touched very slightly on their transgression, and endeavored to divert their thoughts to the wonderful providence of God displayed in the whole affair, he lastly preoccupies their minds with the duty and necessity of bringing down their father and all their families to dwell in Egypt. \"In the land of Goshen.\" This was a pasture land on the borders of Egypt and Arabia, perhaps at some distance from the Nile, and watered by the showers of heaven, like their own valleys. He then appeals to their recollections and senses, whether he was not their very brother Joseph. \"My mouth that speaketh unto you;\" not by an interpreter, but with his own lips, and in their native tongue. Having made this needful and reassuring explanation, he breaks through all distance, and falls upon Benjamin's neck and kisses him, and all his other brothers; after which their hearts are soothed, and they speak freely with him.",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Jamieson-Fausset-Brown Bible Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "CHAPTER 45",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "Ge 45:1-28. Joseph Making Himself Known.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "1. Then Joseph could not refrain himself—The severity of the inflexible magistrate here gives way to the natural feelings of the man and the brother. However well he had disciplined his mind, he felt it impossible to resist the artless eloquence of Judah. He saw a satisfactory proof, in the return of all his brethren on such an occasion, that they were affectionately united to one another; he had heard enough to convince him that time, reflection, or grace had made a happy improvement on their characters; and he would probably have proceeded in a calm and leisurely manner to reveal himself as prudence might have dictated. But when he heard the heroic self-sacrifice of Judah [Ge 44:33] and realized all the affection of that proposal—a proposal for which he was totally unprepared—he was completely unmanned; he felt himself forced to bring this painful trial to an end.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "he cried, Cause every man to go out from me—In ordering the departure of witnesses of this last scene, he acted as a warm-hearted and real friend to his brothers—his conduct was dictated by motives of the highest prudence—that of preventing their early iniquities from becoming known either to the members of his household, or among the people of Egypt.Joseph no longer able to refrain, discovers himself to his brethren, and weeps; asks concerning his father: they are troubled at his presence,  Genesis 45:1-3. He forbids their grief for their sin, and comforts them with God’s gracious design and providence in it,  Genesis 45:4-8. He hastens them to go and acquaint their father, and bring him to Egypt; his message to his father,  Genesis 45:9-13. His kindness to Benjamin and his brethren,  Genesis 45:14,15. Pharaoh is glad, and invites them down to Egypt,  Genesis 45:16-20. Joseph dismisses them with gifts and presents to his father; exhorting them not to fall out by the way,  Genesis 45:21-24. Coming home they relate all to their father, who at last believes them, rejoicing that he should see his son before he died,  Genesis 45:25-28.  Cause every man to go out from me;  remove all the Egyptians out of my presence and chamber. Which he did, partly that he might maintain the honour of his place, and not make himself cheap and contemptible to the Egyptians, by his excessive tears and passions, and by his free, and familiar, and affectionate converse with his brethren; and partly to preserve the reputation of his brethren, by concealing their fault from the Egyptians. ",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Gill's Exposition of the Entire Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Then Joseph could not refrain himself,.... That he should not weep, as the Targum of Jonathan adds; at least he could not much longer refrain from tears, such an effect Judah's speech had on his passions: ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "before all them that stood before him; his servants that attended him and waited upon him, the steward of his house, and others, upon whose account he put such a force upon himself, to keep in his passions from giving vent, that they might not discover the inward motions of his mind; but not being able to conceal them any longer: ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "and he cried; or called out with a loud voice, and an air of authority: ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "cause every man to go out from me; out of the room in which he and his brethren were; perhaps this order was given to the steward of the house to depart himself, and to remove every inferior officer and servant upon the spot; or other people that might be come in to hear the trial of those men, and to see how they would be dealt with: ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "and there stood no man with him, while Joseph made himself known unto his brethren; not that Joseph was ashamed of them, and of owning before them the relation he stood in to them; but that they might not see the confusion his brethren would be thrown into, and have knowledge of the sin they had been guilty of in selling him which could not fail of being mentioned by him, and confessed by them; and besides, it was not suitable to his grandeur and dignity to be seen in such an extreme passion he was now going into. ",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Geneva Study Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse2",
            "text": "Then Joseph could not refrain himself before all them that stood by him; and he cried, {a} Cause every man to go out from me. And there stood no man with him, while Joseph made himself known unto his brethren.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "(a) Not because he was ashamed of his kindred, but rather because he wanted to cover his brother's sin.",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1–15. Joseph makes himself known to his Brethren",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "refrain himself",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] As in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 43:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The vehemence of Joseph’s emotion forms a trait in his character and a feature in the narrative. Cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Genesis 45:2; Genesis 45:14-15",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 45:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 45:14-15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 42:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 43:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 46:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 1, 2.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Then",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (literally, and) ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Joseph could not refrain himself",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " keep himself from giving way to the impulses of love) ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "before all them that stood by him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the Egyptian officials of his household); and he cried (or made proclamation, issued an instruction), ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Cause every man to go out from me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And there stood no man with him, while Joseph made himself known unto his brethren. It was true delicacy on the part of Joseph which prompted the discovery of himself to his brethren in private; not simply because he did not wish to pain his brethren by a public reference to their past wickedness, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "ne facinus illud detestabile multis testibus innoteseat",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Calvin), but because the unrestrained outburst of emotion ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "erga fratres et parentem non posset ferre alienorum praesentiam et aspectum",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Luther). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And he wept aloud",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "and he gave forth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or uttered, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "his voice in weeping",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": ": and the Egyptians and the house of Pharaoh heard",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": ": ",
            "children": []
          },
          {
            "element": "span",
            "class": "cmt_word",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "and the Egyptians and the house of Pharaoh heard",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". The meaning is that the Egyptian officials of Joseph's house, who were standing outside, heard, and reported it to the house of Pharaoh (Keil, Murphy). It is not necessary to suppose that Joseph's residence was so close to the palace that his voice was heard by the inmates (Lunge). Genesis 45:1",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The Recognition. - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 45:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". After this appeal, in which Judah, speaking for his brethren, had shown the tenderest affection for the old man who had been bowed down by their sin, and the most devoted fraternal love and fidelity to the only remaining son of his beloved Rachel, and had given a sufficient proof of the change of mind, the true conversion, that had taken place in themselves, Joseph could not restrain himself any longer in relation to all those who stood round him. He was obliged to relinquish the part which he had hitherto acted for the purpose of testing his brothers' hearts, and to give full vent to his feelings. \"He called out: Cause every man to go out from me. And there stood no man (of his Egyptian attendants) with him, while Joseph made himself known to his brethren,\" quia effusio illa affectuum et στοργῆς erga fratres et parentem tanta fuit, ut non posset ferre alienorum praesentiam et aspectum (Luther).",
        "children": []
      }
    ]
  }
]