[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "30:1-7 It was often the fault and folly of the Jews, that when troubled by their neighbours on one side, they sought for succour from others, instead of looking up to God. Nor can we avoid the dreadful consequences of adding sin to sin, but by making the righteousness of Christ our refuge, and seeking for the sanctification of the Holy Spirit. Men have always been prone to lean to their own understandings, but this will end in their shame and misery. They would not trust in God. They took much pains to gain the Egyptians. The riches so spent turned to a bad account. See what dangers men run into who forsake God to follow their carnal confidences. The Creator is the Rock of ages, the creature a broken reed; we cannot expect too little from man, or too much from God. Our strength is to sit still, in humble dependence upon God and his goodness, and quiet submission to his will.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Therefore shall the strength of Pharaoh be your shame - (see the note at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 20:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Your confusion - Hebrew, 'For reproach.' It would either occur that the Egyptians \"would\" not enter into an alliance; or that if they did, they \"could\" not defend them, and in either case it would be the source of deep regret and shame. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Your confusion - Hebrew, 'For reproach.' It would either occur that the Egyptians \"would\" not enter into an alliance; or that if they did, they \"could\" not defend them, and in either case it would be the source of deep regret and shame. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3. shame—disappointment. Egypt, weakened by its internal dissensions, can give no solid help.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " As being not only unprofitable, but mischievous to you. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Therefore shall the strength of Pharaoh be your shame,.... They should be disappointed of the help and assistance they expected from him, and so be ashamed of their ally, and of confidence in him: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the trust in the shadow of Egypt your confusion; they should be confounded, when they should find themselves unsupported by the Egyptians, in whom they put their confidence; so all such that trust in the creature, or in an arm of flesh, sooner or later are ashamed and confounded; but those that trust in the Lord never are, neither in this world, nor in that to come. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and the trust in the shadow of Egypt your confusion; they should be confounded, when they should find themselves unsupported by the Egyptians, in whom they put their confidence; so all such that trust in the creature, or in an arm of flesh, sooner or later are ashamed and confounded; but those that trust in the Lord never are, neither in this world, nor in that to come. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Therefore shall the strength of Pharaoh be your shame, and the trust in the shadow of Egypt your confusion.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "strength … trust",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "refuge … hiding",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 30:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Isaiah 30:3",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The plan which, according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 29:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", was already projected and prepared in the deepest secrecy, is now much further advanced. The negotiations by means of ambassadors have already been commenced; but the prophet condemns what he can no longer prevent. \"Woe to the stubborn children, saith Jehovah, to drive plans, and not by my impulse, and to plait alliance, and not according to my Spirit, to heap sin upon sin: that go away to travel down to Egypt, without having asked my mouth, to fly to Pharaoh's shelter, and to conceal themselves under the shadow of Egypt. And Pharaoh's shelter becomes a shame to them, and the concealment under the shadow of Egypt a disgrace. For Judah's princes have appeared in Zoan, and his ambassadors arrive in Hanes. They will all have to be ashamed of a people useless to them, that brings no help and no use, but shame, and also reproach.\" Sōrerı̄m is followed by infinitives with Lamed (cf., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 5:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 3:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "): who are bent upon it in their obstinacy. Massēkhâh designates the alliance as a plait (massēkheth). According to Cappellus and others, it designates it as formed with a libation (σπονδη, from σπένδεσθαι); but the former is certainly the more correct view, inasmuch as massēkhâh (from nâsakh, fundere) signifies a cast, and hence it is more natural here to take nâsakh as equivalent to sâkhakh, plectere (Jerome: ordiremini telam). The context leaves no doubt as to the meaning of the adverbial expressions ולא־מנּי and ולא־רוּחי, viz., without its having proceeded from me, and without my Spirit being there. \"Sin upon sin:\" inasmuch as they carry out further and further to perfect realization the thought which was already a sinful one in itself. The prophet now follows for himself the ambassadors, who are already on the road to the country of the Nile valley. He sees them arrive in Zoan, and watches them as they proceed thence into Hanes. He foresees and foretells what a disgraceful opening of their eyes will attend the reward of this untheocratical beginning. On lâ‛ōz b', see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 10:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : ‛ōz is the infinitive constr. of ‛ūz; mâ‛ōz, on the contrary, is a derivative of ‛âzaz, to be strong. The suffixes of שׂריו (his princes) and מלאכיו (his ambassadors) are supposed by Hitzig, Ewald, and Knobel, who take a different view of what is said, to refer to the princes and ambassadors of Pharaoh. But this is by no means warranted on the ground that the prophet cannot so immediately transfer to Zoan and Hanes the ambassadors of Judah, who were still on their journey according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 30:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The prophet's vision overleaps the existing stage of the desire for this alliance; he sees the great men of his nation already suing for the favour of Egypt, first of all in Zoan, and then still further in Hanes, and at once foretells the shameful termination of this self-desecration of the people of Jehovah. The lxx give for יגיעוּ חנּס, μάτην κοπιάσουσιν, i.e., ייגעוּ סהנּם, and Knobel approves this reading; but it is a misunderstanding, which only happens to have fallen out a little better this time than the rendering ὡς Δαυίδ given for כּדּוּר in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 29:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". If chinnâm had been the original reading, it would hardly have entered any one's mind to change it into chânēs. The latter was the name of a city on an island of the Nile in Central Egypt, the later Heracleopolis (Eg. Hnēs; Ehnēs), the Anysis of Herodotus (ii. 137). On Zoan, see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 19:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". At that time the Tanitic dynasty was reigning, the dynasty preceding the Ethiopian. Tanis and Anysis were the two capitals. הבאישׁ ( equals  היבשׁ  equals ( ה, a metaplastic hiphil of יבשׁ  equals  בּושׁ, a different word from יבשׁ) is incorrectly pointed for הבאישׁ, like ריאשׁנה (keri) for ראישׁנה in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 21:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". הבאישׁ signifies elsewhere, \"to make stinking\" (to calumniate, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 13:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), or \"to come into ill odour\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 27:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); here, however, it means to be put to shame (בּאשׁ  equals  בּושׁ). ",
        "children": []
      }
    ]
  }
]