[{"num":1,"verse":"Paul, messenger of Jesus Christ by God’s will, and brother Timothy send this greeting to all faithful Christians at Colossae: grace and peace be to you from God our Father and the Lord Jesus Christ!"},{"header":"We thank God for you and pray constantly for you"},{"num":3,"verse":"I want you to know by this letter that we here are constantly praying for you, and whenever we do we thank God the Father of our Lord Jesus Christ because you believe in Christ Jesus and because you are showing true Christian love towards other Christians. We know that you are showing these qualities because you have grasped the hope reserved for you in Heaven—that hope which first became yours when the truth was brought to you. It is, of course, part of the Gospel itself, which has reached you as it spreads all over the world. Wherever that Gospel goes, it produces Christian character, and develops it, as it had done in your own case from the time you first heard and realised the amazing fact of God’s grace."},{"num":7,"verse":"You learned these things, we understand, from Epaphras who is in the same service as we are. He is a most well-loved minister of Christ, and has your well-being very much at heart. As a matter of fact, it was from him that we heard about your growth in Christian love, so you will understand that since we heard about you we have never missed you in our prayers. We are asking God that you may see things, as it were, from his point of view by being given spiritual insight and understanding. We also pray that your outward lives, which men see, may bring credit to your master’s name, and that you may bring joy to his heart by bearing genuine Christian fruit, and that your knowledge of God may grow yet deeper."},{"header":"We pray for you to have real Christian experience"},{"num":11,"verse":"As you live this new life, we pray that you will be strengthened from God’s boundless resources, so that you will find yourselves able to pass through any experience and endure it with courage. You will even be able to thank God in the midst of pain and distress because you are privileged to share the lot of those who are living in the light. For we must never forget that he rescued us from the power of darkness, and re-established us in the kingdom of his beloved Son, that is, in the kingdom of light. For it is by his Son alone that we have been redeemed and have had our sins forgiven."},{"header":"Who Christ is, and what he has done"},{"num":15,"verse":"Now Christ is the visible expression of the invisible God. He existed before creation began, for it was through him that every thing was made, whether spiritual or material, seen or unseen. Through him, and for him, also, were created power and dominion, ownership and authority. In fact, every single thing was created through, and for him. He is both the first principle and the upholding principle of the whole scheme of creation. And now he is the head of the body which is composed of all Christian people. Life from nothing began through him, and life from the dead began through him, and he is, therefore, justly called the Lord of all. It was in him that the full nature of God chose to live, and through him God planned to reconcile in his own person, as it were, everything on earth and everything in Heaven by virtue of the sacrifice of the cross."},{"num":21,"verse":"And you yourselves, who were strangers to God, and, in fact, through the evil things you had done, his spiritual enemies, he has now reconciled through the death of his body on the cross, so that he might welcome you to his presence clean and pure, without blame or reproach. This reconciliation assumes, of course, that you maintain a firm position in the faith, and do not allow yourselves to be shifted away from the hope of the Gospel, which you have heard, and which, indeed, the whole world is now having an opportunity of hearing."},{"header":"My divine commission"},{"num":24,"verse":"I myself have been made a minister of this same Gospel, and though it is true at this moment that I am suffering on behalf of you who have heard the Gospel, yet I am far from sorry about it. Indeed, I am glad, because it gives me a chance to complete in my own sufferings something of the untold pains for which Christ suffers on behalf of his body, the Church. For I am a minister of the Church by divine commission, a commission granted to me for your benefit and for a special purpose: that I might fully declare God’s word—that sacred mystery which up to now has been hidden in every age and every generation, but which is now as clear as daylight to those who love God. They are those to whom God has planned to give a vision of the full wonder and splendour of his secret plan for the sons of men. And the secret is simply this: Christ in you! Yes, Christ in you bringing with him the hope of all glorious things to come."},{"header":"To preach and teach Christ is everything to us"},{"num":28,"verse":"So, naturally, we proclaim Christ! We warn everyone we meet, and we teach everyone we can, all that we know about him, so that, if possible, we may bring every man up to his full maturity in Christ. This is what I am working at all the time, with all the strength that God gives me."}]