[{"header":"Paul’s Painful Visit"},{"num":2,"verse":"Now I decided not to pay you another painful visit. "},{"num":2,"verse":"After all, if I were to grieve you, who should make me happy but the person I am making sad? "},{"num":3,"verse":"This is the very reason I wrote you, so that when I did come I might not be made sad by those who should have made me happy. For I had confidence that all of you would share the joy that I have. "},{"num":4,"verse":"I wrote to you out of great sorrow and anguish of heart—along with many tears—not to make you sad but to let you know how much love I have for you."},{"header":"Forgive the Person who Sinned"},{"num":5,"verse":"But if anyone has caused grief, he didn’t cause me any grief. To some extent—I don’t want to emphasize this too much—it has affected all of you. "},{"num":6,"verse":"This punishment by the majority is severe enough for such a man. "},{"num":7,"verse":"So forgive and comfort him, or else he will drown in his excessive grief. "},{"num":8,"verse":"That’s why I’m urging you to assure him of your love. "},{"num":9,"verse":"I had also written to you to see if you would stand the test and be obedient in every way. "},{"num":10,"verse":"When you forgive someone, I do, too. Indeed, what I have forgiven—if there was anything to forgive—I did in the presence of the Messiah for your benefit, "},{"num":11,"verse":"so that we may not be outsmarted by Satan. After all, we are not unaware of his intentions."},{"header":"Paul’s Anxiety and Relief"},{"num":12,"verse":"When I went to Troas on behalf of the gospel of the Messiah, the Lord opened a door for me, "},{"num":13,"verse":"but my spirit could not find any relief, because I couldn’t find Titus, my brother. So I said goodbye to them and went on to Macedonia."},{"num":14,"verse":"But thanks be to God! He always leads us triumphantly by the Messiah and through us spreads everywhere the fragrance of knowing him. "},{"num":15,"verse":"To God we are the aroma of the Messiah among those who are being saved and among those who are being lost. "},{"num":16,"verse":"To some people we are a deadly fragrance, while to others we are a living fragrance. Who is qualified for this? "},{"num":17,"verse":"At least we are not commercializing God’s word like so many others. Instead, we speak with sincerity in the Messiah’s name, like people who are sent from God and are accountable to God."}]