[{"num":1,"verse":"For by faith you stand. But I determined in myself that I would not come again to you in heaviness. "},{"num":2,"verse":"For if I make you sorrowful, who is it that should make me glad, but the same who are made sorrowful by me? "},{"num":3,"verse":"And I wrote this same epistle to you lest, if I went, I should be made sad by those of whom I ought to rejoice. Certainly this confidence I have in you all: that my joy is the joy of you all. "},{"num":4,"verse":"For in great affliction and anguish of heart I wrote to you, with many tears – not to make you sorrowful, but so that you might perceive the love that I have most specially for you."},{"num":5,"verse":"But if any man has caused grief, he has not grieved me but in part – lest I should overburden you all. "},{"num":6,"verse":"It is enough for the same man that he was rebuked by many. So now, instead, you ought to forgive him, and comfort him, "},{"num":7,"verse":"lest that same person should be swallowed up with overmuch heaviness. "},{"num":8,"verse":"Therefore I exhort you, so that love may have the power over him."},{"num":9,"verse":"For this reason also I wrote: to know the proof of you, whether you would be obedient in all things."},{"num":10,"verse":"Whomever you forgive for anything, I forgive also. And if I forgive a person anything, I forgive it for your sakes in the place of Christ, "},{"num":11,"verse":"lest Satan should get the advantage of us. For his devices are not unknown to us."},{"num":12,"verse":"When I had come to Troas for the sake of Christ’s gospel (and a great door was opened to me by the Lord), "},{"num":13,"verse":"I had no rest in my spirit, because I did not find Titus my brother. So I took my leave of them and went away into Macedonia – "},{"num":14,"verse":"thanks be to God, who always gives us the victory in Christ, and opens the savour of the knowledge of him by us in every place. "},{"num":15,"verse":"For we are for God the sweet savour of Christ, both among those who are saved and also among those who are perishing. "},{"num":16,"verse":"To the one part we are the savour of death unto death, and to the other part we are the savour of life unto life."},{"num":17,"verse":"For we are not as many are, who tamper with the word of God. But it is out of pureness, and by the power of God, and in the sight of God, that we speak in Christ."}]