[{"num":2,"verse":"For I decided this in myself: not again to come to you in agmat nefesh (grief). [1C 4:21; 2C 12:21]"},{"num":2,"verse":"For if I grieve you, then who is the one cheering me except the one I have caused to have agmat nefesh?"},{"num":3,"verse":"And I wrote the iggeret as I did, so that when I came, I should not have agmat nefesh from those who should have brought me simcha; for I have confidence about you all, that my simcha would be the simcha of all of you."},{"num":4,"verse":"For out of much tzoros and of lev (heart) distress I wrote the iggeret to you with many tears [Ac 20:31], not that you should have agmat nefesh, but that you may have da’as of the ahavah in Hashem which I have more abundantly for all of you."},{"num":5,"verse":"Now if anyone has caused agmat nefesh (grief), it is not me he has grieved, but to some extent, not to be too severe he has grieved you all. [1C 5:1]"},{"num":6,"verse":"Sufficient to such a man was this onesh (penalty) by the roiv (majority),"},{"num":7,"verse":"So that, on the contrary, rather you ought to give selichah (forgiveness) and chozek (strength) to him lest efsher (perhaps) such a one may be swallowed up by overwhelming remorse."},{"num":8,"verse":"Therefore I urge you to confirm to him your ahavah (love)."},{"num":9,"verse":"For I wrote the iggeret to this end, that I may have da’as that you are tested and proven, that in all things you have mishma’at (obedience). [2C 7:15; 10:6]"},{"num":10,"verse":"Now to anyone whom you give selichah (forgiveness) of anything, I do as well, for indeed what I have forgiven, if I have forgiven anything, it is for your sake in the presence of Moshiach;"},{"num":11,"verse":"Lest we should be outsmarted by Hasatan [Lk 22:31]; for we do not lack da’as of his kesharim (conspiracies)."},{"num":12,"verse":"But having come to Troas for the purpose of proclaiming the Besuras HaGeulah of Moshiach and a delet (door) to me having been opened by Adoneinu, [YECHEZKEL 20:14; Ac 14:27; 1C 16:9; Co 4:3; Rv 3:8]"},{"num":13,"verse":"I did not have shalom in my neshamah when I was not able to find Titos my Ach b’Moshiach. So I took leave of them and I went on to Macedonia.[Ac 20:1]"},{"num":14,"verse":"But Baruch Hashem, the One in whom we are given the nitzachon (victory), Who always leads us in triumph in Moshiach and, through us, in every place spreads the fragrance of the da’as of Him."},{"num":15,"verse":"For we are the aroma of Moshiach to Hashem among the ones coming to Yeshu’at Eloheinu, and among the ones perishing:[1C 1:18; DANIEL 12:2]"},{"num":16,"verse":"To the latter ones a fragrance of mavet unto mavet; but to the former ones a fragrance of Chayyim (life) unto Chayyim [Lk 2:34]. Who is sufficient for these things? [2C 3:5-6]"},{"num":17,"verse":"For we are not as many, peddling the dvar Hashem, but as from sincerity, as from Hashem, in the presence of Hashem, in Rebbe, Melech HaMoshiach we speak. [2C 1:12; 1K 4:11]"}]