[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(1) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "In the days of Uzziah.—",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "On the historical questions involved in this verse, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Introduction.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Hosea 1:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 1:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The word of the Lord that came unto Hosea — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The name of the prophet is the same with the original name of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Joshua, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and signifies ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a Saviour. The son of Beeri — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "This was the prophet’s surname; for in those days they had their surnames either from their parents, as we have, or from the places of their abode. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Beeri ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "signifies a well. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "In the days of Uzziah, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — “If we suppose,” says Archbishop Newcome, “that Hosea prophesied during the course of sixty-six years, and place him from the year 790 before Christ, to the year 724, he will have exercised his office eight years in the reign of Jeroboam the Second, thirty-three years in the reign of Uzziah, the entire reigns of Jotham and Ahaz, and three years in the reign of Hezekiah; but will not have survived the taking of Samaria.” It is probable, however, that he begun his ministry as early as the year 785; and therefore that he prophesied at least seventy, if not more, years. The Jews, indeed, suppose him to have prophesied near ninety years, and that he uttered much more than he wrote. If he exercised his office such a number of years, many of the other prophets, as Isaiah, Joel, Amos, Obadiah, and Micah, must have lived and prophesied during his time.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1:1-7 Israel was prosperous, yet then Hosea boldly tells them of their sins, and foretells their destruction. Men are not to be flattered in sinful ways because they prosper in the world; nor will it last long if they go on still in their trespasses. The prophet must show Israel their sin; show it to be exceedingly hateful. Their idolatry is the sin they are here charged with. Giving that glory to any creature which is due to God alone, is an injury and affront to God; such as for a wife to take a stranger, is to her husband. The Lord, doubtless, had good reasons for giving such a command to the prophet; it would form an affecting picture of the Lord's unmerited goodness and unwearied patience, and of the perverseness and ingratitude of Israel. We should be broken and wearied with half that perverseness from others, with which we try the patience and grieve the Spirit of our God. Let us also be ready to bear any cross the Lord appoints. The prophet must show the ruin of the people, in the names given to his children. He foretells the fall of the royal family in the name of his first child: call his name Jezreel, which signifies dispersion. He foretells God's abandoning the nation in the name of the second child; Lo-ruhamah, not beloved, or not having obtained mercy. God showed great mercy, but Israel abused his favours. Sin turns away the mercy of God, even from Israel, his own professing people. If pardoning mercy is denied, no other mercy can be expected. Though some, through unbelief, are broken off, yet God will have a church in this world till the end of time. Our salvation is owing to God's mercy, not to any merit of our own. That salvation is sure, of which he is the Author; and if he will work, none shall hinder.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The word of the Lord, that came unto Hosea - Hosea, at the very beginning of his prophecy, declares that all this, which he delivered, came, not from his own mind but from God. As Paul says, \"Paul an Apostle, not of men neither by man, but by Jesus Christ, and God the Father.\" He refers all to God, and claims all obedience to Him. That word came to him; it existed then before, in the mind of God. It was first God's, then it became the prophet's, receiving it from God. So it is said, \"the word of God came to John\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 3:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Hosea - i. e., \"Salvation, or, the Lord saveth.\" The prophet bare the name of our Lord Jesus, whom he foretold and of whom he was a type. \"Son of Beeri, i. e., my well or welling-forth.\" God ordained that the name of his father too should signify truth. From God, as from the fountain of life, Hosea drew the living waters, which he poured out to the people. \"With joy shall ye draw water out of the wells of salvation\" Isaiah 12:3.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Hosea - i. e., \"Salvation, or, the Lord saveth.\" The prophet bare the name of our Lord Jesus, whom he foretold and of whom he was a type. \"Son of Beeri, i. e., my well or welling-forth.\" God ordained that the name of his father too should signify truth. From God, as from the fountain of life, Hosea drew the living waters, which he poured out to the people. \"With joy shall ye draw water out of the wells of salvation\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 12:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "In the days of Uzziah ... - Hosea, although a prophet of Israel, marks his prophecy by the names of the kings of Judah, because the kingdom of Judah was the kingdom of the theocracy, the line of David to which the promises of God were made. As Elisha, to whose office he succeeded, turned away from Jehoram 2 Kings 3:13-14, saying, \"get thee to the prophets of thy father, and to the prophets of thy mother,\" and owned Jehoshaphat king of Judah only, so, in the title of his prophecy, Hosea at once expresses that the kingdom of Judah alone was legitimate. He adds the name of Jeroboam, partly as the last king of Israel whom, by virtue of His promise to Jehu, God helped; partly to show that God never left Israel unwarned. Jeroboam I was warned first by the prophet 1 Kings 13, who by his own untimely death, as well as in his prophecy, was a witness to the strictness of God's judgments, and then by Ahijah 1 Kings 14; Baasha by Jehu, son of Hanani 1 Kings 16; Ahab, by Elijah and Micaiah son of Imla; Ahaziah by Elijah 2 Kings 1; Jehoram by Elisha who exercised his office until the days of Joash 2 Kings 13:14.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In the days of Uzziah ... - Hosea, although a prophet of Israel, marks his prophecy by the names of the kings of Judah, because the kingdom of Judah was the kingdom of the theocracy, the line of David to which the promises of God were made. As Elisha, to whose office he succeeded, turned away from Jehoram ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 3:13-14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", saying, \"get thee to the prophets of thy father, and to the prophets of thy mother,\" and owned Jehoshaphat king of Judah only, so, in the title of his prophecy, Hosea at once expresses that the kingdom of Judah alone was legitimate. He adds the name of Jeroboam, partly as the last king of Israel whom, by virtue of His promise to Jehu, God helped; partly to show that God never left Israel unwarned. Jeroboam I was warned first by the prophet ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", who by his own untimely death, as well as in his prophecy, was a witness to the strictness of God's judgments, and then by Ahijah ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; Baasha by Jehu, son of Hanani ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; Ahab, by Elijah and Micaiah son of Imla; Ahaziah by Elijah ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; Jehoram by Elisha who exercised his office until the days of Joash ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 13:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "So, in the days of Jeroboam II, God raised up Hosea, Amos and Jonah. \"The kings and people of Israel then were without excuse, since God never ceased to send His prophets among them; in no reign did the voice of the prophets fail, warning of the coming wrath of God, until it came.\" While Jeroboam was recovering to Israel a larger rule than it had ever had since it separated from Judah, annexing to it Damascus 2 Kings 14:28 which had been lost to Judah even in the days of Solomon, and from which Israel had of late so greatly suffered, Hosea was sent to forewarn it of its destruction. God alone could utter \"such a voice of thunder out of the midst of such a cloudless sky.\" Jeroboam doubtless thought that his house would, through its own strength, survive the period which God had pledged to it. \"But temporal prosperity is no proof either of stability or of the favor of God. Where the law of God is observed, there, even amid the pressure of outward calamity, is the assurance of ultimate prosperity. Where God is disobeyed, there is the pledge of coming destruction. The seasons when men feel most secure against future chastisement, are often the preludes of the most signal revolutions.\" ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "So, in the days of Jeroboam II, God raised up Hosea, Amos and Jonah. \"The kings and people of Israel then were without excuse, since God never ceased to send His prophets among them; in no reign did the voice of the prophets fail, warning of the coming wrath of God, until it came.\" While Jeroboam was recovering to Israel a larger rule than it had ever had since it separated from Judah, annexing to it Damascus ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 14:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " which had been lost to Judah even in the days of Solomon, and from which Israel had of late so greatly suffered, Hosea was sent to forewarn it of its destruction. God alone could utter \"such a voice of thunder out of the midst of such a cloudless sky.\" Jeroboam doubtless thought that his house would, through its own strength, survive the period which God had pledged to it. \"But temporal prosperity is no proof either of stability or of the favor of God. Where the law of God is observed, there, even amid the pressure of outward calamity, is the assurance of ultimate prosperity. Where God is disobeyed, there is the pledge of coming destruction. The seasons when men feel most secure against future chastisement, are often the preludes of the most signal revolutions.\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "THE BOOK OF HOSEA Commentary by A. R. Faussett   ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "INTRODUCTION",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The first of the twelve minor prophets in the order of the canon (called \"minor,\" not as less in point of inspired authority, but simply in point of size). The twelve are first mentioned by Jesus, the son of Sirach (Ecclesiasticus 49:10). St. Stephen, in Ac 7:42 (in referring to Am 5:27), quotes them as forming one collective body of writings, \"the book of the prophets.\" So Jerome and Melito, the first Greek father who has left us a catalogue of these books. The collection of the sacred books is by Jewish tradition attributed to the great synagogue of learned scribes formed by Ezra. Many think Nehemiah completed this collection by adding to the books already in the canon those of his own times. Malachi, the last in the series, probably aided him in determining with infallible authority what books were entitled to be ranked in the inspired canon. The chronological order differs from the canonical. Joel, about 810 B.C.; Jonah, about 810 B.C., or, as others, first, 862 B.C.; Amos, about 790 B.C.; Hosea, about 784 B.C. Hosea, the contemporary of Isaiah, Micah, and Amos, seems to have entered on his prophetical office in the last years of Jeroboam (contemporary in part with Uzziah), and to have ended it in the beginning of Hezekiah's reign, 722 B.C., that is, about sixty years in all, from 784 B.C. to 722 B.C. The prophets, however, were not uninterruptedly engaged in prophesying. Considerable intervals elapsed, though their office as divinely commissioned public teachers was never wholly laid aside. The Book of Hosea which we have constitutes only that portion of his public teachings which the Holy Spirit saw fit to preserve for the benefit of the Church. The cause of his being placed first of the twelve was, probably, the length, the vivid earnestness, and patriotism of his prophecies, as well as their closer resemblance to those of the greater prophets. His style is abrupt, sententious, and unrounded; the connecting particles are few; there are changes of person, and anomalies of gender, number, and construction. His name means Salvation. He was son of Beeri, of the tribe of Issachar, born in Beth-shemesh [Jerome]. His mention, in the inscription, of Uzziah, Jotham, Ahaz, and Hezekiah, kings of Judah, is no proof that he belonged to Judah: for the prophets in Israel regarded its separation from Judah, civil as well as religious, as an apostasy from God, who promised the dominion of the theocracy to the line of David. Hence Elijah in Israel took twelve stones to represent Judah, as well as Israel (1Ki 18:31). Hence Hosea dates from Judah's kings, as well as from Jeroboam of Israel, though he belonged to Israel, with whose sins and fate his book is chiefly occupied. He, however, makes incidental references to Judah. His first prophecy foretells the overthrow of Jehu's house, fulfilled on the death of Jeroboam, Jehu's great-grandson (2Ki 15:12), in Zachariah, Jeroboam's son, the fourth and last from Jehu, conspired against by Shallum. This first prediction was doubtless in Jeroboam's life, as Zachariah, his son, was only suffered to reign six months; thus the inscription is verified that \"the word of the Lord came unto him in the days of Jeroboam\" (Ho 1:1). Again, in Ho 10:14, Shalmaneser's expedition against Israel is alluded to as past, that is, the first inroad against King Hoshea, who began to reign in the twelfth year of Ahaz; so that as Ahaz' whole reign was sixteen years, the prophecy seems to have been given about the beginning of Hezekiah's reign. Thus the inscription is confirmed that the exercise of his prophetical functions was of such a protracted duration.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Hosea (Ho 11:1) is quoted in Mt 2:15; also Ho 6:6 in Mt 9:13; 12:7; compare Ro 9:25, 26, quoting Ho 1:10; 2:1, 23; 1Co 15:55, quoting Ho 13:14; 1Pe 2:10, quoting Ho 1:9, 10; 2:23. Messianic references are not frequent; but the predictions of the future conversion of Israel to the Lord their God, and David their king, and of the fulfilment of the promise to Abraham that his spiritual seed should be as the sand of the sea (Ho 1:10; 3:5), clearly refer to the New Testament dispensation.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The first and third chapters are in prose, the rest of the book is rhythmical.   ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "CHAPTER 1",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ho 1:1-11. Inscription.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Spiritual whoredom of Israel set forth by symbolical acts; Gomer taken to wife at God's command: Jezreel, Lo-ruhamah, and Lo-Ammi, the children. Yet a promise of Judah and Israel's restoration.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. The word of the Lord that came unto Hosea—See [1115]Introduction.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Jeroboam—the second; who died in the fifteenth year of Uzziah's forty-one years' reign. From his time forth all Israel's kings worshipped false gods: Zachariah (2Ki 15:9), Menahem (2Ki 15:18), Pekahiah (2Ki 15:24), Pekah (2Ki 15:28), Hoshea (2Ki 17:2). As Israel was most flourishing externally under Jeroboam II, who recovered the possessions seized on by Syria, Hosea's prophecy of its downfall at that time was the more striking as it could not have been foreseen by mere human sagacity. Jonah the prophet had promised success to Jeroboam II from God, not for the king's merit, but from God's mercy to Israel; so the coast of Israel was restored by Jeroboam II from the entering of Hamath to the sea of the plain (2Ki 14:23-27).The times in which Hosea prophesied, Hos 1:1. To show the idolatrous whoredoms of the land, he marrieth a wife of whoredom, and hath by her Jezreel, Hos 1:2-5, Lo-ruhamah, Hos 1:6,7, and Lo-ammi, Hos 1:8,9. The restoration of Judah and Israel under one head, Hos 1:10,11.  The word,  or the command, and the thing commanded; or the prediction expressed in the very words God suggested by his Spirit to the prophet, and the things too which are now foretold; for holy men of God spake as they were moved, &c., 2Pe 1:21, and the things that were shortly to come to pass were revealed also, in the words of Rev 1:1. Hosea shows the things, and speaks them in words which God hath suggested to him. The Lord; the Eternal, as the French, Jehovah, Heb., which expresseth the eternity and infinite being of our God, together with his sovereignty and absolute authority over all. This is expressly added, to give warning to the prophet, to command audience, attention, reverence, and submission in the hearers, and to intimate to them the certainty of execution if they repent not, and the certainty of performance of promise if they believe; for it is Jehovah who changeth not that speakest both. Came to Hosea;  or was with him; as it came to him, so it did abide with him, made a deep impression upon his mind. Prophets were too backward, rather than overforward, to publish sad tidings to sinning people. Moses was unwilling to go to Pharaoh; Jeremiah pent up the word till it grew like fire in his bowels, too hot, and he could have no ease till he gave it vent. It is not unlikely the prophet Hosea intimates by this expression some such effect the word of God had on him; he was full of the prophetic Spirit, its motions were ever with him, and stirring within him. Hosea;  a name that carrieth most comfortable news in the letter and signification of it, being the same with Joshua or Jesus; and his word or message from God to the good was comfortable, it was assurance both of preservation and salvation, as will appear in process of his prophecy. The son of Beeri: though some would have this Beeri to be the same with Beerah, 1Ch 5:6, it hath no probability, the names being different; beside that Beerah was carried captive by Tilgath-pilneser, and it is probable his family was carried away with him; or if Hosea had escaped his father's mishap, he would have given us at least some ground to believe by his words that he resented the unhappiness of his family in that respect; but we know the name of the prophet's father, we know not his tribe or country, or of what quality he was, where he lived, or when be died. In the days,  i.e. during the reign, in the times; it is a Scripture expression of times. Of Uzziah,  called Azariah, 2Ki 14:21, and Ozias, Mat 1:8; the beginning of whose reign is very variously guessed at, and after all is left uncertain; but this is clear, that Jeroboam was contemporary with Uzziah, who began to reign in the twenty-seventh year of Jeroboam: reckoning thence to the forty-first year of his reign, which was the last of Jeroboam, there will be fourteen years of Uzziah's reign in which Hosea prophesied; but if there was (as for aught I find there might be) some years of viceroyship in which Amaziah reigned with his father Joash, and the like between Jeroboam and his father, then a longer synchronism ariseth between Uzziah and Jeroboam, and a larger space of time for Hosea to prophesy in their days, which I search not into. Jotham; who succeeded Uzziah as governor, and judged the people while Uzziah, being a leper, was, according to the law, retired from conversing with men, and dwelt in a separate house, but retained the royal title and authority; but it is uncertain how many years this was. Some say fifteen years, others say four years (for we read, 2Ki 15:33, that he reigned sixteen years; and in 2Ki 15:30 we have his twentieth year. Now the four here mentioned seem to be those years of his viceroyship, or government for Uzziah); yet others say his governor's power was of shorter date, and that Uzziah was struck with the plague of leprosy in the last year of his age and reign. This seems scarce consistent with the report of Jotham's being over the house of the king, judging the people; and the leper king dwelling in a separate house till the day of his death, 2Ki 15:5 2Ch 26:21. They mistake, I think, who place this stroke of leprosy so late; and they do as much mistake who place it at the twenty-fifth of Uzziah, and make him a leper and seclude him twenty-seven years. Jotham hath the character of a good king, 1Ch 27:2,6; but he could not make his subjects good, 2Ch 27:2. Ahaz; the worst son of a good father, yet the father of one of the best of kings. He sinned more in his distress, 2Ch 28:22, and hastened God's judgments on him and his. Hezekiah; who reformed Judah, and walked so with God, that above any of the kings of Judah he was protected and rescued by the immediate hand of Heaven. How long Hosea prophesied in this king's reign appears not; but that he did prophesy a great while is most apparent, whether fifty, or sixty-five, or seventy, or seventy-five, or ninety years, which different computations have some to assert them, I determine not. Jeroboam; the great-grandson of Jehu, of whose greatness and sins you read 2Ki 14:24,25; he was of the religion of Jeroboam son of Nebat. Joash;  whose story you meet with 2Ki 13:10: though a great idolater, and reproved for it no doubt by Elisha, yet he gave a visit to the dying prophet, and with tears bewailed the public loss by Elisha's death, and by the prophet had a legacy given him, three victories over the Syrians; and more they should have been, had not Joash been sparing too much to his own great loss. I remember not any single visit so nobly and magnificently repaid. Israel;  kingdom of the ten tribes, contradistinguished to Judah. By this then it appears Hosea was sent to prophesy against the sins of Israel, or the ten tribes, as well as against the sins of Judah; against Israel he prophesied during Jeroboam's times, (and afterward left them to their obstinacy,) but he continued to prophesy to Judah until his death. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Jeroboam—the second; who died in the fifteenth year of Uzziah's forty-one years' reign. From his time forth all Israel's kings worshipped false gods: Zachariah (2Ki 15:9), Menahem (2Ki 15:18), Pekahiah (2Ki 15:24), Pekah (2Ki 15:28), Hoshea (2Ki 17:2). As Israel was most flourishing externally under Jeroboam II, who recovered the possessions seized on by Syria, Hosea's prophecy of its downfall at that time was the more striking as it could not have been foreseen by mere human sagacity. Jonah the prophet had promised success to Jeroboam II from God, not for the king's merit, but from God's mercy to Israel; so the coast of Israel was restored by Jeroboam II from the entering of Hamath to the sea of the plain (2Ki 14:23-27).The times in which Hosea prophesied, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Hos 1:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". To show the idolatrous whoredoms of the land, he marrieth a wife of whoredom, and hath by her Jezreel, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Hos 1:2-5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", Lo-ruhamah, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Hos 1:6,7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and Lo-ammi, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Hos 1:8,9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The restoration of Judah and Israel under one head, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Hos 1:10,11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "The word, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " or the command, and the thing commanded; or the prediction expressed in the very words God suggested by his Spirit to the prophet, and the things too which are now foretold; for holy men of God spake as they were moved, &c., ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "2Pe 1:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and the things that were shortly to come to pass were revealed also, in the words of ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Rev 1:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Hosea shows the things, and speaks them in words which God hath suggested to him. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "The Lord",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "the Eternal",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", as the French, Jehovah, Heb., which expresseth the eternity and infinite being of our God, together with his sovereignty and absolute authority over all. This is expressly added, to give warning to the prophet, to command audience, attention, reverence, and submission in the hearers, and to intimate to them the certainty of execution if they repent not, and the certainty of performance of promise if they believe; for it is Jehovah who changeth not that speakest both. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Came to Hosea; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " or was with him; as it came to him, so it did abide with him, made a deep impression upon his mind. Prophets were too backward, rather than overforward, to publish sad tidings to sinning people. Moses was unwilling to go to Pharaoh; Jeremiah pent up the word till it grew like fire in his bowels, too hot, and he could have no ease till he gave it vent. It is not unlikely the prophet Hosea intimates by this expression some such effect the word of God had on him; he was full of the prophetic Spirit, its motions were ever with him, and stirring within him. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Hosea; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " a name that carrieth most comfortable news in the letter and signification of it, being the same with Joshua or Jesus; and his word or message from God to the good was comfortable, it was assurance both of preservation and salvation, as will appear in process of his prophecy. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "The son of Beeri:",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " though some would have this Beeri to be the same with Beerah, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "1Ch 5:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", it hath no probability, the names being different; beside that Beerah was carried captive by Tilgath-pilneser, and it is probable his family was carried away with him; or if Hosea had escaped his father's mishap, he would have given us at least some ground to believe by his words that he resented the unhappiness of his family in that respect; but we know the name of the prophet's father, we know not his tribe or country, or of what quality he was, where he lived, or when be died. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "In the days, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " i.e. during the reign, in the times; it is a Scripture expression of times. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Of Uzziah, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " called Azariah, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "2Ki 14:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Ozias, Mat 1:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; the beginning of whose reign is very variously guessed at, and after all is left uncertain; but this is clear, that Jeroboam was contemporary with Uzziah, who began to reign in the twenty-seventh year of Jeroboam: reckoning thence to the forty-first year of his reign, which was the last of Jeroboam, there will be fourteen years of Uzziah's reign in which Hosea prophesied; but if there was (as for aught I find there might be) some years of viceroyship in which Amaziah reigned with his father Joash, and the like between Jeroboam and his father, then a longer synchronism ariseth between Uzziah and Jeroboam, and a larger space of time for Hosea to prophesy in their days, which I search not into. Jotham; who succeeded Uzziah as governor, and judged the people while Uzziah, being a leper, was, according to the law, retired from conversing with men, and dwelt in a separate house, but retained the royal title and authority; but it is uncertain how many years this was. Some say fifteen years, others say four years (for we read, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "2Ki 15:33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", that he reigned sixteen years; and in ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "2Ki 15:30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " we have his twentieth year. Now the four here mentioned seem to be those years of his viceroyship, or government for Uzziah); yet others say his governor's power was of shorter date, and that Uzziah was struck with the plague of leprosy in the last year of his age and reign. This seems scarce consistent with the report of Jotham's being over the house of the king, judging the people; and the leper king dwelling in a separate house till the day of his death, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "2Ki 15:5 2Ch 26:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". They mistake, I think, who place this stroke of leprosy so late; and they do as much mistake who place it at the twenty-fifth of Uzziah, and make him a leper and seclude him twenty-seven years. Jotham hath the character of a good king, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "1Ch 27:2,6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; but he could not make his subjects good, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "2Ch 27:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Ahaz; the worst son of a good father, yet the father of one of the best of kings. He sinned more in his distress, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "2Ch 28:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and hastened God's judgments on him and his. Hezekiah; who reformed Judah, and walked so with God, that above any of the kings of Judah he was protected and rescued by the immediate hand of Heaven. How long Hosea prophesied in this king's reign appears not; but that he did prophesy a great while is most apparent, whether fifty, or sixty-five, or seventy, or seventy-five, or ninety years, which different computations have some to assert them, I determine not. Jeroboam; the great-grandson of Jehu, of whose greatness and sins you read ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "2Ki 14:24,25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; he was of the religion of Jeroboam son of Nebat. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Joash; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " whose story you meet with ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "2Ki 13:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ": though a great idolater, and reproved for it no doubt by Elisha, yet he gave a visit to the dying prophet, and with tears bewailed the public loss by Elisha's death, and by the prophet had a legacy given him, three victories over the Syrians; and more they should have been, had not Joash been sparing too much to his own great loss. I remember not any single visit so nobly and magnificently repaid. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Israel; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " kingdom of the ten tribes, contradistinguished to Judah. By this then it appears Hosea was sent to prophesy against the sins of Israel, or the ten tribes, as well as against the sins of Judah; against Israel he prophesied during Jeroboam's times, (and afterward left them to their obstinacy,) but he continued to prophesy to Judah until his death. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The word of the Lord that came unto Hosea,.... Whose name is the same with Joshua and Jesus, and signifies a saviour; he was in some things a type of Christ the Saviour, and prophesied of him, and salvation by him; and was the instrument and means of saving men, as all true prophets were, and faithful ministers of the word are: to him the word of the Lord, revealing his mind and will, was brought by the Spirit of God, and impressed upon his mind; and it was committed to him to be delivered unto others. This is the general title of the whole book, showing the divine original and authority of it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the son of Beeri; which is added to distinguish him from another of the same name; and perhaps his father's name was famous in Israel, and therefore mentioned. The Jews have a rule, that where a prophet's father's name is mentioned, it shows that he was the son of a prophet; but this is not to be depended upon; and some of them say that this is the same with Beerah, a prince of the Reubenites, who was carried captive by Tiglathpileser king of Assyria, 1 Chronicles 5:6, but the name is different; nor does the chronology seem so well to agree with him; and especially he cannot be the father of Hosea, if he was of the tribe of Issachar, as some have affirmed: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "the son of Beeri; which is added to distinguish him from another of the same name; and perhaps his father's name was famous in Israel, and therefore mentioned. The Jews have a rule, that where a prophet's father's name is mentioned, it shows that he was the son of a prophet; but this is not to be depended upon; and some of them say that this is the same with Beerah, a prince of the Reubenites, who was carried captive by Tiglathpileser king of Assyria, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 5:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", but the name is different; nor does the chronology seem so well to agree with him; and especially he cannot be the father of Hosea, if he was of the tribe of Issachar, as some have affirmed: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "in the days of Uzziah, Jotham, Ahaz, and Hezekiah, kings of Judah, and in the days of Jeroboam the son of Joash, king of Israel; from whence it appears that Hosea prophesied long, and lived to a great age; for from the last year of Jeroboam, which was the fifteenth of Uzziah, to the first of Hezekiah, must be sixty nine years; for Jeroboam reigned forty one years, and in the twenty seventh of his reign began Uzziah or Azariah to reign over Judah, and he reigned fifty two years, 2 Kings 14:23, so that Uzziah reigned thirty seven years after the death of Jeroboam, through which time Hosea prophesied; Jotham after him reigned sixteen years, and so many reigned Ahaz, 2 Kings 15:23, so that without reckoning any part, either of Jeroboam's reign, or Hezekiah's, he must prophesy sixty nine years, and, no doubt, did upwards of seventy, very probably eighty, the Jews say ninety; and allowing him to be twenty four or five years of age when he begun to prophesy, or only twenty (for it is certain he was at an age fit to marry, as appears by the prophecy), he: must live to be upwards of a hundred years; and in all probability he lived to see not only part of Israel carried captive by Tiglathpileser, which is certain; but the entire destruction of the ten tribes by Shalmaneser, which he prophesied of. Jeroboam king of Israel is mentioned last, though prior to these kings of Judah; because Hosea's prophecy is chiefly against Israel, and began in his reign, when they were in a flourishing condition. It appears from hence that Isaiah, Amos, and Micah, were contemporary with him; see Isaiah 1:1, within this compass of time Hosea prophesied lived Lycurgus the famous lawgiver of the Lacedemonians, and Hesiod the Greek poet; and Rome began to be built. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "in the days of Uzziah, Jotham, Ahaz, and Hezekiah, kings of Judah, and in the days of Jeroboam the son of Joash, king of Israel; from whence it appears that Hosea prophesied long, and lived to a great age; for from the last year of Jeroboam, which was the fifteenth of Uzziah, to the first of Hezekiah, must be sixty nine years; for Jeroboam reigned forty one years, and in the twenty seventh of his reign began Uzziah or Azariah to reign over Judah, and he reigned fifty two years, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 14:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", so that Uzziah reigned thirty seven years after the death of Jeroboam, through which time Hosea prophesied; Jotham after him reigned sixteen years, and so many reigned Ahaz, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 15:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", so that without reckoning any part, either of Jeroboam's reign, or Hezekiah's, he must prophesy sixty nine years, and, no doubt, did upwards of seventy, very probably eighty, the Jews say ninety; and allowing him to be twenty four or five years of age when he begun to prophesy, or only twenty (for it is certain he was at an age fit to marry, as appears by the prophecy), he: must live to be upwards of a hundred years; and in all probability he lived to see not only part of Israel carried captive by Tiglathpileser, which is certain; but the entire destruction of the ten tribes by Shalmaneser, which he prophesied of. Jeroboam king of Israel is mentioned last, though prior to these kings of Judah; because Hosea's prophecy is chiefly against Israel, and began in his reign, when they were in a flourishing condition. It appears from hence that Isaiah, Amos, and Micah, were contemporary with him; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 1:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", within this compass of time Hosea prophesied lived Lycurgus the famous lawgiver of the Lacedemonians, and Hesiod the Greek poet; and Rome began to be built. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(h) Shalsheleth Hakabala, fol. 12. 1.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(h) Shalsheleth Hakabala, fol. 12. 1.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "The word of the LORD that came unto Hosea, the son of Beeri, in the days {a} of Uzziah, Jotham, Ahaz, and Hezekiah, {b} kings of Judah, and in the days of Jeroboam the son of Joash, king of Israel.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The word of the LORD that came unto Hosea, the son of Beeri, in the days ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{a}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " of Uzziah, Jotham, Ahaz, ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "and",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Hezekiah, ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{b}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " kings of Judah, and in the days of Jeroboam the son of Joash, king of Israel.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The Argument - After the ten tribes had fallen away from God by the wicked and subtle counsel of Jeroboam, the son of Neba, and instead of his true service commanded by his word, worshipped him according to their own imaginings and traditions of men, giving themselves to most vile idolatry and superstition, the Lord from time to time sent them Prophets to call them to repentance. But they grew even worse and worse, and still abused God's benefits. Therefore now when their prosperity was at the highest under Jeroboam, the son of Joash, God sent Hosea and Amos to the Israelites (as he did at the same time send Isaiah and Micah to those of Judah) to condemn them for their ingratitude. And whereas they thought themselves to be greatly in the favour of God, and to be his people, the Prophet calls them bastards and children born in adultery: and therefore shows them that God would take away their kingdom, and give them to the Assyrians to be led away captives. Thus Hosea faithfully executed his office for the space of seventy years, though they remained still in their vices and wickedness and derided the Prophets, and condemned God's judgments. And because they would neither be discouraged with threatening only, nor should they flatter themselves by the sweetness of God's promises, he sets before them the two principal parts of the Law, which are the promise of salvation, and the doctrine of life. For the first part he directs the faithful to the Messiah, by whom alone they would have true deliverance: and for the second, he uses threatenings and menaces to bring them from their wicked manners and vices: and this is the chief scope of all the Prophets, either by God's promises to allure them to be godly, or else by threatenings of his judgments to scare them from vice. And even though the whole Law contains these two points, yet the Prophets moreover note distinctly both the time of God's judgments and the manner.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) Also called Azariah, who being a leper was disposed from his kingdom.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) So that it may be gathered by the reign of these four kings that he preached about eighty years.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". On the heading, see Introduction.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 1.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The word of the Lord that came unto Hosea, the son of Beeri.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The prophets are divided into the former (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "rishonim",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 1:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") prophets and the later prophets. The writings of the former prophets comprise most of the historical hooks, for the Hebrew conception of a prophet was that of an individual inspired by God to instruct men for the present or inform them of the future, whether orally or by writing; the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "later",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " were the prophets properly so called, while these, again, are subdivided into the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "greater",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", consisting of Isaiah, Jeremiah, and Ezekiel, and the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "lesser",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or minor, including the remaining twelve. The designation \"minor\" does not imply any inferiority in importance of subject or value of contents, but has respect solely to the smallness of their size as compared with the larger discourses of the others. The twelve minor prophets were added to the canon before its completion as a single book, \"lest,\" says Kimchi, in his commentary on this verse, \"a book of them should be lost because of its smallness, if each one of them should be kept separate by itself.\" They were accordingly reckoned as one book - ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "δώδεκα ἐν μονοβίβλῳ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as Eusebius expresses it. The name Hosea, like other Hebrew names, is significant, and denotes \"deliverance,\" or\" salvation;\" or, the abstract being put for the concrete, \"deliverer,\" or \"savior.\" It is radically the same name as Joshua, except that the prefix of the latter implies the name of Jehovah as the Author of such deliverance or salvation; while the Greek form of ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Joshua",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Jesus",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which in two passages of the Authorized Version stands for it. The form of the name in the original is closely connected with Hosanna (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "hoshia",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ha),\" save now,\" which occurs in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 118:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "In the days of Uzziah, Jotham, Ahaz, and Hezekiah, kings of Judah, and in the days of Jeroboam the son of Joash, king of Israel.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The period of Hosea's prophetic activity is one of the longest, if not the longest, on record. It continued during the reigns of the four kings of Judah above mentioned, and during that of Jeroboam II. King of Israel, which was in part coincident with that of Uzziah. Uzziah and Jeroboam reigned contemporaneously for twenty-six years. Somewhere during or rather before the end of that period Hosea commenced his ministry. Uzziah survived Jeroboam some twenty-six years, then Jotham and Ahaz in succession reigned each sixteen years. During all these fifty-eight years Hosea continued his ministerial labors. To these must be added a few years for the beginning of his prophetic career during the reign of Jeroboam, and some two or three years before its close in the reign of Hezekiah; for the destruction of Samaria, which took place in the fourth year of that king, the prophet looks forward to as still future. Thus for three score years and more - probably nearer three score years and ten, the ordinary period of human life - the prophet persevered in the discharge of his onerous duties. It may seem strange that, though Hosea exercised his prophetic function in Israel, yet the time during which he did so is reckoned by the reigns of the kings of Judah. The single exception of Jeroboam II. is accounted for in a rabbinic tradition on the ground that he did not credit or act on the evil report which Amaziah the priest of Bethel preferred against the Prophet Amos, as we read (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 7:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), \"Then Amaziah the priest of Bethel sent to Jeroboam King of Israel, saying, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Amos",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " hath conspired against thee in the midst of the house of Israel; the land is not able to bear all his words\" (see also vers. 11-13 of the same chapter). The real reason for the reckoning by the kings of Judah, and for the exceptional case of Jeroboam, was not that assigned by the rabbins; neither was it an indication, on the part of the prophet, of the legitimacy of the kingdom of Judah on the one hand, and evidence, on the other hand, of the performance of God's promise to Jehu that his sons would sit upon the throne to the fourth generation, while Jeroboam, Jehu's great-grandson, was the last king of that dynasty by whom God vouch-sated help to Israel, his son and successor Zechariah retaining possession of the kingdom only for the short space of six months. The true cause is rather to be sought in the regicides, usurpations, occasional anarchy, and generally unsettled state of the northern kingdom, inasmuch as such instability and uncertainty furnished no sure or satisfactory basis for chronological calculation. Thus we find that, on the death of Jeroboam II., there was an interregnum of some dozen years, during which, of course, a state of anarchy prevailed. At length Zechariah succeeded to the throne; he had reigned only six months when he was murdered by Shallum. Shallum's reign only lasted a month, when he was put to death by Menahem. During his reign often years occurred the invasion of Pal. Menahem's son, Pekachiah, had only reigned two years when he was murdered by Pekah, in whose reign Tiglath-pileser invaded the land. Hoshea slew Pekah. Next followed an interval of anarchy lasting eight years. Then, after Hoshea's short reign of nine years, the kingdom was destroyed. Thus it was only in the southern kingdom that a sufficiently firm foundation for chronological reckoning was available, while under these circumstances Jeroboam's reign was necessary to show the prophet's connection with Israel, and also that the prediction of the fourth verse preceded the event foretold. The general heading of the whole book is contained in this verse and Divine authority is thus claimed for the whole, as the prophet to whom the word of the Lord came is only Jehovah's spokesman. Hosea 1:1",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 1:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " contains the heading to the whole of the book of Hosea, the contents of which have already been discussed in the Introduction, and defended against the objections that have been raised, so that there is no tenable ground for refusing to admit its integrity and genuineness. The techillath dibber-Yehōvâh with which ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 1:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " introduces the prophecy, necessarily presupposes a heading announcing the period of the prophet's ministry; and the \"twisted, un-Hebrew expression,\" which Hitzig properly finds to be so objectionable in the translation, \"in the days of Jeroboam, etc., was the commencement of Jehovah's speaking,\" etc., does not prove that the heading is spurious, but simply that Hitzig's construction is false, i.e., that techillath dibber-Yehōvâh is not in apposition to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 1:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but the heading in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 1:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " contains an independent statement; whilst the notice as to time, with which ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 1:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " opens, does not belong to the heading of the whole book, but simply to the prophecy which follows in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 1-3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      }
    ]
  }
]