[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(2) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The beginning of the word",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " . . .—More correctly, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "In the beginning when the Lord spoke to Hosea, the Lord said",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " . . .",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Go, take unto thee a wife of whoredoms.—How are we to interpret the prophet’s marriage to the licentious Gomer? Is it an historic occurrence, the only too real tragedy of the author’s personal experience, employed for the purpose of illustration? (Comp. the domestic incident, Isaiah 8:1-4.) Or is this opening chapter a merely allegorical representation, designed to exhibit in vivid colours the terrible moral condition of Israel? (Comp. the symbolic actions described in Jeremiah 25:15-29; Ezekiel 4:4-6; and perhaps Isaiah 20:1-3.) Able writers have advocated each of these opposed theories; but in our opinion the balance of evidence inclines to the former view, which regards the events as historic. The further question arises, Was Gomer guilty before or after the marriage? The former supposition involves the harshness of conceiving such a marriage as the result of a Divine command; but the latter supposition admits of a satisfactory interpretation. The wickedness which after marriage revealed itself to the prophet’s agonised heart was transfigured to the inspired seer into an emblem of his nation’s wrong to Jehovah. In the light of this great idea, the prophet’s past came before him in changed aspect. As he reflected on the marvellous symbolic adaptation of this episode to the terrible spiritual needs of his fellow-countrymen, which he was called by God to supply, the Divine purpose which shaped his sorrowful career became interpreted to his glowing consciousness as a Divine command—“Go, take unto thyself a wife of whoredoms.” He had suffered acutely, but the agony was part of God’s arrangement, and the very love that was repeatedly outraged proves ultimately to have been suggested by a Divine monition.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Go, take unto thee a wife of whoredoms.—",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "How are we to interpret the prophet’s marriage to the licentious Gomer? Is it an historic occurrence, the only too real tragedy of the author’s personal experience, employed for the purpose of illustration? (Comp. the domestic incident, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 8:1-4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".) Or is this opening chapter a merely allegorical representation, designed to exhibit in vivid colours the terrible moral condition of Israel? (Comp. the symbolic actions described in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 25:15-29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 4:4-6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and perhaps ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 20:1-3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".) Able writers have advocated each of these opposed theories; but in our opinion the balance of evidence inclines to the former view, which regards the events as historic. The further question arises, Was Gomer guilty before or after the marriage? The former supposition involves the harshness of conceiving such a marriage as the result of a Divine command; but the latter supposition admits of a satisfactory interpretation. The wickedness which ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "after",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " marriage revealed itself to the prophet’s agonised heart was transfigured to the inspired seer into an emblem of his nation’s wrong to Jehovah. In the light of this great idea, the prophet’s past came before him in changed aspect. As he reflected on the marvellous symbolic adaptation of this episode to the terrible spiritual needs of his fellow-countrymen, which he was called by God to supply, the Divine purpose which shaped his sorrowful career became interpreted to his glowing consciousness as a Divine command—“Go, take unto thyself a wife of whoredoms.” He had suffered acutely, but the agony was part of God’s arrangement, and the very love that was repeatedly outraged proves ultimately to have been suggested by a Divine monition.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Children of whoredoms.—Children of Hosea’s marriage. The whole result of his family history was included in this divinely ordered plan.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Children of whoredoms.—",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Children of Hosea’s marriage. The whole result of his family history was included in this divinely ordered plan.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Hosea 1:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 1:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The beginning of the word of the Lord by Hosea — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Or, as some render it, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to Hosea; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "phrases however of different import; for to speak ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "a person, expresses that the discourse was immediately addressed to him. To speak ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "by ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "him, that through him it was addressed to others. And that the speech so addressed to others was not the person’s own, but God’s; God using him as his organ of speech to the people. This latter is evidently the meaning of the Hebrew phrase here used, which is not ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "אל הושׂע",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "בהושׂע",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and has been judiciously attended to by our translators, as it was also by the LXX., the Vulgate, the Chaldee, Luther’s Latin translation, Calvin’s, and Archbishop Newcome’s. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And the Lord said, Go, take unto thee a wife of whoredoms — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Commentators differ much with respect to the meaning of this command. Maimonides, a noted Jewish writer, supposes, that what was enjoined was only to be transacted in a vision; and many learned men, both ancient and modern, have been of his opinion. Archbishop Newcome supposes, that the command refers to the spiritual fornication, or idolatry, of the Israelites: and that its meaning is only, “Go, join thyself in marriage to one of those who have committed fornication against me; and raise up children, who, by the power of example, will themselves swerve to idolatry:” see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 5:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Some others suppose, that God only enjoins the prophet to marry one, who, he foresaw, would afterward be unfaithful to him, and become a harlot. Others again, and persons of great eminence for learning and Biblical knowledge, suppose the command implied, that he was to marry one who actually was at the time, or had been, a harlot. These different opinions, Bishop Horsley, in a preface to his translation of this prophecy, examines at large; and seems to have clearly proved, that the last-mentioned sense of the words is the true one. His train of reasoning on the subject is too long to find a place in these notes; a very short extract is all that can be inserted. “Here two questions arise, upon which expositors have been much divided; 1st, What is the character intended of the woman? What are the fornications by which she is characterized? Are they acts of incontinence, in the literal sense of the word, or something figuratively so called? And, 2d, This guilt of literal or figurative incontinence, was it previous to the woman’s marriage with the prophet, or contracted after it? The Hebrew phrase, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a wife of fornications, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "taken literally, certainly describes a prostitute; and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "children of fornications ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "are the offspring of a promiscuous commerce. Some, however, have thought, that the expression may signify nothing worse ‘than a wife taken from among the Israelites, who were remarkable for spiritual fornication, or idolatry.’ And that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "children of fornications ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "may signify children born of such a mother, in such a country, and likely to grow up in the habit of idolatry themselves, by the force of ill example. But the words thus interpreted contain a description only of public manners, without immediate application to the character of any individual; and the command to the prophet will be nothing more than to take a wife. It is evident, that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a wife of fornications ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "describes the sort of woman with whom the prophet is required to form the matrimonial connection. It expresses some quality in the woman, actually belonging to the prophet’s wife in her individual character. And this quality was no other than gross incontinence, in the literal meaning of the word. The prophet’s wife was, by the express declaration of the Spirit, to be the type, or emblem, of the Jewish nation, considered as the wife of God. The sin of the Jewish nation was idolatry, and the Scriptural type of idolatry is carnal fornication; the woman, therefore, to typify the nation, must be guilty of the typical crime; and the only question that remains is, whether the stain upon her character was previous to her connection with the prophet, or afterward? I should much incline to the opinion of Diodati, that the expression may be understood of a woman that was innocent at the time of her marriage, and proved false to the nuptial vow afterward, could I agree to what is alleged in favour of that interpretation by Dr. Wells and Mr. Lowth, that it makes the parallel more exact between God and his blacksliding people, than the contrary supposition of the woman’s previous impurity; especially if we make the further supposition, that the prophet had previous warning of his wife’s irregularities. But it seems to me, on the contrary, that the prophet’s marriage would be a more accurate type of the peculiar connection which God vouchsafed to form between himself and the Israelites, upon the admission of the woman’s previous incontinence. God’s marriage with Israel was the institution of the Mosaic covenant, at the time of the exodus, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 2:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but it is most certain that the Israelites were previously tainted, in a very great degree, with the idolatry of Egypt, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 17:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 18:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 24:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and they are repeatedly taxed with this by the prophets, under the image of the incontinence of a young unmarried woman: see Ezekiel 23. To make the parallel, therefore, exact in every circumstance between the prophet and his wife, God and Israel, the woman should have been addicted to vice before her marriage. The prophet, not ignorant of her numerous criminal intrigues, and of the general levity of her character, should nevertheless offer her marriage, upon condition that she should renounce her follies, and attach herself, with fidelity, to him as her husband; she should accept the unexpected offer, and make the fairest promises, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 19:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 24:3-7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 24:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The prophet should complete the marriage contract, (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 7:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 26:17-19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) and take the reformed harlot with a numerous bastard offspring to his own house. There she should bear children to the prophet; (as the ancient Jewish Church, amidst all her corruptions, bore many true sons of God;) but in a little time she should relapse to her former courses, and incur her husband’s displeasure, who yet should neither put her to death according to the rigour of the law, nor finally and totally divorce her. Accordingly, I am persuaded, the phrases ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "אשׂת זנונים",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ילדי זנונים",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", are to be taken literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a wife of prostitution, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "children of promiscuous intercourse; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "so taken, and only so taken, they produce the admirable parallel we have described.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "“If any one imagines, that the marriage of a prophet with a harlot is something so contrary to moral purity as in no case whatever to be justified; let him recollect the case of Salmon the Just, as he is styled in the Targum upon Ruth, and Rahab the harlot. If that instance will not remove his scruples, he is at liberty to adopt the opinion, which I indeed reject, but many learned expositors have approved, that the whole was a transaction in vision only, or in trance. I reject it, conceiving that whatever was unfit to be really commanded, or really done, was not very fit to be presented, as commanded, or as done, to the imagination of a prophet in his holy trance. Since this, therefore, was fit to be imagined, which is the least that can be granted, it was fit, (in my judgment,) under all the circumstances of the case, to be done. The greatness of the occasion, the importance of the end, as I conceive, justified the command in this extraordinary instance. The command, if it was given, surely sanctified the action: and, upon these grounds, till I can meet with some other exposition, which may render this typical wedding equally significant of the thing to be typified by it in all its circumstances, I am content to take the fact plainly, as it is related, according to the natural import of the words of the narration; especially as this way of taking it will lead to the true meaning of the emblematical act, even if it was commanded and done only in vision. In taking it as a reality, I have with me the authority, not certainly of the majority, but of some of the most learned and cautious expositors; which I mention, not so much to sustain the truth of the opinion, as to protect myself, in the avowal of it, from injurious imputations.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1:1-7 Israel was prosperous, yet then Hosea boldly tells them of their sins, and foretells their destruction. Men are not to be flattered in sinful ways because they prosper in the world; nor will it last long if they go on still in their trespasses. The prophet must show Israel their sin; show it to be exceedingly hateful. Their idolatry is the sin they are here charged with. Giving that glory to any creature which is due to God alone, is an injury and affront to God; such as for a wife to take a stranger, is to her husband. The Lord, doubtless, had good reasons for giving such a command to the prophet; it would form an affecting picture of the Lord's unmerited goodness and unwearied patience, and of the perverseness and ingratitude of Israel. We should be broken and wearied with half that perverseness from others, with which we try the patience and grieve the Spirit of our God. Let us also be ready to bear any cross the Lord appoints. The prophet must show the ruin of the people, in the names given to his children. He foretells the fall of the royal family in the name of his first child: call his name Jezreel, which signifies dispersion. He foretells God's abandoning the nation in the name of the second child; Lo-ruhamah, not beloved, or not having obtained mercy. God showed great mercy, but Israel abused his favours. Sin turns away the mercy of God, even from Israel, his own professing people. If pardoning mercy is denied, no other mercy can be expected. Though some, through unbelief, are broken off, yet God will have a church in this world till the end of time. Our salvation is owing to God's mercy, not to any merit of our own. That salvation is sure, of which he is the Author; and if he will work, none shall hinder.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The beginning of the word of the Lord by Hosea or in Hosea - God first revealed Himself and His mysteries to the prophet's soul, by His secret inspiration, and then declared, through him, to others, what He had deposited in him. God enlightened him, and then others through the light in him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And the Lord said unto Hosea - For this thing was to be done by Hosea alone, because God had commanded it, not by others of their own mind. To Isaiah God first revealed Himself, as sitting in the temple, adored by the Seraphim: to Ezekiel God first appeared, as enthroned above the cherubim in the holy of holies; to Jeremiah God announced that, ere yet he was born, He had sanctified him for this office: to Hosea He enjoined, as the beginning of his prophetic office, an act contrary to man's natural feelings, yet one, by which he became an image of the Redeemer, uniting to Himself what was unholy, in order to make it holy.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Go take unto thee - Since Hosea prophesied some eighty years, he must now have been in early youth, holy, pure, as became a prophet of God. Being called thus early, he had doubtless been formed by God as a chosen instrument of His will, and had, like Samuel, from his first childhood, been trained in true piety and holiness. Yet he was to unite unto him, so long as she lived, one greatly defiled, in order to win her thereby to purity and holiness; herein, a little likeness of our Blessed Lord, who, in the Virgin's womb, to save us, espoused our flesh, in us sinful, in Him all-holy, without motion to sin; and, further, espoused the Church, formed of us who, \"whether Jews or Gentiles,\" were all under sin, aliens from God and gone away from Him, \"serving divers lusts and passions Ephesians 5:27, to make it a glorious Church, without spot or wrinkle.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Go take unto thee - Since Hosea prophesied some eighty years, he must now have been in early youth, holy, pure, as became a prophet of God. Being called thus early, he had doubtless been formed by God as a chosen instrument of His will, and had, like Samuel, from his first childhood, been trained in true piety and holiness. Yet he was to unite unto him, so long as she lived, one greatly defiled, in order to win her thereby to purity and holiness; herein, a little likeness of our Blessed Lord, who, in the Virgin's womb, to save us, espoused our flesh, in us sinful, in Him all-holy, without motion to sin; and, further, espoused the Church, formed of us who, \"whether Jews or Gentiles,\" were all under sin, aliens from God and gone away from Him, \"serving divers lusts and passions ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ephesians 5:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", to make it a glorious Church, without spot or wrinkle.\"",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "A wife of whoredoms - i. e., take as a wife, one who up to that time had again and again been guilty of that sin. So \"men of bloods\" Psalm 5:6 are \"men given up to bloodshedding;\" and our Lord was \"a Man of Sorrows Isaiah 53:3, not occasional only, but manifold and continual, throughout His whole life. She must, then, amid the manifold corruption of Israel, have been repeatedly guilty of that sin, perhaps as an idolatress, thinking of it to be in honor of their foul gods (see the Hosea 4:13, note; Hosea 4:14, note). She was not like those degraded ones, who cease to bear children; still she must have manifoldly sinned. So much the greater was the obedience of the prophet. Nor could any other woman so shadow forth the manifold defilements of the human race, whose nature our incarnate Lord vouchsafed to unite in His own person to the perfect holiness of the divine nature.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "A wife of whoredoms - i. e., take as a wife, one who up to that time had again and again been guilty of that sin. So \"men of bloods\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 5:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " are \"men given up to bloodshedding;\" and our Lord was \"a Man of Sorrows ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 53:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", not occasional only, but manifold and continual, throughout His whole life. She must, then, amid the manifold corruption of Israel, have been repeatedly guilty of that sin, perhaps as an idolatress, thinking of it to be in honor of their foul gods (see the ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 4:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", note; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 4:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", note). She was not like those degraded ones, who cease to bear children; still she must have manifoldly sinned. So much the greater was the obedience of the prophet. Nor could any other woman so shadow forth the manifold defilements of the human race, whose nature our incarnate Lord vouchsafed to unite in His own person to the perfect holiness of the divine nature.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And children of whoredoms - For they shared the disgrace of their mother, although born in lawful marriage. The sins of parents descend also, in a mysterious way, on their children, Sin is contagious, and, unless the entail is cut off by grace, hereditary. The mother thus far portrays man's revolts, before his union with God; the children, our forsaking of God, after we have been made His children. The forefathers of Israel, God tells them, \"served other gods, on the other side of the flood\" Joshua 24:14, (i. e., in Ur of the Chaldees, from where God called Abraham) \"and in Egypt.\" It was out of such defilement, that God took her Ezekiel 23:3, Ezekiel 23:8, and He says, \"Thou becamest Mine\" Ezekiel 16:8. whom He maketh His, He maketh pure; and of her, not such as she was in herself by nature, but as such as He made her, He says, \"I remember thee, the kindness of thy youth, the love of thine espousals when thou wentest after Me, in the wilderness\" Jeremiah 2:2. But she soon fell away; and thenceforth there were among them (as there are now among Christians,) \"the children of God, the children of the promise, and the children of whoredoms, or of the devil.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And children of whoredoms - For they shared the disgrace of their mother, although born in lawful marriage. The sins of parents descend also, in a mysterious way, on their children, Sin is contagious, and, unless the entail is cut off by grace, hereditary. The mother thus far portrays man's revolts, before his union with God; the children, our forsaking of God, after we have been made His children. The forefathers of Israel, God tells them, \"served other gods, on the other side of the flood\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 24:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", (i. e., in Ur of the Chaldees, from where God called Abraham) \"and in Egypt.\" It was out of such defilement, that God took her ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 23:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 23:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and He says, \"Thou becamest Mine\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 16:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". whom He maketh His, He maketh pure; and of her, not such as she was in herself by nature, but as such as He made her, He says, \"I remember thee, the kindness of thy youth, the love of thine espousals when thou wentest after Me, in the wilderness\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 2:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". But she soon fell away; and thenceforth there were among them (as there are now among Christians,) \"the children of God, the children of the promise, and the children of whoredoms, or of the devil.\"",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "For the land ... - This is the reason why God commands Hosea to do this thing, in order to shadow out their foulness and God's mercy. What no man would dare to do Jeremiah 3:1, except at God's bidding, God in a manner doth, restoring to union with Himself those who had gone away from Him. \"The land,\" i. e., Israel, and indirectly, Judah also, and, more widely yet, the whole earth.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "For the land ... - This is the reason why God commands Hosea to do this thing, in order to shadow out their foulness and God's mercy. What no man would dare to do ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 3:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", except at God's bidding, God in a manner doth, restoring to union with Himself those who had gone away from Him. \"The land,\" i. e., Israel, and indirectly, Judah also, and, more widely yet, the whole earth.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Departing from - Literally, \"from after the Lord.\" Our whole life should be Philippians 3:13, forgetting the things which are behind, to follow after Him, whom here we can never fully attain unto, God in His Infinite Perfection, yet so as, with our whole heart, \"fully to follow after Him.\" To depart from the Creator and to serve the creature, is adultery; as the Psalmist says, \"Thou hast destroyed all them, that go a whoring from Thee\" Psalm 73:27. He who seeks anything out of God, turns from following Him, and takes to him something else as his god, is unfaithful, and spiritually an adulterer and idolater. For he is an adulterer, who becomes another's than God's. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Departing from - Literally, \"from after the Lord.\" Our whole life should be ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Philippians 3:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", forgetting the things which are behind, to follow after Him, whom here we can never fully attain unto, God in His Infinite Perfection, yet so as, with our whole heart, \"fully to follow after Him.\" To depart from the Creator and to serve the creature, is adultery; as the Psalmist says, \"Thou hast destroyed all them, that go a whoring from Thee\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 73:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". He who seeks anything out of God, turns from following Him, and takes to him something else as his god, is unfaithful, and spiritually an adulterer and idolater. For he is an adulterer, who becomes another's than God's. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2. beginning—not of the prophet's predictions generally, but of those spoken by Hosea.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "take … wife of whoredoms—not externally acted, but internally and in vision, as a pictorial illustration of Israel's unfaithfulness [Hengstenberg]. Compare Eze 16:8, 15, &c. Besides the loathsomeness of such a marriage, if an external act, it would require years for the birth of three children, which would weaken the symbol (compare Eze 4:4). Henderson objects that there is no hint of the transaction being fictitious: Gomer fell into lewdness after her union with Hosea, not before; for thus only she was a fit symbol of Israel, who lapsed into spiritual whoredom after the marriage contract with God on Sinai, and made even before at the call of the patriarchs of Israel. Gomer is called \"a wife of whoredoms,\" anticipatively.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "children of whoredoms—The kingdom collectively is viewed as a mother; the individual subjects of it are spoken of as her children. \"Take\" being applied to both implies that they refer to the same thing viewed under different aspects. The \"children\" were not the prophet's own, but born of adultery, and presented to him as his [Kitto, Biblical Cyclopædia]. Rather, \"children of whoredoms\" means that the children, like their mother, fell into spiritual fornication. Compare \"bare him a son\" (see Ho 2:4, 5). Being children of a spiritual whore, they naturally fell into her whorish ways.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The beginning of the word of the Lord:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " this, say some, gives Hosea the precedence of all the prophets, which perhaps may be allowed to him among all the prophets that have written distinct books of their prophecies, but simply first of all the prophets he was not; in David’s and Solomon’s times we meet with Nathan and Ahijah the Shilonite. Or this ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "beginning",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " may be, as our ordinary phrase, so soon as God spake, or at the very first of God’s speaking, to Hosea, he commanded him to take such a wife, &c. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The Lord:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " see ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Hosea 2:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 2:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "By Hosea; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in Hosea; denoting the impulse of the Spirit of prophecy, the internal motions and influence of the Spirit in the prophet: see ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Hosea 1:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 1:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The Lord said; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " directed and commanded him: this was warrant to him, doing which otherwise was unseemly for a prophet to have done. Go, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "take unto thee:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " this was, say some, done in vision, and was to be told to the people as other visions were: it was parabolically proposed to them, and this might be sufficient to convince the Jews, would they have considered it well, as David considered Nathan’s parable. Others say it was really acted, and that the prophet did, as commanded, marry one who had been a strumpet, or that proved to be so after she was married. And though this would have been unseemly in the prophet, had he done it without this particular direction, now the scandal ceaseth, and it is very fit God be obeyed, and the prophet may with credit enough do what God had by his command made a necessary duty to him, and marry one known to be a lewd whore. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "A wife of whoredoms; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " an openly noted whore, a notorious one, so the Hebrew phrase, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "wife of whoredoms, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as, a man of bloods, or man of sorrows; a woman of many whoredoms, and very lively emblem of idolatrous Israel. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Children of whoredoms; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " either that, born of such a mother, are. as she, addicted to lewdness; or else, with the mother made his wife, he is to receive and maintain the children she had by her adulterers. And thus understood, it may lead our thoughts to God’s rich mercy towards their ancestors, who were (Abraham himself not excepted) idolaters, when they dwelt on the other side the river, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Joshua 24:2,3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 24:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ": yet God took them, and married them to himself, and did show wonderful kindness to them and theirs; all which is slighted and forgotten by their posterity, by you, O idolatrous Israelites! Or it may refer more expressly to what God did for Israel, when he brought them out of Egypt, and made covenant with them in Horeb, which was as a solemn espousing them to God. The Lord found them tainted with Egyptian idolatries, yet, as the prophet here, married them to himself, and covenanted with them to be faithful to him, but they broke the covenant. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The land, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. the people of the land, intimating the universal spreading of this sin, all, or most of all, so infected. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Hath committed great whoredom:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the phrase, Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "playing the harlot hath played the harlot",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", speaks the continuance of this idolatry among them, as well as the greatness of the whoredom. From their forefathers they had been idolaters; while God was giving them his law (from the nuptial day to Hosea’s time) they committed spiritual whoredom, and first made, next worshipped, the golden calf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Departing from the Lord; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " so they left their first Husband, and doted on adulterers, on idols, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Hosea 2:5",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 2:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The beginning of the word of the Lord by Hosea,.... Or \"in Hosea\" (i); which was internally revealed to him, and was inspired into him, by the Holy Ghost, who first spoke in him, and then by him; not that Hosea was the first of the prophets to whom the word of the Lord came; for there were Moses, Samuel, David, and others, before him; nor the first of the minor prophets, for Jonah, Joel, and Amos; are by some thought to be before him; nor the first of those contemporary with him, as the Jewish writers interpret it, which is not certain, at least not all of them; but the meaning is, that what follows is the first part of his prophecy, or what it began with; by which it appears he was put upon hard service at first, to prophesy against Israel, an idolatrous people, and to do it in such a manner as must be disagreeable to a young man: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the Lord said to Hosea, go, take thee a wife of whoredoms and children of whoredoms; a woman given to whoredom, a notorious strumpet, one taken out of the stews, and children that were spurious and illegitimate, not born in lawful wedlock. Some think this was really done; that the prophet took a whore, and cohabited with her, or married her which, though forbidden a high priest, was not forbid to a prophet; and had it been against a law, yet the Lord commanding it made it lawful, as in the cases of Abraham's slaying his son, and the Israelites borrowing jewels of the Egyptians; but this seems not likely, since it would not only look like countenancing whoredom, which is contrary to the holy law of God; but must be very dishonourable to the prophet, and render him contemptible to the people; and, besides, would not answer the end proposed, to reprove the spiritual adultery or idolatry of Israel, but rather serve to confirm in it; for how should that appear criminal and abominable to them, which was commanded the prophet by the Lord? others think that the woman he is bid to marry, though before marriage a harlot, was afterwards reformed; but this is directly contrary to Hosea 3:1 and besides, the children born of her, whether reformed or not, yet in lawful wedlock could not be called children of whoredom; nor would the above end be answered by it, since such a person would be no fit representative of Israel committing spiritual adultery or idolatry, and continuing in it; and moreover, whether this or the former was the case, the prophecy must be many years delivering; it must be near a year before the first child was born, and the same space must be between the birth of each; so that here must be a long and frequent interruption of the prophecy, which does not seem likely: nor is it probable that he took his own wife, which is the opinion of others, and gave her the character of a whore, and his children with her, and called them children of whoredom, in order to represent and reprove the idolatry of Israel: what Maimonides (k), and the Jewish writers in general, give into, is more agreeable, that this was all done in the vision of prophecy; that it so seemed to the prophet in vision to be really done, and so he related it to the people; but this is liable to objection, that such an impure scene of things should be represented to the mind of the prophet by the Holy Spirit of God; nor can the relation of it be thought to have any good effect upon the people, who would be ready to mock at him, and reproach him for it. It seems best therefore to understand the whole as a parable, and that the prophet, in a parabolical way, is bid to represent the treachery, unfaithfulness, and spiritual adultery of the people of Israel, under the feigned name of an unchaste woman, and of children begotten in fornication; and to show unto them that their case was as if he had taken a woman out of the stews, and her bastards with her; or as if a wife married by him had defiled his bed, and brought him a spurious brood of children. So the Targum interprets it, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and the Lord said to Hosea, go, take thee a wife of whoredoms and children of whoredoms; a woman given to whoredom, a notorious strumpet, one taken out of the stews, and children that were spurious and illegitimate, not born in lawful wedlock. Some think this was really done; that the prophet took a whore, and cohabited with her, or married her which, though forbidden a high priest, was not forbid to a prophet; and had it been against a law, yet the Lord commanding it made it lawful, as in the cases of Abraham's slaying his son, and the Israelites borrowing jewels of the Egyptians; but this seems not likely, since it would not only look like countenancing whoredom, which is contrary to the holy law of God; but must be very dishonourable to the prophet, and render him contemptible to the people; and, besides, would not answer the end proposed, to reprove the spiritual adultery or idolatry of Israel, but rather serve to confirm in it; for how should that appear criminal and abominable to them, which was commanded the prophet by the Lord? others think that the woman he is bid to marry, though before marriage a harlot, was afterwards reformed; but this is directly contrary to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 3:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and besides, the children born of her, whether reformed or not, yet in lawful wedlock could not be called children of whoredom; nor would the above end be answered by it, since such a person would be no fit representative of Israel committing spiritual adultery or idolatry, and continuing in it; and moreover, whether this or the former was the case, the prophecy must be many years delivering; it must be near a year before the first child was born, and the same space must be between the birth of each; so that here must be a long and frequent interruption of the prophecy, which does not seem likely: nor is it probable that he took his own wife, which is the opinion of others, and gave her the character of a whore, and his children with her, and called them children of whoredom, in order to represent and reprove the idolatry of Israel: what Maimonides (k), and the Jewish writers in general, give into, is more agreeable, that this was all done in the vision of prophecy; that it so seemed to the prophet in vision to be really done, and so he related it to the people; but this is liable to objection, that such an impure scene of things should be represented to the mind of the prophet by the Holy Spirit of God; nor can the relation of it be thought to have any good effect upon the people, who would be ready to mock at him, and reproach him for it. It seems best therefore to understand the whole as a parable, and that the prophet, in a parabolical way, is bid to represent the treachery, unfaithfulness, and spiritual adultery of the people of Israel, under the feigned name of an unchaste woman, and of children begotten in fornication; and to show unto them that their case was as if he had taken a woman out of the stews, and her bastards with her; or as if a wife married by him had defiled his bed, and brought him a spurious brood of children. So the Targum interprets it, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"go, prophesy a prophecy against the inhabitants of the idolatrous city, who add to sin:'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for the land hath committed great whoredom, departing from the Lord; or ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"for the inhabitants of the land erring, erred from the worship of the Lord,'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "as the Targum; that is, the inhabitants of the land of Israel have committed idolatry, which is often in Scripture signified by adultery and whoredom; as an adulterous woman deals treacherously with her husband, so these people had dealt with God, who stood in such a relation to them; see Jeremiah 3:1, this interprets the parable, and shows the reason of using the following symbols and emblems. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "as the Targum; that is, the inhabitants of the land of Israel have committed idolatry, which is often in Scripture signified by adultery and whoredom; as an adulterous woman deals treacherously with her husband, so these people had dealt with God, who stood in such a relation to them; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 3:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", this interprets the parable, and shows the reason of using the following symbols and emblems. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(i) , Sept.; in Hosea, V. L. Pagninus, Montanus, Drusius, Tarnovius. (k) Moreh Nevochim, par. 2. 46. Aben Ezra & Kimchi in loc. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(i) , Sept.; in Hosea, V. L. Pagninus, Montanus, Drusius, Tarnovius. (k) Moreh Nevochim, par. 2. 46. Aben Ezra & Kimchi in loc. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "The beginning of the word of the LORD by Hosea. And the LORD said to Hosea, Go, take unto thee a wife {c} of whoredoms and children of whoredoms: for the land hath committed great whoredom, departing from the LORD.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The beginning of the word of the LORD by Hosea. And the LORD said to Hosea, Go, take unto thee a wife ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{c}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " of whoredoms and children of whoredoms: for the land hath committed great whoredom, ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "departing",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " from the LORD.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) That is, one that has been a harlot for a long time: not that the Prophet did this thing in effect, but he saw this in a vision, or else was commanded by God to set forth under this parable or figure the idolatry of the Synagogue, and of the people her children.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The beginning of the word of the Lord by Hosea",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] If we render the Hebrew text thus, the words are a heading to the first part of the book, viz. chaps 1–3; they are apparently taken thus by the LXX., the Vulg., and perhaps the Targ. and the Peshito. It would however be better to translate with the Vulg., ‘The beginning of Jehovah’s speaking by (or, with) Hosea’, because ‘by Hosea’ goes better with a verbal than with a common noun; or, with Kalisch, ‘The beginning of that which Jehovah spoke’ (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 18:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 81:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); or, with Ewald, ‘At the first, when Jehovah spoke with Hosea’ (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 4:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 90:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and possibly ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 1:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ‘With Hosea’ is the preferable rendering. As Ewald remarks, the phrase ‘to speak with’ implies that he who speaks is a superior being (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 1:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 1:13-14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 12:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 12:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The original narrative no doubt began at ‘Jehovah said’: the words prefixed make the sentence heavy.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "take unto thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] i.e. marry (as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 6:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and often), with regard to Gomer; recognize as thine own with regard to the children. Is this marriage of Hosea a real or a fictitious one? Symbolical it certainly is, but whether literally true or not, the student must decide on a view of the somewhat peculiar exegetical data. See Introduction, and comp. note below on ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Hosea 1:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 1:3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a wife of whoredoms",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") one with a deeply rooted inclination to adultery, or (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "b",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") as most explain, a woman already steeped in sin. In favour of (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), it may be pointed out that the prophet does not say, ‘Take unto thee a harlot’. His wife is brought before us throughout as a type of Israel; she must at first have been innocent in act to symbolize what Jehovah elsewhere calls ‘the kindness of thy (Israel’s) youth, the love of thine espousals’ (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 2:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Upon this view it follows that the language employed is dictated by Hosea’s subsequent experience. He could not, of course, know that Gomer had an inclination to infidelity, until it had been exhibited in act.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "children of whoredoms",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] i.e. either children inheriting their mother’s evil tendencies, or the offspring of an adulterous union. (Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 2:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".)",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for the land hath committed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " …] This is the meaning of Hosea’s acted parable. As Gomer became the wedded wife of the prophet, so ‘the land’, i.e. the people, of northern Israel had entered into an analogous mystic relation to Jehovah (see on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 2:21-22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). As Gomer, after her espousals, committed whoredom, so Israel, after her first love, went astray after other gods (see chap. 2). Israel in the narrower sense of the word seems to be meant, for afterwards we read ‘I will have mercy upon the house of Judah’ (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Hosea 1:7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 1:7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 2.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The beginning of the word of the Lord by",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "in",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Hosea",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". These words may be rendered at once more literally and more exactly, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(1)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " \"",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "The",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "beginning",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (of that which) Jehovah spoke by Hosea.\" Thus Gesenius translates, understanding ashen, which is often omitted as a pronoun in the nominative or accusative, indicating relation, and as including the antecedent personal or demonstrative pronoun. When the pronoun thus supplied is in the genitive, the preceding noun is in the construct state, as here. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(2)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Rosenmüller, without necessity, takes the noun in the adverbial sense; thus: \"In the beginning Jehovah spake by Hosea.\" He also suggests the possibility of ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "dibber",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " being a noun of the same meaning as ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "dabar",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but of different formation; while in two manuscripts of De Rossi and one of Kennicott the regular form of the construct state of ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "davar",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is expressed. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(3)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Keil takes the noun as an accusative of time, and accounts for its construct state by the substantival idea of the succeeding subordinated clause; thus: \"",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "At",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the commencement of ' Jehovah spake,' Jehovah said to him.\" But what is the beginning here mentioned? It cannot mean that Hoses was the first of the prophets by whom God made known his will to Israel, or the first of the minor prophets; for Jonah, as is rightly inferred from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 14:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", preceded him; Joel also is usually regarded as before him in point of time; neither can it denote his priority to Isaiah and ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Amos",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", who also prophesied in the days of Uzziah. The plain meaning is that which becomes obvious when we adopt the right rendering of Gesenius, as given above, that is, the beginning of the prophecies which Hoses was commissioned by Jehovah to make known. The peculiarity of the expression, \"",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "in",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Hosea,\" as the word literally means, deserves attention. Maurer compares ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 12:2, 6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and 8, to prove that the expression signifies speaking to rather than in or ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "by",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; he also cites other passages to the same purpose, But while the verb \"to speak,\" followed by b5 and the verb constructed with ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "el",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", may coincide in signification at a certain point, it does not thence follow that they are everywhere and always synonymous. Long ago Jerome drew attention to the distinction which this difference of construction suggests. \"It is one thing,\" says that Father, \"for the Lord to speak ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "in",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Hosea, another to speak to ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(5)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Hosea: when it is in Hosea he does not speak to Hosea himself, but ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "by",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Hosea to others; but speaking ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "to",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Hosea denotes communication to himself. So in the New Testament (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 1:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") we find the corresponding Greek expression, viz. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ὁ Θεὸς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "λαλήσας ἐν προφήταις",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which the Revised Version rightly renders, \"God having...  spoken the ... in the prophets.\" The first verse is the general heading for the whole book; the first clause of the second verse is the special heading of the first section of the book, which extends to the end of the third chapter. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And the Lord said to Hosea, Go, take unto thee a wife of whoredoms, and children of whoredoms.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Whether the transaction here enjoined is to be understood as a reality, or a vision, or an allegory, has been keenly debated. To enter fully into the discussion of this point would lead us too far from our purpose; nor could it minister to edification. Though high authorities have maintained it to be a real occurrence, we do not see our way to concur with their view. A canon of interpretation sanctioned by Augustine forbids the literal acceptation of this command, for, according to the canon referred to, if the language of Scripture taken literally would involve something incongruous or morally improper, the figurative sense must be preferred. Again, we can scarcely understand it of a vision; for there is no mention of or reference to anything of that kind in the passage, nor does the context countenance the notion of a vision. Keil regards it as such when he speaks of it as \"an inward and spiritual intuition in which the word of God was addressed\" to the prophet. We are, therefore, shut up to that interpretation which explains the whole as an allegorical or imaginary narrative, which is thus constructed in order to impart greater vividness to the prophet's declaration. The Chaldee paraphrase understands it in this sense. \"Go,\" says the paraphrast, \"declare a prophecy against the inhabitants of the idolatrous city, who persist in sin.\" Jerome also explains it allegorically, and urges against the literal sense that passage in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 4:4-6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where the prophet is commanded by God to bear the iniquity of the house of Israel, and to lie upon his left side three hundred and ninety days - a thing impossible according to the literal understanding of the injunction; he accordingly concludes, in reference to the particulars here commanded, that \"sacramenta indicaut futurorum.\" Calvin rightly understands it in the sense of a parabolic representation as follows: '\" The Lord had bidden him (the prophet) to relate this parable, so to speak, or this similitude, that the people might see, as in a living portraiture, their turpitude and perfidiousness. It is, in short, an exhibition in which the thing itself is not only set forth in words, but is also placed, as it were, before their eyes in a visible form.\" Kimchi considers it to be a prophetic vision; while some of the older Hebrew interpreters viewed it in the light of an actual transaction. Kimchi's words are: \"And the whole took place in the vision of prophecy, not that Hoses the prophet had taken to himself a wife of whoredoms; although it is found in the words of our rabbins that the meaning is according to the literal signification of the words.\" By \"a wife of whoredoms\" we understand a woman addicted to whoredoms, and thus likely to prove an unfaithful wife, as\" a woman of quarrels\" is a quarrelsome woman, \"a man of bloods\" is a bloody man, \"a man of sorrows\" a sorrowful man; while \"children of whoredoms\" are children who follow in the footsteps of their mother's lewdness, or children on whose birth their mother's licentiousness bad left a stigma so ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "that",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " their legitimacy is questionable. The construction of the verb \"take,\" with both objects, is an example of the figure zeugma, by which one word does duty to two clauses, though it undergoes a modification of sense in its application to the second. The meaning here is clearly that the prophet should take a wife of the character indicated, and beget children by her, not ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "take",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " such a wife and such children already born to her. This view is favored by the Vulgate, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Sume tibi uxorem fornicationum et fac tibi filios fornicationum",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; though Keil maintains that Hosea was to take children of prostitution as well as a wife who had lived by prostitution. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "For the land hath committed great whoredom, departing from the Lord.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " This is more exactly rendered, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "for the land hath utterly gone a-whoring from after",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (that is, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "from following",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "the Lord",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". From this we learn the symbolic import of the command, in whatever way that command is interpreted, whether as a reality, or vision, or allegory, the prophet's marriage to an unfaithful wife sets forth Jehovah's marriage to an unfaithful nation. God often condescends - graciously condescends - to represent his relation to his people as a marriage covenant; while unfaithfulness on their part is spiritual adultery. The mother and the children may represent the country and its inhabitants, or the nation as a whole and its several members, or generally the people and their ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "posterity",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in succeeding generations. The father of the Hebrew race had served other gods on the other side of the flood, that is, in Ur, in the land of the Chaldees, whence God had called Abraham. When taken into covenant relationship, how often had they fallen into the former sin of idolatry! The fearful consequences of their sin is graphically portrayed in the verses immediately following, symbolized in the names of the prophet's children. They are - national ruin, the loss of the Divine favor, and the forfeiture of their proud position as the chosen people of Jehovah. Hosea 1:2",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "For the purpose of depicting before the eyes of the sinful people the judgment to which Israel has exposed itself through its apostasy from the Lord, Hosea is to marry a prostitute, and beget children by her, whose names are so appointed by Jehovah as to point out the evil fruits of the departure from God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 1:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"At first, when Jehovah spake to Hosea, Jehovah said to him, God, take thee a wife of whoredom, and children of whoredom; for whoring the land whoreth away from Jehovah.\" The marriage which the prophet is commanded to contract, is to set forth the fact that the kingdom of Israel has fallen away from the Lord its God, and is sunken in idolatry. Hosea is to commence his prophetic labours by exhibiting this fact. תּחלּת דּבּר יי: literally, \"at the commencement of 'Jehovah spake,'\" i.e., at the commencement of Jehovah's speaking (dibber is not an infinitive, but a perfect, and techillath an accusative of time (Ges. 118, 2); and through the constructive the following clause is subordinated to techillath as a substantive idea: see Ges. 123, 3, Anm. 1; Ewald, 332, c.). דּבּר with ב, not to speak to a person, or through any one (ב is not  equals  אל), but to speak with (lit., in) a person, expressive of the inwardness or urgency of the speaking (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 12:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 12:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Habakkuk 2:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 1:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.). \"Take to thyself:\" i.e., marry (a wife). אשׁת זנוּנים is stronger than זונה. A woman of whoredom, is a woman whose business or means of livelihood consists in prostitution. Along with the woman, Hosea is to take children of prostitution as well. The meaning of this is, of course, not that he is first of all to take the woman, and then beget children of prostitution by her, which would require that the two objects should be connected with קח per zeugma, in the sense of \"accipe uxorem et suscipe ex ea liberos\" (Drus.), or \"sume tibi uxorem forn. et fac tibi filios forn.\" (Vulg.). The children begotten by the prophet from a married harlot-wife, could not be called yaldē zenūnı̄m, since they were not illegitimate children, but legitimate children of the prophet himself; nor is the assumption, that the three children born by the woman, according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 1:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 1:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", were born in adultery, and that the prophet was not their father, in harmony with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"he took Gomer, and she conceived and bare him a son.\" Nor can this mode of escaping from the difficulty, which is quite at variance with the text, be vindicated by an appeal to the connection between the figure and the fact. For though this connection \"necessarily requires that both the children and the mother should stand in the same relation of estrangement from the lawful husband and father,\" as Hengstenberg argues; it neither requires that we should assume that the mother had been a chaste virgin before her marriage to the prophet, nor that the children whom she bare to her husband were begotten in adultery, and merely palmed off upon the prophet as his own. The marriage which the prophet was to contract, was simply intended to symbolize the relation already existing between Jehovah and Israel, and not the way in which it had come into existence. The \"wife of whoredoms\" does not represent the nation of Israel in its virgin state at the conclusion of the covenant at Sinai, but the nation of the ten tribes in its relation to Jehovah at the time of the prophet himself, when the nation, considered as a whole, had become a wife of whoredom, and in its several members resembled children of whoredom. The reference to the children of whoredom, along with the wife of whoredom, indicates unquestionably  priori, that the divine command did not contemplate an actual and outward marriage, but simply a symbolical representation of the relation in which the idolatrous Israelites were then standing to the Lord their God. The explanatory clause, \"for the land whoreth,\" etc., clearly points to this. הארץ, \"the land,\" for the population of the land (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 4:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). זנה מאחרי יי, to whore from Jehovah, i.e., to fall away from Him (see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 4:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      }
    ]
  }
]