[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(6) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Lo-ruhamah.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—“Unloved,” or, perhaps, “unpitied.” The prophet’s growing despondency about his country’s future is revealed in her name. The rest of the verse is best rendered—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For I will no longer have pity on the house of Israel, that I should indeed forgive them.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Hosea 1:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 1:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And she conceived again — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "It has been observed, that the children which the prophet’s wife bore represent certain distinct parts, or descriptions, of the Jewish nation, of the whole of which the mother was the emblem. Of her three children here mentioned, the eldest and the youngest were sons, the intermediate child was a daughter. “The eldest,” says Bishop Horsley, “I think, was the prophet’s son; but the last two were both bastards. In this I have the concurrence of Dr. Wells, acutely remarking, that whereas it is said, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", that the prophet’s wife conceived and bare a son ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to him, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "it is said of the other two children, only that she conceived and bare them; implying that the children she then bare, not being born, like the first, to the prophet, were not begotten by him.” Now, as the name imposed, by God’s direction, upon the eldest child, the prophet’s own son, typified the true children of God, and heirs of the promises among the Israelites; so the two bastard children, the bishop thinks, typified those parts of the Jewish people that were not Jezreel, or the seed of God. The first of these, the daughter, whose sex was the emblem of weakness, was called ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Lo-ruhamah, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "which signifies, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "unbeloved, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "unpitied, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or, as it is in the margin, in conformity with all the ancient visions, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "not having obtained mercy. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "“This daughter typified the people of the ten tribes, in the enfeebled state of their declining monarchy, torn by their intestine commotions and perpetual revolutions, harassed by powerful invaders, empoverished by their tyrannical exactions, and condemned by the just sentence of God to utter excision as a distinct kingdom, without hope of restoration: for so the type is explained by God himself,” declaring, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I will utterly take them away — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That is, I will cause them to be carried into captivity, never to return again in a body; and will utterly put an end to them, considered as a kingdom, or people distinct from Judah. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1:1-7 Israel was prosperous, yet then Hosea boldly tells them of their sins, and foretells their destruction. Men are not to be flattered in sinful ways because they prosper in the world; nor will it last long if they go on still in their trespasses. The prophet must show Israel their sin; show it to be exceedingly hateful. Their idolatry is the sin they are here charged with. Giving that glory to any creature which is due to God alone, is an injury and affront to God; such as for a wife to take a stranger, is to her husband. The Lord, doubtless, had good reasons for giving such a command to the prophet; it would form an affecting picture of the Lord's unmerited goodness and unwearied patience, and of the perverseness and ingratitude of Israel. We should be broken and wearied with half that perverseness from others, with which we try the patience and grieve the Spirit of our God. Let us also be ready to bear any cross the Lord appoints. The prophet must show the ruin of the people, in the names given to his children. He foretells the fall of the royal family in the name of his first child: call his name Jezreel, which signifies dispersion. He foretells God's abandoning the nation in the name of the second child; Lo-ruhamah, not beloved, or not having obtained mercy. God showed great mercy, but Israel abused his favours. Sin turns away the mercy of God, even from Israel, his own professing people. If pardoning mercy is denied, no other mercy can be expected. Though some, through unbelief, are broken off, yet God will have a church in this world till the end of time. Our salvation is owing to God's mercy, not to any merit of our own. That salvation is sure, of which he is the Author; and if he will work, none shall hinder.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Call her name Lo-ruhamah - The name is rendered in Paul \"not beloved\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 9:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in Peter, \"hath not obtained mercy\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Peter 2:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Love and mercy are both contained in the full meaning of the intensive form of the Hebrew word, which expresses the deep tender yearnings of the inmost soul over one loved; as in the words ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 103:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"As a father pitieth (yearneth over) his own children, so the Lord pitieth (yearneth over) them that fear Him.\" It is \"tender love\" in Him who pitieth; \"mercy,\" as shown to him who needeth mercy. The punishment, foretold under the name of the daughter, \"Unpitied,\" is a great enlargement of that conveyed under the name of the first son, \"God shall scatter.\" Judah too was carried captive, and scattered; but after the 70 years, she was restored. The 10 tribes, it is now foretold, when scattered, should, as a whole, be cut off from the tender mercy of God, scattered by Him, and as a whole, never be restored. Those only were restored, who, when Judah returned from captivity, clave to her, or subsequently, one by one, were united to her.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "But I will utterly take them away - Literally, \"for, taking away, I will take away from them, or with regard to them,\" namely, everything . He specifies nothing; He excepts nothing; only, with that awful emphasis, He dwells on the taking away, as that which He had determined to do to the utmost. This is the thought, which He wills to dwell on the As a little while after, God says, that He would be nothing to them, so here, where He in fact repeats this one thought, \"take away, take away, from them,\" the guilty conscience of Israel would at once, supply, \"all.\" When God threatens, the sinful or awakened soul sees instinctively what draws down the lightning of God's wrath, and where it will fall. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "But I will utterly take them away - Literally, \"for, taking away, I will take away from them, or with regard to them,\" namely, everything . He specifies nothing; He excepts nothing; only, with that awful emphasis, He dwells on the taking away, as that which He had determined to do to the utmost. This is the thought, which He wills to dwell on the As a little while after, God says, that He would be nothing to them, so here, where He in fact repeats this one thought, \"take away, take away, from them,\" the guilty conscience of Israel would at once, supply, \"all.\" When God threatens, the sinful or awakened soul sees instinctively what draws down the lightning of God's wrath, and where it will fall. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6. Lo-ruhamah—that is, \"not an object of mercy or gracious favor.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "take … away—Israel, as a kingdom, was never restored from Assyria, as Judah was from Babylon after seventy years. Maurer translates according to the primary meaning, \"No more will I have mercy on the house of Israel, so as to pardon them.\"",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And she, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Gomer, the hieroglyphic wife, who was to be a sign to Israel, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "conceived again, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " whether visionary or really it comes to one, and bare a daughter; which is to be a sign too, as was her mother. It is too nice which Ribera observes, that the state grew weaker, as appeared by the bringing forth of one of the weaker sex. This daughter was fit to be an emblem, and therefore it is a daughter rather than a son, though it will be next a son and no daughter. But ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Lo-ruhamah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is feminine, and in congruity of speech it must be a female who bears this name. God said unto him: as before God imposed, so now again he imposeth a name, signifying what he would do with Israel. Though God direct what it shall be, the prophet is to give the name. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Lo-ruhamah, Not pitied",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Israel’s name had been through many ages Ruhamah, i.e. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Pitied",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". God had with marvellous patience forborne them, and with tender bowels pitied them, and saved them from enemies, but now Israel should be no more pitied as formerly, God would throw them up to the rage of usurpers, and to the merciless hands of prosperous conspirators; so Menahem mercilessly ripped up women with child in Tiphsah, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "2 Kings 15:16",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 15:16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and God gave up this bloody tyrant into the hand of Tiglath-pileser. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I will no more have mercy; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " I was wont to add mercy unto mercy for Israel, I was never weary of showing them mercy, but I will do no more so for them; my pity saved them in Jeroboam’s time, and raised them to a great height and glory, but now they shall, unpitied by me, sink lower and lower. Restraints of Divine pity are sure forerunners of destruction, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Jeremiah 13:14",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 13:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Upon the house of Israel:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " this to me seems a qualifying of the former threat; though the house of Israel as a body politic, as a kingdom, under this character, shall no more be as it hath been, pitied, yet many among them may obtain mercy in the days of gospel grace, and many of them had mercy showed to them by the Lord, when they joined with Judah in the return from Babylon’s captivity; but the whole house, the families of the ten tribes, united in a kingdom, shall no more be to God ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ruhamah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but ever ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Lo-ruhamah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Thus it hath been through the long series of two thousand four hundred years and more. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I will utterly take them away; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " taking away I will take away, till the whole kingdom is utterly overthrown, and removed out of the land wherein. it once had flourished. Thus some were taken away by the sword of civil wars, some ruined by oppression of the prevailing faction in those divided times, whole cities and all the land of Naphtali was taken away by Tiglath-pileser, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "2 Kings 15:29",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 15:29",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and at last all swept away by Shalmaneser, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "2 Kings 17:3-5",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 17:3-5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And she conceived again, and bare a daughter,.... One of the weaker sex; denoting the weaker state of the kingdom of Israel after Jeroboam, as Kimchi thinks; Zachariah his son reigning but six months, and Shallum the son of Jabesh, his successor, reigned but one month, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 15:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and God said unto him, call her name Loruhamah; which signifies, \"she hath not obtained mercy\": and what follows explains it to the same sense. The Targum is, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"and they added and did evil works; and he said unto him call their name, who obtained not mercy by their works:'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for I will no more have mercy upon the house of Israel; as he had heretofore, sparing them time after time, though they continued to sin against him; but now he would spare them no longer, but deliver them up into the hands of their enemies, as he did a part of them, first into the hands of Tiglathpileser king of Assyria, and then to Shalmaneser, 2 Kings 15:29, otherwise, in the latter day, mercy will be shown them again, especially in a spiritual way, when they shall be converted, and believe in Christ, and all Israel shall be saved, as well as possess their own land again; see Hosea 1:10, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "for I will no more have mercy upon the house of Israel; as he had heretofore, sparing them time after time, though they continued to sin against him; but now he would spare them no longer, but deliver them up into the hands of their enemies, as he did a part of them, first into the hands of Tiglathpileser king of Assyria, and then to Shalmaneser, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 15:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", otherwise, in the latter day, mercy will be shown them again, especially in a spiritual way, when they shall be converted, and believe in Christ, and all Israel shall be saved, as well as possess their own land again; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 1:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "but I will utterly take them away; out of their land, from being a kingdom and nation, which was done by Shalmaneser, another king of Assyria, 2 Kings 17:6, or, \"bringing I will bring into them\", or \"against them\" (w); that is, an enemy, the same king of Assyria: or, \"but forgetting I will forget them\" (x), as some render it, and remember them no more, till the fulness of time comes: or, \"through pardoning I have pardoned\", or \"spared them\" (y); that is, in times past. The Targum is, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "but I will utterly take them away; out of their land, from being a kingdom and nation, which was done by Shalmaneser, another king of Assyria, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 17:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", or, \"bringing I will bring into them\", or \"against them\" (w); that is, an enemy, the same king of Assyria: or, \"but forgetting I will forget them\" (x), as some render it, and remember them no more, till the fulness of time comes: or, \"through pardoning I have pardoned\", or \"spared them\" (y); that is, in times past. The Targum is, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"but if they return, pardoning I will pardon them;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "which will be done in the latter day. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(w)   \"adducendo adducam contra cos\", Munster; \"importando importabo eis\", Drusius; so Kimchi and Ben Melech. (x) \"Obliviscendo obliviscar eorum\", V. L. Pagninus. (y) \"Quamvis omnino condonaverim eis\", Piscator; \"quamvis haetenus condonando condonaverim eis\", so some in Drusius. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(w)   \"adducendo adducam contra cos\", Munster; \"importando importabo eis\", Drusius; so Kimchi and Ben Melech. (x) \"Obliviscendo obliviscar eorum\", V. L. Pagninus. (y) \"Quamvis omnino condonaverim eis\", Piscator; \"quamvis haetenus condonando condonaverim eis\", so some in Drusius. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And she conceived again, and bare a daughter. And God said unto him, Call her name {h} Loruhamah: for I will no more have mercy upon the house of Israel; but I will utterly {i} take them away.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And she conceived again, and bare a daughter. And ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "God",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " said unto him, Call her name ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{h}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Loruhamah: for I will no more have mercy upon the house of Israel; but I will utterly ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{i}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " take them away.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(h) That is, not obtaining mercy: by which he signifies that God's favour had departed from them.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(i) For the Israelites never returned after they were taken captives by the Assyrians.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "bare a daughter",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The nation being personified sometimes as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "a",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " man, sometimes as a woman.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Lo-ruhamah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] i.e., Uncompassionated.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "but I will utterly take them away",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "that I should forgive them",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 6.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And she conceived again, and bare a daughter",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And God said unto him, Call her name Lo-ruhamah. The first birth symbolized the blood-guiltiness and idolatry of Israel, and the consequent destruction. Two other births follow to confirm the certainty of the coming calamity, to develop it further, and exhibit the nation ever which it impended under new phases, as also to show the prospect of deliverance to be hopeless. The change of sex may indicate the totality of the nation, male and female, as Keil thinks; or rather the weak and defenseless condition of Israel after their bow was broken and their power crushed by the enemy. They are new ready to be led into captivity, like a female helpless and powerless and exposed to ell the insults of the conquerors. The birth of the daughter is thus explained by Kimchi: \"After she had borne a so which is a proverbial reference to Jeroboam the son of Joash...  she bore a daughter, who refers parabolically to Zechariah and to Shallum son of Jabesh, who reigned after him, who were weak as a female.\" The name given to the child is ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Unpitied",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or Unfavored, if ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "ruchamah be",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " taken as a mutilated participle, the initial ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "mere",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " being dropped, though it is not found in close connection with a participle; or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "She-is-not-pitied",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", if the word be a verb. In either case, the mercy which if exercised would save her from the miseries of captivity, is clean gone; and the love which, if it existed, would prompt that exercise of mercy, is no longer to be looked for. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "For I will no more have mercy upon the house of Israel; but I will utterly take them away",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (margin, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "that I should altogether pardon them",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Aben Ezra quotes the correct meaning as follows: \"Some say that ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "נילי",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is that I have up till now forgiven their iniquity; \"and Kimchi: \"Hitherto I have forgiven and pardoned them, because I have had mercy upon them; but I shall continue to do so no more.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "עֶוד",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "again",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", from ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "עוּד",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to return or repeat. The construction of the first clause is peculiar. Rosenmüller cites as parallel ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 47:1, 5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 23:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but more exact parallels are ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 2:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 6:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in both of which, and also in the text, Kimchi and Aben Ezra understand ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "asker",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " before the second verb. The last clause of the verse, however, presents a real difficulty, as we may infer from the variety of interpretations to which it has been subjected. The LXX. has ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "Ἀνψιτασσόμενος ἀντιτάξομαι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"But I will surely set myself in array against them.\" Jerome, confounding the verb with ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "נשׂה",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " translates, \"But I will entirely forget them.\" Rashi: \"I will ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "distribute to them a portion of their cup",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and of their deeds,\" viz. as they have deserved by their deeds, Kimchi: \"I will ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "raise up enemies against them",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", who shall carry them into captivity and lay waste their land.\"Aben Ezra: \"I will take them away;\" he quotes for this meaning of the text ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 32:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and takes the prefix ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "le",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as the Aramaic sign of the accusative, giving as a notable example of the same ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 3:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "haregu leabner",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "eth-abner",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Syriac Version is similar. A more feasible rendering, if the meaning of \"take away\" be retained, is that of Hengstenberg and others, who translate it: \"I will utterly take away from them, or with regard to them,\" viz. everything. We prefer the sense of \"pardon,\" as given in the Chaldee; in the margin of the Authorized Version; by Ewald, Wunsche, and Delitzsch; and mentioned by Aben Ezra and Kimchi. Thus it will read: \"I will no more favor them that I should verily forgive them.\" The flint verb literally means the pitiful yearning of parental love - the strong feeling of affection which the Greeks expressed by ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "στοργή",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Paul's rendering of the word with the privative denotes absence of love; and Peter's the absence of mercy. Both notions are contained in the word, and their relation is well explained by Pussy, who says, It is ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "tender love",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in him who pitieth; mercy as shown to him who needeth mercy.\" Now, the connection between such tenderness of love and forgiving mercy is natural and close. Many an instance of this had been experienced in the previous history of Israel; many a time God's compassion had been extended to his erring people, notwithstanding their manifold provocations; but that day is gone - the Divine long-suffering is exhausted. Once Israel is carried captive, there shall be no return; no mercy to restore them, as in the case of Judah. Hosea 1:6",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "\"And it cometh to pass in that day, that I break in pieces the bow of Israel in the valley of Jezreel.\" The indication of time, \"in that day,\" refers not to the overthrow of the house of Jehu, but to the breaking up of the kingdom of Israel, by which it was followed. The bow of Israel, i.e., its might (for the bow, as the principal weapon employed in war, is a synecdochical epithet, used to denote the whole of the military force upon which the continued existence of the kingdom depended (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 49:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and is also a symbol of strength generally; vid., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 49:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 2:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), is to be broken to pieces in the valley of Jezreel. The paronomasia between Israel and Jezreel is here unmistakeable. And here again Jezreel is not introduced with any allusion to its appellative signification, i.e., so that the mention of the name itself is intended to indicate the dispersion or breaking up of the nation, but simply with reference to its natural character, as the great plain in which, from time immemorial, even down to the most recent period, all the great battles have been fought for the possession of the land (cf. v. Raumer, Pal. pp. 40, 41). The nation which the Lord had appointed to be the instrument of His judgment is not mentioned here. But the fulfilment shows that the Assyrians are intended, although the brief historical account given in the books of Kings does not notice the place in which the Assyrians gained the decisive victory over Israel; and the statement made by Jerome, to the effect that it was in the valley of Jezreel, is probably simply an inference drawn from this passage.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "With the name of the first child, Jezreel, the prophet had, as it were with a single stroke, set before the king and the kingdom generally the destruction that awaited them. In order, however, to give further keenness to this threat, and cut off every hope of deliverance, he now announces two other births. 1 Samuel 2:6. \"And she conceived again, and bare a daughter. And He (Jehovah) said to him, Call her name Unfavoured; for I will no more favour the house of Israel, that I should forgive them.\" The second birth is a female one, not in order to symbolize a more degenerate race, or the greater need of help on the part of the nation, but to get a name answering to the idea, and to set forth, under the figure of sons and daughters, the totality of the nation, both men and women. Lō' ruchâmâh, lit., she is not favoured; for ruchâmâh is hardly a participle with the מ dropped, since לא is never found in close connection with the participle (Ewald, 320, c.), but rather the third pers. perf. fem. in the pausal form. The child receives this name to indicate that the Lord will not continue (אוסיך) to show compassion towards the rebellious nation, as He hitherto has done, even under Jeroboam II((2 Kings 13:23). For the purpose of strengthening לא ארחם, the clause כּי נשׂא וגו is added. This can hardly be understood in any other way than in the sense of נשׂא עון ל, viz., to take away sin or guilt, i.e., to forgive it (cf. Genesis 18:24, Genesis 18:26, etc.). The explanation, \"I will take away from them, sc. everything\" (Hengstenberg), has no tenable support in Hosea 5:14, because there the object to be supplied is contained in the context, and here this is not the case. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "With the name of the first child, Jezreel, the prophet had, as it were with a single stroke, set before the king and the kingdom generally the destruction that awaited them. In order, however, to give further keenness to this threat, and cut off every hope of deliverance, he now announces two other births. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 2:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". \"And she conceived again, and bare a daughter. And He (Jehovah) said to him, Call her name Unfavoured; for I will no more favour the house of Israel, that I should forgive them.\" The second birth is a female one, not in order to symbolize a more degenerate race, or the greater need of help on the part of the nation, but to get a name answering to the idea, and to set forth, under the figure of sons and daughters, the totality of the nation, both men and women. Lō' ruchâmâh, lit., she is not favoured; for ruchâmâh is hardly a participle with the מ dropped, since לא is never found in close connection with the participle (Ewald, 320, c.), but rather the third pers. perf. fem. in the pausal form. The child receives this name to indicate that the Lord will not continue (אוסיך) to show compassion towards the rebellious nation, as He hitherto has done, even under Jeroboam II((",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 13:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). For the purpose of strengthening לא ארחם, the clause כּי נשׂא וגו is added. This can hardly be understood in any other way than in the sense of נשׂא עון ל, viz., to take away sin or guilt, i.e., to forgive it (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 18:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 18:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", etc.). The explanation, \"I will take away from them, sc. everything\" (Hengstenberg), has no tenable support in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 5:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", because there the object to be supplied is contained in the context, and here this is not the case. ",
            "children": []
          }
        ]
      }
    ]
  }
]