[[],[{"type":"header","content":"The Gerasene Demoniac"},{"type":"prose","content":"They came to the other side of the sea, to the region of the Gerasenes. "}],[{"type":"prose","content":"When Jesus got out of the boat, immediately a man from the tombs with an unclean spirit met Him, "}],[{"type":"prose","content":"and the man lived in the tombs, and no one could bind him anymore, not even with chains. "}],[{"type":"prose","content":"For he had often been bound with shackles [for the feet] and with chains, and he tore apart the chains and broke the shackles into pieces, and no one was strong enough to subdue  tame him. "}],[{"type":"prose","content":"Night and day he was constantly screaming  shrieking among the tombs and on the mountains, and cutting himself with [sharp] stones. "}],[{"type":"prose","content":"Seeing Jesus from a distance, he ran up and bowed down before Him [in homage]; "}],[{"type":"prose","content":"and screaming with a loud voice, he said, “What business do we have in common with each other, Jesus, Son of the Most High God? I implore you by God [swear to me], do not torment me!” "}],[{"type":"prose","content":"For Jesus had been saying to him,  "}],[{"type":"prose","content":"He was asking him,  And he replied, “My name is Legion; for we are many.” "}],[{"type":"prose","content":"And he  begging Him repeatedly not to send them out of the region. "}],[{"type":"prose","content":"Now there was a large herd of pigs grazing there on the mountain. "}],[{"type":"prose","content":"And  begged Him, saying, “Send us to the pigs so that we may go into them!” "}],[{"type":"prose","content":"Jesus gave them permission. And the unclean spirits came out [of the man] and entered the pigs. The herd, numbering about two thousand, rushed down the steep bank into the sea; and they were drowned [one after the other] in the sea."}],[{"type":"prose","content":"The herdsmen [tending the pigs] ran away and reported it in the city and in the country. And  came to see what had happened. "}],[{"type":"prose","content":"They came to Jesus and saw the man who had been demon-possessed sitting down, clothed and in his right mind, the man who had [previously] had the “legion” [of demons]; and they were frightened. "}],[{"type":"prose","content":"Those who had seen it described [in detail] to the people what had happened to the demon-possessed man, and [told them all] about the pigs. "}],[{"type":"prose","content":"So the people began to beg with Jesus to leave their region. "}],[{"type":"prose","content":"As He was stepping into the boat, the [Gentile] man who had been demon-possessed was begging with Him [asking] that he might go with Him [as a disciple]. "}],[{"type":"prose","content":"Jesus did not let him [come], but [instead] He said to him,  "}],[{"type":"prose","content":"So he [obeyed and] went away and began to publicly proclaim in Decapolis [the region of the ten Hellenistic cities] all the great things that Jesus had done for him; and all the people were astonished."}],[{"type":"header","content":"Miracles and Healing"},{"type":"prose","content":"When Jesus had again crossed over in the boat to the other side [of the sea], a large crowd gathered around Him; and so He stayed by the seashore. "}],[{"type":"prose","content":"One of the synagogue officials named Jairus came up; and seeing Him, fell at His feet "}],[{"type":"prose","content":"and begged anxiously with Him, saying, “My little daughter is at the point of death; [please] come and lay Your hands on her, so that she will be healed and live.” "}],[{"type":"prose","content":"And Jesus went with him; and a large crowd followed Him and pressed in around Him [from all sides]."}],[{"type":"prose","content":"A woman [in the crowd] had [suffered from] a hemorrhage for twelve years, "}],[{"type":"prose","content":"and had endured much [suffering] at the hands of many physicians. She had spent all that she had and was not helped at all, but instead had become worse. "}],[{"type":"prose","content":"She had heard [reports] about Jesus, and she came up behind Him in the crowd and touched His outer robe. "}],[{"type":"prose","content":"For she thought, “If I just touch His clothing, I will get well.” "}],[{"type":"prose","content":"Immediately her flow of blood was dried up; and she felt in her body [and knew without any doubt] that she was healed of her suffering. "}],[{"type":"prose","content":"Immediately Jesus, recognizing in Himself that power had gone out from Him, turned around in the crowd and asked,  "}],[{"type":"prose","content":"His disciples said to Him, “You see the crowd pressing in around You [from all sides], and You ask, ‘Who touched Me?’” "}],[{"type":"prose","content":"Still He kept looking around to see the woman who had done it. "}],[{"type":"prose","content":"And the woman, though she was afraid and trembling, aware of what had happened to her, came and fell down before Him and told Him the whole truth. "}],[{"type":"prose","content":"Then He said to her,  [your personal trust and confidence in Me]  [permanently] "}],[{"type":"prose","content":"While He was still speaking, some people came from the synagogue official’s house, saying [to Jairus], “Your daughter has died; why bother the Teacher any longer?” "}],[{"type":"prose","content":"Overhearing what was being said, Jesus said to the synagogue official,  [in Me and my power].” "}],[{"type":"prose","content":"And He allowed no one to go with Him [as witnesses], except Peter and James and John the brother of James. "}],[{"type":"prose","content":"They came to the house of the synagogue official; and He looked [with understanding] at the uproar  commotion, and people loudly weeping and wailing [in mourning]. "}],[{"type":"prose","content":"When He had gone in, He said to them,  "}],[{"type":"prose","content":"They  laughing [scornfully] at Him [because they knew the child was dead]. But He made them all go outside, and took along the child’s father and mother and His own [three] companions, and entered  where the child was. "}],[{"type":"prose","content":"Taking the child’s hand, He said [tenderly] to her, —which translated [from Aramaic] means,  "}],[{"type":"prose","content":"The little girl immediately got up and  to walk, for she was twelve years old. And immediately they [who witnessed the child’s resurrection] were overcome with great wonder  utter amazement. "}],[{"type":"prose","content":"He gave strict orders that no one should know about this, and He told them to give her  to eat."}]]