[{"header":"Chapter 5"},{"num":1,"verse":"Jesus Heals the Gerasene Demoniac. They reached the region of the Gerasenes on the other side of the lake."},{"num":2,"verse":"No sooner had he stepped out of the boat than a man with an unclean spirit came up to him from the tombs."},{"num":3,"verse":"The man had been living in the tombs, and no one could restrain him any longer, not even with chains."},{"num":4,"verse":"For he had frequently been bound with shackles and chains, but he had snapped the chains and smashed the shackles to pieces, and no one had sufficient strength to subdue him."},{"num":5,"verse":"Day and night among the tombs and on the mountains, he would howl and gash himself with stones."},{"num":6,"verse":"When the man caught sight of Jesus from a distance, he ran up and prostrated himself before him,"},{"num":7,"verse":"as he shouted at the top of his voice, “What do you want with me, Jesus, Son of the Most High God? I implore you in God’s name: do not torment me!”"},{"num":8,"verse":"For Jesus had said to him, “Unclean spirit, come out of the man!”"},{"num":9,"verse":"Then he asked him, “What is your name?” He replied, “My name is Legion, for there are many of us.”"},{"num":10,"verse":"And he begged him earnestly not to send them out of the country."},{"num":11,"verse":"Now on the mountainside a great herd of pigs was feeding."},{"num":12,"verse":"And they pleaded with him, “Send us into the pigs. Let us enter them.”"},{"num":13,"verse":"He allowed this. With that, the unclean spirits came out and entered the pigs, and the herd, numbering about two thousand, charged down the steep bank into the lake and were drowned in the waters."},{"num":14,"verse":"Those tending the pigs ran off and reported the incident in the town and throughout the countryside. As a result, people came out to see what had happened."},{"num":15,"verse":"When they came near Jesus, they saw the man who had been possessed by Legion sitting there fully clothed and in his right mind, and they were frightened."},{"num":16,"verse":"Those who had been eyewitnesses to the incident confirmed what had happened to the demoniac and what had happened to the pigs."},{"num":17,"verse":"Then they began to implore Jesus to leave their region."},{"num":18,"verse":"As Jesus was getting into the boat, the man who had been possessed with demons pleaded to be allowed to go with him."},{"num":19,"verse":"However, Jesus would not permit him to do so, and instead told him, “Go home to your own people and tell them what the Lord has done for you, and how he has had mercy on you.”"},{"num":20,"verse":"The man then departed and began to make known throughout the Decapolis what Jesus had done for him. And everyone was amazed."},{"num":21,"verse":"Jesus Heals a Woman and Raises a Child. When Jesus had crossed again in the boat to the other side, a large crowd gathered around him, and he stayed by the lake."},{"num":22,"verse":"Then one of the leaders of the synagogue, named Jairus, came forward, and when he saw Jesus he threw himself down at his feet"},{"num":23,"verse":"and pleaded with him, saying, “My little daughter is at the point of death. I beg you to come and lay your hands on her so that she may recover and live.”"},{"num":24,"verse":"Jesus went with him, and a large number accompanied him and crowded around him."},{"num":25,"verse":"There was a woman who had suffered from bleeding for twelve years."},{"num":26,"verse":"In spite of long and painful treatment at the hands of many doctors, her condition not only had failed to improve but had actually become worse, and she had spent everything she had."},{"num":27,"verse":"Having heard about Jesus, she came up behind him in the crowd and touched his cloak,"},{"num":28,"verse":"for she thought, “If I simply touch his clothing, I shall be made well.”"},{"num":29,"verse":"And immediately her bleeding dried up, and she felt in her body that she was healed of her affliction."},{"num":30,"verse":"Instantly aware that power had gone forth from him, Jesus turned around in the crowd and asked, “Who touched my clothing?”"},{"num":31,"verse":"His disciples said in reply, “You see this vast throng pressing upon you. How can you ask, ‘Who touched me?’ ”"},{"num":32,"verse":"However, he continued to look around to determine who had done it."},{"num":33,"verse":"Then the woman, knowing what had happened to her, approached in fear and trembling. She knelt before him and revealed to him the whole truth."},{"num":34,"verse":"He said to her, “Daughter, your faith has healed you. Go in peace and be freed from your affliction.”"},{"num":35,"verse":"While he was still speaking, some people from the house of the synagogue leader arrived and said, “Your daughter has died. Why bother the Teacher any further?”"},{"num":36,"verse":"Jesus heard the message they had delivered, but he said to the leader of the synagogue, “Do not be afraid. Just have faith.”"},{"num":37,"verse":"He allowed no one to accompany him except Peter, James, and John, the brother of James."},{"num":38,"verse":"When they arrived at the house of the synagogue leader, he observed a great deal of commotion, with people weeping and wailing loudly."},{"num":39,"verse":"When he entered, he said to them, “Why this commotion and weeping? The child is not dead; she is asleep.”"},{"num":40,"verse":"In response, they laughed at him."}]