[{"num":5,"verse":"And they came to the other side of the lake, to the country of the Gerasenes."},{"num":2,"verse":"And as soon as Rebbe Melech HaMoshiach stepped out of the sirah (boat), ofen ort (immediately), a man with a ruach hatumah from the kevarim (tombs) of the burial caves met him."},{"num":3,"verse":"This man had (his) dwelling among the kevarim. And no one could keep him tied any longer, even with sharsherot (chains, fetters);"},{"num":4,"verse":"Because often he had been bound with shackles and the shackles had been torn apart by him, and no one had the koach (power) to subdue him."},{"num":5,"verse":"And constantly, yomam valailah (day and night), among the kevarim and in the mountains, he was crying out and beating himself with stones."},{"num":6,"verse":"And, having seen Rebbe, Melech HaMoshiach from afar, he ran and fell down before him."},{"num":7,"verse":"And having cried out with a kol gadol (loud voice), he says, Mah lanu valach, Yehoshua, Ben HaElohim HaElyon? I implore you by Hashem, [do] not torment me."},{"num":8,"verse":"For Rebbe, Melech HaMoshiach had been saying to him, Come out of the man, ruach hatumah (unclean spirit)!"},{"num":9,"verse":"And Rebbe, Melech HaMoshiach was questioning him, saying, What is your name? And he says to him, Legion [is] my name, for we are many!"},{"num":10,"verse":"And he begged Rebbe Melech HaMoshiach again and again not to exorcise him and banish him from that place."},{"num":11,"verse":"Now there was a large herd of chazirim feeding nearby on the hillside."},{"num":12,"verse":"And they (the ruchot hatemeiot, the shedim) implored Rebbe, Melech HaMoshiach, saying, Send us into the chazirim, so that we may go into them."},{"num":13,"verse":"And he permitted them. And having come out, the ruchot hatemeiot entered into the chazirim. And the herd of chazirim rushed down the slope into the lake, and there were about two thousand of them, and they were drowned in the lake. [MICHOH 7:19]"},{"num":14,"verse":"And the herdsmen feeding them fled and reported it in the village and in the sadot (fields), and the people came to see what had come to pass."},{"num":15,"verse":"And they come to Yehoshua, and they see the one that had been possessed by the shed sitting, clothed and in his right mind the very one having had the Legion! And they were afraid."},{"num":16,"verse":"And the edei reiyah (eyewitnesses) of what had happened to the man possessed by shedim and of what had happened to the chazirim reported it."},{"num":17,"verse":"Then they began to implore Rebbe, Melech HaMoshiach to depart from their region."},{"num":18,"verse":"And as Rebbe Melech HaMoshiach was stepping into the sirah (boat), the one who had been possessed by shedim was imploring him that he might accompany him."},{"num":19,"verse":"And Rebbe, Melech HaMoshiach did not permit him, but says to him, Go home to your people and report to them everything that Hashem has done for you and [that] Hashem had rachmanim (mercy) upon you."},{"num":20,"verse":"And the man left and began to preach in the Decapolis everything that Rebbe, Melech HaMoshiach had done for him, and everyone was amazed."},{"num":21,"verse":"And when he had crossed over again in the sirah (boat) to the other side, a large multitude gathered together to him, and he was beside the lake."},{"num":22,"verse":"And one of the Roshei Beit HaKnesset comes name of Yair and, having seen Rebbe, Melech HaMoshiach, he falls down at his feet,"},{"num":23,"verse":"and he begs him earnestly saying, Biti (my daughter) is at the point of mavet. Come and put your hand on her that she may receive refuah and may live."},{"num":24,"verse":"And Moshiach went with Yair. And a large multitude were following him and they were pressing against Moshiach."},{"num":25,"verse":"And [there was] an isha having a flow of dahm for twelve years. [VAYIKRA 15:25-30]"},{"num":26,"verse":"And having suffered much by many rofim (physicians) and having spent everything she had, instead of recovering, her condition deteriorated."},{"num":27,"verse":"And having heard about Rebbe, Melech HaMoshiach, she came up behind him in the multitude, and touched his garment."},{"num":28,"verse":"For she was saying, If I may touch even the garment of Rebbe, Melech HaMoshiach, I will receive refuah."},{"num":29,"verse":"And ofen ort the flow of her dahm was dried up and she felt in (her) basar that she has been given refuah from the shrekliche (terrible) machla (illness)."},{"num":30,"verse":"And ofen ort Rebbe, Melech HaMoshiach, having perceived within himself that gevurah (miraculous power) had gone forth from him, turned around in the crowd and said, Who touched my garments?"},{"num":31,"verse":"And the talmidim of Rebbe Melech HaMoshiach were saying to him, You see the multitude pressing against you, and you say, Who touched me?"},{"num":32,"verse":"And Rebbe, Melech HaMoshiach was looking around to see the one having done this."},{"num":33,"verse":"Now the isha, BYIRAH (with fear) and BIRADAH (trembling), aware of what had happened to her, came and fell down before him and told him the emes (truth)."},{"num":34,"verse":"And Rebbe, Melech HaMoshiach said to her, Bat (Daughter), your emunah has brought you refuah (healing). Go in shalom and receive refuah from your machla."},{"num":35,"verse":"While Rebbe Melech HaMoshiach was still speaking, some came from the Rosh Beit HaKnesset, saying, Your yaldah is a nifteret (deceased person); are you still causing a shter (bother) for the rabbi?"},{"num":36,"verse":"But Rebbe, Melech HaMoshiach, having overheard what was being spoken, says to the Rosh Beit HaKnesset, Do not be afraid; only have emunah."},{"num":37,"verse":"And Rebbe Melech HaMoshiach did not permit anyone to follow after him, except Kefa and Yaakov and Yochanan, the brother of Yaakov."},{"num":38,"verse":"And they come into the bais of the Rosh Beit HaKnesset, and Rebbe, Melech HaMoshiach beheld much commotion and weeping and loud wailing."},{"num":39,"verse":"And having entered, he says to them, Why are you distressed and weeping? The yaldah is not a nifteret but is only sleeping."},{"num":40,"verse":"And they began making leitzonus (mockery, fun) of him. But having put everyone out, Rebbe Melech HaMoshiach takes the Abba of the naarah (girl) and the Em and the ones with him, and goes into where the naarah was."},{"num":41,"verse":"And having grasped the hand of the naarah, Moshiach says to her, Talitha Koum, which, being translated, means Little girl, to you I say, arise!"},{"num":42,"verse":"And ofen ort the naarah got up and she was walking around. She was twelve years old. And ofen ort they were amazed with great wonder."},{"num":43,"verse":"And he gave orders to them earnestly that no one should have daas of this. And Rebbe, Melech HaMoshiach said to give her some okhel (food)."}]