[{"num":27,"verse":"Isaac had become old. His eyes were so weak he couldn’t see anymore. One day he called for his older son Esau. He said to him, “My son.”"},{"num":2,"verse":"Isaac said, “I’m an old man now. And I don’t know when I’ll die. "},{"num":3,"verse":"Now then, get your weapons. Get your bow and arrows. Go out to the open country. Hunt some wild animals for me. "},{"num":4,"verse":"Prepare for me the kind of tasty food I like. Bring it to me to eat. Then I’ll give you my blessing before I die.”"},{"num":5,"verse":"Rebekah was listening when Isaac spoke to his son Esau. Esau left for the open country. He went to hunt for a wild animal and bring it back. "},{"num":6,"verse":"Then Rebekah said to her son Jacob, “Look, I heard your father speaking to your brother Esau. "},{"num":7,"verse":"He said, ‘Bring me a wild animal. Prepare some tasty food for me to eat. Then I’ll give you my blessing before I die. The Lord will be my witness.’ ” "},{"num":8,"verse":"Rebekah continued, “My son, listen carefully. Do what I tell you. "},{"num":9,"verse":"Go out to the flock. Bring me two of the finest young goats. I will prepare tasty food for your father. I’ll make it just the way he likes it. "},{"num":10,"verse":"I want you to take it to your father to eat. Then he’ll give you his blessing before he dies.”"},{"num":11,"verse":"Jacob said to his mother Rebekah, “My brother Esau’s body is covered with hair. But my skin is smooth. "},{"num":12,"verse":"What if my father touches me? He would know I was trying to trick him. He would curse me instead of giving me a blessing.”"},{"num":13,"verse":"His mother said to him, “My son, let the curse be on me. Just do what I say. Go and get the goats for me.”"},{"num":14,"verse":"So he went and got the goats. He brought them to his mother. And she prepared some tasty food. She made it just the way his father liked it. "},{"num":15,"verse":"The clothes of her older son Esau were in her house. She took Esau’s best clothes and put them on her younger son Jacob. "},{"num":16,"verse":"She covered his hands with the skins of the goats. She also covered the smooth part of his neck with them. "},{"num":17,"verse":"Then she handed to her son Jacob the tasty food and the bread she had made."},{"num":18,"verse":"He went to his father and said, “My father.”"},{"num":19,"verse":"Jacob said to his father, “I’m your oldest son Esau. I’ve done as you told me. Please sit up. Eat some of my wild meat. Then give me your blessing.”"},{"num":20,"verse":"Isaac asked his son, “How did you find it so quickly, my son?”"},{"num":21,"verse":"Then Isaac said to Jacob, “Come near so I can touch you, my son. I want to know whether you really are my son Esau.”"},{"num":22,"verse":"Jacob went close to his father. Isaac touched him and said, “The voice is the voice of Jacob. But the hands are the hands of Esau.” "},{"num":23,"verse":"Isaac didn’t recognize Jacob. Jacob’s hands were covered with hair like those of his brother Esau. So Isaac blessed him. "},{"num":24,"verse":"“Are you really my son Esau?” he asked."},{"num":25,"verse":"Isaac said, “My son, bring me some of your wild meat to eat. Then I’ll give you my blessing.”"},{"num":26,"verse":"Then Jacob’s father Isaac said to him, “Come here, my son. Kiss me.”"},{"num":27,"verse":"So Jacob went to him and kissed him. When Isaac smelled the clothes, he gave Jacob his blessing. He said,"},{"num":30,"verse":"When Isaac finished blessing him, Jacob left his father. Just then his brother Esau came in from hunting. "},{"num":31,"verse":"He too prepared some tasty food. He brought it to his father. Then Esau said to him, “My father, please sit up. Eat some of my wild meat. Then give me your blessing.”"},{"num":32,"verse":"His father Isaac asked him, “Who are you?”"},{"num":33,"verse":"Isaac began to shake all over. He said, “Then who hunted a wild animal and brought it to me? I ate it just before you came. I gave him my blessing. And he will certainly be blessed!”"},{"num":34,"verse":"Esau heard his father’s words. Then he yelled loudly and bitterly. He said to his father, “Bless me! Bless me too, my father!”"},{"num":35,"verse":"But Isaac said, “Your brother came and tricked me. He took your blessing.”"},{"num":36,"verse":"Esau said, “Isn’t Jacob just the right name for him? This is the second time he has taken advantage of me. First, he took my rights as the oldest son. And now he’s taken my blessing!” Then Esau asked, “Haven’t you saved any blessing for me?”"},{"num":37,"verse":"Isaac answered Esau, “I’ve made him ruler over you. I’ve made all his relatives serve him. And I’ve provided him with grain and fresh wine. So what can I possibly do for you, my son?”"},{"num":38,"verse":"Esau said to his father, “Do you have only one blessing, my father? Bless me too, my father!” Then Esau wept loudly."},{"num":39,"verse":"His father Isaac answered him,"},{"num":41,"verse":"Esau was angry with Jacob. He was angry because of the blessing his father had given to Jacob. He said to himself, “The days of sorrow over my father’s death are near. Then I’ll kill my brother Jacob.”"},{"num":42,"verse":"Rebekah was told what her older son Esau had said. So she sent for her younger son Jacob. She said to him, “Your brother Esau is planning to get back at you by killing you. "},{"num":43,"verse":"Now then, my son, do what I say. Run away at once to my brother Laban in Harran. "},{"num":44,"verse":"Stay with him until your brother’s anger calms down. "},{"num":45,"verse":"When he forgets what you did to him, I’ll let you know. Then you can come back from there. Why should I lose both of you in one day?”"},{"num":46,"verse":"Then Rebekah spoke to Isaac. She said, “I’m sick of living because of Esau’s Hittite wives. Suppose Jacob also marries a Hittite woman. If he does, my life won’t be worth living.”"}]