[[],[{"type":"header","content":"Isaac Blesses Jacob"},{"type":"prose","content":"When Isaac was old and his eyes were dim so that he could not see, he called his elder son Esau and said to him, “My son”; and he answered, “Here I am.” "}],[{"type":"prose","content":"He said, “See, I am old; I do not know the day of my death. "}],[{"type":"prose","content":"Now then, take your weapons, your quiver and your bow, and go out to the field, and hunt game for me. "}],[{"type":"prose","content":"Then prepare for me savory food, such as I like, and bring it to me to eat, so that I may bless you before I die.”"}],[{"type":"prose","content":"Now Rebekah was listening when Isaac spoke to his son Esau. So when Esau went to the field to hunt for game and bring it, "}],[{"type":"prose","content":"Rebekah said to her son Jacob, “I heard your father say to your brother Esau, "}],[{"type":"prose","content":"‘Bring me game, and prepare for me savory food to eat, that I may bless you before the  before I die.’ "}],[{"type":"prose","content":"Now therefore, my son, obey my word as I command you. "}],[{"type":"prose","content":"Go to the flock, and get me two choice kids, so that I may prepare from them savory food for your father, such as he likes; "}],[{"type":"prose","content":"and you shall take it to your father to eat, so that he may bless you before he dies.” "}],[{"type":"prose","content":"But Jacob said to his mother Rebekah, “Look, my brother Esau is a hairy man, and I am a man of smooth skin. "}],[{"type":"prose","content":"Perhaps my father will feel me, and I shall seem to be mocking him, and bring a curse on myself and not a blessing.” "}],[{"type":"prose","content":"His mother said to him, “Let your curse be on me, my son; only obey my word, and go, get them for me.” "}],[{"type":"prose","content":"So he went and got them and brought them to his mother; and his mother prepared savory food, such as his father loved. "}],[{"type":"prose","content":"Then Rebekah took the best garments of her elder son Esau, which were with her in the house, and put them on her younger son Jacob; "}],[{"type":"prose","content":"and she put the skins of the kids on his hands and on the smooth part of his neck. "}],[{"type":"prose","content":"Then she handed the savory food, and the bread that she had prepared, to her son Jacob."}],[{"type":"prose","content":"So he went in to his father, and said, “My father”; and he said, “Here I am; who are you, my son?” "}],[{"type":"prose","content":"Jacob said to his father, “I am Esau your firstborn. I have done as you told me; now sit up and eat of my game, so that you may bless me.” "}],[{"type":"prose","content":"But Isaac said to his son, “How is it that you have found it so quickly, my son?” He answered, “Because the  your God granted me success.” "}],[{"type":"prose","content":"Then Isaac said to Jacob, “Come near, that I may feel you, my son, to know whether you are really my son Esau or not.” "}],[{"type":"prose","content":"So Jacob went up to his father Isaac, who felt him and said, “The voice is Jacob’s voice, but the hands are the hands of Esau.” "}],[{"type":"prose","content":"He did not recognize him, because his hands were hairy like his brother Esau’s hands; so he blessed him. "}],[{"type":"prose","content":"He said, “Are you really my son Esau?” He answered, “I am.” "}],[{"type":"prose","content":"Then he said, “Bring it to me, that I may eat of my son’s game and bless you.” So he brought it to him, and he ate; and he brought him wine, and he drank. "}],[{"type":"prose","content":"Then his father Isaac said to him, “Come near and kiss me, my son.” "}],[{"type":"prose","content":"So he came near and kissed him; and he smelled the smell of his garments, and blessed him, and said,"},{"type":"poetry","content":"“Ah, the smell of my son"},{"type":"poetry","content":""},{"type":"poetry","content":""}],[{"type":"poetry","content":"May God give you of the dew of heaven,"},{"type":"poetry","content":""},{"type":"poetry","content":""},{"type":"poetry","content":""}],[{"type":"poetry","content":"Let peoples serve you,"},{"type":"poetry","content":""},{"type":"poetry","content":"Be lord over your brothers,"},{"type":"poetry","content":""},{"type":"poetry","content":"Cursed be everyone who curses you,"},{"type":"poetry","content":""},{"type":"header","content":"Esau’s Lost Blessing"}],[{"type":"prose","content":"As soon as Isaac had finished blessing Jacob, when Jacob had scarcely gone out from the presence of his father Isaac, his brother Esau came in from his hunting. "}],[{"type":"prose","content":"He also prepared savory food, and brought it to his father. And he said to his father, “Let my father sit up and eat of his son’s game, so that you may bless me.” "}],[{"type":"prose","content":"His father Isaac said to him, “Who are you?” He answered, “I am your firstborn son, Esau.” "}],[{"type":"prose","content":"Then Isaac trembled violently, and said, “Who was it then that hunted game and brought it to me, and I ate it all before you came, and I have blessed him?—yes, and blessed he shall be!” "}],[{"type":"prose","content":"When Esau heard his father’s words, he cried out with an exceedingly great and bitter cry, and said to his father, “Bless me, me also, father!” "}],[{"type":"prose","content":"But he said, “Your brother came deceitfully, and he has taken away your blessing.” "}],[{"type":"prose","content":"Esau said, “Is he not rightly named Jacob? For he has supplanted me these two times. He took away my birthright; and look, now he has taken away my blessing.” Then he said, “Have you not reserved a blessing for me?” "}],[{"type":"prose","content":"Isaac answered Esau, “I have already made him your lord, and I have given him all his brothers as servants, and with grain and wine I have sustained him. What then can I do for you, my son?” "}],[{"type":"prose","content":"Esau said to his father, “Have you only one blessing, father? Bless me, me also, father!” And Esau lifted up his voice and wept."}],[{"type":"prose","content":"Then his father Isaac answered him:"},{"type":"poetry","content":"“See, away from the fatness of the earth shall your home be,"},{"type":"poetry","content":""},{"type":"poetry","content":""}],[{"type":"poetry","content":"By your sword you shall live,"},{"type":"poetry","content":""},{"type":"poetry","content":"but when you break loose,"},{"type":"poetry","content":""},{"type":"header","content":"Jacob Escapes Esau’s Fury"}],[{"type":"prose","content":"Now Esau hated Jacob because of the blessing with which his father had blessed him, and Esau said to himself, “The days of mourning for my father are approaching; then I will kill my brother Jacob.” "}],[{"type":"prose","content":"But the words of her elder son Esau were told to Rebekah; so she sent and called her younger son Jacob and said to him, “Your brother Esau is consoling himself by planning to kill you. "}],[{"type":"prose","content":"Now therefore, my son, obey my voice; flee at once to my brother Laban in Haran, "}],[{"type":"prose","content":"and stay with him a while, until your brother’s fury turns away— "}],[{"type":"prose","content":"until your brother’s anger against you turns away, and he forgets what you have done to him; then I will send, and bring you back from there. Why should I lose both of you in one day?”"}],[{"type":"prose","content":"Then Rebekah said to Isaac, “I am weary of my life because of the Hittite women. If Jacob marries one of the Hittite women such as these, one of the women of the land, what good will my life be to me?”"}]]