[{"num":27,"verse":"And it came to pass, that when Yitzchak was zaken (old),and his eyes were dim, so that he could not see, he called Esav bno hagadol and said unto him, Beni: and he said unto him, Hineni."},{"num":2,"verse":"And he said, Hinei now, I am old, I know not my yom mot:"},{"num":3,"verse":"Therefore take, now, thy kelim (weapons), thy quiver and thy keshet (bow), and go out to the sadeh, and hunt me some wild game;"},{"num":4,"verse":"And make me matamim (savory meat, tasty food), such as I love, and bring it to me, that I may eat; that my nefesh may make a brocha upon thee before I die."},{"num":5,"verse":"And Rivkah heard when Yitzchak spoke to Esav bno. And Esav went to the sadeh to hunt for wild game, and to bring it"},{"num":6,"verse":"And Rivkah spoke unto Ya’akov her ben, saying, Hinei, I heard avicha speak unto Esav achicha, saying,"},{"num":7,"verse":"Bring me wild game, and make me matamim, that I may eat, and make a brocha upon thee before Hashem before my mot."},{"num":8,"verse":"Now therefore, beni (my son), obey my kol (voice) according to that which I command thee."},{"num":9,"verse":"Go now to the tzon, and bring me from there two gedayei izzim tovim (good kids of goats); and I will make them matamim for avicha, such as he loveth:"},{"num":10,"verse":"And thou shalt bring it to avicha, that he may eat, and that he may make a brocha upon thee before his mot."},{"num":11,"verse":"And Ya’akov said to Rivkah immo, Look, Esav achi is an ish sa’ir (hairy man), and I am an ish chalak (smooth man)"},{"num":12,"verse":"What if avi will touch me, and I shall seem to him as a meta’te’a (mocker); and I shall bring a kelalah upon me, and not a brocha."},{"num":13,"verse":"And immo said unto him, Upon me be thy kelalah, beni; only obey my kol (voice), and go bring me them."},{"num":14,"verse":"And he went, and got, and brought them to immo: and immo made matamim, such as aviv loved."},{"num":15,"verse":"And Rivkah took begadim of Esav her ben hagadol, the chamudot (best ones) which were with her in the bais, and dressed Ya’akov her ben hakatan;"},{"num":16,"verse":"And with orot gedayei haizzim (skins of the kids of the goats) she dressed and covered his hands, and also upon the smooth of his tzavar (neck);"},{"num":17,"verse":"And she gave the matamim and the lechem, which she had prepared, into the yad Ya’akov her ben."},{"num":18,"verse":"And he came unto aviv, and said, Avi; and he said, Hineni; who art thou, beni?"},{"num":19,"verse":"And Ya’akov said unto aviv, I am Esav thy bechor; I have done according as thou told me; arise, now, sit up and eat of my wild game, that thy nefesh may make a brocha upon me."},{"num":20,"verse":"And Yitzchak said unto bno, How is it that thou hast found it so quickly, beni? And he said, Hashem Eloheicha worked it out for me."},{"num":21,"verse":"And Yitzchak said unto Ya’akov, Come near, now, that I may touch thee, beni, indeed, whether thou be beni Esav or not."},{"num":22,"verse":"And Ya’akov went near unto Yitzchak aviv; and he touched him, and said, The kol is kol Ya’akov, but the yadayim are the yedei Esav."},{"num":23,"verse":"And he discerned him not, for his hands were se’irot, as yedei Esav achiv; so he made a brocha upon him"},{"num":24,"verse":"And he said, Art thou indeed beni Esav? And he said, I am."},{"num":25,"verse":"And he said, Bring it near to me, and I will eat of the wild game of beni, that my nefesh may make a brocha upon thee. And he brought it near to him, and he did eat; and he brought him yayin and he drank."},{"num":26,"verse":"And aviv Yitzchak said unto him, Come near now, and kiss me beni."},{"num":27,"verse":"And he came near, and kissed him: and he smelled the reiach (smell) of his begadim, and made a brocha upon him, and said, See, the reiach of beni is as the reiach of a sadeh upon which Hashem hath made a brocha;"},{"num":28,"verse":"Therefore HaElohim give thee of the tal haShomayim, and the fatness of ha’aretz, and plenty of dagan and tirosh;"},{"num":29,"verse":"Let people serve thee, and amim bow down to thee: be gevir over thy achim, and let bnei immecha bow down to thee: arur be every one that curseth thee, and baruch be he that blesseh thee."},{"num":30,"verse":"And as soon as Yitzchak had completed making on Ya’akov a brocha, and Ya’akov had hardly gone out from the presence of Yitzchak aviv, that Esav achiv came in from his hunt."},{"num":31,"verse":"And he also had prepared matamim, and brought it unto aviv and said unto aviv, Let avi arise, and eat of the wild game of bno, that thy nefesh may make a brocha upon me."},{"num":32,"verse":"And Yitzchak aviv said unto him, Mi atah? (Who art thou?) And he said, I am binecha, thy bechor Esav."},{"num":33,"verse":"And Yitzchak trembled with charadah gedolah ad me’od (exceedingly great trembling), and said, Who? Where is he that hath hunted wild game, and brought it me, and I have eaten of all of it before thou camest, and have made a brocha upon him? And indeed he shall be baruch (blessed)!"},{"num":34,"verse":"And when Esav heard the words of aviv, he cried with tzeakah gedolah umarah ad me’od (a great and exceeding bitter cry), and said unto aviv, Make a brocha on me, even me also, O avi."},{"num":35,"verse":"And he said, Achicha came with mirmah (deceit), and hath taken away thy brocha."},{"num":36,"verse":"And he said, Is not he rightly called shmo Ya’akov? for vaya’keveni (now he deceived/outwitted me) these two times he took away my bechorah (birthright); and, hinei, now he hath taken away my brocha (blessing). And he asked, Hast thou not reserved a brocha for me?"},{"num":37,"verse":"And Yitzchak answered and said unto Esav, See, I have made him gevir over you, and all his achim have I given to him for avadim; and with dagan and tirosh have I sustained him; and what shall I do now unto thee, beni?"},{"num":38,"verse":"And Esav said unto aviv, Hast thou but one brocha, avi? Make a brocha on me, even me also, O avi. And Esav lifted up his kol (voice), and wept."},{"num":39,"verse":"And Yitzchak aviv answered and said unto him, Hinei, thy moshav (dwelling) shall be the fatness of ha’aretz, and of the tal HaShomayim from above;"},{"num":40,"verse":"And by thy cherev shalt thou live, and shalt serve achicha; and it shall come to pass when thou shalt become restless, that thou shalt break his ol (yoke) from off thy tzavar (neck)."},{"num":41,"verse":"And Esav hated Ya’akov because of the brocha wherewith aviv made a brocha upon him: and Esav said in his lev, The yemei evel (days of mourning) for avi are at hand; then will I slay Ya’akov achi."},{"num":42,"verse":"And these words of Esav her ben hagadol were told to Rivkah; and she sent and called Ya’akov her ben hakatan, and said unto him, Hinei, Esav achicha, as touching thee, doth console himself, purposing to kill thee."},{"num":43,"verse":"Now therefore, beni, shema bekoli (listen to my voice)! Arise, flee thou to Lavan achi to Charan;"},{"num":44,"verse":"And tarry with him a few days, until chamat achicha subsides;"},{"num":45,"verse":"And when af achicha subsides from thee, and he forget that which thou hast done to him; then I will send, and get thee from there. Why should I be bereaved also of you both in yom echad (one day, the same day)?"},{"num":46,"verse":"And Rivkah said to Yitzchak, I am weary of my life because of the Banot Chet: if Ya’akov take an isha of the Banot Chet (Hittite women) such as these which are of the banot ha’aretz, what will chayyim to me be?"}]