[{"header":"Jacob Tricks Isaac"},{"num":27,"verse":"Now it was when Isaac grew old and his eyes were too dim to see, that he called Esau his elder son, and said to him, “My son.”"},{"num":2,"verse":"“Look, I’m old,” he said. “I don’t know the day of my death. "},{"num":3,"verse":"So now, please take your weapons, your quiver and your bow, and go out to the field and hunt me some game. "},{"num":4,"verse":"Then prepare me a delicious meal that I love, and bring it to me that I may eat, so that my soul may bless you before I die.”"},{"num":5,"verse":"Now Rebekah was listening when Isaac was speaking to Esau his son. So while Esau went to the field to hunt game to bring in, "},{"num":6,"verse":"Rebekah said to Jacob her son, “Look, I heard your father speaking to your brother Esau saying, "},{"num":7,"verse":"‘Bring me some game and prepare me a delicious meal that I may eat and bless you in Adonai’s presence before my death.’ "},{"num":8,"verse":"So now, my son, listen to my voice, to what I am commanding you. "},{"num":9,"verse":"Go now to the flock and bring me two good young goats from there, so that I may prepare them as a delicious meal for your father—that he’ll love. "},{"num":10,"verse":"Then you’ll bring it to your father to eat, so that he may bless you before his death.”"},{"num":11,"verse":"But Jacob said to Rebekah his mother, “Look, my brother Esau is a hairy man, but I’m a smooth man. "},{"num":12,"verse":"Perhaps my father will touch me, and he’ll take me for a mocker, and I’ll bring upon myself a curse and not a blessing.”"},{"num":13,"verse":"Then his mother said to him, “Let your curse fall on me, my son. Just listen to me, and go, get them for me.”"},{"num":14,"verse":"So he went and got them, and brought them to his mother, and his mother prepared a delicious meal that his father would love. "},{"num":15,"verse":"Rebekah also took her elder son Esau’s favorite clothes that were with her in the house, and she put them on her younger son Jacob, "},{"num":16,"verse":"along with the skins of the young goats on his hands and on the hairless part of his neck. "},{"num":17,"verse":"She put the delicious meal and the bread that she had prepared in the hand of Jacob her son."},{"num":18,"verse":"Then he came to his father and said, “My father.”"},{"num":19,"verse":"Then Jacob said to his father, “I’m your firstborn, Esau. I’ve done just what you said to me. Sit up, please, and eat some of my wild game so that your soul may bless me.”"},{"num":20,"verse":"Then Isaac said to his son, “How in the world were you able to find it so quickly, my son?”"},{"num":21,"verse":"Then Isaac said to Jacob, “Please come closer so I can feel you my son—whether or not you really are my son Esau.”"},{"num":22,"verse":"So Jacob came closer to his father Isaac, and he felt him. Then he said, “The voice is Jacob’s voice but the hands are Esau’s hands.” "},{"num":23,"verse":"He did not recognize him because his hands were like the hairy hands of his brother Esau. So he blessed him. "},{"num":24,"verse":"But he said, “Are you really my son Esau?”"},{"num":25,"verse":"Then he said, “Bring it to me and I’ll eat some of my son’s wild game, so that my soul may bless you.” So he brought it to him and he ate, and he brought him wine and he drank."},{"num":26,"verse":"Then his father Isaac said to him, “Please come closer and kiss me my son.” "},{"num":27,"verse":"So he came closer and kissed him. When he smelled the smell of his clothes, he blessed him and said,"},{"num":30,"verse":"No sooner had Isaac finished blessing Jacob and Jacob had just gone out from his father Isaac’s presence, than Esau his brother came in from his hunting. "},{"num":31,"verse":"Then he also prepared a delicious meal and brought it to his father, and he said to his father, “Let my father get up and eat of his son’s wild game that your soul may bless me.”"},{"num":32,"verse":"His father Isaac said, “Who are you?”"},{"num":33,"verse":"Then Isaac trembled with intense trembling and said, “Who was it then that hunted wild game and brought it to me? I ate it all just before you came and I blessed him—and yes, he will be blessed.”"},{"num":34,"verse":"When Esau heard his father’s words, he shouted with an intensely bitter groan. Then he said to his father, “Bless me, me too, my father!”"},{"num":35,"verse":"Then he said, “Your brother came deceitfully and took your blessing.”"},{"num":36,"verse":"He said, “Is this why he was named Jacob—since he’s tricked me twice already? My birthright he’s taken. Look! Now he’s taken my blessing!” Then he said, “Haven’t you saved a blessing for me?”"},{"num":37,"verse":"Isaac answered and said to Esau, “Behold, I’ve made him master over you, and all your brothers I’ve given to him as servants. I’ve provided him with grain and new wine. What then can I do for you, my son?”"},{"num":38,"verse":"Esau said to his father, “Do you just have one blessing, my father? Bless me too, my father!” And Esau lifted up his voice and wept."},{"num":39,"verse":"Then Isaac his father said to him,"},{"num":41,"verse":"So Esau bore a grudge against Jacob because of the blessing with which his father had blessed him, and Esau said in his heart, “Let the time for mourning my father draw near, so that I can kill my brother Jacob!”"},{"num":42,"verse":"Now to Rebekah was reported the words of Esau her elder son. So she sent and called for Jacob her younger son, and said to him, “Look, your brother Esau is consoling himself about you with the thought of killing you. "},{"num":43,"verse":"So now my son, listen to my voice. Get up—flee to Laban my brother in Haran! "},{"num":44,"verse":"Then stay with him a few days, until your brother’s rage subsides, "},{"num":45,"verse":"until your brother’s rage turns away from you and he forgets what you’ve done to him. Then I’ll send for you and get you back from there. Why should I lose both of you in one day?”"},{"num":46,"verse":"Then Rebekah said to Isaac, “I’m disgusted with my life because of the daughters of Heth. If Jacob takes a wife from the daughters of Heth like these women, from the daughters of the land what is life to me?”"}]