[{"header":"After Joshua, Israel Abandons Adonai"},{"num":2,"verse":"Now the angel of Adonai came up from Gilgal to Bochim, and He said, “I brought you up out of Egypt and took you into the land which I swore to your fathers. I also said, ‘I will never break My covenant with you. "},{"num":2,"verse":"Now as for you, you must make no covenant with the inhabitants of this land. You must break down their altars.’ But you have not listened to My voice. What is this you have done? "},{"num":3,"verse":"Therefore I also said, ‘I will not drive them out from before you, but they will be thorns in your sides, and their gods will be a snare to you.’” "},{"num":4,"verse":"Now when the angel of Adonai spoke these words to all Bnei-Yisrael, the people lifted up their voice and wept. "},{"num":5,"verse":"So they called the name of that place Bochim, and they sacrificed there to Adonai."},{"num":6,"verse":"Now when Joshua had sent the people away, Bnei-Yisrael went every man to his inheritance to possess the land. "},{"num":7,"verse":"Then the people worshipped Adonai all the days of Joshua, and all the days of the elders that outlived Joshua, who had seen all the great work of Adonai that He had done for Israel. "},{"num":8,"verse":"Then Joshua son of Nun, the servant of Adonai, died at the age of 110 years, "},{"num":9,"verse":"and they buried him in the territory of his inheritance in Timnath-heres, in the hill country of Ephraim north of Mount Gaash."},{"num":10,"verse":"But when all that generation were gathered to their fathers, there arose another generation after them that did not experience Adonai or the work that He had done for Israel. "},{"num":11,"verse":"Then Bnei-Yisrael did what was evil in Adonai’s eyes, and worshipped the Baalim. "},{"num":12,"verse":"They abandoned Adonai, the God of their fathers, who had brought them out of the land of Egypt, and followed other gods from among the gods of the peoples around them, and bowed down to them. So they provoked the anger of Adonai. "},{"num":13,"verse":"So they forsook Adonai and worshipped Baal and the Ashtaroth. "},{"num":14,"verse":"So the anger of Adonai burned against Israel, and He gave them over to the hands of plunderers who plundered them, and He sold them over into the hand of their enemies around them, so that they could no longer stand up before their enemies. "},{"num":15,"verse":"Whenever they went out, the hand of Adonai was against them for evil, as Adonai had spoken and as Adonai had sworn to them. So they were severely distressed."},{"header":"Rise of Judges"},{"num":16,"verse":"Then Adonai raised up judges who delivered them from the hand of those who plundered them. "},{"num":17,"verse":"Yet they listened not to their judges, for they prostituted themselves after other gods and bowed down to them. They quickly turned aside from the way in which their fathers walked in obeying the commandments of Adonai; they did not do so. "},{"num":18,"verse":"Whenever Adonai raised judges up for them, Adonai was with the judge and delivered them from the hand of their enemies all the days of the judge. For Adonai was moved to pity by their groaning because of those who oppressed and crushed them. "},{"num":19,"verse":"But when the judge died, they would keep turning back and acted more corruptly than their fathers, in following other gods, worshipping them, and bowing down to them. They abandoned none of their practices and stubborn ways."},{"num":20,"verse":"So the anger of Adonai burned against Israel, and He declared, “Since this nation has transgressed My covenant that I commanded their fathers and has not listened to My voice, "},{"num":21,"verse":"I also will no longer drive out before them any of the nations that Joshua left when he died, "},{"num":22,"verse":"in order to test Israel by them, whether or not they will keep the way of Adonai to walk in it as their fathers did.” "},{"num":23,"verse":"So Adonai left those nations, without driving them out quickly. Thus so He had not given them into the hand of Joshua."}]