[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(1) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The queen of Sheba.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The name “Sheba” must be distinguished from ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Seba",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Saba",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (which begins with a different Hebrew letter), (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") The name Seba denotes a Cushite race (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 10:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), connected, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 43:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 45:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", with Egypt and Cush, and named with Sheba (“the kings of Sheba and Seba”)in the Psalm of Solomon (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 72:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Seba is, indeed, with great probability identified (see Jos. Ant. ii. 10, 2) with the Ethiopian city and island of Meroë. It is probably from confusion between Sheba and Saba that Josephus (Ant. viii. 6, 5) represents the queen of Sheba as a “queen of Egypt and Ethiopia.” (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "b",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") The name “Sheba” is found in the ethnological lists of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 10:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", among the descendants of Cush of the Hamite race, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 10:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", among the Semitic Joktanites, and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 25:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", among the Abrahamic children of Keturah. The kingdom of Sheba referred to in this passage must certainly be placed in Arabia Felix, the habitation of the Joktanite race (in which the Keturahites appear to have been merged), for the Cushite Sheba is probably to be found elsewhere on the Persian Gulf. The queen of Sheba would therefore be of Semitic race, not wholly an alien from the stock of Abraham.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The fame of Solomon concerning the name of the Lord.—If the reading of the text be correct, the phrase “concerning: the name of the Lord” (to which there is nothing to correspond in 2Chronicles 9:1) must refer to the constant connection of the fame of Solomon—especially in relation to his wisdom, which is here mainly referred to—with the name of Jehovah, as the God to whom, in the erection of the Temple, he devoted both his treasure and himself.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "The fame of Solomon concerning the name of the Lord.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—If the reading of the text be correct, the phrase “concerning: the name of the Lord” (to which there is nothing to correspond in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2Chronicles 9:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") must refer to the constant connection of the fame of Solomon—especially in relation to his wisdom, which is here mainly referred to—with the name of Jehovah, as the God to whom, in the erection of the Temple, he devoted both his treasure and himself.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Hard questions—or, riddles. The Arabian legends preserved in the Koran enumerate a list of questions and puzzles, propounded by the queen and answered by Solomon, too puerile to be worth mention. The “hard questions” (in which Solomon is said by Josephus to have had a contest with Hiram also) must surely have been rather those enigmatic and metaphorical sayings, so familiar to Eastern philosophy, in which the results of speculation, metaphysical or religious, are tersely embodied. The writings representing the age of Solomon—Job, Proverbs, and (whatever be its actual date) Ecclesiastes—are all concerned with these great problems, moral and speculative, which belong to humanity as such, especially in its relation to God. In solving these problems, rather than the merely fantastic ingenuity of what we call riddles, the wisdom of Solomon would be worthily employed.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Hard questions",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—or, riddles. The Arabian legends preserved in the Koran enumerate a list of questions and puzzles, propounded by the queen and answered by Solomon, too puerile to be worth mention. The “hard questions” (in which Solomon is said by Josephus to have had a contest with Hiram also) must surely have been rather those enigmatic and metaphorical sayings, so familiar to Eastern philosophy, in which the results of speculation, metaphysical or religious, are tersely embodied. The writings representing the age of Solomon—Job, Proverbs, and (whatever be its actual date) Ecclesiastes—are all concerned with these great problems, moral and speculative, which belong to humanity as such, especially in its relation to God. In solving these problems, rather than the merely fantastic ingenuity of what we call riddles, the wisdom of Solomon would be worthily employed.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1 Kings",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "A ROYAL SEEKER AFTER WISDOM1 Kings 10:1 - 1 Kings 10:13",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "A ROYAL SEEKER AFTER WISDOM",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 10:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 10:13",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " We feel the breath of a new era in the accounts of Solomon’s reign. One most striking peculiarity is the friendly intercourse with the nations around. The horizon has widened, and, instead of wars with Philistines and Ammon, we have alliances with Egypt, Tyre, and, in the present passage, with Sheba, a district of Southern Arabia. The expansion was fruitful of both good and evil. It brought new ideas and much wealth; but it brought, too, luxury and idolatry. Still Israel was meant to be ‘a light to lighten the Gentiles,’ and in this picturesque story of the wisdom-seeking queen, we have the true relation of Israel to the nations in its purest form. The details of the narrative. Interesting as they are, need not occupy us long.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The queen had heard the fame of Solomon concerning the name of the Lord, by which seems to be meant his reputation of being gifted with deep knowledge of the divine character as revealed to him. The questions which occupy earnest souls in all lands and ages were stirring in the heart of this woman-chief. The only way, in these old days, to learn the wisdom of the wise, was to go to them. So the streets of Jerusalem saw the strange sight of the long train which had come toiling up from Arabia, laden with its characteristic produce, gold and spices and precious stones, in the enumeration of which is reflected the wonder of the beholders at the unaccustomed procession. But better than all her wealth was the eager woman’s thirst for truth. Surely it is a very unworthy and unlikely explanation of her ‘hard questions’ and purpose to suppose that she came only for a duel of wit,-to pose Solomon with half-playful riddles. The journey was too toilsome, the gifts too large, the accent of conviction in her subsequent words too grave, for that. She was a seeker after truth, and probably after God, and had known the torture of the eternal questions which rise in the mind, and, once having risen, leave no rest till they are answered.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So she came, though half incredulous, hoping to find some solution to what ‘was in her heart,’ and as thirsty for the answer as her country’s sands for water. Only they who have known the pain of carrying such questions, like a fire in their bones, can know the joy which she felt when she found one to whom she could speak them. It is something of a drop to pass from Solomon’s wisdom to the list of the splendours of his household, and the effect which these produced on the queen; but the whole account of Solomon’s reign is marked by the same naive blending of wisdom and material wealth. In those days, outward prosperity was the sign of divine favour. But even in those days they knew that wisdom was ‘better than rubies.’ The two elements were both at their height in Solomon’s reign, and the lower of them finally got uppermost, and wrecked him. Plain living and high thinking are better than ‘wisdom,’ which lets itself down to make much of ‘the meat of the table,’ and a retinue of servants in fine clothes. How many of us would listen much more respectfully to wisdom, if it lived in a palace, than in ‘dens and caves of the earth’? The queen’s words in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 10:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 10:9",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "are graceful with a woman’s tact, and full of feeling. She confesses that she had come half-doubting, even though she risked the journey, and fervently avows how far fame had been unlike itself in this instance, and had diminished, and not magnified. Then she envies the servants who wait on him, because they are so near the fountain, and finally breaks into praise of Solomon’s God, whose love to Israel was shown in giving it such a king. One does not know whether praise of God or compliments to Solomon were most in her mind. The words scarcely sound as if she had become a worshipper of God. He is to her but ‘thy God.’ But we may believe that she carried away some seed which grew up. Then, with munificent interchange of gifts, she and her train glide out of the story, and we lose them in the dark. The account of the wealth brought by Hiram’s ships comes singularly in, breaking the narrative of the queen. Its insertion seems to indicate some connection between the fleet and her, and to suggest that Sheba and Ophir were near each other {which would put Ethiopia, where some have located it, out of court}, and that she heard of Solomon through it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The whole incident may be regarded as an illustration of the spirit that should mark all seekers after truth, whether earthly or heavenly. This queen had to win a victory over national prejudices, over the disabilities of her sex, over the temptations of her station, to travel far, and face dangers, and to incur great cost. It was surely no mere playful errand on which she was bent. She was smitten with the sacred impulse to ‘follow knowledge like a sinking star.’ Seldom, indeed, have rulers made progresses from their dominions for such an end, and seldom have two of them met to confer on such subjects. We shall not rightly measure the relative importance of things unless we resolutely set ourselves to look at them with eyes purged from the illusions of sense, and cleared to see how much better than wealth and all outward good is the possession of truth. All sacrifices made to win it are richly repaid, and wise investments. Even in regard to lower kinds of truth, to win them is worth the effort of a life; and, in regard to the highest kind, which is the personal Truth, he is the wise man who counts all earthly good but loss for the excellency of the knowledge of it. This queen points the path by which all pilgrims of the truth must travel. It is not to be won without effort, without conquest of prejudices, repression of weakness, sacrifices of delights, and long effort. There must be humility, which will gladly learn, if there is ever to be its possession.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘Nor can the man that moulds in idle cellUnto her happy mansion attain.’ ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "‘Nor can the man that moulds in idle cell",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Unto her happy mansion attain.’",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "But in our days, the easier the attainment, the less the appreciation. The queen of Sheba had no books, and she travelled far to get wisdom. We are flooded with all appliances, and many of us would not cross the road to get Solomon’s wisdom, but would do much to be invited to feast at his table, or to secure some of the queen’s camels’ load.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " This story brings out the true ideal of Israel’s relation to the nations. Solomon is the embodiment of his people. His reign is marked by largely increased and amicable relations with his neighbours. These were not all wholesome, and ultimately led to much mischief. But, while the purely commercial connection with Tyre was defective, in that there was no attempt to bring Hiram and the men who worked for the Temple to any knowledge of the God of the Temple, and the relation with Egypt was more unsatisfactory still, in that it meant only the importation of corrupting luxuries and the marriage with an Egyptian princess, an idolatress, this relation with the queen of Sheba was the true one. Solomon did in it what Israel was meant to do for the world. He attracted a seeker from afar, and imparted to her the wisdom that God had given him. He answered the torturing questions and won the confidence of this woman who was groping in the dark, till he led her by the hand to the light. A bond of friendship knit them together, and mutual gifts cemented their amity.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " All this is but the putting into concrete form of God’s purpose in choosing Israel for His own. It was not meant to retain or to enclose, but to diffuse, the light. The world can only get blessing by one man or people getting it first. As well charge the builder of the lighthouse with partiality because he puts the bright lamps in that narrow room, as find fault with the divine method of making the earth know His name. The lighthouse is reared that the beams may stream out over the tossing, nightly sea. So God appointed to His people of old their task. So He has appointed the same task to His Church to-day. We ought to attract seekers from afar, to win their frank speech when they come, to be able to answer their anxious questions, and to bind them to ourselves in grateful bonds. In these days there are multitudes harassed by the modern forms of the same old, ever-pressing riddles which burdened this ancient queen’s heart; and that Church but ill discharges its office which repels rather than draws the seekers, or has no word of illumination for them if they come.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But the highest use to be made of the story is that which Christ made of it. It stands as a perpetual witness against those who are too blind to see the beauty, or too careless to be drawn to listen to the wisdom, of a present Christ. The sacrifices which men can make for lower objects are the most powerful rebukes of their unwillingness to make sacrifices for the highest, just as their capacity of love and trust is of their not loving and trusting Him. The same energy and effort which this queen put forth to reach Solomon, and which men eagerly put forth for some temporal good, would suffice to bring them to the feet of the great Teacher. Her longing for wisdom, her discernment of the person who could give it, and her toilsome journey, rebuke men’s indifference to Christ’s gifts, their failure to recognise His sweetness and power to make blessed, and their laziness and self-indulgence, which will not take a hundredth part of the pains to secure heaven which they cheerfully expend, and that often in vain, to secure earth. Will the ‘Queen of the south’ stand alone as witness in that day, or will there not be many out of other lands, who, like her, stretched out their hands to the dimly descried but yearned-for light, and came nearer to it, though they seemed far off, than many who lived in its full blaze and never cared for it? Will it be only Christ’s contemporaries who will be condemned by heathen seekers after God, or will there be many of ourselves, convicted of stolid indifference to the Christ who has been beside us all our lives, and has prayed us ‘with much entreaty’ and in vain, to ‘receive the gift’?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " They who find their way to Him, and tell Him all that is in their hearts, will have all their questions solved. We have not far to go; for ‘a greater than Solomon is here.’ If we betake ourselves to Him, and learn of Him, we too shall find that ‘the half was not told us’; for Christ possessed is sweeter than all expectation, however high-pitched it may be, and to win Him is the only gain in which there is no disappointment, either at first or at last. We may all have the blessedness of His servants, ‘which stand continually before’ Him, and not only ‘hear’ but receive into their spirits His ‘wisdom.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1 Kings 10:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 10:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The queen ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Sheba — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Probably of that part of Arabia called Sabæa, which bordered upon the Red sea, Hence our Lord terms her ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the queen of the south, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and says she ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "came from the uttermost parts of the earth, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 12:42",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) which answers exactly to Arabia Felix, for it lies south of Judea, is at a great distance from it, and is limited by the ocean. Add to this, that it abounded in all the commodities which she brought, gold, precious stones, and all kinds of spices and fine perfumes, more than Ethiopia, (from whence some have thought she came,) or any country thereabouts. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Heard of the fame of Solomon — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Probably she heard of his fame by the ships that went to Ophir, for they sailed by her coast, and, in all likelihood, spread his fame there and in all other places where they touched, proclaiming his magnificence, and especially his wisdom, and the glorious temple which he had built, or was building, for the worship of his God, whose praise they set forth as far above all gods. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Concerning the name of the Lord — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That is, concerning God, the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "name of God ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "being often put for God; concerning Solomon’s deep knowledge in the things of God. For it is very probable she had, as had divers other ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "heathen, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "some knowledge of the true God, and an earnest desire to know more concerning him. Indeed, if she came from Arabia, as we see there is reason to think she did, it is not improbable but she was a descendant of Abraham by his wife Keturah, one of whose sons begat Sheba, who seems to have been the first planter of this country. If so, “she might,” as Dr. Dodd observes, “have some knowledge of revealed religion, by tradition at least, from her pious ancestors. And this verse seems more than to intimate that the design of her visit to Solomon was not so much to gratify her curiosity, as to inform her understanding in matters relating to piety and divine worship. And what our Saviour speaks respecting her rising in judgment against the men of that generation, seems plainly to intimate that the wisdom she came to hear was of a much more important kind than that of merely enigmatical questions.” See Calmet’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Comment. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Dict. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "on the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Sheba, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and Saurin’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Discourses, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "vol. 5. p. 261. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "She came to prove him with hard questions — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Concerning natural, and civil, and especially divine things, that she might not only try whether he was as wise as report made him, but might receive instruction from him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10:1-13 The queen of Sheba came to Solomon to hear his wisdom, thereby to improve her own. Our Saviour mentions her inquiries after God, by Solomon, as showing the stupidity of those who inquire not after God, by our Lord Jesus Christ. By waiting and prayer, by diligently searching the Scriptures, by consulting wise and experienced Christians, and by practising what we have learned, we shall be delivered from difficulties. Solomon's wisdom made more impression upon the queen of Sheba than all his prosperity and grandeur. There is a spiritual excellence in heavenly things, and in consistent Christians, to which no reports can do justice. Here the truth exceeded; and all who, through grace, are brought to commune with God, will say the one half was not told them of the pleasures and the advantages of wisdom's ways. Glorified saints, much more, will say of heaven, that the thousandth part was not told them, 1Co 2:9. She pronounced them happy that constantly attended Solomon. With much more reason may we say of Christ's servants, Blessed are they that dwell in his house; they will be still praising him. She made a noble present to Solomon. What we present to Christ, he needs not, but will have us do so to express our gratitude. The believer who has been with Jesus, will return to his station, discharge his duties with readiness, and from better motives; looking forward to the day when, being absent from the body, he shall be present with the Lord.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Doubt has arisen whether the \"queen of Sheba\" was an Ethiopian or an Arabian princess. Both countries profess to have traditions on the subject connecting the queen of Sheba with their history; and in both countries, curiously enough, government by queens was common. But the claims of Arabia decidedly preponderate. The Arabian Sheba was the great spice country of the ancient world; whereas Ethiopia furnished no spices. The Arabian Sheba was an important kingdom. Sheba in Ethiopia was a mere town, subject to Meroe. And it may be doubted whether the Cushite Sheba of Scripture ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 10:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is not rather to be sought on the shores of the Persian Gulf (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 10:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " note), from where no one supposes \"the queen of Sheba\" to have come. If Ophir be placed in Arabia, there will be an additional reason for regarding Sheba as in the same quarter, because then Solomon's trade with that place will account for his fame having reached the Sabaean princess.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"The fame of Solomon concerning the name of the Lord,\" has been variously explained, and is confessedly very obscure. May it not mean what we should call \"his religious fame,\" as distinct from his artistic, literary, military, or political fame - \"his fame with respect to God and the things of God\" - or, in other words, \"his moral and religious wisdom?\" (compare 1 Kings 10:6).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"The fame of Solomon concerning the name of the Lord,\" has been variously explained, and is confessedly very obscure. May it not mean what we should call \"his religious fame,\" as distinct from his artistic, literary, military, or political fame - \"his fame with respect to God and the things of God\" - or, in other words, \"his moral and religious wisdom?\" (compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 10:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Hard questions - Or \"riddles\" Judges 14:12, though not exactly riddles in our sense. The Orientals have always been fond of playing with words and testing each other's wit and intelligence by verbal puzzles of various kinds. This spirit seems to have been particularly rife in Solomon's time, for Josephus records other encounters with Hiram of Tyre and another Tyrian called Abdemonus. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Hard questions - Or \"riddles\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 14:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", though not exactly riddles in our sense. The Orientals have always been fond of playing with words and testing each other's wit and intelligence by verbal puzzles of various kinds. This spirit seems to have been particularly rife in Solomon's time, for Josephus records other encounters with Hiram of Tyre and another Tyrian called Abdemonus. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "CHAPTER 10",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1Ki 10:1-13. The Queen of Sheba Admires the Wisdom of Solomon.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. the queen of Sheba—Some think her country was the Sabean kingdom of Yemen, of which the capital was Saba, in Arabia-Felix; others, that it was in African Ethiopia, that is, Abyssinia, towards the south of the Red Sea. The opinions preponderate in favor of the former. This view harmonizes with the language of our Lord, as Yemen means \"South\"; and this country, extending to the shores of the Indian ocean, might in ancient times be considered \"the uttermost parts of the earth.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "heard of the fame of Solomon—doubtless by the Ophir fleet.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "concerning the name of the Lord—meaning either his great knowledge of God, or the extraordinary things which God had done for him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "hard questions—enigmas or riddles. The Orientals delight in this species of intellectual exercise and test wisdom by the power and readiness to solve them.The queen of Sheba cometh to Jerusalem; admireth Solomon’s wisdom and glory; giveth God thanks, and Solomon presents,  1 Kings 10:1-10. His riches,  1 Kings 10:11-15; targets, ivory throne, vessels,  1 Kings 10:16-23; presents, chariots and horses, tribute,  1 Kings 10:24-29.  The queen of Sheba;  either, first, Of Ethiopia, as that people by constant tradition from their ancestors affirm, which also was truly in the ends of the earth, whence she came,  Matthew 12:42. Or rather, secondly, Of that part of Arabia called Sabaea, which was at a great distance from Jerusalem, and really in the ends of the earth, and bordering upon the southern sea; for there, much more than in Ethiopia, were the commodities which she brought,  1 Kings 10:2,10. Howsoever, this is there said for her commendation, that being a woman, and a queen, and living at great ease, and in such remote parts, she was willing to take so long and chargeable a journey to improve herself in knowledge, and that of Divine things, as is here implied. Concerning the name of the Lord,  i.e. concerning the great work which he had done for the name, i.e. the honour, and service, and worship, of the Lord, as it is expressed  1 Kings 8:17, and elsewhere. Or, concerning God; the name of God being oft put for God, as hath been noted before; concerning his deep knowledge in the things of God. For it is very probable that she had, as also had divers other heathens, some knowledge of the true God, and an earnest desire to know more of the being, and nature, and worship of God, wherein the heathens were generally at a great loss, and which many of them desired and endeavoured to understand. Or, concerning the great things which God had done for him, especially in giving him such incomparable wisdom, and that in an extraordinary manner. With hard questions;  concerning natural, and civil, and especially concerning Divine things, about which there are, and ever where, the hardest questions. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "hard questions—enigmas or riddles. The Orientals delight in this species of intellectual exercise and test wisdom by the power and readiness to solve them.The queen of Sheba cometh to Jerusalem; admireth Solomon’s wisdom and glory; giveth God thanks, and Solomon presents, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bldvs",
            "text": " 1 Kings 10:1-10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". His riches, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bldvs",
            "text": " 1 Kings 10:11-15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; targets, ivory throne, vessels, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bldvs",
            "text": " 1 Kings 10:16-23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; presents, chariots and horses, tribute, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bldvs",
            "text": " 1 Kings 10:24-29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "The queen of Sheba; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " either, first, Of Ethiopia, as that people by constant tradition from their ancestors affirm, which also was truly in the ends of the earth, whence she came, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bldvs",
            "text": " Matthew 12:42",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Or rather, secondly, Of that part of Arabia called Sabaea, which was at a great distance from Jerusalem, and really in the ends of the earth, and bordering upon the southern sea; for there, much more than in Ethiopia, were the commodities which she brought, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bldvs",
            "text": " 1 Kings 10:2,10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Howsoever, this is there said for her commendation, that being a woman, and a queen, and living at great ease, and in such remote parts, she was willing to take so long and chargeable a journey to improve herself in knowledge, and that of Divine things, as is here implied. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Concerning the name of the Lord, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " i.e. concerning the great work which he had done ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "for the name",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", i.e. the honour, and service, and worship, of the Lord, as it is expressed ",
            "children": []
          },
          {
            "element": "span",
            "class": "bldvs",
            "text": " 1 Kings 8:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and elsewhere. Or, concerning God; ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "the name of God",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " being oft put for ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "God",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", as hath been noted before; concerning his deep knowledge in the things of God. For it is very probable that she had, as also had divers other heathens, some knowledge of the true God, and an earnest desire to know more of the being, and nature, and worship of God, wherein the heathens were generally at a great loss, and which many of them desired and endeavoured to understand. Or, concerning the great things which God had done for him, especially in giving him such incomparable wisdom, and that in an extraordinary manner. ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "With hard questions; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " concerning natural, and civil, and especially concerning Divine things, about which there are, and ever where, the hardest questions. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And when the queen of Sheba heard of the fame of Solomon,.... Josephus (u) calls her a queen of Egypt and Ethiopia; but Sheba was in the southern part of Arabia Felix; her name with the Ethiopians is Maqueda (w), and with the Arabic geographer (x) Belequis. Some (y) think that Sheba, or Saba, is not the name of a country, but of the queen herself; and that she is the same with Sabbe the sibyl mentioned by Pausanias (z); but no doubt Sheba or Saba, the metropolis of Arabia Felix, as Philostorgius (a) calls it, is here meant; which Benjamin of Tudela says (b) is called the country of Al Yeman, or the south; and the name of Queen Teiman, given to this queen by an Arabic writer (c), seems to be the same as the queen of the south; see Gill on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 12:42",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The fame of Solomon's greatness and goodness, of his wealth and riches, and especially of his wisdom, had reached her ears; perhaps by means of the ambassadors of princes that had been at Solomon's court, and attended her's. According to an Ethiopic writer (d) it was by Tamerinus, a merchant of her's, she came to hear of him: particularly she heard of his fame ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "concerning the name of the Lord; his knowledge of the true God, the favour he was in with him, the excellent wisdom he had received from him, and what he had done for his honour and glory: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "she came to prove him with hard questions; in things natural, civil, and divine; to try whether he had such a share of knowledge and wisdom it was said he had, she posed him with enigmas, riddles, dark and intricate sayings, to unravel and tell the meaning of. She might be an emblem of the Gentiles, seeking unto Christ, having heard of him, Isaiah 11:10. In Matthew 12:42 she is said to come from the \"uttermost parts of the earth\"; wherefore some fetch her from Sumatra in the East Indies, where in an old map no other name is put but Sheba (e). ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "she came to prove him with hard questions; in things natural, civil, and divine; to try whether he had such a share of knowledge and wisdom it was said he had, she posed him with enigmas, riddles, dark and intricate sayings, to unravel and tell the meaning of. She might be an emblem of the Gentiles, seeking unto Christ, having heard of him, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 11:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 12:42",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " she is said to come from the \"uttermost parts of the earth\"; wherefore some fetch her from Sumatra in the East Indies, where in an old map no other name is put but Sheba (e). ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(u) Antiqu. l. 8. c. 6. sect. 2, 5. (w) Ludolf. Ethiop. Hist. l. 2. c. 3.((x) Clim 1. par. 6. (y) Vid. Coryli Disser. de Reg. Austral. c. l. sect. 1, 2.((z) Phocica, sive, l. 10. p. 631. (a) Hist. Eccl. l. 3. c. 4. (b) Itinerar. p. 82. (c) Abulpharag. Hist. Dynast. Dyn. 3. p. 54. (d) Tellezius apud Ludolf. Ethiop. Hist. l. 2. c. 3.((e) Dampier's Voyages, vol. 2. p. 139. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(u) Antiqu. l. 8. c. 6. sect. 2, 5. (w) Ludolf. Ethiop. Hist. l. 2. c. 3.((x) Clim 1. par. 6. (y) Vid. Coryli Disser. de Reg. Austral. c. l. sect. 1, 2.((z) Phocica, sive, l. 10. p. 631. (a) Hist. Eccl. l. 3. c. 4. (b) Itinerar. p. 82. (c) Abulpharag. Hist. Dynast. Dyn. 3. p. 54. (d) Tellezius apud Ludolf. Ethiop. Hist. l. 2. c. 3.((e) Dampier's Voyages, vol. 2. p. 139. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And when the queen of {a} Sheba heard of the fame of Solomon concerning the name of the LORD, she came to prove him with hard questions.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And when the queen of ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{a}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Sheba heard of the fame of Solomon concerning the name of the LORD, she came to prove him with hard questions.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) Josephus says that she was Queen of Ethiopia, and that Sheba was the name of the chief city of Meroe, which is an island of the Nile.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 10:1-13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Queen of Sheba’s visit to King Solomon (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 9:1-12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Now when the queen of Sheba heard",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The ‘Sheba’, of which the queen is here mentioned, was that part of Arabia spoken of in the note on the last verse of the preceding chapter. It embraced the greater part of Arabia Felix. Josephus and many Jewish writers represent her as the queen of Egypt and Ethiopia, making ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "שׁבא",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Sheba",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") the same as ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "סבא",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Seba",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and this tradition is firmly rooted among the Abyssinians (i.e. Ethiopians), but there is no ground at all for identifying Sheba with the Ethiopian kingdom of Seba. Moreover the presents which the queen brought with her bespeak the land from which she came. They are Arabian, certainly not African.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "concerning the name of the Lord",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] From the expressions so frequent in chap. 8. about ‘a house built for ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the name",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of the Lord God of Israel’ (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 8:17-20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 8:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 8:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 8:43-44",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 8:48",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") we may be sure that wherever the grand building was mentioned, there would be heard something about the name of Him to whose honour it was built. In like manner, at an earlier date, the people of Israel were known among other nations ‘because of the name of the Lord.’ See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 9:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where the Gibeonites say ‘we have heard the fame of Him, and all that He did in Egypt.’ Through caravans travelling hither and thither there can be little doubt that knowledge of Solomon’s works was widely spread, and communication with the Sabæans was a matter of no great difficulty. In the parallel passage (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 9:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") there is nothing said about ‘the name of the Lord’; the LXX. has ‘she had heard the name of Solomon ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the name of the Lord.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Some interpreters take the expression ‘concerning the name of the Lord’ to signify that the wisdom which Solomon had was derived from the Lord, and this made him famous. Some countenance is given to this opinion by the questions wherewith the queen essayed to test his wisdom, but it does not so well connect itself with ‘the name.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "she came to prove him with hard questions",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Josephus (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ant",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". viii. 6. 5) says ‘she could not trust to hearsay, for the report might have been built upon false judgement, and might change, as it depended solely upon the persons who brought it.’ The ‘proving with hard questions’ recalls the story of Samson’s riddle (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jdg 14:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The giving of such riddles was not an uncommon pastime among the ancients, and we have specimens among the Greeks, who called them ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "γρῖφοι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Cf. Aristoph. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Vesp",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". 20, and especially Athenæus 10. 69–78, where the author gives an account of the various kinds of riddles, and later in chap. 83 gives specimens of them. The Arabs were specially given to this kind of amusement, and we find in Josephus (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ant",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". viii. 5. 3) an account of a contest of wit of this nature between Hiram and Solomon, and he reports, on the authority of Dios, that a reason for Hiram’s large payments to Solomon was that he had been beaten in the encounter and unable to solve the riddles propounded. The queen of Sheba came prepared with a series of such difficulties. Josephus says she came ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "λῦσαι τὸ ἄπορον τῆς διανοίας δεηθεῖσα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which would indicate more than mere subtle questions among the inquiries which she made. It does not follow, however, that her difficulties were of a religious character, though this has been inferred from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 12:42",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Ver 1.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And when the queen of Sheba",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [There is no good ground for doubting that by ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "שְׁבָא",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " we are to understand the kingdom of Southern Arabia (Yemen). It is true that while ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 25:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 1:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") speaks of Sheba, the son of ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Joktan",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", one of the colonists of southern Arabia, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 10:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 1:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " mention another Sheba, the son of ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Cush",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and a doubt has arisen whether this was an Arabian or an Ethiopian princess, and it is alleged that she was the latter by Josephus, who calls her \"queen of Egypt and Ethopia,\" and by some Rabbinical writers, and in the traditions of the Abyssinian church. But the kingdoms of Sheba (",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "שְׁבָא",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") and Saba (",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "סְבָא",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") are entirely distinct (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 72:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), the latter being the name both of the capital and country of Meroe, a province of Ethopia (Joshua, Ant. 2:10. 2); while the former in like manner designates both the chief city and also the kingdom of the Sabeans (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 1:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). This tribe would seem to have grown richer and stronger than all the other Arabian peoples by means of its commercial enterprise, and it was especially famed for its gold, gems, and spices (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 27:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 6:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 60:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 3:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 6:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 72:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). It is noticeable that in both kingdoms government by female sovereigns was not uncommon (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 8:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); but it is very remarkable to find any country under the rule of a queen at this early date. (The idea that either of these lands was ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "always",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " governed by queens has no real basis.) The name of this princess, according to the Koran, was ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Balkis",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", according to Abyssinian belief, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Maqueda",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Whether she was a widow or virgin is unknown] ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "heard",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "hearing",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Doubtless through the Arab traders. The record of this visit, following immediately upon the mention of the voyages (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 9:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), is a grain of evidence in favour of locating Ophir in Arabia] ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "of",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "the fame",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "hearing",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἀκοή",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which also means ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "the thing heard, report",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἀποκάλυψις καύχησις",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.] ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "of Solomon concerning the name",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "לְשְׁם",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "in relation to, in connexion with",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the name,\" etc. No doubt it was the house he had built ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "לְשֵׁם יְיָ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 3:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 5:17, 18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 8:17, 18, 19, 20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.) had made him famous. But the expression is somewhat unusual, and these words are omitted by the chronicler. Gesenius and Ewald, however, regard the ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "ל",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as instrumental, \"the fame given him by the name,\" etc., as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 7:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 12:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc., and Wordsworth compares the use of ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἐν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in Greek. The LXX. and other versions read \"the name of Solomon and the name of the Lord.\" But the text is on every ground to be retained. The alliteration in this verse (probably accidental) is to be noticed. There is also a slight ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "paronomasia",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "of the Lord, she came to prove",
        "children": [
          {
            "element": "span",
            "class": "cmt_word",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "of the Lord, she came to prove",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " (LXX. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "πειράσαι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "to test",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")] ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "him with hard",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "questions",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "in riddles",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; LXX. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἐν αἰνίγμασι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Arabian mind has ever delighted in dark sayings, enigmas, etc., and extensive collections of these have been made by Burckhardt and others (see Keil ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "in loc",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) According to Dius (cited in Josephus, Contra Ap. 1:17. 18) Solomon also had dialectical encounters with Hiram and with Abdemon, or, according to Menander, a younger son of Abdemon, a man of Tyre.] 1 Kings 10:1",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Visit of the Queen of Saba (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 9:1-12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). - When the fame of Solomon's great wisdom came to the ears of the queen of Saba, probably through the Ophir voyages, she undertook a journey to Jerusalem, to convince herself of the truth of the report which had reached her, by putting it to the test by means of enigmas. שׁבא, Σαβά, is not Ethiopia or Mero, as Josephus (Ant. viii. 6, 5), who confounds שׁבא with סבא, and the Abyssinian Christians suppose (vid., Ludolfi hist. Aeth. ii. 3), but the kingdom of the Sabaeans, who were celebrated for their trade in incense, gold, and precious stones, and who dwelt in Arabia Felix, with the capital Saba, or the Μαριάβα of the Greeks. This queen, who is called Balkis in the Arabian legend (cf. Koran, Sur. 27, and Pococke, Specim. hist. Arab. p. 60), heard the fame of Solomon יהוה לשׁם; i.e., not \"at the naming of the name of Jehovah\" (Bttcher), nor \"in respect of the glory of the Lord, with regard to that which Solomon had instituted for the glory of the Lord\" (Thenius); nor even \"serving to the glorification of God\" (de Wette and Maurer); but literally, \"belonging to the name of the Lord:\" in other words, the fame which Solomon had acquired through the name of the Lord, or through the fact that the Lord had so glorified Himself in him (Ewald and Dietrich in Ges. Lex. s.v. ל). \"She came to try him with riddles,\" i.e., to put his wisdom to the test by carrying on a conversation with him in riddles. The love of the Arabs for riddles, and their superiority in this jeu d'esprit, is sufficiently well known from the immense extent to which the Arabic literature abounds in Mashals. We have only to think of the large collections of proverbs made by Ali ben Abi Taleb and Meidani, or the Makamen of Hariri, which have been made accessible to all by F. Rckert's masterly translation into German, and which are distinguished by an amazing fulness of word-play and riddles. חידה, a riddle, is a pointed saying which merely hints at the deeper truth and leaves it to be guessed.",
        "children": []
      }
    ]
  }
]