[{"header":"Chapter 35"},{"num":1,"verse":"Faithfulness of the Rechabites. This is the word that came to Jeremiah from the Lord in the days of King Jehoiakim of Judah, the son of Josiah:"},{"num":2,"verse":"Go forth to the clan of the Rechabites and speak to them. Have them accompany you into one of the rooms of the house of the Lord and offer them wine to drink."},{"num":3,"verse":"Therefore, I took Jaazaniah, the son of Jeremiah, the son of Habazziniah, his brothers and all his sons, the entire clan of the Rechabites,"},{"num":4,"verse":"and I brought them into the house of the Lord, to the room of the sons of Hanan, son of Igdaliah, the man of God. This room adjoins the chamber of the princes and is above the room of Maaserah, the son of Shallum, the guardian of the threshold."},{"num":5,"verse":"Then I set pitchers full of wine and some cups before the Rechabites, and I said to them, “Have some wine to drink.”"},{"num":6,"verse":"However, they replied, “We never drink wine. Our ancestor Jonadab, the son of Rechab, gave us this command, ‘Neither you nor your children will ever drink wine."},{"num":7,"verse":"Nor will you build houses or sow seed or plant vineyards or even own them. Rather, you will dwell in tents all the days of your life, so that you may live for a long time on the land where you are sojourners.’"},{"num":8,"verse":"“We have carefully followed all the commands given to us by our ancestor Jonadab, the son of Rechab. Throughout our lives we have never consumed wine, nor have our wives, our sons, or our daughters."},{"num":9,"verse":"We have not built houses to live in, and we have no vineyards or fields or seed."},{"num":10,"verse":"On the contrary, we have lived in tents and scrupulously obeyed everything commanded by our father Jonadab."},{"num":11,"verse":"But when Nebuchadnezzar, the king of Babylon, invaded this land, we said, ‘Let us go to Jerusalem so that we may escape the armies of the Chaldeans and the Arameans.’ That is the reason why we are living in Jerusalem.”"},{"num":12,"verse":"Then the word of the Lord came to Jeremiah:"},{"num":13,"verse":"Thus says the Lord of hosts, the God of Israel: Go forth and say to the people of Judah and the inhabitants of Jerusalem: Will you never come to your senses and obey my words? says the Lord."},{"num":14,"verse":"The command of Jonadab, the son of Rechab, to his descendants never to drink wine has been observed to this very day; in obedience to their ancestor, they have drunk no wine. But despite the fact that I have repeated this command to you countless times, you have not obeyed me."},{"num":15,"verse":"I have continued to send to you all my servants the prophets who warned you repeatedly, “Turn back, every one of you, from your evil conduct, and cease to follow other gods to serve them. Then you will continue to live in the land that I gave to you and your ancestors.” But you did not pay attention and you refused to listen to me."},{"num":16,"verse":"The descendants of Jonadab, the son of Rechab, have honored the command that their ancestors gave them. You, however, have not heeded my warnings."},{"num":17,"verse":"Therefore, thus says the Lord, the God of hosts, the God of Israel: I am determined to bring upon Judah and upon all the inhabitants of Jerusalem every disaster with which I threatened them because they would not listen when I spoke to them and did not answer when I called to them."},{"num":18,"verse":"However, to the clan of the Rechabites Jeremiah said, “Thus says the Lord of hosts, the God of Israel: Because you have obeyed the command of your father Jonadab, followed all of his instructions, and did everything that he ordered you to do,"},{"num":19,"verse":"therefore, thus says the Lord of hosts, the God of Israel: There will never fail to be a descendant of Jonadab, the son of Rechab, to stand before me forever.”"}]