[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(1) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "My tongue.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—To enter into the feeling of the poet we must remember the unrestrained way in which Orientals give way to grief. It was natural and becoming for him to “roar” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 38:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.) out his indignation or his grief, to mutter (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 1:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c) aloud his prayers, to speak out on every impulse. Now he determines to endure in silence and mutely bear the worst, rather than speak what may in the eyes of the impious be construed into a murmur against Divine Providence, into impatience under the Divine decree. (Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 38:13-14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "With a bridle.—See margin, and comp. Deuteronomy 25:4, where the cognate verb occurs. The root-meaning is “stop.” For the metaphor comp. James 1:26, and Plato, Laws, 3:701, “the argument, like a horse, ought to be pulled up from time to time, and not be allowed to run away, but held with bit and bridle.” (Comp. also Virgil, Æneid, vi. 79.)",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "With a bridle.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—See margin, and comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 25:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where the cognate verb occurs. The root-meaning is “stop.” For the metaphor comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "James 1:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and Plato, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Laws, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "3:701, “the argument, like a horse, ought to be pulled up from time to time, and not be allowed to run away, but held with bit and bridle.” (Comp. also Virgil, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Æneid, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "vi. 79.)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 39:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 39:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I said — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "I fully resolved, &c. “The Psalm,” says Dr. Horne, “begins abruptly with the result of a meditation on the narrow, slippery, and dangerous paths of life; more especially on the extreme difficulty of restraining the tongue, amidst the continual temptations and provocations”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "which surround or assault us, to speak unadvisedly with our lips. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I will take heed to my ways — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That is, to order all my actions aright, and particularly to govern my tongue, that if any evil thought or passions arise within me, I may suppress and mortify them, and not suffer them to break forth into sinful reflections on God and his providence. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I will keep my mouth as with a bridle — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "With all possible care and diligence. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "While the wicked is before me — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "In my presence; or in my thoughts, as the phrase is understood, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 51:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", that is, while I consider the flourishing estate of wicked men.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "39:1-6 If an evil thought should arise in the mind, suppress it. Watchfulness in the habit, is the bridle upon the head; watchfulness in acts, is the hand upon the bridle. When not able to separate from wicked men, we should remember they will watch our words, and turn them, if they can, to our disadvantage. Sometimes it may be necessary to keep silence, even from good words; but in general we are wrong when backward to engage in edifying discourse. Impatience is a sin that has its cause within ourselves, and that is, musing; and its ill effects upon ourselves, and that is no less than burning. In our greatest health and prosperity, every man is altogether vanity, he cannot live long; he may die soon. This is an undoubted truth, but we are very unwilling to believe it. Therefore let us pray that God would enlighten our minds by his Holy Spirit, and fill our hearts with his grace, that we may be ready for death every day and hour.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "I said - This refers to a resolution which he had formed. He does not say, however, at what time of his life the resolution was adopted, or how long a period had elapsed from the time when he formed the resolution to the time when he thus made a record of it. He had formed the resolution on some occasion when he was greatly troubled with anxious thoughts; when, as the subsequent verses show, his mind was deeply perplexed about the divine administration, or the dealings of God with mankind. It would seem that this train of thought was suggested by his own particular trials ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 39:9-10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", from which he was led to reflect on the mysteries of the divine administration in general, and on the fact that man had been subjected by his Creator to so much trouble and sorrow - and that, under the divine decree, human life was so short and so vain.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I will take heed to my ways - To wit, in respect to this matter. I will be cautious, circumspect, prudent. I will not offend or pain the heart of others. The particular thing here referred to was, the resolution not to give utterance to the thoughts which were passing in his mind in regard to the divine administration. He felt that he was in danger, if he stated what he thought on the subject, of saying things which would do injury, or which he would have occasion to regret, and he therefore resolved to keep silent.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "That I sin not with my tongue - That I do not utter sentiments which will be wrong, and which I shall have occasion to repent; sentiments which would do injury to those who are already disposed to find ground of complaint against God, and who would thus be furnished with arguments to confirm them in their views. Good men often have such thoughts passing through their minds; thoughts reflecting on the government of God as unequal and severe; thoughts which, if they were suggested, would tend to confirm the wicked and the skeptical in their views; thoughts which they hope, in respect to themselves, to be able to calm down by meditation and prayer, but which would do only unmitigated harm if they were communicated to other men, especially to wicked people.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I will keep my mouth with a bridle - The word used here means rather a \"muzzle,\" or something placed \"over\" the mouth. The bridle is to restrain or check or guide the horse; the muzzle was something to bind or fasten the mouth so as to prevent biting or eating. Deuteronomy 25:4 : \"thou shalt not muzzle the ox when he treadeth out the corn.\" See the notes at 1 Corinthians 9:9. The meaning here is, that he would restrain himself from uttering what was passing in his mind.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I will keep my mouth with a bridle - The word used here means rather a \"muzzle,\" or something placed \"over\" the mouth. The bridle is to restrain or check or guide the horse; the muzzle was something to bind or fasten the mouth so as to prevent biting or eating. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 25:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : \"thou shalt not muzzle the ox when he treadeth out the corn.\" See the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 9:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The meaning here is, that he would restrain himself from uttering what was passing in his mind.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "While the wicked is before me - In their presence. He resolved to do this, as suggested above, lest if he should utter what was passing in his own mind - if he should state the difficulties in regard to the divine administration which he saw and felt - if he should give expression to the skeptical or hard thoughts which occurred to him at such times, it would serve only to confirm them in their wickedness, and strengthen them in their alienation from God. A similar state of feeling, and on this very subject, is referred to by the psalmist Psalm 73:15, where he says that if he should utter what was really passing in his mind, it would greatly pain and offend those who were the true children of God; would fill their minds with doubts and difficulties which might never occur to themselves: \"If I say, I will speak thus; behold, I shall offend against the generation of thy children.\" As illustrations of this state of feeling in the minds of good men, and as evidence of the fact that, as in the case of the psalmist, their existence in the mind, even in the severest and the most torturing form, is not proof that the man in whose bosom they arise is not a truly pious man, I make the following extracts as expressing the feelings of two of the most sincere and devoted Christian men that ever lived - both eminently useful, both in an eminent degree ornaments to the Church, Cecil and Payson: \"I have read all the most acute, and learned, and serious infidel writers, and have been really surprised at their poverty. The process of my mind has been such on the subject of revelation, that I have often thought Satan has done more for me than the best of them, for I have had, and could have produced, arguments that appeared to me far more weighty than any I ever found in them against revelation.\" - Cecil. Dr. Payson says in a letter to a friend: \"There is one trial which you cannot know experimentally: it is that of being obliged to preach to others when one doubts of everything, and can scarcely believe that there is a God. All the atheistical, deistical, and heretical objections which I meet with in books are childish babblings compared with those which Satan suggests, and which he urges upon the mind with a force which seems irresistible. Yet I am often obliged to write sermons, and to preach when these objections beat upon me like a whirlwind, and almost distract me.\" ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "While the wicked is before me - In their presence. He resolved to do this, as suggested above, lest if he should utter what was passing in his own mind - if he should state the difficulties in regard to the divine administration which he saw and felt - if he should give expression to the skeptical or hard thoughts which occurred to him at such times, it would serve only to confirm them in their wickedness, and strengthen them in their alienation from God. A similar state of feeling, and on this very subject, is referred to by the psalmist ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 73:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where he says that if he should utter what was really passing in his mind, it would greatly pain and offend those who were the true children of God; would fill their minds with doubts and difficulties which might never occur to themselves: \"If I say, I will speak thus; behold, I shall offend against the generation of thy children.\" As illustrations of this state of feeling in the minds of good men, and as evidence of the fact that, as in the case of the psalmist, their existence in the mind, even in the severest and the most torturing form, is not proof that the man in whose bosom they arise is not a truly pious man, I make the following extracts as expressing the feelings of two of the most sincere and devoted Christian men that ever lived - both eminently useful, both in an eminent degree ornaments to the Church, Cecil and Payson: \"I have read all the most acute, and learned, and serious infidel writers, and have been really surprised at their poverty. The process of my mind has been such on the subject of revelation, that I have often thought Satan has done more for me than the best of them, for I have had, and could have produced, arguments that appeared to me far more weighty than any I ever found in them against revelation.\" - Cecil. Dr. Payson says in a letter to a friend: \"There is one trial which you cannot know experimentally: it is that of being obliged to preach to others when one doubts of everything, and can scarcely believe that there is a God. All the atheistical, deistical, and heretical objections which I meet with in books are childish babblings compared with those which Satan suggests, and which he urges upon the mind with a force which seems irresistible. Yet I am often obliged to write sermons, and to preach when these objections beat upon me like a whirlwind, and almost distract me.\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "PSALM 39",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ps 39:1-13. To Jeduthun (1Ch 16:41, 42), one of the chief singers. His name mentioned, perhaps, as a special honor. Under depressing views of his frailty and the prosperity of the wicked, the Psalmist, tempted to murmur, checks the expression of his feelings, till, led to regard his case aright, he prays for a proper view of his condition and for the divine compassion.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. I said—or, \"resolved.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "will take heed—watch.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "ways—conduct, of which the use of the tongue is a part (Jas 1:26).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "bridle—literally, \"muzzle for my mouth\" (compare De 25:4).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "while … before me—in beholding their prosperity (Ps 37:10, 36).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "while … before me—in beholding their prosperity (Ps 37:10, 36).",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "The Treasury of David",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1 I said, I will take heed to my ways, that I sin not with my tongue: I will keep my mouth with a bridle, while the wicked is before me.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "2 I was dumb with silence, I held my peace, even from good; and my sorrow was stirred.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 39:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 39:1",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"I said.\" I steadily resolved and registered a determination. In his great perplexity his greatest fear was lest he should sin; and, therefore, he cast about for the most likely method for avoiding it, and he determined to be silent. It is right excellent when a man can strengthen himself in a good course by the remembrance of a well and wisely-formed resolve. \"What I have written I have written,\" or what I have spoken I will perform, may prove a good strengthener to a man in a fixed course of right. \"I will take heed to my ways.\" To avoid sin one had need be very circumspect, and keep one's actions as with a guard or garrison. Unguarded ways are generally unholy ones. Heedless is another word for graceless. In times of sickness or other trouble we must watch against the sins peculiar to such trials, especially against murmuring and repining. \"That I sin not with my tongue.\" Tongue sins are great sins: like sparks of fire, ill-words spread, and do great damage. If believers utter hard words of God in times of depression, the ungodly will take them up and use them as a justification for their sinful courses. If a man's own children rail at him, no wonder if his enemies' mouths are full of abuse. Our tongue always wants watching, for it is restive as an ill-broken horse; but especially must we hold it in when the sharp cuts of the Lord's rod excite it to rebel. \"I will keep my mouth with a bridle,\" or more accurately, with a muzzle. The original does not so much mean a bridle to check the tongue as a muzzle to stop it altogether. David was not quite so wise as our translation would make him; if he had resolved to be very guarded in his speech, it would have been altogether commendable, but when he went so far as to condemn himself to entire silence, \"even from good,\" there must have been at least a little sullenness in his soul. In trying to avoid one fault, he fell into another. To use the tongue against God is a sin of commission, but not to use it at all involves an evident sin of omission. Commendable virtues may be followed so eagerly that we may fall into vices; to avoid Scylla we run into Charybdis. \"While the wicked is before me.\" This qualifies the silence, and almost screens it from criticism, for bad men are so sure to misuse even our holiest speech, that it is as well not to cast any of our pearls before such swine; but what if the Psalmist meant, \"I was silent while I had the prosperity of the wicked in my thoughts,\" then we see the discontent and questioning of his mind, and the muzzled mouth indicates much that is not to be commended. Yet, if we blame we must also praise, for the highest wisdom suggests that when good men are bewildered with sceptical thoughts, they should not hasten to repeat them, but should fight out their inward battle upon its own battlefield. The firmest believers are exercised with unbelief, and it would be doing the devil's work with a vengeance if they were to publish abroad all their questionings and suspicions. If I have the fever myself, there is no reason why I should communicate it to my neighbours. If any on board the vessel of my soul are diseased, I will put my heart in quarantine, and allow none to go on shore in the boat of speech till I have a clean bill of health.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 39:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 39:2",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"I was dumb with silence.\" He was as strictly speechless as if he had been tongueless - not a word escaped him. He was as silent as the dumb. \"I held my peace, even from good.\" Neither bad nor good escaped his lips. Perhaps he feared that if he began to talk at all, he would be sure to speak amiss, and, therefore, he totally abstained. It was an easy, safe, and effectual way of avoiding sin, if it did not involve a neglect of the duty which he owed to God to speak well of his name. Our divine Lord was silent before the wicked, but not altogether so, for before Pontius Pilate he witnessed a good confession, and asserted his kingdom. A sound course of action may be pushed to the extreme, and become a fault. \"And my sorrow was stirred.\" Inward grief was made to work and ferment by want of vent. The pent-up floods were swollen and agitated. Utterance is the natural outlet for the heart's anguish, and silence is, therefore, both an aggravation of the evil and a barrier against its cure. In such a case the resolve to hold one's peace needs powerful backing, and even this is most likely to give way when grief rushes upon the soul. Before a flood gathering in force and foaming for outlet the strongest banks are likely to be swept away. Nature may do her best to silence the expression of discontent, but unless grace comes to her rescue, she will be sure to succumb. THE ARGUMENT This Psalm was written by David when his mind was much discomposed and disquieted with the contemplation of the prosperity of sinners, and the afflictions of the godly; which being exemplified in himself and in his enemies, he speaks of the case not in general, but as in his own person. Jeduthun;  one of the three chief masters of the sacred music; of whom see 1 Chronicles 16:41,42 2 Chronicles 5:12. David taketh care of his thoughts, words, and works, Psalm 39:1-3. He considereth the brevity and vanity of man’s life, Psalm 39:4-6; puts his hope in God, Psalm 39:7; prayeth for the forgiveness of his sins, Psalm 39:8-11, and for favour in his pilgrimage, Psalm 39:12,13.  I said;  I fully resolved. To my ways, i.e. to order all my actions aright, and particularly to govern my tongue, which is very hard to do, and especially under these provocations. That I sin not with my tongue;  that if any evil thoughts or passions do arise in me, I will endeavour to suppress and mortify them, and not suffer them to boil and break forth into sinful and scandalous reflections upon God and his providence, as they usually do upon such occasions. As with a bridle,  i. e. with all possible care and diligence. The phrase implies the great difficulty of ruling the tongue. Before me;  either, 1. In my presence. Or rather, 2. In my thoughts, as the same phrase is understood, Psalm 51:3, i.e. whilst I consider the flourishing estate of wicked men. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"I was dumb with silence.\" He was as strictly speechless as if he had been tongueless - not a word escaped him. He was as silent as the dumb. \"I held my peace, even from good.\" Neither bad nor good escaped his lips. Perhaps he feared that if he began to talk at all, he would be sure to speak amiss, and, therefore, he totally abstained. It was an easy, safe, and effectual way of avoiding sin, if it did not involve a neglect of the duty which he owed to God to speak well of his name. Our divine Lord was silent before the wicked, but not altogether so, for before Pontius Pilate he witnessed a good confession, and asserted his kingdom. A sound course of action may be pushed to the extreme, and become a fault. \"And my sorrow was stirred.\" Inward grief was made to work and ferment by want of vent. The pent-up floods were swollen and agitated. Utterance is the natural outlet for the heart's anguish, and silence is, therefore, both an aggravation of the evil and a barrier against its cure. In such a case the resolve to hold one's peace needs powerful backing, and even this is most likely to give way when grief rushes upon the soul. Before a flood gathering in force and foaming for outlet the strongest banks are likely to be swept away. Nature may do her best to silence the expression of discontent, but unless grace comes to her rescue, she will be sure to succumb. ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "THE ARGUMENT",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "This Psalm was written by David when his mind was much discomposed and disquieted with the contemplation of the prosperity of sinners, and the afflictions of the godly; which being exemplified in himself and in his enemies, he speaks of the case not in general, but as in his own person. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Jeduthun; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " one of the three chief masters of the sacred music; of whom see ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "1 Chronicles 16:41,42 2 Chronicles 5:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "David taketh care of his thoughts, words, and works, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 39:1-3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". He considereth the brevity and vanity of man’s life, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 39:4-6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; puts his hope in God, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 39:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; prayeth for the forgiveness of his sins, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 39:8-11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and for favour in his pilgrimage, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 39:12,13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "I said; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " I fully resolved. ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "To my ways",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", i.e. to order all my actions aright, and particularly to govern my tongue, which is very hard to do, and especially under these provocations. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "That I sin not with my tongue; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " that if any evil thoughts or passions do arise in me, I will endeavour to suppress and mortify them, and not suffer them to boil and break forth into sinful and scandalous reflections upon God and his providence, as they usually do upon such occasions. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "As with a bridle, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " i. e. with all possible care and diligence. The phrase implies the great difficulty of ruling the tongue. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Before me; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " either, ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "1. In my presence. Or rather, ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "2. In my thoughts, as the same phrase is understood, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 51:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", i.e. whilst I consider the flourishing estate of wicked men. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "I said,.... That is, in his heart; he purposed and determined within himself to do as follows; and he might express it with his mouth, and so his purpose became a promise; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I will take heed to my ways; as every good man should; that is, to all his actions, conduct, and conversation: it becomes him to take heed what ways he walks in; that they are the ways of God, which he directs to; that they are the ways of Christ, which he has left an example to follow in; and that they are according to the word of God; that he walks in Christ, the way of salvation, and by faith on him; that he chooses and walks in the way of truth, and not error; and in all, the commandments and ordinances of the Lord blameless; and in the path of holiness, in which, though fools, they shall not err: and it is also necessary that he should take heed that he does nothing, either by embracing error, or going into immorality, by which the ways of God, and Christ, and truth, are evil spoken of, blasphemed and reproached; and that he does not depart out of these ways, nor stumble, slip, and fall in them; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that I sin not with my tongue; which is a world of iniquity, and has a multitude of vices belonging to it; not only in profane men, but in professors of religion; whom it becomes to take heed that they sin not with it, by lying one to another, by angry and passionate expressions, by corrupt communication, filthiness, foolish talking, and jesting, which are not convenient; by whispering, talebearing, backbiting, and by evil speaking one of another: particularly there are vices of the tongue, which the saints are liable to under afflictive providences, and seem chiefly designed here; such as envious expressions at the prosperity of others; words of impatience under their own afflictions, and murmurings at the hand of God upon them; such as these the psalmist determined, within himself, to guard against; in order to which he proposed to take the following method; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I will keep my mouth with a bridle: that is, bridle his tongue, that being an unruly member, and to be kept in with bit and bridle, like an unruly horse; see James 1:26; ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I will keep my mouth with a bridle: that is, bridle his tongue, that being an unruly member, and to be kept in with bit and bridle, like an unruly horse; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "James 1:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "while the wicked is before me; or \"against me\" (t); meaning either while Ahithophel and Absalom were conspiring and rebelling against him, and Shimei was cursing him, under which he behaved with great silence, calmness, and patience; see 2 Samuel 15:25; or while he had the flourishing condition of wicked men in his view, and was meditating on it; or rather, when anyone of them came to visit him in his affliction, he was determined to be wholly silent, that they might have no opportunity of rejoicing over him, nor of reproaching him, and the good ways of God: and indeed it is proper for the people of God to be always upon their guard, when they are in the presence of wicked men; and be careful what they utter with their lips, who watch their words to improve them against them, and the religion they profess. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "while the wicked is before me; or \"against me\" (t); meaning either while Ahithophel and Absalom were conspiring and rebelling against him, and Shimei was cursing him, under which he behaved with great silence, calmness, and patience; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 15:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; or while he had the flourishing condition of wicked men in his view, and was meditating on it; or rather, when anyone of them came to visit him in his affliction, he was determined to be wholly silent, that they might have no opportunity of rejoicing over him, nor of reproaching him, and the good ways of God: and indeed it is proper for the people of God to be always upon their guard, when they are in the presence of wicked men; and be careful what they utter with their lips, who watch their words to improve them against them, and the religion they profess. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(t) \"adversum me\", V. L. \"contra me\", Cocceius; so the Targum. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(t) \"adversum me\", V. L. \"contra me\", Cocceius; so the Targum. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "<even to {a} Jeduthun, A Psalm of David.>> I said, {b} I will take heed to my ways, that I sin not with my tongue: I will keep my mouth with a bridle, while the wicked is before me.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "<",
            "children": []
          },
          {
            "element": "to",
            "class": "",
            "text": "even to {a} Jeduthun, A Psalm of David.>> I said, {b} I will take heed to my ways, that I sin not with my tongue: I will keep my mouth with a bridle, while the wicked is before me.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) This was one of the chief singers, 1Ch 16:41.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) Although he had appointed with himself patiently to have wait for God's timing, yet the vehemency of his pain caused him to break his purpose.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I said",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] To myself: I resolved, as the result of self-communing. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 30:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 31:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I will take heed to my ways",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Lit. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I will keep my ways:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " keep watch and ward over thought word and action. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 16:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and the often repeated exhortation in Deuteronomy to ‘take heed’ (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 4:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; &c.). He fears that he may sin with his tongue (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 31:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") by murmuring against God as he contrasts the prosperity of the wicked with his own lot of trial. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 1:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 2:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and generally Psalms 37, 73.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I will keep",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " &c.] Lit. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I will keep a muzzle for my mouth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 141:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Perhaps with the LXX, we should read ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I will put … on",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "while the wicked",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "before me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] For the sight of their prosperity is a temptation. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Habakkuk 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This seems to be the sense, rather than that he was afraid of giving way to complaints in the hearing of the wicked, which might give occasion for ridicule or blasphemy.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1–3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The resolution of silence in the presence of temptation.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 1.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "I said, I will take",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "heed to my ways, that I sin not with my tongue.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " There are no grounds for connecting this silence with the abstinence from self-vindication mentioned in the preceding psalm (vers. 13, 14). Indeed, it seems to have had a wholly different origin (see the introductory paragraph). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "I will keep my mouth with a bridle",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " \"curb my impatience, restrain and keep in my speech.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "While the wicked is",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "before me.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The Prayer-book Version is better, if less literal, \"While the ungodly is in my sight.\" Psalm 39:1",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(Heb.: 39:2-4) The poet relates how he has resolved to bear his own affliction silently in the face of the prosperity of the ungodly, but that his smart was so overpowering that he was compelled involuntarily to break his silence by loud complaint. The resolve follows the introductory אמרתּי in cohortatives. He meant to take heed to his ways, i.e., his manner of thought and action, in all their extent, lest he should sin with his tongue, viz., by any murmuring complaint concerning his own misfortune, when he saw the prosperity of the ungodly. He was resolved to keep (i.e., cause invariably to press) a bridling (cf. on the form, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 30:37",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), or a bridle (capistrum), upon his mouth, so long as he should see the ungodly continuing and sinning in the fulness of his strength, instead of his speedy ruin which one ought to expect. Then he was struck dumb דּוּמיּה, in silence, i.e., as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 62:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Lamentations 3:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in resigned submission, he was silent מטּוב, turned away from (vid., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 28:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 7:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and frequently) prosperity, i.e., from that in which he saw the evil-doer rejoicing; he sought to silence for ever the perplexing contradiction between this prosperity and the righteousness of God. But this self-imposed silence gave intensity to the repressed pain, and this was thereby נעכּר, stirred up, excited, aroused; the inward heat became, in consequence of restrained complaint, all the more intense (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 20:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "): \"and while I was musing a fire was kindled,\" i.e., the thoughts and emotions rubbing against one another produced a blazing fire, viz., of irrepressible vexation, and the end of it was: \"I spake with my tongue,\" unable any longer to keep in my pain. What now follows is not what was said by the poet when in this condition. On the contrary, he turns away from his purpose, which has been proved to be impracticable, to God Himself with the prayer that He would teach him calm submission. ",
        "children": []
      }
    ]
  }
]