[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(12) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "For",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I am",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "a stranger.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—A reminiscence of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 23:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and adopted ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Peter 2:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " from the LXX. (See ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "New Testament Commentary, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 11:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) The psalmist, like the Apostle, applies Abraham’s words metaphorically to this earthly pilgrim age (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Chronicles 29:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and pathetically asks why, when the tenure of life is so uncertain, God looks angrily on him? (For the passionate appeal for a respite, comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 10:20-21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and for the Hebrew conception of the under world, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 6:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Note.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Psalms",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "THE BITTERNESS AND BLESSEDNESS OF THE BREVITY OF LIFEPsalm 39:6",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "THE BITTERNESS AND BLESSEDNESS OF THE BREVITY OF LIFE",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 39:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 39:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " These two sayings are two different ways of putting the same thing. There is a common thought underlying both, but the associations with which that common thought is connected in these two verses are distinctly different. The one is bitter and sad-a gloomy half truth. The other, out of the very same fact, draws blessedness and hope. The one may come from no higher point of view than the level of worldly experience; the other is a truth of faith. The former is at best partial, and without the other may be harmful; the latter completes, explains, and hallows it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And that this progress and variety in the thought is the key to the whole psalm is, I think, obvious to any one who will examine it with care. I cannot here enter on that task but in the hastiest fashion, by way of vindicating the connection which I trace between the two verses of our text. The Psalmist begins, then, with telling how at some time recently passed-in consequence of personal calamity not very clearly defined, but apparently some bodily sickness aggravated by mental sorrow and anxiety-he was struck dumb with silence, so that he ‘held his peace even from good.’ In that state there rose within him many sad and miserable thoughts, which at last forced their way through his locked lips. They shape themselves into a prayer, which is more complaint than petition-and which is absorbed in the contemplation of the manifest melancholy facts of human life-’Thou hast made my days as an handbreadth; and mine age is as nothing before Thee.’ And then, as that thought dilates and sinks deeper into his soul, he looks out upon the whole race of man-and in tones of bitterness and hopelessness, affirms that all are vanity, shadows, disquieted in vain. The blank hopelessness of such a view brings him to a standstill. It is true-but taken alone is too dreadful to think of. ‘That way madness lies,’-so he breaks short off his almost despairing thoughts, and with a swift turning away of his mind from the downward gaze into blackness that was beginning to make him reel, he fixes his eyes on the throne above-’And now, Lord! what wait I for? my hope is in Thee.’ These words form the turning-point of the psalm. After them, the former thoughts are repeated, but with what a difference-made by looking at all the blackness and sorrow, both personal and universal, in the bright light of that hope which streams upon the most lurid masses of opaque cloud, till their gloom begins to glow with an inward lustre, and softens into solemn purples and reds. He had said, ‘I was dumb with silence-even from good.’ But when his hope is in God, the silence changes its character and becomes resignation and submission. ‘I opened not my mouth; because Thou didst it.’ The variety of human life and its transiency is not less plainly seen than before; but in the light of that hope it is regarded in relation to God’s paternal correction, and is seen to be the consequence, not of a defect in His creative wisdom or love, but of man’s sin. ‘Thou with rebukes dost correct man for iniquity.’ That, to him who waits on the Lord, is the reason and the alleviation of the reiterated conviction, ‘Every man is vanity.’ Not any more does he say every man ‘at his best state,’ or, as it might be more accurately expressed, ‘even when most firmly established,’-for the man who is established in the Lord is not vanity, but only the man who founds his being on the fleeting present. Then, things being so, life being thus in itself and apart from God so fleeting and so sad, and yet with a hope that brightens it like sunshine through an April shower-the Psalmist rises to prayer, in which that formerly expressed conviction of the brevity of life is reiterated, with the addition of two words which changes its whole aspect, ‘I am a stranger ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "with Thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".’ He is God’s guest in his transient life. It is short, like the stay of a foreigner in a strange land; but he is under the care of the King of the Land-therefore he need not fear nor sorrow. Past generations, Abraham, Isaac, and Jacob-whose names God ‘is not ashamed’ to appeal to in His own solemn designation of Himself-have held the same relation, and their experience has sealed His faithful care of those who dwell with Him. Therefore, the sadness is soothed, and the vain and fleeting life of earth assumes a new appearance, and the most blessed and wisest issue of our consciousness of frailty and insufficiency is the fixing of our desires and hopes on Him in whose house we may dwell even while we wander to and fro, and in whom our life being rooted and established shall not be vain, howsoever it may be brief.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " If, then, we follow the course of contemplation thus traced in the psalm, we have these three points brought before us-first, the thought of life common to both clauses; second, the gloomy, aimless hollowness which that thought breathes into life apart from God; third, the blessedness which springs from the same thought when we look at it in connection with our Father in heaven.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. Observe the very forcible expression which is given here to the thought of life common to both verses. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. Observe the very forcible expression which is given here to the thought of life common to both verses.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘Every man walketh in a vain show.’ The original is even more striking and strong. And although one does not like altering words so familiar as those of our translation, which have sacredness from association and a melancholy music in their rhythm-still it is worth while to note that the force of the expression which the Psalmist employs is correctly given in the margin, ‘in an image’-or ‘in a shadow.’ The phrase sounds singular to us, but is an instance of a common enough Hebrew idiom, and is equivalent to saying-he walks in the character or likeness of a shadow, or, as we should say, he walks as a shadow. That is to say, the whole outward life and activity of every man is represented as fleeting and unsubstantial, like the reflection of a cloud which darkens leagues of the mountains’ side in a moment, and ere a man can say, ‘Behold!’ is gone again for ever.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Then, look at the other image employed in the other clause of our text to express the same idea, ‘I am a stranger and a sojourner, as all my fathers.’ The phrase has a history. In that most pathetic narrative of an old-world sorrow long since calmed and consoled, when ‘Abraham stood up from before his dead,’ and craved a burying-place for his Sarah from the sons of Heth, his first plea was, ‘I am a stranger and a sojourner with you.’ In his lips it was no metaphor. He was a stranger, a visitor for a brief time to an alien land; he was a sojourner, having no rights of inheritance, but settled among them for a while, and though dwelling among them, not adopted into their community. He was a foreigner, not naturalised. And such is our relation to all this visible frame of things in which we dwell. It is alien to us; though we be in it, our true affinities are elsewhere; though we be in it, our stay is brief, as that of ‘a wayfaring man that turns aside to tarry for a night.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And there is given in the context still another metaphor setting forth the same fact in that dreary generalisation which precedes my text, ‘Every man at his best state’-or as the word means, ‘established,’- with his roots most firmly struck in the material and visible-’is only a breath.’ It appears for a moment, curling from lip and nostril into the cold morning air, and vanishes away, so thus vaporous, filmy, is the seeming solid fact of the most stable life.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " These have been the commonplaces of poets and rhetoricians and moralists in all time. But threadbare as the thought is, I may venture to dwell on it for a moment. I know I am only repeating what we all believe-and all forget. It is never too late to preach commonplaces, until everybody acts on them as well as admits them-and this old familiar truth has not yet got so wrought into the structure of our lives that we can afford to say no more about it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘Surely every man walketh in a shadow.’ Did you ever stand upon the shore on some day of that ‘uncertain weather, when gloom and glory meet together,’ and notice how swiftly there went, racing over miles of billows, a darkening that quenched all the play of colour in the waves, as if all suddenly the angel of the waters had spread his broad wings between sun and sea, and then how in another moment as swiftly it flits away, and with a burst the light blazes out again, and leagues of ocean flash into green and violet and blue. So fleeting, so utterly perishable are our lives for all their seeming solid permanency. ‘Shadows in a career, as George Herbert has it-breath going out of the nostrils. We think of ourselves as ever to continue in our present posture. We are deceived by illusions. Mental indolence, a secret dislike of the thought, and the impostures of sense, all conspire to make us blind to, or at least oblivious of, the plain fact which every beat of our pulses might preach, and the slow creeping hands of every parish clock confirm. How awful that silent, unceasing footfall of receding days is when once we begin to watch it! Inexorable, passionless-though hope and fear may pray, ‘Sun! stand thou still on Gibeon; and thou moon! in the valley of Ajalon,’-the tramp of the hours goes on. The poets paint them as a linked chorus of rosy forms, garlanded, and clasping hands as they dance onwards. So they may be to some of us at some moments. So they may seem as they approach; but those who come hold the hands of those who go, and that troop has no rosy light upon their limbs, their garlands are faded, the sunshine falls not upon the grey and shrouded shapes, as they steal ghostlike through the gloom-and ever and ever the bright and laughing sisters pass on into that funereal band which grows and moves away from us unceasing. Alas! for many of us it bears away with it our lost treasures, our shattered hopes, our joys from which all the bright petals have dropped! Alas! for many of us there is nothing but sorrow in watching how all things become ‘part and parcel of the dreadful past.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And how strangely sometimes even a material association may give new emphasis to that old threadbare truth. Some more permanent ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thing",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " may help us to feel more profoundly the shadowy fleetness of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "man",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The trifles are so much more lasting than their owners. Or, as ‘the Preacher’ puts it, with such wailing pathos, ‘One generation passeth away, and another generation cometh, but the earth abideth for ever.’ This material is perishable-but yet how much more enduring than we are! The pavements we walk upon, the coals in our grates-how many millenniums old are they? The pebble you kick aside with your foot-how many generations will it outlast? Go into a museum and you will see hanging there, little the worse for centuries, battered shields, notched swords, and gaping helmets-aye, but what has become of the bright eyes that once flashed the light of battle through the bars, what has become of the strong hands that once gripped the hilts? ‘The knights are dust,’ and ‘their good swords are’ ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "not",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘rust.’ The material lasts after its owner. Seed corn is found in a mummy case. The poor form beneath the painted lid is brown and hard, and more than half of it gone to pungent powder, and the man that once lived has faded utterly: but the handful of seed has its mysterious life in it, and when it is sown, in due time the green blade pushes above English soil, as it would have done under the shadow of the pyramids four thousand years ago-and its produce waves in a hundred harvest fields to-day. The money in your purses now, will some of it bear the head of a king that died half a century ago. It is bright and useful-where are all the people that in turn said they ‘owned’ it? Other men will live in our houses, will preach from this pulpit, and sit in these pews, when you and I are far away. And other June days will come, and the old rose-trees will flower round houses where unborn men will then be living, when the present possessor is gone to nourish the roots of the roses in the graveyard!",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘Our days are as a shadow, and there is none abiding.’ So said David on other occasions. We know, dear brethren! how true it is, whether we consider the ceaseless flux and change of things, the mystic march of the silent-footed hours, or the greater permanence which attaches to the ‘things which perish,’ than to our abode among them. We know it, and yet how hard it is not to yield to the inducement to act and feel as if all this painted scenery were solid rock and mountain. By our own inconsiderateness and sensuousness, we live in a lie, in a false dream of permanence, and so in a sadder sense we walk in ‘a vain show,’-deluding ourselves with the conceit of durability, and refusing to see that the apparent is the shadowy, and the one enduring reality God. It is hard to get even the general conviction vivified in men’s minds, hardest of all to get any man to reflect upon it as applying to himself. Do not think that you have said enough to vindicate neglect of my words now, when you call them commonplace. So they are. But did you ever take that well-worn old story, and press it on your own consciousness-as a man might press a common little plant, whose juice is healing, against his dim eye-ball-by saying to yourself, ‘It is true of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " walk as a shadow. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " am gliding onwards to my doom. Through ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "my",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " slack hands the golden sands are flowing, and soon ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "my",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " hour-glass will run out, and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " shall have to stop and go away.’ Let me beseech you for one half-hour’s meditation on that fact before this day closes. You will forget my words then, when with your own eyes you have looked upon that truth, and felt that it is not merely a toothless commonplace, but belongs to and works in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " life, as it ebbs away silently and incessantly from ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. Let me point, in the second place, to the gloomy, aimless hollowness which that thought, apart from God, infuses into life. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. Let me point, in the second place, to the gloomy, aimless hollowness which that thought, apart from God, infuses into life.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "There is, no doubt, a double idea in the metaphor which the Psalmist employs. He desires to set forth, by his image of a shadow, not only the transiency, but the unsubstantialness of life. Shadow is opposed to substance, to that which is real, as well as to that which is enduring. And we may further say that the one of these characteristics is in great part the occasion of the other. Because life is fleeting, therefore, in part, it is so hollow and unsatisfying. The fact that men are dragged away from their pursuits so inexorably makes these pursuits seem, to any one who cannot see beyond that fact, trivial and not worth the following. Why should we fret and toil and break our hearts, ‘and scorn delights, and live laborious days’ for purposes which will last so short a time, and things which we shall so soon have to leave? What is all our bustle and business, when the sad light of that thought falls on it, but ‘labouring for the wind’? ‘Were it not better to lie still?’ Such thoughts have at least a partial truth in them, and are difficult to meet as long as we think only of the facts and results of man’s life that we can see with our eyes, and our psalm gives emphatic utterance to them. The word rendered ‘walketh’ in our text is not merely a synonym for passing through life, but has a very striking meaning. It is an intensive frequentative form of the word-that is, it represents the action as being repeated over and over again. For instance, it might be used to describe the restless motion of a wild beast in a cage, raging from side to side, never still, and never getting any farther for all the racing backward and forward. So here it signifies ‘walketh to and fro,’ and implies hurry and bustle, continuous effort, habitual unrest. It thus comes to be parallel with the stronger words which follow,- ‘Surely they are ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "disquieted",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in vain’; and one reason why all this effort and agitation are purposeless and sad, is because the man who is straining his nerves and wearying his legs is but a shadow in regard to duration-’He heapeth up riches, and knoweth not who shall gather them.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Yes! if we have said all, when we have said that men pass as a fleeting shadow-if my life has no roots in the Eternal, nor any consciousness of a life that does not pass, and a light that never perishes, if it is derived from, directed to, ‘cribbed, cabined, and confined’ within this visible diurnal sphere, then it is all flat and unprofitable, an illusion while it seems to last, and all its pursuits are folly, its hopes dreams, its substances vapours, its years a lie. For, if life be thus short, I who live it am conscious of, and possess whether I be conscious of them or no, capacities and requirements which, though they were to be annihilated to-morrow, could be satisfied while they lasted by nothing short of the absolute ideal, the all-perfect, the infinite-or, to put away abstractions, ‘My soul thirsteth for God, the living God!’ ‘He hath put eternity in their heart,’ as the book of Ecclesiastes says. Longings and aspirations, weaknesses and woes, the limits of creature helps and loves, the disproportion between us and the objects around us-all these facts of familiar experience do witness, alike by blank misgivings and by bright hopes, by many disappointments and by indestructible expectations surviving them all, that nothing which has a date, a beginning, or an end, can fill our souls or give us rest. Can you fill up the swamps of the Mississippi with any cartloads of faggots you can fling in? Can you fill your souls with anything which belongs to this fleeting life? Has a flying shadow an appreciable thickness, or will a million of them pressed together occupy a space in your empty, hungry heart?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And so, dear brethren! I come to you with a message which may sound gloomy, and beseech you to give heed to it. No matter how you may get on in the world-though you may fulfil every dream with which you began in your youth-you will certainly find that without Christ for your Brother and Saviour, God for your Friend, and heaven for your hope, life, with all its fulness, is empty. It lasts long, too long as it sometimes seems for work, too long for hope, too long for endurance; long enough to let love die, and joys wither and fade, and companions drop away, but without God and Christ, you will find it but ‘as a watch in the night.’ At no moment through the long weary years will it satisfy your whole being; and when the weary years are all past, they will seem to have been but as one troubled moment breaking the eternal silence. At every point ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "so",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " profitless, and all the points making so thin and short a line! The crested waves seem heaped together as they recede from the eye till they reach the horizon, where miles of storm are seen but as a line of spray. So when a man looks back upon his life, if it have been a godless one, be sure of this, that he will have a dark and cheerless retrospect over a tossing waste, with a white rim of wandering barren foam vexed by tempest, and then, if not before, he will sadly learn how he has been living amidst shadows, and, with a nature that needs God, has wasted himself upon the world. ‘O life! as futile then as frail’; ‘surely,’ in such a case, ‘every man walketh in a vain show.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. But note, finally, how our other text in its significant words gives us the blessedness which springs from this same thought of life, when it is looked at in connection with God. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. But note, finally, how our other text in its significant words gives us the blessedness which springs from this same thought of life, when it is looked at in connection with God.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The mere conviction of the brevity and hollowness of life is not in itself a religious or a helpful thought. Its power depends upon the other ideas which are associated with it. It is susceptible of the most opposite applications, and may tend to impel conduct in exactly opposite directions. It may be the language of despair or of bright hope. It may be the bitter creed of a worn-out debauchee, who has wasted his life in hunting shadows, and is left with a cynical spirit and a barbed tongue. It may be the passionless belief of a retired student, or the fanatical faith of a religious ascetic. It may be an argument for sensuous excess, ‘Let us eat and drink, for to-morrow we die’; or it may be the stimulus for noble and holy living, ‘I must work the works of Him that sent me while it is day. The night cometh.’ The other accompanying beliefs determine whether it shall be a blight or a blessing to a man.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And the one addition which is needed to incline the whole weight of that conviction to the better side, and to light up all its blackness, is that little phrase in this text, ‘I am a stranger ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "with Thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and a sojourner.’ There seems to be an allusion here to remarkable words connected with the singular Jewish institution of the Jubilee. You remember that by the Mosaic law, there was no absolute sale of land in Israel, but that every half century the whole returned to the descendants of the original occupiers. Important economical and social purposes were contemplated in this arrangement, as well as the preservation of the relative position of the tribes as settled at the Conquest. But the law itself assigns a purely religious purpose-the preservation of the distinct consciousness of the tenure on which the people held their territory, namely, obedience to and dependence on God. ‘The land shall not be sold for ever, for the land is Mine, for ye are ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "strangers and sojourners with Me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".’ Of course, there was a special sense in which that was true with regard to Israel, but David thought that the words were as true in regard to his whole relation to God, as in regard to Israel’s possession of its national inheritance.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " If we grasp these words as completing all that we have already said, how different this transient and unsubstantial life looks! You must have the light from both sides to stereoscope and make solid the flat surface picture. Transient! yes-but it is passed in the presence of God. Whether we know it or no, our brief days hang upon Him, and we walk, all of us, in the light of His countenance. That makes the transient eternal, the shadowy substantial, the trivial heavy with solemn meaning and awful yet vast possibilities. ‘In our embers is something that doth live.’ If we had said all, when we say ‘We are as a shadow,’ it would matter very little, though even then it ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "would",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " matter something, how we spent our shadowy days; but if these poor brief hours are spent ‘in the great Taskmaster’s eye,’-if the shadow cast on earth proclaims a light in the heavens-if from this point there hangs an unending chain of conscious being-Oh! then, with what awful solemnity is the brevity, with what tremendous magnitude is the minuteness, of our earthly days invested! ‘With Thee’-then I am constantly in the presence of a sovereign Law and its Giver; ‘with Thee’-then all my actions are registered and weighed yonder; ‘with Thee’-then ‘Thou, God, seest me.’ Brethren! it is the prismatic halo and ring of eternity round this poor glass of time that gives it all its dignity, all its meaning. The lives that are lived before God cannot be trifles.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And if this relation to time be recognised and accepted and held fast by our hearts and minds, then what calm blessedness will flow into our souls!",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘A stranger with Thee,’-then we are the guests of the King. The Lord of the land charges Himself with our protection and provision; we journey under His safe conduct. It is for His honour and faithfulness that no harm shall come to us travelling in His territory, and relying on His word. Like Abraham with the sons of Heth, we may claim the protection and help which a stranger needs. He recognises the bond and will fulfil it. We have eaten of His salt, and He will answer for our safety.-’He that toucheth you toucheth the apple of Mine eye.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘A stranger with Thee,’-then we have a constant Companion and an abiding Presence. We may be solitary and necessarily remote from the polity of the land. We may feel amid all the visible things of earth as if foreigners. We may not have a foot of soil, not even a grave for our dead. Companionships may dissolve and warm hands grow cold and their close clasp relax-what then? He is with us still. He will join us as we journey, even when our hearts are sore with loss. He will walk with us by the way, and make our chill hearts glow. He will sit with us at the table-however humble the meal, and He will not leave us when we discern Him. Strangers we are indeed here-but not solitary, for we are ‘strangers with Thee.’ As in some ancestral home in which a family has lived for centuries-son after father has rested in its great chambers, and been safe behind its strong walls-so, age after age, they who love Him abide in God.-’Thou hast been our dwelling-place in all generations.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘Strangers with Thee,’-then we may carry our thoughts forward to the time when we shall go to our true home, nor wander any longer in a land that is not ours. If even here we come into such blessed relationships with God, that fact is in itself a prophecy of a more perfect communion and a heavenly house. They who are strangers with Him will one day be ‘at home with the Lord,’ and in the light of that blessed hope the transiency of this life changes its whole aspect, loses the last trace of sadness, and becomes a solemn joy. Why should we be pensive and wistful when we think how near our end is? Is the sentry sad as the hour for relieving guard comes nigh? Is the wanderer in far-off lands sad when he turns his face homewards? And why should not we rejoice at the thought that we, strangers and foreigners here, shall soon depart to the true metropolis, the mother-country of our souls? I do not know why a man should be either regretful or afraid, as he watches the hungry sea eating away this ‘bank and shoal of time’ upon which he stands-even though the tide has all but reached his feet-if he knows that God’s strong hand will be stretched forth to him at the moment when the sand dissolves from under him, and will draw him out of many waters, and place him high above the floods in that stable land where there is ‘no more sea.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Lives rooted in God through faith in Jesus Christ are not vanity. Let us lay hold of Him with a loving grasp-and ‘we shall live also’ ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "because",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " He lives, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "as",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " He lives, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "so long",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as He lives. The brief days of earth will be blessed while they last, and fruitful of what shall never pass. We shall have Him with us while we journey, and all our journeyings will lead to rest in Him. True, men walk in a vain show; true, ‘the world passeth away and the lust thereof,’ but, blessed be God! true, also, ‘He that doeth the will of God abideth for ever.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 39:12",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 39:12",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Hold not thy peace at my tears — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Joined with my prayers. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For I am a stranger, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — Though I be not only a native, but actually king of this land, yet, in truth, I am but a stranger and sojourner, both in regard of my very uncertain and short continuance here, where I am only on my journey to my real and long home; and in respect of the many wants, hardships, contempts, and injuries to which I am exposed, as men usually are in strange lands. And, therefore, I greatly need and desire thy pity and help. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "With thee — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Either, 1st, In thy sight or judgment, and therefore in reality. We are apt to flatter ourselves that we are settled inhabitants, and can hardly believe we are but strangers on earth, but thou knowest the truth of the matter, that we really are such. Or, 2d, In thy land, or territory, who art the only proprietor of it, in which I only sojourn by thy leave and favour, and during thy pleasure, as is expressed ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 25:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", whence these words are taken. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "As all my fathers were — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Both in thy judgment and in their own, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 11:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", upon which account thou didst take special care of them, and, therefore, take care also of me.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "39:7-13 There is no solid satisfaction to be had in the creature; but it is to be found in the Lord, and in communion with him; to him we should be driven by our disappointments. If the world be nothing but vanity, may God deliver us from having or seeking our portion in it. When creature-confidences fail, it is our comfort that we have a God to go to, a God to trust in. We may see a good God doing all, and ordering all events concerning us; and a good man, for that reason, says nothing against it. He desires the pardoning of his sin, and the preventing of his shame. We must both watch and pray against sin. When under the correcting hand of the Lord, we must look to God himself for relief, not to any other. Our ways and our doings bring us into trouble, and we are beaten with a rod of our own making. What a poor thing is beauty! and what fools are those that are proud of it, when it will certainly, and may quickly, be consumed! The body of man is as a garment to the soul. In this garment sin has lodged a moth, which wears away, first the beauty, then the strength, and finally the substance of its parts. Whoever has watched the progress of a lingering distemper, or the work of time alone, in the human frame, will feel at once the force of this comparison, and that, surely every man is vanity. Afflictions are sent to stir up prayer. If they have that effect, we may hope that God will hear our prayer. The believer expects weariness and ill treatment on his way to heaven; but he shall not stay here long : walking with God by faith, he goes forward on his journey, not diverted from his course, nor cast down by the difficulties he meets. How blessed it is to sit loose from things here below, that while going home to our Father's house, we may use the world as not abusing it! May we always look for that city, whose Builder and Maker is God.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Hear my prayer, O Lord, and give ear unto my cry - That is, in view of my affliction and my sins; in view, also, of the perplexing questions which have agitated my bosom; the troublous thoughts which passed through my soul, which I did not dare to express before man ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 39:1-2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but which I have now expressed before thee.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Hold not thy peace - Be not silent. Do not refuse to answer me; to speak peace to me.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "At my tears - Or rather, at my weeping; as if God heard the voice of his weeping. Weeping, if uncomplaining, is of the nature of prayer, for God regards the sorrows of the soul as he sees them. The weeping penitent, the weeping sufferer, is one on whom we may suppose God looks with compassion, even though the sorrows of the soul do not find \"words\" to give utterance to them. Compare the notes at Job 16:20. See also Romans 8:26,",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "At my tears - Or rather, at my weeping; as if God heard the voice of his weeping. Weeping, if uncomplaining, is of the nature of prayer, for God regards the sorrows of the soul as he sees them. The weeping penitent, the weeping sufferer, is one on whom we may suppose God looks with compassion, even though the sorrows of the soul do not find \"words\" to give utterance to them. Compare the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 16:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". See also ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 8:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "For I am a stranger - The word used - גר  gêr - means properly a sojourner; a foreigner; a man living out of his own country: Genesis 15:13; Exodus 2:22. It refers to a man who has no permanent home in the place or country where he now is; and it is used here as implying that, in the estimation of the psalmist himself, he had no permanent abode on earth. He was in a strange or foreign land. He was passing to a permanent home; and he prays that God would be merciful to him as to a man who has no home - no permanent abiding place - on earth. Compare the notes at Hebrews 11:13; notes at 1 Peter 2:11.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "For I am a stranger - The word used - גר  gêr - means properly a sojourner; a foreigner; a man living out of his own country: ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 15:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 2:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". It refers to a man who has no permanent home in the place or country where he now is; and it is used here as implying that, in the estimation of the psalmist himself, he had no permanent abode on earth. He was in a strange or foreign land. He was passing to a permanent home; and he prays that God would be merciful to him as to a man who has no home - no permanent abiding place - on earth. Compare the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 11:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Peter 2:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And a sojourner - This word has substantially the same signification. It denotes one living in another country, without the rights of a citizen.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "As all my fathers were - All my ancestors. The allusion is doubtless derived from the fact that the patriarchs Abraham, Isaac, and Jacob thus lived as men who had no permanent home here - who had no possession of soil in the countries where they sojourned - and whose whole life, therefore, was an illustration of the fact that they were \"on a journey\" - a journey to another world. 1 Chronicles 29:15 - \"for we are strangers before thee, and sojourners, as were all our fathers; our days on the earth are as a shadow, and there is none abiding.\" Compare the notes at Hebrews 11:13-15. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "As all my fathers were - All my ancestors. The allusion is doubtless derived from the fact that the patriarchs Abraham, Isaac, and Jacob thus lived as men who had no permanent home here - who had no possession of soil in the countries where they sojourned - and whose whole life, therefore, was an illustration of the fact that they were \"on a journey\" - a journey to another world. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 29:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " - \"for we are strangers before thee, and sojourners, as were all our fathers; our days on the earth are as a shadow, and there is none abiding.\" Compare the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 11:13-15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12, 13. Consonant with the tenor of the Psalm, he prays for God's compassionate regard to him as a stranger here; and that, as such was the condition of his fathers, so, like them, he may be cheered instead of being bound under wrath and chastened in displeasure.   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "At my tears, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " joined with my prayers, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Hebrews 5:7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 5:7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I am a stranger:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " though I be not only a native, but either anointed or actually king of this land; yet in truth I am but a stranger, both in regard of my very uncertain and short continuance here, where I am only in my journey or passage to my real and long home, which is in the other world; and in respect of the many wants, and hardships, and contempts, and injuries to which I am exposed, as men usually are in strange lands. And therefore I greatly need and desire thy pity and help, O thou who art the patron of strangers, whom thou hast commended to our care and kindness, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Exodus 12:48 Leviticus 19:33 25:35",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 12:48",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 19:33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 25:35",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "With thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; either, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. In thy sight or judgment, and therefore truly. We are apt to flatter ourselves, and can hardly believe that we are but strangers here, where we seem to have settled habitations; and possessions, but thou knowest the truth of the business, that we are really such. Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. In thy land or territory, in which I sojourn only by thy leave and favour, and during thy pleasure, as this whole phrase is used, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Leviticus 25:23",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 25:23",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", whence these words are taken, as also ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Leviticus 25:35 36,39,40,45,47",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 25:35",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 36,39,40,45,47",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", where that branch of it, with thee, is so meant. And withal this phrase, both here and ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Leviticus 25:23",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 25:23",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", may have a further emphasis in it, implying that every Israelite, and particularly David himself, in respect of men, were the proprietors or owners of their portions, of which no other man might deprive or dispossess them, and therefore David’s enemies had done wrongfully in banishing him from his and from the Lord’s inheritance; but yet in respect of God they were but strangers, and God was the only Proprietor of it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "As all my fathers were; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " both in thy judgment, expressed ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Leviticus 25:23",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 25:23",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and in their own opinion, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Hebrews 11:13",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 11:13",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c; upon which account thou didst take a special care of them, and therefore do so to me also. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Hear my prayer, O Lord,.... Which was, that he would remove the affliction from him that lay so hard and heavy upon him; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and give ear unto my cry; which shows the distress he was in, and the vehemency with which he put up his petition to the Lord; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "hold not thy peace at my tears; which were shed in great plenty, through the violence of the affliction, and in his fervent prayers to God; see Hebrews 5:7; ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "hold not thy peace at my tears; which were shed in great plenty, through the violence of the affliction, and in his fervent prayers to God; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 5:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "for I am a stranger with thee; not to God, to Christ, to the Spirit, to the saints, to himself, and the plague of his own heart, or to the devices of Satan; but in the world, and to the men of it; being unknown to them, and behaving as a stranger among them; all which was known to God, and may be the meaning of the phrase \"with thee\"; or reference may be had to the land of Canaan, in which David dwelt, and which was the Lord's, and in which the Israelites dwelt as strangers and sojourners with him, Leviticus 25:23; as it follows here; ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "for I am a stranger with thee; not to God, to Christ, to the Spirit, to the saints, to himself, and the plague of his own heart, or to the devices of Satan; but in the world, and to the men of it; being unknown to them, and behaving as a stranger among them; all which was known to God, and may be the meaning of the phrase \"with thee\"; or reference may be had to the land of Canaan, in which David dwelt, and which was the Lord's, and in which the Israelites dwelt as strangers and sojourners with him, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 25:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; as it follows here; ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and a sojourner, as all my fathers were; meaning Abraham, Isaac, and Jacob, and their posterity; see Genesis 23:4; as are all the people of God in this world: this is not their native place; they belong to another and better country; their citizenship is in heaven; their Father's house is there, and there is their inheritance, which they have a right unto, and a meetness for: they have no settlement here; nor is their rest and satisfaction in the things of this world: they reckon themselves, while here, as not at home, but in a foreign land; and this the psalmist mentions, to engage the Lord to regard his prayers, since he has so often expressed a concern for the strangers and sojourners in the land of Israel. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and a sojourner, as all my fathers were; meaning Abraham, Isaac, and Jacob, and their posterity; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 23:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; as are all the people of God in this world: this is not their native place; they belong to another and better country; their citizenship is in heaven; their Father's house is there, and there is their inheritance, which they have a right unto, and a meetness for: they have no settlement here; nor is their rest and satisfaction in the things of this world: they reckon themselves, while here, as not at home, but in a foreign land; and this the psalmist mentions, to engage the Lord to regard his prayers, since he has so often expressed a concern for the strangers and sojourners in the land of Israel. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Hear my prayer, O LORD, and give ear unto my cry; hold not thy peace at my tears: for I am a stranger with thee, and a sojourner, as all my fathers were.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "hold not thy peace",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Restoration to health will be an answer. But the word may be rendered, as in R.V. of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 28:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "be not deaf",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". So Jerome, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ne obsurdescas",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "It is a Rabbinic saying that there are three kinds of supplication, each superior to the other; prayer, crying, and tears. Prayer is made in silence, crying with a loud voice, but tears surpass all. “There is no door, through which tears do not pass,” and, “The gates of tears are never locked.” Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 5:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a stranger with thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a sojourner",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Omit ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ‘Stranger’ and ‘sojourner’ were the technical terms for aliens residing in a country to which they did not belong, and where they had no natural rights of citizenship (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 23:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The words suggest the idea of a temporary residence, dependent on the good-will of the actual owners. The Israelites were taught to regard themselves as ‘strangers and sojourners’ in the land of Canaan, which belonged to Jehovah (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 25:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "): and here the idea is extended to man in general. The earth is God’s, and man is His tenant upon it (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 119:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). This being so, the Psalmist appeals for a hearing on the ground that he is but a temporary resident on the earth (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 47:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), God’s guest for a while only in the upper world, where alone His Presence can be enjoyed. And further, as the strangers and sojourners among them were specially commended to the care of Israel (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 22:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; &c.), he would plead to be treated by God with a corresponding clemency.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The words are placed in David’s mouth by the Chronicler (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 29:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and applied by St Peter (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Peter 2:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") to the Christian’s position in the world, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "παρακαλῶ ὡς παροίκους καὶ παρεπιδήμους",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the words used in the LXX here. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 11:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "as all my fathers",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Cp. Elijah’s words, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 19:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 12.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Hear my prayer, O Lord, and give ear unto my cry; hold not thy peace at my tears",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Tears appeal to the Divine pity in an especial way. \"Weep not!\" said our Lord to the widow woman at Nain; and to Mary Magdalene, \"Why weepest thou?\" He himself offered up his supplications with strong crying and tears\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 5:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); and so his faithful servants (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 16:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 6:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 42:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 56:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 16:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 38:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 15:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; Lain. 2:11; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 7:38",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 20:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Hezekiah's tears especially moved God to pity him (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 20:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "For I am a stranger with thee, and a sojourner",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"Here we have no continuing city\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 13:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), but are \"strangers and pilgrims on the earth\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 11:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Hence, being so weak and dependent, we may the more confidently claim God's pity. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "As all my fathers",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " were (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 25:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"The  land is ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "mine",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ye are ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "strangers and sojourners with",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " me \"). Psalm 39:12",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(Heb.: 39:13-14) Finally, the poet renews the prayer for an alleviation of his sufferings, basing it upon the shortness of the earthly pilgrimage. The urgent שׁמעה is here fuller toned, being שׁמעה.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: So Heidenheim and Baer, following Abulwald, Efodi, and Mose ha-Nakdan. The Masoretic observation לית קמץ חטף, \"only here with Kametzchateph,\" is found appended in codices. This Chatephkametz is euphonic, as in לקחה, Genesis 2:23, and in many other instances that are obliterated in our editions, vid., Abulwald, חרקמה ס, p. 198, where even מטּהרו  equals  מטּהרו, Psalm 89:45, is cited among these examples (Ges. 10, 2rem.).)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: So Heidenheim and Baer, following Abulwald, Efodi, and Mose ha-Nakdan. The Masoretic observation לית קמץ חטף, \"only here with Kametzchateph,\" is found appended in codices. This Chatephkametz is euphonic, as in לקחה, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 2:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and in many other instances that are obliterated in our editions, vid., Abulwald, חרקמה ס, p. 198, where even מטּהרו  equals  מטּהרו, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 89:45",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", is cited among these examples (Ges. 10, 2rem.).)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Side by side with the language of prayer, tears even appear here as prayer that is intelligible to God; for when the gates of prayer seem to be closed, the gates of tears still remain unclosed (שׁערי דמעות לא ננעלו), B. Berachoth 32b. As a reason for his being heard, David appeals to the instability and finite character of this earthly life in language which we also hear from his own lips in 1 Chronicles 29:15. גּר is the stranger who travels about and sojourns as a guest in a country that is not his native land; תּושׁב is a sojourner, or one enjoying the protection of the laws, who, without possessing any hereditary title, has settled down there, and to whom a settlement is allotted by sufferance. The earth is God's; that which may be said of the Holy Land (Leviticus 25:23) may be said of the whole earth; man has no right upon it, he only remains there so long as God permits him. כּכל־אבותי glances back even to the patriarchs (Genesis 47:9, cf. Psalm 23:4). Israel is, it is true, at the present time in possession of a fixed dwelling-place, but only as the gift of his God, and for each individual it is only during his life, which is but a handbreadth long. May Jahve, then - so David prays - turn away His look of wrath from him, in order that he may shine forth, become cheerful or clear up, before he goes hence and it is too late. השׁע is imper. apoc. Hiph. for השׁעה (in the signification of Kal), and ought, according to the form הרב, properly to be השׁע; it is, however, pointed just like the imper. Hiph. of שׁעע in Isaiah 6:10, without any necessity for explaining it as meaning obline (oculos tuos)  equals  connive (Abulwald), which would be an expression unworthy of God. It is on the contrary to be rendered: look away from me; on which compare Job 7:19; Job 14:6; on אבליגה cf. ib. Job 10:20; Job 9:27; on אלך בּטרם, ib.Job 10:21; on ואיננּי, ib. Job 7:8, Job 7:21. The close of the Psalm, consequently, is re-echoed in many ways in the Book of Job The Book of Job is occupied with the same riddle as that with which this Psalm is occupied. But in the solution of it, it advances a step further. David does not know how to disassociate in his mind sin and suffering, and wrath and suffering. The Book of Job, on the contrary, thinks of suffering and love together; and in the truth that suffering also, even though it be unto death, must serve the highest interests of those who love God, it possesses a satisfactory solution. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Side by side with the language of prayer, tears even appear here as prayer that is intelligible to God; for when the gates of prayer seem to be closed, the gates of tears still remain unclosed (שׁערי דמעות לא ננעלו), B. Berachoth 32b. As a reason for his being heard, David appeals to the instability and finite character of this earthly life in language which we also hear from his own lips in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 29:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". גּר is the stranger who travels about and sojourns as a guest in a country that is not his native land; תּושׁב is a sojourner, or one enjoying the protection of the laws, who, without possessing any hereditary title, has settled down there, and to whom a settlement is allotted by sufferance. The earth is God's; that which may be said of the Holy Land (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 25:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") may be said of the whole earth; man has no right upon it, he only remains there so long as God permits him. כּכל־אבותי glances back even to the patriarchs (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 47:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 23:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Israel is, it is true, at the present time in possession of a fixed dwelling-place, but only as the gift of his God, and for each individual it is only during his life, which is but a handbreadth long. May Jahve, then - so David prays - turn away His look of wrath from him, in order that he may shine forth, become cheerful or clear up, before he goes hence and it is too late. השׁע is imper. apoc. Hiph. for השׁעה (in the signification of Kal), and ought, according to the form הרב, properly to be השׁע; it is, however, pointed just like the imper. Hiph. of שׁעע in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 6:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", without any necessity for explaining it as meaning obline (oculos tuos)  equals  connive (Abulwald), which would be an expression unworthy of God. It is on the contrary to be rendered: look away from me; on which compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 7:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 14:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; on אבליגה cf. ib. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 10:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 9:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; on אלך בּטרם, ib.Job 10:21; on ואיננּי, ib. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 7:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 7:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The close of the Psalm, consequently, is re-echoed in many ways in the Book of Job The Book of Job is occupied with the same riddle as that with which this Psalm is occupied. But in the solution of it, it advances a step further. David does not know how to disassociate in his mind sin and suffering, and wrath and suffering. The Book of Job, on the contrary, thinks of suffering and love together; and in the truth that suffering also, even though it be unto death, must serve the highest interests of those who love God, it possesses a satisfactory solution. ",
            "children": []
          }
        ]
      }
    ]
  }
]