[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(1) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The conjunction is wanting in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 14:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Iniquity.—Instead of the general term, “doings,” in Psalms 14, as if the adapter of the Psalm felt that a word applicable to good as well as evil was not strong enough to express the hideousness of the profanity.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Iniquity.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Instead of the general term, “doings,” in Psalms 14, as if the adapter of the Psalm felt that a word applicable to good as well as evil was not strong enough to express the hideousness of the profanity.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "53:1-6 The corruption of man by nature. - This psalm is almost the same as the 14th. The scope of it is to convince us of our sins. God, by the psalmist, here shows us how bad we are, and proves this by his own certain knowledge. He speaks terror to persecutors, the worst of sinners. He speaks encouragement to God's persecuted people. How comes it that men are so bad? Because there is no fear of God before their eyes. Men's bad practices flow from their bad principles; if they profess to know God, yet in works, because in thoughts, they deny him. See the folly of sin; he is a fool, in the account of God, whose judgment we are sure is right, that harbours such corrupt thoughts. And see the fruit of sin; to what it brings men, when their hearts are hardened through the deceitfulness of sin. See also the faith of the saints, and their hope and power as to the cure of this great evil. There will come a Saviour, a great salvation, a salvation from sin. God will save his church from its enemies. He will save all believers from their own sins, that they may not be led captive by them, which will be everlasting joy to them. From this work the Redeemer had his name JESUS, for he shall save his people from their sins, Mt 1:21.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The fool hath said in his heart ... - For the meaning of this verse, see the notes at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 14:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The only change in this verse - a change which does not affect the sense - is the substitution of the word \"iniquity,\" in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 53:1-6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", for \"works,\" in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 14:1-7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "PSALM 53",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ps 53:1-6. Upon Mahalath—(See on [595]Ps 88:1, title). Why this repetition of the fourteenth Psalm is given we do not know.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1-4. with few verbal changes, correspond with Ps 14:1-4.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "1-4. with few verbal changes, correspond with Ps 14:1-4.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "The Treasury of David",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1 The fool hath said in his heart, There is no God. Corrupt are they, and have done abominable iniquity: there is none that doeth good.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "2 God looked down from heaven upon the children of men, to see if there were any that did understand, that did seek God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "3 Every one of them is gone back: they are altogether become filthy; there is none that doeth good, no, not one.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "4 Have the workers of iniquity no knowledge? who eat up my people as they eat bread: they have not called upon God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "5 There were they in great fear, where no fear was: for God hath scattered the bones of him that encampeth against thee: thou hast put them to shame, because God hath despised them.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "6 Oh that the salvation of Israel were come out of Zion! When God bringeth back the captivity of his people, Jacob shall rejoice, and Israel shall be glad.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 53:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 53:1",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"The fool hath said in his heart, There is no God.\" And this he does because he is a fool. Being a fool he speaks according to his nature; being a great fool he meddles with a great subject, and comes to a wild conclusion. The atheist is, morally, as well as mentally, a fool, a fool in the heart as well as in the head; a fool in morals as well as in philosophy. With the denial of God as a starting point, we may well conclude that the fool's progress is a rapid, riotous, raving, ruinous one. He who begins at impiety is ready for anything. \"No God,\" being interpreted, means no law, no order, no restraint to lust, no limit to passion. Who but a fool would be of this mind? What a Bedlam, or rather what an Aceldama, would the world become if such lawless principles came to be universal! He who heartily entertains an irreligious spirit, and follows it out to its legitimate issues is a son of Belial, dangerous to the commonwealth, irrational and despicable. Every natural man, is, more or less a denier of God. Practical atheism is the religion of the race. \"Corrupt are they.\" They are rotten. It is idle to compliment them as sincere doubters, and amiable thinkers - they are putrid. There is too much dainty dealing nowadays with atheism; it is not a harmless error, it is an offensive, putrid sin, and righteous men should look upon it in that light. All men being more or less atheistic in spirit, are also in that degree corrupt; their heart is foul, their moral nature is decayed. \"And have done abominable iniquity.\" Bad principles soon lead to bad lives. One does not find virtue promoted by the example of your Voltaires and Tom Paines. Those who talk so abominably as to deny their Maker will act abominably when it serves their turn. It is the abounding denial and forgetfulness of God among men which is the source of the unrighteousness and crime which we see around us. If all men are not outwardly vicious it is to be accounted for by the power of other and better principles, but left to itself the \"No God\" spirit so universal in mankind would produce nothing but the most loathsome actions. - \"There is none that doeth good.\" The one typical fool is reproduced in the whole race; without a single exception men have forgotten the right way. This accusation twice made in the Psalm, and repeated a third time by the inspired apostle Paul, is an indictment most solemn and sweeping, but he who makes it cannot err, he knows what is in man; neither will he lay more to man's charge than he can prove.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 53:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 53:2",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"God looked down from heaven upon the children of men.\" He did so in ages past, and he has continued his steadfast gaze from his all-surveying observatory. \"To see if there were any that did understand, that did seek God.\" Had there been one understanding man, one true lover of his God, the divine eye would have discovered him. Those pure heathens and admirable savages that men talk so much of, do not appear to have been visible to the eye of Omniscience, the fact being that they live nowhere but in the realm of fiction. The Lord did not look for great grace, but only for sincerity and right desire, but these he found not. He saw all nations, and all men in all nations, and all hearts in all men, and all motions of all hearts, but he saw neither a clear head nor a clean heart among them all. Where God's eyes see no favourable sign we may rest assured there is none.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 53:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 53:3",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Every one of them is gone back.\" The whole mass of manhood, all of it, is gone back. In thePsa 14:1-7 it was said to turn aside, which was bad enough, but here it is described as running in a diametrically opposite direction. The life of unregenerate manhood is in direct defiance of the law of God, not merely apart from it but opposed to it. \"They are altogether become filthy.\" The whole lump is soured with an evil leaven, fouled with an all-pervading pollution, made rank with general putrefaction. Thus, in God's sight, our atheistic nature is not the pardonable thing that we think it to be. Errors as to God are not the mild diseases which some account them, they are abominable evils. Fair is the world to blind eyes, but to the all-seeing Jehovah it is otherwise. \"There is none that doeth good, no, not one.\" How could there be, when the whole mass was leavened with so evil a leaven? This puts an end to the fictions of the innocent savage, the lone patriarch, \"the Indian whose untutored mind,\" etc. Pope's verse - ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Father of all, in every age,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In every clime adored,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...THE ARGUMENT This Psalm, some few words excepted, is wholly the same with Psalm 14, and therefore the reader must resort thither for the interpretation of it. And it is repeated, partly because the matter of it is so important and necessary to be known and considered; and partly because there arose some new and suitable occasion which made David sing it a second time, and that with some small alterations. And the compiler or compilers of David’s Psalms had so great a reverence for their composer, whom they knew to be guided by Divine inspiration, that they would not lose any of his fragments, and therefore repeated this Psalm with the variations which he had made. Mahalath seems to be the name of a musical instrument, or tune; wherein, as in the rest of them, it is better to confess our ignorance, as the Hebrew doctors themselves do, than to give way to vain and groundless conjectures about them. David describeth the atheism and corruption of men, &c. See Psalm 10 Psa 14.  No text from Poole on this verse. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "continued...",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "THE ARGUMENT",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "This Psalm, some few words excepted, is wholly the same with ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and therefore the reader must resort thither for the interpretation of it. And it is repeated, partly because the matter of it is so important and necessary to be known and considered; and partly because there arose some new and suitable occasion which made David sing it a second time, and that with some small alterations. And the compiler or compilers of David’s Psalms had so great a reverence for their composer, whom they knew to be guided by Divine inspiration, that they would not lose any of his fragments, and therefore repeated this Psalm with the variations which he had made. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Mahalath",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " seems to be the name of a musical instrument, or tune; wherein, as in the rest of them, it is better to confess our ignorance, as the Hebrew doctors themselves do, than to give way to vain and groundless conjectures about them. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "David describeth the atheism and corruption of men, &c. See ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 10 Psa 14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " No text from Poole on this verse. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The fool hath said in his heart, there is no God,.... The Targum adds, \"of whom is revenge\"; or there is no God to punish and avenge the wicked; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "corrupt are they; the Chaldee paraphrase is, \"the wicked have corrupted their ways\"; as all flesh had done in the old world, Genesis 6:12; ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "corrupt are they; the Chaldee paraphrase is, \"the wicked have corrupted their ways\"; as all flesh had done in the old world, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 6:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and have done abominable iniquity; iniquity is the abominable thing that God hates, and makes men abominable in his sight; in Psalm 11:1, it is read, \"abominable worlds\": the Targum paraphrases the words, \"they are far from good, for iniquity is found in them\"; see Revelation 21:8; ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and have done abominable iniquity; iniquity is the abominable thing that God hates, and makes men abominable in his sight; in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 11:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", it is read, \"abominable worlds\": the Targum paraphrases the words, \"they are far from good, for iniquity is found in them\"; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 21:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "there is none that doeth good; See Gill on Psalm 14:1. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "there is none that doeth good; See Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 14:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "<{a}",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "<",
            "children": []
          },
          {
            "element": "to",
            "class": "cverse3",
            "text": "{a}",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Mahalath, Maschil, ",
        "children": []
      },
      {
        "element": "i",
        "class": "",
        "text": "A Psalm",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of David.>> The fool hath said in his heart, ",
        "children": []
      },
      {
        "element": "i",
        "class": "",
        "text": "There is",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cverse3",
        "text": "{b}",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " no God. Corrupt are they, and have done abominable iniquity: ",
        "children": []
      },
      {
        "element": "i",
        "class": "",
        "text": "there is",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " none that doeth good.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) Which was an instrument or king of note.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) Whereas no regard is had for honesty or dishonesty, for virtue nor for vice, there the prophet pronounces that the people have no God.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The fool",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] A class of men, not a particular individual. The word ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "nâbâl",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " here used for fool denotes moral perversity, not mere ignorance or weakness of reason. ‘Folly’ is the opposite of ‘wisdom’ in its highest sense. It may be predicated of forgetfulness of God or impious opposition to His will (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 2:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 42:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 74:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 74:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "): of gross offences against morality (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 13:12-13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "): of sacrilege (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 7:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "): of ungenerous churlishness (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 25:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). For a description of the ‘fool’ in his ‘folly’ see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 32:5-6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (A.V. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "vile person, villany",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "hath said in his heart",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Or, said. This was the deliberate conclusion of men, upon which they acted. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 10:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 10:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 10:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "There is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "no God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 10:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This is not to be understood of a speculative denial of the existence of God; but of a practical denial of His moral government. It is rightly paraphrased by the Targum on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 14:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ‘There is no government of God in the earth.’ Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 73:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 5:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zephaniah 1:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 1:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Corrupt are they",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " &c.] Render, They did corrupt and abominable iniquity; there was none doing good. The subject of the sentence is mankind in general. Abandoning a practical belief in God, they depraved their nature, and gave themselves up to practices which God abhors (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 5:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ‘Corrupt’ describes the self-degradation of their better nature; ‘abominable’ the character of their conduct in the sight of God. Such was the condition of the world before the Flood. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 6:11-12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and with the last line of the verse cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 6:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 1:18-32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is a commentary on this verse. Men “refused to have God in their knowledge” … “their senseless heart was darkened” … “professing themselves to be wise, they became fools.” For ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "iniquity",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Psalms 14 reads ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "doings",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1–3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The universal depravity of mankind, and its cause.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 1 and 2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " are identical with the same verses of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", with the single exception that \"Jehovah \"is replaced by\" Elohim,\" as the first word of ver. 2. Psalm 53:1",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The well-grounded asyndeton השׁהיתוּ התעיבוּ is here dismissed; and the expression is rendered more bombastic by the use of עול instead of עלילה. עול (the masculine to עולה), pravitas, is the accusative of the object (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 16:52",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") to both verbs, which give it a twofold superlative attributive notion. Moreover, here השׁחיתו is accented with Mugrash in our printed texts instead of Tarcha. One Mugrash after another is contrary to all rule. ",
        "children": []
      }
    ]
  }
]