[{"header":"God’s Command to Rebuild the Temple"},{"num":1,"verse":"In the second year of King Darius, in the sixth month, on the first day of the month, the word of the Lord came by Haggai the prophet to Zerubbabel the son of Shealtiel, governor of Judah, and to Joshua the son of Jehozadak, the high priest, saying,"},{"num":2,"verse":"Thus says the Lord of Hosts: These people say, The time has not yet come to rebuild the house of the Lord."},{"num":3,"verse":"Then the word of the Lord came by Haggai the prophet, saying: "},{"num":4,"verse":"Is it time for you yourselves to live in paneled houses, while this house lies in ruins?"},{"num":5,"verse":"Now, therefore, thus says the Lord of Hosts: Consider your ways. "},{"num":6,"verse":"You have sown much, and harvested little. You eat, but you do not have enough; you drink, but you are not filled with drink; you clothe yourselves, but no one is warm; and he who earns wages earns wages to put them into a bag with holes."},{"num":7,"verse":"Thus says the Lord of Hosts: Consider your ways. "},{"num":8,"verse":"Go up to the mountain and bring wood and rebuild the house, that I may take pleasure in it and be glorified, says the Lord. "},{"num":9,"verse":"You looked for much, and it came to little; and when you brought it home, I blew it away. Why? says the Lord of Hosts. Because of My house that lies in ruins while each of you runs to his own house. "},{"num":10,"verse":"Therefore the heavens above you have withheld the dew, and the earth has withheld its crops. "},{"num":11,"verse":"I called for a drought on the land and the mountains, on the grain, on the new wine, on the oil, on what the ground brings forth, on men, on livestock, and on all the labor of your hands."},{"header":"The People Obey God’s Command"},{"num":12,"verse":"Then Zerubbabel the son of Shealtiel, and Joshua the son of Jehozadak, the high priest, with all the remnant of the people, obeyed the voice of the Lord their God, and the words of Haggai the prophet, as the Lord their God had sent him. And the people feared the Lord."},{"num":13,"verse":"Then Haggai, the messenger of the Lord, spoke the message of the Lord to the people, saying: I am with you, says the Lord. "},{"num":14,"verse":"And the Lord stirred up the spirit of Zerubbabel the son of Shealtiel, governor of Judah, and the spirit of Joshua the son of Jehozadak, the high priest, and the spirit of all the remnant of the people. And they came and worked on the house of the Lord of Hosts their God, "},{"num":15,"verse":"on the twenty-fourth day of the sixth month, in the second year of King Darius."}]