[[],[{"type":"header","content":"Aaron’s Staff Buds"},{"type":"prose","content":"Then the  spoke to Moses, saying,"}],[{"type":"prose","content":"“Speak to the sons of Israel, and obtain from them a staff for each father’s household: twelve staffs, from all their leaders for their fathers’ households. You shall write each man’s name on his staff,"}],[{"type":"prose","content":"and write Aaron’s name on the staff of Levi; for  one staff for the head  of their fathers’ households."}],[{"type":"prose","content":"You shall then leave them in the tent of meeting in front of the testimony, where I meet with you."}],[{"type":"prose","content":"And it will come about that the staff of the man whom I choose will sprout. So I will relieve Myself of the grumblings of the sons of Israel, who are grumbling against you.”"}],[{"type":"prose","content":"So Moses spoke to the sons of Israel, and all their leaders gave him a staff, one for each leader, for their fathers’ households, twelve staffs , with the staff of Aaron among their staffs."}],[{"type":"prose","content":"Then Moses left the staffs before the  in the tent of the testimony."}],[{"type":"prose","content":"Now on the next day Moses went into the tent of the testimony; and behold, Aaron’s staff for the house of Levi had sprouted and produced buds and bloomed with blossoms, and it yielded ripe almonds."}],[{"type":"prose","content":"Moses then brought out all the staffs from the presence of the  to all the sons of Israel; and they looked, and each man took his staff."}],[{"type":"prose","content":"But the  said to Moses, “Put the staff of Aaron back in front of the testimony to be kept as a sign against the rebels, so that you may put an end to their grumblings against Me and they do not die.”"}],[{"type":"prose","content":"Moses did ; just as the  had commanded him, so he did."}],[{"type":"prose","content":"Then the sons of Israel spoke to Moses, saying, “Behold, we are passing away, we are perishing, we are all perishing!"}],[{"type":"prose","content":"Everyone who comes near, who comes near to the tabernacle of the , must die. Are we to perish completely?”"}]]