[[],[{"type":"header","content":"The Ten Commandments Repeated"},{"type":"prose","content":"Then Moses summoned all Israel and said to them:“Hear, O Israel, the statutes and judgments (legal decisions) which I am speaking today in your hearing, so that you may learn them and observe them carefully. "}],[{"type":"prose","content":"The LORD our God made a covenant with us at Horeb. "}],[{"type":"prose","content":"The LORD did not make this covenant with our fathers, but with us, all of us who are alive here today. "}],[{"type":"prose","content":"The LORD spoke with you face to face at the mountain from the midst of the fire. "}],[{"type":"prose","content":"I was standing between the LORD and you at that time, to declare to you the word of the LORD; for you were afraid because of the fire and did not go up the mountain. He said,"}],[{"type":"prose","content":"‘I am the LORD your God who brought you out of the land of Egypt, out of the house of slavery."}],[{"type":"prose","content":"‘You shall have no other gods before Me."}],[{"type":"prose","content":"‘You shall not make for yourself an idol [as an object to worship], or any likeness (form, manifestation) of what is in heaven above or on the earth beneath or in the water under the earth. "}],[{"type":"prose","content":"You shall not worship them or serve them; for I, the LORD your God, am a jealous (impassioned) God [demanding what is rightfully and uniquely mine], visiting (avenging) the iniquity (sin, guilt) of the fathers on the children [that is, calling the children to account for the sins of their fathers], to the third and the fourth  of those who hate Me, "}],[{"type":"prose","content":"but showing graciousness  lovingkindness to thousands [of generations] of those who love Me and keep My commandments."}],[{"type":"prose","content":"‘You shall not take the name of the LORD your God in vain [that is, irreverently, in false affirmations or in ways that impugn the character of God]; for the LORD will not hold guiltless  leave unpunished the one who takes His name in vain [disregarding its reverence and its power]."}],[{"type":"prose","content":"‘Observe the Sabbath day to keep it holy (set apart, dedicated to God), as the LORD your God commanded you. "}],[{"type":"prose","content":"Six days you shall labor and do all your work, "}],[{"type":"prose","content":"but the seventh day is a Sabbath [a day of rest dedicated] to the LORD your God; on that day you shall not do any work, you or your son or your daughter or your male servant or your female servant or your ox or your donkey or any of your livestock or the stranger who stays inside your [city] gates, so that your male servant and your female servant may rest as well as you. "}],[{"type":"prose","content":"You shall remember [with thoughtful concern] that you were a slave in the land of Egypt, and that the LORD your God brought you out of there with a mighty hand and by an outstretched arm; therefore the LORD your God has commanded you to observe the Sabbath day."}],[{"type":"prose","content":"‘Honor (respect, obey, care for) your father and your mother, as the LORD your God has commanded you, so that your days [on the earth] may be prolonged and so that it may go well with you in the land which the LORD your God gives you."}],[{"type":"prose","content":"‘You shall not murder."}],[{"type":"prose","content":"‘You shall not commit adultery."}],[{"type":"prose","content":"‘You shall not steal."}],[{"type":"prose","content":"‘You shall not give false testimony [that is, lie, withhold, or manipulate the truth] against your neighbor (any person)."}],[{"type":"prose","content":"‘You shall not covet [that is, desire and seek to acquire] your neighbor’s wife, nor desire your neighbor’s house, his field, his male servant or his female servant, his ox or his donkey or anything that belongs to your neighbor.’"}],[{"type":"header","content":"Moses Interceded"},{"type":"prose","content":"“The LORD spoke these words with a great voice to all your assembly at the mountain out of the midst of the fire, the cloud, and the thick darkness, and He added no more. He wrote these commandments on two tablets of stone and gave them to me. "}],[{"type":"prose","content":"And when you heard the voice from the midst of the darkness, while the mountain was burning with fire, you approached me, all the leaders (heads) of your tribes and your elders; "}],[{"type":"prose","content":"and you said, ‘Behold, the LORD our God has shown us His glory and His greatness, and we have heard His voice from the midst of the fire; we have seen today that God speaks with man, yet he [still] lives. "}],[{"type":"prose","content":"Now then why should we die? For this great fire will consume us; if we hear the voice of the LORD our God any longer, then we will die. "}],[{"type":"prose","content":"For who is there of all flesh (mankind) who has heard the voice of the living God speaking from the midst of the fire, as we have, and lived? "}],[{"type":"prose","content":"You, Moses, go near and listen to everything that the LORD our God says; then speak to us everything that the LORD our God speaks to you, and we will listen and do it.’"}],[{"type":"prose","content":"“The LORD heard your words when you spoke to me, and the LORD said to me, ‘I have heard the words of this people which they have spoken to you. They have done well in all that they have spoken. "}],[{"type":"prose","content":"Oh that they had such a heart in them, that they would fear [and worship Me with awe-filled reverence and profound respect] and keep all My commandments always, so that it may go well with them and with their children forever! "}],[{"type":"prose","content":"Go and say to them, “Return to your tents.” "}],[{"type":"prose","content":"But as for you, stand here by Me, and I will tell you all the commandments and the statutes and the judgments which you shall teach them, so that they may obey them in the land which I give them to possess.’ "}],[{"type":"prose","content":"Therefore you shall pay attention  be careful to do just as the LORD your God has commanded you; you shall not turn aside to the right or to the left [deviating from My commandments]. "}],[{"type":"prose","content":"You shall walk [that is, live each and every day] in all the ways which the LORD your God has commanded you, so that you may live and so that it may be well with you, and that you may live long in the land which you will possess."}]]