[{"header":"Moses Teaches Israel on the Plains of Moab"},{"num":5,"verse":"Moses called all Israel together. He said to them,"},{"num":2,"verse":"God, our God, made a covenant with us at Horeb. God didn’t just make this covenant with our parents; he made it also with us, with all of us who are alive right now. God spoke to you personally out of the fire on the mountain. At the time I stood between God and you, to tell you what God said. You were afraid, remember, of the fire and wouldn’t climb the mountain. He said:"},{"num":22,"verse":"These are the words that God spoke to the whole congregation at the mountain. He spoke in a tremendous voice from the fire and cloud and dark mist. And that was it. No more words. Then he wrote them on two slabs of stone and gave them to me."},{"num":23,"verse":"As it turned out, when you heard the Voice out of that dark cloud and saw the mountain on fire, you approached me, all the heads of your tribes and your leaders, and said,"},{"num":24,"verse":"“Our God has revealed to us his glory and greatness. We’ve heard him speak from the fire today! We’ve seen that God can speak to humans and they can still live. But why risk it further? This huge fire will devour us if we stay around any longer. If we hear God’s voice anymore, we’ll die for sure. Has anyone ever known of anyone who has heard the Voice of God the way we have and lived to tell the story?"},{"num":27,"verse":"“From now on, you go and listen to what God, our God, says and then tell us what God tells you. We’ll listen and we’ll do it.”"},{"num":28,"verse":"God heard what you said to me and told me, “I’ve heard what the people said to you. They’re right—good and true words. What I wouldn’t give if they’d always feel this way, continuing to revere me and always keep all my commands; they’d have a good life forever, they and their children!"},{"num":30,"verse":"“Go ahead and tell them to go home to their tents. But you, you stay here with me so I can tell you every commandment and all the rules and regulations that you must teach them so they’ll know how to live in the land that I’m giving them as their own.”"},{"num":32,"verse":"So be very careful to act exactly as God commands you. Don’t veer off to the right or the left. Walk straight down the road God commands so that you’ll have a good life and live a long time in the land that you’re about to possess."}]