[[],[{"type":"header","content":"Gate for the Prince"},{"type":"prose","content":"Then He brought me back by the way of the outer gate of the sanctuary, which faces the east; and it was shut. "}],[{"type":"prose","content":"Then the LORD said to me, “This gate shall be shut; it shall not be opened, and no one shall enter by it, for the LORD, the God of Israel, has entered by it; therefore it shall be shut. "}],[{"type":"prose","content":"As for the prince, he shall sit in it as prince to eat bread before the LORD; he shall enter by way of the porch (portico) of the gate and shall go out the same way.”"}],[{"type":"prose","content":"Then He brought me by way of the north gate to the front of the house; I looked, and behold, the glory  brilliance of the LORD filled the house of the LORD, and I fell face downward. "}],[{"type":"prose","content":"The LORD said to me, “Son of man, pay careful attention, see with your eyes and hear with your ears all that I say to you concerning all the statutes of the house of the LORD and all its laws; and pay careful attention to the entering of the house [by people], with all the departures  the sanctuary [of people, those who are allowed to enter the temple and all those who are excluded from the sanctuary]. "}],[{"type":"prose","content":"You shall say to the rebellious ones, to the house of Israel, ‘Thus says the Lord GOD, “Enough of all your repulsive acts, O house of Israel! "}],[{"type":"prose","content":"In that you brought in foreigners, uncircumcised in heart and uncircumcised in flesh, to be in My sanctuary to pollute  profane it—My house—when you offered My bread, the fat, and the blood; and they made My covenant void — in addition to all your  repulsive acts. "}],[{"type":"prose","content":"And you have not kept charge of My holy things yourselves, but you have chosen  [to please yourselves] and have set them in charge of My sanctuary.”"}],[{"type":"prose","content":"‘Thus says the Lord GOD, “No foreigner uncircumcised in heart and flesh, of all the foreigners who are among the sons of Israel, shall enter My sanctuary. "}],[{"type":"prose","content":"But the Levites who went far away from Me when Israel went astray, who went astray from Me after their idols, they shall bear  their sin  guilt. "}],[{"type":"prose","content":"Yet they shall minister in My sanctuary, having oversight [as guards] at the gates of the temple and ministering in the temple. They shall slaughter the burnt offering and the sacrifice for the people, and they shall stand before them to minister to them. "}],[{"type":"prose","content":"Because the priests ministered to them before their idols and became a stumbling block of sin to the house of Israel, therefore I have lifted up My hand  have sworn [an oath] against them,” says the Lord GOD, “that they shall bear  their sin  guilt. "}],[{"type":"prose","content":"And they shall not come near to Me to serve as priests to Me, nor come near to any of My holy things, to the things that are most holy; but they shall bear their shame  their disgrace and [the consequences of] their repulsive acts which they have committed. "}],[{"type":"prose","content":"Yet I will appoint them as caretakers of the temple, for all its service and for all that shall be done in it."}],[{"type":"header","content":"Ordinances for the Levites"},{"type":"prose","content":"“But the Levitical priests, the sons of Zadok, who performed the duty of My sanctuary when the children (descendants) of Israel went astray from Me, shall come near to Me to minister to Me; and they shall stand before Me to offer to Me the fat and the blood,” declares the Lord GOD. "}],[{"type":"prose","content":"“They shall enter into My sanctuary; and they shall come near to My table to minister to Me and they shall perform [the priestly] duty to me. "}],[{"type":"prose","content":"It shall be that when they enter the gates of the inner courtyard, they shall be clothed in linen garments; no wool shall be on them while they minister at the gates of the inner courtyard and within the temple (house). "}],[{"type":"prose","content":"They shall have linen turbans on their heads and linen undergarments on their loins; they shall not dress themselves with  sweat. "}],[{"type":"prose","content":"When they go out into the outer court, into the outer courtyard to the people, they shall take off the garments in which they have been ministering and leave them in the holy chambers; then they shall put on other clothing so that they will not transmit holiness to the people with their [ceremonial] garments. "}],[{"type":"prose","content":"Also they shall not shave their heads, yet they shall not allow their hair to grow long; they shall only cut short  trim their hair. "}],[{"type":"prose","content":"Nor shall any priest drink wine when he enters the inner courtyard. "}],[{"type":"prose","content":"And they shall not marry a widow or a divorced woman; but they shall marry virgins of the descendants of the house of Israel, or a widow who was previously married to a priest. "}],[{"type":"prose","content":"The priests shall teach My people  between the holy and the common, and teach them to distinguish between the (ceremonially) unclean and the clean. "}],[{"type":"prose","content":"In a controversy they shall take their stand to act as judges; they shall judge it in accordance with My ordinances. They shall also keep My laws and My statutes in all My appointed feasts and sanctify My Sabbaths. "}],[{"type":"prose","content":"They shall not go to a dead person to defile ; except for father or for mother, for son or for daughter, for brother or for sister who has had no husband; they may defile themselves. "}],[{"type":"prose","content":"After he is cleansed [from the defilement of a corpse], seven days more shall elapse for him [before returning to the temple]. "}],[{"type":"prose","content":"On the day that he goes into the sanctuary, into the inner courtyard to minister in the sanctuary, he shall offer his sin offering,” says the Lord GOD."}],[{"type":"prose","content":"“It [their ministry to Me] shall be as an inheritance to them, for I am their inheritance; and you shall give them no property (land) in Israel, for I am their possession. "}],[{"type":"prose","content":"They shall eat the grain offering, the sin offering and the guilt offering; and every devoted thing (offering) in Israel [dedicated by a solemn vow to God] shall be theirs. "}],[{"type":"prose","content":"The first of all the first fruits of every kind, and every contribution  offering of every kind, from all your contributions  offerings, shall belong to the priests. You shall also give to the priest the first of your coarse meal  bread dough, so that a blessing may rest on your house. "}],[{"type":"prose","content":"The priests shall not eat any bird or animal that has died a natural death or has been torn to pieces."}]]