[{"header":"The Use of the East Gate"},{"num":44,"verse":"The man led me to the outer gate at the east side of the Temple area. The gate was closed, "},{"num":2,"verse":"and the Lord said to me, “This gate will stay closed and will never be opened. No human being is allowed to use it, because I, the Lord God of Israel, have entered through it. It is to remain closed. "},{"num":3,"verse":"The ruling prince, however, may go there to eat a holy meal in my presence. He is to enter and leave the gateway through the entrance room at the inner end.”"},{"header":"Rules for Admission to the Temple"},{"num":4,"verse":"Then the man took me through the north gate to the front of the Temple. As I looked, I saw that the Temple of the Lord was filled with the dazzling light of his presence. I threw myself face downward on the ground, "},{"num":5,"verse":"and the Lord said to me, “Mortal man, pay attention to everything you see and hear. I am going to tell you the rules and regulations for the Temple. Note carefully which persons are allowed to go in and out of the Temple, and which persons are not allowed."},{"num":6,"verse":"“Tell those rebellious people of Israel that I, the Sovereign Lord, will no longer tolerate the disgusting things that they have been doing. "},{"num":7,"verse":"They have profaned my Temple by letting uncircumcised foreigners, people who do not obey me, enter the Temple when the fat and the blood of the sacrifices are being offered to me. So my people have broken my covenant by all the disgusting things they have done. "},{"num":8,"verse":"They have not taken charge of the sacred rituals in my Temple, but instead have put foreigners in charge."},{"num":9,"verse":"“I, the Sovereign Lord, declare that no uncircumcised foreigner, no one who disobeys me, will enter my Temple, not even a foreigner who lives among the people of Israel.”"},{"header":"The Levites Are Excluded from the Priesthood"},{"num":10,"verse":"The Lord said to me, “I am punishing those Levites who, together with the rest of the people of Israel, deserted me and worshiped idols. "},{"num":11,"verse":"They may serve me in the Temple by taking charge of the gates and by performing the work of the Temple. They may kill the animals which the people offer for burnt offerings and for sacrifices, and they are to be on duty to serve the people. "},{"num":12,"verse":"But because they conducted the worship of idols for the people of Israel and in this way led the people into sin, I, the Sovereign Lord, solemnly swear that they must be punished. "},{"num":13,"verse":"They are not to serve me as priests or to go near anything that is holy to me or to enter the Most Holy Place. This is the punishment for the disgusting things they have done. "},{"num":14,"verse":"I am assigning to them the menial work that is to be done in the Temple.”"},{"header":"The Priests"},{"num":15,"verse":"The Sovereign Lord said, “Those priests belonging to the tribe of Levi who are descended from Zadok, however, continued to serve me faithfully in the Temple when the rest of the people of Israel turned away from me. So now they are the ones who are to serve me and come into my presence to offer me the fat and the blood of the sacrifices. "},{"num":16,"verse":"They alone will enter my Temple, serve at my altar, and conduct the Temple worship. "},{"num":17,"verse":"When they enter the gateway to the inner courtyard of the Temple, they are to put on linen clothing. They must not wear anything made of wool when they are on duty in the inner courtyard or in the Temple. "},{"num":18,"verse":"So that they won't perspire, they are to wear linen turbans and linen trousers, but no belt. "},{"num":19,"verse":"Before they go to the outer courtyard where the people are, they must first take off the clothes they wore on duty in the Temple and leave them in the holy rooms. They are to put on other clothing in order to keep their sacred clothing from harming the people."},{"num":20,"verse":"“Priests must neither shave their heads nor let their hair grow long. They are to keep it a proper length. "},{"num":21,"verse":"Priests must not drink any wine before going into the inner courtyard. "},{"num":22,"verse":"No priest may marry a divorced woman; he is to marry only an Israelite virgin or the widow of another priest."},{"num":23,"verse":"“The priests are to teach my people the difference between what is holy and what is not, and between what is ritually clean and what is not. "},{"num":24,"verse":"When a legal dispute arises, the priests are to decide the case according to my laws. They are to keep the religious festivals according to my rules and regulations, and they are to keep the Sabbaths holy."},{"num":25,"verse":"“A priest is not to become ritually unclean by touching a corpse, unless it is one of his parents, one of his children or a brother or an unmarried sister. "},{"num":26,"verse":"After he has become clean again, he must wait seven days "},{"num":27,"verse":"and then go into the inner courtyard of the Temple and offer a sacrifice for his purification, so that he can serve in the Temple again. I, the Sovereign Lord, have spoken."},{"num":28,"verse":"“The priests have the priesthood as their share of what I have given Israel to be handed down from one generation to another. They are not to hold property in Israel; I am all they need. "},{"num":29,"verse":"The grain offerings, the sin offerings, and the repayment offerings will be the priests' food, and they are to receive everything in Israel that is set apart for me. "},{"num":30,"verse":"The priests are to have the best of all the first harvest and of everything else that is offered to me. Each time the people bake bread, they are to give the priests the first loaf as an offering, and my blessing will rest on their homes. "},{"num":31,"verse":"The priests must not eat any bird or animal that dies a natural death or is killed by another animal.”"}]