[{"header":"The Prince, Levites, and Priests"},{"num":44,"verse":"Then the man brought me back to the east gateway in the outer wall of the Temple area, but it was closed."},{"num":2,"verse":"And the Lord said to me, “This gate must remain closed; it will never again be opened. No one will ever open it and pass through, for the Lord, the God of Israel, has entered here. Therefore, it must always remain shut."},{"num":3,"verse":"Only the prince himself may sit inside this gateway to feast in the Lord’s presence. But he may come and go only through the entry room of the gateway.”"},{"num":4,"verse":"Then the man brought me through the north gateway to the front of the Temple. I looked and saw that the glory of the Lord filled the Temple of the Lord, and I fell face down on the ground."},{"num":5,"verse":"And the Lord said to me, “Son of man, take careful notice. Use your eyes and ears, and listen to everything I tell you about the regulations concerning the Lord’s Temple. Take careful note of the procedures for using the Temple’s entrances and exits."},{"num":6,"verse":"And give these rebels, the people of Israel, this message from the Sovereign Lord: O people of Israel, enough of your detestable sins!"},{"num":7,"verse":"You have brought uncircumcised foreigners into my sanctuary—people who have no heart for God. In this way, you defiled my Temple even as you offered me my food, the fat and blood of sacrifices. In addition to all your other detestable sins, you have broken my covenant."},{"num":8,"verse":"Instead of safeguarding my sacred rituals, you have hired foreigners to take charge of my sanctuary."},{"num":9,"verse":"“So this is what the Sovereign Lord says: No foreigners, including those who live among the people of Israel, will enter my sanctuary if they have not been circumcised and have not surrendered themselves to the Lord."},{"num":10,"verse":"And the men of the tribe of Levi who abandoned me when Israel strayed away from me to worship idols must bear the consequences of their unfaithfulness."},{"num":11,"verse":"They may still be Temple guards and gatekeepers, and they may slaughter the animals brought for burnt offerings and be present to help the people."},{"num":12,"verse":"But they encouraged my people to worship idols, causing Israel to fall into deep sin. So I have taken a solemn oath that they must bear the consequences for their sins, says the Sovereign Lord."},{"num":13,"verse":"They may not approach me to minister as priests. They may not touch any of my holy things or the holy offerings, for they must bear the shame of all the detestable sins they have committed."},{"num":14,"verse":"They are to serve as the Temple caretakers, taking charge of the maintenance work and performing general duties."},{"num":15,"verse":"“However, the Levitical priests of the family of Zadok continued to minister faithfully in the Temple when Israel abandoned me for idols. These men will serve as my ministers. They will stand in my presence and offer the fat and blood of the sacrifices, says the Sovereign Lord."},{"num":16,"verse":"They alone will enter my sanctuary and approach my table to serve me. They will fulfill all my requirements."},{"num":17,"verse":"“When they enter the gateway to the inner courtyard, they must wear only linen clothing. They must wear no wool while on duty in the inner courtyard or in the Temple itself."},{"num":18,"verse":"They must wear linen turbans and linen undergarments. They must not wear anything that would cause them to perspire."},{"num":19,"verse":"When they return to the outer courtyard where the people are, they must take off the clothes they wear while ministering to me. They must leave them in the sacred rooms and put on other clothes so they do not endanger anyone by transmitting holiness to them through this clothing."},{"num":20,"verse":"“They must neither shave their heads nor let their hair grow too long. Instead, they must trim it regularly."},{"num":21,"verse":"The priests must not drink wine before entering the inner courtyard."},{"num":22,"verse":"They may choose their wives only from among the virgins of Israel or the widows of the priests. They may not marry other widows or divorced women."},{"num":23,"verse":"They will teach my people the difference between what is holy and what is common, what is ceremonially clean and unclean."},{"num":24,"verse":"“They will serve as judges to resolve any disagreements among my people. Their decisions must be based on my regulations. And the priests themselves must obey my instructions and decrees at all the sacred festivals, and see to it that the Sabbaths are set apart as holy days."},{"num":25,"verse":"“A priest must not defile himself by being in the presence of a dead person unless it is his father, mother, child, brother, or unmarried sister. In such cases it is permitted."},{"num":26,"verse":"Even then, he can return to his Temple duties only after being ceremonially cleansed and then waiting for seven days."},{"num":27,"verse":"The first day he returns to work and enters the inner courtyard and the sanctuary, he must offer a sin offering for himself, says the Sovereign Lord."},{"num":28,"verse":"“The priests will not have any property or possession of land, for I alone am their special possession."},{"num":29,"verse":"Their food will come from the gifts and sacrifices brought to the Temple by the people—the grain offerings, the sin offerings, and the guilt offerings. Whatever anyone sets apart for the Lord will belong to the priests."},{"num":30,"verse":"The first of the ripe fruits and all the gifts brought to the Lord will go to the priests. The first batch of dough must also be given to the priests so the Lord will bless your homes."},{"num":31,"verse":"The priests may not eat meat from any bird or animal that dies a natural death or that dies after being attacked by another animal."}]