[[],[{"type":"header","content":"Amaziah of Judah"}],[{"type":"prose","content":"In the second year of Jehoash son of Jehoahaz king of Israel, Amaziah son of Joash became king of Judah. He was twenty-five years old when he became king and he reigned for twenty-nine years in Jerusalem. His mother’s name was Jehoaddin. She was from Jerusalem."}],[{"type":"prose","content":"He lived the way  wanted and did the right thing. But he didn’t come up to the standards of his ancestor David; instead he lived pretty much as his father Joash had; the local sex-and-religion shrines continued to stay in business with people frequenting them."}],[{"type":"prose","content":"When he had the affairs of the kingdom well in hand, he executed the palace guard that had assassinated his father the king. But he didn’t kill the sons of the assassins. He was obedient to what  commanded, written in the Word revealed to Moses, that parents shouldn’t be executed for their children’s sins, nor children for those of their parents. We each pay personally for our sins."}],[{"type":"prose","content":"Amaziah roundly defeated Edom in the Valley of Salt to the tune of ten thousand dead. In another battle he took The Rock and renamed it Joktheel, the name it still bears."}],[{"type":"prose","content":"One day Amaziah sent envoys to Jehoash son of Jehoahaz, the son of Jehu, king of Israel, challenging him to a fight: “Come and meet with me—dare you. Let’s have it out face-to-face!”"}],[{"type":"prose","content":"Jehoash king of Israel replied to Amaziah king of Judah, “One day a thistle in Lebanon sent word to a cedar in Lebanon, ‘Give your daughter to my son in marriage.’ But then a wild animal of Lebanon passed by and stepped on the thistle, crushing it. Just because you’ve defeated Edom in battle, you now think you’re a big shot. Go ahead and be proud, but stay home. Why press your luck? Why bring defeat on yourself and Judah?”"}],[{"type":"prose","content":"Amaziah wouldn’t take No for an answer. So Jehoash king of Israel gave in and agreed to a battle between him and Amaziah king of Judah. They met at Beth Shemesh, a town of Judah."}],[{"type":"prose","content":"Judah was thoroughly beaten by Israel—all their soldiers ran home in defeat."}],[{"type":"prose","content":"Jehoash king of Israel captured Amaziah king of Judah, the son of Joash, the son of Ahaziah, at Beth Shemesh. But Jehoash didn’t stop there; he went on to attack Jerusalem. He demolished the wall of Jerusalem all the way from the Ephraim Gate to the Corner Gate—a stretch of about six hundred feet. He looted the gold, silver, and furnishings—anything he found that was worth taking—from both the palace and The Temple of . And, for good measure, he took hostages. Then he returned to Samaria."}],[{"type":"prose","content":"The rest of the life and times of Jehoash, his significant accomplishments and the fight with Amaziah king of Judah, are all written in . Jehoash died and was buried in Samaria in the cemetery of the kings of Israel. His son Jeroboam became the next king."}],[{"type":"prose","content":"Amaziah son of Joash king of Judah continued as king fifteen years after the death of Jehoash son of Jehoahaz king of Israel. The rest of the life and times of Amaziah is written in ."}],[{"type":"prose","content":"At the last they cooked up a plot against Amaziah in Jerusalem and he had to flee to Lachish. But they tracked him down in Lachish and killed him there. They brought him back on horseback and buried him in Jerusalem, with his ancestors in the City of David."}],[{"type":"prose","content":"Azariah—he was only sixteen years old at the time—was the unanimous choice of the people of Judah to succeed his father Amaziah as king. Following his father’s death, he rebuilt and restored Elath to Judah."},{"type":"header","content":"Jeroboam II of Israel"}],[{"type":"prose","content":"In the fifteenth year of Amaziah son of Joash king of Judah, Jeroboam son of Jehoash became king of Israel in Samaria. He ruled for forty-one years. As far as  was concerned he lived an evil life, never deviating an inch from all the sin of Jeroboam son of Nebat, who led Israel into a life of sin. But he did restore the borders of Israel to Lebo Hamath in the far north and to the Dead Sea in the south, matching what , the God of Israel, had pronounced through his servant Jonah son of Amittai, the prophet from Gath Hepher."}],[{"type":"prose","content":" was fully aware of the trouble in Israel, its bitterly hard times. No one was exempt, whether slave or citizen, and no hope of help anywhere was in sight. But  wasn’t yet ready to blot out the name of Israel from history, so he used Jeroboam son of Jehoash to save them."}],[{"type":"prose","content":"The rest of the life and times of Jeroboam, his victories in battle and how he recovered for Israel both Damascus and Hamath which had belonged to Judah, these are all written in . Jeroboam died and was buried with his ancestors in the royal cemetery. His son Zechariah became the next king."}]]