[[],[{"type":"header","content":"Amaziah Reigns over Judah"},{"type":"prose","content":"In the second year of Joash son of Joahaz king of Israel, Amaziah the son of Joash king of Judah became king."}],[{"type":"prose","content":"He was twenty-five years old when he became king, and he reigned for twenty-nine years in Jerusalem. And his mother’s name was Jehoaddin of Jerusalem."}],[{"type":"prose","content":"He did what was right in the sight of the , yet not like his father David; he acted in accordance with everything that his father Joash had done."}],[{"type":"prose","content":"Only the high places were not eliminated; the people still sacrificed and burned incense on the high places."}],[{"type":"prose","content":"Now it came about, as soon as the kingdom was firmly in his hand, that he killed his servants who had killed the king, his father."}],[{"type":"prose","content":"But he did not put the sons of the murderers to death, in obedience to what is written in the Book of the Law of Moses, as the  commanded, saying, “The fathers shall not be put to death for the sons, nor the sons be put to death for the fathers; but each shall be put to death for his own sin.”"}],[{"type":"prose","content":"He killed ten thousand  the Edomites in the Valley of Salt, and took Sela by war, and named it Joktheel,  to this day."}],[{"type":"prose","content":"Then Amaziah sent messengers to Jehoash, the son of Jehoahaz son of Jehu, king of Israel, saying, “Come, let’s face each other .”"}],[{"type":"prose","content":"But Jehoash king of Israel sent  to Amaziah king of Judah, saying, “The thorn bush that was in Lebanon sent  to the cedar that was in Lebanon, saying, ‘Give your daughter to my son in marriage.’ But a wild animal that was in Lebanon passed by and trampled the thorn bush."}],[{"type":"prose","content":"You have indeed defeated Edom, and your heart is elated. Enjoy the glory and stay home; for why should you get involved in trouble so that you would fall, you and Judah with you?”"}],[{"type":"prose","content":"But Amaziah would not listen. So Jehoash king of Israel went up; and they faced each other, he and Amaziah king of Judah, at Beth-shemesh, which belongs to Judah."}],[{"type":"prose","content":"And Judah was defeated by Israel, and they fled, every man to his tent."}],[{"type":"prose","content":"Then Jehoash king of Israel captured Amaziah king of Judah, the son of Jehoash the son of Ahaziah, at Beth-shemesh, and came to Jerusalem and tore down the wall of Jerusalem from the Gate of Ephraim to the Corner Gate, four hundred cubits."}],[{"type":"prose","content":"And he took all the gold and silver and all the utensils which were found in the house of the , and in the treasuries of the king’s house, the hostages as well, and returned to Samaria."},{"type":"header","content":"Jeroboam II Succeeds Jehoash (Joash) in Israel"}],[{"type":"prose","content":"Now  the rest of the acts of Jehoash that he did, and his might and how he fought with Amaziah king of Judah, are they not written in the Book of the Chronicles of the Kings of Israel?"}],[{"type":"prose","content":"So Jehoash lay down with his fathers and was buried in Samaria with the kings of Israel; and his son Jeroboam became king in his place."},{"type":"header","content":"Azariah (Uzziah) Succeeds Amaziah in Judah"}],[{"type":"prose","content":"Amaziah the son of Joash king of Judah lived for fifteen years after the death of Jehoash son of Jehoahaz king of Israel."}],[{"type":"prose","content":"Now  the rest of the acts of Amaziah, are they not written in the Book of the Chronicles of the Kings of Judah?"}],[{"type":"prose","content":"They formed a conspiracy against him in Jerusalem, and he fled to Lachish; but they sent  to Lachish after him and they killed him there."}],[{"type":"prose","content":"Then they carried him on horses, and he was buried in Jerusalem with his fathers in the city of David."}],[{"type":"prose","content":"And all the people of Judah took Azariah, who  sixteen years old, and made him king in place of his father Amaziah."}],[{"type":"prose","content":"He built Elath and restored it to Judah after the king lay down with his fathers."}],[{"type":"prose","content":"In the fifteenth year of Amaziah the son of Joash king of Judah, Jeroboam the son of Joash king of Israel became king in Samaria,  for forty-one years."}],[{"type":"prose","content":"He did evil in the sight of the ; he did not abandon all the sins of Jeroboam the son of Nebat, into which he misled Israel."}],[{"type":"prose","content":"He restored the border of Israel from the entrance of Hamath as far as the Sea of the Arabah, in accordance with the word of the , the God of Israel, which He spoke through His servant Jonah the son of Amittai, the prophet, who was from Gath-hepher."}],[{"type":"prose","content":"For the  saw the misery of Israel,  very bitter; for there was neither bond nor free , nor was there any helper for Israel."}],[{"type":"prose","content":"Yet the  did not say that He would wipe out the name of Israel from under heaven, but He saved them by the hand of Jeroboam the son of Joash."},{"type":"header","content":"Zechariah Reigns over Israel"}],[{"type":"prose","content":"Now  the rest of the acts of Jeroboam and all that he did and his might, how he fought and how he recovered for Israel Damascus and Hamath,  to Judah, are they not written in the Book of the Chronicles of the Kings of Israel?"}],[{"type":"prose","content":"And Jeroboam lay down with his fathers, with the kings of Israel, and his son Zechariah became king in his place."}]]