[{"header":"Amaziah King of Judah"},{"num":14,"verse":"Amaziah son of Joash became king of Judah during the second year Jehoash son of Jehoahaz was king of Israel. "},{"num":2,"verse":"Amaziah was twenty-five years old when he became king, and he ruled twenty-nine years in Jerusalem. His mother was named Jehoaddin, and she was from Jerusalem. "},{"num":3,"verse":"Amaziah did what the Lord said was right. He did everything his father Joash had done, but he did not do as his ancestor David had done. "},{"num":4,"verse":"The places where gods were worshiped were not removed, so the people still sacrificed and burned incense there."},{"num":5,"verse":"As soon as Amaziah took control of the kingdom, he executed the officers who had murdered his father the king. "},{"num":6,"verse":"But he did not put to death the children of the murderers because of the rule written in the Book of the Teachings of Moses. The Lord had commanded: “Parents must not be put to death when their children do wrong, and children must not be put to death when their parents do wrong. Each must die for his own sins.”"},{"num":7,"verse":"In battle Amaziah killed ten thousand Edomites in the Valley of Salt. He also took the city of Sela. He called it Joktheel, as it is still called today."},{"num":8,"verse":"Amaziah sent messengers to Jehoash son of Jehoahaz, the son of Jehu, king of Israel. They said, “Come, let’s meet face to face.”"},{"num":9,"verse":"Then Jehoash king of Israel answered Amaziah king of Judah, “A thornbush in Lebanon sent a message to a cedar tree in Lebanon. It said, ‘Let your daughter marry my son.’ But then a wild animal from Lebanon came by, walking on and crushing the thornbush. "},{"num":10,"verse":"You have defeated Edom, but you have become proud. Stay at home and brag. Don’t ask for trouble, or you and Judah will be defeated.”"},{"num":11,"verse":"But Amaziah would not listen, so Jehoash king of Israel went to attack. He and Amaziah king of Judah faced each other in battle at Beth Shemesh in Judah. "},{"num":12,"verse":"Israel defeated Judah, and every man of Judah ran away to his home. "},{"num":13,"verse":"At Beth Shemesh Jehoash king of Israel captured Amaziah king of Judah. (Amaziah was the son of Joash, who was the son of Ahaziah.) Jehoash went up to Jerusalem and broke down the wall of Jerusalem from the Gate of Ephraim to the Corner Gate, which was about six hundred feet. "},{"num":14,"verse":"He took all the gold and silver and all the utensils in the Temple of the Lord, and he took the treasuries of the palace and some hostages. Then he returned to Samaria."},{"num":15,"verse":"The other acts of Jehoash and his victories, including his war against Amaziah king of Judah, are written in the book of the history of the kings of Israel. "},{"num":16,"verse":"Jehoash died and was buried in Samaria with the kings of Israel, and his son Jeroboam became king in his place."},{"num":17,"verse":"Amaziah son of Joash, the king of Judah, lived fifteen years after the death of Jehoash son of Jehoahaz, the king of Israel. "},{"num":18,"verse":"The other things Amaziah did are written in the book of the history of the kings of Judah. "},{"num":19,"verse":"The people in Jerusalem made plans against him. So he ran away to the town of Lachish, but they sent men after him to Lachish and killed him. "},{"num":20,"verse":"They brought his body back on horses, and he was buried with his ancestors in Jerusalem, in the city of David."},{"num":21,"verse":"Then all the people of Judah made Uzziah king in place of his father Amaziah. Uzziah was sixteen years old. "},{"num":22,"verse":"He rebuilt the town of Elath and made it part of Judah again after Amaziah died."},{"header":"Jeroboam King of Israel"},{"num":23,"verse":"Jeroboam son of Jehoash became king of Israel in Samaria during the fifteenth year Amaziah was king of Judah. (Amaziah was the son of Joash.) Jeroboam ruled forty-one years, "},{"num":24,"verse":"and he did what the Lord said was wrong. Jeroboam son of Nebat had led Israel to sin, and Jeroboam son of Jehoash did not stop doing the same sins. "},{"num":25,"verse":"Jeroboam won back Israel’s border from Lebo Hamath to the Dead Sea. This happened as the Lord, the God of Israel, had said through his servant Jonah son of Amittai, the prophet from Gath Hepher. "},{"num":26,"verse":"The Lord had seen how the Israelites, both slave and free, were suffering terribly. No one was left who could help Israel. "},{"num":27,"verse":"The Lord had not said he would completely destroy Israel from the world, so he saved the Israelites through Jeroboam son of Jehoash."},{"num":28,"verse":"Everything else Jeroboam did is written down—all his victories and how he won back from Judah the towns of Damascus and Hamath for Israel. All this is written in the book of the history of the kings of Israel. "},{"num":29,"verse":"Jeroboam died and was buried with his ancestors, the kings of Israel. Jeroboam’s son Zechariah became king in his place."}]