[{"num":14,"verse":"During the second year of the reign of King Joash of Israel, King Amaziah began his reign over Judah. "},{"num":2,"verse":"Amaziah was twenty-five years old at the time, and he reigned in Jerusalem for twenty-nine years. (His mother was Jehoaddin, a native of Jerusalem.) "},{"num":3,"verse":"He was a good king in the Lord’s sight, though not quite like his ancestor David; but he was as good a king as his father Joash. "},{"num":4,"verse":"However, he didn’t destroy the shrines on the hills, so the people still sacrificed and burned incense there."},{"num":5,"verse":"As soon as he had a firm grip on the kingdom, he killed the men who had assassinated his father; "},{"num":6,"verse":"but he didn’t kill their children, for the Lord had commanded through the law of Moses that fathers shall not be killed for their children, nor children for the sins of their fathers: everyone must pay the penalty for his own sins. "},{"num":7,"verse":"Once Amaziah killed ten thousand Edomites in Salt Valley; he also conquered Sela and changed its name to Joktheel, as it is called to this day."},{"num":8,"verse":"One day he sent a message to King Joash of Israel (the son of Jehoahaz and the grandson of Jehu), daring him to mobilize his army and come out and fight."},{"num":9,"verse":"But King Joash replied, “The thistle of Lebanon demanded of the mighty cedar tree, ‘Give your daughter to be a wife for my son.’ But just then a wild animal passed by and stepped on the thistle and trod it into the ground! "},{"num":10,"verse":"You have destroyed Edom and are very proud about it; but my advice to you is, be content with your glory and stay home! Why provoke disaster for both yourself and Judah?”"},{"num":11,"verse":"But Amaziah refused to listen, so King Joash of Israel mustered his army. The battle began at Beth-shemesh, one of the cities of Judah, "},{"num":12,"verse":"and Judah was defeated and the army fled home. "},{"num":13,"verse":"King Amaziah was captured, and the army of Israel marched on Jerusalem and broke down its wall from the Gate of Ephraim to the Corner Gate, a distance of about six hundred feet. "},{"num":14,"verse":"King Joash took many hostages and all the gold and silver from the Temple and palace treasury, also the gold cups. Then he returned to Samaria."},{"num":15,"verse":"The rest of the history of Joash and his war with King Amaziah of Judah are recorded in The Annals of the Kings of Israel. "},{"num":16,"verse":"When Joash died, he was buried in Samaria with the other kings of Israel. And his son Jeroboam became the new king."},{"num":17,"verse":"Amaziah lived fifteen years longer than Joash, "},{"num":18,"verse":"and the rest of his biography is recorded in The Annals of the Kings of Judah. "},{"num":19,"verse":"There was a plot against his life in Jerusalem, and he fled to Lachish; but his enemies sent assassins and killed him there. "},{"num":20,"verse":"His body was returned on horses, and he was buried in the royal cemetery, in the City of David section of Jerusalem."},{"num":21,"verse":"Then his son Azariah became the new king at the age of sixteen. "},{"num":22,"verse":"After his father’s death, he built Elath and restored it to Judah."},{"num":23,"verse":"Meanwhile, over in Israel, Jeroboam II had become king during the fifteenth year of the reign of King Amaziah of Judah. Jeroboam’s reign lasted forty-one years. "},{"num":24,"verse":"But he was as evil as Jeroboam I (the son of Nebat), who had led Israel into the sin of worshiping idols. "},{"num":25,"verse":"Jeroboam II recovered the lost territories of Israel between Hamath and the Dead Sea, just as the Lord God of Israel had predicted through Jonah (son of Amittai) the prophet from Gathhepher. "},{"num":26,"verse":"For the Lord saw the bitter plight of Israel—she had no one to help her. "},{"num":27,"verse":"And he had not said that he would blot out the name of Israel, so he used King Jeroboam II to save her."},{"num":28,"verse":"The rest of Jeroboam’s biography—all that he did, and his great power, and his wars, and how he recovered Damascus and Hamath (which had been captured by Judah)—is recorded in The Annals of the Kings of Israel. "},{"num":29,"verse":"When Jeroboam II died, he was buried with the other kings of Israel, and his son Zechariah became the new king of Israel."}]