[{"header":"Saul and the Spirit Medium"},{"num":28,"verse":"In those days the Philistines gathered their forces for war to fight against Israel. Achish said to David, “Understand for certain that you and your men will go out with me to battle.” "},{"num":2,"verse":"David said to Achish, “All right, you shall know what your servant can do.” So Achish said to David, “Therefore I will make you my bodyguard for life.”"},{"num":3,"verse":"Now Samuel had died, and all Israel had mourned for him and buried him in Ramah, his own city. And Saul had removed the mediums and the spiritists (soothsayers) from the land. "},{"num":4,"verse":"The Philistines assembled and came and camped at Shunem; and Saul gathered all the Israelites and they camped at Gilboa. "},{"num":5,"verse":"When Saul saw the Philistine army, he was afraid and badly shaken. "},{"num":6,"verse":"So Saul inquired of the Lord, but the Lord did not answer him, either by dreams or by Urim [used like lots by the priest to determine the will of God] or by prophets. "},{"num":7,"verse":"Then Saul said to his servants, “Find for me a woman who is a medium [between the living and the dead], so that I may go to her and ask her advice.” His servants said to him, “There is a woman who is a medium at En-dor.”"},{"num":8,"verse":"So Saul disguised himself by wearing different clothes, and he left with two men, and they came to the woman at night. He said to her, “Conjure up for me, please, and bring up [from the dead] for me [the spirit] whom I shall name to you.” "},{"num":9,"verse":"But the woman said to him, “See here, you know what Saul has done, how he has cut off (eliminated) those who are mediums and spiritists from the land. So why are you laying a trap for my life, to cause my death?” "},{"num":10,"verse":"Then Saul swore [an oath] to her by the Lord, saying, “As the Lord lives, no punishment shall come upon you for this.” "},{"num":11,"verse":"So the woman said, “Whom shall I bring up for you?” He said, “Bring up Samuel for me.” "},{"num":12,"verse":"When the woman saw Samuel, she screamed with a loud voice; and she said to Saul, “Why have you deceived me? You are Saul!” "},{"num":13,"verse":"The king said to her, “Do not be afraid; but [tell me] what do you see?” The woman said to Saul, “I see a divine [superhuman] being coming up from the earth.” "},{"num":14,"verse":"He said to her, “What is his appearance?” And she said, “An old man is coming up, wrapped in a robe.” Then Saul knew that it was Samuel, and he bowed with his face to the ground and paid respect [to him]."},{"num":15,"verse":"Then Samuel said to Saul, “Why have you disturbed me by bringing me up?” Saul answered, “I am greatly distressed; for the Philistines are making war against me, and God has left me and no longer answers me, either through prophets or by dreams; therefore I have called you to make known to me what I should do.” "},{"num":16,"verse":"Samuel said, “Why then do you ask me, since the Lord has left you and has become your enemy? "},{"num":17,"verse":"The Lord has done [to you] just as He said through me [when I was with you]; for the Lord has torn the kingdom out of your hand and given it to your neighbor, to David. "},{"num":18,"verse":"Because you did not obey the voice of the Lord and did not execute His fierce wrath on Amalek, therefore the Lord has done this thing to you this day. "},{"num":19,"verse":"Moreover, the Lord will also put Israel along with you into the hands of the Philistines, and tomorrow you and your sons will be with me [among the dead]. Indeed, the Lord will put the army of Israel into the hands of the Philistines.”"},{"num":20,"verse":"Then Saul immediately fell full length on the earth [floor of the medium’s house], and was very afraid because of Samuel’s words; and he was thoroughly exhausted because he had not eaten all day and all night. "},{"num":21,"verse":"The woman came to Saul and saw that he was greatly troubled, and she said to him, “Look, your maidservant has obeyed you, and I have taken my life in my hand and have listened to everything you said to me. "},{"num":22,"verse":"So now, please listen to the voice of your maidservant, and let me set a piece of bread before you, and eat, so that you may have strength when you go on your way.” "},{"num":23,"verse":"But he refused and said, “I will not eat.” But his servants together with the woman urged him, and he [finally] listened to them. So he got up from the ground and sat on the bed. "},{"num":24,"verse":"The woman had a fattened calf in the house; she quickly killed it, and took flour, kneaded it and baked unleavened bread. "},{"num":25,"verse":"She brought it before Saul and his servants, and they ate. Then they got up and went away that night."}]