[{"num":28,"verse":"In due time the P’lishtim assembled their armies for war against Isra’el. Akhish told David, “You know, of course, that you and your men will join me and the army in battle.” "},{"num":2,"verse":"David answered Akhish, “I see that you already know what your servant will do.” Akhish said to David, “For that answer, I am making you my personal bodyguard for life.”"},{"num":3,"verse":"Now Sh’mu’el was dead; all Isra’el had mourned him and buried him in his city, Ramah. Also Sha’ul had expelled from the land those who tell the future by communicating with the dead or with a demonic spirit."},{"num":4,"verse":"The P’lishtim assembled; then they went and pitched camp at Shunem; while Sha’ul gathered all Isra’el together and pitched camp at Gilboa. "},{"num":5,"verse":"When Sha’ul saw the army of the P’lishtim, he became afraid — it struck terror in his heart. "},{"num":6,"verse":"But when he consulted Adonai, Adonai didn’t answer him — not by dreams, not by urim and not by prophets."},{"num":7,"verse":"Then Sha’ul said to his servants, “Try to find a woman who tells the future by communicating with the dead; I want to go and consult with her.” His servants answered him, “Yes, there’s a woman in ‘Ein-Dor who tells the future by communicating with the dead.” "},{"num":8,"verse":"So Sha’ul disguised himself by wearing different clothing, went with two men, came to the woman by night and said, “Tell me the future, please. Bring up from the dead the person I name to you.” "},{"num":9,"verse":"The woman answered, “Here, you know what Sha’ul did, how he expelled from the land those who tell the future by communicating with the dead or with a demonic spirit. Why are you trying to entrap me into causing my own death?” "},{"num":10,"verse":"But Sha’ul swore to her by Adonai, “As Adonai lives, you will not be punished for doing this.” "},{"num":11,"verse":"Then the woman asked, “Whom should I bring up for you?” He said, “Bring up for me Sh’mu’el.” "},{"num":12,"verse":"When the woman saw Sh’mu’el, she let out a shriek. Then the woman said to Sha’ul, “Why have you deceived me? You yourself are Sha’ul!” "},{"num":13,"verse":"The king replied, “Don’t be afraid. Just tell me what you see.” The woman said to Sha’ul, “I see a god-like being coming up out of the earth.” "},{"num":14,"verse":"He asked her, “What does he look like?” She said, “An old man is coming up; he’s wearing a cloak.” Sha’ul realized it was Sh’mu’el, so he bowed with his face to the ground and prostrated himself."},{"num":15,"verse":"Sh’mu’el asked Sha’ul, “Why have you disturbed me and brought me up?” Sha’ul answered, “I’m very upset; because the P’lishtim are making war against me; and God has left me and doesn’t answer me any more, neither by prophets nor by dreams. This is why I’ve called you, so that you can let me know what to do.” "},{"num":16,"verse":"Sh’mu’el said, “Why ask me, if Adonai has left you and become your enemy? "},{"num":17,"verse":"Adonai has done for himself what he foretold through me — Adonai has torn the kingdom out of your hands and given it to your fellow countryman David, "},{"num":18,"verse":"because you didn’t obey what Adonai said and execute his furious anger toward ‘Amalek. That’s why Adonai is doing this to you today. "},{"num":19,"verse":"Adonai is giving Isra’el as well as yourself over into the power of the P’lishtim, and tomorrow you and your sons will be with me. Adonai will hand over Isra’el’s army to the power of the P’lishtim.”"},{"num":20,"verse":"Sha’ul immediately fell full length on the ground and became terribly frightened because of what Sh’mu’el had said. He had no strength left in him, for he had eaten nothing all that day and night. "},{"num":21,"verse":"The woman approached Sha’ul, saw that he was panic-stricken and said to him, “Here, your servant listened to what you said; I put my life in my hands and did what you requested me to do. "},{"num":22,"verse":"Now therefore, please, you listen to what your servant says: let me put a little food in front of you; then eat, so you will have some strength when you go on your way.” "},{"num":23,"verse":"But he refused and said, “I won’t eat.” Then his servants, together with the woman, urged him; and he heeded what they said. He got up off the ground and sat on the bed. "},{"num":24,"verse":"The woman had a fattened calf in the house; she hurried to slaughter it; then she took flour, kneaded it and baked matzah with it. "},{"num":25,"verse":"She served it to Sha’ul and his servants, and they ate. Afterwards, they got up; and they went away that night."}]