[{"header":"Jehoash (Joash) Son of Ahaziah, King of Judah, Repairs the House of the Lord"},{"num":12,"verse":"In the seventh year of Jehu, Jehoash became king, and he was king in Jerusalem for forty years. His mother’s name was Zibiah from Beersheba."},{"num":2,"verse":"Jehoash did what was right in the eyes of the Lord during the whole time that Jehoiada the priest instructed him, "},{"num":3,"verse":"but the high places were still not removed. The people were making sacrifices and burning incense on the high places."},{"num":4,"verse":"Jehoash said to the priests, “All the silver from the sacred offerings which is brought into the House of the Lord—the redemption money which is assessed to each man in the census, all the money from the redemption of dedicated things, and all the money which any man brings to the House of the Lord as a gift from his heart— "},{"num":5,"verse":"the priests are to take it from the donor and repair whatever damage is found in the temple.”"},{"num":6,"verse":"But in the twenty-third year of King Jehoash, the priests had not repaired the damage to the temple. "},{"num":7,"verse":"So King Jehoash summoned Jehoiada the priest and the other priests, and he said to them, “Why aren’t you repairing the damage to the temple? Do not accept any more silver from those who are handing it in to you. Instead, put it toward repairing the damage to the temple.”"},{"num":8,"verse":"So the priests agreed that they would not take any silver from the people and that they themselves would not do the work of repairing the damage to the temple."},{"num":9,"verse":"But Jehoiada the priest took a box, drilled a hole in its lid, and placed it at the right side of the altar as one entered the House of the Lord. Then the priests who were guarding the threshold put all the money which came into the House of the Lord there. "},{"num":10,"verse":"When they saw that there was a large quantity of silver in the box, the king’s secretary and the high priest went up and tied it in bags and tallied the silver which was found in the House of the Lord."},{"num":11,"verse":"Then they gave the silver which had been weighed out to those who were overseeing the work on the House of the Lord. They paid it out to the carpenters and the builders who were working on the House of the Lord, "},{"num":12,"verse":"and to the bricklayers and the stonemasons, who used it to buy wood and stone from the quarry to repair the damage to the House of the Lord and to meet all the expenses for repairing the building."},{"num":13,"verse":"But the silver basins, snuffers, sprinkling bowls, trumpets, and all the gold and silver articles for the House of the Lord were not made from this silver which was brought into the House of the Lord. "},{"num":14,"verse":"Rather they paid it to the ones who were doing the work, and they repaired the House of the Lord with it. "},{"num":15,"verse":"They did not audit the men to whom they gave the silver to do the work, because they were acting honestly. "},{"num":16,"verse":"The silver from the restitution offerings and the silver from the sin offerings was not brought into the House of the Lord. It belonged to the priests."},{"header":"Hazael Attacks Jerusalem"},{"num":17,"verse":"Then Hazael king of Aram came up and attacked Gath and captured it. Hazael turned to go up against Jerusalem. "},{"num":18,"verse":"So Jehoash king of Judah took all the sacred articles which his fathers Jehoshaphat, Jehoram, and Ahaziah, kings of Judah, had dedicated, as well as the sacred articles that he himself had given and all the gold which was found in the treasuries of the House of the Lord and in the king’s palace, and he sent them to Hazael king of Aram. So Hazael left Jerusalem."},{"header":"The Wickedness and Death of Jehoash"},{"num":19,"verse":"As for the rest of the acts of Jehoash and all the things he did, are they not written in the annals of the kings of Judah? "},{"num":20,"verse":"His servants conspired against him and killed Jehoash at Beth Millo, along the road down to Silla. "},{"num":21,"verse":"His servants Jozabad son of Shimath and Jehozabad son of Shomer struck him down, and he died. They buried him with his fathers in the City of David. Then his son Amaziah became king in his place."}]