[{"num":12,"verse":"In the seventh year of Yehu, Yehoash (Yoash) began to reign; and arba’im shanah he reigned in Yerushalayim. And shem immo was Tzivyah of Beer Sheva."},{"num":3,"verse":"And Yehoash did that which was yashar in the sight of Hashem all his days wherein Yehoyada HaKohen instructed him."},{"num":4,"verse":"But the high places were not removed; HaAm still sacrificed and burned ketoret at the high places."},{"num":5,"verse":"And Yehoash said to the Kohanim, All the kesef of the kadashim (money offered as holy donations) that is brought into the Bais Hashem, even the kesef of every one numbered in the census [Ex.30:11-16], the kesef nafshot of each one’s valuation (Lev.27:1-8), and all the kesef that cometh from lev ish to bring into the Bais Hashem,"},{"num":6,"verse":"Let the Kohanim receive [kesef, money] to them, every Kohen from his donors; and let the Kohanim repair the breaches of the Bais [Hamikdash], wheresoever any damage shall be found."},{"num":7,"verse":"But it was so, that in the three and twentieth year of Melech Yehoash, the Kohanim had not repaired the breaches of the Bais [Hamikdash]."},{"num":8,"verse":"Then Melech Yehoash summoned Yehoyada HaKohen, and the other Kohanim, and said unto them, Why repair ye not the breaches of the Bais [Hamikdash]? Now therefore receive no more kesef (silver, money) of your donors, but hand it over for the breaches of the Bais."},{"num":9,"verse":"And the Kohanim consented to receive no more kesef of HaAm; also not to repair the breaches of the Bais."},{"num":10,"verse":"But Yehoyada HaKohen took aron echad (a pishkeh), and bored a hole in the lid of it, and placed it beside the Mizbe’ach, on the right side as one cometh into the Bais Hashem; and the Kohanim that were Shomrei HaSaf (Guards of the Threshold) put therein kol hakesef that was brought into the Bais Hashem."},{"num":11,"verse":"And it was so, when they saw that there was much kesef in the aron, that the Sofer HaMelech and the Kohen HaGadol came up, and they put up in bags, and counted the kesef that was found in the Bais Hashem."},{"num":12,"verse":"And they gave the kesef that was weighed out into the hands of the osei hamelachah (workmen) who were hamepekadim (the overseers, supervisors) of the Bais Hashem; and they made the outlay to the woodworkers and the bonim (builders) that wrought upon the Bais Hashem,"},{"num":13,"verse":"And to masons, and stonecutters, and to buy timber and quarried stone to repair the breaches of the Bais Hashem, and for all the outlay for the Bais [Hashem] to repair it."},{"num":14,"verse":"However, for the Bais Hashem no silver bowls, lamp snuffers, tzotzerot (trumpets), vessels of gold or silver, none of these were acquired from the money that was brought into the Bais Hashem."},{"num":15,"verse":"But they gave that money to the osei hamelachah (workmen), and repaired therewith the Bais Hashem."},{"num":16,"verse":"Moreover they audited not the anashim, into whose yad they delivered the kesef to be bestowed on the osei hamelachah (workmen); for they dealt be’emunah (faithfully, honestly)."},{"num":17,"verse":"The kesef asham (money from the guilt offerings) and the kesef chatta’ot (money from the sin offerings) was not brought into the Bais Hashem; it belonged to the Kohanim."},{"num":18,"verse":"Then Chazael Melech Aram (Syria) went up, and fought against Gat, and captured it; and Chazael set his face to go up against Yerushalayim."},{"num":19,"verse":"And Yehoash Melech Yehudah took all the kadashim that Yehoshaphat, and Yehoram, and Achazyahu, his avot, Melachim of Yehudah, had dedicated, and his own kadashim, and all the zahav that was found in the otzarot of the Bais Hashem, and in the Bais HaMelech, and sent them to Chazael Melech Aram; and he withdrew from Yerushalayim."},{"num":20,"verse":"And the rest of the acts of Yoash, and all that he did, are they not written in the Sefer of the Divrei HaYamim L’Malchei Yehudah?"},{"num":21,"verse":"And his avadim arose, and made a kesher (conspiracy), and assassinated Yoash in the Bais Millo, on the way down to Silla."},{"num":22,"verse":"For Yozachar ben Shim’at, and Yehozavad ben Shomer, his avadim, struck him down that he died; and they buried him with his avot in Ir Dovid; and Amatzyah bno reigned in his place."}]