[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(10) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "For I am with thee.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The command was followed by a promise which met the special trial of the time. Men might be against him, but Christ was with him. The general promise given to the Church at large, “Lo! I am with you always” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 28:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), received a personal application, “I am with ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thee;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "” and though called to a life of suffering, there was for the time an assurance that the wrath of men should be restrained, and that his work should not be hindered.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I have much people in this city.—The words remind us once more of those which Elijah had heard at a moment of like weakness, “Yet have I left me seven thousand men in Israel” (1Kings 19:18). Even in the sinful streets of Corinth, among those plunged deepest into its sin (1Corinthians 5:10-11), there were souls yearning for deliverance, in whom conscience was not dead, and was waiting only for the call to repentance.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "I have much people in this city.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The words remind us once more of those which Elijah had heard at a moment of like weakness, “Yet have I left me seven thousand men in Israel” (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Kings 19:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Even in the sinful streets of Corinth, among those plunged deepest into its sin (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Corinthians 5:10-11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), there were souls yearning for deliverance, in whom conscience was not dead, and was waiting only for the call to repentance.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "18:7-11 The Lord knows those that are his, yea, and those that shall be his; for it is by his work upon them that they become his. Let us not despair concerning any place, when even in wicked Corinth Christ had much people. He will gather in his chosen flock from the places where they are scattered Thus encouraged, the apostle continued at Corinth, and a numerous and flourishing church grew up.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "For I am with thee - I will attend, bless, and protect you. See the notes on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 28:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "No man shall set on thee - No one who shall rise up against thee will be able to hurt thee. His life was in God's hands, and he would preserve him in order that his people might be collected into the church.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "For I have - Greek: there is to me; that is, I possess, or there belongs to me.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Much people - Many who should be regarded as his true friends, and who should be saved.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In this city - In that very city that was so voluptuous, so rich, so effeminate, and where there had been already so decided opposition shown to the gospel. This passage evidently means that God had a design or purpose to save many of that people, for it was given to Paul as an encouragement to him to labor there, evidently meaning that God would grant him success in his work. It cannot mean that the Lord meant to say that the great mass of the people, or that the moral and virtuous part, if there were any such, was then regarded as his people; but that he intended to convert many of those guilty and profligate Corinthians to himself, and to gather a people for his own service there. We may learn from this:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) That God has a purpose in regard to the salvation of sinners.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(2) that that purpose is so fixed in the mind of God that he can say that those in relation to whom it is formed are his.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(3) this is the ground of encouragement to the ministers of the gospel. Had God no purpose to save sinners, they could have no hope in their work.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(4) this plan may have reference to the most frivolous, the most guilty, and the most abandoned, and ministers should not be deterred by the amount or the degree of wickedness from attempting to save them.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(5) there may be more hope of success among a dissolute and profligate population, than among proud, cold, and skeptical philosophers. Paul had little success in philosophic Athens; he had great success in dissolute Corinth. There is often more hope of converting a man openly dissolute and abandoned, than one who prides himself on his philosophy, and is confident in his own wisdom. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(5) there may be more hope of success among a dissolute and profligate population, than among proud, cold, and skeptical philosophers. Paul had little success in philosophic Athens; he had great success in dissolute Corinth. There is often more hope of converting a man openly dissolute and abandoned, than one who prides himself on his philosophy, and is confident in his own wisdom. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10. I have much people in this city—\"whom in virtue of their election to eternal life He already designates as His\" (compare Ac 13:48) [Baumgarten].",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Christ, in this vision, useth two arguments to persuade Paul to continue preaching the gospel at Corinth: ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. Because he would be with him, to supply, support, and deliver him; as it is promised to Jeremiah, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Jeremiah 1:19",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 1:19",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and to all the faithful ministers of Christ, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Matthew 28:20",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 28:20",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". This promise was fulfilled to Paul, and to other of God’s servants; whatsoever troubles they met with, even when they were killed, they were not hurt, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Romans 8:36-39",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 8:36-39",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. The other reason why Paul was commanded to tarry was, because there were many that God would have called by his ministry; and thus those who were not his people God calleth his people, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Hosea 1:10 2:23",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 1:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 2:23",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "For I am with thee,.... According to his promise, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 28:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " not only to assist in the ministry of the word, to give light into it, and liberty to preach it, and success in it, but to keep and preserve him from being hurt by men: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and no man shall set on thee; attack thee, or lay hands on thee: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "to hurt thee; to do any injury to thy person, to thy body, in any part of it: wicked men cannot strike a blow, or do the least damage to a servant of Christ without his permission; he can tie their hands, and restrain their rage. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "For I have much people in this city; this wicked and luxurious city; there were many here who were yet in their sins, in a state of unregeneracy, whom God had chosen to be his people, and had taken into his covenant as such; were given to Christ as his peculiar people, and whom he had redeemed with his precious blood: they were his people both by gift and purchase, before they were called by grace; and because of this his interest in them, he will have his Gospel continued for the gathering them in to himself; for Christ will lose none of his, all shall come unto him: from all which it appears, that Christ has a people who are related to him, and he has an interest in, before they are effectually called by grace; for this refers not to the many Corinthians who had heard and believed, and were baptized, but to some that had not, and were yet to be called; not the Jews in this city, Christ's own nation, nor all the inhabitants of it who were in some sense Christ's people, being made and supported in their beings by him, are intended; but a special people among the Gentiles, the same with the other sheep Christ speaks of, John 10:16 not yet of his fold; a people beloved of God, chosen in Christ, given to him, and with whom a covenant was made in him, for whom Christ undertook, in whose name he acted, and for whom he received blessings and promises, as well as took the care and charge of their persons; for the sake of these he assumed human nature, and suffered and died; towards these his heart always is; his eye is upon them, and he knows them, and where they are; and therefore he will look them up and find them out, and they shall be brought to believe in him, and shall not perish, but have everlasting life: and it may be further observed, that Christ has \"many\" such, though they are but comparatively few, yet in themselves they are a great number; yea, he has sometimes many of these in the worst of places, and among the vilest of men; and for the sake of these, in order to select and separate them from the rest, is the Gospel preached and continued. The ministers of it are sent here and there, where such persons are, and there they are continued till they are gathered in; yea, on this account both the Gospel and its preachers are continued in the world; and even the world itself, for the sake of these, till they are brought in, and then it will be destroyed; and it may be also remarked, that for the encouragement of Gospel ministers, Christ promises his presence and protection, and which was fulfilled in the Apostle Paul at Corinth; who though he stayed there a year and six months, none were suffered to do him any injury; and when an insurrection was made within that time, yet the apostle escaped, and quietly departed elsewhere. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "For I have much people in this city; this wicked and luxurious city; there were many here who were yet in their sins, in a state of unregeneracy, whom God had chosen to be his people, and had taken into his covenant as such; were given to Christ as his peculiar people, and whom he had redeemed with his precious blood: they were his people both by gift and purchase, before they were called by grace; and because of this his interest in them, he will have his Gospel continued for the gathering them in to himself; for Christ will lose none of his, all shall come unto him: from all which it appears, that Christ has a people who are related to him, and he has an interest in, before they are effectually called by grace; for this refers not to the many Corinthians who had heard and believed, and were baptized, but to some that had not, and were yet to be called; not the Jews in this city, Christ's own nation, nor all the inhabitants of it who were in some sense Christ's people, being made and supported in their beings by him, are intended; but a special people among the Gentiles, the same with the other sheep Christ speaks of, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 10:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " not yet of his fold; a people beloved of God, chosen in Christ, given to him, and with whom a covenant was made in him, for whom Christ undertook, in whose name he acted, and for whom he received blessings and promises, as well as took the care and charge of their persons; for the sake of these he assumed human nature, and suffered and died; towards these his heart always is; his eye is upon them, and he knows them, and where they are; and therefore he will look them up and find them out, and they shall be brought to believe in him, and shall not perish, but have everlasting life: and it may be further observed, that Christ has \"many\" such, though they are but comparatively few, yet in themselves they are a great number; yea, he has sometimes many of these in the worst of places, and among the vilest of men; and for the sake of these, in order to select and separate them from the rest, is the Gospel preached and continued. The ministers of it are sent here and there, where such persons are, and there they are continued till they are gathered in; yea, on this account both the Gospel and its preachers are continued in the world; and even the world itself, for the sake of these, till they are brought in, and then it will be destroyed; and it may be also remarked, that for the encouragement of Gospel ministers, Christ promises his presence and protection, and which was fulfilled in the Apostle Paul at Corinth; who though he stayed there a year and six months, none were suffered to do him any injury; and when an insurrection was made within that time, yet the apostle escaped, and quietly departed elsewhere. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "For I am with thee, and no man shall set on thee to hurt thee: for I have much people in this city.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 18:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "διότι ἐγώ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "fundamentum fiduciæ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Bengel.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐπιθ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".: only here in this sense, but so in LXX, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "aggrediri, cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 43:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 21:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 23:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jdg 16:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τοῦ κακῶσαι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": infinitive with ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τοῦ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", probably to express conceived or intended result, Burton, p. 157 and also p. 148, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", an event indicated by the context not to have actually taken place.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "λαός",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": “qui mei sunt et mei fient”: Bengel—even in Corinth, proverbial for its vice, Christ has His “chosen people,” and in Cenchreae, where all the vices of a seafaring population found a home, “Christianity wrought its miracle,” so Renan, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Saint Paul",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", p. 219, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the Apostle’s own description, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 6:9-11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : “in Corinth the Gospel had been put to a supreme test, and nowhere had it triumphed more gloriously”. No wonder that in facing this stronghold of the powers of darkness St. Paul needed an assurance similar to that which cheered the heart of an Elijah, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 19:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". But whilst the new faith thus gained adherents chiefly from the lowest social grade, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " also ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 1:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which indicates that there were some in the higher social ranks and some versed in the learning of the schools who welcomed the Gospel; to a Crispus, a Gaius, a Stephanas, we may add Erastus, the public treasurer of the city, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 16:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", an office which in a place like Corinth carried with it considerable influence and position (as even Renan admits, although he regards him as the only adherent won from the upper classes), and the readiness with which the Corinthian Church responded to St. Paul’s appeal for the poor saints indicates that many of its members had some means at their disposal (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the striking account of Paul’s work at Corinth by McGiffert, p. 267, and Orr, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Some Neglected Factors in Early Christianity",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", p. 108).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for I am with thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The pronoun is expressed emphatically in the Greek, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and no man shall set on thee to hurt",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "harm",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". There will be assailants. Christ does not promise him freedom from attack. But the enemy shall not be able to do him violence. And this appearance of Christ would give the Apostle the confidence of the prophet of old (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 6:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), “They that be with us are more than they that be with them.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for I have much people in this city",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] How important and extensive was the Christian community at Corinth we may gather from the Epistles which St Paul wrote afterwards to the Church there. And as the city was one of the great centres of commercial activity at this period, we can see how important it was (humanly speaking) for the Church to make good its footing there from the first. The Lord mercifully by this vision gave his servant assurance that his words should be largely blessed, and rising up thus comforted, he was ready for any task.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 18:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἐγὼ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") The foundation of confidence.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οὐδεὶς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "no man",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") This is fulfilled in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 18:14-15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐπιθήσεται",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "will set on, will direct himself against",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Neuter, as frequently in the LXX.—[",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "λαὸς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πολὺς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "people—much",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Since so few at Athens had received the faith, the comfort now administered was of the greatest advantage to him; and accordingly he subsequently exhibited extraordinary patience in bearing with the Corinthians, with the hope that their nation might be won over to the faith, of whom he might otherwise have become easily wearied: ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Corinthians 10:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “Having in a readiness to revenge all disobedience, when your obedience is fulfilled.”—V. g.]",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 10.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "- Harm",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "hurt",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", A.V. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "I have much people",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc. We may infer from this intimation from him who \"knoweth them that are his,\" which led to St. Paul staying on at Corinth upwards of a year and six months (ver. 11), that the shortness of his stay at Athens was because the Lord had not much people there. For the encouraging promise of protection in the midst of danger given to St. Paul by Christ in this vision, comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 1:17-19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Acts 18:10",
        "children": []
      }
    ]
  }
]