[{"num":3,"verse":"And when the seventh month was come, and the sons of Israel were in their cities. And the people was gathered as one man into Jerusalem. (And when the seventh month had come, with all the Israelites in their cities, then the people gathered together as one person in Jerusalem.)"},{"num":2,"verse":"And Joshua, the son of Jozadak, rose up, and his brethren, (the) priests, and Zerubbabel, the son of Salathiel, and his brethren, and they builded the altar of God of Israel for to offer thereupon burnt sacrifices, as it is written in the law of Moses, the man of God. (And Jeshua, the son of Jozadak, rose up, and his fellow priests, and Zerubbabel, the son of Salathiel, and his kinsmen, and they rebuilt the altar of the God of Israel to offer burnt sacrifices upon, as it is written in the Law of Moses, the man of God.)"},{"num":3,"verse":"And they setted the altar upon his foundaments, while the peoples of (the) lands by compass made them afeared; and they offered upon that altar burnt sacrifices to the Lord in the morrowtide and eventide. (And they put the altar on its foundation, or on its base, for the peoples of the lands all about had made them afraid; and they offered on that altar burnt sacrifices to the Lord in the morning and in the evening.)"},{"num":4,"verse":"And they made the solemnity of tabernacles, as it is written, and they offered burnt sacrifice(s) each day by order, by the work of the day commanded in his day. (And they kept the Feast of Tabernacles, as it is written, and offered the daily burnt sacrifices in order, as the custom of each day required.)"},{"num":5,"verse":"And after this they offered the continual burnt sacrifice, both in calends and in all solemnities of the Lord, that were hallowed, and in all, in which (a) gift was offered to the Lord by free will. (And in addition to this, they offered the continual burnt sacrifices that were ordained, and the sacrifices, or the offerings, on calends, that is, on the first day of the month, and at all the Feasts to honour the Lord, as well as all the freewill offerings, or gifts, that were given to the Lord.)"},{"num":6,"verse":"In the first day of the seventh month they began to offer burnt sacrifice(s) to the Lord; certainly the temple of God was not founded yet. (On the first day of the seventh month they began to offer the burnt sacrifices to the Lord, even though the foundation of the Temple of God had not yet been laid.)"},{"num":7,"verse":"But they gave money to the hewers of stone(s), and to the layers of stone(s), and they gave meat, and drink, and oil, to men of Sidon, and to men of Tyre, that they should bring cedar trees from the Lebanon to the sea of Joppa, by that that Cyrus, king of Persia, had commanded to them. (And they gave money to the stone-cutters, and to the stone-layers, and they gave food, and drink, and oil, to men of Sidon, and to men of Tyre, to bring cedar wood from Lebanon over the sea to Joppa, as Cyrus, the king of Persia, had commanded them.)"},{"num":8,"verse":"And in the second year of their coming to the temple of God in Jerusalem, in the second month, Zerubbabel, the son of Salathiel, and Joshua, the son of Jozadak, and others of their brethren, priests and deacons, and all that came from the captivity into Jerusalem, began the work of God’s temple; and they ordained deacons, from twenty years and above, for to hasten the work of the Lord; (And so in the second year of their coming back to rebuild the Temple of God in Jerusalem, in the second month, Zerubbabel, the son of Salathiel, and Jeshua, the son of Jozadak, and others of their kinsmen, the priests and the Levites, and all who came back from the captivity to Jerusalem, began work on God’s Temple; and they ordained the Levites, from twenty years of age and older, to oversee, or to supervise, the work of the Lord;)"},{"num":9,"verse":"and Joshua stood, and his sons, and his brethren, Kadmiel and his sons, and the sons of Judah together, as one man, to be busy over them that made the work in the temple of God; and the sons of Henadad, (with) their sons, and their brethren, (the) deacons. (and Jeshua, and his sons, and his kinsmen, and Kadmiel, and his sons, the sons of Judah/the sons of Hodaviah, all stood together as one person, to oversee those who did the work in the Temple of God; and they were helped by the sons of Henadad, with their sons, and their kinsmen, the Levites.)"},{"num":10,"verse":"Therefore when the temple of the Lord was founded of stone-layers, (the) priests stood in their ornaments with trumps, and (the) deacons, the sons of Asaph, stood singing in cymbals, for to praise God, by the hand, or ordinance, of David, king of Israel. (And so when the stone-layers laid the foundation of the Temple of the Lord, the priests, wearing their adornments, stood blowing trumpets, and the Levites, the sons of Asaph, stood singing with cymbals, to praise God, in the manner ordained by David, the king of Israel.)"},{"num":11,"verse":"And they sang together in hymns and acknowledging to the Lord, (singing,) For he is good, for his mercy is without end upon Israel. And all the people cried with [a] great cry, in praising the Lord, for the temple of the Lord was founded. (And they sang together with hymns and thanksgiving to the Lord, singing, For he is good, and his mercy is upon Israel forevermore. And all the people cried out with a great shout, praising the Lord, for the foundation of the Temple of the Lord had been laid.)"},{"num":12,"verse":"Also full many of the priests, and of the deacons, and the princes of (the) fathers, and the elder men, that had seen the former temple, when it was founded, and (now) saw this temple before their eyes, wept with great voice, and many men crying in great gladness raised up the voice; (And a great many of the priests, and the Levites, and the leaders of the families of the tribes, and the elders, who had seen the first Temple, and now saw the foundation for this Temple laid before their eyes, wept with a great wailing, and many others raised up their voices, and shouted with great gladness;)"},{"num":13,"verse":"and no man might know the voice of cry of the men being glad, and the voice of weeping of the people; for the people cried together with [a] great cry, and the voice of them was heard afar. (and no one could distinguish between the sound of the people being glad, and the sound of the people weeping; for the people cried out with such a great shout, or with such noise, and their sound was heard afar off.)"}]