[{"num":11,"verse":"Then He was praying in a certain place; and when He stopped, one of His disciples said to Him, Lord, teach us to pray, [just] as John taught his disciples."},{"num":2,"verse":"And He said to them, When you pray, say: Our Father Who is in heaven, hallowed be Your name, Your kingdom come. Your will be done [held holy and revered] on earth as it is in heaven."},{"num":3,"verse":"Give us daily our bread [food for the morrow]."},{"num":4,"verse":"And forgive us our sins, for we ourselves also forgive everyone who is indebted to us [who has offended us or done us wrong]. And bring us not into temptation but rescue us from evil."},{"num":5,"verse":"And He said to them, Which of you who has a friend will go to him at midnight and will say to him, Friend, lend me three loaves [of bread],"},{"num":6,"verse":"For a friend of mine who is on a journey has just come, and I have nothing to put before him;"},{"num":7,"verse":"And he from within will answer, Do not disturb me; the door is now closed, and my children are with me in bed; I cannot get up and supply you [with anything]?"},{"num":8,"verse":"I tell you, although he will not get up and supply him anything because he is his friend, yet because of his shameless persistence and insistence he will get up and give him as much as he needs."},{"num":9,"verse":"So I say to you, Ask and keep on asking and it shall be given you; seek and keep on seeking and you shall find; knock and keep on knocking and the door shall be opened to you."},{"num":10,"verse":"For everyone who asks and keeps on asking receives; and he who seeks and keeps on seeking finds; and to him who knocks and keeps on knocking, the door shall be opened."},{"num":11,"verse":"What father among you, if his son asks for a loaf of bread, will give him a stone; or if he asks for a fish, will instead of a fish give him a serpent?"},{"num":12,"verse":"Or if he asks for an egg, will give him a scorpion?"},{"num":13,"verse":"If you then, evil as you are, know how to give good gifts [gifts that are to their advantage] to your children, how much more will your heavenly Father give the Holy Spirit to those who ask and continue to ask Him!"},{"num":14,"verse":"Now Jesus was driving out a demon that was dumb; and it occurred that when the demon had gone out, the dumb man spoke. And the crowds marveled."},{"num":15,"verse":"But some of them said, He drives out demons [because He is in league with and] by Beelzebub, the prince of demons,"},{"num":16,"verse":"While others, to try and test and tempt Him, demanded a sign of Him from heaven."},{"num":17,"verse":"But He, [well] aware of their intent and purpose, said to them, Every kingdom split up against itself is doomed and brought to desolation, and so house falls upon house. [The disunited household will collapse.]"},{"num":18,"verse":"And if Satan also is divided against himself, how will his kingdom last? For you say that I expel demons with the help of and by Beelzebub."},{"num":19,"verse":"Now if I expel demons with the help of and by Beelzebub, with whose help and by whom do your sons drive them out? Therefore they shall be your judges."},{"num":20,"verse":"But if I drive out the demons by the finger of God, then the kingdom of God has [already] come upon you."},{"num":21,"verse":"When the strong man, fully armed, [from his courtyard] guards his own dwelling, his belongings are undisturbed [his property is at peace and is secure]."},{"num":22,"verse":"But when one stronger than he attacks him and conquers him, he robs him of his whole armor on which he had relied and divides up and distributes all his goods as plunder (spoil)."},{"num":23,"verse":"He who is not with Me [siding and believing with Me] is against Me, and he who does not gather with Me [engage in My interest], scatters."},{"num":24,"verse":"When the unclean spirit has gone out of a person, it roams through waterless places in search [of a place] of rest (release, refreshment, ease); and finding none it says, I will go back to my house from which I came."},{"num":25,"verse":"And when it arrives, it finds [the place] swept and put in order and furnished and decorated."},{"num":26,"verse":"And it goes and brings other spirits, seven [of them], more evil than itself, and they enter in, settle down, and dwell there; and the last state of that person is worse than the first."},{"num":27,"verse":"Now it occurred that as He was saying these things, a certain woman in the crowd raised her voice and said to Him, Blessed (happy and to be envied) is the womb that bore You and the breasts that You sucked!"},{"num":28,"verse":"But He said, Blessed (happy and to be envied) rather are those who hear the Word of God and obey and practice it!"},{"num":29,"verse":"Now as the crowds were [increasingly] thronging Him, He began to say, This present generation is a wicked one; it seeks and demands a sign (miracle), but no sign shall be given to it except the sign of Jonah [the prophet]."},{"num":30,"verse":"For [just] as Jonah became a sign to the people of Nineveh, so will also the Son of Man be [a sign] to this age and generation."},{"num":31,"verse":"The queen of the South will arise in the judgment with the people of this age and generation and condemn them; for she came from the ends of the [inhabited] earth to listen to the wisdom of Solomon, and notice, here is more than Solomon."},{"num":32,"verse":"The men of Nineveh will appear as witnesses at the judgment with this generation and will condemn it; for they repented at the preaching of Jonah, and behold, here is more than Jonah."},{"num":33,"verse":"No one after lighting a lamp puts it in a cellar or crypt or under a bushel measure, but on a lampstand, that those who are coming in may see the light."},{"num":34,"verse":"Your eye is the lamp of your body; when your eye (your conscience) is sound and fulfilling its office, your whole body is full of light; but when it is not sound and is not fulfilling its office, your body is full of darkness."},{"num":35,"verse":"Be careful, therefore, that the light that is in you is not darkness."},{"num":36,"verse":"If then your entire body is illuminated, having no part dark, it will be wholly bright [with light], as when a lamp with its bright rays gives you light."},{"num":37,"verse":"Now while Jesus was speaking, a Pharisee invited Him to take dinner with him, so He entered and reclined at table."},{"num":38,"verse":"The Pharisee noticed and was astonished [to see] that Jesus did not first wash before dinner."},{"num":39,"verse":"But the Lord said to him, Now you Pharisees cleanse the outside of the cup and of the plate, but inside you yourselves are full of greed and robbery and extortion and malice and wickedness."},{"num":40,"verse":"You senseless (foolish, stupid) ones [acting without reflection or intelligence]! Did not He Who made the outside make the inside also?"},{"num":41,"verse":"But [dedicate your inner self and] give as donations to the poor of those things which are within [of inward righteousness] and behold, everything is purified and clean for you."},{"num":42,"verse":"But woe to you, Pharisees! For you tithe mint and rue and every [little] herb, but disregard and neglect justice and the love of God. These you ought to have done without leaving the others undone."},{"num":43,"verse":"Woe to you, Pharisees! For you love the best seats in the synagogues and [you love] to be greeted and bowed down to in the [public] marketplaces."},{"num":44,"verse":"Woe to you! For you are like graves which are not marked or seen, and men walk over them without being aware of it [and are ceremonially defiled]."},{"num":45,"verse":"One of the experts in the [Mosaic] Law answered Him, Teacher, in saying this, You reproach and outrage and affront even us!"},{"num":46,"verse":"But He said, Woe to you, the lawyers, also! For you load men with oppressive burdens hard to bear, and you do not personally [even gently] touch the burdens with one of your fingers."},{"num":47,"verse":"Woe to you! For you are rebuilding and repairing the tombs of the prophets, whom your fathers killed (destroyed)."},{"num":48,"verse":"So you bear witness and give your full approval and consent to the deeds of your fathers; for they actually killed them, and you rebuild and repair monuments to them."},{"num":49,"verse":"For this reason also the wisdom of God said, I will send them prophets and apostles, [some] of whom they will put to death and persecute,"},{"num":50,"verse":"So that the blood of all the prophets shed from the foundation of the world may be charged against and required of this age and generation,"},{"num":51,"verse":"From the blood of Abel to the blood of Zechariah, who was slain between the altar and the sanctuary. Yes, I tell you, it shall be charged against and required of this age and generation."},{"num":52,"verse":"Woe to you, lawyers (experts in the Mosaic Law)! For you have taken away the key to knowledge; you did not go in yourselves, and you hindered and prevented those who were entering."},{"num":53,"verse":"As He left there, the scribes and the Pharisees [followed Him closely, and they] began to be enraged with and set themselves violently against Him and to draw Him out and provoke Him to speak of many things,"},{"num":54,"verse":"Secretly watching and plotting and lying in wait for Him, to seize upon something He might say [that they might accuse Him]."}]