[{"header":"Jesus Teaches About Prayer(A)"},{"num":11,"verse":"One time Jesus was out praying, and when he finished, one of his followers said to him, “John taught his followers how to pray. Lord, teach us how to pray too.”"},{"num":2,"verse":"Jesus said to the followers, “This is how you should pray:"},{"header":"Ask God for What You Need(B)"},{"num":5,"verse":"Then Jesus said to them, “Suppose one of you went to your friend’s house very late at night and said to him, ‘A friend of mine has come into town to visit me. But I have nothing for him to eat. Please give me three loaves of bread.’"},{"num":7,"verse":"Your friend inside the house answers, ‘Go away! Don’t bother me! The door is already locked. My children and I are in bed. I cannot get up and give you the bread now.’"},{"num":8,"verse":"I tell you, maybe friendship is not enough to make him get up to give you the bread. But he will surely get up to give you what you need if you continue to ask."},{"num":9,"verse":"So I tell you, continue to ask, and God will give to you. Continue to search, and you will find. Continue to knock, and the door will open for you."},{"num":10,"verse":"Yes, whoever continues to ask will receive. Whoever continues to look will find. And whoever continues to knock will have the door opened for them."},{"num":11,"verse":"Do any of you have a son? What would you do if your son asked you for a fish? Would any father give him a snake?"},{"num":12,"verse":"Or, if he asked for an egg, would you give him a scorpion? Of course not!"},{"num":13,"verse":"Even you who are bad know how to give good things to your children. So surely your heavenly Father knows how to give the Holy Spirit to the people who ask him.”"},{"header":"Jesus’ Power Is From God(C)"},{"num":14,"verse":"One time Jesus was sending a demon out of a man who could not talk. When the demon came out, the man was able to speak. The crowds were amazed."},{"num":15,"verse":"But some of the people said, “He uses the power of Satan to force demons out of people. Satan is the ruler of demons.”"},{"num":16,"verse":"Some others there wanted to test Jesus. They asked him to do a miracle as a sign from God."},{"num":17,"verse":"But he knew what they were thinking. So he said to them, “Every kingdom that fights against itself will be destroyed. And a family that fights against itself will break apart."},{"num":18,"verse":"So if Satan is fighting against himself, how will his kingdom survive? You say that I use the power of Satan to force out demons."},{"num":19,"verse":"But if I use Satan’s power to force out demons, then what power do your people use when they force out demons? So your own people will prove that you are wrong."},{"num":20,"verse":"But I use the power of God to force out demons. This shows that God’s kingdom has now come to you."},{"num":21,"verse":"“When a strong man with many weapons guards his own house, the things in his house are safe."},{"num":22,"verse":"But suppose a stronger man comes and defeats him. The stronger man will take away the weapons that the first man trusted to keep his house safe. Then the stronger man will do what he wants with the other man’s things."},{"num":23,"verse":"“Whoever is not with me is against me. And anyone who does not work with me is working against me."},{"header":"The Danger of Emptiness(D)"},{"num":24,"verse":"“When an evil spirit comes out of someone, it travels through dry places, looking for a place to rest. But it finds no place to rest. So it says, ‘I will go back to the home I left.’"},{"num":25,"verse":"When it comes back, it finds that home all neat and clean."},{"num":26,"verse":"Then the evil spirit goes out and brings back seven other spirits more evil than itself. They all go and live there, and that person has even more trouble than before.”"},{"header":"The People God Blesses"},{"num":27,"verse":"As Jesus was saying these things, a woman with the people there called out to him, “Blessings from God belong to the woman who gave birth to you and fed you!”"},{"num":28,"verse":"But Jesus said, “The people who hear the teaching of God and obey it—they are the ones who have God’s blessing.”"},{"header":"Some People Doubt Jesus’ Authority(E)"},{"num":29,"verse":"The crowd grew larger and larger. Jesus said, “The people who live today are evil. They ask for a miracle as a sign from God. But no miracle will be done to prove anything to them. The only sign will be the miracle that happened to Jonah."},{"num":30,"verse":"Jonah was a sign for those who lived in Nineveh. It is the same with the Son of Man. He will be a sign for the people of this time."},{"num":31,"verse":"“On the judgment day, you people who live now will be compared with the queen of the South, and she will be a witness who shows how guilty you are. Why do I say this? Because she traveled from far, far away to listen to Solomon’s wise teaching. And I tell you that someone greater than Solomon is right here, but you won’t listen!"},{"num":32,"verse":"“On the judgment day, you people who live now will also be compared with the people from Nineveh, and they will be witnesses who show how guilty you are. I say this because when Jonah preached to those people, they changed their hearts and lives. And you are listening to someone greater than Jonah, but you refuse to change!"},{"header":"Be a Light for the World(F)"},{"num":33,"verse":"“No one takes a light and puts it under a bowl or hides it. Instead, they put it on a lampstand so that the people who come in can see."},{"num":34,"verse":"The only source of light for the body is the eye. When you look at people and want to help them, you are full of light. But when you look at people in a selfish way, you are full of darkness."},{"num":35,"verse":"So be careful! Don’t let the light in you become darkness."},{"num":36,"verse":"If you are full of light, and there is no part of you that is dark, then you will be all bright, as though you have the light of a lamp shining on you.”"},{"header":"Jesus Criticizes the Religious Leaders(G)"},{"num":37,"verse":"After Jesus had finished speaking, a Pharisee asked Jesus to eat with him. So he went and took a place at the table."},{"num":38,"verse":"But the Pharisee was surprised when he saw that Jesus did not wash his hands first before the meal."},{"num":39,"verse":"The Lord said to him, “The washing you Pharisees do is like cleaning only the outside of a cup or a dish. But what is inside you? You want only to cheat and hurt people."},{"num":40,"verse":"You are foolish! The same one who made what is outside also made what is inside."},{"num":41,"verse":"So pay attention to what is inside. Give to the people who need help. Then you will be fully clean."},{"num":42,"verse":"“But it will be bad for you Pharisees! You give God a tenth of the food you get, even your mint, your rue, and every other little plant in your garden. But you forget to be fair to others and to love God. These are the things you should do. And you should also continue to do those other things."},{"num":43,"verse":"“It will be bad for you Pharisees because you love to have the most important seats in the synagogues. And you love for people to show respect to you in the marketplaces."},{"num":44,"verse":"It will be bad for you, because you are like hidden graves. People walk on them without knowing it.”"},{"num":45,"verse":"One of the experts in the law said to Jesus, “Teacher, when you say these things about the Pharisees, you are criticizing our group too.”"},{"num":46,"verse":"Jesus answered, “It will be bad for you, you experts in the law! You make strict rules that are very hard for people to obey. You try to force others to obey your rules. But you yourselves don’t even try to follow any of those rules."},{"num":47,"verse":"It will be bad for you, because you build tombs for the prophets. But these are the same prophets your ancestors killed!"},{"num":48,"verse":"And now you show all people that you agree with what your ancestors did. They killed the prophets, and you build tombs for the prophets!"},{"num":49,"verse":"This is why God in his wisdom said, ‘I will send prophets and apostles to them. Some of my prophets and apostles will be killed by evil men. Others will be treated badly.’"},{"num":50,"verse":"“So you people who live now will be punished for the deaths of all the prophets who were killed since the beginning of the world."},{"num":51,"verse":"You will be punished for the killing of Abel. And you will be punished for the killing of Zechariah, who was killed between the altar and the Temple. Yes, I tell you that you people will be punished for them all."},{"num":52,"verse":"“It will be bad for you, you experts in the law! You have taken away the key to learning about God. You yourselves would not learn, and you stopped others from learning too.”"},{"num":53,"verse":"When Jesus went out, the teachers of the law and the Pharisees began to give him much trouble. They tried to make him answer questions about many things."},{"num":54,"verse":"They were trying to find a way to catch Jesus saying something wrong."}]