[{"header":"Worshipers of False Gods"},{"num":14,"verse":"Then some leaders of Israel came and sat down in front of me. "},{"num":2,"verse":"And the Word of the Lord came to me saying, "},{"num":3,"verse":"“Son of man, these men have taken false gods into their hearts. They have put in front of their faces the sin which is the cause of their fall. Should I let Myself be asked questions by them at all? "},{"num":4,"verse":"So speak to them and tell them, ‘The Lord God says, “Every man of Israel who has given his heart to false gods and lets them lead him into sin and then comes to the man of God, I the Lord will answer him, the answer that his many false gods should get, "},{"num":5,"verse":"that I may again have the hearts of the people of Israel who have left Me for their false gods.”’"},{"num":6,"verse":"“So tell the people of Israel, ‘The Lord God says, “Be sorry for your sins and turn away from your false gods. Turn your faces away from all your sinful ways. "},{"num":7,"verse":"If a man of Israel or a stranger living in Israel who turns away from Me and gives his heart to false gods, and worships them, and if he then comes to the man of God to get answers from Me, I the Lord will answer him Myself. "},{"num":8,"verse":"I will set My face against that man and make him something special to see and to speak against. I will cut him off from among My people. And you will know that I am the Lord. "},{"num":9,"verse":"But if the man who speaks in My name is given a false answer, it is I, the Lord, Who has caused him to speak. And I will put out My hand against him and destroy him from among My people Israel. "},{"num":10,"verse":"They will suffer the punishment of their sin. The man who asks the question and the man who speaks to him in My name will both be punished in the same way. "},{"num":11,"verse":"This is so that the people of Israel may no longer turn away from Me, and no longer make themselves sinful with all their wrong-doing. They will be My people and I will be their God,”’ says the Lord God.”"},{"header":"Those Not Faithful Are Judged"},{"num":12,"verse":"Then the Word of the Lord came to me saying, "},{"num":13,"verse":"“Son of man, if a country sins against Me by not being faithful, I will put out My hand against it. I will destroy its store of bread, and send hunger against it, and take away both man and animal from it. "},{"num":14,"verse":"For even if these three men, Noah, Daniel and Job, were in this country, they would save only their own lives by being right and good,” says the Lord God. "},{"num":15,"verse":"“If I sent wild animals to pass through the land to kill its people and destroy it so that no one would go through it because of the wild animals, "},{"num":16,"verse":"even if these three men were in the land, as I live,” says the Lord God, “they could not save their sons or their daughters. They alone would be saved, but the country would be laid waste. "},{"num":17,"verse":"If I bring a sword against that country and say, ‘Let the sword pass through the country and cut off man and animal from it,’ "},{"num":18,"verse":"even if these three men were in the land, as I live,” says the Lord God, “they could not save their sons or their daughters. They alone would be saved. "},{"num":19,"verse":"Or if I send a disease against that country and show My anger by killing, to take away man and animal from it, "},{"num":20,"verse":"even if Noah, Daniel and Job were in the land, as I live,” says the Lord God, “they could not save their son or daughter. They would save only themselves by being right and good."},{"num":21,"verse":"“For the Lord God says, ‘How much worse will it be when I send my four worst punishments against Jerusalem! I will send the sword, hunger, wild animals, and disease, to take away man and animal from it! "},{"num":22,"verse":"Yet there will be some people and their children left alive in it who will be brought out. When they come to you, see how sinful they are. Then you will know that all the trouble I brought upon Jerusalem was right. "},{"num":23,"verse":"It will help you when you see how they act. Then you will know that there was a good reason for everything I did,’ says the Lord God.”"}]