[{"num":15,"verse":"Then tote Pharisees Pharisaios and kai scribes grammateus came proserchomai to ho Jesus Iēsous from apo Jerusalem Hierosolyma,  saying legō, "},{"num":2,"verse":"“ Why dia tis do  · ho your sy disciples mathētēs break parabainō the ho tradition paradosis of  the ho elders presbyteros?  For gar they  do  not ou wash niptō · ho their autos hands cheir when hotan they  eat esthiō bread artos.” "},{"num":3,"verse":"But de he ho answered apokrinomai them autos,  saying legō, “ And kai why dia tis do  you hymeis break parabainō the ho commandment entolē of ho God theos for dia the  sake  of  · ho your hymeis tradition paradosis? "},{"num":4,"verse":"· ho For gar God theos said legō, ‘ Honor timaō your ho father patēr and kai your ho mother mētēr,’  and kai, ‘ Whoever ho speaks kakologeō evil  of  his  father patēr or ē mother mētēr must  be  put teleutaō to  death thanatos.’ "},{"num":5,"verse":"But de you hymeis say legō, ‘ Whoever hos an says legō to  his ho father patēr or ē his ho mother mētēr, “ Whatever hos benefit  you  might  have  received ōpheleō from ek me egō is a  gift dōron to God,” "},{"num":6,"verse":"he  need  not ou mē honor timaō · ho his autos father patēr.’  So kai you  have  nullified akyroō the ho word logos of ho God theos for dia the  sake  of  · ho your hymeis tradition paradosis. "},{"num":7,"verse":"You  hypocrites hypokritēs!  Well kalōs did  Isaiah ēsaias prophesy prophēteuō about peri you hymeis,  when  he  said legō: "},{"num":8,"verse":"· ho ‘ This houtos people laos honors timaō me egō with  their ho lips cheilos,  · ho but de their autos hearts kardia are apechō far porrō from apo me egō. "},{"num":9,"verse":"And de in  vain matēn do  they  worship sebō me egō,  teaching didaskō as  doctrines didaskalia the  commandments entalma of  men anthrōpos.’” "},{"num":10,"verse":"And kai he  called proskaleō the ho crowd ochlos to him and  said legō to  them autos, “ Hear akouō and kai understand syniēmi: "},{"num":11,"verse":"It is  not ou what ho goes eiserchomai into eis the ho mouth stoma that  defiles koinoō a ho person anthrōpos,  but alla what ho comes ekporeuomai out  of ek the ho mouth stoma;  this houtos defiles koinoō a ho person anthrōpos.” "},{"num":12,"verse":"Then tote the ho disciples mathētēs came proserchomai and  said legō to  him autos, “ Do  you  know oida that hoti the ho Pharisees Pharisaios were  offended skandalizō when  they  heard akouō what ho you  said logos?” "},{"num":13,"verse":"And de he ho answered apokrinomai,  saying legō, “ Every pas plant phyteia that hos my egō heavenly ouranios Father patēr did  not ou plant phyteuō · ho · ho will  be  rooted ekrizoō up . "},{"num":14,"verse":"Leave aphiēmi them autos be!  They  are eimi blind typhlos guides hodēgos.  And de if ean a  blind typhlos man  guides hodēgeō a  blind typhlos man ,  both amphoteroi will  fall piptō into eis a  pit bothunos.” "},{"num":15,"verse":"Then de Peter Petros answered apokrinomai · ho him autos,  saying legō, “ Explain phrazō this houtos parable parabolē to  us hēmeis.”  · ho"},{"num":16,"verse":"And de he ho said legō, “ Are eimi you hymeis without  understanding asynetos even kai now akmēn? "},{"num":17,"verse":"Do  you  not ou understand noeō that hoti everything pas that ho goes eisporeuomai into eis the ho mouth stoma passes chōreō through eis the ho stomach koilia and kai is  expelled ekballō into eis the  latrine aphedrōn? "},{"num":18,"verse":"But de the ho things  that  go ekporeuomai out  of ek the ho mouth stoma come exerchomai from ek the ho heart kardia,  and  these kakeinos defile koinoō the ho person anthrōpos. "},{"num":19,"verse":"For gar out ek of  the ho heart kardia come exerchomai evil ponēros thoughts dialogismos,  murder phonos,  adultery moicheia,  sexual porneia immorality ,  theft klopē,  false pseudomartyria witness ,  slander blasphēmia. "},{"num":20,"verse":"These houtos are eimi the ho things  that  defile koinoō a ho person anthrōpos,  · ho but de to  eat esthiō with  unwashed aniptos hands cheir does  not ou defile koinoō a ho person anthrōpos.” "},{"num":21,"verse":"And kai leaving exerchomai there ekeithen,  · ho Jesus Iēsous withdrew anachōreō into eis the ho region meros of  Tyre Tyros and kai Sidon Sidōn. "},{"num":22,"verse":"And kai a  Canaanite Chananaios woman gynē from apo · ho that ekeinos region horion came exerchomai out  and  began  to  shout krazō,  saying legō, “ Have  mercy eleeō on  me egō,  O  Lord kyrios,  Son hyios of  David Dauid;  · ho my egō daughter thugatēr is  horribly kakōs demon-possessed daimonizomai.” "},{"num":23,"verse":"But de he ho answered apokrinomai her autos not ou a  word logos.  And kai his autos disciples mathētēs came proserchomai · ho and  urged erōtaō him autos,  saying legō, “ Send apolyō her autos away,  because hoti she  keeps  shouting krazō after opisthen us hēmeis.” "},{"num":24,"verse":"But de he ho answered apokrinomai,  saying legō, “ I  was  not ou sent apostellō except ei mē to eis the ho lost apollymi sheep probaton · ho of  the  house oikos of  Israel Israēl.” "},{"num":25,"verse":"Then de she ho came erchomai and  knelt proskyneō before  him autos,  saying legō, “ Lord kyrios,  help boētheō me egō!” "},{"num":26,"verse":"And de he ho answered apokrinomai, “ It  is eimi not ou right kalos to  take lambanō · ho bread artos from  the ho children teknon and kai toss ballō it  to  the ho dogs kynarion.” "},{"num":27,"verse":"“ Yes nai,  Lord kyrios,”  she ho · de said legō, “ but gar even kai the ho dogs kynarion feed esthiō on apo the ho crumbs psichion that ho fall piptō from apo · ho their autos masters’ kyrios table trapeza.”  · ho"},{"num":28,"verse":"Then tote Jesus Iēsous answered apokrinomai,  · ho saying legō to  her autos, “ O ō woman gynē,  great megas is  your sy · ho faith pistis!  What hōs you  desire thelō will  be  done ginomai for  you sy.”  And kai her autos daughter thugatēr was  healed iaomai · ho from apo · ho that ekeinos hour hōra. "},{"num":29,"verse":"· kai After  Jesus Iēsous left metabainō from  there ekeithen,  · ho he  passed erchomai by para the ho Sea thalassa of ho Galilee Galilaia and kai went anabainō up  on eis the ho mountain oros where ekei he  sat kathēmai down . "},{"num":30,"verse":"And kai great polys crowds ochlos came proserchomai to  him autos,  bringing echō with meta them heautou those  who  were  lame chōlos,  blind typhlos,  crippled kyllos,  mute kōphos,  and kai many polys others heteros;  and kai they  put rhiptō them autos down  at para · ho his autos feet pous and kai he  healed therapeuō them autos. "},{"num":31,"verse":"So hōste the ho crowd ochlos was  astonished thaumazō when  they  saw blepō the  mute kōphos speaking laleō, the  crippled kyllos restored hygiēs,  · kai the  lame chōlos walking peripateō,  and kai the  blind typhlos seeing blepō,  and kai they  praised doxazō the ho God theos of  Israel Israēl. "},{"num":32,"verse":"· ho Then de Jesus Iēsous called proskaleō · ho his autos disciples mathētēs to him and  said legō, “ I  have  compassion splanchnizomai on epi the ho crowd ochlos because hoti they  have prosmenō already ēdē been  with prosmenō me egō three treis days hēmera and kai have echō nothing ou to  eat esthiō;  and kai I  do thelō not ou want thelō to  send apolyō them autos away  hungry nēstis,  lest mēpote they  faint eklyō from  exhaustion  on en the ho way hodos.” "},{"num":33,"verse":"And kai the  disciples mathētēs said legō to  him autos,  · ho “ Where pothen in en such a  desolate  place erēmia could  we hēmeis find  enough tosoutos bread artos to hōste feed chortazō so  great tosoutos a  crowd ochlos?” "},{"num":34,"verse":"And kai Jesus Iēsous said legō to  them autos,  · ho “ How posos many  loaves artos do  you  have echō?”  And de they ho said legō, “ Seven hepta,  and kai a  few oligos little ichthudion fish .” "},{"num":35,"verse":"And kai instructing parangellō the ho crowd ochlos to  sit anapiptō down  on epi the ho ground gē, "},{"num":36,"verse":"he  took lambanō the ho seven hepta loaves artos and kai the ho fish ichthus:  and kai when  he  had  given  thanks eucharisteō,  he  broke klaō them  and kai began  distributing didōmi them  to  the ho disciples mathētēs,  and de the ho disciples mathētēs to  the ho crowds ochlos. "},{"num":37,"verse":"And kai they  all pas ate esthiō and kai were  filled chortazō;  and kai they  picked  up airō what ho was  left perisseuō over  of  the ho broken klasma pieces ,  seven hepta large  baskets spyris full plērēs. "},{"num":38,"verse":"Not  counting chōris women gynē and kai children paidion,  there ho · de were eimi four  thousand tetrakischilioi men anēr who  had  eaten esthiō. "},{"num":39,"verse":"And kai when  he  had  sent apolyō the ho crowds ochlos away ,  he  got embainō into eis the ho boat ploion and kai went erchomai to eis the ho region horion of  Magadan Magadan. "}]