[[],[{"type":"header","content":"Tradition and Commandment"},{"type":"prose","content":"Then  Pharisees and scribes *came to Jesus from Jerusalem and said,"}],[{"type":"prose","content":"“Why do Your disciples break the tradition of the elders? For they do not wash their hands when they eat bread.”"}],[{"type":"prose","content":"And He answered and said to them, "}],[{"type":"prose","content":"After Jesus called the crowd to Him, He said to them, "}],[{"type":"prose","content":"Then the disciples came and *said to Him, “Do You know that the Pharisees were offended when they heard this statement?”"}],[{"type":"prose","content":"But He answered and said, "}],[{"type":"header","content":"The Heart of Man"},{"type":"prose","content":"Peter said to Him, “Explain the parable to us.”"}],[{"type":"prose","content":"Jesus said, "}],[{"type":"header","content":"The Faith of a Canaanite Woman"},{"type":"prose","content":"Jesus went away from there, and withdrew into the region of Tyre and Sidon."}],[{"type":"prose","content":"And a Canaanite woman from that region came out and  to cry out, saying, “Have mercy on me, Lord, Son of David; my daughter is severely demon-possessed.”"}],[{"type":"prose","content":"But He did not answer her  a word. And His disciples came up and urged Him, saying, “Send her away, because she keeps shouting at us!”"}],[{"type":"prose","content":"But He answered and said, "}],[{"type":"prose","content":"But she came and  to bow down before Him, saying, “Lord, help me!”"}],[{"type":"prose","content":"Yet He answered and said, "}],[{"type":"prose","content":"And she said, “Yes, Lord; , for even the dogs feed on the crumbs that fall from their masters’ table.”"}],[{"type":"prose","content":"Then Jesus said to her,  And her daughter was healed at once."}],[{"type":"header","content":"Healing Crowds"},{"type":"prose","content":"Departing from there, Jesus went along the Sea of Galilee, and after going up on the mountain, He was sitting there."}],[{"type":"prose","content":"And large crowds came to Him bringing with them  limping, had impaired limbs,  blind,  unable to speak, and many others, and they laid them down at His feet; and He healed them."}],[{"type":"prose","content":"So the crowd was astonished as they saw those who were unable to speak talking, those with impaired limbs restored, those who were limping walking around, and those who were blind seeing; and they glorified the God of Israel."}],[{"type":"header","content":"Four Thousand Men Fed"},{"type":"prose","content":"Now Jesus called His disciples to Him and said, "}],[{"type":"prose","content":"The disciples *said to Him, “Where would we get so many loaves in  desolate place to satisfy such a large crowd?”"}],[{"type":"prose","content":"And Jesus *said to them,  And they said, “Seven, and a few small fish.”"}],[{"type":"prose","content":"And He directed the people to sit down on the ground;"}],[{"type":"prose","content":"and He took the seven loaves and the fish; and after giving thanks, He broke them and started giving them to the disciples, and the disciples  to the crowds."}],[{"type":"prose","content":"And they all ate and were satisfied, and they picked up what was left over of the broken pieces, seven large baskets full."}],[{"type":"prose","content":"And those who ate were four thousand men, besides women and children."}],[{"type":"prose","content":"And sending away the crowds, Jesus got into the boat and came to the region of Magadan."}]]