[[],[{"type":"header","content":"Jesus Teaches about Inner Purity"},{"type":"prose","content":"Some Pharisees and teachers of religious law now arrived from Jerusalem to see Jesus. They asked him,"}],[{"type":"prose","content":"“Why do your disciples disobey our age-old tradition? For they ignore our tradition of ceremonial hand washing before they eat.”"}],[{"type":"prose","content":"Jesus replied, "}],[],[],[],[],[{"type":"prose","content":"Then Jesus called to the crowd to come and hear.  he said, "}],[],[{"type":"prose","content":"Then the disciples came to him and asked, “Do you realize you offended the Pharisees by what you just said?”"}],[{"type":"prose","content":"Jesus replied, "}],[],[{"type":"prose","content":"Then Peter said to Jesus, “Explain to us the parable that says people aren’t defiled by what they eat.”"}],[{"type":"prose","content":" Jesus asked."}],[],[],[],[{"type":"header","content":"The Faith of a Gentile Woman"}],[{"type":"prose","content":"Then Jesus left Galilee and went north to the region of Tyre and Sidon."}],[{"type":"prose","content":"A Gentile woman who lived there came to him, pleading, “Have mercy on me, O Lord, Son of David! For my daughter is possessed by a demon that torments her severely.”"}],[{"type":"prose","content":"But Jesus gave her no reply, not even a word. Then his disciples urged him to send her away. “Tell her to go away,” they said. “She is bothering us with all her begging.”"}],[{"type":"prose","content":"Then Jesus said to the woman, "}],[{"type":"prose","content":"But she came and worshiped him, pleading again, “Lord, help me!”"}],[{"type":"prose","content":"Jesus responded, "}],[{"type":"prose","content":"She replied, “That’s true, Lord, but even dogs are allowed to eat the scraps that fall beneath their masters’ table.”"}],[{"type":"prose","content":" Jesus said to her,  And her daughter was instantly healed."},{"type":"header","content":"Jesus Heals Many People"}],[{"type":"prose","content":"Jesus returned to the Sea of Galilee and climbed a hill and sat down."}],[{"type":"prose","content":"A vast crowd brought to him people who were lame, blind, crippled, those who couldn’t speak, and many others. They laid them before Jesus, and he healed them all."}],[{"type":"prose","content":"The crowd was amazed! Those who hadn’t been able to speak were talking, the crippled were made well, the lame were walking, and the blind could see again! And they praised the God of Israel."},{"type":"header","content":"Jesus Feeds Four Thousand"}],[{"type":"prose","content":"Then Jesus called his disciples and told them, "}],[{"type":"prose","content":"The disciples replied, “Where would we get enough food here in the wilderness for such a huge crowd?”"}],[{"type":"prose","content":"Jesus asked, They replied, “Seven loaves, and a few small fish.”"}],[{"type":"prose","content":"So Jesus told all the people to sit down on the ground."}],[{"type":"prose","content":"Then he took the seven loaves and the fish, thanked God for them, and broke them into pieces. He gave them to the disciples, who distributed the food to the crowd."}],[{"type":"prose","content":"They all ate as much as they wanted. Afterward, the disciples picked up seven large baskets of leftover food."}],[{"type":"prose","content":"There were 4,000 men who were fed that day, in addition to all the women and children."}],[{"type":"prose","content":"Then Jesus sent the people home, and he got into a boat and crossed over to the region of Magadan."}]]