[{"num":15,"verse":"Then the scribes and Pharisees from Jerusalem came to Jesus, saying,"},{"num":2,"verse":"“Why do Your disciples transgress the tradition of the elders? For they do not wash their hands when they eat bread.”"},{"num":3,"verse":"But He answered and said to them, “And why do you transgress the commandment of God by your tradition?"},{"num":4,"verse":"“For God has commanded, saying, ‘Honor your father and mother. And the one who curses father or mother, let him die the death.’"},{"num":5,"verse":"“But you say, ‘Whoever shall say to father or mother, “By the gift that is offered by me,” you may have profit;"},{"num":6,"verse":"though he does not honor his father or his mother. Thus, by your tradition, you have made the commandment of God of no authority."},{"num":7,"verse":"“O hypocrites! Isaiah prophesied well of you, saying,"},{"num":8,"verse":"“‘This people draws near to Me with their mouth, and honors Me with the lips, but their heart is far away from Me."},{"num":9,"verse":"‘But they worship Me in vain, teaching men’s precepts as doctrines.’”"},{"num":10,"verse":"Then He called the multitude to Him, and said to them, “Hear, and understand."},{"num":11,"verse":"“That which goes into the mouth, does not defile the man. But that which comes out of the mouth, defiles the man.”"},{"num":12,"verse":"Then His disciples came, and said to Him, “Are you not aware that the Pharisees, having heard this saying, are offended?”"},{"num":13,"verse":"But He answered and said, “Every plant which My Heavenly Father has not planted, shall be rooted up."},{"num":14,"verse":"“Let them be. They are the blind leaders of the blind. And if the blind leads the blind, both shall fall into the ditch.”"},{"num":15,"verse":"Then Peter answered, and said to Him, “Explain the parable to us.”"},{"num":16,"verse":"Then Jesus said, “Are you still without understanding?"},{"num":17,"verse":"“Do you not understand that whatever enters into the mouth, goes into the belly, and is cast out into the drain?"},{"num":18,"verse":"“But those things which proceed out of the mouth come from the heart, and they defile the man."},{"num":19,"verse":"“For out of the heart comes evil thoughts, murders, adulteries, fornications, thefts, false testimonies, slanders."},{"num":20,"verse":"“These are the things which defile the man. But to eat with unwashed hands, does not defile the man.”"},{"num":21,"verse":"And Jesus left there and departed to the region of Tyre and Sidon."},{"num":22,"verse":"And behold, a Gentile woman came out of the same region, and cried, saying to Him, “Have mercy on me, O Lord, the Son of David! My daughter is badly possessed by a demon!”"},{"num":23,"verse":"But He did not answer her a word. Then His disciples came to Him and urged Him, saying, “Send her away. For she cries after us.”"},{"num":24,"verse":"But He answered, and said, “I am not sent, but to the lost sheep of the House of Israel.”"},{"num":25,"verse":"Still, she came and worshipped Him, saying, “Lord help me.”"},{"num":26,"verse":"And He answered, and said, “It is not good to take the children’s bread and cast it to the dogs.”"},{"num":27,"verse":"But she said, “Truth, Lord. Yet, even the dogs eat of the crumbs which fall from their master’s table.”"},{"num":28,"verse":"Then Jesus answered, and said to her, “O, woman. Great is your faith. Let it be as you desire.” And her daughter was made whole at that hour."},{"num":29,"verse":"So Jesus went away from there, and came near to the Sea of Galilee, and went up in a mountain and sat down there."},{"num":30,"verse":"And great multitudes came to Him - having with them lame, blind, mute, maimed, and many others - and cast them down at Jesus’ feet. And He healed them."},{"num":31,"verse":"So much so that the multitude wondered to see the dumb speak, the maimed whole, the lame walk, and the blind see. And they glorified the God of Israel."},{"num":32,"verse":"Then Jesus called His disciples to Him, and said, “I have compassion on this multitude because they have remained with Me three days now and have had nothing to eat. And I will not let them depart fasting, lest they faint on the way.”"},{"num":33,"verse":"And His disciples said to Him, “From where would we get so much bread in the wilderness that would suffice so great a multitude?”"},{"num":34,"verse":"And Jesus said to them, “How many loaves do you have?” And they said, “Seven, and a few little fish.”"},{"num":35,"verse":"Then He commanded the multitude to sit down on the ground."},{"num":36,"verse":"And took the seven loaves, and the fish, and gave thanks; and broke them, and gave them to His disciples. And the disciples gave them to the multitude."},{"num":37,"verse":"And they all ate and were satisfied. And they took up seven baskets full of the fragments that remained."},{"num":38,"verse":"And those who had eaten (besides women and little children) were four thousand men."},{"num":39,"verse":"Then Jesus sent away the multitude. And He took a ship and came into the region of Magdala."}]