[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(3) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He was the son of his old age.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Jacob was ninety-one when Joseph was born; but at Benjamin’s birth he was eight or nine years older; and according to the common belief that Jacob was only twenty years in Padan-aram, the four sons of the handmaids must have been about Joseph’s age, and Leah’s last two sons even younger. But the epithet is intelligible if Jacob had waited twenty-seven years after his marriage with Rachel, before Joseph was born. There would then be a considerable interval between him and the other sons; and though Rachel had a second son some years afterwards, yet Joseph would continue to be the son long looked for, whose birth had given him so great happiness; whereas his joy at Benjamin’s coming was bought at the terrible price of the mother’s death.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "A coat of many colours.—Two explanations are given of this phrase; the first, that it was a long garment with sleeves or fringes; the other, that it was composed of patchwork of various colours. The latter is the more probable interpretation; for from the tomb at Beni-Hassan we learn that such dresses were worn in Palestine, as a train of captive Jebusites is represented upon it clad in rich robes, the patterns of which seem to have been produced by sewing together small pieces of different colours. So also in India beautiful dresses are made by sewing together strips of crimson, purple, and other colours. (Roberts’ Oriental Illustrations, p. 43.) Some have thought that Jacob by this dress marked out Joseph as the future head of the family, in the place of Reuben, supposing it to indicate the priestly office borne by the firstborn; but this is doubtful, and it was Judah to whom Jacob gave the right of primogeniture.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "A coat of many colours.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Two explanations are given of this phrase; the first, that it was a long garment with sleeves or fringes; the other, that it was composed of patchwork of various colours. The latter is the more probable interpretation; for from the tomb at Beni-Hassan we learn that such dresses were worn in Palestine, as a train of captive Jebusites is represented upon it clad in rich robes, the patterns of which seem to have been produced by sewing together small pieces of different colours. So also in India beautiful dresses are made by sewing together strips of crimson, purple, and other colours. (Roberts’ ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Oriental Illustrations, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "p. 43.) Some have thought that Jacob by this dress marked out Joseph as the future head of the family, in the place of Reuben, supposing it to indicate the priestly office borne by the firstborn; but this is doubtful, and it was Judah to whom Jacob gave the right of primogeniture.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 37:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 37:3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The son of his old age — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Born when Jacob was ninety-one years old. Such children are commonly best beloved of their parents. Several of the ancient translations, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Chaldee, Persian, Arabic, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Samaritan, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "render the words a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "wise or prudent son, old age ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "being an emblem of prudence; one born old, wise above his years. Jacob’s other sons had in many things grieved and disgraced him; but Joseph, it seems, gave, while young, indications of that wisdom and piety which adorned his riper years. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "A coat of divers colours — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Interwoven with threads, or made of pieces of divers colours. This probably was meant to signify that further honours were intended him; but it seems to have been an injudicious distinction, and excited the envy of Jacob’s other sons.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "37:1-4 In Joseph's history we see something of Christ, who was first humbled and then exalted. It also shows the lot of Christians, who must through many tribulations enter into the kingdom. It is a history that has none like it, for displaying the various workings of the human mind, both good and bad, and the singular providence of God in making use of them for fulfilling his purposes. Though Joseph was his father's darling, yet he was not bred up in idleness. Those do not truly love their children, who do not use them to business, and labour, and hardships. The fondling of children is with good reason called the spoiling of them. Those who are trained up to do nothing, are likely to be good for nothing. But Jacob made known his love, by dressing Joseph finer than the rest of his children. It is wrong for parents to make a difference between one child and another, unless there is great cause for it, by the children's dutifulness, or undutifulness. When parents make a difference, children soon notice it, and it leads to quarrels in families. Jacob's sons did that, when they were from under his eye, which they durst not have done at home with him; but Joseph gave his father an account of their ill conduct, that he might restrain them. Not as a tale-bearer, to sow discord, but as a faithful brother.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Joseph is the favorite of his father, but not of his brethren. \"In the land of his father's sojournings.\" This contrasts Jacob with Esau, who removed to Mount Seir. This notice precedes the phrase, \"These are the generations.\" The corresponding sentence in the case of Isaac is placed at the end of the preceding section of the narrative ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 25:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"The son of seventeen years;\" in his seventeenth year ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 37:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"The sons of Bilhah.\" The sons of the handmaids were nearer his own age, and perhaps more tolerant of the favorite than the sons of Leah the free wife. Benjamin at this time was about four years of age. \"An evil report of them.\" The unsophisticated child of home is prompt in the disapproval of evil, and frank in the avowal of his feelings. What the evil was we are not informed; but Jacob's full-grown sons were now far from the paternal eye, and prone, as it seems, to give way to temptation. Many scandals come out to view in the chosen family. \"Loved Joseph.\" He was the son of his best-loved wife, and of his old age; as Benjamin had not yet come into much notice. \"A Coat of many colors.\" This was a coat reaching to the hands and feet, worn by persons not much occupied with manual labor, according to the general opinion. It was, we conceive, variegated either by the loom or the needle, and is therefore, well rendered χιτὼν ποικίλος  chitōn poikilos, a motley coat. \"Could not bid peace to him.\" The partiality of his father, exhibited in so weak a manner, provokes the anger of his brothers, who cannot bid him good-day, or greet him in the ordinary terms of good-will.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3. son of his old age—Benjamin being younger, was more the son of his old age and consequently on that ground might have been expected to be the favorite. Literally rendered, it is \"son of old age to him\"—Hebrew phrase, for \"a wise son\"—one who possessed observation and wisdom above his years—an old head on young shoulders.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "made him a coat of many colors—formed in those early days by sewing together patches of colored cloth, and considered a dress of distinction (Jud 5:30; 2Sa 13:18). The passion for various colors still reigns among the Arabs and other people of the East, who are fond of dressing their children in this gaudy attire. But since the art of interweaving various patterns was introduced, \"the coats of colors\" are different now from what they seem to have been in patriarchal times, and bear a close resemblance to the varieties of tartan.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He was the son of his old age, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " being born when Jacob was ninety-one years old. Such children are commonly best beloved by their parents, either because such are a singular blessing of God, and a more than common testimony of his favour, and a mercy least expected by them, and therefore most prized; or because they have more pleasing conversation with them, and less experience of their misbehaviour, of which the elder ofttimes are guilty, whereby they alienate their parents’ affections from them. The ancient translations, Chaldee, Persian, Arabic, and Samaritan, render the words thus, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a wise",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "prudent son; old age",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " being oft mentioned as a token of prudence; one born old, one wise above his years, one that had a grey head, as we say, upon green shoulders. This may seem the more probable, both because Joseph was indeed such a child, and gave good evidence of it in a prudent observation of his brethren’s trespasses, and a discreet choice of the fittest remedy for them; and because the reason here alleged seems proper and peculiar to Joseph; whereas in the other sense it belongs more to Benjamin, who was younger than Joseph, and cost his mother dearer, and therefore might upon that account claim a greater interest in his father’s afflictions. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "A coat of many colours, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " probably made of threads of divers colours interwoven together. Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " 2 Samuel 13:18",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 13:18",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". This he gave him as a token of his special love, and of the rights of the first-born, which being justly taken from Reuben, he conferred upon Joseph, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " 1 Chronicles 5:1",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 5:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Now Israel loved Joseph more than all his children,.... He being the firstborn of his beloved Rachel, and a lovely youth, of a beautiful aspect, very promising, prudent and pious: the reason given in the text follows: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "because he was the son of his old age; being ninety one years of age when he was born; and the youngest children are generally most beloved, and especially such as are born to their parents when in years. Benjamin indeed was younger than Joseph, and is described in like manner, Genesis 44:20; and for this reason one would think had the greatest claim to his father's affections; wherefore some give a different sense of this phrase, and render it, the \"son\" or disciple of \"elders\", \"senators\", i.e. a wise and prudent man: and indeed, if being the son of his old age was the reason of his affection, Benjamin had the best claim to it, being the youngest, and born to him when he was still older; and this sense is countenanced by Onkelos, who renders it,\"because he was a wise son to him:''and so the reason why he loved him more than the rest was, because of his senile wisdom; though a child in years, he was old in wisdom and knowledge. Abendana observes, that it was a custom with old men to take one of their little children to be with them continually, and attend upon them, and minister to them, and lean upon their arm; and such an one was called the son of their old age, because he ministered to them in their old age: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "because he was the son of his old age; being ninety one years of age when he was born; and the youngest children are generally most beloved, and especially such as are born to their parents when in years. Benjamin indeed was younger than Joseph, and is described in like manner, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 44:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and for this reason one would think had the greatest claim to his father's affections; wherefore some give a different sense of this phrase, and render it, the \"son\" or disciple of \"elders\", \"senators\", i.e. a wise and prudent man: and indeed, if being the son of his old age was the reason of his affection, Benjamin had the best claim to it, being the youngest, and born to him when he was still older; and this sense is countenanced by Onkelos, who renders it,\"because he was a wise son to him:''and so the reason why he loved him more than the rest was, because of his senile wisdom; though a child in years, he was old in wisdom and knowledge. Abendana observes, that it was a custom with old men to take one of their little children to be with them continually, and attend upon them, and minister to them, and lean upon their arm; and such an one was called the son of their old age, because he ministered to them in their old age: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and he made him a coat of many colours; that is, had one made for him, which was interwoven with threads of divers colours, or painted, or embroidered with divers figures, or made with different pieces of various colours: according to Jerom (f), it was a garment which reached down to the ankles, and was distinguished with great variety by the hands of the artificer, or which had long sleeves reaching to the hands; and so the Jewish writers (g) say it was called \"passim\", because it reached to the palms of the hands: this might be an emblem of the various virtues which early appeared in him; or rather of the several graces of the Spirit of God implanted in him, and of the raiment of needlework, the righteousness of Christ, with which he was clothed, Psalm 45:14; and of the various providences which Jacob, under a spirit of prophecy, foresaw he would be attended with. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and he made him a coat of many colours; that is, had one made for him, which was interwoven with threads of divers colours, or painted, or embroidered with divers figures, or made with different pieces of various colours: according to Jerom (f), it was a garment which reached down to the ankles, and was distinguished with great variety by the hands of the artificer, or which had long sleeves reaching to the hands; and so the Jewish writers (g) say it was called \"passim\", because it reached to the palms of the hands: this might be an emblem of the various virtues which early appeared in him; or rather of the several graces of the Spirit of God implanted in him, and of the raiment of needlework, the righteousness of Christ, with which he was clothed, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 45:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and of the various providences which Jacob, under a spirit of prophecy, foresaw he would be attended with. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(f) Trad. Heb. in Gen. fol. 72. A. (g) Bereshit Rabba, ut supra. (sect. 84. fol 73.1.) ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(f) Trad. Heb. in Gen. fol. 72. A. (g) Bereshit Rabba, ut supra. (sect. 84. fol 73.1.) ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Now Israel loved Joseph more than all his children, because he was the son of his old age: and he made him a coat of many colors.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Israel",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] In J this name is generally used. Contrast the use of Jacob by P in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Genesis 37:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 37:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the son of his old age",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] This is hardly the description that we should expect from chap. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 30:22-24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which records the birth of Joseph. The phrase is used in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 44:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of Benjamin with greater appropriateness.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a coat of many colours",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, as R.V. marg., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a long garment with sleeves",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The familiar rendering “a coat of many colours,” derived from LXX ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "χιτῶνα ποικίλον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Vulg. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "tunicam polymitam",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is certainly incorrect. It is literally “a tunic of palms,” i.e. reaching to the palms of the hands and the soles of the feet, differing from an ordinary tunic by having sleeves, and by reaching to the feet. The same word is used in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 13:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of a dress worn by a princess, where LXX ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "χιτὼν καρπωτός",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and Lat. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "tunica talaris",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " are correct. The rendering of the margin, of Pesh., Symm. (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "χειριδωτόν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") and Aquila (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "χιτὼν ἀστραγάλων",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), if less picturesque, is more accurate.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The unwise favouritism shewn by his father heightened the unpopularity of the boy.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "3, 4 (J). Joseph and his Brethren",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 3.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Now",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (literally, and) ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Israel loved Joseph more than all his children",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (literally, sons), ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "because he was the son of his old age",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "a son of old age",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (was) he ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "to him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; not a son possessing the wisdom of advanced years (Onkelos), but a son born in his old age (Rosenmüller, Keil, Kalisch, et ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "alii",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), which was literally true of Joseph, since he was born in his father's ninety-first year. Yet as Joseph was only a year or two younger than the children of Bilhah and Zilpah, and as Benjamin was still later born than he, the application of this epithet to Joseph has been explained on the ground that Benjamin was at this time little more than a child (Keil), and had not much come into notice (Murphy), or perhaps was not born when this portion of the narrative was originally written ('Speaker's Commentary); or that Joseph had obtained the name before Benjamin's birth, and that it had clung to him after that event (Inglis). Josephus ('Ant.,' 2:02, 1) gives another reason for Jacob's partiality which is not inconsistent with the statement in the text, viz., the beauty of his person and the virtue of his mind, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "διὰ τε τὴν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "τοῦ σώματος εὐγένειαν καὶ διά ψυχῆς ἀρετής",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "And he made him a coat of many colors",
        "children": [
          {
            "element": "span",
            "class": "cmt_word",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "And he made him a coat of many colors",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " - literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "a coat",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "kithoneth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", from ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "kathan",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to cover; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "vide Genesis",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " 3:21) of ends (Keil, Lange), ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a tunic reaching to the ancles, and with sleeves reaching to the wrists, and commonly worn by boys and girls of the upper ranks (Josephus, 'Ant.,' 7:08, 9; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 13:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), or a coat of pieces (Kalisch, T. Lewis, Wordsworth); hence a variegated garment, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "χιτὼν ποικίλος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (LXX.), ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "tunica polymita",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Vulgate), a coat of many colors (Murphy, 'Speaker's Commentary'). \"Such garments are represented on some of the monuments of Egypt. At Beni-Hassan, for example, there is a magnificent excavation forming the tomb of Pihrai, a military officer of Osirtasen I., in which a train of foreign captives appears, who are supposed to be Jebusites, an inscription over one person in the group reading, \"The Chief of the Land of the Jebusites. 'The whole of the captives are clad in parti-colored garments, and the tunic of this individual in particular may be called \"a coat of many colors\" (Thornlcy Smith, 'Joseph and his Times,' p. 12). It has been supposed that Jacob's object in conferring this distinction on Joseph was to mark him out as the heir to whom the forfeited birthright of Reuben (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 5:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") was to be transferred (Kurtz, Lange, Gerlach, Bush, Wordsworth, 'Speaker's Commentary,' &c.); but the historian only mentions it as a token of affection, such as was customary in those times for princes to bestow upon their subjects, and parents on their children (vide Thornley Smith, 'Joseph and his Times,' p. 11). Roberts says the same thing is still done among the Hindoos, crimson, purple, and other colors being often tastefully sewed together for beautiful or favored children (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "vide",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " 'Oriental Illustrations,' p. 43). Genesis 37:3",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "\"Israel (Jacob) loved Joseph more than all his (other) sons, because he was born in his old age,\" as the first-fruits of the beloved Rachel (Benjamin was hardly a year old at this time). And he made him פּסּים כּתנת: a long coat with sleeves (χιτὼν ἀστραγάλειος, Aqu., or ἀστραγαλωτός, lxx at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 13:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", tunica talaris, Vulg. ad Sam.), i.e., an upper coat reaching to the wrists and ankles, such as noblemen and kings' daughters wore, not \"a coat of many colours\" (\"bunter Rock,\" as Luther renders it, from the χιτῶνα ποικίλον, tunicam polymitam, of the lxx and Vulgate). This partiality made Joseph hated by his brethren; so that they could not \"speak peaceably unto him,\" i.e., ask him how he was, offer him the usual salutation, \"Peace be with thee.\" ",
        "children": []
      }
    ]
  }
]