[{"header":"The Assyrians Threaten Jerusalem(A)"},{"num":32,"verse":"After these events, in which King Hezekiah served the Lord faithfully, Sennacherib, the emperor of Assyria, invaded Judah. He besieged the fortified cities and gave orders for his army to break their way through the walls. "},{"num":2,"verse":"When Hezekiah saw that Sennacherib intended to attack Jerusalem also, "},{"num":3,"verse":"he and his officials decided to cut off the supply of water outside the city in order to keep the Assyrians from having any water when they got near Jerusalem. The officials led a large number of people out and stopped up all the springs, so that no more water flowed out of them. "},{"num":5,"verse":"The king strengthened the city's defenses by repairing the wall, building towers on it, and building an outer wall. In addition, he repaired the defenses built on the land that was filled in on the east side of the old part of Jerusalem. He also had a large number of spears and shields made. "},{"num":6,"verse":"He placed all the men in the city under the command of army officers and had them assemble in the open square at the city gate. He said to them, "},{"num":7,"verse":"“Be determined and confident, and don't be afraid of the Assyrian emperor or of the army he is leading. We have more power on our side than he has on his. "},{"num":8,"verse":"He has human power, but we have the Lord our God to help us and to fight our battles.” The people were encouraged by these words of their king."},{"num":9,"verse":"Some time later, while Sennacherib and his army were still at Lachish, he sent the following message to Hezekiah and the people of Judah who were with him in Jerusalem: "},{"num":10,"verse":"“I, Sennacherib, Emperor of Assyria, ask what gives you people the confidence to remain in Jerusalem under siege. "},{"num":11,"verse":"Hezekiah tells you that the Lord your God will save you from our power, but Hezekiah is deceiving you and will let you die of hunger and thirst. "},{"num":12,"verse":"He is the one who destroyed the Lord's shrines and altars and then told the people of Judah and Jerusalem to worship and burn incense at one altar only. "},{"num":13,"verse":"Don't you know what my ancestors and I have done to the people of other nations? Did the gods of any other nation save their people from the emperor of Assyria? "},{"num":14,"verse":"When did any of the gods of all those countries ever save their country from us? Then what makes you think that your god can save you? "},{"num":15,"verse":"Now don't let Hezekiah deceive you or mislead you like that. Don't believe him! No god of any nation has ever been able to save his people from any Assyrian emperor. So certainly this god of yours can't save you!”"},{"num":16,"verse":"The Assyrian officials said even worse things about the Lord God and Hezekiah, the Lord's servant. "},{"num":17,"verse":"The letter that the emperor wrote defied the Lord, the God of Israel. It said, “The gods of the nations have not saved their people from my power, and neither will Hezekiah's god save his people from me.” "},{"num":18,"verse":"The officials shouted this in Hebrew in order to frighten and discourage the people of Jerusalem who were on the city wall, so that it would be easier to capture the city. "},{"num":19,"verse":"They talked about the God of Jerusalem in the same way that they talked about the gods of the other peoples, idols made by human hands."},{"num":20,"verse":"Then King Hezekiah and the prophet Isaiah son of Amoz prayed to God and cried out to him for help. "},{"num":21,"verse":"The Lord sent an angel that killed the soldiers and officers of the Assyrian army. So the emperor went back to Assyria disgraced. One day when he was in the temple of his god, some of his sons killed him with their swords."},{"num":22,"verse":"In this way the Lord rescued King Hezekiah and the people of Jerusalem from the power of Sennacherib, the emperor of Assyria, and also from their other enemies. He let the people live in peace with all the neighboring countries. "},{"num":23,"verse":"Many people came to Jerusalem, bringing offerings to the Lord and gifts to Hezekiah, so that from then on all the nations held Hezekiah in honor."},{"header":"Hezekiah's Illness and Pride(B)"},{"num":24,"verse":"About this time King Hezekiah became sick and almost died. He prayed, and the Lord gave him a sign that he would recover. "},{"num":25,"verse":"But Hezekiah was too proud to show gratitude for what the Lord had done for him, and Judah and Jerusalem suffered for it. "},{"num":26,"verse":"Finally, however, Hezekiah and the people of Jerusalem humbled themselves, and so the Lord did not punish the people until after Hezekiah's death."},{"header":"Hezekiah's Wealth and Splendor"},{"num":27,"verse":"King Hezekiah became very wealthy, and everyone held him in honor. He had storerooms built for his gold, silver, precious stones, spices, shields, and other valuable objects. "},{"num":28,"verse":"In addition, he had storehouses built for his grain, wine, and olive oil; barns for his cattle; and pens for his sheep. "},{"num":29,"verse":"Besides all this, God gave him sheep and cattle and so much other wealth that he built many cities. "},{"num":30,"verse":"It was King Hezekiah who blocked the outlet for Gihon Spring and channeled the water to flow through a tunnel to a point inside the walls of Jerusalem. Hezekiah succeeded in everything he did, "},{"num":31,"verse":"and even when the Babylonian ambassadors came to inquire about the unusual event that had happened in the land, God let Hezekiah go his own way only in order to test his character."},{"header":"The End of Hezekiah's Reign(C)"},{"num":32,"verse":"Everything else that King Hezekiah did and his devotion to the Lord are recorded in The Vision of the Prophet Isaiah Son of Amoz and in The History of the Kings of Judah and Israel. "},{"num":33,"verse":"Hezekiah died and was buried in the upper section of the royal tombs. All the people of Judah and Jerusalem paid him great honor at his death. His son Manasseh succeeded him as king."}]