[{"header":"Assyrian’s Failed Seige of Jerusalem"},{"num":32,"verse":"After these acts of faithfulness, Sennacherib king of Assyria came and invaded Judah. He encamped against the fortified cities, intending to break into them for himself. "},{"num":2,"verse":"When Hezekiah saw that Sennacherib had come and intended to wage war against Jerusalem, "},{"num":3,"verse":"he consulted with his officers and warriors about blocking the waters of the springs outside the city, and they supported him. "},{"num":4,"verse":"Many people assembled and blocked off all the springs and the raging wadi in the land saying, “Why should the kings of Assyria come and find plenty of water?” "},{"num":5,"verse":"Then he took courage and rebuilt the entire wall that had been broken down, raised up the towers, added another outer wall, fortified the Millo in the city of David, and made plenty of weapons and shields."},{"num":6,"verse":"He also appointed military officers over the people and assembled them before him in the square at the city gate, and encouraged them saying, "},{"num":7,"verse":"“Chazak! Be courageous! Do not be afraid or dismayed by the king of Assyria and the whole horde that is with him—for we have more with us than he has with him! "},{"num":8,"verse":"With him is an arm of flesh, but with us is Adonai Eloheinu to help us and to fight our battles.” So the people were encouraged by the words of King Hezekiah of Judah."},{"num":9,"verse":"After this, when King Sennacherib of Assyria, while he and all his forces with him were besieging Lachish, sent his servants to Jerusalem to Hezekiah king of Judah and to all Judah who were in Jerusalem, saying:"},{"num":10,"verse":"“Thus says King Sennacherib of Assyria, ‘What are you relying on that you would stay in Jerusalem, under siege? "},{"num":11,"verse":"Is not Hezekiah misleading you, to let you die by famine and thirst, saying, “Adonai Eloheinu will deliver us from the hand of the king of Assyria?” "},{"num":12,"verse":"Has not the same Hezekiah removed His high places and His altars, and commanded Judah and Jerusalem saying, “You shall worship before one altar and upon it you shall burn incense?” "},{"num":13,"verse":"Do not you know what I and my fathers have done to all the peoples of the lands? Were the gods of the nations of the lands ever able to deliver their land out of my hand? "},{"num":14,"verse":"Who among all the gods of these nations—which my fathers utterly destroyed—could deliver his people from my hand? How then is your God able to deliver you from my hand? "},{"num":15,"verse":"So now, do not let Hezekiah deceive you or mislead you like this. Do not believe him, for no god of any nation or any kingdom has been able to deliver his people from my hand and from the hand of my fathers. How much less will your God deliver you from my hand!’”"},{"num":16,"verse":"His servants spoke further against Adonai Elohim and against His servant Hezekiah. "},{"num":17,"verse":"Sennacharib also wrote letters reviling Adonai, the God of Israel, speaking against Him saying, “Just as the gods of the nations of the lands have not delivered their people from my hand, so the God of Hezekiah shall not deliver His people from my hand.” "},{"num":18,"verse":"Then they cried out loudly in Hebrew to the people of Jerusalem who were on the wall to terrify and frighten them, in order to capture the city. "},{"num":19,"verse":"They spoke against the God of Jerusalem as of the gods of the peoples of the earth made by human hands."},{"num":20,"verse":"Then King Hezekiah and the prophet Isaiah the son of Amoz prayed about this and cried out to heaven."},{"num":21,"verse":"Then Adonai sent an angel who annihilated every mighty warrior, commander and officer in the camp of the king of Assyria. So he withdrew in disgrace to his own land. When he entered the house of his god some of his own children struck him down with the sword. "},{"num":22,"verse":"Thus Adonai delivered Hezekiah and the inhabitants of Jerusalem from the hand of Sennacherib the king of Assyria, and from the hand of all, and helped them in every way. "},{"num":23,"verse":"Many brought offerings to Adonai in Jerusalem and valuable gifts to King Hezekiah of Judah. From then on he was highly regarded in the eyes of all the nations."},{"header":"Hezekiah’s Pride and Humility"},{"num":24,"verse":"In those days Hezekiah became deathly ill, but he prayed to Adonai who responded to him and gave him a sign. "},{"num":25,"verse":"But Hezekiah did not respond according to the favor done to him. His heart became haughty, so wrath came upon him and upon Judah and Jerusalem. "},{"num":26,"verse":"Then Hezekiah humbled himself for the pride in his heart—both he and the inhabitants of Jerusalem—so that the wrath of Adonai did not fall upon them in the days of Hezekiah."},{"num":27,"verse":"Now Hezekiah had very abundant riches and honor. He even made treasuries for silver, gold, precious stones, spices, shields, and for all kinds of valuables, "},{"num":28,"verse":"and storehouses for the harvest of grain, wine and oil, and stalls for all kinds of cattle, and sheepfolds for the flocks. "},{"num":29,"verse":"Moreover, he built towns and acquired flocks and herds in abundance, for God had given him very many possessions."},{"num":30,"verse":"It was also Hezekiah who stopped the upper spring of the waters of Gihon and channeled them downward to the west side of the city of David. Hezekiah succeeded in all that he did. "},{"num":31,"verse":"But when the ambassadors of the princes of Babylon were sent to him to inquire about the wonder that had happened in the land, God left him alone to test him, to know all that was in his heart."},{"header":"Hezekiah’s Death and Honor"},{"num":32,"verse":"Now the rest of the acts of Hezekiah and his good deeds, behold, they are written in the vision of the prophet Isaiah son of Amoz, in the book of the kings of Judah and Israel. "},{"num":33,"verse":"So Hezekiah slept with his fathers and they buried him in the upper section of the tombs of the sons of David. All Judah and the inhabitants of Jerusalem honored him at his death. His son Manasseh became king in his place."}]