[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(22) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Redeemeth.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 25:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which begins with the same letter, out of its place, and the same word.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Psalms",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "NO CONDEMNATIONPsalm 34:22",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "NO CONDEMNATION",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 34:22",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " These words are very inadequately represented in the translation of the Authorised Version. The Psalmist’s closing declaration is something very much deeper than that they who trust in God ‘shall not be desolate.’ If you look at the previous clause, you will see that we must expect something more than such a particular blessing as that:-’The Lord redeemeth the soul of His servants.’ It is a great drop from that thought, instead of being a climax, to follow it with nothing more than, ‘None of them that trust in Him shall be desolate.’ But the Revised Version accurately renders the words: ‘None of them that trust in Him shall be ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "condemned",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".’ There we have something that is worthy to follow ‘The Lord redeemeth the soul of His servants,’ and we have a most striking anticipation of the clearest and most Evangelical teaching of the New Testament.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The entirely New Testament tone of these words of the psalm comes out still more clearly, if we recognise that, not only in the latter, but in the former, part of the clause, we have one of the very keynotes of New Testament teaching. When we read in the New Testament that ‘we are justified by faith,’ the meaning is precisely the same as that of our text. Thus, however it came about, here is this Psalmist, David or another, standing away back amidst the shadows and symbols and ritualisms of that Old Covenant, and rising at once above all the mists, right up into the sunshine, and seeing, as clearly as we see it nineteen centuries after Jesus Christ, that the way to escape condemnation is simple faith. Let us look at both of the parts of these great words. We consider-",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. The people that are spoken of here. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. The people that are spoken of here.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘None of them that trust in Him’-I need not, I suppose, further dwell upon the absolute identity shown by this phrase between the Old and the New Testament conceptions; but I should like to make a remark, which I dare say I have often made before-it cannot be made too often-that, whatever be the differences between the Old and the New, this is not the difference, that they present two different ways of approaching God. There are a great many differences; the conception of the divine nature is no doubt infinitely deepened, made more tender and more lofty, by the thought of the Fatherhood of God. The contents of the revelation which our faith is to grasp are brought out far more definitely and articulately and fully in the New Testament. But in the Old, the road to God was the same as it is to-day; and from the beginning there has only been, and through all Eternity there will only be, one path by which men can have access to the Father, and that is by faith. ‘Trust’ is the Old Testament word, ‘faith’ is the New. They are absolutely identical, and there would have been a flood of light-sorely needed by a great many good people-cast upon the relations between those two complementary and harmonious halves of a consistent whole, if our translators had not been influenced by their unfortunate love for varying translations of the same word, but had contented themselves with choosing one of these two words ‘trust’ or ‘faith,’ and had used that one consistently and uniformly throughout the Old and New books. Then we should have understood, what anybody who will open his eyes can see now, that what the New Testament magnifies as ‘faith’ is identical with what the Old Testament sets forth as ‘trust.’ ‘None of them that trust in Him shall be condemned.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But there is one more remark to make on this matter, and that is that a great flood of light, and of more than light, of encouragement and of stimulus, is cast upon that saving exercise of trust by noticing the literal meaning of the word that is rightly so rendered here. All those words, especially in the Old Testament, that express emotions or acts of the mind, originally applied to corporeal acts or material things. I suppose that is so in all language. It is very conspicuously so in the Hebrew. And the word that is here translated, rightly, ‘trust,’ means literally to fly to a refuge, or to betake oneself to some defence in order to get shelter there.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " There is a trace of both meanings, the literal and the metaphorical, in another psalm, where we read, amidst the Psalmist’s rapturous heaping together of great names for God: ‘My Rock, in whom I will trust.’ Now keep to the literal meaning there, and you see how it flashes up the whole into beauty: ‘My Rock, to whom I will flee for refuge,’ and put my back against it, and stand as impregnable as it; or get myself well into the clefts of it, and then nothing can touch me.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘Rock of Ages! cleft for me,Let me hide myself in Thee.’ ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "‘Rock of Ages! cleft for me,",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Let me hide myself in Thee.’",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Then we find the same words, with the picture of flight and the reality of faith, used with another set of associations in another psalm, which says: ‘He shall cover thee with His feathers, and under His wings shalt thou trust.’ That grates, one gets away from the metaphor too quickly; but if we preserve the literal meaning, and read, ‘under His wings shalt thou flee for refuge,’ we have the picture of the chicken flying to the mother-bird when kites are in the sky, and huddling close to the warm breast and the soft downy feathers, and so with the spread of the great wing being sheltered from all possibility of harm. This psalm is ascribed to David when he was in hiding. The superscription says that it is ‘a psalm of David, when he changed his behaviour before Abimelech; who drove him away, and he departed.’ And where did he go? To the cave in the rock. And as he sat in the mouth of it, with the rude arch stretching above him, like the wings of some great bird, feeling himself absolutely safe, he said, ‘None of them that take refuge in Thee shall be condemned.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Does not that metaphor teach us a great deal more of what faith is, and encourage us far more to exercise it, than much theological hair-splitting? What lies in the metaphor? Two things, the earnest eagerness of the act of flight, and the absolute security which comes when we have reached the shadow of the great Rock in a weary land.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But there is one thing more that I would notice, and that is that this designation of the persons as ‘them that trust in Him’ follows last of all in a somewhat lengthened series of designations for good people. They are these: ‘the righteous’-’them that are of a broken heart’-’such as be of a contrite spirit’-’His servants,’ and then, lastly, comes, as basis of all, as, so to speak, the keynote of all, ‘none of them that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "trust",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in Him.’ That is to say-righteousness, true and blessed pulverising of the obstinate insensibility of self alienated from God, true and blessed consciousness of sin, joyful surrender of self to loving and grateful submission to God’s will, are all connected with or flow from that act of trust in Him. And if you are trusting in Him, in anything more than the mere formal, dead way in which multitudes of nominal Christians in all our congregations are doing so, your trust will produce all these various fruits of righteousness, and lowliness, and joyful service. ‘Faith’ or ‘trust’ is the mother of all graces and virtues, and it produces them all because it directly kindles the creative flame of an answering love to Him in whom we trust. So much, then, for the first part of my remarks. Consider, next-",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. The blessing here promised. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. The blessing here promised.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘None of them that trust in Him shall be condemned.’ The word which is inadequately rendered ‘desolate,’ and more accurately ‘condemned,’ includes the following varying shades of meaning, which, although they are various, are all closely connected, as you will see-to incur guilt, to feel guilty, to be condemned, to be punished. All these four are inextricably blended together. And the fact that the one word in the Old Testament covers all that ground suggests some very solemn thoughts.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " First of all, it suggests this, that guilt, or sin, and condemnation and punishment, are, if not absolutely identical, inseparable. To be guilty is to be condemned. That is to say, since we live, as we do, under the continual grip of an infinitely wise and all-knowing law, and in the presence of a Judge who not only sees us as we are, but treats us as He sees us-sin and guilt go together, as every man knows that has a conscience. And sin and guilt and condemnation and punishment go together, as every man may see in the world, and experience in himself. To be separated from God, which is the immediate effect of sin, is to pass into hell here. ‘Every transgression and disobedience,’ not only ‘shall receive its just recompense,’ away out yonder, in some misty, far-off, hypothetical future, but down here to-day. All sin works automatically, and to do wrong is to be punished for doing it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Then my text suggests another solemn thought, and that is that this judgment, this condemnation, is not only present, according to our Lord’s own great words, which perhaps are an allusion to these: ‘He that believeth not is condemned already’; but it also suggests the universality of that condemnation. Our Psalmist says that only through trusting Him can a man be taken and lifted away, as it were, from the descent of the thundercloud, and its bolt that lies above his head. ‘They that trust Him are not condemned,’ every one else is; not ‘shall be,’ but is, to-day, here and now. If there is a man or woman in my audience now who is not exercising trust in God through Jesus Christ, on that man or woman, young or old, cultivated or uncultivated, professing Christian or not, there is bound the burden of their sin, which is the crushing weight of their condemnation.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So my text suggests, that the sole deliverance from this universal pressure of the condemnatory influence of universal sin lies in that fleeing for refuge to God. And then comes in the Christian addition, ‘to God, as manifested in Jesus Christ.’ The Psalmist did not know that. All the more wonderful is it that without the knowledge he should have risen to the great thought of our text-all the more inexplicable unless you believe that ‘holy men of old spake as they were moved by the Holy Ghost.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Wonderful it is still, but not unintelligible, if you believe that. But you and I know more than this singer did; for we can listen to the Master, who says, ‘He that believeth on Him is not condemned’; and to the servant who echoes-and perhaps both of them are alluding to our psalm-’There is therefore now no condemnation to them that are in Christ Jesus.’ My faith, if it knits me to Jesus Christ, unties the bonds by which my sin is bound upon me, for it makes me to share in His Spirit, in His righteousness, in His glory.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And so, dear brethren! the Psalmist, though he did not know it, may point us away to the truth hidden from him, but sunlight clear for us, that by simple trust we may receive the Saviour through whom all our condemnation will pass away, and may be found in Him having the ‘righteousness which is of God by faith.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘Not condemned’-Is that all? Are the blessings of the Gospel all to be reduced to this mere negative expression? Certainly not. The Psalmist could have said a great deal more, and in the previous context he does say a great deal more. But to that restrained and moderate statement of the case, which is far less than the facts of the case, ‘he that trusteth is not condemned,’ let us add Paul’s expansion, ‘whom He called them He also justified, and whom He justified them He also glorified.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 34:22",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 34:22",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The Lord redeemeth the soul of his servants — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That is, their lives, or their persons, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "from the malicious designs of all their enemies, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "from the power of the grave, and from the sting of every affliction. He keeps them from sinning in their troubles, which is the only thing that could do them a real injury, and keeps them from despair, and from being put out of possession of their own souls. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "None that trust in him shall be desolate",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " — Or, comfortless; for they shall not be cut off from communion with God. And no man is desolate, but he whom God has forsaken, nor is any man undone till he is in hell. Instead of, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall be desolate, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "in this and the preceding verse, the margin reads, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall be guilty; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "as the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "יאשׁמו",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "jeshemu, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "here used, is frequently and properly rendered. Indeed, it includes in it both the idea of guilt and the punishment incurred thereby. Now, they that in the way of true repentance, living faith, and new obedience, trust in the Lord, are both rescued from guilt and the punishment to which it had exposed them. It may not be improper to observe here that, as this is another of the alphabetical Psalms, every verse beginning with a distinct letter of the Hebrew alphabet, except the fifth, which includes two letters; so this verse is a kind of detached sentence, added, as in Psalms 25., beyond the alphabet, perhaps in order that the Psalm might end with a promise rather than a threatening. For a similar reason the Jews repeat a verse at the end of some books of the Old Testament. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "34:11-22 Let young persons set out in life with learning the fear of the Lord, if they desire true comfort here, and eternal happiness hereafter. Those will be most happy who begin the soonest to serve so good a Master. All aim to be happy. Surely this must look further than the present world; for man's life on earth consists but of few days, and those full of trouble. What man is he that would see the good of that where all bliss is perfect? Alas! few have this good in their thoughts. That religion promises best which creates watchfulness over the heart and over the tongue. It is not enough not to do hurt, we must study to be useful, and to live to some purpose; we must seek peace and pursue it; be willing to deny ourselves a great deal for peace' sake. It is the constant practice of real believers, when in distress, to cry unto God, and it is their constant comfort that he hears them. The righteous are humbled for sin, and are low in their own eyes. Nothing is more needful to true godliness than a contrite heart, broken off from every self-confidence. In this soil every grace will flourish, and nothing can encourage such a one but the free, rich grace of the gospel of Jesus Christ. The righteous are taken under the special protection of the Lord, yet they have their share of crosses in this world, and there are those that hate them. Both from the mercy of Heaven, and the malice of hell, the afflictions of the righteous must be many. But whatever troubles befal them, shall not hurt their souls, for God keeps them from sinning in troubles. No man is desolate, but he whom God has forsaken.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The Lord redeemeth the soul of his servants - The literal meaning of this is, that the Lord rescues the lives of his servants, or that he saves them from death. The word \"redeem\" in its primary sense means to let go or loose; to \"buy\" loose, or to ransom; and hence, to redeem with a price, or to rescue in any way. Here the idea is not that of delivering or rescuing by a \"price,\" or by an offering, but of rescuing from danger and death by the interposition of the power and providence of God. The word \"soul\" here is used to denote the entire man, and the idea is, that God will \"rescue\" or \"save\" those who serve and obey him. They will be kept from destruction. They will not be held and regarded as guilty, and will not be treated as if they were wicked. As the word \"redeem\" is used by David here it means God will save His people; without specifying the \"means\" by which it will be done. As the word \"redeem\" is used by Christians now, employing the ideas of the New Testament on the subject, it means that God will redeem His people by that great sacrifice which was made for them on the cross.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And none of them that trust in him shall be desolate - Shall be held and treated as \"guilty.\" See Psalm 34:21, where the same word occurs in the original. They shall not be held to be guilty; they shall not be punished. This is designed to be in contrast with the statement respecting the wicked in Psalm 34:21. The psalm, therefore, closes appropriately with the idea that they who trust the Lord will be ultimately safe; that God will make a distinction between them and the wicked; that they will be ultimately rescued from death, and be regarded and treated forever as the friends of God. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And none of them that trust in him shall be desolate - Shall be held and treated as \"guilty.\" See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 34:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where the same word occurs in the original. They shall not be held to be guilty; they shall not be punished. This is designed to be in contrast with the statement respecting the wicked in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 34:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The psalm, therefore, closes appropriately with the idea that they who trust the Lord will be ultimately safe; that God will make a distinction between them and the wicked; that they will be ultimately rescued from death, and be regarded and treated forever as the friends of God. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "21, 22. Contrast in the destiny of righteous and wicked; the former shall be delivered and never come into condemnation (Joh 5:24; Ro 8:1); the latter are left under condemnation and desolate.   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " i.e. Their lives or their persons, from the malicious designs of all their enemies, and from desolation or utter ruin, as it follows. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The Lord redeemeth the soul of his servants,.... Who are made so by his grace in the day of his power, and are willing to serve him, and to serve him with their minds, readily and cheerfully; and the soul of these, which is the more noble part of them, and is of more worth than a world, the redemption of which is precious, and requires a great price, the Lord redeems; not that their bodies are neglected, and not redeemed; but this is mentioned as the principal part, and for the whole; and this redemption is by the Lord, who only is able to effect it, and which he has obtained through his precious blood; and here it seems to denote the application of it in its effects; that is, the forgiveness of sin, justification, and sanctification, since it respects something that is continually doing; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and none of them that trust in him shall be desolate; or \"be guilty\" (o), or \"condemned\", or \"damned\"; because they are justified from all the sins they have been guilty of, through the redemption that is in Christ Jesus; and having believed in him, they shall not be damned, according to Mark 16:16; and they shall be far from being desolate, and alone, and miserable; they shall stand at Christ's right hand, be received into his kingdom and glory, and be for ever with him. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and none of them that trust in him shall be desolate; or \"be guilty\" (o), or \"condemned\", or \"damned\"; because they are justified from all the sins they have been guilty of, through the redemption that is in Christ Jesus; and having believed in him, they shall not be damned, according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 16:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and they shall be far from being desolate, and alone, and miserable; they shall stand at Christ's right hand, be received into his kingdom and glory, and be for ever with him. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(o)  \"non rei fiunt\", Cocceius; \"non punientur\", Gejerus; \"shall not be condemned as guilty\", Ainsworth. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(o)  \"non rei fiunt\", Cocceius; \"non punientur\", Gejerus; \"shall not be condemned as guilty\", Ainsworth. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "The LORD {o} redeemeth the soul of his servants: and none of them that trust in him shall be desolate.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The LORD ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{o}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " redeemeth the soul of his servants: and none of them that trust in him shall be desolate.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(o) For when they seem to be overcome with great dangers and death itself, then God shows himself as their redeemer.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". A second verse beginning with ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Pç",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", like ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 25:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where see note.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 22.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The Lord redeemeth the soul of his servants",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 25:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 130:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Some translate, \"The Lord ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "delivers",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",\" etc. But the LXX. have ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "λυρώσεται",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "verb",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " used means primarily, as Dr. Kay says, \"to sever,\" then \"to set free, release, emancipate; especially to set free by paying a price; to redeem, or ransom.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And none of them that trust in him shall",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "be desolate;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "shall be held guilty",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "shall be condemned",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "the",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " same word as in the preceding verse (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 8:33, 34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Those whom God has redeemed he justifies, and saves from all condemnation. They are \"passed from death unto life\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 5:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Psalm 34:22",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(Heb.: 34:23) The order of the alphabet having been gone through, there now follows a second פ exactly like ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 25:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Just as the first פ, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 25:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is פּנה, so here in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 34:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it is פּני; and in like manner the two supernumerary Phe's correspond to one another - the Elohimic in the former Psalm, and the Jehovic in this latter. ",
        "children": []
      }
    ]
  }
]