[{"header":"David and Jonathan"},{"num":20,"verse":"David was in Naioth at Ramah. He ran away from there to where Jonathan was. He asked him, “What have I done? What crime have I committed? I haven’t done anything to harm your father. So why is he trying to kill me?”"},{"num":2,"verse":"“That will never happen!” Jonathan replied. “You aren’t going to die! My father doesn’t do anything at all without letting me know. So why would he hide this from me? He isn’t going to kill you!”"},{"num":3,"verse":"But David strongly disagreed. He said, “Your father knows very well that you are pleased with me. He has said to himself, ‘I don’t want Jonathan to know I’m planning to kill David. If he finds out, he’ll be very sad.’ But I’m very close to being killed. And that’s just as sure as the Lord and you are alive.”"},{"num":4,"verse":"Jonathan said to David, “I’ll do anything you want me to do for you.”"},{"num":5,"verse":"So David said, “Tomorrow is the time for the New Moon feast. I’m supposed to eat with the king. But let me go and hide in the field. I’ll stay there until the evening of the day after tomorrow. "},{"num":6,"verse":"Your father might miss me. If he does, then tell him, ‘David begged me to let him hurry home to Bethlehem. A yearly sacrifice is being offered there for his whole family group.’ "},{"num":7,"verse":"Your father might say, ‘That’s all right.’ If he does, it will mean I’m safe. But he might become very angry. If he does, you can be sure he’s made up his mind to harm me. "},{"num":8,"verse":"Please be kind to me. You have made a covenant with me in front of the Lord. If I’m guilty, kill me yourself! Don’t hand me over to your father!”"},{"num":9,"verse":"“I would never do that!” Jonathan said. “Suppose I had even the smallest clue that my father had made up his mind to harm you. Then I would tell you.”"},{"num":10,"verse":"David asked, “Who will tell me if your father answers you in a mean way?”"},{"num":11,"verse":"“Come on,” Jonathan said. “Let’s go out to the field.” So they went there together."},{"num":12,"verse":"Then Jonathan spoke to David. He said, “I promise you that I’ll find out what my father is planning to do. I’ll find out by this time the day after tomorrow. The Lord, the God of Israel, is my witness. Suppose my father has kind feelings toward you. Then I’ll send you a message and let you know. "},{"num":13,"verse":"But suppose he wants to harm you. And I don’t let you know about it. Suppose I don’t help you get away in peace. Then may the Lord punish me greatly. May he be with you, just as he has been with my father. "},{"num":14,"verse":"But always be kind to me, just as the Lord is. Be kind to me as long as I live. Then I won’t be killed. "},{"num":15,"verse":"And never stop being kind to my family. Don’t stop even when the Lord has cut off every one of your enemies from the face of the earth.”"},{"num":16,"verse":"So Jonathan made a covenant of friendship with David and his family. He said, “May the Lord hold David’s enemies responsible for what they’ve done.” "},{"num":17,"verse":"Jonathan had David promise his friendship again because he loved him. In fact, Jonathan loved David just as he loved himself."},{"num":18,"verse":"Then Jonathan said to David, “Tomorrow is the time for the New Moon feast. You will be missed, because your seat at the table will be empty. "},{"num":19,"verse":"Go to the place where you hid when all this trouble began. Go there the day after tomorrow, when evening is approaching. There’s a stone out there called Ezel. "},{"num":20,"verse":"Wait by it. I’ll shoot three arrows to one side of the stone. I’ll pretend I’m practicing my shooting. "},{"num":21,"verse":"Then I’ll send a boy out there. I’ll tell him, ‘Go and find the arrows.’ Suppose I say to him, ‘The arrows are on this side of you. Bring them here.’ Then come. That will mean you are safe. You won’t be in any danger. And that’s just as sure as the Lord is alive. "},{"num":22,"verse":"But suppose I tell the boy, ‘The arrows are far beyond you.’ Then go. That will mean the Lord is sending you away. "},{"num":23,"verse":"And remember what we talked about. Remember that the Lord is a witness between you and me forever.”"},{"num":24,"verse":"So David hid in the field. When the time for the New Moon feast came, the king sat down to eat. "},{"num":25,"verse":"He sat in his usual place by the wall. Jonathan sat across from him. Abner sat next to Saul. But David’s place was empty. "},{"num":26,"verse":"Saul didn’t say anything that day. He said to himself, “Something must have happened to David to make him ‘unclean.’ That must be why he isn’t here.” "},{"num":27,"verse":"But the next day, David’s place was empty again. It was the second day of the month. Finally, Saul spoke to his son Jonathan. He said, “Why hasn’t the son of Jesse come to the meal? He hasn’t been here yesterday or today.”"},{"num":28,"verse":"Jonathan replied, “David begged me to let him go to Bethlehem. "},{"num":29,"verse":"He said, ‘Let me go. Our family is offering a sacrifice in the town. My brother has ordered me to be there. Are you pleased with me? If you are, let me go and see my brothers.’ That’s why he hasn’t come to eat at your table.”"},{"num":30,"verse":"Saul became very angry with Jonathan. He said to him, “You are an evil son. You have refused to obey me. I know that you are on the side of Jesse’s son. You should be ashamed of that. And your mother should be ashamed of having a son like you. "},{"num":31,"verse":"You will never be king as long as Jesse’s son lives on this earth. And you will never have a kingdom either. So send someone to bring the son of Jesse to me. He must die!”"},{"num":32,"verse":"“Why do you want to put him to death?” Jonathan asked his father. “What has he done?” "},{"num":33,"verse":"But Saul threw his spear at Jonathan to kill him. Then Jonathan knew that his father wanted to kill David."},{"num":34,"verse":"So Jonathan got up from the table. He was very angry. On that second day of the feast, he refused to eat. He was very sad that his father was treating David so badly."},{"num":35,"verse":"The next morning Jonathan went out to the field to meet David. He took a young boy with him. "},{"num":36,"verse":"He said to the boy, “Run and find the arrows I shoot.” As the boy ran, Jonathan shot an arrow far beyond him. "},{"num":37,"verse":"The boy came to the place where Jonathan’s arrow had fallen. Then Jonathan shouted to him, “The arrow went far beyond you, didn’t it?” "},{"num":38,"verse":"He continued, “Hurry up! Run fast! Don’t stop!” The boy picked up the arrow and returned to his master. "},{"num":39,"verse":"The boy didn’t know what was going on. Only Jonathan and David knew. "},{"num":40,"verse":"Jonathan gave his weapons to the boy. He told him, “Go back to town. Take the weapons with you.”"},{"num":41,"verse":"After the boy had gone, David got up from the south side of the stone. He bowed down in front of Jonathan with his face to the ground. He did it three times. Then they kissed each other and cried. But David cried more than Jonathan did."},{"num":42,"verse":"Jonathan said to David, “Go in peace. In the name of the Lord we’ve promised to be friends. We have said, ‘The Lord is a witness between you and me. He’s a witness between your children and my children forever.’ ” Then David left, and Jonathan went back to the town."}]