[{"header":"Covenant of the Rainbow"},{"num":9,"verse":"And God blessed Noah and his sons and said to them, “Be fruitful and multiply, and fill the earth. "},{"num":2,"verse":"The fear and the terror of you shall be [instinctive] in every animal of the land and in every bird of the air; and together with everything that moves on the ground, and with all the fish of the sea; they are given into your hand. "},{"num":3,"verse":"Every moving thing that lives shall be food for you; I give you everything, as I gave you the green plants and vegetables. "},{"num":4,"verse":"But you shall not eat meat along with its life, that is, its blood. "},{"num":5,"verse":"For your lifeblood I will most certainly require an accounting; from every animal [that kills a person] I will require it. And from man, from every man’s brother [that is, anyone who murders] I will require the life of man."},{"num":8,"verse":"Then God spoke to Noah and to his sons with him, saying, "},{"num":9,"verse":"“Now behold, I am establishing My covenant (binding agreement, solemn promise) with you and with your descendants after you "},{"num":10,"verse":"and with every living creature that is with you—the birds, the livestock, and the wild animals of the earth along with you, of everything that comes out of the ark—every living creature of the earth. "},{"num":11,"verse":"I will establish My covenant with you: Never again shall all flesh be cut off by the water of a flood, nor shall there ever again be a flood to destroy and ruin the earth.” "},{"num":12,"verse":"And God said, “This is the token (visible symbol, memorial) of the [solemn] covenant which I am making between Me and you and every living creature that is with you, for all future generations; "},{"num":13,"verse":"I set My rainbow in the clouds, and it shall be a sign of a covenant between Me and the earth. "},{"num":14,"verse":"It shall come about, when I bring clouds over the earth, that the rainbow shall be seen in the clouds, "},{"num":15,"verse":"and I will [compassionately] remember My covenant, which is between Me and you and every living creature of all flesh; and never again will the water become a flood to destroy all flesh. "},{"num":16,"verse":"When the rainbow is in the clouds and I look at it, I will [solemnly] remember the everlasting covenant between God and every living creature of all flesh that is on the earth.” "},{"num":17,"verse":"And God said to Noah, “This [rainbow] is the sign of the covenant (solemn pledge, binding agreement) which I have established between Me and all living things on the earth.”"},{"num":18,"verse":"The sons of Noah who came out of the ark were Shem and Ham and Japheth. Ham would become the father of Canaan. "},{"num":19,"verse":"These are the three sons of Noah, and from these [men] the whole earth was populated and scattered with inhabitants."},{"num":20,"verse":"And Noah began to farm and cultivate the ground and he planted a vineyard. "},{"num":21,"verse":"He drank some of the wine and became drunk, and he was uncovered and lay exposed inside his tent. "},{"num":22,"verse":"Ham, the father of Canaan, saw [by accident] the nakedness of his father, and [to his father’s shame] told his two brothers outside. "},{"num":23,"verse":"So Shem and Japheth took a robe and put it on both their shoulders, and walked backwards and covered the nakedness of their father; their faces were turned away so that they did not see their father’s nakedness. "},{"num":24,"verse":"When Noah awoke from his wine [induced stupor], he knew what his younger son [Ham] had done to him. "},{"num":25,"verse":"So he said,"},{"num":26,"verse":"He also said,"},{"num":28,"verse":"Noah lived three hundred and fifty years after the flood. "},{"num":29,"verse":"So all the days of Noah were nine hundred and fifty years, and he died."}]