[{"header":"The Noahic Covenant"},{"num":9,"verse":"Then God blessed Noah and his sons and said to them, “Be fruitful and multiply and fill the earth. "},{"num":2,"verse":"Every beast of the earth and every bird of the sky and all that moves on the earth and all the fish of the sea will fear you and be terrified of you. They are given into your hand. "},{"num":3,"verse":"Every moving thing that lives will be food for you. I give you everything, just as I gave you the green plant."},{"num":4,"verse":"“Only you shall not eat flesh with its life, that is, its blood. "},{"num":5,"verse":"But for your own lifeblood I will surely require a reckoning; from every animal will I require it; of man, too, will I require a reckoning for human life, of every man for that of his fellow man."},{"num":7,"verse":"And as for you, be fruitful and multiply; increase abundantly in the earth and multiply in it.”"},{"num":8,"verse":"Again God spoke to Noah and to his sons with him, saying, "},{"num":9,"verse":"“As for Me, I establish My covenant with you, and with your descendants after you; "},{"num":10,"verse":"and with every living creature that is with you, the birds, the livestock, and every beast of the earth with you; of all that comes out of the ark, every beast of the earth. "},{"num":11,"verse":"I establish My covenant with you. Never again shall all flesh be cut off by the waters of a flood. Never again shall there be a flood to destroy the earth.”"},{"num":12,"verse":"Then God said, “This is the sign of the covenant which I am making between Me and you and every living creature that is with you, for all future generations. "},{"num":13,"verse":"I have set My rainbow in the cloud, and it shall be a sign of a covenant between Me and the earth. "},{"num":14,"verse":"When I bring a cloud over the earth, the rainbow will be seen in the cloud; "},{"num":15,"verse":"then I will remember My covenant, which is between Me and you and every living creature of all flesh, and the waters will never again become a flood to destroy all flesh. "},{"num":16,"verse":"The rainbow will appear in the cloud, and I will see it and remember the everlasting covenant between God and every living creature of all flesh that is on the earth.”"},{"num":17,"verse":"So God said to Noah, “This is the sign of the covenant that I have established between Me and all flesh that is on the earth.”"},{"header":"The Sons of Noah"},{"num":18,"verse":"The sons of Noah who went forth from the ark were Shem, Ham, and Japheth. Ham was the father of Canaan. "},{"num":19,"verse":"These were the three sons of Noah, and from them the whole earth was populated."},{"num":20,"verse":"Noah began to be a man of the soil, and he planted a vineyard. "},{"num":21,"verse":"Then he drank some of the wine and became drunk, and lay uncovered in his tent. "},{"num":22,"verse":"And Ham, the father of Canaan, saw the nakedness of his father, and told his two brothers outside. "},{"num":23,"verse":"So Shem and Japheth took a garment, and laid it upon both their shoulders, and went backward, and covered the nakedness of their father. Their faces were turned away, and they did not see their father’s nakedness."},{"num":24,"verse":"When Noah awoke from his wine and knew what his younger son had done to him, "},{"num":25,"verse":"he said,"},{"num":26,"verse":"He also said,"},{"num":28,"verse":"Noah lived after the flood three hundred and fifty years. "},{"num":29,"verse":"All the days of Noah were nine hundred and fifty years, and then he died."}]