[{"header":"God Makes a Covenant With Noah"},{"num":9,"verse":"Then God blessed Noah and his sons. He said to them, “Have children so that there are many of you. Fill the earth. "},{"num":2,"verse":"All the land animals will be afraid of you. All the birds in the sky will be afraid of you. Every creature that moves along the ground will be afraid of you. So will every fish in the seas. Every living thing is put under your control. "},{"num":3,"verse":"Everything that lives and moves about will be food for you. I have already given you the green plants for food. Now I am giving you everything."},{"num":4,"verse":"“But you must not eat meat that still has blood in it. "},{"num":5,"verse":"I will certainly hold someone accountable if you are murdered. I will even hold animals accountable if they kill you. I will also hold anyone accountable who murders another person."},{"num":7,"verse":"“Have children so that there will be many of you. Multiply and become many on the earth.”"},{"num":8,"verse":"Then God spoke to Noah and to his sons who were with him. He said, "},{"num":9,"verse":"“I am now making my covenant with you and with all your children who will be born after you. "},{"num":10,"verse":"I am making it also with every living creature that was with you in the ark. I am making my covenant with the birds, the livestock and all the wild animals. I am making it with all the creatures that came out of the ark with you. In fact, I am making it with every living thing on earth. "},{"num":11,"verse":"Here is my covenant I am making with you. The waters of a flood will never again destroy all life. A flood will never again destroy the earth.”"},{"num":12,"verse":"God continued, “My covenant is between me and you and every living creature with you. It is a covenant for all time to come. Here is the sign of the covenant I am making. "},{"num":13,"verse":"I have put my rainbow in the clouds. It will be the sign of the covenant between me and the earth. "},{"num":14,"verse":"Sometimes when I bring clouds over the earth, a rainbow will appear in them. "},{"num":15,"verse":"Then I will remember my covenant between me and you and every kind of living creature. The waters will never again become a flood to destroy all life. "},{"num":16,"verse":"When the rainbow appears in the clouds, I will see it. I will remember that my covenant will last forever. It is a covenant between me and every kind of living creature on earth.”"},{"num":17,"verse":"So God said to Noah, “The rainbow is the sign of my covenant. I have made my covenant between me and all life on earth.”"},{"header":"The Sons of Noah"},{"num":18,"verse":"The sons of Noah who came out of the ark were Shem, Ham and Japheth. Ham was the father of Canaan. "},{"num":19,"verse":"The people who were scattered over the earth came from Noah’s three sons."},{"num":20,"verse":"Noah was a man who farmed the land. He decided to plant a field that produced grapes for making wine. "},{"num":21,"verse":"When he drank some of the wine, it made him drunk. Then he lay down inside his tent without any clothes on. "},{"num":22,"verse":"Ham saw his father naked. Then Ham, the father of Canaan, went outside and told his two brothers. "},{"num":23,"verse":"But Shem and Japheth picked up a piece of clothing and laid it across their shoulders. Then they walked backward into the tent. They covered their father’s body. They turned their faces away because they didn’t want to see their father naked."},{"num":24,"verse":"Then Noah woke up from his sleep that was caused by the wine. He found out what his youngest son had done to him. "},{"num":25,"verse":"He said,"},{"num":26,"verse":"Noah also said,"},{"num":28,"verse":"After the flood Noah lived 350 years. "},{"num":29,"verse":"Noah lived a total of 950 years. And then he died."}]