[{"num":9,"verse":"Vayevarech Elohim et Noach and his banim, and said unto them, Be fruitful, and multiply, and replenish ha’aretz."},{"num":2,"verse":"And the fear of you and the dread of you shall be upon every beast of ha’aretz, and upon every bird of the air, upon all that moveth upon ha’adamah, and upon all the dagim of the yam; into your yad are they delivered."},{"num":3,"verse":"Every remes that liveth shall be food for you; even as the yarok esev (green plant) have I given you all."},{"num":4,"verse":"But basar with the nefesh thereof, which is the dahm thereof, shall ye not eat."},{"num":5,"verse":"And surely your dahm of your nefeshot will I require; at the hand of every beast will I require it, and at the yad haAdam; at the hand of every man’s brother will I require the nefesh haAdam."},{"num":6,"verse":"Shofech dahm (one who sheddeth man’s blood), by man shall his dahm be shed; for in the tzelem Elohim made He man."},{"num":7,"verse":"And you, be ye fruitful, and multiply; bring forth abundantly on ha’aretz, and multiply therein."},{"num":8,"verse":"And Elohim spoke unto Noach, and to his banim with him, saying,"},{"num":9,"verse":"And I, hineni, I establish My brit (covenant) with you, and with your zera after you;"},{"num":10,"verse":"And with kol nefesh that is with you, of the bird, of the behemah, and of every animal of ha’aretz with you; from kol yotzei hatevah (all that go out of the ark), to every creature of ha’aretz."},{"num":11,"verse":"And I will establish My brit (covenant) with you, neither shall kol basar yikaret (be cut off, violently killed) any more by the waters of the mabbul; neither shall there be any more mabbul l’shachat (to destroy) ha’aretz."},{"num":12,"verse":"And Elohim said, This is the ot (sign) of the brit (covenant) which I make between Me and you and every nefesh chayyah (living creature) that is with you, for dorot olam (perpetual generations);"},{"num":13,"verse":"I do set My keshet (bow) in the anan (cloud), and it shall be for an ot brit between Me and ha’aretz."},{"num":14,"verse":"And it shall come to pass, when I bring an anan over ha’aretz, that the keshet be’anan (rainbow) shall be seen;"},{"num":15,"verse":"And I will remember My brit, which is between Me and you and kol nefesh chayyah of kol basar; and the waters shall no more become a mabbul (flood) l’shachat (to destroy) kol basar."},{"num":16,"verse":"And the keshet shall be in the anan; and I will look upon it, that I may remember the brit olam between Elohim and kol nefesh chayyah of kol basar that is upon ha’aretz."},{"num":17,"verse":"And Elohim said unto Noach, This is the ot habrit, which I have established between Me and kol basar that is upon ha’aretz."},{"num":18,"verse":"And the bnei Noach, that went forth of the tevah, were Shem, and Cham, and Yephet; and Cham is the av of Kena’an (Canaan)."},{"num":19,"verse":"Shloshah (Three) are the bnei Noach; and of them was the kol ha’aretz populated."},{"num":20,"verse":"And Noach began to be an ish ha’adamah (a man of the soil), and he planted a kerem (vineyard);"},{"num":21,"verse":"And he drank of the yayin, and became shikker (intoxicated); and he lay uncovered inside his ohel."},{"num":22,"verse":"And Cham, the av of Kena’an, saw the erom (nakedness) of his av, and told his two achim on the outside."},{"num":23,"verse":"And Shem and Yephet took a garment, and laid it upon both their shoulders, and walked backward, and covered the erom of their av; and their faces were turned the other way, and they saw not the erom of their av."},{"num":24,"verse":"And Noach awoke from his yayin, and had da’as of what his ben katan had done unto him."},{"num":25,"verse":"And he said, Arur (cursed) be Kena’an; an eved of avadim shall he be unto his achim."},{"num":26,"verse":"And he said, Baruch Hashem Elohei Shem; and Kena’an shall be his eved."},{"num":27,"verse":"Elohim shall enlarge Yephet, and he shall dwell in the tents of Shem; and Kena’an shall be his eved."},{"num":28,"verse":"And Noach lived after the mabbul three hundred and fifty years."},{"num":29,"verse":"And all the days of Noach were nine hundred and fifty years; and he died."}]