[{"header":"Covenant with Noah’s Descendants"},{"num":9,"verse":"God blessed Noah and his sons, and He said to them, “Be fruitful and multiply and fill the land. "},{"num":2,"verse":"The fear and terror of you will be on every wild animal, and on every flying creature of the sky, with everything that crawls on the ground and with all the fish of the sea—into your hand they are given. "},{"num":3,"verse":"Every crawling thing that is alive will be food for you, as are the green plants—I have now given you everything. "},{"num":4,"verse":"Only flesh with its life—that is, its blood—you must not eat! "},{"num":5,"verse":"Surely your lifeblood will I avenge. From every animal and from every person will I avenge it. From every person’s brother will I avenge that person’s life."},{"num":7,"verse":"But as for you, be fruitful and multiply! Flourish in the land and multiply in it.”"},{"num":8,"verse":"Then God said to Noah and to his sons with him, saying, "},{"num":9,"verse":"“Now I, behold, I am about to establish My covenant with you, and with your seed after you, "},{"num":10,"verse":"and with every living creature that is with you, including the flying creatures, the livestock, and every wild animal with you, of all that is coming out of the ark—every animal of the earth. "},{"num":11,"verse":"I will confirm My covenant with you—never again will all flesh be cut off by the waters of the flood, and never again will there be a flood to ruin the land.”"},{"num":12,"verse":"Then God said, “This is the sign of the covenant that I am making between Me and you, and every living creature that is with you for all future generations. "},{"num":13,"verse":"My rainbow do I place in the cloud, and it will be a sign of the covenant between Me and the land. "},{"num":14,"verse":"Whenever I bring clouds over the land and the rainbow appears in the clouds, "},{"num":15,"verse":"I will remember My covenant that is between Me and you and every living creature of all flesh. Never again will the waters become a flood to destroy all flesh. "},{"num":16,"verse":"When the rainbow is in the cloud, I will look at it, to remember the perpetual covenant between God and every living creature of all flesh that is on the land.”"},{"num":17,"verse":"Then God said to Noah, “This is the sign of the covenant that I have confirmed between Me and all flesh that is on the land.”"},{"header":"Dispersion of Noah’s Family"},{"num":18,"verse":"Noah’s sons who came out from the ark were Shem, Ham and Japheth, and Ham was the father of Canaan. "},{"num":19,"verse":"These three were Noah’s sons, and from these the whole earth dispersed."},{"num":20,"verse":"Then Noah, a man of the soil, was first to plant a vineyard. "},{"num":21,"verse":"He drank some of the wine, got drunk, and was uncovered in his tent. "},{"num":22,"verse":"Then Ham, Canaan’s father, saw his father’s private parts and told his two brothers outside. "},{"num":23,"verse":"So Shem and Japheth took the cloak and laid it over both their shoulders and walked backwards and with it covered their father’s private parts. But their faces were turned away, so they did not see their father’s private parts."},{"num":24,"verse":"When Noah woke up from his wine, he learned what his youngest son had done to him. "},{"num":25,"verse":"So he said,"},{"num":26,"verse":"He also said,"},{"num":28,"verse":"Now Noah lived 350 years after the flood. "},{"num":29,"verse":"So all Noah’s days were 950 years. Then he died."}]