[{"num":9,"verse":"And God blessed Noe and his sons, and said to them, Increase ye, and be ye multiplied, and fill ye the earth;"},{"num":2,"verse":"and your dread and trembling be on all [the] unreasonable beasts of the earth, and on all [the] birds of (the) heaven(s), with all things that be moved in (the) earth; all (the) fishes of the sea be given (in)to your hand. (let the fear of you, and trembling over you, be on all the unreasoning beasts of the earth, and on all the birds of the air, and on all the fishes of the sea; yea, let all the things that move on the earth, be given into your hands.)"},{"num":3,"verse":"And all thing which is moved and liveth shall be to you into meat; (now) I have given to you all things, as (I gave the) green worts (before), (And everything which liveth and moveth shall be food for you; yea, as I did with the green herbs before, now I give you all these things to eat,)"},{"num":4,"verse":"except that ye shall not eat flesh with the blood,"},{"num":5,"verse":"for I shall seek the blood of your lives, of the hand of all unreasonable beasts, and of the hand of man, of the hand of man, and of his brother, I shall seek the life of man. (for I shall seek justice for any spilt blood of your lives, from any unreasoning beast, and from any man, yea, from any man, and from any of his brothers, I shall seek their life if any of them take the life of someone.)"},{"num":6,"verse":"Whoever sheddeth out man’s blood, his blood shall be shed; for man is made to the image of God (for man is made in the image of God)."},{"num":7,"verse":"Forsooth increase ye, and be ye multiplied, and enter ye on [the] earth, and fill ye it."},{"num":8,"verse":"Also the Lord said these things to Noe, and to his sons with him,"},{"num":9,"verse":"Lo! I shall make my covenant with you, and with your seed after you,"},{"num":10,"verse":"and to each living soul which is with you, as well in birds as in work beasts and small beasts of [the] earth, and to all things that went out of the ship, and to all unreasonable beasts of [the] earth. (and with each living soul which is with you, yea, with the birds, and with the work beasts and the small beasts of the earth, and with all the unreasoning beasts of the earth, yea, with all the things that went out of the ship.)"},{"num":11,"verse":"I shall make my covenant with you, and each flesh shall no more be slain of the waters of the great flood, neither the great flood destroying all [the] earth shall be (any) more. (I shall make my covenant with you, and never again shall all flesh be slain by the waters of a great flood, and never again shall there be a great flood destroying all the earth.)"},{"num":12,"verse":"And God said, This is the sign of (the) bond of peace, which I give between me and you, and to each living soul which is with you, into everlasting generations. (And God said, This is the sign of the covenant, which I make between me and you, and each living soul which is with you, unto endless generations.)"},{"num":13,"verse":"I shall set my bow in the clouds, and it shall be a sign of (the) bond of peace between me and [the] earth; (I shall set my rainbow in the clouds, and it shall be a sign of the covenant between me and the earth;)"},{"num":14,"verse":"and when I shall cover [the] heaven with clouds, my bow shall appear in the clouds, (and when I shall cover the heavens with clouds, my rainbow shall appear in the clouds,)"},{"num":15,"verse":"and I shall have mind of my bond of peace which I made with you, and with each soul living that nourisheth flesh; and the waters of the great flood shall no more be to do away all flesh. (and I shall remember my covenant which I made with you, and with each living soul that hath flesh; and never again shall the waters of a great flood do away all flesh.)"},{"num":16,"verse":"And my bow shall be in the clouds, and I shall see it, and I shall have mind of the everlasting bond of peace, which is made between God and man, and each soul living of all flesh which is on [the] earth. (And my rainbow shall be in the clouds, and I shall see it, and I shall remember the everlasting covenant, which is made between God and man, and each living soul of all the kinds of flesh that be on the earth.)"},{"num":17,"verse":"And God said to Noe, This shall be a sign of [the] bond of peace, which I made between me and each flesh on earth. (And God said to Noah, This shall be a sign of the covenant, which I made between me and all flesh on the earth.)"},{"num":18,"verse":"Therefore they that went out of the ship were Noe, Shem, Ham, and Japheth; forsooth Ham, that is the father of Canaan."},{"num":19,"verse":"These three were the sons of Noe, and all the kind of men was sown of them on all [the] earth. (These three were the sons of Noah, and all the kinds of people on all the earth came from them.)"},{"num":20,"verse":"And Noe, an earth-tiller, began to till the earth, and he planted a vinery, (And Noah, a farmer, began to work the soil, and he planted a vineyard;)"},{"num":21,"verse":"and (one day) he drank wine, and was drunken; and he was naked, and lay in his tabernacle (and he lay naked in his tent)."},{"num":22,"verse":"And when Ham, the father of Canaan, had seen this thing, that is, that the shameful members of his father were made naked, he told his two brethren withoutforth."},{"num":23,"verse":"And Shem and Japheth putted a mantle on their shoulders, and they went backward, and covered the shameful members of their father, and their faces were turned away, and they saw not the privy members of their father."},{"num":24,"verse":"And Noe waked of the wine, and when he had learned what things his less(er), or younger, son had done to him, (And when Noah awoke from the wine, and he had learned what his youngest son had done to him,)"},{"num":25,"verse":"he said, Cursed be the child Canaan, he shall be (a) servant of servants to his brethren. (he said, Cursed be Ham’s child Canaan, let him be a slave of slaves to his brothers.)"},{"num":26,"verse":"And Noe said, Blessed be the Lord God of Shem, and Canaan be the servant of Shem; (And Noah said, Blessed be the Lord God of Shem, and let Canaan be Shem’s slave;)"},{"num":27,"verse":"God alarge Japheth, and dwell he in the tabernacles of Shem, and Canaan be the servant of him. (May God enlarge, or increase, Japheth, and live he in Shem’s tents, and let Canaan be his slave too!)"},{"num":28,"verse":"Forsooth Noe lived after the great flood three hundred and fifty years;"},{"num":29,"verse":"and all the days of him were filled nine hundred and fifty years, and he was dead. (and all his days filled nine hundred and fifty years, and then he died.)"}]