[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(17) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And there shall be no man.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Whilst the high priest was performing this process of cleansing, no one, whether priest or Israelite, was permitted to be present, thus precluding the possibility of anyone being within the precincts who had unwittingly contracted defilement. The fact that the high priest was thus alone in the sanctuary, with no one to see how he conducted the ritual, gave rise to the practice of his being sworn, on the eve of the Day of Atonement, by the chief priests and the elders of the Sanhedrin that he would make no change whatever in the traditional ceremonies of the day, as follows :—“We adjure thee, by Him who hath caused His name to dwell in this house, that thou shalt not alter anything of all that we do say unto thee.” This had especial reference to the points at issue between the Pharisees and Sadducees, as some of the high priests held the Sadducaic views. (See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 16:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Leviticus 16:17",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 16:17",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "There shall be no man in the tabernacle — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "In the holy place, where the priests and Levites were at other times. This was commanded for the greater reverence to the divine majesty, then in a more special manner appearing, and that none of them might cast an eye into the holy of holies, as the high-priest went in or came out.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "16:15-34 Here are typified the two great gospel privileges, of the remission of sin, and access to God, both of which we owe to our Lord Jesus. See the expiation of guilt. Christ is both the Maker and the Matter of the atonement; for he is the Priest, the High Priest, that makes reconciliation for the sins of the people. And as Christ is the High Priest, so he is the Sacrifice with which atonement is made; for he is all in all in our reconciliation to God. Thus he was figured by the two goats. The slain goat was a type of Christ dying for our sins; the scape-goat a type of Christ rising again for our justification. The atonement is said to be completed by putting the sins of Israel upon the head of the goat, which was sent away into a wilderness, a land not inhabited; and the sending away of the goat represented the free and full remission of their sins. He shall bear upon him all their iniquities. Thus Christ, the Lamb of God, takes away the sin of the world, by taking it upon himself, Joh 1:29. The entrance into heaven, which Christ made for us, was typified by the high priest's entrance into the most holy place. See Heb 9:7. The high priest was to come out again; but our Lord Jesus ever lives, making intercession, and always appears in the presence of God for us. Here are typified the two great gospel duties of faith and repentance. By faith we put our hands upon the head of the offering; relying on Christ as the Lord our Righteousness, pleading his satisfaction, as that which alone is able to atone for our sins, and procure us a pardon. By repentance we afflict our souls; not only fasting for a time from the delights of the body, but inwardly sorrowing for sin, and living a life of self-denial, assuring ourselves, that if we confess our sins, God is faithful and just to forgive us our sins, and to cleanse us from all unrighteousness. By the atonement we obtain rest for our souls, and all the glorious liberties of the children of God. Sinner, get the blood of Christ effectually applied to thy soul, or else thou canst never look God in the face with any comfort or acceptance. Take this blood of Christ, apply it by faith, and see how it atones with God.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The \"holy place\" - Here the place within the veil, the holy of holies.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Tabernacle of the congregation - tent of meeting. atonement was now to be made for the tabernacle as a whole. The sense is very briefly expressed, but there seems to be no room to doubt that the high priest was to sprinkle the blood of each of the victims before the altar of incense, as he had done before the mercy-seat within the veil; and also to touch with blood the horns of the altar of incense Exodus 30:10.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Tabernacle of the congregation - tent of meeting. atonement was now to be made for the tabernacle as a whole. The sense is very briefly expressed, but there seems to be no room to doubt that the high priest was to sprinkle the blood of each of the victims before the altar of incense, as he had done before the mercy-seat within the veil; and also to touch with blood the horns of the altar of incense ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 30:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "That remaineth among them in the midst of their uncleanness - Compare Leviticus 16:19. The most sacred earthly things which came into contact with the nature of man needed from time to time to be cleansed and sanctified by the blood of the sin-offerings which had been taken into the presence of Yahweh. See Exodus 28:38 note.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "That remaineth among them in the midst of their uncleanness - Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 16:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The most sacred earthly things which came into contact with the nature of man needed from time to time to be cleansed and sanctified by the blood of the sin-offerings which had been taken into the presence of Yahweh. See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 28:38",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " note.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11-19. Aaron shall bring the bullock of the sin offering which is for himself, &c.—The first part of the service was designed to solemnize his own mind, as well as the minds of the people, by offering the sacrifices for their sins. The sin offerings being slain had the sins of the offerer judicially transferred to them by the imputation of his hands on their head (Le 4:4, 15, 24, 29, 33); and thus the young bullock, which was to make atonement for himself and the other priests (called \"his house,\" Ps 135:19), was killed by the hands of the high priest. While the blood of the victim was being received into a vessel, taking a censer of live coals in his right hand and a platter of sweet incense in his left, he, amid the solemn attention and the anxious prayers of the assembled multitude, crossed the porch and the holy place, opened the outer veil which led into the holy of holies and then the inner veil. Standing before the ark, he deposited the censer of coals on the floor, emptied the plate of incense into his hand, poured it on the burning coals; and the apartment was filled with fragrant smoke, intended, according to Jewish writers, to prevent any presumptuous gazer prying too curiously into the form of the mercy seat, which was the Lord's throne. The high priest having done this, perfumed the sanctuary, returned to the door, took the blood of the slain bullock, and, carrying it into the holy of holies, sprinkled it with his finger once upon the mercy seat \"eastward\"—that is, on the side next to himself; and seven times \"before the mercy seat\"—that is, on the front of the ark. Leaving the coals and the incense burning, he went out a second time, to sacrifice at the altar of burnt offering the goat which had been assigned as a sin offering for the people; and carrying its blood into the holy of holies, he made similar sprinklings as he had done before with the blood of the bullock. While the high priest was thus engaged in the most holy place, none of the ordinary priests were allowed to remain within the precincts of the tabernacle. The sanctuary or holy place and the altar of burnt offering were in like manner sprinkled seven times with the blood of the bullock and the goat. The object of this solemn ceremonial was to impress the minds of the Israelites with the conviction that the whole tabernacle was stained by the sins of a guilty people, that by their sins they had forfeited the privileges of the divine presence and worship, and that an atonement had to be made as the condition of God's remaining with them. The sins and shortcomings of the past year having polluted the sacred edifice, the expiation required to be annually renewed. The exclusion of the priests indicated their unworthiness and the impurities of their service. The mingled blood of the two victims being sprinkled on the horns of the altar indicated that the priests and the people equally needed an atonement for their sins. But the sanctuary being thus ceremonially purified, and the people of Israel reconciled by the blood of the consecrated victim, the Lord continued to dwell in the midst of them, and to honor them with His gracious presence.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "In the tabernacle of the congregation, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. in the holy place, where the priests and Levites were at other times. This was commanded for the greater reverence to the Divine Majesty, then in a more special manner appearing, and that none of them might cast an eye into the holy of holies as the high priest went in or came out. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And there shall be no man in the tabernacle of the congregation,.... Not any of the priests, as Aben Ezra, no, not in the holy place where they ministered, nor in the court of the tabernacle, nor in any of the courts, nor indeed any of the people: all places were cleared ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "when he, the high priest: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "goeth in to make an atonement in the holy place until he come out; this in the mystery of it was to signify, that atonement for sin is made only by Christ our high priest; he himself, and no other, bore our sins, and he himself purged them away, or by his sacrifice alone expiated them; his own arm wrought salvation, and of the people there were none with him to help and assist him; when he the Shepherd was smitten by the sword of justice, the sheep were scattered, all his disciples forsook him and fled; there were none to appear for him, or stand by him, or in the least to lend an assisting hand in the great work in which he was engaged; he is the only Mediator, between God and man, both of redemption and of intercession; he is the alone Saviour, to him only are sinners to look for salvation, and he is to have all the glory; he had no partner in the work, and he will have no rival in the honour of it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and have made an atonement for himself, and for his household; his whole family, and all the priests, by the bullock of his sin offering, as Aben Ezra observes, and by carrying in the blood of it within the vail, and sprinkling it there: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and for all the congregation of Israel; by the goat of their sin offering, as the same writer notes, and doing with the blood of that as with the blood of the bullock; all typical of the atonement of Christ for his mystical self the church; for the whole family and household of God; for the general assembly and church of the firstborn, whose names are written in heaven. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and for all the congregation of Israel; by the goat of their sin offering, as the same writer notes, and doing with the blood of that as with the blood of the bullock; all typical of the atonement of Christ for his mystical self the church; for the whole family and household of God; for the general assembly and church of the firstborn, whose names are written in heaven. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And there shall be no man in the tabernacle of the congregation when he goeth in to make an atonement in the holy place, until he come out, and have made an atonement for himself, and for his household, and for all the congregation of Israel.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 17.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "There shall be no man in the tabernacle of the congregation.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " From the first entry until the work of atonement was completed, both for the holy of holies and for the tabernacle, no one but the high priest was to be allowed within the door of the tabernacle, not only that there might be no witness of the withdrawal of the awful vail, but also that the rite of purification might not be interfered with by an impure presence. Even on the Day of Atonement the dwelling-place of God, typical of heaven, was closed to the eye and foot of man, \"the way into the holiest of all being not yet made manifest\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 9:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), until the Divine High Priest opened the way for his people by his own entrance. Leviticus 16:17",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "There was to be no one in the ohel moed when Aaron went into it to make expiation in the most holy place, until he came out (of the tabernacle) again; not because no one but the chief servant of Jehovah was worthy to be near or present either as spectator or assistant at this sacred act before Jehovah (Knobel), but because no unholy person was to defile by his presence the sanctuary, which had just been cleansed; just as no layman at all was allowed to enter the holy place, or could go with impunity into the presence of the holy God. ",
        "children": []
      }
    ]
  }
]