[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(28) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And he that burneth.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—That is, those who carried the carcases and burned them, like the messenger who conducted the sin-laden goat, contracted defilement from the atoning victims. They had, therefore, to undergo the same ablutions.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "16:15-34 Here are typified the two great gospel privileges, of the remission of sin, and access to God, both of which we owe to our Lord Jesus. See the expiation of guilt. Christ is both the Maker and the Matter of the atonement; for he is the Priest, the High Priest, that makes reconciliation for the sins of the people. And as Christ is the High Priest, so he is the Sacrifice with which atonement is made; for he is all in all in our reconciliation to God. Thus he was figured by the two goats. The slain goat was a type of Christ dying for our sins; the scape-goat a type of Christ rising again for our justification. The atonement is said to be completed by putting the sins of Israel upon the head of the goat, which was sent away into a wilderness, a land not inhabited; and the sending away of the goat represented the free and full remission of their sins. He shall bear upon him all their iniquities. Thus Christ, the Lamb of God, takes away the sin of the world, by taking it upon himself, Joh 1:29. The entrance into heaven, which Christ made for us, was typified by the high priest's entrance into the most holy place. See Heb 9:7. The high priest was to come out again; but our Lord Jesus ever lives, making intercession, and always appears in the presence of God for us. Here are typified the two great gospel duties of faith and repentance. By faith we put our hands upon the head of the offering; relying on Christ as the Lord our Righteousness, pleading his satisfaction, as that which alone is able to atone for our sins, and procure us a pardon. By repentance we afflict our souls; not only fasting for a time from the delights of the body, but inwardly sorrowing for sin, and living a life of self-denial, assuring ourselves, that if we confess our sins, God is faithful and just to forgive us our sins, and to cleanse us from all unrighteousness. By the atonement we obtain rest for our souls, and all the glorious liberties of the children of God. Sinner, get the blood of Christ effectually applied to thy soul, or else thou canst never look God in the face with any comfort or acceptance. Take this blood of Christ, apply it by faith, and see how it atones with God.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Shall burn in the fire - i. e., consume in the fire, not burn sacrificially. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 1:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "23-28. Aaron shall come into the tabernacle of the congregation, and shall put off the linen garments—On the dismissal of the scapegoat, the high priest prepared for the important parts of the service which still remained; and for the performance of these he laid aside his plain linen clothes, and, having bathed himself in water, he assumed his pontifical dress. Thus gorgeously attired, he went to present the burnt offerings which were prescribed for himself and the people, consisting of the two rams which had been brought with the sin offerings, but reserved till now. The fat was ordered to be burnt upon the altar; the rest of the carcasses to be cut down and given to some priestly attendants to burn without the camp, in conformity with the general law for the sin offerings (Le 4:8-12; 8:14-17). The persons employed in burning them, as well as the conductor of the scapegoat, were obliged to wash their clothes and bathe their flesh in water before they were allowed to return into the camp.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And he that burneth them shall wash his clothes, and bathe his flesh in water,.... In forty seahs of water, as the Targum of Jonathan; that is, everyone of those that burnt them, as Aben Ezra observes; for these being sin offerings, and had a connection with the sins of men, for whom they were offered, the persons concerned in the carrying and burning of them were equally defiled, and needed washing, as the man that led and let go the goat into the wilderness: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and afterwards he shall come into the camp; and have the liberty of conversation with men in civil and religious things, but not till evening; so long he was defiled; and according to the Misnah (u) from the time they got without the walls of the court; and after washing and bathing, and when the evening was come, they were clean; and might go where they pleased, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(u) Misn. Yoma, c. 6. sect. 7.0 ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(u) Misn. Yoma, c. 6. sect. 7.0 ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And he that burneth them shall wash his clothes, and bathe his flesh in water, and afterward he shall come into the camp.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The man who took the goat into the desert, and those who burned the two sin-offerings outside the camp (see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 4:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 4:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), had also to wash their clothes and bathe their bodies before they returned to the camp, because they had been defiled by the animals laden with sin. ",
        "children": []
      }
    ]
  }
]