[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(3) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Thus shall Aaron come.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Better, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "With this shall, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c, that is, with the following sacrifices, ritual, vestments, &c, shall he approach the most holy place, after having offered previously the daily morning sacrifice, and performed the ordinary daily service. During the performance of the morning service the high priest, at the time of Christ, wore the golden vestments. These he changed for the white garments before he commenced the special ritual prescribed for this day.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "With a young bullock for a sin offering.—Which had to be of the second year (see Exodus 29:1), and which the high priest had to buy with his own money. It was to be his own property because the victim was to expiate his own sins, since he, like the meanest sinner, required Divine mercy and forgiveness, though, owing to his high office, he had to bring a more costly sacrifice.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "With a young bullock for a sin offering.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Which had to be of the second year (see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 29:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and which the high priest had to buy with his own money. It was to be his own property because the victim was to expiate his own sins, since he, like the meanest sinner, required Divine mercy and forgiveness, though, owing to his high office, he had to bring a more costly sacrifice.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Leviticus 16:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 16:3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Thus shall Aaron come — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Preparatory to his entering on this solemn service the high-priest was to offer two sacrifices in behalf of himself and his family. These were, 1st, A bullock for a sin-offering, (no other sacrifice being allowed for the sin of a high-priest,) in confession of his own infirmities and transgressions, and those of his family, and to put him in mind that he needed pardon himself, and was but an imperfect intercessor with God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 7:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 9:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". 2d, A ram for a burnt- offering, in token of his dedicating himself wholly to God, with a promise of new obedience. See note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Aaron shall come into the holy place with the bullock — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That is, with the blood of it; for its body was to be offered upon the altar of burnt-offerings.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "16:1-14 Without entering into particulars of the sacrifices on the great day of atonement, we may notice that it was to be a statute for ever, till that dispensation be at an end. As long as we are continually sinning, we continually need the atonement. The law of afflicting our souls for sin, is a statue which will continue in force till we arrive where all tears, even those of repentance, will be wiped from our eyes. The apostle observes it as a proof that the sacrifices could not take away sin, and cleanse the conscience from it, that in them there was a remembrance made of sin every year, upon the day of atonement, Heb 10:1,3. The repeating the sacrifices, showed there was in them but a feeble effort toward making atonement; this could be done only by offering up the body of Christ once for all; and that sacrifice needed not to be repeated.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Holy place - This name here denotes the sanctuary, the whole sacred enclosure, the court of the tabernacle. The offerings were for Aaron and his sons, supplied by himself. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3, 4. Thus shall Aaron come into the holy place—As the duties of the great day of atonement led to the nearest and most solemn approach to God, the directions as to the proper course to be followed were minute and special.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "with a young bullock … and a ram—These victims he brought alive, but they were not offered in sacrifice till he had gone through the ceremonies described between Le 16:3-11. He was not to attire himself on that occasion in the splendid robes that were proper to his sacred office, but in a plain dress of linen, like the common Levites, for, as he was then to make atonement for his own sins, as well as for those of the people, he was to appear in the humble character of a suppliant. That plain dress was more in harmony with a season of humiliation (as well as lighter and more convenient for the duties which on that occasion he had singly to perform) than the gorgeous robes of the pontificate. It showed that when all appeared as sinners, the highest and lowest were then on a level, and that there is no distinction of persons with God [Ac 10:34].",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Thus; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in this manner, or upon these terms. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "With a young bullock",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", i.e. with the blood of it, as it is explained ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Leviticus 16:14",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 16:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". So it is a synecdoche, the whole put for the part. For as for the body of it, that was to be killed and offered without upon the altar of burnt-offerings. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "For a sin-offering, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for his own and family’s sins, for a goat was offered for the sins of the people. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Thus shall Aaron come into the holy place,.... The most holy place; and this was after he had offered the daily sacrifice of the morning, and had performed the rest of the service then done, as Gersom observes; such as burning the incense and trimming the lamps, for no offering preceded the daily sacrifice: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "with a young bullock for a sin offering, and a ram for a burnt offering; which were both for himself and his family; and such were the weakness, imperfection, and insufficiency of the Levitical priesthood, and priests, that they were obliged first to offer for their own sins, and then for the sins of the people: the meaning is not, as Aben Ezra says, that he should bring the bullock into the holy place, only that he should first give of his own a bullock for a sin offering, to atone for himself, and for the priests; nor could it be the body of the bullock he brought, only the blood of it into the most holy place, where he entered not without blood, first with the blood of the bullock, and then with the blood of the goat; for the body of the bullock for a sin offering was burnt without the camp, and the body of the ram for the burnt offering was burnt upon the altar of burnt offering; see Hebrews 9:7. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "with a young bullock for a sin offering, and a ram for a burnt offering; which were both for himself and his family; and such were the weakness, imperfection, and insufficiency of the Levitical priesthood, and priests, that they were obliged first to offer for their own sins, and then for the sins of the people: the meaning is not, as Aben Ezra says, that he should bring the bullock into the holy place, only that he should first give of his own a bullock for a sin offering, to atone for himself, and for the priests; nor could it be the body of the bullock he brought, only the blood of it into the most holy place, where he entered not without blood, first with the blood of the bullock, and then with the blood of the goat; for the body of the bullock for a sin offering was burnt without the camp, and the body of the ram for the burnt offering was burnt upon the altar of burnt offering; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 9:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Thus shall Aaron come into the holy place: with a young bullock for a sin offering, and a ram for a burnt offering.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Herewith",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] with the offerings and ceremonies set forth in what follows.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Thus shall Aaron come into the holy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " place. \"Thus\" would be translated more literally by ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "With this.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " He must come supplied with the specified offerings, dressed in the appointed manner and using the ceremonial here designated. The efficacy of the acts of the high priest on this day and throughout his ministrations depended not upon his individual but on his official character, and on his obedience to the various commandments positively enjoined. Personal worthiness would not qualify him for his service, nor personal unworthiness hinder the effect of his liturgical acts (cf. Art. 26, 'Of the Unworthiness of the Ministers, which hinders not the effect of the Sacrament'). Aaron's special offerings for himself on this great day are to be a young bullock for a sin offering, and a ram for a burnt offering. Leviticus 16:3",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Only בּזאת, \"with this,\" i.e., with the sacrifices, dress, purifications, and means of expiation mentioned afterwards, could he go into \"the holy place,\" i.e., according to the more precise description in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 16:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", into the inmost division of the tabernacle, which is called Kodesh hakkadashim, \"the holy of holies,\" in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 26:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". He was to bring an ox (bullock) for a sin-offering and a ram for a burnt-offering, as a sacrifice for himself and his house (i.e., the priesthood, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 16:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and two he-goats for a sin-offering and a ram for a burnt-offering, as a sacrifice for the congregation. For this purpose he was to put on, not the state-costume of the high priest, but a body-coat, drawers, girdle, and head-dress of white cloth (bad: see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 28:42",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), having first bathed his body, and not merely his hands and feet, as he did for the ordinary service, to appear before Jehovah as entirely cleansed from the defilement of sin (see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 8:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") and arrayed in clothes of holiness. The dress of white cloth was not the plain official dress of the ordinary priests, for the girdle of that dress was coloured (see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 28:39-40",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); and in that case the high priest would not have appeared in the perfect purity of his divinely appointed office as chief of the priesthood, but simply as the priest appointed for this day (v. Hoffmann). Nor did he officiate (as many of the Rabbins, and also C. a Lapide, Grotius, Rosenmller, and Knobel suppose) as a penitent praying humbly for the forgiveness of sin. For where in all the world have clear white clothes been worn either in mourning or as a penitential garment? The emphatic expression, \"these are holy garments,\" is a sufficient proof that the pure white colour of all the clothes, even of the girdle, was intended as a representation of holiness. Although in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 28:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 28:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc., the official dress not only of Aaron, but of his sons also, that is to say, the priestly costume generally, is described as \"holy garments,\" yet in the present chapter the word kodesh, \"holy,\" is frequently used in an emphatic sense (for example, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 16:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 16:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 16:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", of the most holy place of the dwelling), and by this predicate the dress is characterized as most holy. Moreover, it was in baddim (\"linen\") that the angel of Jehovah was clothed (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 9:2-3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 9:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 10:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 10:6-7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 10:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 12:6-7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), whose whole appearance, as described in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 10:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", resembled the appearance of the glory of Jehovah, which Ezekiel saw in the vision of the four cherubim (ch. 1), and was almost exactly like the glory of Jesus Christ, which John saw in the Revelation (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 1:13-15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The white material, therefore, of the dress which Aaron wore, when performing the highest act of expiation under the Old Testament, was a symbolical shadowing forth of the holiness and glory of the one perfect Mediator between God and man, who, being the radiation of the glory of God and the image of His nature, effected by Himself the perfect cleansing away of our sin, and who, as the true High Priest, being holy, innocent, unspotted, and separate from sinners, entered once by His own blood into the holy place not made with hands, namely, into heaven itself, to appear before the face of God for us, and obtain everlasting redemption (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 7:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 9:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 9:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      }
    ]
  }
]