[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(34) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And this shall be an everlasting statute.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Better, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And this shall be a statute for ever, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "as the Authorised Version has it in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 16:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Here, again, we have an instance of how the same phrase which occurs three times within four verses (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 16:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 16:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 16:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") is rendered in the Authorised Version by two different phrases, thus giving the idea to the English reader that there is a difference in the original. The thrice-repeated phrase emphasises the abiding nature of this law, and indicates the solemnity of the day.",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And he did as the Lord commanded Moses—That is, Aaron performed the service for the first time, according to the ordinances which the Lord communicated to Moses. A similar remark occurs at the first observance of the Passover. (See Exodus 12:50.) The solemn admonition, therefore, addressed to the priesthood at the beginning of this chapter (see Leviticus 16:1-2), not to presume on their office, but to submit to the Divine regulations, was duly observed by the first high priest. It may, however, also be designed to indicate that Aaron did not assume the dignity of the pontificate to exalt himself, but in obedience to the command God gave to Moses.Benson CommentaryLeviticus 16:34. This shall be an everlasting statute — By which were typified the two great gospel privileges; remission of sins and access to God, both which we owe to the mediation of the Lord Jesus. He shall make an atonement — for all their sins — Meaning all such sins as could be expiated by the law, which were, τα αγνοηματα, the errors, or sins of ignorance of the people, as the apostle expresses it Hebrews 9:6, where he speaks of the atonement made on this day. “To this sort of offences alone,” as Dr. Doddridge justly observes on the verse just referred to, “and not to those presumptuously committed, the efficacy of the atonement extended.” And even to justification from these, as the Hebrew doctors justly observe, all these rites of expiation, however solemnly performed, availed nothing in the sight of God, without repentance, and sincere resolutions of new obedience. Now, the two great gospel duties of repentance and faith are hereby typified; by which we obtain an interest in the atonement made by the death of Christ, and come to be entitled to the benefit of it. By repentance we must afflict our souls — inwardly sorrowing for our sins, and living a life of self-denial and mortification. And we must make a penitent confession of sin, and that with an eye to Christ whom we have pierced. By faith we must put our hands on the head of the offering, relying on Christ as the Lord our righteousness; pleading his satisfaction, as that which was alone able to atone for our sins, and procure us a pardon, and with a hand of faith on his sacrifice, must assure ourselves that, if we confess and forsake our sins, God is faithful and just to forgive us our sins, and cleanse us from all unrighteousness. We may observe further here, that in the year of jubilee, the trumpet which proclaimed liberty was ordered to be sounded in the close of the day of atonement, Leviticus 25:9. For the remission of the debt we owe to God, our release from the bondage of sin, and our return to our inheritance above, are all owing to the mediation and intercession of Jesus Christ. By the atonement we obtain rest for our souls, and all the glorious liberties of the children of God.Matthew Henry's Concise Commentary16:15-34 Here are typified the two great gospel privileges, of the remission of sin, and access to God, both of which we owe to our Lord Jesus. See the expiation of guilt. Christ is both the Maker and the Matter of the atonement; for he is the Priest, the High Priest, that makes reconciliation for the sins of the people. And as Christ is the High Priest, so he is the Sacrifice with which atonement is made; for he is all in all in our reconciliation to God. Thus he was figured by the two goats. The slain goat was a type of Christ dying for our sins; the scape-goat a type of Christ rising again for our justification. The atonement is said to be completed by putting the sins of Israel upon the head of the goat, which was sent away into a wilderness, a land not inhabited; and the sending away of the goat represented the free and full remission of their sins. He shall bear upon him all their iniquities. Thus Christ, the Lamb of God, takes away the sin of the world, by taking it upon himself, Joh 1:29. The entrance into heaven, which Christ made for us, was typified by the high priest's entrance into the most holy place. See Heb 9:7. The high priest was to come out again; but our Lord Jesus ever lives, making intercession, and always appears in the presence of God for us. Here are typified the two great gospel duties of faith and repentance. By faith we put our hands upon the head of the offering; relying on Christ as the Lord our Righteousness, pleading his satisfaction, as that which alone is able to atone for our sins, and procure us a pardon. By repentance we afflict our souls; not only fasting for a time from the delights of the body, but inwardly sorrowing for sin, and living a life of self-denial, assuring ourselves, that if we confess our sins, God is faithful and just to forgive us our sins, and to cleanse us from all unrighteousness. By the atonement we obtain rest for our souls, and all the glorious liberties of the children of God. Sinner, get the blood of Christ effectually applied to thy soul, or else thou canst never look God in the face with any comfort or acceptance. Take this blood of Christ, apply it by faith, and see how it atones with God.Barnes' Notes on the BibleA summary of what was done on the day of atonement.The day was intended as an occasion for expressing more completely than could be done in the ordinary sacrifices the spiritual truth of atonement, with a fuller acknowledgment of the sinfulness and weakness of man and of the corruptible nature of all earthly things, even of those most solemnly consecrated and devoted to the service of God. It belonged to its observances especially to set forth, by the entrance of the high priest into the holy of holies, that atonement could only he effected before the throne of Yahweh Himself (compare Matthew 9:6; Mark 2:7-10; Hebrews 4:16, etc.); and, by the goat sent into the wilderness, that the sins atoned for were not only forgiven, but carried wholly away. See Leviticus 16:22 note. The rites were a solemn gathering up of all other rites of atonement, so as to make them point more expressively to the revelation to come of God's gracious purpose to man in sending His Son to be delivered for our offences, and to rise again for our justification; to be our great high priest forever after the order of Melchisedec, and to enter for us within the veil Romans 4:25; Hebrews 6:20. The Day of Atonement expanded the meaning of every sin-offering, in the same way as the services for Good Friday and Ash Wednesday expand the meaning of our litany days throughout the year, and Easter Day, that of our Sundays. Jamieson-Fausset-Brown Bible Commentary29-34. this shall be a statute for ever unto you, that in the seventh month ye shall afflict your souls—This day of annual expiation for all the sins, irreverences, and impurities of all classes in Israel during the previous year, was to be observed as a solemn fast, in which \"they were to afflict their souls\"; it was reckoned a sabbath, kept as a season of \"holy convocation,\" or, assembling for religious purposes. All persons who performed any labor were subject to the penalty of death [Ex 31:14, 15; 35:2]. It took place on the tenth day of the seventh month, corresponding to our third of October; and this chapter, together with Le 23:27-32, as containing special allusion to the observances of the day, was publicly read. The rehearsal of these passages appointing the solemn ceremonial was very appropriate, and the details of the successive parts of it (above all the spectacle of the public departure of the scapegoat under the care of its leader) must have produced salutary impressions both of sin and of duty that would not be soon effaced.   Matthew Poole's Commentary No text from Poole on this verse. Gill's Exposition of the Entire BibleAnd this shall be an everlasting statute unto you,.... Which is the third time of its being observed, see Leviticus 16:29, to show that this was a law of considerable moment, and to be taken notice of, and strictly and closely kept by the priests, to whom these words are directed, and on whom the chief service of the day lay: to make atonement for the children of Israel for all their sins once a year; namely, on the tenth day of the seventh month, or Tisri, as before directed: and he did as the Lord commanded Moses; that is, Aaron did, as the Targum of Jonathan, Aben Ezra, and Ben Gersom supply it; when the day of atonement came, as Jarchi expresses it, he did according to this order, to fulfil the decree of the king, even the King of kings; whose will it was that such a day should be yearly observed, and such and such rules performed in it; so very significant of Christ, and of the atonement to be made by him, and which has been made. Geneva Study BibleAnd this shall be an everlasting statute unto you, to make an atonement for the children of Israel for all their sins once a year. And he did as the LORD commanded Moses.",
        "children": [
          {
            "element": "p",
            "class": "",
            "text": "And he did as the Lord commanded Moses—That is, Aaron performed the service for the first time, according to the ordinances which the Lord communicated to Moses. A similar remark occurs at the first observance of the Passover. (See Exodus 12:50.) The solemn admonition, therefore, addressed to the priesthood at the beginning of this chapter (see Leviticus 16:1-2), not to presume on their office, but to submit to the Divine regulations, was duly observed by the first high priest. It may, however, also be designed to indicate that Aaron did not assume the dignity of the pontificate to exalt himself, but in obedience to the command God gave to Moses.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Benson Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Leviticus 16:34",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "This shall be an everlasting statute — ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "By which were typified the two great gospel privileges; remission of sins and access to God, both which we owe to the mediation of the Lord Jesus. He shall ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "make an atonement — for all their sins — ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Meaning all such sins as could be expiated by the law, which were, ",
            "children": []
          },
          {
            "element": "span",
            "class": "greekheb",
            "text": "τα αγνοηματα",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "errors, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "or sins of ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "ignorance ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "of the people, as the apostle expresses it ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 9:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where he speaks of the atonement made on this day. “To this sort of offences alone,” as Dr. Doddridge justly observes on the verse just referred to, “and not to those presumptuously committed, the efficacy of the atonement extended.” And even to justification from these, as the Hebrew doctors justly observe, all these rites of expiation, however solemnly performed, availed nothing in the sight of God, without repentance, and sincere resolutions of new obedience. Now, the two great gospel duties of repentance and faith are hereby typified; by which we obtain an interest in the atonement made by the death of Christ, and come to be entitled to the benefit of it. By ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "repentance ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "we must afflict our souls — inwardly sorrowing for our sins, and living a life of self-denial and mortification. And we must make a penitent confession of sin, and that with an eye to Christ ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "whom we have pierced. ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "By ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "faith ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "we must put our hands on the head of the offering, relying on Christ as ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "the Lord our righteousness; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "pleading his satisfaction, as that which was alone able to atone for our sins, and procure us a pardon, and with a hand of faith on his sacrifice, must assure ourselves that, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "if we confess ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "and forsake ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "our sins, God is faithful and just to forgive us our sins, and cleanse us from all unrighteousness. ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "We may observe further here, that in the year of jubilee, the trumpet which proclaimed liberty was ordered to be sounded in the close of the day of atonement, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 25:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". For the remission of the debt we owe to God, our release from the bondage of sin, and our return to our inheritance above, are all owing to the mediation and intercession of Jesus Christ. By the atonement we obtain rest for our souls, and all the glorious ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "liberties of the children of God.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Matthew Henry's Concise Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "16:15-34 Here are typified the two great gospel privileges, of the remission of sin, and access to God, both of which we owe to our Lord Jesus. See the expiation of guilt. Christ is both the Maker and the Matter of the atonement; for he is the Priest, the High Priest, that makes reconciliation for the sins of the people. And as Christ is the High Priest, so he is the Sacrifice with which atonement is made; for he is all in all in our reconciliation to God. Thus he was figured by the two goats. The slain goat was a type of Christ dying for our sins; the scape-goat a type of Christ rising again for our justification. The atonement is said to be completed by putting the sins of Israel upon the head of the goat, which was sent away into a wilderness, a land not inhabited; and the sending away of the goat represented the free and full remission of their sins. He shall bear upon him all their iniquities. Thus Christ, the Lamb of God, takes away the sin of the world, by taking it upon himself, Joh 1:29. The entrance into heaven, which Christ made for us, was typified by the high priest's entrance into the most holy place. See Heb 9:7. The high priest was to come out again; but our Lord Jesus ever lives, making intercession, and always appears in the presence of God for us. Here are typified the two great gospel duties of faith and repentance. By faith we put our hands upon the head of the offering; relying on Christ as the Lord our Righteousness, pleading his satisfaction, as that which alone is able to atone for our sins, and procure us a pardon. By repentance we afflict our souls; not only fasting for a time from the delights of the body, but inwardly sorrowing for sin, and living a life of self-denial, assuring ourselves, that if we confess our sins, God is faithful and just to forgive us our sins, and to cleanse us from all unrighteousness. By the atonement we obtain rest for our souls, and all the glorious liberties of the children of God. Sinner, get the blood of Christ effectually applied to thy soul, or else thou canst never look God in the face with any comfort or acceptance. Take this blood of Christ, apply it by faith, and see how it atones with God.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Barnes' Notes on the Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "A summary of what was done on the day of atonement.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "The day was intended as an occasion for expressing more completely than could be done in the ordinary sacrifices the spiritual truth of atonement, with a fuller acknowledgment of the sinfulness and weakness of man and of the corruptible nature of all earthly things, even of those most solemnly consecrated and devoted to the service of God. It belonged to its observances especially to set forth, by the entrance of the high priest into the holy of holies, that atonement could only he effected before the throne of Yahweh Himself (compare Matthew 9:6; Mark 2:7-10; Hebrews 4:16, etc.); and, by the goat sent into the wilderness, that the sins atoned for were not only forgiven, but carried wholly away. See Leviticus 16:22 note. The rites were a solemn gathering up of all other rites of atonement, so as to make them point more expressively to the revelation to come of God's gracious purpose to man in sending His Son to be delivered for our offences, and to rise again for our justification; to be our great high priest forever after the order of Melchisedec, and to enter for us within the veil Romans 4:25; Hebrews 6:20. The Day of Atonement expanded the meaning of every sin-offering, in the same way as the services for Good Friday and Ash Wednesday expand the meaning of our litany days throughout the year, and Easter Day, that of our Sundays. ",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Jamieson-Fausset-Brown Bible Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "29-34. this shall be a statute for ever unto you, that in the seventh month ye shall afflict your souls—This day of annual expiation for all the sins, irreverences, and impurities of all classes in Israel during the previous year, was to be observed as a solemn fast, in which \"they were to afflict their souls\"; it was reckoned a sabbath, kept as a season of \"holy convocation,\" or, assembling for religious purposes. All persons who performed any labor were subject to the penalty of death [Ex 31:14, 15; 35:2]. It took place on the tenth day of the seventh month, corresponding to our third of October; and this chapter, together with Le 23:27-32, as containing special allusion to the observances of the day, was publicly read. The rehearsal of these passages appointing the solemn ceremonial was very appropriate, and the details of the successive parts of it (above all the spectacle of the public departure of the scapegoat under the care of its leader) must have produced salutary impressions both of sin and of duty that would not be soon effaced.   ",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Matthew Poole's Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " No text from Poole on this verse. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Gill's Exposition of the Entire Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "And this shall be an everlasting statute unto you,.... Which is the third time of its being observed, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 16:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", to show that this was a law of considerable moment, and to be taken notice of, and strictly and closely kept by the priests, to whom these words are directed, and on whom the chief service of the day lay: ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "to make atonement for the children of Israel for all their sins once a year; namely, on the tenth day of the seventh month, or Tisri, as before directed: ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "and he did as the Lord commanded Moses; that is, Aaron did, as the Targum of Jonathan, Aben Ezra, and Ben Gersom supply it; when the day of atonement came, as Jarchi expresses it, he did according to this order, to fulfil the decree of the king, even the King of kings; whose will it was that such a day should be yearly observed, and such and such rules performed in it; so very significant of Christ, and of the atonement to be made by him, and which has been made. ",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Geneva Study Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse2",
            "text": "And this shall be an everlasting statute unto you, to make an atonement for the children of Israel for all their sins once a year. And he did as the LORD commanded Moses.",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 34.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "This shall be an everlasting statute unto you",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It lasted as long as the earthly Jerusalem lasted, and until the heavenly Jerusalem was instituted, when it had a spiritual fulfillment once for all. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "\"Of",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " old there was an high priest that cleansed the people with the blood of bulls and goats, but now that the true High Priest is come, the former priesthood is no more. It is a providential dispensation of God that the city and temple of Jerusalem have been destroyed; for if they were still standing, some who are weak in faith might be dazzled by the outward splendor of the literal types, and not drawn by faith to the spiritual antitypes. If there are any, therefore, who, in considering the Levitical ritual of the great Day of Atonement, and in looking at the two he-goats - the one sacrificed, the other let go, charged with ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "sins",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", into the wilderness - do not recognize the one Christ who died for our ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "sins",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and took away our ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "sins",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and do not see there the 'everlasting statute' of which God here speaks by Moses, let him go up thrice a year to Jerusalem, and there search for the altar which has crumbled in the dust, and offer up his victims there without a priest. But no; thanks be to God, the earthly priesthood and temple are abolished, that we may raise our heart to the heavenly, and look up with faith and love and joy to him who offered himself once for all, and who ever liveth to make intercession for us\" (Origen, 'Hom.' 10, as quoted by Wordsworth). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And he did as the Lord commanded Moses",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; that is. Moses announced to Aaron the Law which was to be carried out about five months later. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Leviticus 16:34",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In the future, the priest who was anointed and set apart for the duty of the priesthood in his father's stead, i.e., the existing high priest, was to perform the act of expiation in the manner prescribed, and that \"once a year.\" The yearly repetition of the general atonement showed that the sacrifices of the law were not sufficient to make the servant of God perfect according to this own conscience. And this imperfection of the expiation, made with the blood of bullocks and goats, could not fail to awaken a longing for the perfect sacrifice of the eternal High Priest, who has obtained eternal redemption by entering once, through His own blood, into the holiest of all (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 9:7-12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). And just as this was effected negatively, so by the fact that the high priest entered on this day into the holiest of all, as the representative of the whole congregation, and there, before the throne of God, completed its reconciliation with Him, was the necessity exhibited in a positive manner for the true reconciliation of man, and his introduction into a perfect and abiding fellowship with Him, and the eventual realization of this by the blood of the Son of God, our eternal High Priest and Mediator, prophetically foreshadowed. The closing words in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 16:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"and he (i.e., Aaron, to whom Moses was to communicate the instructions of God concerning the feast of atonement, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 16:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") did as the Lord commanded Moses,\" are anticipatory in their character, like ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 12:50",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". For the law in question could not be carried out till the seventh month of the current year, that is to say, as we find from a comparison of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 10:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 40:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", not till after the departure of Israel from Sinai. ",
        "children": []
      }
    ]
  }
]