[{"num":24,"verse":"Yo’ash was seven years old when he began his reign, and he reigned forty years in Yerushalayim. His mother’s name was Tzivyah, from Be’er-Sheva. "},{"num":2,"verse":"Yo’ash did what was right from Adonai’s perspective throughout the lifetime of Y’hoyada the cohen. "},{"num":3,"verse":"Y’hoyada chose two wives for him, and he became the father of sons and daughters."},{"num":4,"verse":"Some time later, Yo’ash decided to restore the house of Adonai. "},{"num":5,"verse":"He gathered the cohanim and L’vi’im and said to them, “Go out to the cities of Y’hudah, and collect money each year from all Isra’el to repair the house of your God. See that you do this promptly.” But when the L’vi’im procrastinated, "},{"num":6,"verse":"the king summoned Y’hoyada the chief and said to him, “Why haven’t you demanded that the L’vi’im bring in from Y’hudah and Yerushalayim the tax prescribed by Moshe the servant of Adonai and by the community of Isra’el, for the tent of the testimony?” "},{"num":7,"verse":"For the sons of that wicked ‘Atalyahu had broken up the house of God, and they had given all the consecrated things belonging to the house of Adonai to the ba‘alim."},{"num":8,"verse":"Then, at the king’s order, they made a box and placed it outside the entrance to the house of Adonai. "},{"num":9,"verse":"They proclaimed throughout Y’hudah and Yerushalayim that the tax Moshe the servant of God had imposed on Isra’el in the desert should be brought in for Adonai. "},{"num":10,"verse":"All the leaders and all the people were glad to bring in their contributions and put them in the box, until it was full. "},{"num":11,"verse":"When the box was brought to the king’s officials by the L’vi’im, and when they saw how much money there was, the king’s secretary and the chief cohen’s official came and emptied the box; then they took it and returned it to its place. They did this daily, and they collected money in abundance."},{"num":12,"verse":"The king and Y’hoyada gave it to those in charge of taking care of the house of Adonai. They, in turn, hired stone-workers and carpenters to restore the house of Adonai, also iron- and bronze-workers to repair the house of Adonai. "},{"num":13,"verse":"The workers got on with their tasks, so that the restoration progressed well, until they had returned the house of God to its earlier condition and strengthened it. "},{"num":14,"verse":"When they had finished, they brought the rest of the money to the king and Y’hoyada, and it was used to make equipment for the house of Adonai — articles for ministry, buckets, fire pans, and utensils of gold and silver. So they offered burnt offerings in the house of Adonai regularly throughout the time of Y’hoyada."},{"num":15,"verse":"But Y’hoyada grew old; and when he was full of days, he died. He was 130 years old when he died. "},{"num":16,"verse":"They buried him in the City of David among the kings, because he had served Isra’el, God and his house well."},{"num":17,"verse":"After Y’hoyada died, the leaders of Y’hudah came and prostrated themselves before the king. Then the king listened to them; "},{"num":18,"verse":"and they abandoned the house of Adonai the God of their ancestors and served the sacred poles and the idols. In consequence of their guilt, [God’s] anger fell on Y’hudah and Yerushalayim. "},{"num":19,"verse":"In spite of this, he sent them prophets to bring them back to Adonai; they warned them, but they wouldn’t pay attention. "},{"num":20,"verse":"The Spirit of God covered Z’kharyah the son of Y’hoyada the cohen; he stood above the people and addressed them: “Thus says God: ‘Why are you transgressing the mitzvot of Adonai and courting disaster? Because you have abandoned Adonai, he has abandoned you.” "},{"num":21,"verse":"But they conspired against him and stoned him to death at the order of the king in the courtyard of the house of Adonai. "},{"num":22,"verse":"Thus Yo’ash the king did not remember the kindness which Y’hoyada, [Z’kharyah’s] father, had done for him, but put his son to death. As he was dying he said, “May Adonai see this and take vengeance!”"},{"num":23,"verse":"The following spring, the army of Aram came up against him. They attacked Y’hudah and Yerushalayim, slaughtered all the people’s leaders and sent all their spoil to the king of Dammesek. "},{"num":24,"verse":"Although the army of Aram attacked with only a small company of men, Adonai handed over a very great army to them, because they had abandoned Adonai the God of their ancestors. Thus they executed judgment against Yo’ash."},{"num":25,"verse":"After they had left him — and they left him seriously wounded — his own servants conspired against him because he had shed the blood of the sons of Y’hoyada the cohen; and they killed him in his own bed. After he died, they buried him in the City of David, but they didn’t bury him in the tombs of the kings. "},{"num":26,"verse":"Those who conspired against him were Zavad the son of Shim‘at the ‘Amonit and Y’hozavad the son of Shimrit the Mo’avit."},{"num":27,"verse":"As for his sons, the heavy tribute imposed on him, and the rebuilding of the house of God, they are recorded in the commentary of the Annals of the Kings. Then Amatzyahu his son took his place as king."}]