[{"header":"King Joash of Judah(A)"},{"num":24,"verse":"Joash became king of Judah at the age of seven, and he ruled in Jerusalem for forty years. His mother was Zibiah from the city of Beersheba. "},{"num":2,"verse":"He did what was pleasing to the Lord as long as Jehoiada the priest was alive. "},{"num":3,"verse":"Jehoiada chose two wives for King Joash, and they bore him sons and daughters."},{"num":4,"verse":"After he had been king for a while, Joash decided to have the Temple repaired. "},{"num":5,"verse":"He ordered the priests and the Levites to go to the cities of Judah and collect from all the people enough money to make the annual repairs on the Temple. He told them to act promptly, but the Levites delayed, "},{"num":6,"verse":"so he called in Jehoiada, their leader, and demanded, “Why haven't you seen to it that the Levites collect from Judah and Jerusalem the tax which Moses, the servant of the Lord, required the people to pay for support of the Tent of the Lord's presence?”"},{"num":7,"verse":"(The followers of Athaliah, that corrupt woman, had damaged the Temple and had used many of the sacred objects in the worship of Baal.)"},{"num":8,"verse":"The king ordered the Levites to make a box for contributions and to place it at the Temple gate. "},{"num":9,"verse":"They sent word throughout Jerusalem and Judah for everyone to bring to the Lord the tax which Moses, God's servant, had first collected in the wilderness. "},{"num":10,"verse":"This pleased the people and their leaders, and they brought their tax money and filled the box with it. "},{"num":11,"verse":"Every day the Levites would take the box to the royal official who was in charge of it. Whenever it was full, the royal secretary and the High Priest's representative would take the money out and return the box to its place. And so they collected a large sum of money."},{"num":12,"verse":"The king and Jehoiada would give the money to those who were in charge of repairing the Temple, and they hired stonemasons, carpenters, and metalworkers to make the repairs. "},{"num":13,"verse":"All of them worked hard, and they restored the Temple to its original condition, as solid as ever. "},{"num":14,"verse":"When the repairs were finished, the remaining gold and silver was given to the king and Jehoiada, who used it to have bowls and other utensils made for the Temple."},{"header":"Jehoiada's Policies Are Reversed"},{"num":15,"verse":"After reaching the very old age of a hundred and thirty, he died. "},{"num":16,"verse":"They buried him in the royal tombs in David's City in recognition of the service he had done for the people of Israel, for God, and for the Temple."},{"num":17,"verse":"But once Jehoiada was dead, the leaders of Judah persuaded King Joash to listen to them instead. "},{"num":18,"verse":"And so the people stopped worshiping in the Temple of the Lord, the God of their ancestors, and began to worship idols and the images of the goddess Asherah. Their guilt for these sins brought the Lord's anger on Judah and Jerusalem. "},{"num":19,"verse":"The Lord sent prophets to warn them to return to him, but the people refused to listen. "},{"num":20,"verse":"Then the spirit of God took control of Zechariah son of Jehoiada the priest. He stood where the people could see him and called out, “The Lord God asks why you have disobeyed his commands and are bringing disaster on yourselves! You abandoned him, so he has abandoned you!” "},{"num":21,"verse":"King Joash joined in a conspiracy against Zechariah, and on the king's orders the people stoned Zechariah in the Temple courtyard. "},{"num":22,"verse":"The king forgot about the loyal service that Zechariah's father Jehoiada had given him, and he had Zechariah killed. As Zechariah was dying, he called out, “May the Lord see what you are doing and punish you!”"},{"header":"The End of Joash's Reign"},{"num":23,"verse":"When autumn came that year, the Syrian army attacked Judah and Jerusalem, killed all the leaders, and took large amounts of loot back to Damascus. "},{"num":24,"verse":"The Syrian army was small, but the Lord let them defeat a much larger Judean army because the people had abandoned him, the Lord God of their ancestors. In this way King Joash was punished. "},{"num":25,"verse":"He was severely wounded, and when the enemy withdrew, two of his officials plotted against him and killed him in his bed to avenge the murder of the son of Jehoiada the priest. He was buried in David's City, but not in the royal tombs. "},{"num":26,"verse":"(Those who plotted against him were Zabad, the son of an Ammonite woman named Shimeath, and Jehozabad, the son of a Moabite woman named Shimrith.) "},{"num":27,"verse":"The Commentary on the Book of Kings contains the stories of the sons of Joash, the prophecies spoken against him, and the record of how he rebuilt the Temple. His son Amaziah succeeded him as king."}]