[{"header":"Joash Repairs the Temple"},{"num":24,"verse":"Joash was seven years old when he became king. He ruled in Jerusalem for 40 years. His mother’s name was Zibiah. She was from Beersheba. "},{"num":2,"verse":"Joash did what was right in the eyes of the Lord. Joash lived that way as long as Jehoiada the priest was alive. "},{"num":3,"verse":"Jehoiada chose two wives for Joash. They had sons and daughters by Joash."},{"num":4,"verse":"Some time later Joash decided to make the Lord’s temple look like new again. "},{"num":5,"verse":"He called together the priests and Levites. He said to them, “Go to the towns of Judah. Collect the money that the nation of Israel owes every year. Use it to repair the temple of your God. Do it now.” But the Levites didn’t do it right away."},{"num":6,"verse":"So the king sent for Jehoiada the chief priest. He said to him, “Why haven’t you required the Levites to bring in the tax from Judah and Jerusalem? It was set up by the Lord’s servant Moses and the whole community of Israel. It was used for the tent where the tablets of the covenant law were kept.”"},{"num":7,"verse":"The children of that evil woman Athaliah had broken into God’s temple. They had used even its sacred objects for the gods that were named Baal."},{"num":8,"verse":"King Joash commanded that a wooden chest be made. It was placed outside near the gate of the Lord’s temple. "},{"num":9,"verse":"Then a message went out in Judah and Jerusalem. It said that the people should bring the tax to the Lord. God’s servant Moses had required Israel to pay that tax when they were in the desert. "},{"num":10,"verse":"All the officials and people gladly brought their money. They dropped it into the chest until it was full. "},{"num":11,"verse":"The chest was brought in by the Levites to the king’s officials. Every time the officials saw there was a large amount of money in the chest, it was emptied out. The royal secretary and the officer of the chief priest came and emptied it. Then they carried it back to its place. They did it regularly. They collected a great amount of money. "},{"num":12,"verse":"The king and Jehoiada gave it to the people who were doing the work on the Lord’s temple. They hired people who could lay the stones and people who could work with wood. They also hired people who could work with iron and bronze. They hired all of them to repair the temple."},{"num":13,"verse":"The men in charge of the work did their best. The repairs went very well under them. They rebuilt God’s temple. They did it in keeping with its original plans. They made the temple even stronger. "},{"num":14,"verse":"So they finished the work. Then they brought the rest of the money to the king and Jehoiada. It was used to pay for the objects that were made for the Lord’s temple. The objects were used for serving at the temple. They were also used for the burnt offerings. The objects included dishes and other things made out of gold and silver. As long as Jehoiada lived, burnt offerings were sacrificed continually at the Lord’s temple."},{"num":15,"verse":"Jehoiada had become very old. He died at the age of 130. "},{"num":16,"verse":"He was buried with the kings in the City of David. That’s because he had done so many good things in Israel for God and his temple."},{"header":"The Evil Things Joash Did"},{"num":17,"verse":"After Jehoiada died, the officials of Judah came to King Joash. They bowed down to him. He listened to them. "},{"num":18,"verse":"They turned their backs on the temple of the Lord, the God of their people. They worshiped poles made to honor the female god named Asherah. They also worshiped statues of other gods. Because Judah and Jerusalem were guilty of sin, God became angry with them. "},{"num":19,"verse":"The Lord sent prophets to the people to bring them back to him. The prophets told the people what they were doing wrong. But the people wouldn’t listen."},{"num":20,"verse":"Then the Spirit of God came on Zechariah the priest. He was the son of Jehoiada. Zechariah stood in front of the people. He told them, “God says, ‘Why do you refuse to obey my commands? You will not have success. You have deserted me. So I have deserted you.’ ”"},{"num":21,"verse":"But the people made evil plans against Zechariah. The king ordered them to kill Zechariah by throwing stones at him. They did it in the courtyard of the Lord’s temple. "},{"num":22,"verse":"King Joash didn’t remember how kind Zechariah’s father Jehoiada had been to him. So he killed Jehoiada’s son. As Zechariah was dying he said, “May the Lord see this. May he hold you responsible.”"},{"num":23,"verse":"In the spring, the army of Aram marched into Judah and Jerusalem against Joash. They killed all the leaders of the people. They took a large amount of goods from Judah. They sent it to their king in Damascus. "},{"num":24,"verse":"The army of Aram had come with only a few men. But the Lord allowed them to win the battle over a much larger army. Judah had deserted the Lord, the God of their people. That’s why the Lord punished Joash. "},{"num":25,"verse":"The army of Aram pulled back. They left Joash badly wounded. His officials planned to do evil things to him. That’s because he murdered the son of Jehoiada the priest. They killed Joash in his bed. So he died. He was buried in the City of David. But he wasn’t placed in the tombs of the kings."},{"num":26,"verse":"Those who made the plans against Joash were Zabad and Jehozabad. Zabad was the son of Shimeath. She was from Ammon. Jehozabad was the son of Shimrith. She was from Moab. "},{"num":27,"verse":"The story of the sons of Joash is written in the notes on the records of the kings. The many prophecies about him are written there too. So is the record of how he made God’s temple look like new again. Joash’s son Amaziah became the next king after him."}]