[{"header":"Joash Repairs the Temple"},{"num":24,"verse":"Jo′ash was seven years old when he began to reign, and he reigned forty years in Jerusalem; his mother’s name was Zib′iah of Beer-sheba. "},{"num":2,"verse":"And Jo′ash did what was right in the eyes of the Lord all the days of Jehoi′ada the priest. "},{"num":3,"verse":"Jehoi′ada got for him two wives, and he had sons and daughters."},{"num":4,"verse":"After this Jo′ash decided to restore the house of the Lord. "},{"num":5,"verse":"And he gathered the priests and the Levites, and said to them, “Go out to the cities of Judah, and gather from all Israel money to repair the house of your God from year to year; and see that you hasten the matter.” But the Levites did not hasten it. "},{"num":6,"verse":"So the king summoned Jehoi′ada the chief, and said to him, “Why have you not required the Levites to bring in from Judah and Jerusalem the tax levied by Moses, the servant of the Lord, on the congregation of Israel for the tent of testimony?” "},{"num":7,"verse":"For the sons of Athali′ah, that wicked woman, had broken into the house of God; and had also used all the dedicated things of the house of the Lord for the Ba′als."},{"num":8,"verse":"So the king commanded, and they made a chest, and set it outside the gate of the house of the Lord. "},{"num":9,"verse":"And proclamation was made throughout Judah and Jerusalem, to bring in for the Lord the tax that Moses the servant of God laid upon Israel in the wilderness. "},{"num":10,"verse":"And all the princes and all the people rejoiced and brought their tax and dropped it into the chest until they had finished. "},{"num":11,"verse":"And whenever the chest was brought to the king’s officers by the Levites, when they saw that there was much money in it, the king’s secretary and the officer of the chief priest would come and empty the chest and take it and return it to its place. Thus they did day after day, and collected money in abundance. "},{"num":12,"verse":"And the king and Jehoi′ada gave it to those who had charge of the work of the house of the Lord, and they hired masons and carpenters to restore the house of the Lord, and also workers in iron and bronze to repair the house of the Lord. "},{"num":13,"verse":"So those who were engaged in the work labored, and the repairing went forward in their hands, and they restored the house of God to its proper condition and strengthened it. "},{"num":14,"verse":"And when they had finished, they brought the rest of the money before the king and Jehoi′ada, and with it were made utensils for the house of the Lord, both for the service and for the burnt offerings, and dishes for incense, and vessels of gold and silver. And they offered burnt offerings in the house of the Lord continually all the days of Jehoi′ada."},{"header":"Apostasy of Joash"},{"num":15,"verse":"But Jehoi′ada grew old and full of days, and died; he was a hundred and thirty years old at his death. "},{"num":16,"verse":"And they buried him in the city of David among the kings, because he had done good in Israel, and toward God and his house."},{"num":17,"verse":"Now after the death of Jehoi′ada the princes of Judah came and did obeisance to the king; then the king harkened to them. "},{"num":18,"verse":"And they forsook the house of the Lord, the God of their fathers, and served the Ashe′rim and the idols. And wrath came upon Judah and Jerusalem for this their guilt. "},{"num":19,"verse":"Yet he sent prophets among them to bring them back to the Lord; these testified against them, but they would not give heed."},{"num":20,"verse":"Then the Spirit of God took possession of Zechari′ah the son of Jehoi′ada the priest; and he stood above the people, and said to them, “Thus says God, ‘Why do you transgress the commandments of the Lord, so that you cannot prosper? Because you have forsaken the Lord, he has forsaken you.’” "},{"num":21,"verse":"But they conspired against him, and by command of the king they stoned him with stones in the court of the house of the Lord. "},{"num":22,"verse":"Thus Jo′ash the king did not remember the kindness which Jehoi′ada, Zechari′ah’s father, had shown him, but killed his son. And when he was dying, he said, “May the Lord see and avenge!”"},{"header":"Death of Joash"},{"num":23,"verse":"At the end of the year the army of the Syrians came up against Jo′ash. They came to Judah and Jerusalem, and destroyed all the princes of the people from among the people, and sent all their spoil to the king of Damascus. "},{"num":24,"verse":"Though the army of the Syrians had come with few men, the Lord delivered into their hand a very great army, because they had forsaken the Lord, the God of their fathers. Thus they executed judgment on Jo′ash."},{"num":25,"verse":"When they had departed from him, leaving him severely wounded, his servants conspired against him because of the blood of the son of Jehoi′ada the priest, and slew him on his bed. So he died; and they buried him in the city of David, but they did not bury him in the tombs of the kings. "},{"num":26,"verse":"Those who conspired against him were Zabad the son of Shim′e-ath the Ammonitess, and Jeho′zabad the son of Shimrith the Moabitess. "},{"num":27,"verse":"Accounts of his sons, and of the many oracles against him, and of the rebuilding of the house of God are written in the Commentary on the Book of the Kings. And Amazi′ah his son reigned in his stead."}]