[{"num":16,"verse":"When David had gone a little past the summit, there was Tziva, the servant of M’fivoshet, who met him with a pair of donkeys saddled and on them 200 loaves of bread, 100 bunches of raisins, 100 pieces of summer fruit and a skin of wine. "},{"num":2,"verse":"The king said to Tziva, “What do you mean by these?” Tziva replied, “The donkeys are for the king’s household to ride on; the bread and summer fruit are for the young men to eat; and the wine is for those who collapse in the desert to drink.” "},{"num":3,"verse":"The king asked, “Where is your master’s [grand]son?” Tziva answered the king, “He’s staying in Yerushalayim, because he said, ‘Today the house of Isra’el will restore my father’s kingship to me.’” "},{"num":4,"verse":"The king said to Tziva, “Everything that belongs to M’fivoshet is now yours.” Tziva answered, “I bow down before you; may I find favor in your sight, my lord, king.”"},{"num":5,"verse":"When King David arrived at Bachurim, there came out from there a man from Sha’ul’s family named Shim‘i the son of Gera; and he came out pronouncing curses "},{"num":6,"verse":"and throwing stones at David and all King David’s servants; even though all the people, including his bodyguard, surrounded him right and left. "},{"num":7,"verse":"When Shim‘i cursed, he said, “Get out of here! Get out of here, you killer, you good-for-nothing! "},{"num":8,"verse":"Adonai has brought back on you all the blood of the house of Sha’ul. You usurped his kingship, but Adonai has handed over the kingdom to Avshalom your son. Now your own evil has overtaken you, because you are a man of blood!”"},{"num":9,"verse":"Avishai the son of Tz’ruyah said to the king, “Why allow this dead dog to curse my lord the king? Just let me go over and remove his head!” "},{"num":10,"verse":"The king said, “Do you sons of Tz’ruyah and I have anything in common? Let him curse. If Adonai tells him, ‘Curse David,’ who has the right to ask, ‘Why are you doing it?’” "},{"num":11,"verse":"David then said to Avishai and all his servants, “Look, my own son, who came from my own body, seeks my life. So how much more now this Binyamini! Let him alone; and let him curse, if Adonai told him to. "},{"num":12,"verse":"Maybe Adonai will notice how I’m treating him, and Adonai will reward me with good instead of his curses.” "},{"num":13,"verse":"So David and his men went on their way, while on the opposite hillside Shim‘i kept pace with him, cursing, throwing stones and flinging dust as he went. "},{"num":14,"verse":"The king and all the people with him arrived exhausted, so he rested there."},{"num":15,"verse":"Meanwhile Avshalom and all the people, the men of Isra’el, came to Yerushalayim; Achitofel was with him. "},{"num":16,"verse":"Hushai the Arki, David’s friend, came to Avshalom and said to him, “Long live the king! Long live the king!” "},{"num":17,"verse":"Avshalom asked Hushai, “Is this how you show kindness to your friend? Why didn’t you go with your friend?” "},{"num":18,"verse":"Hushai replied, “No, but whomever Adonai and this people and all the men of Isra’el choose, his I will be; and with him I will stay. "},{"num":19,"verse":"Moreover, whom should I serve? Shouldn’t I serve in the presence of his son? Just as I have served in your father’s presence, so will I be in your presence.”"},{"num":20,"verse":"Avshalom said to Achitofel, “Give your advice as to what we should do.” "},{"num":21,"verse":"Achitofel answered Avshalom, “Go in, and sleep with your father’s concubines, the ones he left to take care of the palace. All Isra’el will hear that your father utterly despises you, and this will strengthen the position of all those who are on your side.” "},{"num":22,"verse":"So they set up a tent for Avshalom on the roof of the palace; and Avshalom went in to sleep with his father’s concubines in the sight of all Isra’el. "},{"num":23,"verse":"In those days Achitofel’s advice was regarded as highly as if someone had sought out the word of God; it was this way with Achitofel’s advice both to David and to Avshalom."}]