[{"header":"Christ Is Our Helper"},{"num":2,"verse":"My dear children, I am writing this to you so you will not sin. But if anyone does sin, there is One Who will go between him and the Father. He is Jesus Christ, the One Who is right with God. "},{"num":2,"verse":"He paid for our sins with His own blood. He did not pay for ours only, but for the sins of the whole world."},{"num":3,"verse":"We can be sure that we know Him if we obey His teaching. "},{"num":4,"verse":"Anyone who says, “I know Him,” but does not obey His teaching is a liar. There is no truth in him. "},{"num":5,"verse":"But whoever obeys His Word has the love of God made perfect in him. This is the way to know if you belong to Christ. "},{"num":6,"verse":"The one who says he belongs to Christ should live the same kind of life Christ lived."},{"num":7,"verse":"Dear friends, I am not writing a new Law for you to obey. It is an old Law you have had from the beginning. The old Law is the Word that you have heard. "},{"num":8,"verse":"And yet it is a new Law that I am writing to you. It is truth. It was seen in Christ and it is seen in you also. The darkness is passing away and the true Light shines instead. "},{"num":9,"verse":"Whoever says he is in the light but hates his brother is still in darkness. "},{"num":10,"verse":"But whoever loves his brother is in the light. And there will be no reason to sin because of him. "},{"num":11,"verse":"Whoever hates his brother is not in the light but lives in darkness. He does not know where he is going because the darkness has blinded his eyes."},{"header":"Do Not Love the World"},{"num":12,"verse":"I am writing to you, my children, for your sins have been forgiven because of Christ’s name. "},{"num":13,"verse":"I am writing to you, fathers, because you know Him Who has been from the beginning. I am writing to you, young men, because you have power over the devil. I have written to you, young boys and girls, because you have learned to know the Father. "},{"num":14,"verse":"I have written to you, fathers, because you know Him Who has been from the beginning. I have written to you, young men, because you are strong. You have kept God’s Word in your hearts. You have power over the devil."},{"num":15,"verse":"Do not love the world or anything in the world. If anyone loves the world, the Father’s love is not in him. "},{"num":16,"verse":"For everything that is in the world does not come from the Father. The desires of our flesh and the things our eyes see and want and the pride of this life come from the world. "},{"num":17,"verse":"The world and all its desires will pass away. But the man who obeys God and does what He wants done will live forever."},{"num":18,"verse":"My children, we are near the end of the world. You have heard that the false-christ is coming. Many false-christs have already come. This is how we know the end of the world is near. "},{"num":19,"verse":"These left us. But they never belonged to us. If they had been a part of us, they would have stayed with us. Because they left, it is known they did not belong to us. "},{"num":20,"verse":"The Holy Spirit has been given to you and you all know the truth. "},{"num":21,"verse":"I have not written to you because you do not know the truth. I have written because you do know the truth and you know that no lie comes from the truth."},{"num":22,"verse":"Who is a liar? He is a person who says that Jesus is not the Christ. The false-christ will have nothing to do with the Father and the Son and he will turn away from Them. "},{"num":23,"verse":"A person who will have nothing to do with the Son and turns against Him does not have the Father. The one who says he knows the Son has the Father also."},{"num":24,"verse":"Keep in your heart what you have heard from the beginning. Then you will belong to the Son and to the Father if what you have heard from the beginning is in you. "},{"num":25,"verse":"And He has promised us life that lasts forever! "},{"num":26,"verse":"I have written to you about those who are trying to lead you in the wrong way. "},{"num":27,"verse":"Christ gave you the Holy Spirit and He lives in you. You do not need anyone to teach you. The Holy Spirit is able to teach you all things. What He teaches you is truth and not a lie. Live by the help of Christ as the Holy Spirit has taught you. "},{"num":28,"verse":"And now, my children, live by the help of Him. Then when He comes again, we will be glad to see Him and not be ashamed. "},{"num":29,"verse":"You know that Christ is right with God. Then you should know that everyone who is right with God is a child of His."}]