[{"num":2,"verse":"My little children, these things I write to you so that you do not sin. And if anyone sins, we have an Advocate with the Father: Jesus Christ, the Just."},{"num":2,"verse":"And He is the reconciliation for our sins; and not only for ours, but also for the whole world."},{"num":3,"verse":"And by this we are sure that we know Him:  if we keep His commandments."},{"num":4,"verse":"The one who says, “I know him,” and does not keep His commandments, is a liar. And the truth is not in him."},{"num":5,"verse":"But whoever keeps His word, in him is the love of God accomplished. By this we know that we are in Him."},{"num":6,"verse":"Whoever says that he remains in Him, ought still to walk as He has walked."},{"num":7,"verse":"Brothers, I write no new commandment to you, but an old commandment which you have had from the beginning. This old commandment is that word which you have heard from the beginning."},{"num":8,"verse":"Again, a new commandment I write to you (which is true in Him and also in you). For the darkness is passing, and the true Light now shines."},{"num":9,"verse":"Whoever says that he is in the Light, and hates his brother, is in darkness until now."},{"num":10,"verse":"Whoever loves his brother, abides in the Light. And there is no stumbling block in him."},{"num":11,"verse":"But whoever hates his brother, is in darkness, and walks in darkness, and does not know where he goes, because that darkness has blinded his eyes."},{"num":12,"verse":"Little children, I write to you because your sins are forgiven for His Name’s sake."},{"num":13,"verse":"I write to you, fathers, because you have known Him Who is from the beginning. I write to you, young men, because you have overcome the wicked one. I write to you, little children, because you have known the Father."},{"num":14,"verse":"I have written to you, fathers, because you have known Him Who is from the beginning. I have written to you, young men, because you are strong, and the word of God abides in you, and you have overcome the wicked one."},{"num":15,"verse":"Love neither this world nor the things which are in this world. If anyone loves this world, the love of the Father is not in him."},{"num":16,"verse":"For all that is in this world (the lust of the flesh, the lust of the eyes, and the pride of life), is not of the Father, but is of this world."},{"num":17,"verse":"And this world passes away, and the lust thereof. But whoever fulfills the will of God, abides forever."},{"num":18,"verse":"Little children, it is the last hour.  And just as you have heard that Antichrist shall come, so now there are many Antichrists (by which we know that it is the last hour)."},{"num":19,"verse":"They went out from us, but they were not of us. For if they had been of us, they would have continued with us. But this is so that all of whom are not of us are revealed."},{"num":20,"verse":"But you have an anointing from the Holy One and know all things."},{"num":21,"verse":"I have not written to you because you do not know the truth, but because you know it (and no lie comes from the truth)."},{"num":22,"verse":"Who is a liar, except the one who denies that Jesus is the Christ? This is Antichrist, who denies the Father and the Son."},{"num":23,"verse":"Whoever denies the Son, the same does not have the Father."},{"num":24,"verse":"Therefore, let that same which you have heard from the beginning remain in you. If that which you have heard from the beginning shall remain in you, you shall also continue in the Son and in the Father."},{"num":25,"verse":"And this is the promise that He has promised us: eternal life."},{"num":26,"verse":"These things I have written to you concerning those who deceive you."},{"num":27,"verse":"But that anointing which you received from Him dwells in you. And you do not need anyone to teach you. But as that same anointing teaches you of all things - and it is true, and not lying, and as it is taught to you - you shall abide in Him."},{"num":28,"verse":"And now, little children, abide in Him. So that when He shall appear, we may be bold; and not be ashamed before Him at his coming."},{"num":29,"verse":"If you know that He is righteous, you know that whoever does righteously is born of Him."}]