[{"header":"The Promise of the Lord's Coming"},{"num":3,"verse":"My dear friends, this is now the second letter I have written you. In both letters I have tried to arouse pure thoughts in your minds by reminding you of these things. "},{"num":2,"verse":"I want you to remember the words that were spoken long ago by the holy prophets, and the command from the Lord and Savior which was given you by your apostles. "},{"num":3,"verse":"First of all, you must understand that in the last days some people will appear whose lives are controlled by their own lusts. They will make fun of you "},{"num":4,"verse":"and will ask, “He promised to come, didn't he? Where is he? Our ancestors have already died, but everything is still the same as it was since the creation of the world!” "},{"num":5,"verse":"They purposely ignore the fact that long ago God gave a command, and the heavens and earth were created. The earth was formed out of water and by water, "},{"num":6,"verse":"and it was also by water, the water of the flood, that the old world was destroyed. "},{"num":7,"verse":"But the heavens and the earth that now exist are being preserved by the same command of God, in order to be destroyed by fire. They are being kept for the day when godless people will be judged and destroyed."},{"num":8,"verse":"But do not forget one thing, my dear friends! There is no difference in the Lord's sight between one day and a thousand years; to him the two are the same. "},{"num":9,"verse":"The Lord is not slow to do what he has promised, as some think. Instead, he is patient with you, because he does not want anyone to be destroyed, but wants all to turn away from their sins."},{"num":10,"verse":"But the Day of the Lord will come like a thief. On that Day the heavens will disappear with a shrill noise, the heavenly bodies will burn up and be destroyed, and the earth with everything in it will vanish. "},{"num":11,"verse":"Since all these things will be destroyed in this way, what kind of people should you be? Your lives should be holy and dedicated to God, "},{"num":12,"verse":"as you wait for the Day of God and do your best to make it come soon—the Day when the heavens will burn up and be destroyed, and the heavenly bodies will be melted by the heat. "},{"num":13,"verse":"But we wait for what God has promised: new heavens and a new earth, where righteousness will be at home."},{"num":14,"verse":"And so, my friends, as you wait for that Day, do your best to be pure and faultless in God's sight and to be at peace with him. "},{"num":15,"verse":"Look on our Lord's patience as the opportunity he is giving you to be saved, just as our dear friend Paul wrote to you, using the wisdom that God gave him. "},{"num":16,"verse":"This is what he says in all his letters when he writes on the subject. There are some difficult things in his letters which ignorant and unstable people explain falsely, as they do with other passages of the Scriptures. So they bring on their own destruction."},{"num":17,"verse":"But you, my friends, already know this. Be on your guard, then, so that you will not be led away by the errors of lawless people and fall from your safe position. "},{"num":18,"verse":"But continue to grow in the grace and knowledge of our Lord and Savior Jesus Christ. To him be the glory, now and forever! Amen."}]