[{"header":"Jesus Will Come Again"},{"num":3,"verse":"My friends, this is the second letter I have written to you. I wrote both letters to you to help your honest minds remember something. "},{"num":2,"verse":"I want you to remember the words that the holy prophets spoke in the past. And remember the command that our Lord and Savior gave us through your apostles. "},{"num":3,"verse":"It is important for you to understand what will happen in the last days. People will laugh at you. They will live doing the evil things they want to do. "},{"num":4,"verse":"They will say, “Jesus promised to come again. Where is he? Our fathers have died. But the world continues the way it has been since it was made.” "},{"num":5,"verse":"But they do not want to remember what happened long ago. God spoke and made heaven and earth. He made the earth from water and with water. "},{"num":6,"verse":"Then the world was flooded and destroyed with water. "},{"num":7,"verse":"And that same word of God is keeping heaven and earth that we have now. They are being kept to be destroyed by fire. They are being kept for the Judgment Day and the destruction of all who are against God."},{"num":8,"verse":"But do not forget this one thing, dear friends: To the Lord one day is like a thousand years, and a thousand years is like one day. "},{"num":9,"verse":"The Lord is not slow in doing what he promised—the way some people understand slowness. But God is being patient with you. He does not want anyone to be lost. He wants everyone to change his heart and life."},{"num":10,"verse":"But the day the Lord comes again will be a surprise, like a thief. The skies will disappear with a loud noise. Everything in the skies will be destroyed by fire. And the earth and everything in it will be exposed. "},{"num":11,"verse":"In that way everything will be destroyed. So what kind of people should you be? You should live holy lives and serve God. "},{"num":12,"verse":"You should wait for the day of God and look forward to its coming. When that day comes, the skies will be destroyed with fire, and everything in the skies will melt with heat. "},{"num":13,"verse":"But God made a promise to us. And we are waiting for what he promised—a new heaven and a new earth where goodness lives."},{"num":14,"verse":"Dear friends, we are waiting for this to happen. So try as hard as you can to be without sin and without fault. Try to be at peace with God. "},{"num":15,"verse":"Remember that we are saved because our Lord is patient. Our dear brother Paul told you the same thing when he wrote to you with the wisdom that God gave him. "},{"num":16,"verse":"Paul writes about this in all his letters. Sometimes there are things in Paul’s letters that are hard to understand. And some people explain these things falsely. They are ignorant and weak in faith. They also falsely explain the other Scriptures. But they are destroying themselves by doing that."},{"num":17,"verse":"Dear friends, you already know about this. So be careful. Do not let those evil people lead you away by the wrong they do. Be careful so that you will not fall from your own strong faith. "},{"num":18,"verse":"But grow in the grace and knowledge of our Lord and Savior Jesus Christ. Glory be to him now and forever! Amen."}]