[{"header":"The Promise of the Lord’s Coming"},{"num":3,"verse":"This is now the second letter that I have written to you, beloved, and in both of them I have aroused your sincere mind by way of reminder; "},{"num":2,"verse":"that you should remember the predictions of the holy prophets and the commandment of the Lord and Savior through your apostles. "},{"num":3,"verse":"First of all you must understand this, that scoffers will come in the last days with scoffing, following their own passions "},{"num":4,"verse":"and saying, “Where is the promise of his coming? For ever since the fathers fell asleep, all things have continued as they were from the beginning of creation.” "},{"num":5,"verse":"They deliberately ignore this fact, that by the word of God heavens existed long ago, and an earth formed out of water and by means of water, "},{"num":6,"verse":"through which the world that then existed was deluged with water and perished. "},{"num":7,"verse":"But by the same word the heavens and earth that now exist have been stored up for fire, being kept until the day of judgment and destruction of ungodly men."},{"num":8,"verse":"But do not ignore this one fact, beloved, that with the Lord one day is as a thousand years, and a thousand years as one day. "},{"num":9,"verse":"The Lord is not slow about his promise as some count slowness, but is forbearing toward you, not wishing that any should perish, but that all should reach repentance. "},{"num":10,"verse":"But the day of the Lord will come like a thief, and then the heavens will pass away with a loud noise, and the elements will be dissolved with fire, and the earth and the works that are upon it will be burned up."},{"num":11,"verse":"Since all these things are thus to be dissolved, what sort of persons ought you to be in lives of holiness and godliness, "},{"num":12,"verse":"waiting for and hastening the coming of the day of God, because of which the heavens will be kindled and dissolved, and the elements will melt with fire! "},{"num":13,"verse":"But according to his promise we wait for new heavens and a new earth in which righteousness dwells."},{"header":"Final Exhortation and Doxology"},{"num":14,"verse":"Therefore, beloved, since you wait for these, be zealous to be found by him without spot or blemish, and at peace. "},{"num":15,"verse":"And count the forbearance of our Lord as salvation. So also our beloved brother Paul wrote to you according to the wisdom given him, "},{"num":16,"verse":"speaking of this as he does in all his letters. There are some things in them hard to understand, which the ignorant and unstable twist to their own destruction, as they do the other scriptures. "},{"num":17,"verse":"You therefore, beloved, knowing this beforehand, beware lest you be carried away with the error of lawless men and lose your own stability. "},{"num":18,"verse":"But grow in the grace and knowledge of our Lord and Savior Jesus Christ. To him be the glory both now and to the day of eternity. Amen."}]