[{"num":1,"verse":"This is my second letter to you, dear brothers, and in both of them I have tried to remind you—if you will let me—about facts you already know: facts you learned from the holy prophets and from us apostles who brought you the words of our Lord and Savior."},{"num":3,"verse":"First, I want to remind you that in the last days there will come scoffers who will do every wrong they can think of and laugh at the truth. "},{"num":4,"verse":"This will be their line of argument: “So Jesus promised to come back, did he? Then where is he? He’ll never come! Why, as far back as anyone can remember, everything has remained exactly as it was since the first day of creation.”"},{"num":5,"verse":"They deliberately forget this fact: that God did destroy the world with a mighty flood long after he had made the heavens by the word of his command and had used the waters to form the earth and surround it. "},{"num":7,"verse":"And God has commanded that the earth and the heavens be stored away for a great bonfire at the judgment day, when all ungodly men will perish."},{"num":8,"verse":"But don’t forget this, dear friends, that a day or a thousand years from now is like tomorrow to the Lord. "},{"num":9,"verse":"He isn’t really being slow about his promised return, even though it sometimes seems that way. But he is waiting, for the good reason that he is not willing that any should perish, and he is giving more time for sinners to repent. "},{"num":10,"verse":"The day of the Lord is surely coming, as unexpectedly as a thief, and then the heavens will pass away with a terrible noise, and the heavenly bodies will disappear in fire, and the earth and everything on it will be burned up."},{"num":11,"verse":"And so since everything around us is going to melt away, what holy, godly lives we should be living! "},{"num":12,"verse":"You should look forward to that day and hurry it along—the day when God will set the heavens on fire, and the heavenly bodies will melt and disappear in flames. "},{"num":13,"verse":"But we are looking forward to God’s promise of new heavens and a new earth afterwards, where there will be only goodness."},{"num":14,"verse":"Dear friends, while you are waiting for these things to happen and for him to come, try hard to live without sinning; and be at peace with everyone so that he will be pleased with you when he returns."},{"num":15,"verse":"And remember why he is waiting. He is giving us time to get his message of salvation out to others. Our wise and beloved brother Paul has talked about these same things in many of his letters. Some of his comments are not easy to understand, and there are people who are deliberately stupid, and always demand some unusual interpretation—they have twisted his letters around to mean something quite different from what he meant, just as they do the other parts of the Scripture—and the result is disaster for them."},{"num":17,"verse":"I am warning you ahead of time, dear brothers, so that you can watch out and not be carried away by the mistakes of these wicked men, lest you yourselves become mixed up too. "},{"num":18,"verse":"But grow in spiritual strength and become better acquainted with our Lord and Savior Jesus Christ. To him be all glory and splendid honor, both now and forevermore. Good-bye."}]