[{"header":"The Day of the Lord Is Coming"},{"num":3,"verse":"Loved ones, this is now the second letter that I am writing to you. In both I am trying to stir you up by way of a reminder to wholesome thinking—"},{"num":2,"verse":"to remember the words previously proclaimed by the holy prophets and the commandment of our Lord and Savior through your emissaries."},{"num":3,"verse":" First of all, understand that in the last days, scoffers will come scoffing, following after their own desires"},{"num":4,"verse":" and saying, “Where is this promise of His coming? Ever since the fathers died, everything goes on just as it has from the beginning of creation.” "},{"num":5,"verse":"For in holding to this idea, it escapes their notice that the heavens existed long ago and the earth was formed out of water and through water by the word of God."},{"num":6,"verse":" Through these, the world of that time was destroyed by being flooded with water."},{"num":7,"verse":" But by the same word the present heavens and earth are being reserved for fire—kept until the Day of Judgment and the destruction of ungodly people."},{"num":8,"verse":"But don’t forget this one thing, loved ones, that with the Lord one day is like a thousand years, and a thousand years are like one day."},{"num":9,"verse":" The Lord is not slow in keeping His promise, as some consider slowness. Rather, He is being patient toward you—not wanting anyone to perish, but for all to come to repentance."},{"num":10,"verse":"But the day of the Lord will come like a thief. On that day the heavens will pass away with a roar, and the elements will melt and disintegrate, and the earth and everything done on it shall be exposed. "},{"num":11,"verse":"Since all these things are to be destroyed in this way, what kind of people should you be? Live your lives in holiness and godliness, "},{"num":12,"verse":"looking for and hastening the coming of the day of God. In that day the heavens will be dissolved by fire, and the elements will melt in the intense heat."},{"num":13,"verse":" But in keeping with His promise, we look for new heavens and a new earth, where righteousness dwells."},{"header":"Final Advice"},{"num":14,"verse":"Therefore, loved ones, while you are looking for these things, make every effort to be found in shalom, spotless and blameless before Him. "},{"num":15,"verse":"Bear in mind that the patience of our Lord means salvation—just as our dearly loved brother Paul also wrote to you with the wisdom given to him. "},{"num":16,"verse":"He speaks about these matters in all of his letters. Some things in them are hard to understand, which the ignorant and unstable twist (as they also do with the rest of the Scriptures)—to their own destruction."},{"num":17,"verse":"Since you already know all this, loved ones, be on your guard so that you are not led astray by the error of the lawless and lose your sure footing. "},{"num":18,"verse":"Instead, keep growing in the grace and knowledge of our Lord and Savior Yeshua the Messiah. To Him be the glory both now and to the day of eternity! Amen."}]