[{"num":1,"verse":"God spoke to Moses, saying, “Set apart every firstborn to me—the first one to come from the womb among the Israelites, whether person or animal, is mine.”"},{"num":3,"verse":"Moses said to the people, “Always remember this day. This is the day when you came out of Egypt from a house of slavery. God brought you out of here with a powerful hand. Don’t eat any raised bread."},{"num":4,"verse":"“You are leaving in the spring month of Abib. When God brings you into the land of the Canaanite, the Hittite, the Amorite, the Hivite, and the Jebusite, which he promised to your fathers to give you, a land lavish with milk and honey, you are to observe this service during this month:"},{"num":6,"verse":"“You are to eat unraised bread for seven days; on the seventh day there is a festival celebration to God."},{"num":7,"verse":"“Only unraised bread is to be eaten for seven days. There is not to be a trace of anything fermented—no yeast anywhere."},{"num":8,"verse":"“Tell your child on that day: ‘This is because of what God did for me when I came out of Egypt.’"},{"num":9,"verse":"“The day of observance will be like a sign on your hand, a memorial between your eyes, and the teaching of God in your mouth. It was with a powerful hand that God brought you out of Egypt. Follow these instructions at the set time, year after year after year."},{"num":11,"verse":"“When God brings you into the land of the Canaanites, as he promised you and your fathers, and turns it over to you, you are to set aside the first birth out of every womb to God. Every first birth from your livestock belongs to God. You can redeem every first birth of a donkey if you want to by substituting a lamb; if you decide not to redeem it, you must break its neck."},{"num":13,"verse":"“Redeem every firstborn child among your sons. When the time comes and your son asks you, ‘What does this mean?’ you tell him, ‘God brought us out of Egypt, out of a house of slavery, with a powerful hand. When Pharaoh stubbornly refused to let us go, God killed every firstborn in Egypt, the firstborn of both humans and animals. That’s why I make a sacrifice for every first male birth from the womb to God and redeem every firstborn son.’ The observance functions like a sign on your hands or a symbol on the middle of your forehead: God brought us out of Egypt with a powerful hand.”"},{"num":17,"verse":"It so happened that after Pharaoh released the people, God didn’t lead them by the road through the land of the Philistines, which was the shortest route, for God thought, “If the people encounter war, they’ll change their minds and go back to Egypt.”"},{"num":18,"verse":"So God led the people on the wilderness road, looping around to the Red Sea. The Israelites left Egypt in military formation."},{"num":19,"verse":"Moses took the bones of Joseph with him, for Joseph had made the Israelites solemnly swear to do it, saying, “God will surely hold you accountable, so make sure you bring my bones from here with you.”"},{"num":20,"verse":"They moved on from Succoth and then camped at Etham at the edge of the wilderness. God went ahead of them in a Pillar of Cloud during the day to guide them on the way, and at night in a Pillar of Fire to give them light; thus they could travel both day and night. The Pillar of Cloud by day and the Pillar of Fire by night never left the people."}]