[{"header":"A Prayer for the King"},{"num":72,"verse":"O God, make the king right in what he decides. Make the king’s son right with You. "},{"num":2,"verse":"May he be right when he decides who is right and who is wrong and may he be fair to the poor. "},{"num":3,"verse":"Let mountains and hills bring peace to the people through what is right and good. "},{"num":4,"verse":"May he stand by those who are poor, save the children of those in need, and destroy the bad power over them."},{"num":5,"verse":"May all the children-to-come fear You as long as the sun and the moon last. "},{"num":6,"verse":"May He come down like rain upon the cut grass, like rain that waters the earth. "},{"num":7,"verse":"In His days may all go well with those who are right and good. And may there be much peace until the moon is no more."},{"num":8,"verse":"May he also rule from sea to sea, and from the river to the ends of the earth. "},{"num":9,"verse":"Those who live in the desert will put their faces to the ground before Him. And those who hate Him will kiss the dust. "},{"num":10,"verse":"Let the kings of Tarshish and of the islands bring gifts. Let the kings of Sheba and Seba bring gifts. "},{"num":11,"verse":"Yes, let all kings fall down at His feet, and all nations serve Him."},{"num":12,"verse":"For He will take out of trouble the one in need when he cries for help, and the poor man who has no one to help. "},{"num":13,"verse":"He will have loving-pity on the weak and those in need. He will save the lives of those in need. "},{"num":14,"verse":"He will take them from the bad power that is held over them and from being hurt. Their blood will be of much worth in His eyes. "},{"num":15,"verse":"He will live, and the gold of Sheba will be given to Him. Prayer will be given for Him all the time. Let them honor Him all day long."},{"num":16,"verse":"May there be much grain in the land on top of the mountains. May its fruit grow like the trees of Lebanon. And may those of the city grow like the grass of the earth. "},{"num":17,"verse":"May His name last forever. May His name become bigger as long as the sun shines. And let men respect themselves through Him. Let all nations honor Him."},{"num":18,"verse":"Honor and thanks be to the Lord God, the God of Israel, Who alone does great things. "},{"num":19,"verse":"And honor be to His great name forever. May the whole earth be filled with His shining-greatness. Let it be so."},{"num":20,"verse":"The prayers of David, the son of Jesse, are ended."}]