[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(3) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Rod.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The imagery of this unusually long verse is peculiar. The “rod of the wicked,” or “of wickedness,” is the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "heathen sceptre, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and the righteous are the Israelites who hold fast to the religion of their fathers. This sceptre now rests—a word expressing the presence of tyranny—upon the Holy Land; but this is not for a continuance. God will not suffer the tyranny to last, lest the righteous should be seduced or forced into connivance with practices which religion unites with patriotism to condemn.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 125:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 125:3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For the rod of the wicked — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Their power and authority; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall not rest — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Not continue long; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "upon the lot of the righteous — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Upon the habitation and persons of good men. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Lest the righteous put forth their hands, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — Lest, through human infirmity, and the great weight or long continuance of their troubles, they should be driven to impatience, or to despair, or to use indirect and sinful courses to relieve themselves. We learn from this that God considers the frail frame of his people, and proportions their trials to their strength, by the care of his providence, as well as their strength to their trials, by the power of his grace. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Oppression",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "may make a wise man mad, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "especially if it continue long, therefore, for ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the elect’s sake the days shall be shortened, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "that, whatever becomes of their lot in this world, they may not fall short of their inheritance in the next.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "125:1-3 All those minds shall be truly stayed, that are stayed on God. They shall be as Mount Zion, firm as it is; a mountain supported by providence, much more as a holy mountain supported by promise. They cannot be removed from confidence in God. They abide for ever in that grace which is the earnest of their everlasting continuance in glory. Committing themselves to God, they shall be safe from their enemies. Even mountains may moulder and come to nothing, and rocks be removed, but God's covenant with his people cannot be broken, nor his care of them cease. Their troubles shall last no longer than their strength will bear them up under them. The rod of the wicked may come, may fall upon the righteous, upon their persons, their estates, their liberties, their families names, on any thing that falls to their lot; only it cannot reach their souls. And though it may come upon their lot, it shall not rest thereon. The Lord will make all work together for their good. The wicked shall only prove a correcting rod, not a destroying sword; even this rod shall not remain upon them, lest they distrust the promise, thinking God has cast them off.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "For the rod of the wicked - Margin, as in Hebrew, \"wickedness.\" The word \"rod\" - the staff, the scepter, the instrument of inflicting punishment - here means dominion, power, that condition in which the wicked are commonly found, as one of prosperity or power. God will not deal with the righteous as the wicked are often dealt with: that is, God will not give his people prosperity as he does them. The righteous will be afflicted, and will be placed in circumstances to keep them from putting forth their hands to iniquity; that is, from indulging in iniquity. They will be afflicted; they will be kept in the ways of virtue and religion by trial; they will not be left to act out the depravity of the heart as the wicked are.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Shall not rest upon - Permanently abide; or, be the constant condition of the righteous. They may be prospered, but they must expect that there will be changes, and that God will so deal with them as to keep them from putting forth their hands to iniquity.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The lot of the righteous - The righteous, considered as the \"lot\" or portion of the Lord. The language is derived from dividing a land by lot (compare Psalm 105:11; Psalm 74:2); and the idea is, that the \"lot\" pertaining to the Lord, or his \"portion\" among people, is the righteous.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The lot of the righteous - The righteous, considered as the \"lot\" or portion of the Lord. The language is derived from dividing a land by lot (compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 105:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 74:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); and the idea is, that the \"lot\" pertaining to the Lord, or his \"portion\" among people, is the righteous.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Lest the righteous put forth their hands unto iniquity - Lest the effect of prosperity should be to lead them away from God - like the wicked. Hence, they are dealt with in a different manner. They are afflicted; they are thus kept under proper discipline, and their hearts and lives are made what they should be. The statement in this verse, therefore, accords with the uniform statements in the Scriptures, that prosperity is dangerous to the spiritual interests of people, and that, therefore, people are often afflicted in order that they may be led to seek higher interests than those which pertain to this life. The connection here seems to be, that God will defend his people, even as Jerusalem was defended by hills and mountains; but that the real welfare and prosperity of his people was not what the wicked seek - wealth and honor - but the favor of the Lord. Another meaning may, however, be suggested in regard to this verse, which to some may appear more probable than the one above. It is this: that the \"rod\" - the dominion of the wicked - of bad rulers - of a harsh and oppressive government - will not always be upon the people of God, lest, being crushed, they should be led to acts of iniquity; or lest, being kept from the free service of God, they should abandon themselves to sin. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Lest the righteous put forth their hands unto iniquity - Lest the effect of prosperity should be to lead them away from God - like the wicked. Hence, they are dealt with in a different manner. They are afflicted; they are thus kept under proper discipline, and their hearts and lives are made what they should be. The statement in this verse, therefore, accords with the uniform statements in the Scriptures, that prosperity is dangerous to the spiritual interests of people, and that, therefore, people are often afflicted in order that they may be led to seek higher interests than those which pertain to this life. The connection here seems to be, that God will defend his people, even as Jerusalem was defended by hills and mountains; but that the real welfare and prosperity of his people was not what the wicked seek - wealth and honor - but the favor of the Lord. Another meaning may, however, be suggested in regard to this verse, which to some may appear more probable than the one above. It is this: that the \"rod\" - the dominion of the wicked - of bad rulers - of a harsh and oppressive government - will not always be upon the people of God, lest, being crushed, they should be led to acts of iniquity; or lest, being kept from the free service of God, they should abandon themselves to sin. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3. Though God may leave them for a time under the \"rod,\" or power (Ps 2:9), and oppression of the wicked for a time, as a chastisement, He will not suffer them to be tempted so as to fall into sin (1Co 10:13). The wicked shall only prove a correcting rod to them, not a destroying sword; even this rod shall not remain (\"rest\") on them, lest they be tempted to despair and apostasy (Ps 73:13, 14). God may even try His people to the uttermost: when nothing is before our eyes but pure despair, then He delivers us and gives life in death, and makes us blessed in the curse (2Co 1:8, 9) [Luther].",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the lot—the possession, literally, \"Canaan,\" spiritually, the heavenly inheritance of holiness and bliss which is appointed to the righteous. Sin's dominion shall not permanently come between the believer and his inheritance.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The rod of the wicked; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the power and authority of cruel tyrants. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Shall not rest; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " not continue for ever, nor too long. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Upon the lot of the righteous; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " upon the habitations and persons of good men. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Lest the righteous put forth their hands unto iniquity; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " lest through human frailty and the great weight or long continuance of their troubles they should be driven to impatience, or to despair, or to use indirect and sinful courses to relieve themselves. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "For the rod of the wicked shall not rest upon the lot of the righteous,.... Which, according to Kimchi, is Jerusalem; but Aben Ezra interprets it of the Israelites that inherit the land. And, the people of God are no doubt designed; the Lord's justified and chosen ones, his portion, and the lot of his inheritance; and all that belong unto them, their persons, families, estates, and good name: in all which they are sometimes oppressed and afflicted by wicked men; who are a rod of correction in the hand of the Lord, the rod of men with which he chastises them; but this shall not always continue: so the word is used for a rod of correction, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 22:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It sometimes signifies a sceptre; an ensign of power and government, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 49:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and here may intend the nations of the world, as Aben Ezra interprets it; or the antichristian states, prevailing and ruling over the people of God in a tyrannical manner, which shall not always last; the reign of antichrist will come to an end, and the Lord will destroy him with the rod of his mouth. It sometimes signifies a tribe; and the Syriac version seems so to take it here, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"the tribe of the wicked shall not rest in the part of the righteous;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "they shall no more dwell among them, lest, being led by their example, they should learn their works, and do as they do; so Aben Ezra and Kimchi. But rather, with Gussetius (o), this is to be understood of a measuring rod; laid not on persons, but on lands and estates; and best agrees with the lot, inheritance, and estate of the righteous; and may signify, that though wicked men unjustly seize upon and retain the farms, possessions, and estates of good men, as if they were assigned to them by the measuring line; yet should not hold them long, or always; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "lest the righteous put forth their hands unto iniquity; for the righteous are not perfect in this life: they are not without sin, nor do they live without the commission of it; and may be under temptation, by long afflictions and oppressions, and seeing the wicked prosper, to desert their profession of religion, and forsake the ways of God, and join with the wicked, and commit iniquity as they do; and therefore, to prevent this, the Lord will not suffer them always to be under affliction and oppression; see Psalm 37:8, or them and theirs to be always in the hand of the enemy. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "lest the righteous put forth their hands unto iniquity; for the righteous are not perfect in this life: they are not without sin, nor do they live without the commission of it; and may be under temptation, by long afflictions and oppressions, and seeing the wicked prosper, to desert their profession of religion, and forsake the ways of God, and join with the wicked, and commit iniquity as they do; and therefore, to prevent this, the Lord will not suffer them always to be under affliction and oppression; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 37:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", or them and theirs to be always in the hand of the enemy. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(o) Ebr. Comment. p. 818. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(o) Ebr. Comment. p. 818. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "For the {b} rod of the wicked shall not rest upon the lot of the righteous; lest the righteous put forth their hands unto iniquity.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "For the ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{b}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " rod of the wicked shall not rest upon the lot of the righteous; lest the righteous put forth their hands unto iniquity.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) Though God permits his to be under the cross lest they embrace wickedness, yet this cross will not so rest on them, that it should drive them from hope.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " &c.] We might rather have expected an inference from ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Psalm 125:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 125:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Therefore",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": but the connexion of thought is that the confidence of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Psalm 125:1-2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 125:1-2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " is justified, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the sceptre of wickedness ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall not rest upon the lot of the righteous",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Israel will not always be unjustly oppressed. The sceptre is the symbol of rule (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 14:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The lot of the righteous",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is the land of promise, so called with allusion to its division by lot (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 18:10-11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Israel is called ‘righteous’ in contrast to the heathen, in virtue of its calling (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Habakkuk 1:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 26:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The ‘sceptre of wickedness’ does not refer simply to the fact that Israel was subject to Persian rule, but to the injuries done them by the Samaritans and others with the sanction of the Persian power, resulting in the disastrous condition of things which Nehemiah had found on his arrival. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezra 4:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The A.V. and P.B.V. follow the LXX in rendering ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the wicked",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but the Heb. text reads ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "wickedness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The difference is one of vowel points only.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "lest the righteous",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " &c.] Prolonged oppression might tempt Israelites in despair to deny their allegiance to Jehovah and their duty to their country, and make common cause with the enemies of their religion and nation. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 37:7-8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 73:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 3.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "For the rod of the wicked",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "the scepter of wickedness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Shall not rest upon the lot of the righteous",
        "children": [
          {
            "element": "span",
            "class": "cmt_word",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Shall not rest upon the lot of the righteous",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". The possession, or inheritance, of the righteous, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "e",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". the land in which they dwell. This may fall for a time under the dominion of the wicked, but shall not \"rest\" - ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "e",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". continue - under such dominion. Lest the righteous put forth their hands unto iniquity; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "e",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". lest their patience be worn out, and they fall from grace. God will not try men beyond that they are able (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 10:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Psalm 125:3",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The pressure of the worldly power, which now lies heavily upon the holy land, will not last for ever; the duration of the calamity is exactly proportioned to the power of resistance of the righteous, whom God proves and purifies by calamity, but not without at the same time graciously preserving them. \"The rod of wickedness\" is the heathen sceptre, and \"the righteous\" are the Israelites who hold fast to the religion of their fathers. The holy land, whose sole entitled inheritors are these righteous, is called their \"lot\" (גורל, κλῆρος  equals  κληρονομία). נוּח signifies to alight or settle down anywhere, and having alighted, to lean upon or rest (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 11:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 1:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ἔμεινεν). The lxx renders οὐκ ἀφφήσει, i.e., לא ינּיח (cf. on the other hand יניח, He shall let down, cause to come down, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 30:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Not for a continuance shall the sceptre of heathen tyranny rest upon the holy land, God will not suffer that: in order that the righteous may not at length, by virtue of the power which pressure and use exercises over men, also participate in the prevailing ungodly doings. שׁלח with Beth: to seize upon anything wrongfully, or even only (as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 28:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") to lay one's hand upon anything (frequently with על). As here in the case of עולתה, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 80:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " too the form that is the same as the locative is combined with a preposition. ",
        "children": []
      }
    ]
  }
]