[{"num":11,"verse":"(S: vii) The whole earth used the same language, the same words. "},{"num":2,"verse":"It came about that as they traveled from the east, they found a plain in the land of Shin‘ar and lived there. "},{"num":3,"verse":"They said to one another, “Come, let’s make bricks and bake them in the fire.” So they had bricks for building-stone and clay for mortar. "},{"num":4,"verse":"Then they said, “Come, let’s build ourselves a city with a tower that has its top reaching up into heaven, so that we can make a name for ourselves and not be scattered all over the earth.”"},{"num":5,"verse":"Adonai came down to see the city and the tower the people were building. "},{"num":6,"verse":"Adonai said, “Look, the people are united, they all have a single language, and see what they’re starting to do! At this rate, nothing they set out to accomplish will be impossible for them! "},{"num":7,"verse":"Come, let’s go down and confuse their language, so that they won’t understand each other’s speech.” "},{"num":8,"verse":"So from there Adonai scattered them all over the earth, and they stopped building the city. "},{"num":9,"verse":"For this reason it is called Bavel [confusion] — because there Adonai confused the language of the whole earth, and from there Adonai scattered them all over the earth."},{"num":10,"verse":"Here is the genealogy of Shem. Shem was 100 years old when he fathered Arpakhshad two years after the flood. "},{"num":11,"verse":"After Arpakhshad was born, Shem lived another 500 years and had sons and daughters."},{"num":12,"verse":"Arpakhshad lived thirty-five years and fathered Shelach. "},{"num":13,"verse":"After Shelach was born, Arpakhshad lived another 403 years and had sons and daughters."},{"num":14,"verse":"Shelach lived thirty years and fathered ‘Ever. "},{"num":15,"verse":"After ‘Ever was born, Shelach lived another 403 years and had sons and daughters."},{"num":16,"verse":"‘Ever lived thirty-four years and fathered Peleg. "},{"num":17,"verse":"After Peleg was born, ‘Ever lived another 430 years and had sons and daughters."},{"num":18,"verse":"Peleg lived thirty years and fathered Re‘u. "},{"num":19,"verse":"After Re‘u was born, Peleg lived another 209 years and had sons and daughters."},{"num":20,"verse":"Re‘u lived thirty-two years and fathered S’rug. "},{"num":21,"verse":"After S’rug was born, Re‘u lived another 207 years and had sons and daughters."},{"num":22,"verse":"S’rug lived thirty years and fathered Nachor. "},{"num":23,"verse":"After Nachor was born, S’rug lived another 200 years and had sons and daughters."},{"num":24,"verse":"Nachor lived twenty-nine years and fathered Terach. "},{"num":25,"verse":"After Terach was born, Nachor lived another 119 years and had sons and daughters."},{"num":26,"verse":"Terach lived seventy years and fathered Avram, Nachor and Haran. "},{"num":27,"verse":"Here is the genealogy of Terach. Terach fathered Avram, Nachor and Haran; and Haran fathered Lot. "},{"num":28,"verse":"Haran died before his father Terach in the land where he was born, in Ur of the Kasdim."},{"num":29,"verse":"(Maftir) Then Avram and Nachor took wives for themselves. The name of Avram’s wife was Sarai, and the name of Nachor’s wife was Milkah the daughter of Haran. He was the father of Milkah and of Yiskah. "},{"num":30,"verse":"Sarai was barren — she had no child. "},{"num":31,"verse":"Terach took his son Avram, his son Haran’s son Lot, and Sarai his daughter-in-law, his son Avram’s wife; and they left Ur of the Kasdim to go to the land of Kena‘an. But when they came to Haran, they stayed there. "},{"num":32,"verse":"Terach lived 205 years, and he died in Haran."}]