[{"num":11,"verse":"And the kol HaAretz was of one language and of devarim achadim (common words)."},{"num":2,"verse":"And it came to pass, as they migrated from the east, that they found a plain in Eretz Shinar; and they dwelt there."},{"num":3,"verse":"And they said one to another, Come, let us make brick, and bake them thoroughly. And they had brick for even (stone), and bitumen had they for mortar."},{"num":4,"verse":"And they said, Come, let us build us an Ir and a Migdal, whose rosh (top) may reach unto Shomayim; and let us make us a shem, otherwise we shall be scattered abroad upon the face of kol HaAretz."},{"num":5,"verse":"And Hashem came down to see the Ir and the Migdal, which Bnei HaAdam built."},{"num":6,"verse":"And Hashem said, See, the Am is echad and they have all one language; and this they begin to do; and now nothing will be impossible for them, which they have proposed to do."},{"num":7,"verse":"Come, let Us go down, and there confuse their sefat, that they may not understand one another’s language."},{"num":8,"verse":"So Hashem scattered them abroad from there upon the face of kol Ha’Aretz; and they left off building the Ir."},{"num":9,"verse":"Therefore is the shem of it called Babel; because Hashem did there confuse the language of kol Ha’Aretz; and from there did Hashem scatter them abroad upon the face of kol Ha’Aretz."},{"num":10,"verse":"These are the toldot of Shem: Shem was a hundred years old, and fathered Arpachshad two years after the mabbul;"},{"num":11,"verse":"And Shem lived after he fathered Arpachshad five hundred shanah, and fathered banim and banot."},{"num":12,"verse":"And Arpachshad lived five and thirty shanah, and fathered Salah;"},{"num":13,"verse":"And Arpachshad lived after he fathered Shelach four hundred and three shanim, and fathered banim and banot."},{"num":14,"verse":"And Shelach lived thirty shanah, and fathered Ever;"},{"num":15,"verse":"And Shelach lived after he fathered Ever four hundred and three shanah, and fathered banim and banot."},{"num":16,"verse":"And Ever lived four and thirty shanah, and fathered Peleg;"},{"num":17,"verse":"And Ever lived after he fathered Peleg four hundred and thirty shanah, and fathered banim and banot."},{"num":18,"verse":"And Peleg lived thirty shanah, and fathered Reu;"},{"num":19,"verse":"And Peleg lived after he fathered Reu two hundred and nine shanim, and fathered banim and banot."},{"num":20,"verse":"And Reu lived two and thirty shanah, and fathered Serug;"},{"num":21,"verse":"And Reu lived after he fathered Serug two hundred and seven shanim, and fathered banim and banot."},{"num":22,"verse":"And Serug lived thirty shanah, and fathered Nachor;"},{"num":23,"verse":"And Serug lived after he fathered Nachor two hundred shanah, and fathered banim and banot."},{"num":24,"verse":"And Nachor lived nine and twenty shanah, and fathered Terach;"},{"num":25,"verse":"And Nachor lived after he fathered Terach a hundred and nineteen shanah, and fathered banim and banot."},{"num":26,"verse":"And Terach lived seventy shanah, and fathered Avram, Nachor, and Haran."},{"num":27,"verse":"Now these are the toldot Terach: Terach fathered Avram, Nachor, and Haran; and Haran fathered Lot."},{"num":28,"verse":"And Haran died before his av Terach in the land of his birth, in Ur Kasdim."},{"num":29,"verse":"And Avram and Nachor took them nashim: the shem eshet Avram was Sarai; and the shem eshet Nachor was Milcah, the bat Haran Avi Milcah, and Avi Yiskah."},{"num":30,"verse":"But Sarai was barren; she had no child."},{"num":31,"verse":"And Terach took Avram bno, and ben bno Lot ben Haran, and Sarai his kallah, eshet Avram bno; and they went forth with them from Ur Kasdim, to go into Eretz Kena’an; and they came unto Charan (Haran), and dwelt there."},{"num":32,"verse":"And the days of Terach were two hundred and five shanim; and Terach died in Charan (Haran)."}]