[{"num":3,"verse":"Are we beginning to be like those false teachers of yours who must tell you all about themselves and bring long letters of recommendation with them? I think you hardly need someone’s letter to tell you about us, do you? And we don’t need a recommendation from you, either! "},{"num":2,"verse":"The only letter I need is you yourselves! By looking at the good change in your hearts, everyone can see that we have done a good work among you. "},{"num":3,"verse":"They can see that you are a letter from Christ, written by us. It is not a letter written with pen and ink, but by the Spirit of the living God; not one carved on stone, but in human hearts."},{"num":4,"verse":"We dare to say these good things about ourselves only because of our great trust in God through Christ, that he will help us to be true to what we say, "},{"num":5,"verse":"and not because we think we can do anything of lasting value by ourselves. Our only power and success comes from God. "},{"num":6,"verse":"He is the one who has helped us tell others about his new agreement to save them. We do not tell them that they must obey every law of God or die; but we tell them there is life for them from the Holy Spirit. The old way, trying to be saved by keeping the Ten Commandments, ends in death; in the new way, the Holy Spirit gives them life."},{"num":7,"verse":"Yet that old system of law that led to death began with such glory that people could not bear to look at Moses’ face. For as he gave them God’s law to obey, his face shone out with the very glory of God—though the brightness was already fading away. "},{"num":8,"verse":"Shall we not expect far greater glory in these days when the Holy Spirit is giving life? "},{"num":9,"verse":"If the plan that leads to doom was glorious, much more glorious is the plan that makes men right with God. "},{"num":10,"verse":"In fact, that first glory as it shone from Moses’ face is worth nothing at all in comparison with the overwhelming glory of the new agreement. "},{"num":11,"verse":"So if the old system that faded into nothing was full of heavenly glory, the glory of God’s new plan for our salvation is certainly far greater, for it is eternal."},{"num":12,"verse":"Since we know that this new glory will never go away, we can preach with great boldness, "},{"num":13,"verse":"and not as Moses did, who put a veil over his face so that the Israelis could not see the glory fade away."},{"num":14,"verse":"Not only Moses’ face was veiled, but his people’s minds and understanding were veiled and blinded too. Even now when the Scripture is read it seems as though Jewish hearts and minds are covered by a thick veil, because they cannot see and understand the real meaning of the Scriptures. For this veil of misunderstanding can be removed only by believing in Christ. "},{"num":15,"verse":"Yes, even today when they read Moses’ writings their hearts are blind and they think that obeying the Ten Commandments is the way to be saved."},{"num":16,"verse":"But whenever anyone turns to the Lord from his sins, then the veil is taken away. "},{"num":17,"verse":"The Lord is the Spirit who gives them life, and where he is there is freedom from trying to be saved by keeping the laws of God. "},{"num":18,"verse":"But we Christians have no veil over our faces; we can be mirrors that brightly reflect the glory of the Lord. And as the Spirit of the Lord works within us, we become more and more like him."}]