[{"header":"[VEZOS HABERACHAH]"},{"num":33,"verse":"And this is the brocha, wherewith Moshe the Ish HaElohim blessed the Bnei Yisroel before moto (his death)."},{"num":2,"verse":"And he said, Hashem came from Sinai, and rose up from Seir unto them; He shined forth from Mt Paran, and He came with ten thousands of kodesh; from His right hand went a fiery law for them."},{"num":3,"verse":"Yea, He loved the amim; kol kedoshav (all His holy ones) are in Thy hand: and they sat down at Thy feet; every one shall receive of Thy devarot."},{"num":4,"verse":"Moshe charged us with a torah, even the morashah kehillat Ya’akov (heritage of the Congregation of Ya’akov)."},{"num":5,"verse":"And He was Melech in Yeshurun, when the Rashei Am and the Shivtei Yisroel were gathered together."},{"num":6,"verse":"Let Reuven live, and not die; and let not his men be few."},{"num":7,"verse":"And this to Yehudah: and he said, Shema, Hashem, the voice of Yehudah, and bring him unto his people; let his hands contend for him; and be Thou an ezer (help) to him from his enemies."},{"num":8,"verse":"And of Levi he said, Let Thy Tummim and Thy Urim be with Thy chasid, whom Thou didst prove at Massah, and with whom Thou didst strive at the waters of Merivah;"},{"num":9,"verse":"Who said unto his av and to his em, I have not seen him; neither did he acknowledge his brethren, nor knew his own banim; for they [Levi’im] have been shomer over Thy word, and Thy Brit they have preserved."},{"num":10,"verse":"They shall teach Ya’akov Thy mishpatim, and Yisroel Thy torah; they shall put ketorah before Thee, and kalil (whole burnt offerings) upon Thine mizbe’ach."},{"num":11,"verse":"Bless, O Hashem, his resources, and accept the work of his hands; strike through the loins of them that rise against him, and of them that hate him, that they rise not again."},{"num":12,"verse":"And of Binyamin he said, Yedid Hashem shall dwell in safety by Him; and Hashem shall hover over him all day long, and he (Yedid Hashem, beloved of Hashem) shall rest between His shoulders."},{"num":13,"verse":"And of Yosef he said, Mevorekhet Hashem (Blessed of Hashem) be his land, for the precious things of Shomayim, for the tal, and for the tehom (deep waters) that coucheth below,"},{"num":14,"verse":"With the choice fruits brought forth by the shemesh, and choice crops put forth by the yarei’ach,"},{"num":15,"verse":"And with the choicest of the harrei kedem (eternal mountains), and for the precious things of the everlasting hills,"},{"num":16,"verse":"And for the precious things of ha’aretz and fulness thereof, and for the good will of Him whose [shechinah] dwelling is in the [burning] bush; let the blessing come upon the head of Yosef, and upon the top of the head of him that was separated from his brethren."},{"num":17,"verse":"His glory is like the bechor of his shor, and his horns are like the horns of a wild ox; with them he shall push the people together to the ends of ha’aretz; and they are the ten thousands of Ephrayim, and they are the thousands of Menasheh."},{"num":18,"verse":"And of Zevulun he said, Rejoice, Zevulun, in thy going out; and, Yissakhar, in thy oholim."},{"num":19,"verse":"They shall call the people unto the mountain; there they shall offer zivkhei tzedek; for they shall draw out of the abundance of the seas, and of treasures hid in the sand."},{"num":20,"verse":"And of Gad he said, Baruch be he that enlargeth Gad; he dwelleth as a lion, and teareth the zero’a as well as the crown of the head."},{"num":21,"verse":"And he provided the reshit for himself, when the chelkat mechokek (lawgiver’s chelek) was assigned. When the Rashei Am came, he executed the Tzidkat Hashem, and His mishpatim with Yisroel."},{"num":22,"verse":"And of Dan he said, Dan is a gur aryeh (lion’s whelp); he shall leap from Bashan."},{"num":23,"verse":"And of Naphtali he said, O Naphtali, satisfied with ratzon, and full with the Birkat Hashem; possess thou the west and the south."},{"num":24,"verse":"And of Asher he said, Baruch be Asher with banim; let him be acceptable to his brethren, and let him tovel (dip, immerse as in tevilah) his foot in shemen."},{"num":25,"verse":"Thy bars shall be barzel (iron) and nechoshet (bronze); and as thy yamim, so shall thy strength be."},{"num":26,"verse":"There is none like unto El Yeshurun, who rideth upon Shomayim to be thy ezer (help), and on the sky in His majesty."},{"num":27,"verse":"Elohei Kedem is thy me’onah (dwelling place), and underneath are the Zero’ot Olam (Everlasting Arms): and He shall thrust out the enemy from before thee; and shall say, Make them shmad."},{"num":28,"verse":"Yisroel then shall dwell in safety alone; the fountain of Ya’akov shall be upon an eretz dagan (land of grain) and tirosh (new wine); also His heavens shall drop down tal."},{"num":29,"verse":"Happy art thou, O Yisroel; who is like unto thee, O people saved by Hashem, the mogen of thy ezer and the cherev of thy majesty! Thine enemies shall come fawning unto thee; and thou shalt trample down their high places."}]