[{"num":33,"verse":"This is the blessing, with which Moses, the man of God, blessed the sons of Israel before his death; (This is the blessing, with which Moses, the man of God, blessed the Israelites before his death;)"},{"num":2,"verse":"and said, The Lord came from Sinai, and he rose to us from Seir; he appeared from the hill of Paran, and thousands of saints with him; a law of fire in his right hand. (and he said, The Lord came from Sinai, and he rose up like the sun to us from Seir, or Edom; he appeared from Mount Paran, and thousands of saints, or holy ones, or angels, were with him; a Law of fire was in his right hand.)"},{"num":3,"verse":"He loved peoples; all saints be in his hand, and they that nigh to his feet shall take of his doctrine. (He loved the people; all the saints be in the palm of his hand, and they who sit at his feet shall receive his doctrine, or his teaching.)"},{"num":4,"verse":"Moses commanded the law to us, the heritage of the multitude of Jacob. (Yea, the Law which Moses commanded to us, the inheritance of the multitude of Jacob.)"},{"num":5,"verse":"And the king shall be at the most rightful, when princes of the people be gathered together with the lineages of Israel. (And then the King was there in Jeshurun, when the leaders of the people were gathered together with the tribes of Israel.)"},{"num":6,"verse":"Reuben live, and die not, and be he little in number. (May the tribe of Reuben live, and not die out, but be they few in number.)"},{"num":7,"verse":"This is the blessing of Judah; Lord, hear thou the voice of Judah, and bring in him to his people; his hands shall fight for him, and the helper of him, shall be against his adversaries. (This is the blessing for the tribe of Judah; Lord, hear thou the voice of Judah, and unite them again with the other tribes; thy hands shall fight for them, and thou shalt be their helper against their adversaries.)"},{"num":8,"verse":"Also he said to Levi, Thy perfection and thy teaching is of an holy man, whom thou hast proved in temptation, and hast deemed at the Waters of Against-saying; (And he said of the tribe of Levi, Lord, may thy Thummim and thy Urim be with them, thy holy servants, whom thou hast proved at Massah, and hast judged at the waters of Meribah;)"},{"num":9,"verse":"which Levi said to his father and to his mother, I know not you, and to his brethren, I know not them; and knew not his sons. These kept thy speech, and these kept thy covenant; (yea, the Levites said to their fathers and their mothers, We do not know you, and to their brothers, We do not know you; and they did not even know their own sons and daughters. They obeyed thy words, and they kept thy covenant.)"},{"num":10,"verse":"O! Jacob, they kept thy dooms, and thy law, O! Israel; they shall put incense in thy strong vengeance, and burnt sacrifice on thine altar. (They shall teach Jacob thy precepts, and Israel thy Law; they shall put incense and burnt offerings upon thy altar.)"},{"num":11,"verse":"Lord, bless thou the strength of him, and receive thou the works of his hands; smite thou the backs of his enemies, and they that hate him, rise they not. (Lord, bless thou their strength, and receive thou the works of their hands; strike thou the backs of their enemies, and they who hate them, let them never rise up again.)"},{"num":12,"verse":"And he said to Benjamin, The most loved of the Lord shall dwell trustily in him; he shall dwell all day as in a chamber, and he shall rest betwixt the shoulders of the Lord. (And he said of the tribe of Benjamin, The beloved of the Lord shall dwell trustily in him; they shall live all day long like in a secure place, and they shall rest between the shoulders of the Lord.)"},{"num":13,"verse":"Also he said to Joseph, His land is of the Lord’s blessing; of the apples of heaven, and of the dew, and of water lying beneath; (And he said of the tribe of Joseph, Their land is blessed by the Lord, with precious fruits watered from the heavens above, and from the streams flowing beneath;)"},{"num":14,"verse":"of the apples of the fruits of the sun, and moon; (with precious fruits, ripened by the sun, over the months;)"},{"num":15,"verse":"[and] of the top of eld mountains, and of the apples of everlasting little hills; (with precious fruits, from the tops of the old mountains, and from the everlasting little hills;)"},{"num":16,"verse":"and of the fruits of the land, and of the fullness thereof. The blessing of him that appeared in the bush come upon the head of Joseph, and upon the foretop, that is, the crown of the head, of the Nazarite, or (the) holy (one), among his brethren. (with the fruits, and other crops, of the land, in all its fullness. May these blessings of him who appeared in the bush come upon Joseph’s head, yea, upon the tribe of him who was separated from his brothers/who was the leader of his brothers.)"},{"num":17,"verse":"As the first engendered of a bull is the fairness of him; the horns of an unicorn be the horns of him; in those he shall winnow folks, till to the terms of [the] earth. These be the multitudes of Ephraim, and these be the thousands of Manasseh. (His fairness is like the first-born of a bull; his horns be like the horns of a wild ox; and with them he shall winnow the nations, unto the ends of the earth. Such shall be the multitudes of Ephraim, and the thousands of Manasseh.)"},{"num":18,"verse":"And he said to Zebulun, Zebulun, be thou glad in thy going out, and Issachar, in thy tabernacles. (And he said of the tribes of Zebulun, and of Issachar, Zebulun, be thou prosperous abroad, and Issachar, be thou prosperous in thy tents, or at home.)"},{"num":19,"verse":"They shall call peoples to the hill, [and] there they shall offer sacrifices of rightfulness; which shall suck the flowing(s) of the sea as milk, and hid treasures of gravel. (They shall call the peoples to the mountain, and there they shall offer the right sacrifices; they shall suck up the wealth of the sea like milk, and they shall dig up hidden treasures out of the gravel.)"},{"num":20,"verse":"And he said to Gad, Gad is blessed in broadness; he rested as a lion, and he took from his adversary the arm and the noll. (And he said of the tribe of Gad, Gad is blessed in their broad places; they rest like a lion, but they tear off the arms and the tops of the heads of their adversaries.)"},{"num":21,"verse":"And he saw his princehood, that he was kept a teacher in his part; the which was with (the) princes of the people, and he did the rightfulnesses of the Lord, and his doom with Israel. (And they chose the best land for themselves, a ruler’s portion, when the leaders of the people were gathered together; and they did the justice of the Lord, and his laws, or his judgements, with Israel.)"},{"num":22,"verse":"Also he said to Dan, Dan, a whelp of a lion, shall flow largely from Bashan. (And he said of the tribe of Dan, Dan is a whelp of a lion, leaping out from Bashan.)"},{"num":23,"verse":"And he said to Naphtali, Naphtali shall use abundance, and he shall be full with blessings of the Lord; and he shall wield the sea and the south. (And he said of the tribe of Naphtali, Naphtali shall have great abundance, and they shall be full of the Lord’s blessings; they shall take the land southward from Lake Galilee.)"},{"num":24,"verse":"Also he said to Asher, Asher, be blessed in sons, and please he his brethren; dip he his foot in oil. (And he said of the tribe of Asher, Asher is the most blessed of the tribes; may they be the favourite among their brothers, or their kinsmen, and may they bathe their feet in oil.)"},{"num":25,"verse":"Iron and brass (be) the shoe(s) of him; as the day of thy youth, so and thine eld (age). (May thy gates be made out of iron and brass; and thy old age be like the days of thy youth.)"},{"num":26,"verse":"None other god is as the God of the most rightful; the rider of heaven is thine helper; clouds run about by the glory of him. (There is no other god like the God of Jeshurun; the Rider of heaven is thy helper, riding upon the clouds in his glory/riding through the clouds in his glory.)"},{"num":27,"verse":"His dwelling place is above, and his arms everlasting be beneath; he shall cast out from thy face the enemy, and he shall say to them, Be thou all-broken. (His dwelling place is above, but his everlasting arms be beneath; he shall throw out the enemy from before us, and he shall say to us, Destroy them all!)"},{"num":28,"verse":"Israel shall dwell trustily and alone; the eye of Jacob is in the land of wheat, and of wine; and (the) heavens shall be dark with dew. (And then Israel shall live secure and alone; the tribes of Jacob shall be in the land of corn, and of wine; and the skies shall be dark with dew.)"},{"num":29,"verse":"Blessed art thou, Israel; thou people that art saved in the Lord, who is like thee? The shield of thine help and the sword of thy glory is thy God; thine enemies shall deny thee, and thou shalt tread their necks. (Blessed art thou, O Israel; who is like thee? the people who art saved by the Lord! Thy God is the shield of thy help, and the sword of thy glory; thy enemies shall beg thee for mercy, but thou shalt tread upon their necks!)"}]