[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "NUN.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(105) See Proverbs 6:23.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(105) See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 6:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "So Wordsworth calls Duty:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "“A light to guide.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "NUN.",
        "children": [
          {
            "element": "span",
            "class": "ital",
            "text": "NUN.",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 119:105-108",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 119:105-108",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Thy word is a lamp unto my feet — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "To direct me in all my doubts and difficulties, and to comfort me in all my fears and distresses. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I have sworn, and will perform it — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "I have solemnly vowed, and, by God’s grace, will fulfil my vow; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that I will keep thy righteous judgments — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Thy commands, which are consonant to the eternal rules of equity, and which it is our duty to observe carefully. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Accept the free-will-offerings of my mouth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " — The sacrifices of prayer and praise, which I do freely and frequently offer unto thee.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "119:105-112 The word of God directs us in our work and way, and a dark place indeed the world would be without it. The commandment is a lamp kept burning with the oil of the Spirit, as a light to direct us in the choice of our way, and the steps we take in that way. The keeping of God's commands here meant, was that of a sinner under a dispensation of mercy, of a believer having part in the covenant of grace. The psalmist is often afflicted; but with longing desires to become more holy, offers up daily prayers for quickening grace. We cannot offer any thing to God, that he will accept but what he is pleased to teach us to do. To have our soul or life continually in our hands, implies constant danger of life; yet he did not forget God's promises nor his precepts. Numberless are the snares laid by the wicked; and happy is that servant of God, whom they have not caused to err from his Master's precepts. Heavenly treasures are a heritage for ever; all the saints accept them as such, therefore they can be content with little of this world. We must look for comfort only in the way of duty, and that duty must be done. A good man, by the grace of God, brings his heart to his work, then it is done well.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Thy word is a lamp unto my feet - This begins a new portion of the psalm, indicated by the Hebrew letter Nun (נ n), equivalent to our \"n.\" The margin here is \"candle.\" The Hebrew word means a light, lamp, candle. The idea is, that the word of God is like a torch or lamp ton man in a dark night. It shows him the way; it prevents his stumbling over obstacles, or failing down precipices, or wandering off into paths which would lead into danger, or would turn him away altogether from the path to life. Compare the notes at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Peter 1:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And a light unto my path - The same idea substantially is presented here. It is a light which shines on the road that a man treads, so that he may see the path, and that he may see any danger which may be in his path. The expression is very beautiful, and is full of instruction. He who makes the word of God his guide, and marks its teachings, is in the right way. He will clearly see the path. He will be able to mark the road in which he ought to go, and to avoid all those by-paths which would lead him astray. He will see where those by-roads turn off from the main path - often at a very small angle, and so that there seems to be no divergence. He will see any obstruction which may lie in his path; any declivity or precipice which may be near, and down which, in a dark night, one might fall. Man needs such a guide, and the Bible is such a guide. Compare the notes at Psalm 119:9. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And a light unto my path - The same idea substantially is presented here. It is a light which shines on the road that a man treads, so that he may see the path, and that he may see any danger which may be in his path. The expression is very beautiful, and is full of instruction. He who makes the word of God his guide, and marks its teachings, is in the right way. He will clearly see the path. He will be able to mark the road in which he ought to go, and to avoid all those by-paths which would lead him astray. He will see where those by-roads turn off from the main path - often at a very small angle, and so that there seems to be no divergence. He will see any obstruction which may lie in his path; any declivity or precipice which may be near, and down which, in a dark night, one might fall. Man needs such a guide, and the Bible is such a guide. Compare the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 119:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "NUN. (Ps 119:105-112).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "105. Not only does the Word of God inform us of His will, but, as a light on a path in darkness, it shows us how to follow the right and avoid the wrong way. The lamp of the Word is not the sun. He would blind our eyes in our present fallen state; but we may bless God for the light shining as in a dark place, to guide us until the Sun of Righteousness shall come, and we shall be made capable of seeing Him (2Pe 1:19; Re 22:4). The lamp is fed with the oil of the Spirit. The allusion is to the lamps and torches carried at night before an Eastern caravan.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "105. Not only does the Word of God inform us of His will, but, as a light on a path in darkness, it shows us how to follow the right and avoid the wrong way. The lamp of the Word is not the sun. He would blind our eyes in our present fallen state; but we may bless God for the light shining as in a dark place, to guide us until the Sun of Righteousness shall come, and we shall be made capable of seeing Him (2Pe 1:19; Re 22:4). The lamp is fed with the oil of the Spirit. The allusion is to the lamps and torches carried at night before an Eastern caravan.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "The Treasury of David",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "105 Thy word is a lamp unto my feet, and a light unto my path.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "106 I have sworn, and I will perform it, that I will keep thy righteous judgments.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "107 I am afflicted very much, quicken me, O Lord, according unto thy word.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "108 Accept, I beseech thee, the freewill offerings of my mouth, O Lord, and teach me thy judgments.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "109 My soul is continually in my hand, yet do I not forget thy law.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "110 The wicked have laid a snare for me: yet I erred not from thy precepts.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "111 Thy testimonies have I taken as an heritage for ever, for they are the rejoicing of my heart.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "112 I have inclined mine heart to perform thy statutes alway, even unto the end.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 119:105",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 119:105",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Thy word is a lamp unto my feet.\" We are walkers through the city of this world, and we are often called to go out into its darkness; let us never venture there without the light-giving word, lest we slip with our feet. Each man should use the word of God personally, practically, and habitually, that he may see his way and see what lies in it. When darkness settles down upon all around me, the word of the Lord, like a flaming torch, reveals my way. Having no fixed lamps in eastern towns, in old time each passenger carried a lantern with him that he might not fall into the open sewer, or stumble over the heaps of ordure which defiled the road. This is a true picture of our path through this dark world, we should not know the way, or how to walk in it, if the Scripture, like a blazing flambeau, did not reveal it. One of the most practical benefits of Holy Writ is guidance in the acts of daily life; it is not sent to astound us with its brilliance, but to guide us by its instruction. It is true the head needs illumination, but even more the feet need direction, else head and feet may both fall into a ditch. Happy is the man who personally appropriates God's word, and practically uses it as his comfort and counsellor, - a lamp to his own feet. \"And a light unto my path.\" It is a lamp by night, a light by day, and a delight at all times. David guided his own steps by it, and also saw the difficulties of his road by its beams. He who walks in darkness is sure, sooner or later, to stumble; while he who walks by the light of day, or by the lamp of night, stumbleth not, but keeps his uprightness. Ignorance is painful upon practical subjects; it breeds indecision and suspense, and these are uncomfortable: the word of God, by imparting heavenly knowledge, leads to decision, and when that is followed by determined resolution, as in this case, it brings with it great restfulness of heart.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This verse converses with God in adoring and yet familiar tones. Have we not something of like tenor to address to our heavenly Father?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Note how like this verse is to Psalm 1:1, and Psalm 119:9 and other octaves. The seconds also are often in unison.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Note how like this verse is to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 1:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 119:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and other octaves. The seconds also are often in unison.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 119:106",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 119:106",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"I have sworn, and I will perform it, that I will keep thy righteous judgments.\" Under the influence of the clear light of knowledge he had firmly made up his mind and solemnly declared his resolve in the sight of God. Perhaps mistrusting his own fickle mind, he had pledged himself in sacred form to abide faithful to the determinations and decisions of his God. Whatever path might open before him, he was sworn to follow that only upon which the lamp of the word was shining. The Scriptures are God's judgments, or verdicts, upon great moral questions; these are all righteous, and hence righteous men should be resolved to keep them at all hazards, since it must always be right to do right. Experience shows that the less of covenanting and swearing men formally enter upon the better, and the genius of our Saviour's teaching is against all supererogatory pledging and swearing; and yet under the gospel we ought to feel ourselves as much bound to obey the word of the Lord as if we had taken an oath so to do. The bonds of love are not less sacred than the fetters of law. When a man has vowed he must be careful to \"perform it,\" and when a man has not vowed in so many words to keep the Lord's judgments, yet is he equally bound to do so by obligations which exist apart from any promise on our part, - obligations founded in the eternal fitness of things, and confirmed by the abounding goodness of the Lord our God. Will not every believer own that he is under bonds to the redeeming Lord to follow his example, and keep his words? Yes, the vows of the Lord are upon us, especially upon such as have made profession of discipleship, have been baptized into the thrice-holy name, have eaten of the consecrated memorials, and have spoken in the name of the Lord Jesus. We are enlisted, and sworn in, and are bound to be loyal soldiers all through the war. Thus having taken the word into our hearts by a firm resolve to obey it, we have a lamp within our souls as well as in the Book, and our course will be light unto the end.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "NUN",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Ver. 105. To direct me in all my doubts and difficulties, to preserve from sin and misery, both which oft come under the name of darkness, and to comfort me in all my fears and distresses. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "NUN.--The Fourteenth Part. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "NUN. Thy word is a lamp unto my feet,.... The same Solomon says of the law and commandment, the preceptive part of the word, Proverbs 6:23; and the Septuagint and Arabic versions render it \"law\" here. This shows a man what is his duty, both towards God and man; by it is the knowledge of sin: this informs what righteousness that is God requires of men; by the light of it a man sees his own deformity and infirmities, the imperfection of his obedience, and that he needs a better righteousness than his own to justify him in the sight of God; it is a rule of walk and conversation; it directs what to do, and how to walk. The Gospel part of the word is a great and glorious light; by which men come to have some knowledge of God in Christ, as a God gracious and merciful; of Christ, his person, offices, and grace; of righteousness, salvation, and eternal life by him; and it teaches men to live soberly, righteously, and godly. The whole Scripture is a light shining in a dark place; a lamp or torch to be carried in the hand of a believer, while he passes through this dark world; and is in the present state of imperfection, in which he sees things but darkly. This is the standard of faith and practice; by the light of this lamp the difference between true and false doctrine may be discerned; error and immorality may be reproved, and made manifest; the way of truth and godliness, in which a man should walk, is pointed out; and by means of it he may see and shun the stumbling blocks in his way, and escape falling into pits and ditches; it is a good light to walk and work by. The Targum is, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "NUN. Thy word is a lamp unto my feet,.... The same Solomon says of the law and commandment, the preceptive part of the word, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 6:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and the Septuagint and Arabic versions render it \"law\" here. This shows a man what is his duty, both towards God and man; by it is the knowledge of sin: this informs what righteousness that is God requires of men; by the light of it a man sees his own deformity and infirmities, the imperfection of his obedience, and that he needs a better righteousness than his own to justify him in the sight of God; it is a rule of walk and conversation; it directs what to do, and how to walk. The Gospel part of the word is a great and glorious light; by which men come to have some knowledge of God in Christ, as a God gracious and merciful; of Christ, his person, offices, and grace; of righteousness, salvation, and eternal life by him; and it teaches men to live soberly, righteously, and godly. The whole Scripture is a light shining in a dark place; a lamp or torch to be carried in the hand of a believer, while he passes through this dark world; and is in the present state of imperfection, in which he sees things but darkly. This is the standard of faith and practice; by the light of this lamp the difference between true and false doctrine may be discerned; error and immorality may be reproved, and made manifest; the way of truth and godliness, in which a man should walk, is pointed out; and by means of it he may see and shun the stumbling blocks in his way, and escape falling into pits and ditches; it is a good light to walk and work by. The Targum is, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"thy word is as a light that shines to my feet.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "It follows, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and a light unto my path; the same thing in other words. Now it should be observed, that the word of God is only so to a man whose eyes are opened and enlightened by the Spirit of God, which is usually done by means of the word; for a lamp, torch, candle, or any other light are of no use to a blind man. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and a light unto my path; the same thing in other words. Now it should be observed, that the word of God is only so to a man whose eyes are opened and enlightened by the Spirit of God, which is usually done by means of the word; for a lamp, torch, candle, or any other light are of no use to a blind man. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "NUN. Thy word is a {a} lamp unto my feet, and a light unto my path.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "NUN. Thy word ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " a ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{a}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " lamp unto my feet, and a light unto my path.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) Of ourselves we are but darkness and cannot see unless we are lightened with God's Word.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "105",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 6:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". God’s word is a light to guide him safely amid the dangers which beset his path through the darkness of this world. Contrast the fate of the wicked, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 35:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "105–112",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Nûn",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Knowing the value of God’s law as the guide of life the Psalmist is resolved to keep it, whatever may be the risk.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 105.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Thy Word is a lamp unto my feet, and a light unto my path",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It shows me the way wherein I should go, both night and day (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 6:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Psalm 119:105",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The eightfold Nun. The word of God is his constant guide, to which he has entrusted himself for ever. The way here below is a way through darkness, and leads close past abysses: in this danger of falling and of going astray the word of God is a lamp to his feet, i.e., to his course, and a light to his path (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 6:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); his lamp or torch and his sun. That which he has sworn, viz., to keep God's righteous requirements, he has also set up, i.e., brought to fulfilment, but not without being bowed down under heavy afflictions in confessing God; wherefore he prays (as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 119:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") that God would revive him in accordance with His word, which promises life to those who keep it. The confessions of prayer coming from the inmost impulse of his whole heart, in which he owns his indebtedness and gives himself up entirely to God's mercy, he calls the free-will offerings of his mouth in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 119:108",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 50:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 19:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). He bases the prayer for a gracious acceptance of these upon the fact of his being reduced to extremity. \"To have one's soul in one's hand\" is the same as to be in conscious peril of one's life, just as \"to take one's soul into one's hand\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 12:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 19:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 28:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 13:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") is the same as to be ready to give one's life for it, to risk one's life.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Cf. B. Taanth 8a: \"The prayer of a man is not answered אלא אם כן משׂים נפשׁו בכפו, i.e., if he is not ready to sacrifice his life.\")",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Although his life is threatened (Psalm 119:87), yet he does not waver and depart from God's word; he has taken and obtained possession of God's testimonies for ever (cf. Psalm 119:98); they are his \"heritage,\" for which he willingly gives up everything else, for they (המּה inexactly for הנּה) it is which bless and entrance him in his inmost soul. In Psalm 119:112 it is not to be interpreted after Psalm 19:12 : eternal is the reward (of the carrying out of Thy precepts), but in Psalm 119:33 עקב is equivalent to לעד, and Psalm 119:44 proves that Psalm 119:112 need not be a thought that is complete in itself. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Although his life is threatened (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 119:87",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), yet he does not waver and depart from God's word; he has taken and obtained possession of God's testimonies for ever (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 119:98",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); they are his \"heritage,\" for which he willingly gives up everything else, for they (המּה inexactly for הנּה) it is which bless and entrance him in his inmost soul. In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 119:112",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " it is not to be interpreted after ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 19:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : eternal is the reward (of the carrying out of Thy precepts), but in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 119:33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " עקב is equivalent to לעד, and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 119:44",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " proves that ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 119:112",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " need not be a thought that is complete in itself. ",
            "children": []
          }
        ]
      }
    ]
  }
]