[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(126) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "They have",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "made void thy law.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Some treat the verse as parenthetical, but is it not that the irreligion of the wicked makes the Law even more dear to the psalmist? What they reject is to him priceless,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "“Faithful found;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Among the faithless, faithful only he.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Psalms",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "‘TIME FOR THEE TO WORK’Psalm 119:126 - Psalm 119:128",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "‘TIME FOR THEE TO WORK’",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 119:126",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 119:128",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " If much that we hear be true, a society to circulate Bibles is a most irrational and wasteful expenditure of energy and money. We cannot ignore the extent and severity of the opposition to the very idea of revelation, even if we would; we should not if we could. We are told with some exaggeration-the wish being father to the thought-that the educated mind of the country has broken with Christianity, a statement which is equally remarkable for its accuracy and for its modesty. But it has a basis of truth in the widespread disbelief diffused through the literary and so-called cultivated classes. There is no need to spend time in referring at length to facts which are only too familiar to most of us. Every sphere of knowledge, every form of literature, is enlisted in the crusade. Periodicals that lie on all our tables, works of imagination that your daughters read, newspapers that go everywhere, are full of it. Poetry, forgetting her lineage and her sweetness, strains ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "her",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " voice in rhapsodies of hostility. Science, leaping the hedge beyond which ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "she",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " at all events is a trespasser,-or in finer language, ‘prolonging its gaze backwards beyond the boundary of experimental evidence,’ or in still plainer terms, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "guessing",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", affirms that she discerns in matter the promise and potency of every form of life; or presently, in a devouter mood, looking on the budding glories of the spring, declines to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "profess",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the creed of Atheism. Learned criticism demonstrates the impossibility of supernatural religion. The leader of an influential school leaves behind him a voice hollow and sad, as from the great darkness, in which we seem to hear the echoes of a life baffled in the attempt to harmonise the logical and the spiritual elements of a large soul: ‘There may be a God. The evidence is insufficient for proof. It only amounts to one of the lower degrees of probability. He may have given a revelation of His will. There are grounds sufficient to remove all antecedent improbability. The question is wholly one of evidence; but the evidence required has not been, and cannot be, forthcoming. There is room to hope for a future life, but there is no assurance whatever. Therefore cultivate in the region of the imagination merely those hopes which can never become certainties, for they are infinitely precious to mankind.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Ah, brethren! do we not hear in these dreary words the cry of the immortal hunger of the soul for God, for the living God? The concessions they make to Christian apologists are noteworthy, but that unconscious confession of need is the most noteworthy. Surely, as the eye prophesies light, so the longing of the soul and the capacity for forming such ideals are the token that He is for whom heart and flesh do thus yearn. And how blessed is it to set over against these dreary ghosts that call themselves hopes, and that pathetic vain attempt to find refuge in the green fields of the imagination from the choking dust of the logical arena, the old faithful words: ‘This is the record, that God hath given to us eternal life, and that this life is in His Son’!",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But my object in referring to these forms of opinion was merely to prepare the way for my subsequent observations; I have no intention of dealing with any of them by way of criticism or refutation. This is not the place nor the audience, nor am I the person, for that task. But I have thought that it might not be inappropriate to this occasion if I were to ask you to consider with me, from these words, the attitude of mind and heart to God’s word which becomes the Christian in times of opposition.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The Psalmist was surrounded, as would appear, by widespread defection from God’s law. But instead of trembling as if the sun were about to expire, he turns himself to God, and in fellowship with Him sees in all the antagonism but the premonition that He is about to act for the vindication of His own work. That confidence finds expression in the sublime invocation of our text. Then with another movement of thought, the contemplation of the departures makes him tighten his own hold on the law of the Lord, and the contempt of the gainsayers quickens his love: ‘",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Therefore",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " I love,’ etc. And as must needs be the case, that love is the measure of his abhorrence of the opposite; and because God’s commandments are so dear to him, therefore he recoils with healthy hatred from false ways. So, I think, we have a fourfold representation here of our true attitude in the face of existing antagonism-calm confidence in God’s work for His law; earnest prayer, which secures the forthputting of the divine energy; an increased intensity of cleaving to the word; and a decisive opposition to the ways which make it void.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " I ask your attention to some remarks on each of these in their order. So, then, we have-",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. Calm confidence that times of antagonism evoke God’s work for His word. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. Calm confidence that times of antagonism evoke God’s work for His word.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Now I dare say that some of you feel that is not the first thought that should be excited by the opposition around us. ‘We have no sort of doubt,’ you may say, ‘that God will take care of His own word, if there be such a thing; but the question that presses is, Have we it in this book? Answer that for us, and we will thank you; but platitudes about God watching over His truth are naught. The first thing to do is to meet these arguments and establish the origin of Scripture. Then it will follow of itself that it will not perish.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But I take leave to think we, as Christians, arc not bound to revise the foundation belief of our lives at the call of every new antagonist. Life is too short for that. There is too much work waiting, to suspend our activity till we have answered each denier. We do not hold our faith in the word of God, as the winners at a match do their cups and belts, on condition of wrestling for them with any challenger. It is a perfectly legitimate position to say, We hold a ground of certitude, from which none of this strife of tongues is able to dislodge us. ‘We have heard Him ourselves, and know that this is the Christ.’ The Scriptures which we have received, not without knowledge of the grounds on which controversialists defend them, have proved themselves to us by their own witness. The light is its own proof. We have the experience of Christ and His law. He has saved our souls, He has changed our lives. We know in whom we have believed, and we are neither irrational nor obstinate when we avow that we will not pretend to suspend these convictions on the issue of any debate. We decline to dig up the piles of the bridge that carries us over the abyss because voices tell us that it is rotten. It is shorter and perfectly reasonable to answer, ‘Rotten, did you say? Well, we have tried it, and it bears’; which, being translated into less simple language, is just the assertion of certitude built on facts and experience which leaves no place for doubt. All the opposition will be broken into spray against that rock bulwark: ‘Thy words were found, and I did eat them, and they are the joy and rejoicing of my heart.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So I venture to think that, speaking to Christian men and women, I have a right to speak on the basis of our common belief, and to encourage them to cherish it notwithstanding gainsayers. I am not counselling stolid indifference to the course of modern thought, nor desertion of the duty of defence. We are not to say, ‘God will interfere; I need do nothing.’ But the task of controversy is not for all Christians, nor the duty of following the flow of opinion. There is plenty of more profitable work than that for most of us. The temper which our text enjoins ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "is",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for us all; and this calm confidence, that at the right time God will work for His word, is its first element.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " This confidence rests upon our belief in a divine providence that governs the world, and on the observed laws of its working. It is ever His method to send His succour ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "after",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the evil has been developed, and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "before",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it has triumphed. Had it come sooner, the priceless benefits of struggle, the new perceptions won in controversy of the many-sided meaning and value of His truth, the vigour from conflict, the wholesome sense of our weakness, had all been lost. Had it come later, it had come too late. So He times His help, in order that we may derive the greatest possible benefit from both the trial and the aid. We have all been dealt with so in our personal histories, whereof the very motto might be, ‘When I said my foot slippeth, Thy mercy, O Lord! held me up.’ The same law works on the wider platform. The enemy shall be allowed to pass through the breadth of the land, to spread dread and sorrow through village and hamlet, to draw his ranks round Jerusalem, as a man closes his hand on some insect he would crush. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "To-morrow",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and the assault will be made; but ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to-night",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘the angel of the Lord went forth and smote the camp; and when they arose in the morning,’ expecting to hear the wild war-cry of the conquerors as they stormed across the undefended walls, ‘they were all dead corpses.’ Then, as it would appear, a psalmist, moved by that mighty victory, cast it into words, which remain for all generations the law of the divine aid, and imply all that I am urging now: ‘The Lord is in the midst of her, she shall not be moved; the Lord shall help her at the dawning of the morning.’ True, we are no judges of the time. Our impatience is ever outrunning His calm deliberation. An illusion besets us all that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "our",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " conflicts with unbelief are the severest the world has ever seen; and there is a great deal of exaggeration on both sides at present as to the real extent and importance of existing antagonism to God’s revelation. A widespread literature provides so many-I would not say empty-spaces for any voice to reverberate in, that both the shouters and the listeners are apt to fancy the assailants are an army, when they are only a handful, armed mainly with trumpets and pitchers. There have been darker days of antagonism than these. ‘He that believeth shall not make haste.’ This confidence in the punctual wisdom of His working involves the other belief, that if He does not ‘work,’ it is because the time is not yet ripe; the negations and contradictions have still an office to fulfil, and no hurt that cannot be repaired has been done to the faith of the Church or the power of the word.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Nor can we forecast the manner of His working. He can call forth from the solitary sheepfolds the defenders of His word, as has ever been His wont, raising the man when the hour had come, even as He sent His son in the fulness of time. He can lead science on to deeper truth; He can quicken His Church into new life; He can guide the spirit of the age. We believe that the history of the world is the unfolding of His will, and the course of opinion guided in its channel by the Voice which the depths have obeyed from of old. Therefore we wait for His working, expecting no miracle, prescribing no time, hurried by no impatience, avoiding no task of defence or confession; but knowing that, unhasting and unresting He will arise when the storm is loudest, and somehow will say, ‘Peace! be still.’ Then they who had not cast away their confidence for any fashion of unbelief that passeth away will rejoice as they sing, ‘Lo! this is our God; we have waited for Him, and He will save us.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " This confidence is confirmed by the history of all the past assaults on Scripture.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The whole history of the origin, collection, preservation, transmission, diffusion, and present influence of the Bible involves so much that is surprising and unique, as to amount to at least a strong presumption of a divine care. Among all the remarkable things about the Book, nothing is more remarkable than that there it is, after all that has happened. When we think of the gaps and losses in ancient literature, and the long stormy centuries that lie between us and its earlier pages, we can faintly estimate the chances against their preservation. It is strange that the Jewish race should have so jealously preserved books which certainly did not flatter national pride, which put a mortifying explanation on national disasters, which painted them and their fathers in dark colours, which proclaimed truths they never loved, and breathed a spirit they never caught. It is stranger still, that in the long years of dispersion the very vices and limitations of the people subserved the same end, and that stiff pedantry and laborious trifling-the poorest form of intellectual activity-should have guarded the letter of the word, as the coral insects painfully build up their walls round some fair island of the Southern Sea. When one thinks of the great gulf of language between the Old and New Testaments, of the variety of authors, periods, subjects, literary form, the animosities of Christian and Jew, it ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "is",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " strange that we have the Book here ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "one",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and that all these parts should blend into unity, unless the source and theme were one, and one Hand had shaped each, and cared for the gathering together of all.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " It has been demonstrated over and over again to have no pretensions to be a divine revelation; and yet here it is, believed by millions, and rooted so firmly in European language and thought, that no revolution short of a return to barbarism can abolish it. It has been proved to be a careless, unauthenticated collection of works of different periods, styles, and schools of thought, having no unity but what is given by the bookbinder: and lo! here it is still, not disintegrated, much less dissolved. Each age brings its own destructive criticism to play on it, confessing thereby that its predecessors have effected nothing; for as the Bible says about sacrifices, so we may say about assaults on Scripture, ‘If they had done their work, would they not have ceased to be offered?’ And the effect of the heaviest artillery that can be brought into position is as transient as the boom of their report and the puff of their smoke. Why, who knows anything about the world’s wonders of books that a hundred years ago made good men’s hearts tremble for the ark of God? You may find them in dusty rows on the top shelves of great libraries. But if their names had not occurred in the pages of Christian apologists, flies in amber, nobody in this generation would ever have heard of them. And still more conspicuously is it so with earlier examples of the same kind. Their work is as hopelessly dead as they. And the Book seems none the worse for all the shot-like the rock that a ship fired at all night, taking it for an enemy, and could not provoke to answer nor succeed in sinking. Surely some dim suspicion of the hopelessness of the attempt might creep into the hearts of men who know what ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "has",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " been. Surely the signal failure and swift fading away of all former efforts to dethrone the Bible might lead to the question, ‘Does it not lay its deep foundations in the heart of man and the purpose of God, too deep to be reached by the short tools of mere criticism, too massive to be overthrown by all the weight of materialistic science?’ It is with the Bible as it was with the Apostle, on whose hand, as he crouched over the newly-lit flame, the viper fastened, ‘and he shook off the beast into the fire, and felt no harm.’ The barbarous people, who changed their minds after they had looked a great while and saw no harm come to him, were not altogether wrong, and might teach a lesson to some modern wise men, that, among the other facts which they deal with, they should try to estimate this fact of the continued existence and influence of Scripture, and the failure thus far of all attempts to shake its throne or break the sweet influences of its bands.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Brethren! we, at all events, should learn the lesson of historical experience. The Gospel and the Book which is its record, have met with eager, eloquent, learned antagonists before to-day, and they have passed. Little more than a generation has sufficed to sweep them to oblivion. So it will be again. The forms of opinion, the tendencies of thought, which now seem to some of its enemies so certain to conquer, will follow these forgotten precursors into the dim land. May we not see them-these ancient discrowned kings that ruled over men and rebelled against Christ, these beliefs that no man now believes-rising from their shadowy thrones in the underworld to meet the now living and ruling unbelief, when it, too, shall have gone down to them; ‘All they shall speak and say unto thee, Art thou also become weak as we? art thou become like unto us?’ Yes, each in its turn ‘becomes but a noise’ when he ‘passes the time appointed’-the time when God arises to do His act and vindicate His word.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. We have here, secondly, earnest prayer which brings that divine energy. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. We have here, secondly, earnest prayer which brings that divine energy.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The confidence that God ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "will",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " work underlies and gives energy to the prayer that God ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "would",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " work. The belief that a given thing is in the line of the divine purpose is not a reason for saying, ‘We need not pray; God means to do it,’ but is a reason for saying on the contrary, ‘God means to do it; let us pray for it.’ And this prayer, based upon the confidence that it is His will, is the best service that any of us can render to the Gospel in troublous times.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " I shall have a word to say presently on the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sort",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of outflow of the divine energy which we should principally expect and desire; but let me first remind you, very briefly, how the prayers of Christian men do condition-I had almost said regulate-that outflow.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " I need not put this matter on its abstract and metaphysical side. Two facts are enough for my present purpose-one, a truth of faith, that the actual power wherewith God works for His word remains ever the same; one, a truth of observation and experience, that there are variations in the intensity of its operations and effects in the world. Wherefore? Surely because of the variations in the human recipients and organs of the power. Here at one end is the great fountain, ever brimming. Draw from it ever so much, it sinks not one hair’s-breadth in its pure basin. Here, on the other side, is an intermittent flow, sometimes in scanty driblets, sometimes in painful drops, sometimes more full and free on the pastures of the wilderness. Wherefore these jerks and spasms? It must be something stopping the pipe. Yes, of course. God’s might is ever the same, but our capacity of receiving and transmitting that might varies, and with it varies the energy with which that unchanging power is exerted in the world. Our faith, our earnestness of desire, our ardour and confidence of prayer, our faithfulness of stewardship and strenuousness of use, measure the amount of the unmeasured grace which we can receive. So long as our vessels are brought, the golden oil does not cease to flow. When they are full, it stays. The principle of the variation in actual manifestation of the unvarying might of God is found in the Lord’s words: ‘According to your faith be it unto you.’ So, then, we may expect periods of quickened energy in the forth-putting of the divine power. And these will correspond to, and be consequent on, the faithful prayers of Christian men. See to it, brethren! that you keep the channels clear, that the flow may continue full and increase. Let no mud and ooze of the world, no big blocks of sin nor subtler accumulations of small negligences, choke them again. Above all, by simple, earnest prayer keep your hearts, as it were, wide open to the Sun, and His light will shine on you, and His grace fructify through you, and His Spirit will work in you mightily.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The tenor of these remarks presupposes a point on which I wish to make one or two observations now, viz. that the manner of the divine working which we should most earnestly desire in a time of diffused unbelief is the elevation of Christian souls to a higher spiritual life.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " I do not wish to exclude other things, but I believe that the true antidote to a widespread scepticism is a quickened Church. We may indeed desire that in other ways the enemy should be met. We ought to pray that God would work by sending forth defenders of the truth, by establishing His Church in the firm faith of disputed verities, and by all the multitude of ways in which He can sway the thoughts and tendencies of men. But I honestly confess that I, for my part, attach but secondary importance to controversial defences of the faith. No doubt they have their office; they may confirm a waverer, they may establish a believer, they may show onlookers that the Christian position is tenable; they may, in some rare cases of transcendent power, prevent a heresy from spreading and from descending to another generation. But oftenest they are barren of result, and where they do their work, it is not to be forgotten that there may remain as true a making void of God’s law by an evil heart of unbelief as by an understanding cased in the mail of denial. You may hammer ice on an anvil, or bray it in a mortar. What then? It is pounded ice still, except for the little portion melted by heat of percussion, and it will soon all congeal again. Melt it in the sun, and it flows down in sweet water, which mirrors that light which loosed its bonds of cold. So hammer away at unbelief with your logical sledge-hammers, and you will change its shape, perhaps; but it is none the less unbelief because you have ground it to powder. It is a mightier agent that must melt it-the fire of God’s affection, of all lower, howsoever tender, loves that once filled the whole heart. Such surrender is not pain but gladness, inasmuch as the deeper well that has been sunk dries the surface springs, and gathers all their waters into itself. The new treasure that has filled the heart compels, by glad compulsion, the surrender or, at least, the subordination, of all former affections to the constraint of all-mastering love.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The same thing is true in regard to the union of the soul with Christ. The description of the bride’s abandonment of former duties and ties may be transferred, without the change of a word, to our relations to Him. If love to Him has really come into our hearts, it will master all our yearnings and tendencies and affections, and we shall feel that we cannot but yield up everything besides, by reason of the sovereign power of this new affection. Christ demands from us {if I may use the word ‘demand’ for the beseeching of love}, for His sake, and for our sakes, the entire surrender of ourselves to Him. And that new affection will deal with the old loves, just as the new buds upon the beech-trees in the spring deal with the old leaves that still hang withered on some of the branches. It will push them from their hold, and they will drop. If a river should be turned into some dark cave where unclean beasts have herded and littered for years, the bright waters would sweep out on their bosom all the filth and rottenness. So, when the love of Christ comes surging and flashing into a heart, it will bear out on its broad surface all conflicting and subordinate inclinations, with the passions and lusts that used to rule and befoul the spirit. Christ demands complete surrender, and, if we are Christians, that absolute abandonment will not be a pain nor unwelcome. We epidemic. That is a doctrine which one influential school of modern disbelievers, at all events, cannot but admit.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " What then? Why this-that to change the opinions you must change the atmosphere; or, in other words, the true antagonist of a diffused scepticism is a quickened Christian life. Brethren! if we had been what we ought, would such an environment have ever been possible as that which produces this modern unbelief? Even now, depend upon it, we shall do more for Christ by catching and exhibiting more of His Spirit than by many arguments-more by words of prayer to God than by words of reasoning to men. A higher tone of spiritual life would prove that the Gospel was mighty to mould and ennoble character. If our own souls were gleaming with the glory of God, men would believe that we had met more than the shadow of our own personality in the secret place. If the fire of faith were bright in us, it would communicate itself to others, for nothing is so contagious as earnestness. If we believed, and therefore spoke, the accent of conviction in our tones would carry them deep into some hearts. If we would trust Christ’s Cross to stand firm without our stays, and arguing less about it, would seldomer try to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "prop",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it, and oftener to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "point",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to it, it would draw men to itself. When the power and reality of Scripture as the revelation of God are questioned, the best answer in the long-run will be a Church which can adduce itself as the witness, and can say to the gainsayers, ‘Why, herein is a marvellous thing, that ye know not from whence He is, and yet He hath opened mine eyes!’ Brethren! do you see to it that your life be thus a witness that you have heard His voice; and make it your contribution to the warfare of this day, if you do not bear a weapon, that you lift your hands and heart to God. Moses on the mount helped the struggling ranks below in their hand-to-hand combat with Amalek. Hezekiah’s prayer, when he spread the letter of the invader before the Lord, was more to the purpose than all his munitions of war. Let your voice rise to heaven like a fountain, and blessings will fall on earth. ‘Arise, O Lord! plead Thine own cause. The tumult of those that rise up against Thee increaseth continually.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. We have here, thirdly, as the fitting attitude in times of widespread unbelief, a love to God’s word made more fervid by antagonism. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. We have here, thirdly, as the fitting attitude in times of widespread unbelief, a love to God’s word made more fervid by antagonism.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "There may be a question what reason for the Psalmist’s love is pointed at in this ‘therefore.’ We shall hardly be satisfied with the slovenly and not very reverent explanation, that the word is introduced, without any particular meaning, because it begins with the initial letter proper to this section; nor does it seem enough to suppose a mere general reference to the excellences of the law of the Lord, which are the theme of the whole psalm. Such an interpretation blunts the sharp edge of the thought, and has nothing in its favour but the general want of connection between the separate verses. There are, however, one or two other instances where a thought is pursued through more than one verse, and the usual mere juxtaposition gives place to an interlocking, so that the construction is not unexampled. It is most natural to take the plain meaning of the words, and to suppose that when the Psalmist said, ‘They have made void Thy law, therefore I love Thy commandments,’ he meant, ‘The prevailing opposition is the reason why I, for my part, grasp Thy law more strongly.’ The hostility of others evokes my warmer love. The thought, so understood, is definite, true, and important, and so I venture to construe it, and enforce it as containing a lesson for the day.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And here I would first observe that I desire not to be understood as urging the substitution of feeling for reason, nor as trying to enlist passion in a crusade against the opponent’s logic. Still less do I desire to counsel the exaggeration of opinions because they are denied-that besetting danger of all controversy.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But surely the emotions have a place and an office, if not indeed in the search for, and the submission to, the truth of God, yet in the defence and adherence to that truth when found. The heart may not be the organ for the investigation and apprehension of truth, though it has a part to play even there; but the tenacity with which I cleave to truth, when apprehended, is far more an affair of the will than of the understanding-it is the heart’s love steadying the mind, and holding it fixed to the rock. And love has also a place in the defence of the truth. It gives weight to blows, and wings to the arrows. It makes arguments to be wrought in fire rather than in frost. It lights the enthusiasm which cannot despair, the diligence that will not weary, the fervour that often goes farther to sway other minds than the sharpest dialectics of a passionless understanding. There ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "are",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " causes in which an unimpassioned advocacy is worse than silence; and this is one of them. The word of the living God which has saved our souls and brought to us all that makes our natures rich and strong, and all that peoples the great darkness with fair hopes solid as certainties, demands and deserves fervour in its soldiers, and loyal love in its subjects.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And while it is weakness to over-emphasise our beliefs ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "merely",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " because they are denied, and one of the saddest issues of controversy, that both sides are apt to be hurried into exaggerated statements which calmer thoughts would repudiate; on the other hand, there ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "is",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a legitimate prominence which ought to be given to a truth ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "precisely",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " because it is denied. The time to underline and accentuate strongly our convictions is, when society is slipping away from them, provided it be done without petulance, passion, or the falsehood of extremes.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " If ever there was a period when such general considerations as these had a practical application, this is the time. Would that all such as my voice now reaches would take these grand words for theirs: ‘They make void Thy law, therefore I love Thy commandments above gold; yea, above fine gold!’ Such increase of affection because of gainsayers is the natural instinct of loyal and chivalrous love. If your mother’s name were defiled, would not your heart bound to her defence? When a prince is a dethroned exile, his throne is fixed deeper in the hearts of his adherents ‘though his back be at the wall’ and common souls become heroes because their devotion has been heightened to sublimity of self-sacrifice by a nation’s rebellion. And when so many voices are proclaiming that God has never spoken to men, that our thoughts of His Book are dreams, and its long empire over men’s spirits a waning tyranny, does cool indifference become us? Will not fervour be sobriety, and the glowing emotion of our whole nature our reasonable service?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Such increase of affection because of gainsayers is the fitting end and main blessing of the controversy which is being waged. We never fully hold our treasures till we have grasped them hard, lest they should be plucked from us. No truth is established till it has been denied and has survived. Antagonism to the word of God should have, and will have, to those who use it rightly, a blessing in its train, in bringing out yet more of the preciousness and manifoldness, the all-sufficiency and the universality of the Book. ‘The more ‘tis shook, the more it shines.’ The fiercer the blast, the firmer our confidence in the inexpugnable solidity of that tower of strength that stands four square to every wind that blows. ‘The word of the Lord is tried, therefore Thy servant loveth it.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Such increase of attachment to the word of God because of gainsayers, is the instinct of self-preservation. The sight of so many making void the law makes a man bethink himself of what his own standing is. We, as they, are the children of the age. The tendencies to which they have yielded operate on us too, and our only strength is, ‘Hold Thou me up, and I shall be safe!’ The present condition of opinion remands us all to our foundations, and should teach us that nothing but firm adherence to God revealed in His word, and to the word which reveals God, will prevent us, too, from drifting away to shoreless, solitary seas of doubt, barren as the foam, and changeful as the crumbling, restless wave.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Such strength of affection in the presence of diffused doubt is not to be won without an effort. All our churches afford us but too many examples of men and women who have lost the warmth of their first love, if not their love itself, for no better reason than because so many others have lost it. The effect of popular unbelief stretches far beyond those who are directly affected by its arguments, or avowedly adopt its conclusions. It is hard to hold by a creed which so many influential voices tell you it is a sign of folly and of being behind the age to believe. The consciousness that Christian truth is denied, makes some of you falter in its profession, and fancy that it is less certain simply because it is gainsaid. The mist wraps you in its folds, and it is difficult to keep warm in it, or to believe that love and sunshine are above it all the same. ‘Because iniquity shall abound, the love of many shall wax cold.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Therefore, brethren! do you consciously endeavour that the tempest shall make you tighten your hold on Christ and His word. He appeals to us, too, with that most pathetic question, in which yearning for our love and sorrow over the departed disciples blend so wondrously, as if He cast Himself on our loyalty: ‘Will ye also go away?’ Let us answer, not with the self-confidence that was so signally put to shame, ‘Though all should forsake Thee, yet will not I’; but with the resolve that draws its firmness from His fulness and from our knowledge of the power of His truth, ‘Lord! to whom shall we go? Thou hast the words of eternal life.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "IV. And lastly, we have here, as the final trait in the temper which becomes such times, healthy opposition to the ways which make void the word of the Lord. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "IV. And lastly, we have here, as the final trait in the temper which becomes such times, healthy opposition to the ways which make void the word of the Lord.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "That is the Psalmist’s last movement of feeling, and you see that it comes second, not first, in the order of his emotions. It is the consequence of his love, the recoil of his heart from the practices and theories which contradicted God’s law.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Now, far be it from me to say a word which should fan the embers of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "odium theologicum",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " into a blaze against either men or opinions. But there is a truth involved which seems to be in danger of being forgotten at present, and that to the detriment of large interests as well as of the forgetters. The correlative of a hearty love for any principle or belief is-we may as well use the obnoxious word-a healthy hatred for its denial and contradiction. They are but two aspects of one thing, like that pillar of old which, in its single substance, was a cloud and darkness to the foes, and gave light by night to the friends of Him who dwelt in it. Nay, they are but two names for the very same thing viewed in the very same motion, which is love as it yearns towards and cleaves to its treasure; and hatred, as by the identical same act it recoils and withdraws from the opposite: ‘He will hold to the one, and therefore and therein despise the other.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Much popular teaching as to Christian truth seems to me to ignore this plain principle, and to be working harm, especially among our younger cultivated men and women, whom it charms by an appearance of liberality, which in their view, contrasts very favourably with the narrowness of us sectarians. I am free to admit that in our zeal about small matters {and in a certain ‘provincialism,’ so to speak, which characterised the type of English Christianity till within a recent period} we needed, and still need, the lesson, and I will thankfully accept the rebuke that reminds me of what I ever tend to forget, that the golden rod, wherewith the divine Builder measures from jewel to jewel in the walls of the New Jerusalem, takes in wider spaces than we have meted with our lines. But that is a very different matter from the tone which vitiates and weakens so much modern adherence to Christ’s Gospel and Christ’s Church. The old principle, ‘in essentials unity, in non-essentials liberty,’ made no attempt to determine what belonged to these two classes, and in practice their bounds may often have been wrongly set, so as to include many of the latter among the former; but it at all events recognised the distinction as the basis of its next clause, ‘in all things, charity.’ But nowadays, to listen to some liberal teachers, one would think that nothing was necessary, except the great sacred principle, that nothing is necessary; and that charity could not exist, unless that distinction were effaced.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " I pray you, and if I may venture so far, I would especially pray my younger hearers, to take note, that however fair this way of looking at varying forms of Christian opinion may be, it really reposes on a basis which they will surely think twice before accepting, the denial that there is such a thing as intellectual certitude in religion which can be cast into definite propositions. If there be any truth at all, to confess ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "it",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is to deny its opposite, to cleave to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "this",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is to reject that, to love the one is to hate the other. I fear-I know-that there are many minds among us who began with simply catching this tone of tolerance, and who have been insensibly borne along to an enfeebled belief that there is such a thing as religious truth at all, and that the truth lies in the word of God. Dear friends! let me beseech you to take heed lest, while you are only conscious of your hearts expanding with the genial glow of liberality, by little and little you lose your power of discerning between things that differ, your sense of the worth of the Scripture as the depository of divine truth, and from your slack hand the hem of the vesture in which its healing should fall away.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " As broad a liberality as you please within the limits that are laid down by the very nature of the case. ‘These things are written that ye might believe that Jesus is the Christ, the Son of God, and that believing, ye might have life through His name.’ Wheresoever that record is accepted, that divine Name confessed, that faith exercised, and that life possessed, there, with all diversities, own a brother. Wheresover these things are not, loyalty to your Lord demands that the strength of your love for His word should be manifested in the strength of your recoil from that which makes it void. ‘I love Thy commandments, and I hate every false way.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " I am much mistaken if times are not rapidly coming on us when a decisive election of his side will be forced on every man. The old antagonists will be face to face once more. Compromises and hesitations will not serve. The country between the opposing forces will be stripped of every spot that might serve as cover for neutrals. On the one side a mighty host, its right the Pharisees of ecclesiasticism and ritual, with their banner of authority, making void the law of God by their tradition; its left, and never far away from their opposites on the right with whom they are strangely leagued, working into each other’s hands, the Sadducees denying angel and spirit, with their war-cry of unfettered freedom and scientific evidence; and in the centre, far rolling, innumerable, the dusky hosts of mere animalism, and worldliness, and self, making void the law by their sheer godlessness. And on the other side, ‘He was clothed with a vesture dipped in blood, and His name is called the Word of God, and they that were with Him were called, and chosen, and faithful.’ The issue is certain from of old. Do you see to it that you are of those who were valiant for the truth upon the earth.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Let not the contradiction of many move you from your faith; let it lift your eyes to the hills from whence cometh our help. Let it open your desires in prayer to Him who keeps His own word, that it may keep His Church and bless the world. Let it kindle into fervent enthusiasm, which is calm sobriety, your love for that word. Let it make decisive your rejection of all that opposes. Driftwood may float with the stream; the ship that holds to her anchor swings the other way. Send that word far and wide. It is its own best evidence. It will correct all the misrepresentation of its foes, and supplement the inadequate defences of its friends. Amid all the changes of attacks that have their day and cease to be, amid all the changes of our representations of its endless fulness, it will live. Schools of thought that assail and defend it pass, but it abides. Of both enemy and friend it is true, ‘The grass withereth, and the flower thereof passeth away.’ How antique and ineffectual the pages of the past generations of either are, compared with the ever-fresh youth of the Bible, which, like the angels, is the youngest and is the oldest of books. The world can never lose it; and notwithstanding all assaults, we may rest upon ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "His",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " assurance, whose command is prophecy, when He says, ‘Write it before them in a table, and note it in a book, that it may be for the time to come for ever and ever.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 119:126-127",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 119:126-127",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "It is time — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "It is high time, or a fit season; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for thee, Lord, to work — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "To put forth thy power for the vindication of thy own name and cause, and for the restraint and punishment of evildoers. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For they — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Namely, mine oppressors, or the wicked; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "have made void thy law — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Have abrogated it as far as was in their power, by not only transgressing, but also rejecting it, as if they could wholly lay aside, not only the duties, but also the penalties annexed to the breach of it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Therefore I love thy commandments — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Both because it is one evidence of their excellence that they are disliked by wicked men, and because the great and general apostacy of others makes the duty of loving and obeying them the more necessary.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "119:121-128 Happy is the man, who, acting upon gospel principles, does justice to all around. Christ our Surety, having paid our debt and ransom, secures all the blessings of salvation to every true believer. The psalmist expects the word of God's righteousness, and no other salvation than what is secured by that word, which cannot fall to the ground. We deserve no favour form God; we are most easy when we cast ourselves upon God's mercy, and refer ourselves to it. If any man resolve to do God's will as his servant, he shall be made to know his testimonies. We must do what we can for the support of religion, and, after all, must beg of God to take the work into his own hands. It is hypocrisy to say we love God's commandments more than our worldly interests. The way of sin is a false way, being directly contrary to God's precepts, which are right: those that love and esteem God's law, hate sin, and will not be reconciled to it.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "It is time for thee, Lord, to work - literally, \"Time to do for Yahweh;\" and the construction might be either that it is time to do (something) for Yahweh; or, that it is time for Yahweh himself to do (something). The direct address to the Lord in the latter part of the sentence would seem, however, to show that the latter is the true interpretation: to wit, that since people make void the law of God, it is time for him to work, that is, to interpose by his power and restrain them; to bring them to repentance; to assert his own authority; to vindicate his cause. Thus understood, it is an appropriate prayer to be used when iniquity abounds, and when some special form of sin has an ascendancy among a people. The other interpretation, however, \"It is time (for us) to do (something), since people make void thy law,\" suggests a truth of great importance. Then is the time when the people of God should arouse themselves to efforts to stay the tide of wickedness, and to secure the ascendancy of religion, of virtue, and of law.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "For they have made void thy law - They have broken it. They have set it at defiance. They regard and treat it as if it had no claim to obedience; as if it were a thing of nought. This the psalmist urges as a reason for the putting forth of power to arrest the evil; to bring people to repentance; to secure the salvation of souls. By all the evil done when the law of God is set at nought, by all the desirableness that the law should be obeyed, by all the danger to the souls of people from its violation, this prayer may now and at all times be offered, and that with earnestness. Compare Psalm 119:136. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "For they have made void thy law - They have broken it. They have set it at defiance. They regard and treat it as if it had no claim to obedience; as if it were a thing of nought. This the psalmist urges as a reason for the putting forth of power to arrest the evil; to bring people to repentance; to secure the salvation of souls. By all the evil done when the law of God is set at nought, by all the desirableness that the law should be obeyed, by all the danger to the souls of people from its violation, this prayer may now and at all times be offered, and that with earnestness. Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 119:136",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "122. Be surety—Stand for me against my oppressors (Ge 43:9; Isa 38:14).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ver. 126. ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "It is time; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it is high time, or a fit season. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "To work",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; to put forth thy power for the vindication of thy own name and cause, and for the restraint and punishment of evildoers. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "They, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to wit, mine oppressors, or the wicked; whom it was needless to express, both because they had been lately and frequently mentioned before, and partly because it was evident from the following words. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Have made void thy law; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "abrogated thy law",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; have professedly and openly cast off its authority, resolvedly preferring their own wills and lusts before it, trampled upon thy plain commands, and despised both thy promises and thy threatenings. They have not only sinned through ignorance and infirmity, but presumptuously and. maliciously. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "It is time for thee, Lord, to work,.... To send the Messiah, to work righteousness; to fulfil the law, and vindicate the honour of it, broken by men. It was always a notion of the Jews that the time of the Messiah's coming would be when it was a time of great wickedness in the earth; and which seems to agree with the word of God, and was true in fact; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 2:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Or to arise and have mercy on Zion, for which there is a fixed time: and its seems as if it would be when religion greatly declines, and profaneness abounds; when love is waxen cold, and there is no faith in the earth; and when the days are like those of Noah and Lot, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 17:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; or to take vengeance on wicked men, by sending down his judgments on them now, as well as he will punish them hereafter; for which a time is appointed, though no man knows of it. The words may be rendered, \"it is time to work for the Lord\" (o); so the Septuagint version; to which agrees the Targum, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"it is time to do the will of the Lord;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the Syriac and Arabic versions, \"it is time to worship the Lord\". It is proper, in declining times, for good men to bestir themselves and be in action, to attempt the revival of religion, to do all that in them lies to support the cause of God, and to vindicate his honour and glory; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for they have made void thy law; the whole word of God, the Scriptures; as atheists and deists, who deny the authority of them; Pharisees, who preferred their oral law to the written word, and by the traditions of the elders made it of none effect; Papists, by their unwritten traditions, and denying the common people the reading of the Scriptures in their mother tongue; and all false teachers, who wrest the Scriptures, and put false glosses on them, and handle the word of God deceitfully; and all profane sinners, who bid defiance to the law, and, as much as in them lies, abrogate it, and set up a law of their own, and frame mischief by it: or the law of faith may be meant; the Gospel of Christ, and the several truths of it, which are opposed, contradicted, and blasphemed by men of corrupt minds; and particularly the doctrine of justification by faith in Christ's righteousness; which are made void by the doctrine of works; and even the law itself is made void by the same: for not those that maintain the doctrine of Christ's righteousness, but those that establish their own, make void the law; presenting a righteousness to it, which is not answerable to its demands, Romans 3:31. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "for they have made void thy law; the whole word of God, the Scriptures; as atheists and deists, who deny the authority of them; Pharisees, who preferred their oral law to the written word, and by the traditions of the elders made it of none effect; Papists, by their unwritten traditions, and denying the common people the reading of the Scriptures in their mother tongue; and all false teachers, who wrest the Scriptures, and put false glosses on them, and handle the word of God deceitfully; and all profane sinners, who bid defiance to the law, and, as much as in them lies, abrogate it, and set up a law of their own, and frame mischief by it: or the law of faith may be meant; the Gospel of Christ, and the several truths of it, which are opposed, contradicted, and blasphemed by men of corrupt minds; and particularly the doctrine of justification by faith in Christ's righteousness; which are made void by the doctrine of works; and even the law itself is made void by the same: for not those that maintain the doctrine of Christ's righteousness, but those that establish their own, make void the law; presenting a righteousness to it, which is not answerable to its demands, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 3:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(o)   \"tempus est agendi pro Deo\", Gussetius, p. 649. \"Tempus faciendi Domino\", Pagninus, Montanus, Musculus. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(o)   \"tempus est agendi pro Deo\", Gussetius, p. 649. \"Tempus faciendi Domino\", Pagninus, Montanus, Musculus. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "It is {c} time for thee, LORD, to work: for they have made void thy law.",
        "children": [
          {
            "element": "i",
            "class": "",
            "text": "It is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{c}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " time for ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "thee",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", LORD, to work: ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "for",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " they have made void thy law.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) The prophet shows that when the wicked have brought all things to confusion, and God's word to utter contempt, then it is God's time to help and send remedy.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "126",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It is time for Jehovah to act;",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "They have broken thy law.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "High time it is for Jehovah to interpose with an act of judgement (cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 18:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “deal thou with them”), and vindicate His broken law. The second line is decisive in favour of this interpretation: otherwise the first line might be rendered, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "It is time to act for Jehovah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Psalm 119:124-125",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 119:124-125",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " connected with it, in the sense that in such a crisis fresh knowledge is needed.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 126.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "It is time for thee, Lord, to work",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; or, \"to act;\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "e",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". to lay aside quiescence, and come forward as the active Ruler of the universe. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "For they have made void thy Law",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The wicked have cast thy Law behind their back, and, so far as lay in their power, \"made it void\" - repealed it, cancelled it. Psalm 119:126",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The eightfold Ajin. In the present time of apostasy and persecution he keeps all the more strictly to the direction of the divine word, and commends himself to the protection and teaching of God. In the consciousness of his godly behaviour (elsewhere always צדק וּמשׁפּט, here in one instance משׁפט וצדק) the poet hopes that God will surely not (בּל) leave him to the arbitrary disposal of his oppressors. This hope does not, however, raise him above the necessity and duty of constant prayer that Jahve would place Himself between him and his enemies. ערב seq. acc. signifies to stand in any one's place as furnishing a guarantee, and in general as a mediator, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 17:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 38:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; לטוב similar to לטובה, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 86:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nehemiah 5:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : in my behalf, for my real advantage. The expression of longing after redemption in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 119:123",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " sounds like ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 119:81",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"The word of Thy righteousness\" is the promise which proceeds from God's \"righteousness,\" and as surely as He is \"righteous\" cannot remain unfulfilled. The one chief petition of the poet, however, to which he comes back in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 119:124",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., has reference to the ever deeper knowledge of the word of God; for this knowledge is in itself at once life and blessedness, and the present calls most urgently for it. For the great multitude (which is the subject to הפרוּ) practically and fundamentally break God's law; it is therefore time to act for Jahve (עשׂה ל as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 30:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 64:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 29:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and just in order to this there is need of well-grounded, reliable knowledge. Therefore the poet attaches himself with all his love to God's commandments; to him they are above gold and fine gold (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 19:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), which he might perhaps gain by a disavowal of them. Therefore he is as strict as he possibly can be with God's word, inasmuch as he acknowledges and observes all precepts of all things (כּל־פּקּוּדי כל), i.e., all divine precepts, let them have reference to whatsoever they will, as ישׁרים, right (ישּׁר, to declare both in avowal and deed to be right); and every false (lying) tendency, all pseudo-Judaism, he hates. It is true ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 119:126",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " may be also explained: it is time that Jahve should act, i.e., interpose judicially; but this thought is foreign to the context, and affords no equally close union for על־כן; moreover it ought then to have been accented עת לעשׂות ליהוה. On כּל־פּקּוּדי כל, \"all commands of every purport,\" cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 29:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and more as to form, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 8:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 44:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The expression is purposely thus heightened; and the correction כל־פקודיך (Ewald, Olshausen, and Hupfeld) is also superfluous, because the reference of what is said to the God of revelation is self-evident in this connection. ",
        "children": []
      }
    ]
  }
]