[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(2) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I think myself happy, king Agrippa.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—We note the characteristic union of frankness and courtesy. He will not flatter a prince whose character, he must have known, did not deserve praise, but he recognises that it was well for him that he stood before one who was not ignorant of the relations of Sadducees and Pharisees on the great question of the Resurrection, and of the expectations which both parties alike cherished as to the coming of a Messiah, and the belief, which some at least of the latter cherished (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 15:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 21:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), that their hopes had been fulfilled in Christ.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Because I shall answer.—Strictly, because I am about to make my defence, or apologia.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Because I shall answer.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Strictly, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "because I am",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "about to make my defence, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "or ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "apologia.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "26:1-11 Christianity teaches us to give a reason of the hope that is in us, and also to give honour to whom honour is due, without flattery or fear of man. Agrippa was well versed in the Scriptures of the Old Testament, therefore could the better judge as to the controversy about Jesus being the Messiah. Surely ministers may expect, when they preach the faith of Christ, to be heard patiently. Paul professes that he still kept to all the good in which he was first educated and trained up. See here what his religion was. He was a moralist, a man of virtue, and had not learned the arts of the crafty, covetous Pharisees; he was not chargeable with any open vice and profaneness. He was sound in the faith. He always had a holy regard for the ancient promise made of God unto the fathers, and built his hope upon it. The apostle knew very well that all this would not justify him before God, yet he knew it was for his reputation among the Jews, and an argument that he was not such a man as they represented him to be. Though he counted this but loss, that he might win Christ, yet he mentioned it when it might serve to honour Christ. See here what Paul's religion is; he has not such zeal for the ceremonial law as he had in his youth; the sacrifices and offerings appointed by that, are done away by the great Sacrifice which they typified. Of the ceremonial cleansings he makes no conscience, and thinks the Levitical priesthood is done away in the priesthood of Christ; but, as to the main principles of his religion, he is as zealous as ever. Christ and heaven, are the two great doctrines of the gospel; that God has given to us eternal life, and this life is in his Son. These are the matter of the promise made unto the fathers. The temple service, or continual course of religious duties, day and night, was kept up as the profession of faith in the promise of eternal life, and in expectation of it. The prospect of eternal life should engage us to be diligent and stedfast in all religious exercises. Yet the Sadducees hated Paul for preaching the resurrection; and the other Jews joined them, because he testified that Jesus was risen, and was the promised Redeemer of Israel. Many things are thought to be beyond belief, only because the infinite nature and perfections of Him that has revealed, performed, or promised them, are overlooked. Paul acknowledged, that while he continued a Pharisee, he was a bitter enemy to Christianity. This was his character and manner of life in the beginning of his time; and there was every thing to hinder his being a Christian. Those who have been most strict in their conduct before conversion, will afterwards see abundant reason for humbling themselves, even on account of things which they then thought ought to have been done.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "I think myself happy - I esteem it a favor and a privilege to be permitted to make my defense before one acquainted with Jewish customs and opinions. His defense, on former occasions, had been before Roman magistrates, who had little acquaintance with the opinions and customs of the Jews; who were not disposed to listen to the discussion of the points of difference between him and them, and who looked upon all their controversies with contempt. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 24:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". They were, therefore, little qualified to decide a question which was closely connected with the Jewish customs and doctrines; and Paul now rejoiced to know that he was before one who, from his acquaintance with the Jewish customs and belief, would be able to appreciate his arguments. Paul was not now on his trial, but he was to defend himself, or state his cause, so that Agrippa might be able to aid Festus in transmitting a true account of the case to the Roman emperor. It was his interest and duty, therefore, to defend himself as well as possible, and to put him in possession of all the facts in the case. His defense is, consequently, made up chiefly of a most eloquent statement of the facts just as they had occurred.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I shall answer - I shall be permitted to make a statement, or to defend myself.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Touching ... - Respecting.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Whereof I am accused of the Jews - By the Jews. The matters of the accusation were his being a mover of sedition, a ringleader of the Christians, and a profaner of the temple, Acts 24:5-6. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Whereof I am accused of the Jews - By the Jews. The matters of the accusation were his being a mover of sedition, a ringleader of the Christians, and a profaner of the temple, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 24:5-6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "CHAPTER 26",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ac 26:1-32. Paul's Defense of Himself before King Agrippa, Who Pronounces Him Innocent, but Concludes That the Appeal to Cæsar Must Be Carried Out.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This speech, though in substance the same as that from the fortress stairs of Jerusalem (Ac 22:1-29), differs from it in being less directed to meet the charge of apostasy from the Jewish faith, and giving more enlarged views of his remarkable change and apostolic commission, and the divine support under which he was enabled to brave the hostility of his countrymen.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1-3. Agrippa said—Being a king he appears to have presided.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Paul stretched forth the hand—chained to a soldier (Ac 26:29, and see on [2114]Ac 12:6).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I think myself happy; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Paul thought it to be his advantage to speak before Agrippa, who could not be unacquainted with the law or the prophets, by which St. Paul would have his case determined. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Before thee; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " though Agrippa was not as judge in this place, yet his opinion and judgment could not but prevail much with Festus. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "I think myself happy, King Agrippa,.... This was an handsome and artificial way of introducing his defense, and of gaining the affection and attention of the king, and yet was not a mere compliment; for it had been his unhappiness hitherto, that his case was not understood; neither Lysias the chief captain, nor the governors Felix and Festus, knew anything of the rites and customs of the Jews, and could not tell what to make of the questions of their law, of which Paul was accused: but it was otherwise with Agrippa, he was master of them, and this the apostle looked upon as a circumstance in his own favour: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "because I shall answer for myself this day before thee; not before him as a judge, for Festus was judge, but in his presence; and he being versed in things of this kind, was capable of informing, counselling, directing, and assisting the judge, in what was proper to be done; wherefore it was an advantage to the apostle to plead his own cause, and vindicate himself before such a person from the charges exhibited against him: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "touching all the things whereof I am accused of the Jews; such as violation of the law, profanation of the temple, contempt of the people of the Jews and their customs, and of blasphemy, and sedition; all which he was able to clear himself from, and doubted not but he should do it to the entire satisfaction of the king. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "touching all the things whereof I am accused of the Jews; such as violation of the law, profanation of the temple, contempt of the people of the Jews and their customs, and of blasphemy, and sedition; all which he was able to clear himself from, and doubted not but he should do it to the entire satisfaction of the king. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "{1} I think myself happy, king Agrippa, because I shall answer for myself this day before thee touching all the things whereof I am accused of the Jews:",
        "children": [
          {
            "element": "span",
            "class": "cverse3",
            "text": "{1}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " I think myself happy, king Agrippa, because I shall answer for myself this day before thee touching all the things whereof I am accused of the Jews:",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) To have a skilful judge is a great and singular gift of God.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 26:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐπὶ σοῦ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 24:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐγκαλοῦμαι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", see on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 19:38",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὑπὸ Ἰουδ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".: “by Jews” simply (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 25:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and therefore he is glad to address one acquainted with Jewish customs, but see on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 26:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἥγημαι ἐμαυτὸν μακ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".: only here by Luke in this sense, but frequently so used by St. Paul in his Epistles eleven times, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf., e.g.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Php 3:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Timothy 6:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". St. Paul too commences with a “captatio benevolentiæ,” “sed absque adulatione,” Blass: “and yet had he been conscious of guilt, he should have feared being tried in the presence of one who knew all the facts; but this is a mark of a clear conscience, not to shrink from a judge who has an accurate knowledge of the circumstances, but even to rejoice and to call himself happy,” Chrys., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Hom.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", lii.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I think myself happy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Because Agrippa was sure to understand much of the feeling imported into the case which would be entirely obscure to a Roman magistrate. Paul would thus be able to make his position clear, and get it explained through Agrippa to the Roman authorities.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "because I shall answer for myself",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] As in the previous verse, “that I am to make my defence.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 26:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Περὶ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "concerning",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Paul both refutes the charge of the Jews, and, under the impulse of faith, says more. This, the last extant speech of Paul, is fuller than the others, and worthy of his spiritual increase in attainments.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὑπὸ Ἰουδαίων",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") He does not add the article [not “by ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Jews,” but “by Jews”]: for it was not all the Jews universally who were accusing Paul.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "βασιλεῦ Ἀγρίππα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "King Agrippa",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") The address in the second person has great force, especially when it is Singular, and when the proper name is used: ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 26:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἥγημαι ἐμαυτὸν μακάριον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I count myself happy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") I congratulate myself on the fact.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 2.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "- That I am to make my",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " defense ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "before thee this day",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "because I shall answer for myself this day before thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", A.V.; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "by",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for of, A.V. Acts 26:2",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Happy (μακάριον)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "See on blessed, Matthew 5:3.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See on blessed, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 5:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Answer (ἀπολογεῖσθαι)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "See on 1 Peter 3:15. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Peter 3:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      }
    ]
  }
]