[{"header":"Abijam rules Judah"},{"num":15,"verse":"Abijam became king of Judah in the eighteenth year of King Jeroboam, Nebat’s son."},{"num":2,"verse":"He ruled for three years in Jerusalem. His mother’s name was Maacah, and she was Abishalom’s daughter."},{"num":3,"verse":"Abijam followed all the sinful ways of his father before him. He didn’t follow the Lord his God with all his heart like his ancestor David."},{"num":4,"verse":"Even so, on account of David, the Lord his God gave Abijam a lamp in Jerusalem by supporting his son who succeeded him and by preserving Jerusalem."},{"num":5,"verse":"This was because David did the right thing in the Lord’s eyes. David didn’t deviate from anything the Lord commanded him throughout his life—except in the matter of Uriah the Hittite."},{"num":6,"verse":"There was war between Rehoboam and Jeroboam as long as Abijam lived."},{"num":7,"verse":"The rest of Abijam’s deeds and all that he did, aren’t they written in the official records of Judah’s kings? There was war between Abijam and Jeroboam."},{"num":8,"verse":"Abijam lay down with his ancestors; he was buried in David’s City. His son Asa succeeded him as king."},{"header":"Asa rules Judah"},{"num":9,"verse":"In the twentieth year of Israel’s King Jeroboam, Asa became king of Judah."},{"num":10,"verse":"He ruled in Jerusalem for forty-one years. His grandmother’s name was Maacah; she was Abishalom’s daughter."},{"num":11,"verse":"Asa did the right things in the Lord’s eyes, just like his father David."},{"num":12,"verse":"He removed the consecrated workers from the land, and he did away with all the worthless idols that his predecessors had made."},{"num":13,"verse":"He even removed his grandmother Maacah from the position of queen mother because she had made an image of Asherah. Asa cut down her image and burned it in the Kidron Valley."},{"num":14,"verse":"Though the shrines weren’t eliminated, nevertheless Asa remained committed with all his heart to the Lord throughout his life."},{"num":15,"verse":"He brought into the Lord’s temple the silver and gold equipment that he and his father had dedicated."},{"num":16,"verse":"There was war between Asa and Israel’s King Baasha throughout their lifetimes."},{"num":17,"verse":"Israel’s King Baasha attacked Judah and fortified Ramah to prevent Judah’s King Asa from moving into that area."},{"num":18,"verse":"Asa took all the silver and gold that remained in the treasuries of the Lord’s temple and the royal palace, and he gave them to his officials. Then King Asa sent them with the following message to Aram’s King Ben-hadad, Tabrimmon’s son and Hezion’s grandson, who ruled from Damascus:"},{"num":19,"verse":"“Let’s make a covenant similar to the one between our fathers. Since I have already sent you a gift of silver and gold, break your covenant with Israel’s King Baasha so that he will leave me alone.”"},{"num":20,"verse":"Ben-hadad agreed with King Asa and sent his army commanders against the cities of Israel, attacking Ijon, Dan, Abel-beth-maacah, and all Chinneroth, along with all the land of Naphtali."},{"num":21,"verse":"As soon as Baasha learned this, he stopped building Ramah and stayed in Tirzah."},{"num":22,"verse":"King Asa issued an order to every Judean without exception: all the people carried away the stone and timber that Baasha was using to build Ramah, and King Asa used it to build Geba of Benjamin and Mizpah."},{"num":23,"verse":"The rest of Asa’s deeds, his strength, and all that he did, as well as the towns that he built, aren’t they written in the official records of Judah’s kings? When he was old, Asa developed a severe foot disease."},{"num":24,"verse":"He died and was buried with his ancestors in David’s City. His son Jehoshaphat succeeded him as king."},{"header":"Nadab rules Israel"},{"num":25,"verse":"Jeroboam’s son Nadab became king of Israel in the second year of Judah’s King Asa. He ruled over Israel for two years."},{"num":26,"verse":"He did evil in the Lord’s eyes by walking in the way of his father Jeroboam and the sin Jeroboam had caused Israel to commit."},{"num":27,"verse":"Baasha, Ahijah’s son from the house of Issachar, plotted against him and attacked him at Gibbethon, which belonged to the Philistines. Nadab and all Israel were laying siege against Gibbethon."},{"num":28,"verse":"Baasha killed Nadab in the third year of Judah’s King Asa and ruled in Nadab’s place."},{"num":29,"verse":"When he became king, Baasha attacked the entire house of Jeroboam. He didn’t allow any living person to survive in Jeroboam’s family; he wiped them out according to the Lord’s word spoken by the Lord’s servant Ahijah of Shiloh."},{"num":30,"verse":"This happened because of Jeroboam’s sins that he committed and that he caused Israel to commit, and because he angered the Lord, Israel’s God."},{"num":31,"verse":"The rest of Nadab’s deeds and all that he did, aren’t they written in the official records of Israel’s kings?"},{"num":32,"verse":"There was war between Asa and Israel’s King Baasha throughout their lifetimes."},{"header":"Baasha rules Israel"},{"num":33,"verse":"In the third year of Judah’s King Asa, Baasha, Ahijah’s son, became king over all Israel. He ruled in Tirzah for twenty-four years."},{"num":34,"verse":"He did evil in the Lord’s eyes by walking in Jeroboam’s ways and the sin he had caused Israel to commit."}]