[{"header":"Abijah, King of Judah"},{"num":15,"verse":"Abijah became the new king of Judah during the 18th year that Jeroboam son of Nebat ruled Israel."},{"num":2,"verse":"Abijah ruled in Jerusalem for three years. His mother’s name was Maacah. She was Absalom’s daughter."},{"num":3,"verse":"He did all the same sins that his father before him had done. Abijah was not faithful to the Lord his God. In this way he was not like his grandfather, David."},{"num":4,"verse":"But for David’s sake, the Lord gave Abijah a kingdom in Jerusalem and allowed him to have a son. He also kept Jerusalem safe."},{"num":5,"verse":"David had always done what the Lord said was right. He had always obeyed his commands. The only time David did not obey the Lord was when he sinned against Uriah the Hittite."},{"num":6,"verse":"Rehoboam and Jeroboam were always fighting against each other."},{"num":7,"verse":"The rest of what Abijah did is written in the book, The History of the Kings of Judah."},{"num":8,"verse":"When Abijah died, he was buried in the City of David. Abijah’s son Asa became the new king after him."},{"header":"Asa, King of Judah"},{"num":9,"verse":"During Jeroboam’s 20th year as king over Israel, Asa became king of Judah."},{"num":10,"verse":"He ruled in Jerusalem for 41 years. His grandmother’s name was Maacah, and she was the daughter of Absalom."},{"num":11,"verse":"Asa did what the Lord said is right, as his ancestor David did."},{"num":12,"verse":"During Asa’s time there were men who served other gods by selling their bodies for sex. Asa forced them to leave the country. He took away the idols that his ancestors had made."},{"num":13,"verse":"King Asa also took away the right of his mother Maacah to be queen mother. He did this because she had set up one of those awful Asherah poles. Asa cut down the pole and burned it in the Kidron Valley."},{"num":14,"verse":"Asa did not destroy the high places, even though he was faithful to the Lord all his life."},{"num":15,"verse":"Asa and his father had given some special gifts to God. Asa put these gifts of gold, silver, and other things in the Lord’s Temple."},{"num":16,"verse":"The whole time that King Asa was king of Judah, he fought a war against King Baasha of Israel."},{"num":17,"verse":"Once Baasha attacked Judah and then built up the city of Ramah to keep Asa from leaving Judah on any kind of military campaign."},{"num":18,"verse":"So Asa took gold and silver from the treasuries of the Lord’s Temple and the king’s palace. He gave it to his officials and sent them to King Ben-Hadad of Aram. Ben-Hadad was the son of Tabrimmon. Tabrimmon was the son of Hezion. Damascus was Ben-Hadad’s capital city."},{"num":19,"verse":"Asa sent this message: “My father and your father had a peace agreement. Now I want to make a peace agreement with you. I am sending you this gift of gold and silver. Please break your treaty with King Baasha of Israel and make him leave us alone.”"},{"num":20,"verse":"King Ben-Hadad made the agreement with King Asa and sent his army to fight against the Israelite towns of Ijon, Dan, Abel Beth Maacah, the towns near Lake Galilee, and the area of Naphtali."},{"num":21,"verse":"When Baasha heard about these attacks, he stopped building up Ramah and went back to Tirzah."},{"num":22,"verse":"Then King Asa gave an order to all the men in Judah. Everyone had to help. They had to go to Ramah and carry out all the stone and wood that Baasha was using to build up the city. They carried the material to Geba in Benjamin and to Mizpah and used it to strengthen those two cities."},{"num":23,"verse":"All the other things about Asa—the great things he did and the cities he built—are written in the book, The History of the Kings of Judah. When Asa became old, his feet became infected."},{"num":24,"verse":"He died and was buried in the City of David, his ancestor. Then Asa’s son Jehoshaphat became the new king after him."},{"header":"Nadab, King of Israel"},{"num":25,"verse":"During Asa’s second year as king of Judah, Jeroboam’s son Nadab became king of Israel. Nadab ruled over Israel for two years."},{"num":26,"verse":"He did what the Lord said was wrong. He sinned just as his father Jeroboam did when he caused the Israelites to sin."},{"num":27,"verse":"Baasha was the son of Ahijah. They were from the tribe of Issachar. Baasha made a plan to kill King Nadab. Nadab and all Israel were fighting against the Philistine town of Gibbethon. And that is where Baasha killed Nadab."},{"num":28,"verse":"This happened during Asa’s third year as king of Judah. So Baasha became the next king of Israel."},{"header":"Baasha, King of Israel"},{"num":29,"verse":"When Baasha became the new king, he killed everyone in Jeroboam’s family. He left no one in Jeroboam’s family alive. This happened just as the Lord said it would when he spoke through his servant Ahijah at Shiloh."},{"num":30,"verse":"This happened because King Jeroboam had committed many sins and had caused the Israelites to sin. This made the Lord, the God of Israel, very angry."},{"num":31,"verse":"The other things that Nadab did are written in the book, The History of the Kings of Israel."},{"num":32,"verse":"All during the time that Baasha ruled over Israel, he was fighting wars against King Asa of Judah."},{"num":33,"verse":"Ahijah’s son Baasha became king of Israel during the third year that Asa ruled over Judah. Baasha ruled in Tirzah for 24 years,"},{"num":34,"verse":"but he did what the Lord said was wrong. He did the same sins that Jeroboam had done that caused the Israelites to sin."}]