[{"header":"Abijah King of Judah"},{"num":15,"verse":"Abijah became king of Judah. It was in the 18th year of Jeroboam’s rule over Israel. Jeroboam was the son of Nebat. "},{"num":2,"verse":"Abijah ruled in Jerusalem for three years. His mother’s name was Maakah. She was Abishalom’s daughter."},{"num":3,"verse":"Abijah committed all the sins his father had committed before him. Abijah didn’t obey the Lord his God with all his heart. He didn’t do what King David had done. "},{"num":4,"verse":"But the Lord still kept the lamp of Abijah’s kingdom burning brightly in Jerusalem. He did it by giving him a son to be the next king after him. He also did it by making Jerusalem strong. The Lord did those things because of David. "},{"num":5,"verse":"David had done what was right in the sight of the Lord. He had kept all the Lord’s commands. He had obeyed them all the days of his life. But he hadn’t obeyed the Lord in the case of Uriah, the Hittite."},{"num":6,"verse":"There was war between Abijah and Jeroboam all through Abijah’s life. "},{"num":7,"verse":"The other events of Abijah’s rule are written down. Everything he did is written down. All these things are written in the official records of the kings of Judah. There was war between Abijah and Jeroboam. "},{"num":8,"verse":"Abijah joined the members of his family who had already died. He was buried in the City of David. Abijah’s son Asa became the next king after him."},{"header":"Asa King of Judah"},{"num":9,"verse":"Asa became king of Judah. It was in the 20th year that Jeroboam was king of Israel. "},{"num":10,"verse":"Asa ruled in Jerusalem for 41 years. His grandmother’s name was Maakah. She was Abishalom’s daughter."},{"num":11,"verse":"Asa did what was right in the sight of the Lord. That’s what King David had done. "},{"num":12,"verse":"Asa threw out of the land the male prostitutes who were at the temples. He got rid of all the statues of gods made by his people of long ago. "},{"num":13,"verse":"He even removed his grandmother Maakah from her position as queen mother. That’s because she had made a pole used to worship the female god named Asherah. The Lord hated it. So Asa cut it down. He burned it in the Kidron Valley. "},{"num":14,"verse":"Asa didn’t remove the high places from Israel. But he committed his whole life completely to the Lord. "},{"num":15,"verse":"He and his father had set apart silver, gold and other things to the Lord. Asa brought them into the Lord’s temple."},{"num":16,"verse":"There was war between Asa and Baasha, the king of Israel. It lasted the whole time they were kings. "},{"num":17,"verse":"Baasha was king of Israel. He marched out against Judah. Baasha built up the walls of Ramah. He did it to keep people from leaving or entering the territory of Asa, the king of Judah."},{"num":18,"verse":"Asa took all the silver and gold left among the treasures of the Lord’s temple and his own palace. He put his officials in charge of it. He sent the officials to Ben-Hadad. Ben-Hadad was king of Aram. He was ruling in Damascus. He was the son of Tabrimmon and the grandson of Hezion. "},{"num":19,"verse":"“Let’s make a peace treaty between us,” Asa said. “My father and your father had made a peace treaty between them. Now I’m sending you a gift of silver and gold. So break your treaty with Baasha, the king of Israel. Then he’ll go back home.”"},{"num":20,"verse":"Ben-Hadad agreed with King Asa. He sent his army commanders against the towns of Israel. He captured Ijon, Dan, Abel Beth Maakah and the whole area of Kinnereth in addition to Naphtali. "},{"num":21,"verse":"Baasha heard about it. So he stopped building up Ramah. He went back home to Tirzah. "},{"num":22,"verse":"Then King Asa gave an order to all the men of Judah. Everyone was required to help. They carried away from Ramah the stones and wood Baasha had been using there. King Asa used them to build up Geba in the territory of Benjamin. He also used them to build up Mizpah."},{"num":23,"verse":"All the other events of Asa’s rule are written down, including the cities he built. Everything he did is written in the official records of the kings of Judah. But when Asa became old, his feet began to give him trouble. "},{"num":24,"verse":"He joined the members of his family who had already died. He was buried in his family tomb. It was in the city of King David. Asa’s son Jehoshaphat became the next king after him."},{"header":"Nadab King of Israel"},{"num":25,"verse":"Nadab became king of Israel. It was in the second year that Asa was king of Judah. Nadab ruled over Israel for two years. He was the son of Jeroboam. "},{"num":26,"verse":"Nadab did what was evil in the sight of the Lord. He lived the way his father had lived. He committed the same sin his father Jeroboam had caused Israel to commit."},{"num":27,"verse":"Baasha was from the tribe of Issachar. He was the son of Ahijah. Baasha made plans against Nadab and struck him down at Gibbethon. It was a Philistine town. Baasha struck him down while Nadab and all the men of Israel were getting ready to attack Gibbethon. "},{"num":28,"verse":"He killed Nadab in the third year that Asa was king of Judah. Baasha became the next king after Nadab."},{"num":29,"verse":"As soon as Baasha became king, he killed Jeroboam’s whole family. He didn’t leave any of them alive. He destroyed every one of them. He did what the Lord had said would happen. The Lord had spoken that message through his servant Ahijah from Shiloh. "},{"num":30,"verse":"The Lord judged Jeroboam’s family because of the sins Jeroboam had committed. He had also caused Israel to commit those same sins. He had made the Lord very angry. The Lord is the God of Israel."},{"num":31,"verse":"The other events of Nadab’s rule are written down. Everything he did is written in the official records of the kings of Israel. "},{"num":32,"verse":"There was war between Asa and Baasha, the king of Israel. It lasted the whole time they were kings."},{"header":"Baasha King of Israel"},{"num":33,"verse":"Baasha became king of Israel in Tirzah. It was in the third year that Asa was king of Judah. Baasha ruled for 24 years. He was the son of Ahijah. "},{"num":34,"verse":"Baasha did what was evil in the sight of the Lord. He lived the way Jeroboam had lived. He committed the same sin Jeroboam had caused Israel to commit."}]