[{"num":15,"verse":"Now in the eighteenth year of King Jeroboam, son of Nebat, Abijam became king over Judah. "},{"num":2,"verse":"He reigned three years in Jerusalem. His mother’s name was Maacah the daughter of Abishalom. "},{"num":3,"verse":"He walked in all the sins of his father which he had done before him; and his heart was not wholly devoted to Adonai his God, like the heart of his father David. "},{"num":4,"verse":"Nevertheless, for David’s sake, Adonai his God gave him a lamp in Jerusalem, raising up his son after him and establishing Jerusalem. "},{"num":5,"verse":"For David did what was right in Adonai’s eyes and did not turn aside from anything that He commanded him all the days of his life, except in the matter of Uriah the Hittite."},{"num":6,"verse":"As there had been war between Rehoboam and Jeroboam all the days of his life, "},{"num":7,"verse":"so there was war between Abijam and Jeroboam. The rest of the deeds of Abijam and all that he did, are they not written in the Book of the Chronicles of the Kings of Judah? "},{"num":8,"verse":"Then Abijam slept with his fathers so they buried him in the city of David, and his son Asa became king in his place."},{"header":"Asa Starts Out Right"},{"num":9,"verse":"In the twentieth year of King Jeroboam of Israel, Asa began to reign over Judah. "},{"num":10,"verse":"He reigned 41 years in Jerusalem; his mother’s name was Maacah the daughter of Abishalom. "},{"num":11,"verse":"Now Asa did what was right in Adonai’s eyes, like his father David. "},{"num":12,"verse":"He also expelled the male prostitutes from the land and removed all the idols that his fathers had made. "},{"num":13,"verse":"Also he deposed his mother Maacah from being queen mother, because she had made an abominable image as an Asherah pole. So Asa cut down her image and burned it in the Kidron Valley. "},{"num":14,"verse":"But they did not take away the high places."},{"num":15,"verse":"He brought into the House of Adonai the consecrated things of his father as well as his own consecrated things of silver, gold, and utensils."},{"num":16,"verse":"Now there was war between Asa and King Baasa of Israel all their days. "},{"num":17,"verse":"King Baasa of Israel marched against Judah, and he built up Ramah to prevent anyone from going out or coming in to King Asa of Judah. "},{"num":18,"verse":"Then Asa took all the silver and the gold that were left in the treasuries of Adonai’s House and the treasuries of the royal palace, and delivered them into the hand of his officials. King Asa sent them to Ben-Hadad son of Tabrimmon, son of Hezion, king of Aram, who resided in Damascus, saying: "},{"num":19,"verse":"“Let there be a treaty between me and you, as it was between my father and your father. I have just sent you a present of silver and gold; go, break your treaty with King Baasa of Israel, so that he may withdraw from me.”"},{"num":20,"verse":"So Ben-Hadad listened to King Asa and sent the commanders of his armies against the cities of Israel, conquering Ijon, Dan, Abel-beth-maacah and all Chinneroth, as well as all the land of Naphtali. "},{"num":21,"verse":"When Baasa heard it, he stopped fortifying Ramah and remained in Tirzah. "},{"num":22,"verse":"Then King Asa made a proclamation to all Judah—none was exempted—and they carried away the stones of Ramah and its timber which Baasa had built. Then King Asa built Geba of Benjamin and Mizpah with them."},{"num":23,"verse":"Now the rest of all the deeds of Asa, all his might, all he did and the cities that he built—are they not written in the Book of the Chronicles of the Kings of Judah? But in his old age he was diseased in his feet. "},{"num":24,"verse":"And Asa slept with his fathers, and was buried with his fathers in the city of his father David, and his son Jehoshaphat became king his place."},{"header":"End of Jeroboam’s Line"},{"num":25,"verse":"Nadab son of Jeroboam began to reign over Israel in the second year of King Asa of Judah, and he reigned over Israel two years. "},{"num":26,"verse":"He also did what was evil in Adonai’s eyes, walking in the way of his father and in his sins that he caused Israel to commit. "},{"num":27,"verse":"Then Baasa son of Ahijah of the house of Issachar conspired against him, and Baasa struck him down at Gibbethon, which belonged to the Philistines, while Nadab and all Israel were besieging Gibbethon. "},{"num":28,"verse":"So Baasa slew him, in the third year of King Asa of Judah, and became king in his place. "},{"num":29,"verse":"As soon as he became king, he struck down all the household of Jeroboam. He did not spare Jeroboam anything with breath until he had destroyed him, just as was the word of Adonai that He spoke by the hand of His servant Ahijah the Shilonite, "},{"num":30,"verse":"because of the sins Jeroboam had committed and caused Israel to commit, by which he utterly provoked Adonai, God of Israel. "},{"num":31,"verse":"Now the rest of the deeds of Nadab and all he did—are they not written in the Book of the Chronicles of the Kings of Israel?"},{"num":32,"verse":"So there was war between Asa and King Baasa of Israel all their days. "},{"num":33,"verse":"In the third year of King Asa of Judah, Baasa son of Ahijah began to reign over all Israel in Tirzah, reigning 24 years. "},{"num":34,"verse":"He did what was evil in Adonai’s eyes, and followed the way of Jeroboam and the sin that he had made Israel commit."}]