[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(18) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Surely as Tabor is among the mountains . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Nebuchadnezzar in his high-towering greatness is compared to two of the most conspicuous mountains of Palestine, Tabor rising in solitary greatness 1,350 feet above the plain, Carmel 1,805 feet above the sea. So, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 22:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the king of Judah is compared to “Gilead and the head of Lebanon.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Jeremiah 46:18",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 46:18",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "As I live saith the king, whose name is the Lord of hosts ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— He, before whom the mightiest kings on earth, though gods to us, are but as grasshoppers; he hath said and sworn what follows; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Surely as Tabor, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — As surely as Tabor is among the mountains and Carmel by the sea, so surely shall the conqueror of Egypt come. Or, though Egypt were as inaccessible as the top of Tabor, and begirt with the sea like Carmel, yet the enemy should come upon her, and make an entire conquest of her. Houbigant paraphrases the clause thus, “As much as Tabor overtops all other mountains, so much shall the Chaldeans be superior to the Egyptians; and as the waves of the sea roar in vain at the foot of mount Carmel, so shall the Egyptians waves rage in vain.” Blaney understands the clause in nearly the same sense, observing, “Tabor and Carmel were two of the most considerable mountains in the land of Israel. Carmel formed the principal headland all along the sea-coast. Nebuchadnezzar is compared to these on account of his superiority over all others.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "46:13-28 Those who encroached on others, shall now be themselves encroached on. Egypt is now like a very fair heifer, not accustomed to the yoke of subjection; but destruction comes out of the north: the Chaldeans shall come. Comfort and peace are spoken to the Israel of God, designed to encourage them when the judgments of God were abroad among the nations. He will be with them, and only correct them in measure; and will not punish them with everlasting destruction from his presence.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "As Tabor is - Omit \"is.\" \"He shall come like a Tabor among the mountains, and like a Carmel by the sea.\" Tabor rises in the form of a truncated cone to the height of about 1,350 feet above the plain of Esdraelon, its total height above the sea level being 1,805 feet. Its shape and the wide extent of the plain around it make it a far more conspicuous object than other mountains in sight of equal elevation. Similarly, Carmel is a most commanding mountain, because it rises from the edge of the wide expanse of the Mediterranean. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "18. As the mountains Tabor and Carmel tower high above the other hills of Palestine, so Nebuchadnezzar (Jer 46:26) when he comes shall prove himself superior to all his foes. Carmel forms a bold promontory jutting out into the Mediterranean. Tabor is the higher of the two; therefore it is said to be \"among the mountains\"; and Carmel \"by the sea.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the King … Lord of hosts—(Jer 48:15); in contrast to \"Pharaoh king of Egypt … but a noise\" (Jer 46:17). God the true \"King … the Lord of hosts,\" shall cause Nebuchadnezzar to come. Whereas Pharaoh shall not come to battle at the time appointed, notwithstanding his boasts, Nebuchadnezzar shall come according to the prediction of the King, who has all hosts in His power, however ye Egyptians may despise the prediction.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " That is, he shall as certainly come and encompass you with his armies as Tabor is encompassed with mountains, and as Carmel is by the sea, or as Barak going down from Mount Tabor destroyed Sisera’s army, or as surely as the rain came which Elijah first discovered from Mount Carmel, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1 Kings 18:41,42",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 18:41",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",42",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". There are other guesses at the sense of this comparison, but the sense is undoubtedly no more than that Nebuchadnezzar should certainly come against Egypt, how vainly soever the Egyptians flattered themselves to the contrary, supposing the time past which the prophet spake of. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "As I live, saith the King, whose name is the Lord of hosts,.... A greater King than either Nebuchadnezzar or Pharaoh; the Lord of the armies of heaven and earth; and who has them all at his command and service; swears by his life, by himself, because he can swear by no greater, to the truth of what follows; for this is the form of an oath: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "surely, as Tabor is among the mountains, and as Carmel by the sea,  ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "so shall he come. Tabor is commonly said to be the mountain on which our Lord was transfigured; but that there is any just foundation for it is not certain. It was a mountain in Galilee, situated on the borders of the tribes of Issachar and Zebulun, Joshua 19:12; it was two leagues from Nazareth eastward (n); three miles from the lake of Gennesaret; ten miles from Diocaesarea to the east; and two days' journey from Jerusalem (o). Adrichomius (p) says it was a most beautiful mountain, situated in the midst of the plain of Galilee, remarkable for its roundness, and was about four miles or thirty furlongs high, abounding with vines, olives, and fruit trees, with which it was set all over; and gave to those at sea a most delightful sight at a considerable distance. Our countryman, Mr. Maundrell (q), who travelled up it, gives this account of it; that it ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "so shall he come. Tabor is commonly said to be the mountain on which our Lord was transfigured; but that there is any just foundation for it is not certain. It was a mountain in Galilee, situated on the borders of the tribes of Issachar and Zebulun, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 19:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; it was two leagues from Nazareth eastward (n); three miles from the lake of Gennesaret; ten miles from Diocaesarea to the east; and two days' journey from Jerusalem (o). Adrichomius (p) says it was a most beautiful mountain, situated in the midst of the plain of Galilee, remarkable for its roundness, and was about four miles or thirty furlongs high, abounding with vines, olives, and fruit trees, with which it was set all over; and gave to those at sea a most delightful sight at a considerable distance. Our countryman, Mr. Maundrell (q), who travelled up it, gives this account of it; that it ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"stands by itself in the plain of Esdraelon (the same the Scripture calls the valley of Jezreel); after a very laborious ascent (says he), which took up near an hour, we reached the highest part of the mountain: it has a plain area at top, most fertile and delicious; of an oval figure, extended about one furlong in breadth, and two in length: this area is enclosed with trees on all parts, except towards the south.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "It is called by the Septuagint, Josephus, and other writers, Itabyrium. Carmel is with great propriety called \"Carmel by the sea\"; it was situated on the border of the tribe of Asher; and near to it was the river Kishon, Joshua 19:26. So Mr. Maundrell (r) says, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "It is called by the Septuagint, Josephus, and other writers, Itabyrium. Carmel is with great propriety called \"Carmel by the sea\"; it was situated on the border of the tribe of Asher; and near to it was the river Kishon, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 19:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". So Mr. Maundrell (r) says, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"we arrived in two hours at that ancient river, the river Kishon, which cuts his way down the middle of the plain of Esdraelon; and then, continuing his course close by the side of Mount Carmel, falls into the sea at a place called Caypha;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "by which it appears that the mount was near the sea; and Pliny (s) calls it a promontory, and places it on the Phoenician shore; on which he says were the promontory Carmel, and a town upon the mountain of the same name, formerly called Ecbatana. Adrichomius (t) gives it the name of \"Carmel of the sea\"; and says it was a very high mountain, and woody, abounding with most noble vines, olives, fruit trees, and odoriferous herbs. So Josephus (u) makes mention of Carmel and the sea together; he says, the Zebulonites obtained land as far as the lake of Genezareth, contiguous to Carmel and the sea; and their being near to each other appears from a passage in the Jerusalem Talmud (w); says ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"R. Samuel Bar Chain Bar Judah, in the name of R. Chanina, when the orb of the sun begins to set, a man standing on Mount Carmel, and goes down and dips in the great sea (the Mediterranean sea), and goes up again, and eats his \"teruma\" (or offering), it is a presumption that he dipped in the daytime;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and which is also evident from the passage in 1 Kings 18:42; where Elijah and his servant are said to be on the top of Mount Carmel, and from thence he bid his servant look towards the sea: now these mountains so situated are taken notice of, either to show the manner of the king of Babylon's coming against Egypt; that as Tabor and Carmel were high mountains in the land of Israel, so should Nebuchadnezzar lift up his head on high, and come with great pride and haughtiness of spirit against the Egyptians; or rather the certainty of his coming, that he should come as sure as those mountains were in the places they were; or, best of all, the certainty of the destruction of the Egyptians, and the truth of this prophecy concerning it; though the Egyptians were as firm, and might think themselves as secure and as immovable, as the above mountains, yet should certainly come to ruin, and the word of God concerning it should stand as firm as they. To this sense agrees the Targum, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and which is also evident from the passage in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 18:42",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; where Elijah and his servant are said to be on the top of Mount Carmel, and from thence he bid his servant look towards the sea: now these mountains so situated are taken notice of, either to show the manner of the king of Babylon's coming against Egypt; that as Tabor and Carmel were high mountains in the land of Israel, so should Nebuchadnezzar lift up his head on high, and come with great pride and haughtiness of spirit against the Egyptians; or rather the certainty of his coming, that he should come as sure as those mountains were in the places they were; or, best of all, the certainty of the destruction of the Egyptians, and the truth of this prophecy concerning it; though the Egyptians were as firm, and might think themselves as secure and as immovable, as the above mountains, yet should certainly come to ruin, and the word of God concerning it should stand as firm as they. To this sense agrees the Targum, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"as this word stands firm, that Tabor is among the mountains, and Carmel in the sea, so shall his destruction come.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The words, according to the accents, may be better rendered, \"as Tabor among the mountains, and Carmel also, he shall come into the sea\" (x); that is, Pharaoh, though he lift up his head as high as Tabor and Carmel, he shall be brought low into the depths of the sea; into a most forlorn and deplorable condition, into a very low estate; and perhaps there may be an allusion to the ancient Pharaoh being drowned in the sea; and with this agrees the Syriac version, \"Pharaoh shall fall as the fragment of a mountain, and as Carmel, into the midst of the sea\"; compare with this Matthew 11:23. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The words, according to the accents, may be better rendered, \"as Tabor among the mountains, and Carmel also, he shall come into the sea\" (x); that is, Pharaoh, though he lift up his head as high as Tabor and Carmel, he shall be brought low into the depths of the sea; into a most forlorn and deplorable condition, into a very low estate; and perhaps there may be an allusion to the ancient Pharaoh being drowned in the sea; and with this agrees the Syriac version, \"Pharaoh shall fall as the fragment of a mountain, and as Carmel, into the midst of the sea\"; compare with this ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 11:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(n) Borchard, Breidenbach, &c. in Lightfoot, Chorograph. on John, vol. 2. p. 495. (o) Vid. Reland. Palestina Illustrata, l. 1, c, 51, 331, 383. (p) Theatrum Terrae Sanctae, Zabulon, No. 95. p. 143. (q) Journey from Aleppo to Jerusalem, p. 113, 114. Ed. 7. (r) Ib. p. 57. (s) Nat. Hist. l. 5. c. 19. (t) Ut supra (Theatrum Terrae Sanctae), Issachar, No. 19. p. 35. (u) Antiqu. l. 5. c. 1. sect. 22. (w) T. Bab. Hieros. Beracot, fol. 2. 2. (x)      \"quia sicut Tabor in montibus, et sicut Carmel (scil. in montibus est) ita in mare veniet\", Schmidt. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(n) Borchard, Breidenbach, &c. in Lightfoot, Chorograph. on John, vol. 2. p. 495. (o) Vid. Reland. Palestina Illustrata, l. 1, c, 51, 331, 383. (p) Theatrum Terrae Sanctae, Zabulon, No. 95. p. 143. (q) Journey from Aleppo to Jerusalem, p. 113, 114. Ed. 7. (r) Ib. p. 57. (s) Nat. Hist. l. 5. c. 19. (t) Ut supra (Theatrum Terrae Sanctae), Issachar, No. 19. p. 35. (u) Antiqu. l. 5. c. 1. sect. 22. (w) T. Bab. Hieros. Beracot, fol. 2. 2. (x)      \"quia sicut Tabor in montibus, et sicut Carmel (scil. in montibus est) ita in mare veniet\", Schmidt. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "As I live, saith the King, whose name is the LORD of hosts, Surely as Tabor is among the mountains, and as Carmel by the sea, so shall {p} he come.",
        "children": [
          {
            "element": "i",
            "class": "",
            "text": "As",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " I live, saith the King, whose name ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the LORD of hosts, Surely as Tabor ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " among the mountains, and as Carmel by the sea, ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "so",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " shall ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{p}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " he come.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(p) That is, that the Egyptians will be destroyed.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The foe (unnamed, but meaning Nebuchadnezzar, unless the passage is late, and Alexander the Great is intended; so Schmidt) shall resemble these mountains as standing out conspicuous. Tabor, as rising in the midst of an extensive plain, is more striking than even loftier hills, which have not its advantages in the way of position. Carmel (about 600 feet above the sea) stretches as a long bold promontory into the Mediterranean.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 18.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - The threat implied in ver. 17 is set forth more fully; he who speaks is a very different \"king\" from the fallen Pharaoh. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "As Tabor is among the mountains.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "  The sense is deformed by the insertion of \"is.\" The King of Babylon is compared to \"Tabor among the mountains and Carmel by the sea.\" Mount Tabor is a most prominent object, owing to the wide extent of the plain of Esdraelon, in which it is situated; and a similar remark applies to Mount Carmel. The view of Tabor differs considerably according to the point from which it is taken; but \"its true figure is an elongated oval\" (Thomson). Carmel, so called from the rich orchards and vineyards with which it was anciently adorned, is not lofty (being only about six hundred feet above the sea), but the form in which it breaks off towards the sea has a beauty of its own. It is now deprived of its rich forest and garden culture, but is still described as \"a glorious mountain.\" Jeremiah 46:18",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 46:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"they cry there\" is not to be referred to those who fled to their native land; the subject is undefined, and \"there\" refers to the place where one falls over the other, viz., Egypt. \"There they cry, 'Pharaoh the king of Egypt is שׁאון, desolation, destruction, ruin:' \" for this meaning, cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 25:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 40:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; the signification \"noise, bustle,\" is unsuitable here.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: The word שׁם has been read by the lxx and the Vulgate as if it had been שׁם, ὄνομα, nomen; accordingly the lxx render, καλέσατε τὸ ὄνομα Φαραὼ Νεχαὼ βασίλεως Αἰγύπτου Σαὼν  ̓Εσβεὶ  ̓Εμωήδ (or  ̓Εσβειὲ Μωὴδe'd); Vulgate, vocate nomen Pharaonis regis Aegypti: Tumultum adduxit tempus. This reading is preferred by J. D. Michaelis, Ewald, Hitzig, and Graf, with this difference, that Hitzig and Graf take only שׁאון as a name. Hence Ewald translates, \"They call Pharaoh's name 'Noise-which-a-wink-can-hush.' \" This rendering is decidedly false, for מועד nowhere has the sense of \"wink, nod,\" not even in Judges 20:38, where it means an agreement made. For the reading שׁם instead of שׁם there are no sufficient grounds, although such passages as Jeremiah 20:3 and Isaiah 30:7 may be adduced in support of the idea obtained by such a change in the word. The translation of the lxx is merely a reproduction of the Hebrew words by Greek letters, and shows that the translator did not know how to interpret them. The Vulgate rendering, tumultum adduxit tempus, is also devoid of meaning. Moreover, these translators have read קראוּ as the imperative קראוּ; if we reject this reading, as all moderns do, then we may also lay no weight on שׁם instead of שׁם. Besides, the meaning is not materially affected by this reading, for the giving of a name to a person merely expresses what he is or will be.)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: The word שׁם has been read by the lxx and the Vulgate as if it had been שׁם, ὄνομα, nomen; accordingly the lxx render, καλέσατε τὸ ὄνομα Φαραὼ Νεχαὼ βασίλεως Αἰγύπτου Σαὼν  ̓Εσβεὶ  ̓Εμωήδ (or  ̓Εσβειὲ Μωὴδe'd); Vulgate, vocate nomen Pharaonis regis Aegypti: Tumultum adduxit tempus. This reading is preferred by J. D. Michaelis, Ewald, Hitzig, and Graf, with this difference, that Hitzig and Graf take only שׁאון as a name. Hence Ewald translates, \"They call Pharaoh's name 'Noise-which-a-wink-can-hush.' \" This rendering is decidedly false, for מועד nowhere has the sense of \"wink, nod,\" not even in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 20:38",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where it means an agreement made. For the reading שׁם instead of שׁם there are no sufficient grounds, although such passages as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 20:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 30:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " may be adduced in support of the idea obtained by such a change in the word. The translation of the lxx is merely a reproduction of the Hebrew words by Greek letters, and shows that the translator did not know how to interpret them. The Vulgate rendering, tumultum adduxit tempus, is also devoid of meaning. Moreover, these translators have read קראוּ as the imperative קראוּ; if we reject this reading, as all moderns do, then we may also lay no weight on שׁם instead of שׁם. Besides, the meaning is not materially affected by this reading, for the giving of a name to a person merely expresses what he is or will be.)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The meaning of העביר המּועד also is disputed; it is quite inadmissible, however, to join the words with שׁאון, as Ewald does, for the purpose of making out a name. No suitable meaning can be extracted from them. Neither שׁאון nor המּועד can be the subject of העביר; the translation given by Schnurrer, \"devastation that goes beyond all bounds,\" is still more arbitrary than that of Ewald given in the note. Since the Hiphil העביר is never used except with a transitive meaning, the subject can be none else than Pharaoh; and the words העביר המּועד must be intended to give the reason for this becoming a desolation: they are thus to be rendered, \"he has allowed המּועד to pass by,\" not \"the precise place,\" as Rosenmller explains it (\"he did not stop in his flight at the place where the army could be gathered again, on the return\"), but \"the precise time.\" The reference, however, is not to the suitable time for action, for self-defence and for driving off the enemy (Grotius, C. B. Michaelis, Maurer, Umbreit), because the word does not mean suitable, convenient time, but appointed time. As Hitzig rightly perceived, the time meant is that within which the desolation might still be averted, and after which the judgment of God fell on him (Isaiah 10:25; Isaiah 30:18), - the time of grace which God had vouchsafed to him, so that Nebuchadnezzar did not at once, after the victory at Carchemish, invade and conquer Egypt. Pharaoh let this time pass by; because, instead of seeing in that defeat a judgment from God, he provoked the anger of Nebuchadnezzar by his repeated attacks on the Chaldean power, and brought on the invasion of Egypt by the king of Babylon (see above, p. 354). - In Jeremiah 46:18. there is laid down a more positive foundation for the threat uttered in Jeremiah 46:17. With an oath, the Lord announces the coming of the destroyer into Egypt. Like Tabor, which overtops all the mountains round about, and like Carmel, which looks out over the sea as if it were a watch-tower, so will he come, viz., he from whom proceeds the devastation of Egypt, the king of Babylon. the power of Nebuchadnezzar, in respect of its overshadowing all other kings, forms the point of comparison. Tabor has the form of a truncated cone. Its height is given at 1805 feet above the level of the sea, or 1350 from the surface of the plain below; it far surpasses in height all the hills in the vicinity, ad affords a wide prospect on every side; cf. Robinson's Phys. Geogr. of Palestine, p. 26f. Carmel stretches out in the form of a long ridge more than three miles wide, till it terminates on the shore of the Mediterranean Sea, as a bold, lofty promontory, which rises in an imposing manner at least 500 feet above the sea; cf. Robinson, p. 26f. Then the inhabitants of Egypt will be driven into exile. כּלי גולה .e, \"vessels of wandering;\" outfit for an exile, as in Ezekiel 12:3. \"Daughter of Egypt\" is not a personification of the country, whose inhabitants are the people, but of the population, which is viewed as the daughter of the country; it stands in apposition to יושׁבת, like בּתוּלת בּת מצרי, Jeremiah 46:11. For Noph, i.e., Memphis, the capital, is laid waste and burned, so as to lose its inhabitants. With Jeremiah 46:20 begins the second strophe, in which the fate impending on Egypt is still more plainly predicted.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The meaning of העביר המּועד also is disputed; it is quite inadmissible, however, to join the words with שׁאון, as Ewald does, for the purpose of making out a name. No suitable meaning can be extracted from them. Neither שׁאון nor המּועד can be the subject of העביר; the translation given by Schnurrer, \"devastation that goes beyond all bounds,\" is still more arbitrary than that of Ewald given in the note. Since the Hiphil העביר is never used except with a transitive meaning, the subject can be none else than Pharaoh; and the words העביר המּועד must be intended to give the reason for this becoming a desolation: they are thus to be rendered, \"he has allowed המּועד to pass by,\" not \"the precise place,\" as Rosenmller explains it (\"he did not stop in his flight at the place where the army could be gathered again, on the return\"), but \"the precise time.\" The reference, however, is not to the suitable time for action, for self-defence and for driving off the enemy (Grotius, C. B. Michaelis, Maurer, Umbreit), because the word does not mean suitable, convenient time, but appointed time. As Hitzig rightly perceived, the time meant is that within which the desolation might still be averted, and after which the judgment of God fell on him (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 10:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 30:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), - the time of grace which God had vouchsafed to him, so that Nebuchadnezzar did not at once, after the victory at Carchemish, invade and conquer Egypt. Pharaoh let this time pass by; because, instead of seeing in that defeat a judgment from God, he provoked the anger of Nebuchadnezzar by his repeated attacks on the Chaldean power, and brought on the invasion of Egypt by the king of Babylon (see above, p. 354). - In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 46:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". there is laid down a more positive foundation for the threat uttered in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 46:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". With an oath, the Lord announces the coming of the destroyer into Egypt. Like Tabor, which overtops all the mountains round about, and like Carmel, which looks out over the sea as if it were a watch-tower, so will he come, viz., he from whom proceeds the devastation of Egypt, the king of Babylon. the power of Nebuchadnezzar, in respect of its overshadowing all other kings, forms the point of comparison. Tabor has the form of a truncated cone. Its height is given at 1805 feet above the level of the sea, or 1350 from the surface of the plain below; it far surpasses in height all the hills in the vicinity, ad affords a wide prospect on every side; cf. Robinson's Phys. Geogr. of Palestine, p. 26f. Carmel stretches out in the form of a long ridge more than three miles wide, till it terminates on the shore of the Mediterranean Sea, as a bold, lofty promontory, which rises in an imposing manner at least 500 feet above the sea; cf. Robinson, p. 26f. Then the inhabitants of Egypt will be driven into exile. כּלי גולה .e, \"vessels of wandering;\" outfit for an exile, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 12:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". \"Daughter of Egypt\" is not a personification of the country, whose inhabitants are the people, but of the population, which is viewed as the daughter of the country; it stands in apposition to יושׁבת, like בּתוּלת בּת מצרי, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 46:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". For Noph, i.e., Memphis, the capital, is laid waste and burned, so as to lose its inhabitants. With ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 46:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " begins the second strophe, in which the fate impending on Egypt is still more plainly predicted.",
            "children": []
          }
        ]
      }
    ]
  }
]