[{"num":27,"verse":"1 Jeremiah at the commandment of the Lord sendeth bonds to the King of Judah and to the other Kings that were near, whereby they are monished to be subjects unto Nebuchadnezzar. 9 He warneth the people, and the Kings and rulers that they believe not false Prophets."},{"num":1,"verse":"In the beginning of the reign of Jehoiakim the son of Josiah King of Judah came this word unto Jeremiah from the Lord, saying,"},{"num":2,"verse":"Thus saith the Lord to me, Make thee bonds, and yokes, and put them upon thy neck,"},{"num":3,"verse":"And send them to the king of Edom, and to the king of Moab, and to the king of the Ammonites, and to the king of Tyre, and to the king of Sidon, by the hand of the messengers which come to Jerusalem unto Zedekiah the king of Judah,"},{"num":4,"verse":"And command them to say unto their masters, Thus saith the Lord of hosts the God of Israel, Thus shall ye say unto your masters,"},{"num":5,"verse":"I have made the earth, the man, and the beast that are upon the ground, by my great power, and by my outstretched arm, and have given it unto whom it pleased me."},{"num":6,"verse":"But now I have given all these lands into the hand of Nebuchadnezzar the king of Babel my servant, and the beasts of the field have I also given him to serve him."},{"num":7,"verse":"And all nations shall serve him, and his son, and his son’s son until the very time of his land come also: then many nations and great kings shall serve themselves of him."},{"num":8,"verse":"And the nation and kingdom which will not serve the same Nebuchadnezzar king of Babel, and that will not put their neck under the yoke of the king of Babel, the same nation will I visit saith the Lord, with the sword, and with the famine, and with the pestilence, until I have wholly given them into his hands."},{"num":9,"verse":"Therefore hear not your prophets nor your soothsayers, nor your dreamers, nor your enchanters, nor your sorcerers which say unto you thus, Ye shall not serve the king of Babel."},{"num":10,"verse":"For they prophesy a lie unto you to cause you to go far from your land, and that I should cast you out, and you should perish."},{"num":11,"verse":"But the nation that put their necks under the yoke of the king of Babel, and serve him, those will I let remain still in their own land, saith the Lord, and they shall occupy it, and dwell therein."},{"num":12,"verse":"¶ I spake also to Zedekiah king of Judah according to all these words, saying, Put your necks under the yoke of the king of Babel, and serve him and his people, that ye may live."},{"num":13,"verse":"Why will ye die, thou, and thy people by the sword, by the famine, and by the pestilence, as the Lord hath spoken against the nation, that will not serve the king of Babel?"},{"num":14,"verse":"Therefore hear not the words of the prophets that speak unto you, saying, Ye shall not serve the king of Babel: for they prophesy a lie unto you."},{"num":15,"verse":"For I have not sent them, saith the Lord, yet they prophesy a lie in my Name, that I might cast you out, and that ye might perish, both you, and the Prophets that prophesy unto you."},{"num":16,"verse":"Also I spake to the Priests, and to all this people, saying, Thus saith the Lord, Hear not the words of your prophets that prophesy unto you, saying, Behold, the vessels of the house of the Lord shall now shortly be brought again from Babel: for they prophesy a lie unto you."},{"num":17,"verse":"Hear them not, but serve the king of Babel, that ye may live: wherefore should this city be desolate?"},{"num":18,"verse":"But if they be Prophets, and if the word of the Lord be with them, let them entreat the Lord of hosts, that the vessels, which are left in the House of the Lord, and in the house of the king of Judah, and at Jerusalem, go not to Babel."},{"num":19,"verse":"For thus saith the Lord of hosts, concerning the pillars, and concerning the sea, and concerning the bases, and concerning the residue of the vessels that remain in this city,"},{"num":20,"verse":"Which Nebuchadnezzar King of Babel took not, when he carried away captive Jeconiah the son of Jehoiakim king of Judah from Jerusalem to Babel, with all the nobles of Judah, and Jerusalem."},{"num":21,"verse":"For thus saith the Lord of hosts the God of Israel, concerning the vessels that remain in the house of the Lord, and in the house of the king of Judah, and at Jerusalem,"},{"num":22,"verse":"They shall be brought to Babel, and there they shall be until the day that I visit them, saith the Lord: then will I bring them up, and restore them unto this place."}]