[{"header":"Being Led into Sex Sins"},{"num":5,"verse":"My son, listen to my wisdom. Turn your ear to my understanding. "},{"num":2,"verse":"So you may know what is good thinking, and your lips may keep much learning. "},{"num":3,"verse":"For the lips of a strange woman are as sweet as honey. Her talk is as smooth as oil. "},{"num":4,"verse":"But in the end she is as bitter tasting as wormwood, and as sharp as a sword that cuts both ways. "},{"num":5,"verse":"Her feet go down to death. Her steps take hold of hell. "},{"num":6,"verse":"She does not think about the path of life. Her ways go this way and that, and she does not know it."},{"num":7,"verse":"Now then, my sons, listen to me. Do not turn away from the words of my mouth. "},{"num":8,"verse":"Keep far away from her. Do not go near the door of her house. "},{"num":9,"verse":"If you do, you would give your strength to others, and your years to those without loving-kindness. "},{"num":10,"verse":"Strangers would be filled with your strength, and the fruits of your work would go to a strange house. "},{"num":11,"verse":"You would cry inside yourself when your end comes, when your flesh and body are wasted away. "},{"num":12,"verse":"You would say, “How I have hated teaching! My heart hated strong words! "},{"num":13,"verse":"I have not listened to the voice of my teachers. I have not turned my ear to those who would teach me. "},{"num":14,"verse":"Now I have a bad name in the meeting place of the people.”"},{"num":15,"verse":"Drink water from your own pool, flowing water from your own well. "},{"num":16,"verse":"Should the waters from your well flow away, rivers of water in the streets? "},{"num":17,"verse":"Let them be yours alone, and not for strangers with you. "},{"num":18,"verse":"Let your well be honored, and be happy with the wife you married when you were young. "},{"num":19,"verse":"Let her be like a loving, female deer. Let her breasts please you at all times. Be filled with great joy always because of her love. "},{"num":20,"verse":"My son, why should you be carried away with a sinful woman and fall into the arms of a strange woman? "},{"num":21,"verse":"For the ways of a man are seen by the eyes of the Lord, and He watches all his paths. "},{"num":22,"verse":"His own sins will trap the sinful. He will be held with the ropes of his sin. "},{"num":23,"verse":"He will die for want of teaching, and will go the wrong way because of the greatness of his foolish ways."}]