[{"num":12,"verse":"True, there is nothing to be gained by it, but [as I am obliged] to boast, I will go on to visions and revelations of the Lord."},{"num":2,"verse":"I know a man in Christ who fourteen years ago—whether in the body or out of the body I do not know, God knows—was caught up to the third heaven."},{"num":3,"verse":"And I know that this man—whether in the body or away from the body I do not know, God knows—"},{"num":4,"verse":"Was caught up into paradise, and he heard utterances beyond the power of man to put into words, which man is not permitted to utter."},{"num":5,"verse":"Of this same [man’s experiences] I will boast, but of myself (personally) I will not boast, except as regards my infirmities (my weaknesses)."},{"num":6,"verse":"Should I desire to boast, I shall not be a witless braggart, for I shall be speaking the truth. But I abstain [from it] so that no one may form a higher estimate of me than [is justified by] what he sees in me or hears from me."},{"num":7,"verse":"And to keep me from being puffed up and too much elated by the exceeding greatness (preeminence) of these revelations, there was given me a thorn (a splinter) in the flesh, a messenger of Satan, to rack and buffet and harass me, to keep me from being excessively exalted."},{"num":8,"verse":"Three times I called upon the Lord and besought [Him] about this and begged that it might depart from me;"},{"num":9,"verse":"But He said to me, My grace (My favor and loving-kindness and mercy) is enough for you [sufficient against any danger and enables you to bear the trouble manfully]; for My strength and power are made perfect (fulfilled and completed) and show themselves most effective in [your] weakness. Therefore, I will all the more gladly glory in my weaknesses and infirmities, that the strength and power of Christ (the Messiah) may rest (yes, may pitch a tent over and dwell) upon me!"},{"num":10,"verse":"So for the sake of Christ, I am well pleased and take pleasure in infirmities, insults, hardships, persecutions, perplexities and distresses; for when I am weak [in human strength], then am I [truly] strong (able, powerful in divine strength)."},{"num":11,"verse":"Now I have been [speaking like] a fool! But you forced me to it, for I ought to have been [saved the necessity and] commended by you. For I have not fallen short one bit or proved myself at all inferior to those superlative [false] apostles [of yours], even if I am nothing (a nobody)."},{"num":12,"verse":"Indeed, the signs that indicate a [genuine] apostle were performed among you fully and most patiently in miracles and wonders and mighty works."},{"num":13,"verse":"For in what respect were you put to a disadvantage in comparison with the rest of the churches, unless [it was for the fact] that I myself did not burden you [with my financial support]? Pardon me [for doing you] this injustice!"},{"num":14,"verse":"Now for the third time I am ready to come to [visit] you. And I will not burden you [financially], for it is not your [money] that I want but you; for children are not duty bound to lay up store for their parents, but parents for their children."},{"num":15,"verse":"But I will most gladly spend [myself] and be utterly spent for your souls. If I love you exceedingly, am I to be loved [by you] the less?"},{"num":16,"verse":"But though granting that I did not burden you [with my support, some say that] I was crafty [and that] I cheated and got the better of you with my trickery."},{"num":17,"verse":"Did I [then] take advantage of you or make any money out of you through any of those [messengers] whom I sent to you?"},{"num":18,"verse":"[Actually] I urged Titus [to go], and I sent the brother with [him]. Did Titus overreach or take advantage of you [in anything]? Did he and I not act in the same spirit? Did we not [take the] same steps?"},{"num":19,"verse":"Have you been supposing [all this time] that we have been defending ourselves and apologizing to you? [It is] in the sight and the [very] presence of God [and as one] in Christ (the Messiah) that we have been speaking, dearly beloved, and all in order to build you up [spiritually]."},{"num":20,"verse":"For I am fearful that somehow or other I may come and find you not as I desire to find you, and that you may find me too not as you want to find me—that perhaps there may be factions (quarreling), jealousy, temper (wrath, intrigues, rivalry, divided loyalties), selfishness, whispering, gossip, arrogance (self-assertion), and disorder among you."},{"num":21,"verse":"[I am fearful] that when I come again, my God may humiliate and humble me in your regard, and that I may have to sorrow over many of those who sinned before and have not repented of the impurity, sexual vice, and sensuality which they formerly practiced."}]