[{"num":12,"verse":"I have to boast. There is nothing to be gained by it, but I will go on to visions and revelations of the Lord. "},{"num":2,"verse":"I know a man in union with the Messiah who fourteen years ago was snatched up to the third heaven; whether he was in the body or outside the body I don’t know, God knows. "},{"num":3,"verse":"And I know that such a man — whether in the body or apart from the body I don’t know, God knows — "},{"num":4,"verse":"was snatched into Gan-‘Eden and heard things that cannot be put into words, things unlawful for a human being to utter. "},{"num":5,"verse":"About such a man I will boast; but about myself I will not boast, except in regard to my weaknesses. "},{"num":6,"verse":"If I did want to boast, I would not be foolish; because I would be speaking the truth. But, because of the extraordinary greatness of the revelations, I refrain, so that no one will think more of me than what my words or deeds may warrant. "},{"num":7,"verse":"Therefore, to keep me from becoming overly proud, I was given a thorn in my flesh, a messenger from the Adversary to pound away at me, so that I wouldn’t grow conceited. "},{"num":8,"verse":"Three times I begged the Lord to take this thing away from me; "},{"num":9,"verse":"but he told me, “My grace is enough for you, for my power is brought to perfection in weakness.” Therefore, I am very happy to boast about my weaknesses, in order that the Messiah’s power will rest upon me. "},{"num":10,"verse":"Yes, I am well pleased with weaknesses, insults, hardships, persecutions and difficulties endured on behalf of the Messiah; for it is when I am weak that I am strong."},{"num":11,"verse":"I have behaved like a fool, but you forced me to do it — you who should have been commending me. For I am in no way inferior to the “super-emissaries,” even if I am nothing. "},{"num":12,"verse":"The things that prove I am an emissary — signs, wonders and miracles — were done in your presence, despite what I had to endure. "},{"num":13,"verse":"Is there any way in which you have been behind any of the other congregations, other than in my not having been a burden to you? For this unfairness, please forgive me!"},{"num":14,"verse":"Look, I am ready this third time to come and visit you; and I will not be a burden to you; for it is not what you own that I want, but you! Children are not supposed to save up for their parents, but parents for their children. "},{"num":15,"verse":"And as for me, I will most gladly spend everything I have and be spent myself too for your sakes. If I love you more, am I to be loved less?"},{"num":16,"verse":"Let it be granted, then, that I was not a burden to you; but, crafty fellow that I am, I took you with trickery! "},{"num":17,"verse":"Was it perhaps through someone I sent you "},{"num":18,"verse":"that I took advantage of you? I urged Titus to go and sent the brother with him; Titus didn’t take advantage of you, did he? Didn’t we live by the same Spirit and show you the same path?"},{"num":19,"verse":"Perhaps you think that all this time we have been defending ourselves before you. No, we have been speaking in the sight of God, as those united with the Messiah should; and, my dear friends, it is all for your upbuilding. "},{"num":20,"verse":"For I am afraid of coming and finding you not the way I want you to be, and also of not being found the way you want me to be. I am afraid of finding quarreling and jealousy, anger and rivalry, slander and gossip, arrogance and disorder. "},{"num":21,"verse":"I am afraid that when I come again, my God may humiliate me in your presence, and that I will be grieved over many of those who sinned in the past and have not repented of the impurity, fornication and debauchery that they have engaged in."}]