[{"header":"Carried Up to Paradise"},{"num":12,"verse":"I must go on boasting, although there is nothing to be gained. So I will go on to visions and revelations of the Lord. "},{"num":2,"verse":"I know a man in Christ who, fourteen years ago, was carried up to the third heaven (whether in the body, I do not know, or out of the body, I do not know—God knows). "},{"num":3,"verse":"And I know that such a man (whether in the body or out of the body, I do not know—God knows) "},{"num":4,"verse":"was carried up into Paradise and heard inexpressible words that a man cannot possibly speak. "},{"num":5,"verse":"On behalf of such a one I will boast, but on my own behalf I will not boast, except about my weaknesses. "},{"num":6,"verse":"Indeed, if I wanted to boast, I would not be a fool, because I would be speaking the truth. But I refrain from doing this, so that no one will think more highly of me than what he sees in me or hears from me."},{"num":7,"verse":"Therefore, to keep me from becoming arrogant due to the extraordinary nature of these revelations, I was given a thorn in my flesh, a messenger of Satan, to torment me, so that I would not become arrogant. "},{"num":8,"verse":"Three times I pleaded with the Lord about this, that he would take it away from me. "},{"num":9,"verse":"And he said to me, “My grace is sufficient for you, because my power is made perfect in weakness.” Therefore I will be glad to boast all the more in my weaknesses, so that the power of Christ may shelter me."},{"num":10,"verse":"That is why I delight in weaknesses, in insults, in hardships, in persecutions, in difficulties, for the sake of Christ. For whenever I am weak, then am I strong."},{"header":"Not a Burden"},{"num":11,"verse":"I have become a fool. You forced me. After all, I ought to be commended by you, because I was not inferior to the “super-apostles” in any way, even if I am nothing. "},{"num":12,"verse":"The signs of an apostle—signs and wonders and miracles—were performed among you with all perseverance. "},{"num":13,"verse":"For how were you treated worse than the other churches, except that I myself was not a burden to you? Forgive me for this wrong."},{"num":14,"verse":"See, this is the third time I am ready to come to you, and I will not be a burden to you, because I do not seek your possessions, but you. After all, the children should not have to save up for their parents, but the parents for their children. "},{"num":15,"verse":"But I will very gladly spend and be completely spent on behalf of your souls. If I love you all the more, am I to be loved that much less? "},{"num":16,"verse":"But be that as it may, I did not burden you. Oh, but I was just being crafty and using deceit to exploit you, wasn’t I! "},{"num":17,"verse":"Did I ever take advantage of you through any one of the men I sent to you? "},{"num":18,"verse":"I urged Titus to go and sent our brother with him. Surely Titus did not take any advantage of you, did he? Did we not walk in the same spirit—in the very same footprints?"},{"header":"Paul’s Visit"},{"num":19,"verse":"Are you thinking that we are trying to defend ourselves to you all this time? We are speaking in the sight of God in Christ. Dear friends, all these words are for your strengthening. "},{"num":20,"verse":"For I am afraid that when I arrive, I may not find you as I want you to be, and that you might not find me as you want me to be. I fear that there may be quarreling, jealousy, outbursts of anger, selfishness, slander, gossip, pride, and disorder. "},{"num":21,"verse":"I fear that, when I arrive again, my God will humble me in regard to you, and I will have to grieve for many who sinned earlier and have not repented of the uncleanness, the sexual immorality, and the lewd sins they committed."}]