[[],[{"type":"header","content":"Paul’s Vision"},{"type":"prose","content":"Boasting is necessary, though it is not beneficial; but I will go on to visions and revelations of the Lord."}],[{"type":"prose","content":"I know a man in Christ, who fourteen years ago—whether in the body I do not know, or out of the body I do not know, God knows—such a man was caught up to the third heaven."}],[{"type":"prose","content":"And I know how such a man—whether in the body or apart from the body I do not know, God knows—"}],[{"type":"prose","content":"was caught up into Paradise and heard inexpressible words, which a man is not permitted to speak."}],[{"type":"prose","content":"In behalf of such a man I will boast; but in my own behalf I will not boast, except regarding  weaknesses."}],[{"type":"prose","content":"For if I do wish to boast I will not be foolish, for I will be speaking the truth; but I refrain , so that no one will credit me with more than he sees  me or hears from me."}],[{"type":"header","content":"A Thorn in the Flesh"},{"type":"prose","content":"Because of the extraordinary  of the revelations, for this reason, to keep me from exalting myself, there was given to me a thorn in the flesh, a messenger of Satan to torment me—to keep me from exalting myself!"}],[{"type":"prose","content":"Concerning this I pleaded with the Lord three times that it might leave me."}],[{"type":"prose","content":"And He has said to me,  Most gladly, therefore, I will rather boast about my weaknesses, so that the power of Christ may dwell in me."}],[{"type":"prose","content":"Therefore I delight in weaknesses, in insults, in distresses, in persecutions, in difficulties, in behalf of Christ; for when I am weak, then I am strong."}],[{"type":"prose","content":"I have become foolish; you yourselves compelled me. Actually I should have been commended by you, since I was in no respect inferior to the most eminent apostles, even though I am a nobody."}],[{"type":"prose","content":"The distinguishing marks of a true apostle were performed among you with all perseverance, by signs, wonders, and miracles."}],[{"type":"prose","content":"For in what respect were you treated as inferior to the rest of the churches, except that I myself did not become a burden to you? Forgive me this wrong!"}],[{"type":"prose","content":"Here for this third time I am ready to come to you, and I will not be a burden to you; for I do not seek what is yours, but you; for children are not responsible to save up for  parents, but parents for  children."}],[{"type":"prose","content":"I will most gladly spend and be expended for your souls. If I love you more, am I to be loved less?"}],[{"type":"prose","content":"But be that as it may, I did not burden you myself; nevertheless, devious person that I am, I took you in by deceit."}],[{"type":"prose","content":" I have not taken advantage of you through any of those whom I have sent to you, have I?"}],[{"type":"prose","content":"I urged Titus , and I sent the brother with him. Titus did not take any advantage of you, did he? Did we not conduct ourselves in the same spirit  in the same steps?"}],[{"type":"prose","content":"All this time you have been thinking that we are defending ourselves to you. , it is in the sight of God that we have been speaking in Christ; and all for building you up, beloved."}],[{"type":"prose","content":"For I am afraid that perhaps when I come I may find you to be not what I wish, and may be found by you to be not what you wish; that perhaps  strife, jealousy, angry tempers, selfishness, slanders, gossip, arrogance, disturbances;"}],[{"type":"prose","content":" that when I come again my God may humiliate me before you, and I may mourn over many of those who have sinned in the past and not repented of the impurity, sexual immorality, and indecent behavior which they have practiced."}]]