[{"header":"Paul’s Vision and His Painful Problem"},{"num":12,"verse":"We can’t gain anything by bragging. But I have to do it anyway. I am going to tell you what I’ve seen. I want to talk about what the Lord has shown me. "},{"num":2,"verse":"I know a believer in Christ who was taken up to the third heaven 14 years ago. I don’t know if his body was taken up or not. Only God knows. "},{"num":3,"verse":"I don’t know if that man was in his body or out of it. Only God knows. But I do know that "},{"num":4,"verse":"he was taken up to paradise. He heard things there that couldn’t be put into words. They were things that no one is allowed to talk about. "},{"num":5,"verse":"I will brag about a man like that. But I won’t brag about myself. I will brag only about how weak I am. "},{"num":6,"verse":"Suppose I decide to brag. That would not make me a fool, because I would be telling the truth. But I don’t brag, so that no one will think more of me than they should. People should judge me by what I do and say. "},{"num":7,"verse":"God has shown me amazing and wonderful things. People should not think more of me because of it. So I wouldn’t become proud of myself, I was given a problem. This problem caused pain in my body. It is a messenger from Satan to make me suffer. "},{"num":8,"verse":"Three times I begged the Lord to take it away from me. "},{"num":9,"verse":"But he said to me, “My grace is all you need. My power is strongest when you are weak.” So I am very happy to brag about how weak I am. Then Christ’s power can rest on me. "},{"num":10,"verse":"Because of how I suffered for Christ, I’m glad that I am weak. I am glad in hard times. I am glad when people say mean things about me. I am glad when things are difficult. And I am glad when people make me suffer. When I am weak, I am strong."},{"header":"Paul’s Concern for the People of Corinth"},{"num":11,"verse":"I have made a fool of myself. But you made me do it. You should have praised me. Even though I am nothing, I am in no way less important than the “super-apostles.” "},{"num":12,"verse":"While I was with you, I kept on showing you the actions of a true apostle. These actions include signs, wonders and miracles. "},{"num":13,"verse":"How were you less important than the other churches? The only difference was that I didn’t cause you any expense. Forgive me for that wrong!"},{"num":14,"verse":"Now I am ready to visit you for the third time. I won’t cause you any expense. I don’t want what you have. What I really want is you. After all, children shouldn’t have to save up for their parents. Parents should save up for their children. "},{"num":15,"verse":"So I will be very happy to spend everything I have for you. I will even spend myself. If I love you more, will you love me less? "},{"num":16,"verse":"In any case, I haven’t caused you any expense. But I’m so tricky! I have caught you by tricking you! Or so you think! "},{"num":17,"verse":"Did I take advantage of you through any of the men I sent to you? "},{"num":18,"verse":"I asked Titus to go to you. And I sent our brother with him. Titus didn’t take advantage of you, did he? Didn’t we walk in the same footsteps by the same Spirit?"},{"num":19,"verse":"All this time, have you been thinking that I’ve been speaking up for myself? No, I’ve been speaking with God as my witness. I’ve been speaking like a believer in Christ. Dear friends, everything I do is to help you become stronger. "},{"num":20,"verse":"I’m afraid that when I come I won’t find you as I want you to be. I’m afraid that you won’t find me as you want me to be. I’m afraid there will be arguing, jealousy and fits of anger. I’m afraid each of you will focus only on getting ahead. Then you will tell lies about each other. You will talk about each other. I’m afraid you will be proud and cause trouble. "},{"num":21,"verse":"I’m afraid that when I come again my God will put me to shame in front of you. Then I will be sad about many who sinned earlier and have not turned away from it. They have not turned away from uncleanness, sexual sins and wild living. They have done all those things."}]