[{"header":"The Word of Life"},{"num":1,"verse":"In the beginning the Word already existed; the Word was with God, and the Word was God. "},{"num":2,"verse":"From the very beginning the Word was with God. "},{"num":3,"verse":"Through him God made all things; not one thing in all creation was made without him. "},{"num":4,"verse":"The Word was the source of life, and this life brought light to people. "},{"num":5,"verse":"The light shines in the darkness, and the darkness has never put it out."},{"num":6,"verse":"God sent his messenger, a man named John, "},{"num":7,"verse":"who came to tell people about the light, so that all should hear the message and believe. "},{"num":8,"verse":"He himself was not the light; he came to tell about the light. "},{"num":9,"verse":"This was the real light—the light that comes into the world and shines on all people."},{"num":10,"verse":"The Word was in the world, and though God made the world through him, yet the world did not recognize him. "},{"num":11,"verse":"He came to his own country, but his own people did not receive him. "},{"num":12,"verse":"Some, however, did receive him and believed in him; so he gave them the right to become God's children. "},{"num":13,"verse":"They did not become God's children by natural means, that is, by being born as the children of a human father; God himself was their Father."},{"num":14,"verse":"The Word became a human being and, full of grace and truth, lived among us. We saw his glory, the glory which he received as the Father's only Son."},{"num":15,"verse":"John spoke about him. He cried out, “This is the one I was talking about when I said, ‘He comes after me, but he is greater than I am, because he existed before I was born.’”"},{"num":16,"verse":"Out of the fullness of his grace he has blessed us all, giving us one blessing after another. "},{"num":17,"verse":"God gave the Law through Moses, but grace and truth came through Jesus Christ. "},{"num":18,"verse":"No one has ever seen God. The only Son, who is the same as God and is at the Father's side, he has made him known."},{"header":"John the Baptist's Message(B)"},{"num":19,"verse":"The Jewish authorities in Jerusalem sent some priests and Levites to John to ask him, “Who are you?”"},{"num":20,"verse":"John did not refuse to answer, but spoke out openly and clearly, saying: “I am not the Messiah.”"},{"num":21,"verse":"“Who are you, then?” they asked. “Are you Elijah?”"},{"num":22,"verse":"“Then tell us who you are,” they said. “We have to take an answer back to those who sent us. What do you say about yourself?”"},{"num":23,"verse":"John answered by quoting the prophet Isaiah:"},{"num":24,"verse":"The messengers, who had been sent by the Pharisees, "},{"num":25,"verse":"then asked John, “If you are not the Messiah nor Elijah nor the Prophet, why do you baptize?”"},{"num":26,"verse":"John answered, “I baptize with water, but among you stands the one you do not know. "},{"num":27,"verse":"He is coming after me, but I am not good enough even to untie his sandals.”"},{"num":28,"verse":"All this happened in Bethany on the east side of the Jordan River, where John was baptizing."},{"header":"The Lamb of God"},{"num":29,"verse":"The next day John saw Jesus coming to him, and said, “There is the Lamb of God, who takes away the sin of the world! "},{"num":30,"verse":"This is the one I was talking about when I said, ‘A man is coming after me, but he is greater than I am, because he existed before I was born.’ "},{"num":31,"verse":"I did not know who he would be, but I came baptizing with water in order to make him known to the people of Israel.”"},{"num":32,"verse":"And John gave this testimony: “I saw the Spirit come down like a dove from heaven and stay on him. "},{"num":33,"verse":"I still did not know that he was the one, but God, who sent me to baptize with water, had said to me, ‘You will see the Spirit come down and stay on a man; he is the one who baptizes with the Holy Spirit.’ "},{"num":34,"verse":"I have seen it,” said John, “and I tell you that he is the Son of God.”"},{"header":"The First Disciples of Jesus"},{"num":35,"verse":"The next day John was standing there again with two of his disciples, "},{"num":36,"verse":"when he saw Jesus walking by. “There is the Lamb of God!” he said."},{"num":37,"verse":"The two disciples heard him say this and went with Jesus. "},{"num":38,"verse":"Jesus turned, saw them following him, and asked, “What are you looking for?”"},{"num":39,"verse":"“Come and see,” he answered. (It was then about four o'clock in the afternoon.) So they went with him and saw where he lived, and spent the rest of that day with him."},{"num":40,"verse":"One of them was Andrew, Simon Peter's brother. "},{"num":41,"verse":"At once he found his brother Simon and told him, “We have found the Messiah.” (This word means “Christ.”) "},{"num":42,"verse":"Then he took Simon to Jesus."},{"header":"Jesus Calls Philip and Nathanael"},{"num":43,"verse":"The next day Jesus decided to go to Galilee. He found Philip and said to him, “Come with me!” "},{"num":44,"verse":"(Philip was from Bethsaida, the town where Andrew and Peter lived.) "},{"num":45,"verse":"Philip found Nathanael and told him, “We have found the one whom Moses wrote about in the book of the Law and whom the prophets also wrote about. He is Jesus son of Joseph, from Nazareth.”"},{"num":46,"verse":"“Can anything good come from Nazareth?” Nathanael asked."},{"num":47,"verse":"When Jesus saw Nathanael coming to him, he said about him, “Here is a real Israelite; there is nothing false in him!”"},{"num":48,"verse":"Nathanael asked him, “How do you know me?”"},{"num":49,"verse":"“Teacher,” answered Nathanael, “you are the Son of God! You are the King of Israel!”"},{"num":50,"verse":"Jesus said, “Do you believe just because I told you I saw you when you were under the fig tree? You will see much greater things than this!” "},{"num":51,"verse":"And he said to them, “I am telling you the truth: you will see heaven open and God's angels going up and coming down on the Son of Man.”"}]