[{"header":"Christ Comes to the World"},{"num":1,"verse":"In the beginning there was the Word. The Word was with God, and the Word was God. "},{"num":2,"verse":"He was with God in the beginning. "},{"num":3,"verse":"All things were made by him, and nothing was made without him. "},{"num":4,"verse":"In him there was life, and that life was the light of all people. "},{"num":5,"verse":"The Light shines in the darkness, and the darkness has not overpowered it."},{"num":6,"verse":"There was a man named John who was sent by God. "},{"num":7,"verse":"He came to tell people the truth about the Light so that through him all people could hear about the Light and believe. "},{"num":8,"verse":"John was not the Light, but he came to tell people the truth about the Light. "},{"num":9,"verse":"The true Light that gives light to all was coming into the world!"},{"num":10,"verse":"The Word was in the world, and the world was made by him, but the world did not know him. "},{"num":11,"verse":"He came to the world that was his own, but his own people did not accept him. "},{"num":12,"verse":"But to all who did accept him and believe in him he gave the right to become children of God. "},{"num":13,"verse":"They did not become his children in any human way—by any human parents or human desire. They were born of God."},{"num":14,"verse":"The Word became a human and lived among us. We saw his glory—the glory that belongs to the only Son of the Father—and he was full of grace and truth. "},{"num":15,"verse":"John tells the truth about him and cries out, saying, “This is the One I told you about: ‘The One who comes after me is greater than I am, because he was living before me.’”"},{"num":16,"verse":"Because he was full of grace and truth, from him we all received one gift after another. "},{"num":17,"verse":"The law was given through Moses, but grace and truth came through Jesus Christ. "},{"num":18,"verse":"No one has ever seen God. But God the only Son is very close to the Father, and he has shown us what God is like."},{"header":"John Tells People About Jesus"},{"num":19,"verse":"Here is the truth John told when the leaders in Jerusalem sent priests and Levites to ask him, “Who are you?”"},{"num":20,"verse":"John spoke freely and did not refuse to answer. He said, “I am not the Christ.”"},{"num":21,"verse":"So they asked him, “Then who are you? Are you Elijah?”"},{"num":22,"verse":"Then they said, “Who are you? Give us an answer to tell those who sent us. What do you say about yourself?”"},{"num":23,"verse":"John told them in the words of the prophet Isaiah:"},{"num":24,"verse":"Some Pharisees who had been sent asked John: "},{"num":25,"verse":"“If you are not the Christ or Elijah or the Prophet, why do you baptize people?”"},{"num":26,"verse":"John answered, “I baptize with water, but there is one here with you that you don’t know about. "},{"num":27,"verse":"He is the One who comes after me. I am not good enough to untie the strings of his sandals.”"},{"num":28,"verse":"This all happened at Bethany on the other side of the Jordan River, where John was baptizing people."},{"num":29,"verse":"The next day John saw Jesus coming toward him. John said, “Look, the Lamb of God, who takes away the sin of the world! "},{"num":30,"verse":"This is the One I was talking about when I said, ‘A man will come after me, but he is greater than I am, because he was living before me.’ "},{"num":31,"verse":"Even I did not know who he was, although I came baptizing with water so that the people of Israel would know who he is.”"},{"num":32,"verse":"Then John said, “I saw the Spirit come down from heaven in the form of a dove and rest on him. Until then I did not know who the Christ was. But the God who sent me to baptize with water told me, ‘You will see the Spirit come down and rest on a man; he is the One who will baptize with the Holy Spirit.’ "},{"num":34,"verse":"I have seen this happen, and I tell you the truth: This man is the Son of God.”"},{"header":"The First Followers of Jesus"},{"num":35,"verse":"The next day John was there again with two of his followers. "},{"num":36,"verse":"When he saw Jesus walking by, he said, “Look, the Lamb of God!”"},{"num":37,"verse":"The two followers heard John say this, so they followed Jesus. "},{"num":38,"verse":"When Jesus turned and saw them following him, he asked, “What are you looking for?”"},{"num":39,"verse":"He answered, “Come and see.” So the two men went with Jesus and saw where he was staying and stayed there with him that day. It was about four o’clock in the afternoon."},{"num":40,"verse":"One of the two men who followed Jesus after they heard John speak about him was Andrew, Simon Peter’s brother. "},{"num":41,"verse":"The first thing Andrew did was to find his brother Simon and say to him, “We have found the Messiah.” (“Messiah” means “Christ.”)"},{"num":42,"verse":"Then Andrew took Simon to Jesus. Jesus looked at him and said, “You are Simon son of John. You will be called Cephas.” (“Cephas” means “Peter.”)"},{"num":43,"verse":"The next day Jesus decided to go to Galilee. He found Philip and said to him, “Follow me.”"},{"num":44,"verse":"Philip was from the town of Bethsaida, where Andrew and Peter lived. "},{"num":45,"verse":"Philip found Nathanael and told him, “We have found the man that Moses wrote about in the law, and the prophets also wrote about him. He is Jesus, the son of Joseph, from Nazareth.”"},{"num":46,"verse":"But Nathanael said to Philip, “Can anything good come from Nazareth?”"},{"num":47,"verse":"As Jesus saw Nathanael coming toward him, he said, “Here is truly an Israelite. There is nothing false in him.”"},{"num":48,"verse":"Nathanael asked, “How do you know me?”"},{"num":49,"verse":"Then Nathanael said to Jesus, “Teacher, you are the Son of God; you are the King of Israel.”"},{"num":50,"verse":"Jesus said to Nathanael, “Do you believe simply because I told you I saw you under the fig tree? You will see greater things than that.” "},{"num":51,"verse":"And Jesus said to them, “I tell you the truth, you will all see heaven open and ‘angels of God going up and coming down’ on the Son of Man.”"}]