[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(31) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Son, thou art ever with me.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—As applied ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the Pharisees in its primary bearing, or to others like the Pharisees in its secondary, it appears at first sight as if the words were spoken from their own point of view, their own self-appreciation, and were therefore ironical. We need not, however, so take them. The words were literally true of the Pharisees, of Israel as a nation, of all who reproduce the Pharisee temper. All outward gifts that God could bestow, the covenants and the law, and the promises, outward ordinances of worship, and the instruction of wise men and scribes—these had all been given to Israel, as like blessings are offered now to all members of the visible Church of Christ, the great family of God. All that was wanted was the power to use these things rightly, as the Father wills, and therefore to enjoy them.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "All that I have is thine.—More literally, all mine is thine.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "All that I have is thine.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—More literally, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "all mine is thine.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "15:25-32 In the latter part of this parable we have the character of the Pharisees, though not of them alone. It sets forth the kindness of the Lord, and the proud manner in which his gracious kindness is often received. The Jews, in general, showed the same spirit towards the converted Gentiles; and numbers in every age object to the gospel and its preachers, on the same ground. What must that temper be, which stirs up a man to despise and abhor those for whom the Saviour shed his precious blood, who are objects of the Father's choice, and temples of the Holy Ghost! This springs from pride, self-preference, and ignorance of a man's own heart. The mercy and grace of our God in Christ, shine almost as bright in his tender and gentle bearing with peevish saints, as his receiving prodigal sinners upon their repentance. It is the unspeakable happiness of all the children of God, who keep close to their Father's house, that they are, and shall be ever with him. Happy will it be for those who thankfully accept Christ's invitation.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "All I have is thine - The property was divided. What remained was in reality the older son's. He was heir to it all, and had a right, if he chose, to use it. He had, therefore, no right to complain.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This instructive and beautiful parable was designed to vindicate the conduct of Jesus to show that it was right to receive sinners, and that the conduct of the Pharisees was unreasonable. The older son represents the Pharisees; the younger, the returning sinner, whether Jew or Gentile; and the father, God, who is willing to receive them. The parable had the designed effect. It silenced the adversaries of Jesus and vindicated his own conduct. There is not, perhaps, anywhere to be found a more beautiful and touching narrative than this. Every circumstance is tender and happily chosen; every word has a meaning; every image is beautiful; and the narrative closes just where it is fitted to make the deepest impression. In addition to what has been suggested, we may learn from this parable the following lessons:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. That the disposition of a sinner is selfish. He desires to get all that he can, and is impatient of delay, Luke 15:12.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "1. That the disposition of a sinner is selfish. He desires to get all that he can, and is impatient of delay, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 15:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "2. Sinners waste their blessings, and reduce themselves to a state of want and wretchedness, Luke 15:13. A life of sin brings on spiritual want and misery. It destroys the faculties, benumbs the mind, hardens the heart, abuses the beneficence of God, and makes us careless of him who gave us all that we have, and indifferent to the consequences of our own conduct.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "2. Sinners waste their blessings, and reduce themselves to a state of want and wretchedness, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 15:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". A life of sin brings on spiritual want and misery. It destroys the faculties, benumbs the mind, hardens the heart, abuses the beneficence of God, and makes us careless of him who gave us all that we have, and indifferent to the consequences of our own conduct.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "3. Sinners disregard the future woes that will come upon them. The young man cared not for any calamities that might be the result of his conduct. He went on heedlessly - like every sinner to enjoy himself, and to squander what the toils of his father had procured for him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "4. Afflictions are often the means of bringing sinners to reflection, Luke 15:14. While his property lasted the prodigal cared little about his father. When that was gone, and he was in the midst of a famine, he thought of his ways. When sinners are in prosperity they think little about God. When he takes away their mercies, and they are called to pass through afflictions, then they think of their ways, and remember that God can give them comfort.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "4. Afflictions are often the means of bringing sinners to reflection, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 15:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". While his property lasted the prodigal cared little about his father. When that was gone, and he was in the midst of a famine, he thought of his ways. When sinners are in prosperity they think little about God. When he takes away their mercies, and they are called to pass through afflictions, then they think of their ways, and remember that God can give them comfort.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "5. We have here an impressive exhibition of the wants and woes of a sinner.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) he had spent all. He had nothing. So the sinner. He has no righteousness, no comfort.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(2) he was far from God, away from his father, and in a land of strangers. The sinner has wandered, and has no friend. His miseries came upon him \"because\" he was so far away from God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(3) his condition was wretched. He was needy, in famine, and without a friend. So the sinner. His condition is aptly denoted by that of the prodigal, who would gladly have partaken of the food of the swine. The sinner has taken the world for his portion, and it neither supplies the wants of his soul, nor gives him comfort when he is far away from his Father's home and from God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "6. The sinner in this situation often applies to the wrong source for comfort, Luke 15:15. The prodigal should at once have returned to his father, but he rather chose to become a servant of a citizen of that region. The sinner, when sensible of his sins, should return at once to God; but he often continues still to wander. He tries new objects. He seeks new pleasures and new friends, and finds them equally unsatisfactory. He engages in new pursuits, but all in vain. He is still comfortless, and in a strange, a famished land,",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "6. The sinner in this situation often applies to the wrong source for comfort, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 15:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The prodigal should at once have returned to his father, but he rather chose to become a servant of a citizen of that region. The sinner, when sensible of his sins, should return at once to God; but he often continues still to wander. He tries new objects. He seeks new pleasures and new friends, and finds them equally unsatisfactory. He engages in new pursuits, but all in vain. He is still comfortless, and in a strange, a famished land,",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "7. The repentance required in the gospel is a return to a right mind, Luke 15:17. Before his conversion the sinner was alienated from God. He was spiritually deranged. He saw not things as they are. Now he looks on the world as vain and unsatisfactory, and comes to himself. He thinks \"aright\" of God, of heaven, of eternity, and resolves to seek his happiness there. No man regards things as they are but he who sees the world to be vain, and eternity to be near and awful; and none acts with a \"sane mind\" but he who acts on the belief that he must soon die; that there is a God and a Saviour - a heaven and a hell.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "7. The repentance required in the gospel is a return to a right mind, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 15:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Before his conversion the sinner was alienated from God. He was spiritually deranged. He saw not things as they are. Now he looks on the world as vain and unsatisfactory, and comes to himself. He thinks \"aright\" of God, of heaven, of eternity, and resolves to seek his happiness there. No man regards things as they are but he who sees the world to be vain, and eternity to be near and awful; and none acts with a \"sane mind\" but he who acts on the belief that he must soon die; that there is a God and a Saviour - a heaven and a hell.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "8. When the sinner returns he becomes sensible of the following things:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) That he is in danger of perishing, and must soon die but for relief - \"I perish with hunger.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "continued...",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "31. Son, &c.—The father resents not the insult—how could he, after the largeness of heart which had kissed the returning prodigal? He calmly expostulates with him, \"Son, listen to reason. What need for special, exuberant joy over thee? Didst thou say, 'Lo, these many years do I serve thee?' In that saidst thou truly; but just for that reason do I not set the whole household a-rejoicing over thee. For thee is reserved what is higher still—a tranquil lifelong satisfaction in thee, as a true-hearted faithful son in thy father's house, nor of the inheritance reserved for thee is aught alienated by this festive and fitting joy over the once foolish but now wise and newly recovered one.\"",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole on \"Luke 15:25\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole on \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 15:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And he said to him, son,.... For so he was, as before observed, by creation, national adoption, and profession: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "thou art ever with me; not in such a sense as Christ the Son of God was: nor can it design the gracious presence of God, or communion with him; for this man did not walk with God; and besides, this is more frequently expressed by God's being with his people, than by their being with him; nor are good men always with God, or God with them, in this sense; sometimes the phrase designs the saints being with God, or Christ, in heaven; but here it intends only attendance on public worship, in the place where the symbol of God's presence was, the temple; and the \"ever\" denotes the term of the legal dispensation, which in many branches of it, as circumcision, the passover, and other ordinances and statutes, is said to be for ever. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And all that I have is thine: which must be understood with a limitation; for it cannot mean, that he had all the perfections of God, as Christ the Son of God has; nor all spiritual blessings, as the adopted sons of God have; nor indeed any of them, but all the outward ordinances of the legal dispensation, which belonged to the Jews; particularly those that are enumerated in Romans 9:4 as the adoption, the glory, the covenants, the giving of the law, the service of God, the promises, their descent from the fathers, and the Messiah's descent from them; they had him in person among them, and his personal ministry, the word and ordinances of the Gospel; and had as much as they could have, or desire to have, in an external way. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And all that I have is thine: which must be understood with a limitation; for it cannot mean, that he had all the perfections of God, as Christ the Son of God has; nor all spiritual blessings, as the adopted sons of God have; nor indeed any of them, but all the outward ordinances of the legal dispensation, which belonged to the Jews; particularly those that are enumerated in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 9:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " as the adoption, the glory, the covenants, the giving of the law, the service of God, the promises, their descent from the fathers, and the Messiah's descent from them; they had him in person among them, and his personal ministry, the word and ordinances of the Gospel; and had as much as they could have, or desire to have, in an external way. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And he said unto him, Son, thou art ever with me, and all that I have is thine.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 15:31-32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The father answers meekly, apologetically, as if conscious that the elder son had some right to complain, and content to justify himself for celebrating the younger son’s return with a feast; not a word of retaliation. This is natural in the story, and it also fits well into the aim of the parable, which is to illustrate the joy of finding the lost. It would serve no purpose in that connection to disparage the object of the lesser joy. There is peculiar joy over one sinner repenting even though the ninety-nine be truly righteous, and over a prodigal returned even though the elder brother be a most exemplary, blameless, dutiful son.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Son",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, Child.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thou art ever with me, and all that I have is thine",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Literally, “",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "all mine are thine”",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " “Who are Israelites; to whom pertaineth the adoption, and the glory, and the Shechinah, and the covenants, and the giving of the Law, and the service of God, and the promises; whose are the fathers, and of whom after the flesh Christ came who is God over all, blessed for ever,” ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 9:4-5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Religionists of the Elder-brother type cannot realize the truth that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "they",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " are not impoverished by the extension to others of God’s riches (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 20:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Let us hope that after this appeal the elder son also went in.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 15:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Εἶπεν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He said",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") He makes a twofold reply to the elder son’s twofold complaint.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τέκνον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "son",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") He addresses him by a loving title [Being filled with joy to overflowing on account of the return of His once-lost son.—V. g.]; nor does the Father immediately put away from Him (cast off) the envious brother.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πάντοτε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "always",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") and it is not therefore necessary to rejoice with peculiar joy, as if something extraordinary had occurred: see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 15:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", at the end of the verse.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "μετʼ ἐμοῦ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "with Me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") It is better to rejoice (enjoy one’s self) with the Father, than with a company of friends. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 15:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἵνα μετὰ τῶν φίλων μου εὐφρανθῶ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "].—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πάντα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "all things",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") This expresses the pre-eminent and peculiar privilege of the Jewish people.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τὰ ἐμὰ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "which belong to Me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") There is therefore no need that thou shouldest seek external ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "friendships",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "σά ἐστι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "are thine",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") For the younger brother had received his share; and the elder-born had the priority of succession to the Father’s goods. Many things may possibly belong to the children of God, of which they are not privileged to have now the full enjoyment (usufructus). Therefore the elder brother ought not to have complained that a kid had never yet been given to him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Luke 15:31",
        "children": []
      }
    ]
  }
]