[{"num":7,"verse":"As soon as Solomon finished praying, fire came down from heaven and consumed the entirely burned offering and the sacrifices, while the Lord’s glory filled the temple."},{"num":2,"verse":"The priests were unable to enter the Lord’s temple because the Lord’s glory had filled the Lord’s temple."},{"num":3,"verse":"All the Israelites were watching when the fire fell. As the Lord’s glory filled the temple, they knelt down on the pavement with their faces to the ground, worshipping and giving thanks to the Lord, saying, “Yes, God is good! Yes, God’s faithful love lasts forever!”"},{"num":4,"verse":"Then the king and all the people sacrificed to the Lord."},{"num":5,"verse":"King Solomon sacrificed twenty-two thousand oxen and one hundred twenty thousand sheep when the king and all the people dedicated God’s temple."},{"num":6,"verse":"The priests stood at their posts, as did the Levites with the Lord’s musical instruments, which King David had made for giving thanks to the Lord, saying, “Yes, God’s faithful love lasts forever!” and which David had used when he gave praise. Across from them, the priests were blowing trumpets while all Israel was standing."},{"num":7,"verse":"Solomon also dedicated the middle of the courtyard in front of the Lord’s temple. He had to offer the entirely burned offerings and the fat of the well-being sacrifices there because the bronze altar Solomon had made was too small to contain the entirely burned offerings, the grain offerings, and the pieces of fat."},{"num":8,"verse":"At that time Solomon, together with all Israel, celebrated the festival for seven days. It was a very large assembly that came from Lebo-hamath to the border of Egypt."},{"num":9,"verse":"On the eighth day there was a gathering. They had dedicated the altar for seven days and celebrated the festival for another seven days."},{"num":10,"verse":"On the twenty-third day of the seventh month, Solomon dismissed the people to their tents, happy and content because of the goodness the Lord had shown to David, to Solomon, and to his people Israel."},{"num":11,"verse":"In this way, Solomon finished the Lord’s temple and the royal palace. He successfully accomplished everything he intended for the Lord’s temple and his own palace."},{"header":"Solomon again meets God"},{"num":12,"verse":"Then the Lord appeared to Solomon at night and said to him: I have heard your prayer and have chosen this place as my house of sacrifice."},{"num":13,"verse":"When I close the sky so that there is no rain or I order the locusts to consume the land or I send a plague against my people,"},{"num":14,"verse":"if my people who belong to me will humbly pray, seek my face, and turn from their wicked ways, then I will hear from heaven, forgive their sin, and heal their land."},{"num":15,"verse":"From now on my eyes will be open and my ears will pay attention to the prayers offered in this place,"},{"num":16,"verse":"because I have chosen this temple and declared it holy so that my name may be there forever. My eyes and my heart will always be there."},{"num":17,"verse":"As for you, if you will walk before me just as your father David did, doing all that I have commanded you and keeping my regulations and case laws,"},{"num":18,"verse":"then I will establish your royal throne, just as I promised your father David: You will never fail to have a successor ruling in Israel."},{"num":19,"verse":"But if any of you ever turn away from and abandon the regulations and commands that I have given you, and go to serve other gods and worship them,"},{"num":20,"verse":"then I will uproot you from my land that I gave you, and I will reject this temple that I made holy for my name. I will make it a joke, insulted by everyone."},{"num":21,"verse":"Everyone who passes by this temple—so lofty now—will be shocked and will wonder, Why has the Lord done such a thing to this land and temple?"},{"num":22,"verse":"The answer will come, Because they abandoned the Lord, the God of their ancestors, who brought them out of Egypt. They embraced other gods, worshipping and serving them. This is why God brought all this disaster on them."}]