[{"header":"The Dedication of the Temple"},{"num":7,"verse":"When Solomon finished praying, fire came down from heaven and consumed the burnt offering and the sacrifices. The Glory of the Lord filled the house. "},{"num":2,"verse":"The priests were not able to go into the House of the Lord because the Glory of the Lord filled the House of the Lord. "},{"num":3,"verse":"When all the people of Israel saw the fire coming down and the Glory of the Lord over the house, they bowed to the ground with their faces on the pavement, and they worshipped, giving thanks to the Lord:"},{"num":4,"verse":"The king and all the people were offering sacrifices before the Lord. "},{"num":5,"verse":"King Solomon offered a sacrifice of twenty-two thousand cattle and one hundred twenty thousand sheep. The king and all the people dedicated the House of God."},{"num":6,"verse":"The priests stood at their assigned positions. The Levites, using the musical instruments for the Lord, which King David had made to give thanks to the Lord because his mercy endures forever, were offering the praises written by David. The priests who blew the trumpets stood across from them. All Israel was standing there."},{"num":7,"verse":"Solomon consecrated the center of the courtyard that was in front of the Lord’s house, so that he could present the burnt offerings and the fat of the fellowship offerings there, because the bronze altar which Solomon had made was not large enough to hold the burnt offerings, the grain offerings, and the fat from the fellowship offerings."},{"num":8,"verse":"At that time Solomon celebrated the festival for seven days, and all Israel was with him, a very large assembly of people, who had come from as far away as Lebo Hamath and the Stream of Egypt. "},{"num":9,"verse":"On the eighth day they held a solemn assembly, because they had spent seven days on the dedication of the altar and on the festival. "},{"num":10,"verse":"On the twenty-third day of the seventh month, Solomon sent the people to their homes. When they left, they were joyful, and their hearts were glad because of the good things which the Lord had done for David, for Solomon, and for his people Israel."},{"num":11,"verse":"Solomon completed the Lord’s house and the king’s house. Solomon accomplished everything that was on his heart, everything he wanted to accomplish for the house for the Lord and for the house for the king."},{"header":"The Lord Renews His Promises to Solomon"},{"num":12,"verse":"Then the Lord appeared to Solomon at night and said to him:"}]