[{"header":"Selection of seven to serve"},{"num":6,"verse":"About that time, while the number of disciples continued to increase, a complaint arose. Greek-speaking disciples accused the Aramaic-speaking disciples because their widows were being overlooked in the daily food service."},{"num":2,"verse":"The Twelve called a meeting of all the disciples and said, “It isn’t right for us to set aside proclamation of God’s word in order to serve tables."},{"num":3,"verse":"Brothers and sisters, carefully choose seven well-respected men from among you. They must be well-respected and endowed by the Spirit with exceptional wisdom. We will put them in charge of this concern."},{"num":4,"verse":"As for us, we will devote ourselves to prayer and the service of proclaiming the word.”"},{"num":5,"verse":"This proposal pleased the entire community. They selected Stephen, a man endowed by the Holy Spirit with exceptional faith, Philip, Prochorus, Nicanor, Timon, Parmenas, and Nicolaus from Antioch, a convert to Judaism."},{"num":6,"verse":"The community presented these seven to the apostles, who prayed and laid their hands on them."},{"num":7,"verse":"God’s word continued to grow. The number of disciples in Jerusalem increased significantly. Even a large group of priests embraced the faith."},{"header":"Arrest and murder of Stephen"},{"num":8,"verse":"Stephen, who stood out among the believers for the way God’s grace was at work in his life and for his exceptional endowment with divine power, was doing great wonders and signs among the people."},{"num":9,"verse":"Opposition arose from some who belonged to the so-called Synagogue of Former Slaves. Members from Cyrene, Alexandria, Cilicia, and Asia entered into debate with Stephen."},{"num":10,"verse":"However, they couldn’t resist the wisdom the Spirit gave him as he spoke."},{"num":11,"verse":"Then they secretly enticed some people to claim, “We heard him insult Moses and God.”"},{"num":12,"verse":"They stirred up the people, the elders, and the legal experts. They caught Stephen, dragged him away, and brought him before the Jerusalem Council."},{"num":13,"verse":"Before the council, they presented false witnesses who testified, “This man never stops speaking against this holy place and the Law."},{"num":14,"verse":"In fact, we heard him say that this man Jesus of Nazareth will destroy this place and alter the customary practices Moses gave us.”"},{"num":15,"verse":"Everyone seated in the council stared at Stephen, and they saw that his face was radiant, just like an angel’s."}]