[{"num":14,"verse":"12 In the overthrow of Sodom Lot is taken prisoner. 16 Abram delivereth him. 18 Melchizedek cometh to meet him. 23 Abram would not be enriched by the king of Sodom."},{"num":1,"verse":"And in the days of Amraphel king of Shinar, Arioch king of Ellasar, Chedorlaomer king of Elam, and Tidal king of the nations:"},{"num":2,"verse":"These men made war with Bera king of Sodom, and with Birsha king of Gomorrah, Shinab king of Admah, and Shemeber king of Zeboiim, and the king of Bela, which is Zoar."},{"num":3,"verse":"All these joined together in the valley of Siddim, which is the salt Sea."},{"num":4,"verse":"Twelve years were they subject to Chedorlaomer, but in the thirteenth year they rebelled."},{"num":5,"verse":"And in the fourteenth year came Chedorlaomer, and the kings that were with him, and smote the Rephaims in Ashteroth Karnaim, and the Zuzims in Ham, and the Emims in Shaveh Kiriathaim,"},{"num":6,"verse":"And the Horites in their mount Seir, unto the plain of El Paran, which is by the wilderness."},{"num":7,"verse":"And they returned and came to En Mishpat, which is Kadesh, and smote all the country of the Amalekites, and also the Amorites that dwelled in Hazezon Tamar."},{"num":8,"verse":"Then went out the king of Sodom, and the king of Gomorrah, and the king of Admah, and the king of Zeboiim, and the king of Bela, which is Zoar: and they joined battle with them in the valley of Siddim,"},{"num":9,"verse":"To wit, with Chedorlaomer king of Elam, and Tidal king of nations, and Amraphel king of Shinar, and Arioch king of Ellasar: four kings against five."},{"num":10,"verse":"Now the valley of Siddim was full of slime pits, and the kings of Sodom and Gomorrah fled and fell there: and the residue fled to the mountain."},{"num":11,"verse":"And they took all the substance of Sodom and Gomorrah, and all their vittles and went their way."},{"num":12,"verse":"They took Lot also Abram’s brother’s son and his substance (for he dwelt at Sodom) and departed."},{"num":13,"verse":"¶ Then came one that had escaped, and told Abram the Hebrew, which dwelt in the plain of Mamre the Amorite, brother of Eshcol, and brother of Aner, which were confederate with Abram."},{"num":14,"verse":"When Abram heard that his brother was taken, he brought forth of them that were born and brought up in his house, three hundred and eighteen, and pursued them unto Dan."},{"num":15,"verse":"Then he and his servants divided themselves against them by night, and smote them, and pursued them unto Hobah, which is on the left side of Damascus,"},{"num":16,"verse":"And he recovered all the substance, and also brought again his brother Lot, and his goods, and the women also and the people."},{"num":17,"verse":"¶ After that he returned from the slaughter of Chedorlaomer and of the kings that were with him, came the King of Sodom forth to meet him in the valley of Shaveh, which is the King’s dale."},{"num":18,"verse":"And Melchizedek King of Salem brought forth bread and wine: and he was a Priest of the most high God."},{"num":19,"verse":"Therefore he blessed him, saying, Blessed art thou, Abram, of God most high, Possessor of heaven and earth,"},{"num":20,"verse":"And blessed be the most high God, which hath delivered thine enemies into thine hand. And Abram gave him tithes of all."},{"num":21,"verse":"Then the king of Sodom said to Abram, Give me the persons, and take the goods to thyself."},{"num":22,"verse":"And Abram said to the king of Sodom, I have lifted up mine hand unto the Lord the most high God possessor of heaven and earth,"},{"num":23,"verse":"That I will not take of all that is thine, so much as a thread or shoe latchet, lest thou shouldest say, I have made Abram rich,"},{"num":24,"verse":"Save only that, which the young men have eaten, and the parts of the men which went with me, Aner, Eshcol, and Mamre: let them take their parts."}]