[{"header":"Abram Battles Kings for Lot"},{"num":14,"verse":"At the time when Amraphel was king of Shinar, Arioch was king of Ellasar, Chedorlaomer was king of Elam, and Tidal was king of the Goiim, "},{"num":2,"verse":"they engaged in war against King Bera of Sodom, King Birsha of Gomorrah, King Shinab of Admah, King Shemeber of Zeboiim, along with the king of Bela (which was also known as Zoar). "},{"num":3,"verse":"All of this latter group of kings allied together in the Valley of Siddim (that is, the Salt Sea). "},{"num":4,"verse":"They were subject to Chedorlaomer for twelve years, but they rebelled in the thirteenth year."},{"num":5,"verse":"In the fourteenth year, Chedorlaomer and the kings with him came and defeated the Rephaim in Ashteroth-karnaim, the Zuzites in Ham, the Emites in Shaveh-kiriathaim, "},{"num":6,"verse":"and the Horites in the hill country of Seir, near El-paran by the desert. "},{"num":7,"verse":"Next they turned back and came to En-mishpat (which was also known as Kadesh) and conquered all the territory of the Amalekites, along with the Amorites who lived in Hazazon-tamar."},{"num":8,"verse":"Then the kings of Sodom, Gomorrah, Admah, Zeboiim, and Bela (which was also known as Zoar) prepared for battle in the Valley of Siddim "},{"num":9,"verse":"against King Chedorlaomer of Elam, King Tidal of Goiim, King Amraphel of Shinar, and King Arioch of Ellasar—four kings against five."},{"num":10,"verse":"Now the Valley of Siddim was full of tar pits, so when the kings of Sodom and Gomorrah fled, some of their people fell into them, while the rest fled to the hill country. "},{"num":11,"verse":"The conquerors captured all the possessions of Sodom and Gomorrah, including their entire food supply, and then left. "},{"num":12,"verse":"They also took Abram’s nephew Lot captive, and confiscated his possessions, since he was living in Sodom."},{"num":13,"verse":"Someone escaped, arrived, and reported what had happened to Abram the Hebrew, who was living by the oaks belonging to Mamre the Amorite, whose brothers Eshcol and Aner were allied with Abram. "},{"num":14,"verse":"When Abram heard that his nephew had been taken prisoner, he gathered together 318 of his trained men, who had been born in his household, and they went out in pursuit as far as Dan. "},{"num":15,"verse":"During the night, Abram and his servants divided his forces, conquered his enemies, and pursued them as far as Hobah, north of Damascus. "},{"num":16,"verse":"He recovered all the goods and brought back his nephew Lot, together with his possessions, the women, and the other people."},{"header":"The Blessing of Melchizedek"},{"num":17,"verse":"After Abram’s return from defeating Chedorlaomer and the kings who were with them, the king of Sodom went out to meet with him in the Shaveh Valley (that is, the King’s Valley). "},{"num":18,"verse":"King Melchizedek of Salem brought out bread and wine, since he was serving as the priest of God Most High. "},{"num":19,"verse":"Melchizedek blessed Abram and said,"},{"header":"Conversation with the King of Sodom"},{"num":21,"verse":"The king of Sodom told Abram, “Return the people to me, and you take the possessions for yourself.”"},{"num":22,"verse":"But Abram answered the king of Sodom, “I have made an oath to the Lord God Most High, Creator of heaven and earth, "},{"num":23,"verse":"that I will not take a thread or a sandal strap or anything that belongs to you, so you won’t be able to say, ‘I made Abram rich.’ "},{"num":24,"verse":"I will take nothing except what my warriors have eaten. But as for what belongs to the men who were allied with me, including Aner, Eshcol, and Mamre, let them take their share.”"}]