[{"num":1,"verse":"Then this: Amraphel king of Shinar, Arioch king of Ellasar, Kedorlaomer king of Elam, and Tidal king of Goiim went off to war to fight Bera king of Sodom, Birsha king of Gomorrah, Shinab king of Admah, Shemeber king of Zeboiim, and the king of Bela, that is, Zoar."},{"num":3,"verse":"This second group of kings, the attacked, came together at the Valley of Siddim, that is, the Salt Sea. They had been under the thumb of Kedorlaomer for twelve years. In the thirteenth year, they revolted."},{"num":5,"verse":"In the fourteenth year, Kedorlaomer and the kings allied with him set out and defeated the Rephaim in Ashteroth Karnaim, the Zuzim in Ham, the Emim in Shaveh Kiriathaim, and the Horites in their hill country of Seir as far as El Paran on the far edge of the desert. On their way back they stopped at En Mishpat, that is, Kadesh, and conquered the whole region of the Amalekites as well as that of the Amorites who lived in Hazazon Tamar."},{"num":8,"verse":"That’s when the king of Sodom marched out with the king of Gomorrah, the king of Admah, the king of Zeboiim, and the king of Bela, that is, Zoar. They drew up in battle formation against their enemies in the Valley of Siddim—against Kedorlaomer king of Elam, Tidal king of Goiim, Amraphel king of Shinar, and Arioch king of Ellasar, four kings against five."},{"num":10,"verse":"The Valley of Siddim was full of tar pits. When the kings of Sodom and Gomorrah fled, they fell into the tar pits, but the rest escaped into the mountains. The four kings captured all the possessions of Sodom and Gomorrah, all their food and equipment, and went on their way. They captured Lot, Abram’s nephew who was living in Sodom at the time, taking everything he owned with them."},{"num":13,"verse":"A fugitive came and reported to Abram the Hebrew. Abram was living at the Oaks of Mamre the Amorite, brother of Eshcol and Aner. They were allies of Abram. When Abram heard that his nephew had been taken prisoner, he lined up his servants, all of them born in his household—there were 318 of them—and chased after the captors all the way to Dan. Abram and his men split into small groups and attacked by night. They chased them as far as Hobah, just north of Damascus. They recovered all the plunder along with nephew Lot and his possessions, including the women and the people."},{"num":17,"verse":"After Abram returned from defeating Kedorlaomer and his allied kings, the king of Sodom came out to greet him in the Valley of Shaveh, the King’s Valley. Melchizedek, king of Salem, brought out bread and wine—he was priest of The High God—and blessed him:"},{"num":21,"verse":"The king of Sodom said to Abram, “Give me back the people but keep all the plunder for yourself.”"},{"num":22,"verse":"But Abram told the king of Sodom, “I swear to God, The High God, Creator of Heaven and Earth, this solemn oath, that I’ll take nothing from you, not so much as a thread or a shoestring. I’m not going to have you go around saying, ‘I made Abram rich.’ Nothing for me other than what the young men ate and the share of the men who went with me, Aner, Eshcol, and Mamre; they’re to get their share of the plunder.”"}]