[{"header":"Difficult Times Ahead in the Last Days"},{"num":3,"verse":"But know this, that in the last days difficult times will come, "},{"num":2,"verse":"for people will be lovers of themselves, lovers of money, boasters, arrogant, slanderers, disobedient to parents, ungrateful, unholy, "},{"num":3,"verse":"hardhearted, irreconcilable, slanderous, without self-control, savage, with no interest for what is good, "},{"num":4,"verse":"traitors, reckless, conceited, loving pleasure rather than loving God, "},{"num":5,"verse":"maintaining a form of godliness, but denying its power. Avoid these people. "},{"num":6,"verse":"For from these are those who slip into houses and captivate foolish women loaded down with sins, led by various kinds of desires, "},{"num":7,"verse":"always learning and never able to come to a knowledge of the truth. "},{"num":8,"verse":"And just as Jannes and Jambres opposed Moses, so also these oppose the truth, people corrupted in mind, disqualified concerning the faith. "},{"num":9,"verse":"But they will not progress to a greater extent, for their folly will be quite evident to everyone, as also the folly of those two was."},{"header":"The Value of the Scriptures"},{"num":10,"verse":"But you have faithfully followed my teaching, way of life, purpose, faith, patience, love, endurance, "},{"num":11,"verse":"persecutions, and sufferings that happened to me in Antioch, in Iconium, and in Lystra, what sort of persecutions I endured, and the Lord delivered me from all of them. "},{"num":12,"verse":"And indeed, all those who want to live in a godly manner in Christ Jesus will be persecuted. "},{"num":13,"verse":"But evil people and imposters will progress to the worse, deceiving and being deceived. "},{"num":14,"verse":"But you continue in the things which you have learned and are convinced of, because you know from whom you learned them, "},{"num":15,"verse":"and that from childhood you have known the holy writings that are able to make you wise for salvation through faith in Christ Jesus. "},{"num":16,"verse":"All scripture is inspired by God and profitable for teaching, for reproof, for correction, for training in righteousness, "},{"num":17,"verse":"in order that the person of God may be competent, equipped for every good work."}]