[{"num":3,"verse":"But de take  note  of ginōskō this houtos,  that hoti in en the  last eschatos days hēmera there  will  be enistēmi difficult chalepos times kairos; "},{"num":2,"verse":"for gar the ho people anthrōpos will  be eimi lovers  of  self philautos,  lovers  of  money philargyros,  braggarts alazōn,  arrogant hyperēphanos,  abusive blasphēmos,  disobedient apeithēs to  parents goneus,  ungrateful acharistos,  unholy anosios, "},{"num":3,"verse":"unloving astorgos,  unforgiving aspondos,  slanderous diabolos,  uncontrolled akratēs,  untamed anēmeros,  not  loving  the  good aphilagathos, "},{"num":4,"verse":"treacherous prodotēs,  reckless propetēs,  conceited typhoō,  loving  pleasure philēdonos rather mallon than ē loving  God philotheos, "},{"num":5,"verse":"having echō the  appearance morphōsis of  godliness eusebeia · ho but de denying arneomai its autos power dynamis;  and  so kai avoid apotrepō these  people houtos. "},{"num":6,"verse":"For gar some  of ek these houtos are eimi · ho creeping endynō into eis the ho homes oikia and kai capturing aichmalōtizō weak  women gynaikarion who  have  been  burdened sōreuō with  sins hamartia,  being  led  astray agō by  various poikilos passions epithumia, "},{"num":7,"verse":"always pantote learning manthanō and kai never mēdepote being  able dynamai to  come erchomai to eis a  knowledge epignōsis of  the  truth alētheia. "},{"num":8,"verse":"But de just  as hos Jannes Iannēs and kai Jambres Iambrēs opposed anthistēmi Moses Mōysēs,  so houtōs also kai these  men houtos are  opposing anthistēmi the ho truth alētheia,  men anthrōpos who  have  been  corrupted kataphtheirō in  the ho mind nous,  worthless adokimos concerning peri the ho faith pistis. "},{"num":9,"verse":"But alla they  will  not ou progress prokoptō very epi far polys;  · ho for gar their autos folly anoia will  be eimi very  clear ekdēlos to  all pas,  as hōs also kai was ginomai the ho folly  of  those ekeinos men . "},{"num":10,"verse":"But de you sy followed parakoloutheō my egō · ho teaching didaskalia,  my ho way  of  life agōgē,  my ho purpose prothesis,  my ho faith pistis,  my ho patience makrothumia,  my ho love agapē,  my ho steadfastness hypomonē, "},{"num":11,"verse":"my ho persecutions diōgmos,  my ho sufferings pathēma,  which hoios happened ginomai to  me egō in en Antioch Antiocheia,  in en Iconium Ikonion,  in en Lystra Lystra,  which hoios persecutions diōgmos I  endured hypopherō,  and kai out  of ek all pas these  the ho Lord kyrios rescued rhyomai me egō. "},{"num":12,"verse":"Indeed de also kai all pas · ho wishing thelō to  live zaō godly  lives eusebōs in en Christ Christos Jesus Iēsous will  be  persecuted diōkō, "},{"num":13,"verse":"while de wicked ponēros people anthrōpos and kai impostors goēs will  advance prokoptō from bad  to epi · ho worse cheirōn,  deceiving planaō and kai being  deceived planaō. "},{"num":14,"verse":"But de you sy,  remain menō in en what hos you  have  learned manthanō and kai have  been  convinced pistoō of ,  knowing oida from para whom tis you  learned manthanō"},{"num":15,"verse":"and kai that hoti from apo childhood brephos you  have  known oida the ho sacred hieros writings gramma,  which ho are  able dynamai to  make  you sy wise sophizō for eis salvation sōtēria through dia faith pistis that ho is  in en Christ Christos Jesus Iēsous. "},{"num":16,"verse":"All pas Scripture graphē is  breathed  out  by  God theopneustos and kai is  profitable ōphelimos for pros teaching didaskalia,  for pros reproof elegmos,  for pros correcting epanorthōsis,  for pros training paideia · ho in en righteousness dikaiosynē, "},{"num":17,"verse":"so  that hina the ho man anthrōpos of ho God theos may  be eimi proficient artios,  fully  equipped exartizō for pros every pas good agathos work ergon. "}]