[{"header":"Sanballat Opposes the Reconstruction"},{"num":4,"verse":"When Sanballat heard that we were reconstructing the wall, he flew into a rage, became indignant, and mocked the Jews. "},{"num":2,"verse":"He addressed his allies and the Samaritan officials, saying “What are these pathetic Jews doing? Are they intending to rebuild it by themselves? Do they intend to offer sacrifices? Will they finish in a single day? Can they make stones from this burned out rubble?”"},{"num":3,"verse":"Tobiah the Ammonite stood to the side, commenting, “If a fox were to jump onto what they’re building, it would collapse their stone wall!”"},{"header":"Nehemiah’s Prayer"},{"num":4,"verse":"“Listen, our God, because we are being mocked. Let their insults fall back on them, and let them be dragged away as captives into exile. "},{"num":5,"verse":"Don’t atone their iniquity, and don’t let their sin be blotted out from before you, because they have demoralized the builders.”"},{"num":6,"verse":"So we rebuilt the wall, completing it halfway up, because the people were committed to working."},{"header":"Sanballat Reacts to the Progress"},{"num":7,"verse":"But when Sanballat, Tobiah, the Arabs, the Ammonites, and the Ashdodites heard that the repair work on the Jerusalem wall was progressing and that its breaches were being repaired, they flew into a rage. "},{"num":8,"verse":"So they all conspired together to invade and fight against Jerusalem, creating confusion there."},{"header":"Nehemiah Reacts to Sanballat"},{"num":9,"verse":"But we prayed to our God. We also set up guards day and night because of them."},{"num":10,"verse":"Meanwhile, the people of Judah said, “The builders are tired and there’s so much rubble that we can’t reconstruct the wall!”"},{"num":11,"verse":"Our enemies said, “Before they notice or see us, we’ll penetrate their midst, kill them, and stop the work!”"},{"num":12,"verse":"The Jews who lived near them kept coming to us, reporting at least ten times, “They’ll attack us from every direction.” "},{"num":13,"verse":"So I stationed the people by families behind the wall in the lower exposed areas, equipping them with their swords, spears, and bows."},{"num":14,"verse":"Looking things over, I stood up and spoke to the officials, the military leaders, and the rest of the people: “Don’t fear them. Remember the great and awe-inspiring Lord. Fight for your brothers, your sons, your daughters, your wives, and your homes.”"},{"num":15,"verse":"Our opponents heard that we had learned about them, that God had brought their plans to failure, and that each and every one of us had come to work on the wall. "},{"num":16,"verse":"From that day on, half of my helpers engaged in the work while the other half kept spears, shields, bows, and armor ready. The senior officials backed all of the Judeans "},{"num":17,"verse":"who worked on the wall. Those who carried building materials worked with one hand, carrying a spear in the other. "},{"num":18,"verse":"Each builder worked with a sword strapped to his side, while a trumpeter remained beside me to sound an alarm."},{"num":19,"verse":"I told the officials, rulers, and the rest of the people, “The project is large and extensive, and we are separated from each other on the wall, "},{"num":20,"verse":"so wherever you hear the sound of the trumpet, come over to us, and our God will fight for us!” "},{"num":21,"verse":"So we worked hard, half of us holding spears from dawn to dusk."},{"num":22,"verse":"At the same time I told the people, “Let’s have everyone sleep at night inside Jerusalem with their servants, so they can guard us at night and work during the day. "},{"num":23,"verse":"No one—neither I, my allies, my servants, nor the bodyguards who accompanied me—changed clothes. Everyone carried a weapon even while going for water."}]