[[],[{"type":"header","content":"Ahab Covets Naboth’s Vineyard"},{"type":"prose","content":"Now it came about after these things that Naboth the Jezreelite had a vineyard in Jezreel, close beside the [winter] palace of Ahab king of Samaria; "}],[{"type":"prose","content":"Ahab spoke to Naboth, saying, “Give me your vineyard, so that I may have it for a garden of vegetables  herbs, because it is near my house. I will give you a better vineyard for it, or, if you prefer, I will give you what it is worth in money.” "}],[{"type":"prose","content":"But Naboth said to Ahab, “The LORD forbid me that I should give the inheritance of my fathers to you.” "}],[{"type":"prose","content":"So Ahab [already upset by the Lord’s message] came into his house [feeling more] resentful and sullen because of what Naboth the Jezreelite had said to him; for he had said, “I will not give you the inheritance of my fathers.” And he lay down on his bed and turned away his face, and would not eat any food."}],[{"type":"prose","content":"Then Jezebel his wife came to him and asked him, “Why is your spirit so troubled that you have not eaten?” "}],[{"type":"prose","content":"And he said to her, “Because I spoke to Naboth the Jezreelite and said to him, ‘Give me your vineyard for money; or if you prefer, I will give you  vineyard for it.’ But he answered, ‘I will not give you my vineyard.’” "}],[{"type":"prose","content":"Jezebel his wife said to him, “Do you now reign over Israel? Get up, eat food, and let your heart rejoice; I will give you the vineyard of Naboth the Jezreelite.”"}],[{"type":"prose","content":"So she wrote letters in Ahab’s name and sealed them with his seal, and sent them to the elders and nobles who lived with Naboth in his city. "}],[{"type":"prose","content":"Now in the letters she wrote, “Proclaim a fast and seat Naboth at the head of the people; "}],[{"type":"prose","content":"and seat two worthless  unprincipled men opposite him, and have them testify against him, saying, ‘You cursed God and the king.’ Then take him out and stone him to death.”"}],[{"type":"header","content":"Jezebel’s Plot"},{"type":"prose","content":"So the men of his city, the elders and the nobles who lived there, did as Jezebel had sent  to them, just as it was written in the letters which she had sent to them. "}],[{"type":"prose","content":"They proclaimed a fast and seated Naboth at the head of the people. "}],[{"type":"prose","content":"Two worthless  unprincipled men came in and sat down opposite him; and they testified against Naboth before the people, saying, “Naboth cursed  renounced God and the king.” Then they brought him outside the city and stoned him to death. "}],[{"type":"prose","content":"Then they sent  to Jezebel, saying, “Naboth has been stoned to death.”"}],[{"type":"prose","content":"When Jezebel heard that Naboth had been stoned and was dead, she said to Ahab, “Arise, take possession of the vineyard of Naboth the Jezreelite which he refused to sell you, because Naboth is no longer alive, but dead.” "}],[{"type":"prose","content":"When Ahab heard that Naboth was dead, he arose to go down to the vineyard of Naboth the Jezreelite, to take possession of it."}],[{"type":"prose","content":"Then the word of the LORD came to Elijah the Tishbite, saying, "}],[{"type":"prose","content":"“Arise, go down to meet Ahab king of Israel, who is in Samaria. Behold, he is in the vineyard of Naboth, where he has gone to take possession of it. "}],[{"type":"prose","content":"You shall speak to him, saying, ‘Thus says the LORD: “Have you murdered and also taken possession [of the victim’s property]?”’ And you shall speak to him, saying, ‘Thus says the Lord: “In the place where dogs licked up the blood of Naboth, dogs will lick up your blood as well.”’”"}],[{"type":"prose","content":"Ahab said to Elijah, “Have you found me, O my enemy?” And he answered, “I have found you, because you have sold yourself to do evil in the sight of the LORD. "}],[{"type":"prose","content":"Behold [says the LORD], I am bringing evil (catastrophe) on you, and will utterly sweep you away, and will cut off from Ahab every male, both bond and free in Israel; "}],[{"type":"prose","content":"and I will make your house (descendants) like that of Jeroboam the son of Nebat, and like the house of Baasha the son of Ahijah, for provoking Me to anger and making Israel sin. "}],[{"type":"prose","content":"The LORD also spoke in regard to Jezebel, saying, ‘The dogs will eat [the body of] Jezebel in the district of Jezreel.’ "}],[{"type":"prose","content":"The dogs will eat anyone belonging to Ahab who dies in the city, and the birds of the air will eat anyone who dies in the field.”"}],[{"type":"prose","content":"There certainly was no one like Ahab who sold himself to do evil in the sight of the LORD, because Jezebel his wife incited him. "}],[{"type":"prose","content":"He acted very repulsively in following idols, in accordance with everything the Amorites had done, whom the LORD expelled [from the land] before the sons of Israel."}],[{"type":"prose","content":"Now when Ahab heard these words [of Elijah], he tore his clothes, put on sackcloth and fasted, and he lay in sackcloth and went about dejectedly (mourning). "}],[{"type":"prose","content":"Then the word of the LORD came to Elijah the Tishbite, saying, "}],[{"type":"prose","content":"“Do you see how Ahab has humbled himself before Me? Because he has humbled himself before Me, I will not bring the evil (catastrophe) in his lifetime, but in his son’s days I will bring evil upon his house.”"}]]