[{"num":21,"verse":"A while later, an incident occurred involving Navot the Yizre‘eli. He owned a vineyard in Yizre‘el, right next to the palace of Ach’av king of Shomron. "},{"num":2,"verse":"Ach’av spoke to Navot and said, “Give me your vineyard, so that I can have it as my vegetable garden, because it’s close to my palace. In exchange I will give you a better vineyard; or, if you prefer, I will give you its monetary value.” "},{"num":3,"verse":"But Navot said to Ach’av, “Adonai forbid that I should give you my ancestral heritage!” "},{"num":4,"verse":"Ach’av went home resentful and depressed at what Navot the Yizre‘eli had said to him, since he had said, “I won’t give you my ancestral heritage.” He lay down on his bed, turned his face away and refused to eat. "},{"num":5,"verse":"Izevel his wife went and said to him, “Why are you so depressed that you refuse to eat?” "},{"num":6,"verse":"He answered her, “Because I spoke to Navot the Yizre‘eli and said to him, “Sell me your vineyard for money; or else, if you prefer, I will give you another vineyard for it”; but he answered, “I won’t give you my vineyard.” "},{"num":7,"verse":"“Are you the king of Isra’el or not?” asked his wife Izevel. “Get up, eat some food, and cheer up! I will give you the vineyard of Navot the Yizre‘eli.”"},{"num":8,"verse":"So she wrote letters in Ach’av’s name, sealed them with his seal and sent the letters to the leaders and notables of the city where Navot lived. "},{"num":9,"verse":"In the letters she wrote, “Proclaim a fast, and give Navot the seat of honor among the people. "},{"num":10,"verse":"Have two good-for-nothing men sit opposite him, and have them accuse him publicly of cursing God and the king. Then take him outside and stone him to death.”"},{"num":11,"verse":"The leaders and notables of the city he lived in did as Izevel had written in the letters she sent to them. "},{"num":12,"verse":"They proclaimed a fast and gave Navot the seat of honor among the people. "},{"num":13,"verse":"The two good-for-nothing men came in and sat opposite him, and these scoundrels publicly accused Navot, saying, “Navot cursed God and the king.” So they took him outside the city and stoned him to death, "},{"num":14,"verse":"then sent a message to Izevel, “Navot has been stoned to death.”"},{"num":15,"verse":"When Izevel heard that Navot had been stoned to death, she said to Ach’av, “Get up, and take possession of the vineyard that Navot the Yizre‘eli refused to sell you, because Navot is no longer alive; he is dead.” "},{"num":16,"verse":"When Ach’av heard that Navot was dead, he set out to go down to the vineyard of Navot the Yizre‘eli, to take possession of it."},{"num":17,"verse":"But the word of Adonai came to Eliyahu from Tishbe: "},{"num":18,"verse":"“Get up, go down to meet Ach’av king of Isra’el, who lives in Shomron. Right now he is in the vineyard of Navot; he has gone down there to take possession of it. "},{"num":19,"verse":"This is what you are to say to him: ‘Here is what Adonai says: “You have committed murder, and now you are stealing the victim’s property!” ’ Also say to him, ‘Here is what Adonai says: “In the very place where dogs licked up the blood of Navot, dogs will lick up your blood — yours!” ’”"},{"num":20,"verse":"Ach’av said to Eliyahu, “My enemy! You’ve found me!” He answered, “Yes, I have found you; because you have given yourself over to do what is evil from Adonai’s perspective. "},{"num":21,"verse":"‘Here,’ [says Adonai,] ‘I am bringing disaster on you! I will sweep you away completely; I will cut off from Ach’av every male, whether a slave or free in Isra’el. "},{"num":22,"verse":"I will make your house like the house of Yarov‘am the son of N’vat and like the house of Ba‘sha the son of Achiyah for provoking my anger and leading Isra’el into sin.’ "},{"num":23,"verse":"Adonai also said this about Izevel: ‘The dogs will eat Izevel by the wall around Yizre‘el. "},{"num":24,"verse":"If someone from the line of Ach’av dies in the city, the dogs will eat him; if he dies in the countryside, the vultures will eat him.’”"},{"num":25,"verse":"Truly, there was never anyone like Ach’av. Stirred up by his wife Izevel, he gave himself over to do what is evil from Adonai’s perspective. "},{"num":26,"verse":"His behavior in following idols was grossly abominable; he did everything the Emori had done, whom Adonai expelled ahead of the people of Isra’el."},{"num":27,"verse":"Ach’av, on hearing these words, tore his clothes, put sackcloth on himself and fasted. He slept in the sackcloth and went about dejectedly. "},{"num":28,"verse":"Then the word of Adonai came to Eliyahu from Tishbe: "},{"num":29,"verse":"“Do you see how Ach’av has humbled himself before me? Since he has humbled himself before me, I will not bring this evil during his lifetime; but during his son’s lifetime I will bring the evil on his house.”"}]