[{"header":"Naboth’s Vineyard"},{"num":21,"verse":"A man named Naboth owned a vineyard. It was in Jezreel, near the palace of Ahab king of Israel. "},{"num":2,"verse":"One day Ahab said to Naboth, “Give me your vineyard. It is near my palace. I want to make it into a vegetable garden. I will give you a better vineyard in its place. Or, if you prefer, I will pay you what it is worth.”"},{"num":3,"verse":"Naboth answered, “May the Lord keep me from ever giving my land to you. It belongs to my family.”"},{"num":4,"verse":"So Ahab went home, angry and upset. He did not like what Naboth from Jezreel had said. (Naboth had said, “I will not give you my family’s land.”) So Ahab lay down on his bed. He turned his face to the wall and refused to eat."},{"num":5,"verse":"His wife, Jezebel, came in. She asked him, “Why are you upset? Why do you refuse to eat?”"},{"num":6,"verse":"Ahab answered, “I talked to Naboth, the man from Jezreel. I said, ‘Sell me your vineyard. Or, if you prefer, I will give you another vineyard for it.’ But Naboth refused.”"},{"num":7,"verse":"Jezebel answered, “Is this how you rule as king over Israel? Get out of bed. Eat something. Cheer up. I will get Naboth’s vineyard for you.”"},{"num":8,"verse":"So Jezebel wrote some letters and signed Ahab’s name to them. And she used his own seal to seal them. Then she sent them to the elders and important men who lived in Naboth’s town. "},{"num":9,"verse":"The letter she wrote said: “Declare a day during which the people are to give up eating. Call the people together. And give Naboth a place of honor among them. "},{"num":10,"verse":"Seat two troublemakers across from him. Have them say they heard Naboth speak against God and the king. Then take Naboth out of the city and kill him with stones.”"},{"num":11,"verse":"So the elders and important men of Jezreel obeyed Jezebel’s command. "},{"num":12,"verse":"They declared a special day. On that day the people were to give up eating. They called the people together. And they put Naboth in a place of honor before the people. "},{"num":13,"verse":"Then two troublemakers sat across from Naboth. They said they had heard Naboth speak against God and the king. So the people carried Naboth out of the city. And they killed him with stones. "},{"num":14,"verse":"Then the leaders sent a message to Jezebel. It said, “Naboth has been killed.”"},{"num":15,"verse":"When Jezebel heard that Naboth had been killed, she told Ahab. She said, “Naboth of Jezreel is dead. Now you may go and take for yourself his vineyard you wanted.” "},{"num":16,"verse":"When Ahab heard that Naboth was dead, he left. He went to the vineyard to take it for his own."},{"num":17,"verse":"At this time the Lord spoke his word to Elijah. (Elijah was the prophet from Tishbe.) The Lord said, "},{"num":18,"verse":"“Go to Ahab king of Israel, who rules in Samaria. He is at Naboth’s vineyard to take it as his own. "},{"num":19,"verse":"Tell Ahab that I, the Lord, say to him, ‘Ahab! You have murdered Naboth and have taken his land. So I tell you this! In the same place that Naboth died, you will also die. The dogs that licked up Naboth’s blood will lick up your blood in the same place!’”"},{"num":20,"verse":"When Ahab saw Elijah, he said, “So you have found me, my enemy!”"},{"num":21,"verse":"So the Lord says to you, ‘I will destroy you. I will kill you and every male in your family, both slave and free. "},{"num":22,"verse":"Your family will be like the family of King Jeroboam son of Nebat. And it will be like the family of King Baasha son of Ahijah. Both of these families were completely destroyed. I will do this to you because you have made me angry. And you have caused the people of Israel to sin.’"},{"num":23,"verse":"“And the Lord also says, ‘Dogs will eat the body of Jezebel in the city of Jezreel.’"},{"num":24,"verse":"“Anyone in your family who dies in the city will be eaten by dogs. Anyone who dies in the fields will be eaten by birds.”"},{"num":25,"verse":"There was no one like Ahab. No one had so often chosen to do what the Lord said was wrong. His wife Jezebel influenced him to do evil. "},{"num":26,"verse":"Ahab sinned terribly by worshiping idols. This was the same thing the Amorite people did. So the Lord took their land away from them. And he gave it to the people of Israel."},{"num":27,"verse":"After Elijah finished speaking, Ahab tore his clothes. He put on rough cloth and refused to eat. He even slept in the rough cloth. He did this to show how sad and upset he was."},{"num":28,"verse":"The Lord spoke his word to Elijah from Tishbe: "},{"num":29,"verse":"“I see that Ahab is now sorry for what he has done. So I will not cause the trouble to come to him during his life. I will wait until his son is king. Then I will bring this trouble to Ahab’s family.”"}]