[{"num":21,"verse":"Naboth, a man from Jezreel, had a vineyard on the outskirts of the city near King Ahab’s palace. "},{"num":2,"verse":"One day the king talked to him about selling him this land."},{"num":3,"verse":"But Naboth replied, “Not on your life! That land has been in my family for generations.”"},{"num":4,"verse":"So Ahab went back to the palace angry and sullen. He refused to eat and went to bed with his face to the wall!"},{"num":5,"verse":"“What in the world is the matter?” his wife, Jezebel, asked him. “Why aren’t you eating? What has made you so upset and angry?”"},{"num":6,"verse":"“I asked Naboth to sell me his vineyard or to trade it, and he refused!” Ahab told her."},{"num":7,"verse":"“Are you the king of Israel or not?” Jezebel demanded. “Get up and eat and don’t worry about it. I’ll get you Naboth’s vineyard!”"},{"num":8,"verse":"So she wrote letters in Ahab’s name, sealed them with his seal, and addressed them to the civic leaders of Jezreel, where Naboth lived. "},{"num":9,"verse":"In her letter she commanded: “Call the citizens together for fasting and prayer. Then summon Naboth, "},{"num":10,"verse":"and find two scoundrels who will accuse him of cursing God and the king. Then take him out and execute him.”"},{"num":11,"verse":"The city fathers followed the queen’s instructions. "},{"num":12,"verse":"They called the meeting and put Naboth on trial. "},{"num":13,"verse":"Then two men who had no conscience accused him of cursing God and the king; and he was dragged outside the city and stoned to death. "},{"num":14,"verse":"The city officials then sent word to Jezebel that Naboth was dead."},{"num":15,"verse":"When Jezebel heard the news, she said to Ahab, “You know the vineyard Naboth wouldn’t sell you? Well, you can have it now! He’s dead!”"},{"num":16,"verse":"So Ahab went down to the vineyard to claim it."},{"num":17,"verse":"But the Lord said to Elijah, "},{"num":18,"verse":"“Go to Samaria to meet King Ahab. He will be at Naboth’s vineyard, taking possession of it. "},{"num":19,"verse":"Give him this message from me: ‘Isn’t killing Naboth bad enough? Must you rob him too? Because you have done this, dogs shall lick your blood outside the city just as they licked the blood of Naboth!’”"},{"num":20,"verse":"“So my enemy has found me!” Ahab exclaimed to Elijah."},{"num":21,"verse":"The Lord is going to bring great harm to you and sweep you away; he will not let a single one of your male descendants survive! "},{"num":22,"verse":"He is going to destroy your family as he did the family of King Jeroboam and the family of King Baasha, for you have made him very angry and have led all of Israel into sin. "},{"num":23,"verse":"The Lord has also told me that the dogs of Jezreel shall tear apart the body of your wife, Jezebel. "},{"num":24,"verse":"The members of your family who die in the city shall be eaten by dogs, and those who die in the country shall be eaten by vultures.”"},{"num":25,"verse":"No one else was so completely sold out to the devil as Ahab, for his wife, Jezebel, encouraged him to do every sort of evil. "},{"num":26,"verse":"He was especially guilty because he worshiped idols just as the Amorites did—the people whom the Lord had chased out of the land to make room for the people of Israel. "},{"num":27,"verse":"When Ahab heard these prophecies, he tore his clothing, put on rags, fasted, slept in sackcloth, and went about in deep humility."},{"num":28,"verse":"Then another message came to Elijah: "},{"num":29,"verse":"“Do you see how Ahab has humbled himself before me? Because he has done this, I will not do what I promised during his lifetime; it will happen to his sons; I will destroy his descendants.”"}]