[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(3) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Because of affliction.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The Authorised version suggests the thought that the words refer to the voluntary emigration of those who went to Egypt and other countries (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 42:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), to avoid the oppression to which they were subject in their own land. The Hebrew admits, however, of the rendering “from affliction,” and so the words speak of the forcible deportation of the people from misery at home to a yet worse misery in Babylon as the land of their exile. Even there they found no “rest” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 28:65",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Their persecutors hunted them down to the “straits” from which no escape was possible.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Lamentations 1:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Lamentations 1:3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Judah is gone into captivity because of affliction, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — Her miseries have received their finishing stroke in a total captivity among, and bondage to, heathen and infidels, because of the oppression exercised by her rulers and others, and the servitude to which they obliged their subjects and inferiors. This is the interpretation adopted by the Chaldee paraphrast, who represents the Jews as having been carried into captivity, in retaliation of their having oppressed the widows and the fatherless among them, and prolonged illegally the bondage of their brethren who had been sold for slaves. But, as the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "גלה",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", here used, does not necessarily signify ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to go into captivity, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "but often to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "remove, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "go into exile, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "whether voluntarily or by compulsion; Blaney thinks that “a voluntary migration of the Jews is here intended, many of whom, previous to the captivity, had left their country, and retired into Egypt and other parts, to avoid the oppressions and servitude that they had reason to apprehend from the Chaldeans, who had invaded, or were about to invade, their land. Either of these senses,” however, he observes, “is competent; and the interpretation according to them will be found to suit perfectly with the subsequent members of the period.” ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "She findeth no rest — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "No satisfaction of mind, no settled place of abode, no remission of labour, terror, and suffering; but, deprived of all peace and comfort, is continually exposed to every insult and outrage, and to all manner of oppressions and vexations. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "All her persecutors — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "pursuers, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "rather; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "overtook her between the straits — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That is, all her enemies have taken the opportunity of her being in a difficult and distressed condition, to oppress and injure her. The expression is metaphorical, taken from those who hunt their prey, which they are wont to drive into some strait and difficult passage, from whence it cannot escape.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1:1-11 The prophet sometimes speaks in his own person; at other times Jerusalem, as a distressed female, is the speaker, or some of the Jews. The description shows the miseries of the Jewish nation. Jerusalem became a captive and a slave, by reason of the greatness of her sins; and had no rest from suffering. If we allow sin, our greatest adversary, to have dominion over us, justly will other enemies also be suffered to have dominion. The people endured the extremities of famine and distress. In this sad condition Jerusalem acknowledged her sin, and entreated the Lord to look upon her case. This is the only way to make ourselves easy under our burdens; for it is the just anger of the Lord for man's transgressions, that has filled the earth with sorrows, lamentations, sickness, and death.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Because of ... - i. e. the people, not of Jerusalem only, but of the whole land, \"is gone into exile to escape from the affliction and laborious servitude,\" to which they are subject in their own land.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Persecutors ... between the straits - Rather, \"pursuers ... in the midst of her straits.\" The Jews flee like deer to escape from the invading Chaldaeans, but are driven by them into places from where there is no escape. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Persecutors ... between the straits - Rather, \"pursuers ... in the midst of her straits.\" The Jews flee like deer to escape from the invading Chaldaeans, but are driven by them into places from where there is no escape. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3. (Jer 52:27).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "because of great servitude—that is, in a state \"of great servitude,\" endured from the Chaldeans. \"Because\" is made by Vatablus indicative of the cause of her captivity; namely, her having \"afflicted\" and unjustly brought into \"servitude\" the manumitted bond-servants (Jer 34:8-22). Maurer explains it, \"Judah has left her land (not literally 'gone into captivity') because of the yoke imposed on it by Nebuchadnezzar.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "no rest—(De 28:64, 65).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "overtook her between … straits—image from robbers, who in the East intercept travellers at the narrow passes in hilly regions.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Daleth.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " This is expounded as the cause why the Jews were carried into captivity, because of the servitude and oppression exercised amongst them, oppression by their rulers, and servitude more generally, keeping their servants beyond the year of jubilee, when they ought to have set them at liberty; and that this was one cause appeareth from ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Jeremiah 34:17",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 34:17",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ": or if ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "because of affliction, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "& c. be joined to the next words, the sense is plain, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "she dwelleth amongst the heathen, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " by reason of her low condition, and the state of servitude she is in; where she, that is, the Jews, have neither any satisfaction nor quiet in their own minds, nor are they by their enemies suffered to be at quiet any where. Those that pursued them with all violence to destroy them overtook them in places where they could not escape them, as huntsmen and others take their game by driving them into strait and narrow places. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Judah is gone into captivity,.... Not only Jerusalem the metropolis of Judea was destroyed, but the whole country was ravaged, and the inhabitants of it carried captive into Babylon: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "because of affliction, and because of great servitude; because of their sins in oppressing and afflicting their poor brethren, and retaining them in a state of bondage after their seven years' servitude, contrary to the law of God; for which they were threatened with captivity, Jeremiah 34:13; so the Targum, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "because of affliction, and because of great servitude; because of their sins in oppressing and afflicting their poor brethren, and retaining them in a state of bondage after their seven years' servitude, contrary to the law of God; for which they were threatened with captivity, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 34:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; so the Targum, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"the house of Judah went into captivity, because they afflicted the fatherless and the widows; and because of the multitude of service which they caused their brethren the children of Israel to serve, who were sold unto them; and they did not proclaim liberty to their servants and maidens, who were of the seed of Israel:'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "or, \"through affliction, and through great servitude\" (l); that is, through the affliction and servitude they suffered by the Chaldeans, into whose hands they fell; though some understand it of the Jews, who, to escape the affliction and servitude of the Chaldeans, went into a kind of voluntary captivity, fleeing to the countries of Moab, Ammon, and Edom, during the siege of Jerusalem by the Chaldeans; see Jeremiah 40:11; ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "or, \"through affliction, and through great servitude\" (l); that is, through the affliction and servitude they suffered by the Chaldeans, into whose hands they fell; though some understand it of the Jews, who, to escape the affliction and servitude of the Chaldeans, went into a kind of voluntary captivity, fleeing to the countries of Moab, Ammon, and Edom, during the siege of Jerusalem by the Chaldeans; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 40:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "she dwelleth among the Heathen; the uncircumcised and the unclean; and so was deprived of both her civil and religious liberties; having no opportunity of worshipping God, and enjoying him in his courts, as formerly; and which must be very uncomfortable living, especially to those who were truly gracious: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "she findeth no rest. The Targum adds, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"because of the hard service to which they subjected her;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "she found no natural rest, being carried from place to place; nor civil rest, being kept in hard bondage; nor spiritual rest, being deprived of the worship and ordinances of God; and being conscious of her sins, which had brought all this misery on her: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "all her persecutors overtook her between the straits; having hunted her as men hunt wild beasts, and get them into some strait and difficult place, and then seize on them. The Targum interprets it, between the borders; or between the hedges, as Ben Melech; and so Jarchi, of the borders of a field and vineyard; and of a ditch on the one side and the other, that there is no room to escape; and who makes mention of a Midrash, that explains it not of place, but time, between the seventeenth day of Tammuz, and the ninth of Ab; see Jeremiah 52:7. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "all her persecutors overtook her between the straits; having hunted her as men hunt wild beasts, and get them into some strait and difficult place, and then seize on them. The Targum interprets it, between the borders; or between the hedges, as Ben Melech; and so Jarchi, of the borders of a field and vineyard; and of a ditch on the one side and the other, that there is no room to escape; and who makes mention of a Midrash, that explains it not of place, but time, between the seventeenth day of Tammuz, and the ninth of Ab; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 52:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(l) \"per afflictionem\"; \"hic, non prae, sed per significat\", Grotius; \"vel prae afflictione, sub. a Chaldaeis perpessa\"; so some in Vatablus. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(l) \"per afflictionem\"; \"hic, non prae, sed per significat\", Grotius; \"vel prae afflictione, sub. a Chaldaeis perpessa\"; so some in Vatablus. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Judah is gone into captivity because {e} of affliction, and because of great servitude: she dwelleth among the nations, she findeth no rest: all her persecutors overtook her in the midst of distress.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Judah is gone into captivity because ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{e}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " of affliction, and because of great servitude: she dwelleth among the nations, she findeth no rest: all her persecutors overtook her in the midst of distress.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) For her cruelty toward the poor and oppression of servants, Jer 34:11.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "is gone into captivity because of affliction",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The better rendering is, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "is gone into",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "exile",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (so mg.) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "because of affliction",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", i.e. the long sufferings of the Jews at the hands of Egypt and Chaldaea had induced many of them to go voluntarily to dwell in other lands. That this frequently took place we gather from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 40:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This is better than the alternative rendering (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "taken",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "out of",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " affliction (into Babylon), as this would be a lightening of the picture hardly in consonance with the purpose of the writer. If, however, this latter be the sense, the word “servitude” will be illustrated by the “hard service” inflicted on exiles in Babylon according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 14:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "within the straits",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] distresses, oppression. The Jews have been hemmed in and harassed by their foes.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 3.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Is gone into captivity because of affliction;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "is gone into exile",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc. The poet is not thinking of the deportation of the captives, but of those Jews who sought refuge for themselves in foreign lands (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 40:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). An objection has been raised to this view that the number of fugitive Jews would not be large enough to warrant their being called \"Judah.\" But we might almost as well object on a similar ground to the application of the term \"Judah\" to the Jews who were carried to Babylon. The truth may, perhaps, be that, after the fall of Jerusalem, the Jewish nation became split up into three parts: ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(1)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the Jews who succeeded in escaping into Egypt or elsewhere; ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(2)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " those who were carried captive; ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(3)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the mass of the common people, who remained on their native soil, Keil, however, retains the view of the Authorized Version, only substituting  \"out of\" for \"because of.\" \"Out of\" the misery into which the Jews had been brought by the invasions of Necho and Nebuchadnezzar they passed into the new misery of captivity. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Among the heathen;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "among the nations. Between the straits.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "among the nations. ",
            "children": []
          },
          {
            "element": "span",
            "class": "cmt_word",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Between the straits.",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The phrase is peculiar, and reminds us of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 118:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"Out of the strait I called unto thee.\" \"A strait,\" or narrow place, clearly means adversity, just as \"a large place\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 118:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") means prosperity. Lamentations 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "With ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Lamentations 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " begins the specific account of the misery over which Jerusalem sorrows so deeply. Judah has gone into exile, but she does not find any rest there among the nations. \"Judah\" is the population not merely of Jerusalem, but of the whole kingdom, whose deportation is bewailed by Jerusalem as the mother of the whole country. Although יהוּדה designates the people, and not the country, it is construed as a feminine, because the inhabitants are regarded as the daughter of the land; cf. Ewald, 174, b [and Gesenius, 107, 4, a]. 'מעני וגו has been explained, since J. D. Michaelis, by most modern expositors (Rosenmller, Maurer, Ewald, Thenius, Ngelsbach), and previously by Calvin, as referring to the cause of the emigration, \"from (because of) misery and much servitude;\" and in harmony with this view, גּלתה יהוּדה has been understood, not of the deportation of Judah into exile, but of the voluntary emigration of the fugitives who sought to escape from the power of the Chaldeans by fleeing into foreign countries, partly before and partly after the destruction of Jerusalem. But this interpretation neither agrees with the meaning of the words nor the context.   Those fugitives cannot be designated \"Judah,\" because, however numerous one may think they were, they formed but a fraction of the inhabitants of Judah: the flower of the nation had been carried off to Babylon into exile, for which the usual word is גּלה. The context also requires us to refer the words to involuntary emigration into exile. For, in comparison with this, the emigration of fugitives to different countries was so unimportant a matter that the writer could not possibly have been silent regarding the deportation of the people, and placed this secondary consideration in the foreground as the cause of the sorrow. מעני is not to be taken in a causal sense, for מן simply denotes the coming out of a certain condition, \"out of misery,\" into which Judah had fallen through the occupation of the country, first by Pharaoh-Necho, then by the Chaldeans; and רב עבדה does not mean \"much service,\" but \"much labour.\" For עבדה does not mean \"service\" ( equals עבדוּת), but \"labour, work, business,\" e.g., עבדת המּלך, \"the service of the king,\" i.e., the service to be rendered to the king in the shape of work (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 26:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and the labour connected with public worship (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 9:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 28:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.); here, in connection with עני, it means severe labour and toil which the people had to render, partly for the king, that he might get ready the tribute imposed on the country, and partly to defend the country and the capital against those who sought to conquer them. Although Judah had wandered out from a condition of misery and toil into exile, yet even there she found no rest among the nations, just as Moses had already predicted to the faithless nation, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 28:65",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". All her pursuers find her בּין המּצרים, inter angustias (Vulgate). This word denotes \"straits,\" narrow places where escape is impossible (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 116:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 118:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), or circumstances in life from which no escape can be found.",
        "children": []
      }
    ]
  }
]