[{"num":12,"verse":"And Iyov answered and said,"},{"num":2,"verse":"Doubtless then ye are the people, and chochmah shall die with you."},{"num":3,"verse":"But I have levav (understanding) as well as you; I am not inferior to you; yea, who knoweth not such things as these?"},{"num":4,"verse":"I am as a laughingstock to his neighbor: The man who calleth upon Eloah [they say of me], and He answereth him! [To them I am] a laughingstock, the tzaddik, the tamim (blameless one)!"},{"num":5,"verse":"Those at ease have buz (contempt) for a downfall which awaits the one whose regel is slipping."},{"num":6,"verse":"The ohalim of shodedim (robbers) remain in peace; they that defy El are secure, who Eloah brought forth by His yad."},{"num":7,"verse":"But ask now the behemot, and they shall teach thee, and the oph haShomayim (birds of the air), and they shall tell thee;"},{"num":8,"verse":"Or speak to ha’aretz, and it shall teach thee; and the dagim of the yam shall declare unto thee."},{"num":9,"verse":"Of all of these, who lacketh da’as that the yad Hashem hath wrought this?"},{"num":10,"verse":"In whose yad is the nefesh of every living thing, and the ruach of kol basar ish."},{"num":11,"verse":"Doth not the ozen (ear) test words? And the mouth tastes its ochel?"},{"num":12,"verse":"With the ancient ones is chochmah; and in orech yamim (length of days) is binah (understanding)."},{"num":13,"verse":"With Him is chochmah and gevurah; He hath etzah and understanding."},{"num":14,"verse":"See, what He tears down cannot be reconstructed; He shutteth up an ish, and there can be no prison release."},{"num":15,"verse":"See, He withholdeth the waters, and they dry up; also He sendeth them out, and they overturn eretz."},{"num":16,"verse":"With Him is oz (strength) and tushiyyah (true wisdom); the deceived and the deceiver are His."},{"num":17,"verse":"He leadeth yoatzim (counsellors) away stripped, and maketh the shofetim (judges) fools."},{"num":18,"verse":"He looseth the shackle of melachim (kings), and girdeth their loins with loincloth."},{"num":19,"verse":"He leadeth kohanim away stripped, and overthroweth the mighty."},{"num":20,"verse":"He removeth the speech of the ne’emanim (trusted ones), and taketh away the understanding of the zekenim."},{"num":21,"verse":"He poureth buz (contempt) upon nobles, and loosens the belt of the mighty."},{"num":22,"verse":"He uncovers the depths of choshech, and bringeth tzalmavet to light."},{"num":23,"verse":"He giveth prosperity to the Goyim, and then destroyeth them; He enlargeth them, and then carrieth the Goyim away."},{"num":24,"verse":"He taketh away the lev (understanding) of the Rashei Am HaAretz, and sendeth them to tohu lo derech (trackless wilderness)."},{"num":25,"verse":"They grope in the choshech without ohr, and He maketh them to stagger like a shikkor (drunken man)."}]