[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(6) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I shall not.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The meaning of the verse is clear, but the construction is involved. Literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I shall not be moved to generation and generation, which not in evil. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The LXX. and Vulg. omit the relative altogether. The best rendering is, “I shall never be moved at any time: I who am without ill.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Psalms",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "ONE SAYING FROM THREE MENPsalm 10:6",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "ONE SAYING FROM THREE MEN",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 10:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 16:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 30:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " How differently the same things sound when said by different men! Here are three people giving utterance to almost the same sentiment of confidence. A wicked man says it, and it is insane presumption and defiance. A good man says it, having been lulled into false security by easy times, and it is a mistake that needs chastisement. A humble believing soul says it, and it is the expression of a certain and blessed truth. ‘The wicked saith in his heart, I shall not be moved.’ A good man, led astray by his prosperity, said, ‘I shall not be moved,’ and the last of the three put a little clause in which makes all the difference, ‘",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "because He is at my right hand",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", I shall never be moved.’ So, then, we have the mad arrogance of godless confidence, the mistake of a good man that needs correction, and the warranted confidence of a believing soul.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. The mad arrogance of godless confidence. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. The mad arrogance of godless confidence.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The ‘wicked’ man, in the psalm from which our first text comes, said a good many wrong things ‘in his heart.’ The tacit assumptions on which a life is based, though they may never come to consciousness, and still less to utterance, are the really important things. I dare say this ‘wicked man’ was a good Jew with his lips, and said his prayers all properly, but in his heart he had two working beliefs. One is thus expressed: ‘As for all his enemies, he puffeth at them. He hath said in his heart, I shall not be moved.’ The other is put into words thus: ‘He hath said in his heart, God hath forgotten, He hideth His face. He will never see it.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " That is to say, the only explanation of a godless life, unless the man is an idiot, is that there lie beneath it, as formative principles and unspoken assumptions, guiding and shaping it, one or both of these two thoughts: either ‘There is no God,’ or ‘He does not care what I do, and I am safe to go on for evermore in the present fashion.’ It might seem as if a man with the facts of human life before him, could not, even in the insanest arrogance, say, ‘I shall not be moved, for I shall never be in adversity.’ But we have an awful power-and the fact that we exercise, and choose to exercise, it is one of the strange riddles of our enigmatical existence and characters-of ignoring unwelcome facts, and going cheerily on as though we had annihilated them, because we do not reflect upon them. So this man, in the midst of a world in which there is no stay, and whilst he saw all round him the most startling and tragical instances of sudden change and complete collapse, stands quietly and says, ‘Ah! ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " shall never be moved’; ‘God doth not require it.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " That absurdity is the basis of every life that is not a life of consecration and devotion-so far as it has a basis of conviction at all. The ‘wicked’ man’s true faith is this, absurd as it may sound when you drag it out into clear, distinct utterance, whatever may be his professions. I wonder if there are any of us whose life can only be acquitted of being utterly unreasonable and ridiculous by the assumption, ‘I shall never be moved’?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Have you a lease of your goods? Do you think you are tenants at will or owners? Which? Is there any reason why any of us should escape, as some of us live as if we believed we should escape, the certain fate of all others? If there is not, what about the sanity of the man whose whole life is built upon a blunder? He is convicted of the grossest folly, unless he be assured that either there is no God, or that He does not care one rush about what we do, and that consequently we are certain of a continuance in our present state.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Do you say in your heart, ‘I shall never be moved’? Then you must be strong enough to resist every tempest that beats against you. Is that so? ‘I shall never be moved’-then nothing that contributes to your well-being will ever slip from your grasp, but you will be able to hold it tight. Is that so? ‘I shall never be moved’-then there is no grave waiting for you. Is that so? Unless these three assumptions be warranted, every godless man is making a hideous blunder, and his character is the sentence pronounced by the loving lips of Incarnate Truth on the rich man who thought that he had ‘much goods laid up for many years,’ and had only to be merry-’Thou fool! Thou fool!’ If an engineer builds a bridge across a river without due calculation of the force of the winds that blow down the gorge, the bridge will be at the bottom of the stream some stormy night, and the train piled on the fragments of it in hideous ruin. And with equal certainty the end of the first utterer of this speech can be calculated, and is foretold in the psalm, ‘The Lord is King for ever and ever. . . . The godless are perished out of the land.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. We have in our second text the mistake of a good man who has been lulled into false confidence. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. We have in our second text the mistake of a good man who has been lulled into false confidence.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The Psalmist admits his error by the acknowledgment that he spoke ‘in my prosperity’; or, as the word might be rendered, ‘in my ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "security",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".’ This suggests to us the mistake into which even good men, lulled by the quiet continuance of peaceful days, are certain to fall, unless there be continual watchfulness exercised by them.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " It is a very significant fact that the word which is translated in our Authorised Version ‘prosperity’ is often rendered ‘security,’ meaning thereby, not safety, but a belief that I am safe. A man who is prosperous, or at ease, is sure to drop into the notion that ‘to-morrow will be as this day, and much more abundant,’ unless he keeps up unslumbering watchfulness against the insidious illusion of permanence. If he yields to the temptation, in his foolish security, forgetting how fragile are its foundations, and what a host of enemies surround him threatening it, then there is nothing for it but that the merciful discipline, which this Psalmist goes on to tell us he had to pass through by reason of his fall, shall be brought to bear upon him. The writer gives us a page of his own autobiography. ‘In my security I said, I shall never be moved.’ ‘Lord! by Thy favour Thou hast made my mountain to stand strong. Thou didst hide Thy face.’ What about the security then? What about ‘I shall never be moved’ then? ‘I was troubled. I cried to Thee, O Lord!’-and then it was all right, his prayer was heard, and he was in ‘security’-that is, safety-far more really when he was ‘troubled’ and sore beset than when he had been, as he fancied, sure of not being moved.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Long peace rusts the cannon, and is apt to make it unfit for war. Our lack of imagination, and our present sense of comfort and well-being, tend to make us fancy that we shall go on for ever in the quiet jog-trot of settled life without any very great calamities or changes. But there was once a village at the bottom of the crater of Vesuvius, and great trees, that had grown undisturbed there for a hundred years, and green pastures, and happy homes and flocks. And then, one day, a rumble and a rush, and what became of the village? It went up in smoke-clouds. The quiescence of the volcano is no sign of its extinction. And as surely as we live, so sure is it that there will come a ‘to-morrow’ to us all which shall ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "not",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " be as this day. No man has any right to calculate upon anything beyond the present moment, and there is no basis whatever, either for the philosophical assertion that the order of nature is fixed, and that therefore there are no miracles, or for the practical translation of the assertion into our daily lives, that we may reasonably expect to go on as we are without changes or calamities. There is no reason capable of being put into logical shape for believing that, because the sun has risen ever since the beginning of things, it will rise to-morrow, for there will come a to-morrow when it will ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "not",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " rise. In like manner, the longest possession of our mercies is no reason for forgetting the precarious tenure on which we hold them all.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So, Christian men and women! let us try to keep vivid that consciousness which is so apt to get dull, that nothing continueth in one stay, and that we ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " be moved, as far as the outward life and its circumstances are concerned. If we forget it, we shall need, and we shall get, the loving Fatherly discipline, which my second text tells us followed the false security of this good man. The sea is kept from putrefying by storms. Wine poured from vessel to vessel is purified thereby. It is an old truth and a wholesome one, to be always remembered, ‘because they have no changes therefore they fear not God .’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. Lastly, we have the same thing said by another man in another key.  ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. Lastly, we have the same thing said by another man in another key. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘Because He is at my right hand, I shall not be moved.’ The prelude to the assertion makes all the difference. Here is the warranted confidence of a simple faith.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The man who clasps God’s hand, and has Him standing by his side, as his Ally, his Companion, his Guide, his Defence-that man does not need to fear change. For all the things which convict the arrogant or mistaken confidences of the other men as being insanity or a lapse from faith prove the confidence of the trustful soul to be the very perfection of reason and common sense.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " We may be confident of our power to resist anything that can come against us, if He be at our side. The man that stands with his back against an oak-tree is held firm, not because of his own strength, but because of that on which he leans. There is a beautiful story of some heathen convert who said to a missionary’s wife, who had felt faint and asked that she might lean for a space on her stronger arm, ‘If you love me, lean hard.’ That is what God says to us, ‘If you love Me, lean hard.’ And if you do, because He is at your right hand, you will not be moved. It is not insanity; it is not arrogance; it is simple faith, to look our enemies in the eyes, and to feel sure that they cannot touch us, ‘Trust in Jehovah; so shall ye be established.’ Rest on the Lord, and ye shall rest indeed.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " In like manner the man who has God at his right hand may be sure of the unalterable continuance of all his proper good. Outward things may come or go, as it pleases Him, but that which makes the life of our life will never depart from us as long as He stands there. And whilst He is there, if only our hearts are knit to Him, we can say, ‘My heart and my flesh faileth, but God is the strength of my heart, and my portion for ever. I shall not be moved. Though all that can go goes, He abides; and in Him I have all riches.’ Trust not in the uncertainty of outward good, but in the living God, who giveth us richly all things to enjoy.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The wicked man was defiantly arrogant, and the forgetful good man was criminally self-confident, when they each said, ‘I shall not be moved.’ We are only taking up the privileges that belong to us if, exercising faith in Him, we venture to say, ‘Take what Thou wilt; leave me Thyself; I have enough.’ And the man who says, ‘Because God is at my right hand, I shall not be moved,’ has the right to anticipate an unbroken continuance of personal being, and an unchanged continuance of the very life of his life. That which breaks off all other lives abruptly is no breach in the continuity, either of the consciousness or of the avocations of a devout man. For, on the other side of the flood, he does what he does on this side, only more perfectly and more continually. ‘He that doeth the will of God abideth for ever,’ and it makes comparatively little difference to him whether his place be on this or on the other side of Jordan. We ‘shall not be moved,’ even when we change our station from earth to heaven, and the sublime fulfilment of the warranted confidence of the trustful soul comes when the ‘to-morrow’ of the skies is as the ‘to-day’ of earth, only ‘much more abundant.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 10:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 10:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He hath said in his heart — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "He thinks and persuades himself; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I shall not be moved — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "From my place and happy state: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I shall never be in adversity — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Because I am not in adversity, I never shall be in it. His present prosperity makes him secure for the future. Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 18:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". “Prosperity,” says Dr. Horne, “begets presumption, and he who has been long accustomed to see his designs succeed, begins to think it impossible they should ever do otherwise. The long-suffering of God, instead of leading such a one to repentance, only hardens him in his iniquity.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10:1-11 God's withdrawings are very grievous to his people, especially in times of trouble. We stand afar off from God by our unbelief, and then complain that God stands afar off from us. Passionate words against bad men do more hurt than good; if we speak of their badness, let it be to the Lord in prayer; he can make them better. The sinner proudly glories in his power and success. Wicked people will not seek after God, that is, will not call upon him. They live without prayer, and that is living without God. They have many thoughts, many objects and devices, but think not of the Lord in any of them; they have no submission to his will, nor aim for his glory. The cause of this is pride. Men think it below them to be religious. They could not break all the laws of justice and goodness toward man, if they had not first shaken off all sense of religion.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "He hath said in his heart - The phrase, \"he hath said,\" means that this was his deliberate and settled character. What is here described was no sudden thing. It was not the freak of passion; it was a deliberately-formed purpose. The phrase, \"in his heart,\" means that he had purposed this; he had said this to himself in a spirit of self-gratulation and confidence.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I shall not be moved - That is, he was confident in his present condition, and he apprehended no changes. He had formed his plans so wisely, that he believed he had nothing to apprehend; he feared neither sickness nor adversity; he dreaded not the power of his enemies; he feared nothing even from the providence of God; he supposed that he had laid the foundation for permanent prosperity. This feeling of self-confidence and of security is sometimes found, to an extent that cannot be justified, in the hearts of even good people (compare the note at Job 29:18); and it is common among the wicked. See Psalm 49:11; Job 21:9.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I shall not be moved - That is, he was confident in his present condition, and he apprehended no changes. He had formed his plans so wisely, that he believed he had nothing to apprehend; he feared neither sickness nor adversity; he dreaded not the power of his enemies; he feared nothing even from the providence of God; he supposed that he had laid the foundation for permanent prosperity. This feeling of self-confidence and of security is sometimes found, to an extent that cannot be justified, in the hearts of even good people (compare the note at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 29:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); and it is common among the wicked. See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 49:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 21:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "For I shall never be in adversity - Margin, \"unto generation and generation.\" The margin expresses the correct sense. The idea of the wicked, as expressed here, is that they and their families would continue to be prosperous; that a permanent foundation was laid for honor and success, and for transmitting accumulated wealth and honors down to far distant times. It is a common feeling among wicked men that they can make permanent their titles, and possessions, and rank, and that nothing will occur to reduce them to the humble condition of others. Nothing more cleverly shows the pride and atheism of the heart than this; and in nothing are the anticipations and plans of human beings more signally disappointed. Compare the case of Shebna; see the note at Isaiah 22:15 ff. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "For I shall never be in adversity - Margin, \"unto generation and generation.\" The margin expresses the correct sense. The idea of the wicked, as expressed here, is that they and their families would continue to be prosperous; that a permanent foundation was laid for honor and success, and for transmitting accumulated wealth and honors down to far distant times. It is a common feeling among wicked men that they can make permanent their titles, and possessions, and rank, and that nothing will occur to reduce them to the humble condition of others. Nothing more cleverly shows the pride and atheism of the heart than this; and in nothing are the anticipations and plans of human beings more signally disappointed. Compare the case of Shebna; see the note at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 22:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ff. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5, 6. Such is his confidence in the permanence of his way or course of life, that he disregards God's providential government (out of sight, because he will not look, Isa 26:11), sneers at his enemies, and boasts perpetual freedom from evil.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He hath said in his heart; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " he thinketh or persuadeth himself. I shall not be moved; or, removed, to wit, from my place and happy state. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "For I shall never be in adversity; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "because I am not in adversity",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", therefore I never shall be in it. His present prosperity makes him secure for the future. Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Revelation 18:7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 18:7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "yea",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", (for this particle sometimes hath no other signification or use but only to amplify or aggravate, as it is also taken ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1 Samuel 15:20 24:11",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 15:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 24:11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ") I shall ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "never be in evil",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". So the sense of the place is, I shall not only be kept from total ruin, or a removal from my place and estate, but I shall not meet with the least cross or trouble. For this ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "evil",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is not the evil of sin, as some here understand it, in which he knew that he was, and was resolved, ever to continue; but the evil of punishment, which was the only thing that he feared or regarded. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "He hath said in his heart,.... To and within himself, he thought in his own mind; for the thought is the word or speech of the mind, ; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I shall not be moved; from his prosperous and happy condition, abounding: with riches and honours; from his seat of empire, over kings, princes, and the nations of the world; flattering himself that it would never be otherwise with him than it is: even \"to generation and generation\", I shall not be moved; so the words may be rendered; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for I shall never be in adversity, or \"in evil\" (d): meaning either the evil of sin; so asserting his innocence, wiping himself clean of all iniquity, claiming to himself the title of \"holiness\" itself, and the character of infallibility; giving out that he is impeccable, and cannot err; when he is not only almost, but altogether, in all evil; and is , the lawless and wicked one, the man of sin, who is nothing but sin itself. The Targum paraphrases the whole thus; \"I shall not be moved from generation to generation from doing evil\"; and so it is a boast of impiety, and that none can restrain him from it, no one having a superior power over him; see Psalm 12:4. Or the evil of affliction, or calamity; wherefore we render it \"adversity\", so Jarchi and Aben Ezra understand it: the note of the former is, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "for I shall never be in adversity, or \"in evil\" (d): meaning either the evil of sin; so asserting his innocence, wiping himself clean of all iniquity, claiming to himself the title of \"holiness\" itself, and the character of infallibility; giving out that he is impeccable, and cannot err; when he is not only almost, but altogether, in all evil; and is , the lawless and wicked one, the man of sin, who is nothing but sin itself. The Targum paraphrases the whole thus; \"I shall not be moved from generation to generation from doing evil\"; and so it is a boast of impiety, and that none can restrain him from it, no one having a superior power over him; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 12:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Or the evil of affliction, or calamity; wherefore we render it \"adversity\", so Jarchi and Aben Ezra understand it: the note of the former is, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"evil shall not come upon me in my generation,'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "or for ever; and the latter compares it with Numbers 11:15; Kimchi and Ben Melech interpret it of long life. It is a vaunt of antichrist, promising himself a continuance of his grandeur, ease, peace, and prosperity; in which he will be wretchedly disappointed. The language and sense are much the same with that of the antichristian Babylon, Revelation 18:7. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "or for ever; and the latter compares it with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 11:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; Kimchi and Ben Melech interpret it of long life. It is a vaunt of antichrist, promising himself a continuance of his grandeur, ease, peace, and prosperity; in which he will be wretchedly disappointed. The language and sense are much the same with that of the antichristian Babylon, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 18:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(d) \"in malo\", Montanus, Junius & Tremellius, Piscator, Cocceius, Gejerus; so Ainsworth. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(d) \"in malo\", Montanus, Junius & Tremellius, Piscator, Cocceius, Gejerus; so Ainsworth. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "He hath said in his heart, I shall not be moved: for I shall {c} never be in adversity.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "He hath said in his heart, I shall not be moved: for ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "I shall",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{c}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " never ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "be",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " in adversity.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) The evil will not touch me, Isa 28:15 or else he speaks thus because he never felt evil.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He hath said",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] R.V. he saith, and so in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Psalm 10:11; Psalm 10:13",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 10:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 10:13",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". He presumes in his carnal self-confidence to use language which the righteous man employs in faithful dependence upon God (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 16:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " I shall ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "never",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " &c.] R.V., To all generations I shall not be in adversity. Hardly in the sense that “pride stifles reason,” and “he expects to live for ever” (Cheyne); but rather that he identifies his descendants with himself, and looks forward to the uninterrupted continuance of their prosperity. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 49:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and the promise to the righteous man in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 37:27-29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 6.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "He hath said in his heart, I shall not be moved",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 30:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The idea of continuance is instinctive in the human mind. \"The thing that has been, it is that which shall be\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ecclesiastes 1:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). We expect the sun to rise each day, solely because in the past it has always risen (see Butler's 'Analogy,' part 1. ch. 1.). The wicked man, who has always prospered, expects to prosper in the future; he has no anticipation of coming change; he supposes that his \"house will continue for ever, and his dwelling-place to all generations' (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 49:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); he thinks that \"to-morrow will be as to-day, and much more abundant\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 56:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). For I shall never be in adversity; rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "unto generation and generation",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "I am he who will be exempt from calamity.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The wicked man has no thought of dying - he will be prosperous, he thinks, age after age. Psalm 10:6",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then in his boundless carnal security he gives free course to his wicked tongue. That which the believer can say by reason of his fellowship with God, בּל־אמּוט (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 30:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 16:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), is said by him in godless self-confidence. He looks upon himself in age after age, i.e., in the endless future, as אשׁר לא ברע, i.e., as one who (אשׁר as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 8:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") will never be in evil case (ברע as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 5:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 16:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). It might perhaps also be interpreted according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 8:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 8:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (vid., Kצhler, in loc.): in all time to come (it will come to pass) that I am not in misfortune. But then the personal pronoun (אני or הוּא) ought not be omitted; whereas with our interpretation it is supplied from אמּוט, and there is no need to supply anything if the clause is taken as an apposition: in all time to come he who.... In connection with such unbounded self-confidence his mouth is full of אלה, cursing, execratio (not perjury, perjurium, a meaning the word never has), מרמות, deceit and craft of every kind, and תּך, oppression, violence. And that which he has under his tongue, and consequently always in readiness for being put forth (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 140:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 66:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), is trouble for others, and in itself matured wickedness. Paul has made use of this ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 10:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in his contemplative description of the corruptness of mankind, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 3:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      }
    ]
  }
]