[{"header":"An Angel Frees Peter from Prison"},{"num":12,"verse":"About that time, Herod arrested some people who belonged to the church and mistreated them. "},{"num":2,"verse":"He even had James, the brother of John, killed with a sword. "},{"num":3,"verse":"When he saw how this was agreeable to the Jews, he proceeded to arrest Peter, too. This happened during the Festival of Unleavened Bread. "},{"num":4,"verse":"When he arrested Peter, Herod put him in prison and turned him over to four squads of soldiers to guard him, planning to bring him out to the people after Passover season. "},{"num":5,"verse":"So Peter was kept in prison, but earnest prayer to God for him was being offered by the assembly."},{"num":6,"verse":"That very night, before Herod was going to bring him out, Peter, bound with two chains, was sleeping between two soldiers, and guards in front of the door were watching the prisoners. "},{"num":7,"verse":"Suddenly, an angel of the Lord appeared and a light shone in the cell. He tapped Peter on his side, woke him up, and said, “Get up quickly!” His chains fell from his wrists. "},{"num":8,"verse":"Then the angel told him, “Tuck in your shirt and put on your sandals!” He did this. Then the angel told him, “Put on your coat and follow me!” "},{"num":9,"verse":"So Peter went out and began to follow him, not realizing that what was being done by the angel was real; he thought he was seeing a vision. "},{"num":10,"verse":"They passed the first guard, then the second, and came to the iron gate that led into the city. It opened by itself for them, and they went outside and proceeded one block when the angel suddenly left him."},{"num":11,"verse":"Then Peter came to himself and said, “Now I’m sure that the Lord has sent his angel and rescued me from Herod and from everything the Jewish people were expecting!”"},{"num":12,"verse":"When Peter realized what had happened, he went to the house of Mary, the mother of John who was also called Mark, where a large number of people had gathered and were praying. "},{"num":13,"verse":"When he knocked at the outer gate, a servant girl named Rhoda came to answer it. "},{"num":14,"verse":"On recognizing Peter’s voice, she was so overjoyed that she didn’t open the gate but ran back inside and announced that Peter was standing at the gate. "},{"num":15,"verse":"The other people told her, “You’re out of your mind!” But she kept insisting that it was so. Then they said, “It’s his angel.”"},{"num":16,"verse":"Meanwhile, Peter kept on knocking and knocking. When they opened the gate, they saw him and were amazed. "},{"num":17,"verse":"He motioned to them with his hand to be quiet, and then he told them how the Lord had brought him out of the prison. He added, “Tell this to James and the brothers.” Then he left and went somewhere else. "},{"num":18,"verse":"When morning came, there was a great commotion among the soldiers as to what had become of Peter. "},{"num":19,"verse":"Herod searched for him but didn’t find him, so he questioned the guards and ordered them to be executed. Then he left Judea, went down to Caesarea, and stayed there for a while."},{"header":"The Death of Herod"},{"num":20,"verse":"Now Herod had been in a violent quarrel with the people of Tyre and Sidon. So they came to him as a group. After they had won over Blastus, who oversaw security for the king’s sleeping quarters, they asked for a peace agreement because their country depended on the king’s country for food. "},{"num":21,"verse":"Therefore, at a set time Herod put on his royal robes, sat down on the royal seat, and made a speech to them. "},{"num":22,"verse":"The people kept shouting, “This is the voice of a god, not of a man!” "},{"num":23,"verse":"Immediately the angel of the Lord struck him down because he did not give glory to God, and he was eaten by worms and died. "},{"num":24,"verse":"But the word of God continued to grow and spread."},{"num":25,"verse":"When Barnabas and Saul had fulfilled their mission, they returned from Jerusalem, bringing with them John (who was also called Mark)."}]