[{"header":"James Killed and Peter Imprisoned"},{"num":12,"verse":"About that time King Herod extended his hands to harm certain ones from the church. "},{"num":2,"verse":"He killed James the brother of John with the sword. "},{"num":3,"verse":"Seeing that it pleased the Jews, he proceeded further to arrest Peter also. This happened during the Days of Unleavened Bread. "},{"num":4,"verse":"When he had seized him, he put him in prison and handed him over to four squads of soldiers to guard him, intending to bring him before the people after the Passover."},{"num":5,"verse":"So Peter was kept in prison. But the church prayed to God without ceasing for him."},{"header":"Peter Delivered From Prison"},{"num":6,"verse":"The very night when Herod would have brought him out, Peter was sleeping between two soldiers, bound with two chains. And the guards before the door were securing the prison. "},{"num":7,"verse":"And suddenly an angel of the Lord approached him, and a light shone in the prison. He struck Peter on the side and woke him up, saying, “Rise up, quickly.” And the chains fell off his hands."},{"num":8,"verse":"Then the angel said to him, “Dress yourself and put your sandals on.” And he did so. Then he said to him, “Wrap your cloak around you and follow me.” "},{"num":9,"verse":"He went out and followed him, and did not know that what was done by the angel was real, but thought he was seeing a vision. "},{"num":10,"verse":"When they had passed the first and the second guards, they came to the iron gate leading to the city, which opened to them by itself. And they went out and went forward one street. And immediately the angel left him."},{"num":11,"verse":"When Peter had come to himself, he said, “Now I certainly know that the Lord has sent His angel and delivered me from the hand of Herod and from all that the Jewish people were expecting.”"},{"num":12,"verse":"Realizing this, he came to the house of Mary, the mother of John, whose other name was Mark, where many were gathered together praying. "},{"num":13,"verse":"As Peter knocked at the door of the porch, a servant girl named Rhoda came to answer. "},{"num":14,"verse":"When she recognized Peter’s voice, from joy she did not open the door, but ran in and announced that Peter was standing at the door."},{"num":15,"verse":"They said to her, “You are insane.” But she insisted that it was really so. So they said, “It is his angel.”"},{"num":16,"verse":"But Peter continued knocking. And when they opened the door and saw him, they were astonished. "},{"num":17,"verse":"Motioning to them with his hand to be quiet, he described to them how the Lord had led him out of the prison. And he said, “Go, tell these things to James and to the brothers.” Then he departed and went to another place."},{"num":18,"verse":"Now when day came, there was a great disturbance among the soldiers about what had become of Peter. "},{"num":19,"verse":"When Herod had searched for him and did not find him, he examined the guards and commanded that they should be put to death."},{"header":"The Death of Herod"},{"num":20,"verse":"Now Herod was very angry with the people of Tyre and Sidon. But they came to him in unity, and having made Blastus, the king’s personal servant, their friend, they asked for peace, because their country was fed by the king’s country."},{"num":21,"verse":"On an appointed day, Herod, dressed in royal apparel, sat on his throne and gave a public speech to them. "},{"num":22,"verse":"The mob shouted, “It is the voice of a god, and not of a man!” "},{"num":23,"verse":"Immediately an angel of the Lord struck him, because he did not give God the glory. And he was eaten by worms and died."},{"num":24,"verse":"But the word of God spread and increased."},{"num":25,"verse":"When Barnabas and Saul had fulfilled their ministry, they returned from Jerusalem and took with them John, whose surname was Mark."}]