[{"header":"The Destruction of the Temple Foretold(A)"},{"num":13,"verse":"As He went out of the temple, one of His disciples said to Him, “Teacher, see what great stones and what great buildings are here.”"},{"num":2,"verse":"Jesus answered him, “Do you see these great buildings? Not one stone shall be left upon another that shall not be thrown down.”"},{"header":"Troubles and Persecutions(B)"},{"num":3,"verse":"As He sat on the Mount of Olives opposite the temple, Peter, James, John, and Andrew asked Him privately, "},{"num":4,"verse":"“Tell us, when will these things happen, and what will be the sign when all these things will be fulfilled?”"},{"num":5,"verse":"Jesus answered them, “Take heed lest anyone deceive you. "},{"num":6,"verse":"Many will come in My name, saying, ‘I am He,’ and will deceive many. "},{"num":7,"verse":"When you hear of wars and rumors of wars, do not be troubled. For such things must happen, but the end is still to come. "},{"num":8,"verse":"For nation will rise against nation, and kingdom against kingdom. And there will be earthquakes in various places, and there will be famines and troubles. These are the beginning of sorrows."},{"num":9,"verse":"“But take heed. For they will hand you over to councils, and in the synagogues you will be beaten. You will be brought before rulers and kings for My sake, as a testimony to them. "},{"num":10,"verse":"And the gospel must first be preached to all nations. "},{"num":11,"verse":"But when they arrest you and hand you over, take no thought beforehand, or premeditate what you should speak. But speak whatever is given you in that time, for it is not you who speaks, but the Holy Spirit."},{"num":12,"verse":"“Now a brother will betray his brother to death, and the father the son; children will rise up against their parents, and will cause them to be put to death. "},{"num":13,"verse":"You will be hated by all men for My name’s sake. But he who endures to the end shall be saved."},{"header":"The Great Tribulation(C)"},{"num":14,"verse":"“When you see the ‘abomination of desolation’ spoken of by Daniel the prophet standing where it should not be (let the reader understand), then let those who are in Judea flee to the mountains. "},{"num":15,"verse":"Let him who is on the housetop not go down or enter the house to take anything out of his house. "},{"num":16,"verse":"Let him who is in the field not turn back to take his garment. "},{"num":17,"verse":"But woe to women who are pregnant and to those who nurse in those days! "},{"num":18,"verse":"Pray that your escape may not be in winter. "},{"num":19,"verse":"For in those days there will be distress as has not been from the beginning of the creation which God created to this time, nor ever shall be."},{"num":20,"verse":"“Except the Lord shortened the days, no flesh would be saved. But for the sake of the elect, whom He chose, He shortened the days. "},{"num":21,"verse":"Then if anyone says to you, ‘Look, here is the Christ!’ or ‘Look, there He is!’ do not believe it. "},{"num":22,"verse":"For false christs and false prophets will rise and show signs and wonders to deceive, if possible, even the elect. "},{"num":23,"verse":"But take heed. I have told you all things beforehand."},{"header":"The Coming of the Son of Man(D)"},{"num":24,"verse":"“But in those days, after that distress,"},{"num":26,"verse":"“Then they will see the Son of Man coming in clouds with great power and glory. "},{"num":27,"verse":"Then He will send His angels and gather His elect from the four winds, from the farthest part of the earth to the farthest part of heaven."},{"header":"The Lesson of the Fig Tree(E)"},{"num":28,"verse":"“Now learn a parable of the fig tree: When her branch is yet tender and puts outs leaves, you know that summer is near. "},{"num":29,"verse":"So also, when you see these things come to pass, know that it is near, even at the doors. "},{"num":30,"verse":"Truly I say to you, this generation will not pass away until all these things happen. "},{"num":31,"verse":"Heaven and earth will pass away, but My words will not pass away."},{"header":"The Unknown Day and Hour(F)"},{"num":32,"verse":"“But concerning that day or hour no one knows, not even the angels in heaven, nor the Son, but only the Father. "},{"num":33,"verse":"Take heed, watch and pray. For you do not know when the time will come. "},{"num":34,"verse":"For the Son of Man is like a man leaving on a far journey who left his house and gave authority to his servants and to every man his work, and commanded the porter to watch."},{"num":35,"verse":"“Watch therefore—for you do not know when the master of the house is coming, in the evening, or at midnight, or at the crowing of the rooster, or in the morning— "},{"num":36,"verse":"lest he come suddenly and find you sleeping. "},{"num":37,"verse":"What I say to you I say to all: Watch!”"}]