[{"header":"Jesus prophesies the ruin of the Temple"},{"num":13,"verse":"Then as Jesus was leaving the Temple, one of his disciples said to him, “Look, Master, what wonderful stonework, what a size these building are!”"},{"num":2,"verse":"Jesus replied, “You see these great buildings? Not a single stone will be left standing on another; every one will be thrown down!”"},{"num":3,"verse":"Then while he was sitting on the slope of the Mount of Olives facing the Temple, Peter, James, John and Andrew said to him privately, “Tell us, when will these things happen? What sign will there be that all these things are going to be accomplished?”"},{"num":5,"verse":"So Jesus began to tell them: “Be very careful that no one deceives you. Many are going to come in my name and say, ‘I am he’, and will lead many astray. When you hear of wars and rumours of wars, don’t be alarmed. such things are bound to happen, but the end is not yet. Nation will take up arms against nation and kingdom against kingdom. There will be earthquakes in different places and terrible famines. But this is only the beginnings of ‘the pains’. You yourselves must keep your wits about you, for men will hand you over to their councils, and will beat you in their synagogues. You will have to stand in front of rulers and kings for my sake to bear your witness to them—for before the end comes the Gospel must be proclaimed to all nations. But when they are taking you off to trial, do not worry beforehand about what you are going to say—simply say the words you are given when the time comes. For it is not really you who will speak, but the Holy Spirit."},{"header":"Jesus foretells utter misery"},{"num":12,"verse":"“A brother is going to betray his own brother to death, and a father his own child. Children will stand up against their parents and condemn them to death. There will come a time when the whole world will hate you because you are known as my followers. Yet the man who holds out to the end will be saved."},{"num":14,"verse":"“But when you see ‘the abomination of desolation’ standing where it ought not—(let the reader take note of this)—then those who are in Judea must fly to the hills! The man on his house-top must not go down nor go into his house to fetch anything out of it, and the man in the field must not turn back to fetch his coat. Alas for the women who are pregnant at that time, and alas for those with babies at their breasts! Pray God that it may not be winter when that time comes, for there will be such utter misery in those days as had never been from the creation until now—and never will be again. Indeed, if the Lord did not shorten those days, no human beings could survive. But for the sake of the people whom he has chosen he has shortened those days."},{"header":"He warns against false christs, and commands vigilance"},{"num":21,"verse":"“If anyone tells you at that time, ‘Look, here is Christ’, or ‘Look, there he is’, don’t believe it! For false christs and false prophets will arise and will perform signs and wonders, to deceive, if it be possible, even the men of God’s choice. You must keep your eyes open! I am giving you this warning before it happens."},{"num":24,"verse":"“But when that misery is past, ‘the light of the sun will be darkened and the moon will not give her light; stars will be falling from the sky and the powers of heaven will rock on their foundations’."},{"num":26,"verse":"Then men shall see the Son of Man coming in the clouds with great power and glory. And then shall he send out his angels to summon his chosen together from every quarter, from furthest earth to highest heaven."},{"num":28,"verse":"“Let the fig-tree illustrate this for you: when its branches grow tender and produce leaves, you know that summer is near, at your very doors! I tell you that this generation will not have passed until all these things have come true. Earth and sky will pass away, but what I have told you will never pass away! But no one knows the day or the hour of this happening, not even the angels in Heaven, no, not even the Son—only the Father. Keep your eyes open, keep on the alert, for you do not know when the time will be."},{"num":34,"verse":"It is as if a man who is travelling abroad had left his house and handed it over to be managed by his servants. He has given each one his work to do and has ordered the doorkeeper to be on the look-out for his return. Just so must you keep a look-out, for you do not know when the master of the house will come—it might be late evening, or midnight, or cock-crow, or early morning—otherwise he might come unexpectedly and find you sound asleep. What I am saying to you I am saying to all; keep on the alert!”"}]