[[],[{"type":"header","content":"The Building of the Temple"},{"type":"prose","content":"Now it came about in the four hundred and eightieth year after the sons of Israel came out of the land of Egypt, in the fourth year of Solomon’s reign over Israel, in the month of Ziv, that is, the second month, that he began to build the house of the ."}],[{"type":"prose","content":"And the house which King Solomon built for the   sixty cubits  its length, and twenty  its width, and its height  thirty cubits."}],[{"type":"prose","content":"The porch in front of the main room of the house  twenty cubits in length, corresponding to the width of the house,  its width along the front of the house  ten cubits."}],[{"type":"prose","content":"Also for the house he made windows with  frames."}],[{"type":"prose","content":"Against the wall of the house he built stories encompassing the walls of the house around both the main room and the inner sanctuary; so he made side chambers all around."}],[{"type":"prose","content":"The lowest story  five cubits wide, the middle  six cubits wide, and the third  seven cubits wide; for on the outside he made offsets  of the house all around so that  would not be inserted into the walls of the house."}],[{"type":"prose","content":"The house, while it was being built, was built of stone finished at the quarry, and neither hammer, nor axe, nor any iron tool was heard in the house while it was being built."}],[{"type":"prose","content":"The doorway for the lowest side chamber  on the right side of the house; and they would go up by a winding staircase to the middle , and from the middle to the third."}],[{"type":"prose","content":"So he built the house and finished it; and he covered the house with beams and planks of cedar."}],[{"type":"prose","content":"He also built the stories against the whole house,  five cubits high; and they were attached to the house with timbers of cedar."}],[{"type":"prose","content":"Now the word of the  came to Solomon, saying,"}],[{"type":"prose","content":"“ this house which you are building, if you will walk in My statutes and execute My ordinances and keep all My commandments by walking in them, then I will fulfill My word with you which I spoke to David your father."}],[{"type":"prose","content":"And I will dwell among the sons of Israel, and will not abandon My people Israel.”"}],[{"type":"prose","content":"So Solomon built the house and finished it."}],[{"type":"prose","content":"He built the walls of the house on the inside with boards of cedar; from the floor of the house to the ceiling he paneled  on the inside with wood, and he paneled the floor of the house with boards of juniper."}],[{"type":"prose","content":"He also built twenty cubits on the rear part of the house with boards of cedar from the floor to the ceiling; he built  for it on the inside as an inner sanctuary, as the Most Holy Place."}],[{"type":"prose","content":"The house, that is, the main room in front of , was forty cubits ."}],[{"type":"prose","content":"There was cedar inside the house, carved  of gourds and open flowers; everything was cedar, there was no stone visible."}],[{"type":"prose","content":"Then he prepared an inner sanctuary inside the house in order to place there the ark of the covenant of the ."}],[{"type":"prose","content":"The inner sanctuary  twenty cubits in length, twenty cubits in width, and twenty cubits in height; and he overlaid it with pure gold. He also paneled the altar with cedar."}],[{"type":"prose","content":"So Solomon overlaid the inside of the house with pure gold. And he extended chains of gold across the front of the inner sanctuary, and he overlaid it with gold."}],[{"type":"prose","content":"He overlaid the entire house with gold, until all the house was finished. Also the entire altar which was by the inner sanctuary he overlaid with gold."}],[{"type":"prose","content":"And in the inner sanctuary he made two cherubim of olive wood, each ten cubits high."}],[{"type":"prose","content":"The one wing of the  cherub  five cubits, and the other wing of the  cherub  five cubits; from the end of one wing to the end of the other wing  ten cubits."}],[{"type":"prose","content":"The second cherub  ten cubits; both of the cherubim were of the same measurement and the same form."}],[{"type":"prose","content":"The height of the one cherub  ten cubits, and so  the other cherub."}],[{"type":"prose","content":"He placed the cherubim in the midst of the inner house, and the wings of the cherubim spread out so that the wing of the one was touching the  wall, and the wing of the other cherub was touching the other wall. And their wings were touching end to end in the center of the house."}],[{"type":"prose","content":"He also overlaid the cherubim with gold."}],[{"type":"prose","content":"Then he carved all the surrounding walls of the house with engravings of cherubim, palm trees, and open flowers, for the inner and outer ."}],[{"type":"prose","content":"And he overlaid the floor of the house with gold, for the inner and outer ."}],[{"type":"prose","content":"And for the entrance of the inner sanctuary he made doors of olive wood, the lintel,  five-sided doorposts."}],[{"type":"prose","content":"So  two doors of olive wood, and he carved on them carvings of cherubim, palm trees, and open flowers, and overlaid them with gold; and he overlaid the cherubim and the palm trees with gold."}],[{"type":"prose","content":"So too he made for the entrance of the main room four-sided doorposts of olive wood,"}],[{"type":"prose","content":"and two doors of juniper wood; the two leaves of the one door turned on pivots, and the two leaves of the other door turned on pivots."}],[{"type":"prose","content":"He carved  cherubim, palm trees, and open flowers; and he overlaid  with gold plated on the carved work."}],[{"type":"prose","content":"And he built the inner courtyard with three rows of cut stone and a row of cedar beams."}],[{"type":"prose","content":"In the fourth year the foundation of the house of the  was laid, in the month of Ziv."}],[{"type":"prose","content":"And in the eleventh year, in the month of Bul, that is, the eighth month, the house was finished in all its parts and in accordance with all its plans. So he was seven years in building it."}]]