[[],[{"type":"header","content":"Solomon Builds the Temple"},{"type":"prose","content":"It was in midspring, in the month of Ziv, during the fourth year of Solomon’s reign, that he began to construct the Temple of the . This was 480 years after the people of Israel were rescued from their slavery in the land of Egypt."}],[{"type":"prose","content":"The Temple that King Solomon built for the  was 90 feet long, 30 feet wide, and 45 feet high."}],[{"type":"prose","content":"The entry room at the front of the Temple was 30 feet wide, running across the entire width of the Temple. It projected outward 15 feet from the front of the Temple."}],[{"type":"prose","content":"Solomon also made narrow recessed windows throughout the Temple."}],[{"type":"prose","content":"He built a complex of rooms against the outer walls of the Temple, all the way around the sides and rear of the building."}],[{"type":"prose","content":"The complex was three stories high, the bottom floor being 7 1⁄2 feet wide, the second floor 9 feet wide, and the top floor 10 1⁄2 feet wide. The rooms were connected to the walls of the Temple by beams resting on ledges built out from the wall. So the beams were not inserted into the walls themselves."}],[{"type":"prose","content":"The stones used in the construction of the Temple were finished at the quarry, so there was no sound of hammer, ax, or any other iron tool at the building site."}],[{"type":"prose","content":"The entrance to the bottom floor was on the south side of the Temple. There were winding stairs going up to the second floor, and another flight of stairs between the second and third floors."}],[{"type":"prose","content":"After completing the Temple structure, Solomon put in a ceiling made of cedar beams and planks."}],[{"type":"prose","content":"As already stated, he built a complex of rooms along the sides of the building, attached to the Temple walls by cedar timbers. Each story of the complex was 7 1⁄2 feet high."}],[{"type":"prose","content":"Then the  gave this message to Solomon:"}],[{"type":"prose","content":"“Concerning this Temple you are building, if you keep all my decrees and regulations and obey all my commands, I will fulfill through you the promise I made to your father, David."}],[{"type":"prose","content":"I will live among the Israelites and will never abandon my people Israel.”"},{"type":"header","content":"The Temple’s Interior"}],[{"type":"prose","content":"So Solomon finished building the Temple."}],[{"type":"prose","content":"The entire inside, from floor to ceiling, was paneled with wood. He paneled the walls and ceilings with cedar, and he used planks of cypress for the floors."}],[{"type":"prose","content":"He partitioned off an inner sanctuary—the Most Holy Place—at the far end of the Temple. It was 30 feet deep and was paneled with cedar from floor to ceiling."}],[{"type":"prose","content":"The main room of the Temple, outside the Most Holy Place, was 60 feet long."}],[{"type":"prose","content":"Cedar paneling completely covered the stone walls throughout the Temple, and the paneling was decorated with carvings of gourds and open flowers."}],[{"type":"prose","content":"He prepared the inner sanctuary at the far end of the Temple, where the Ark of the ’s Covenant would be placed."}],[{"type":"prose","content":"This inner sanctuary was 30 feet long, 30 feet wide, and 30 feet high. He overlaid the inside with solid gold. He also overlaid the altar made of cedar."}],[{"type":"prose","content":"Then Solomon overlaid the rest of the Temple’s interior with solid gold, and he made gold chains to protect the entrance to the Most Holy Place."}],[{"type":"prose","content":"So he finished overlaying the entire Temple with gold, including the altar that belonged to the Most Holy Place."}],[{"type":"prose","content":"He made two cherubim of wild olive wood, each 15 feet tall, and placed them in the inner sanctuary."}],[{"type":"prose","content":"The wingspan of each of the cherubim was 15 feet, each wing being 7 1⁄2 feet long."}],[{"type":"prose","content":"The two cherubim were identical in shape and size;"}],[{"type":"prose","content":"each was 15 feet tall."}],[{"type":"prose","content":"He placed them side by side in the inner sanctuary of the Temple. Their outspread wings reached from wall to wall, while their inner wings touched at the center of the room."}],[{"type":"prose","content":"He overlaid the two cherubim with gold."}],[{"type":"prose","content":"He decorated all the walls of the inner sanctuary and the main room with carvings of cherubim, palm trees, and open flowers."}],[{"type":"prose","content":"He overlaid the floor in both rooms with gold."}],[{"type":"prose","content":"For the entrance to the inner sanctuary, he made double doors of wild olive wood with five-sided doorposts."}],[{"type":"prose","content":"These double doors were decorated with carvings of cherubim, palm trees, and open flowers. The doors, including the decorations of cherubim and palm trees, were overlaid with gold."}],[{"type":"prose","content":"Then he made four-sided doorposts of wild olive wood for the entrance to the Temple."}],[{"type":"prose","content":"There were two folding doors of cypress wood, and each door was hinged to fold back upon itself."}],[{"type":"prose","content":"These doors were decorated with carvings of cherubim, palm trees, and open flowers—all overlaid evenly with gold."}],[{"type":"prose","content":"The walls of the inner courtyard were built so that there was one layer of cedar beams between every three layers of finished stone."}],[{"type":"prose","content":"The foundation of the ’s Temple was laid in midspring, in the month of Ziv, during the fourth year of Solomon’s reign."}],[{"type":"prose","content":"The entire building was completed in every detail by midautumn, in the month of Bul, during the eleventh year of his reign. So it took seven years to build the Temple."}]]