[{"header":"The Day of Punishment"},{"num":14,"verse":"The ·Lord’s day of judging [day of the Lord; Zeph. 1:7] is coming when ·the wealth you have taken [your plunder] will be divided ·among you [in your midst; or right in front of you; while you watch]."},{"num":2,"verse":"I will bring all the nations together to ·fight [wage war against] Jerusalem. They will capture the city and ·rob [plunder; loot] the houses and ·attack [rape] the women. Half the people will be taken away ·as captives [into exile], but the rest of the people won’t be taken from the city."},{"num":3,"verse":"Then the Lord will go to war against those nations; he will fight as in a day of battle. "},{"num":4,"verse":"On that day ·he [his feet] will stand on the Mount of Olives, east of Jerusalem. The Mount of Olives will split in two, forming a deep valley that runs east and west. Half the mountain will move toward the north, and half will move toward the south. "},{"num":5,"verse":"You will ·run [flee] through this mountain valley, for it will extend to Azel [unknown location east of Jerusalem]. You will run just as you did from the earthquake when Uzziah was king of Judah [Amos 1:1]. Then the Lord my God will come and all the holy ones [either angels or believers; Matt. 25:31; 1 Thess. 3:13; Jude 14; Rev. 19:14] with him."},{"num":6,"verse":"On that day there will be no light, ·cold, or frost [or the sources of lights will diminish]. "},{"num":7,"verse":"There will be no other day like it, ·and the Lord knows when it will come [a day known to the Lord]. There will be no day or night; even at evening it will still be light."},{"num":8,"verse":"At that time ·fresh [bubbling; or living; life-giving] water will flow from Jerusalem. Half of it will flow east to the ·Dead [eastern] Sea, and half will flow west to the ·Mediterranean [western] Sea. It will flow summer and winter."},{"num":9,"verse":"Then the Lord will be king over the whole world. ·At that time [On that day] ·there will be only one Lord [the Lord will be one; Deut. 6:4–5], and his name ·will be the only name [one]."},{"num":10,"verse":"All the land south of Jerusalem from Geba [six miles northeast of Jerusalem, the northern boundary of Judah] to ·Rimmon [thirty-five miles southwest of Jerusalem] will be ·turned into a plain [or like the Arabah; the Jordan Valley, from Mount Hermon to the Gulf of Aqaba]. Jerusalem will be raised up, but it will stay in the same place. The city will reach from the Benjamin Gate and to the First Gate to the Corner Gate, and from the Tower of Hananel to the king’s winepresses. "},{"num":11,"verse":"People will live there, and it will never be destroyed again. Jerusalem will ·be safe [dwell in security]."},{"num":12,"verse":"But the Lord will bring a terrible ·disease [plague] on the nations that fought against Jerusalem. Their flesh will rot away while they are still standing up. Their eyes will rot in their sockets, and their tongues will rot in their mouths. "},{"num":13,"verse":"·At that time [On that day] the Lord will cause panic. Everybody will grab ·his [the hand of his] neighbor, and they will ·attack each other [raise his hand against the hand of his neighbor]. "},{"num":14,"verse":"·The people of Judah [Judah] will fight in Jerusalem. And the wealth of the nations around them will be collected—much gold, silver, and clothes. "},{"num":15,"verse":"A similar ·disease [plague] will strike the horses, mules, camels, donkeys, and all the animals in the camps."},{"num":16,"verse":"All of those left alive of the ·people [nations] who came to fight Jerusalem will come back to Jerusalem year after year to worship the King, the Lord ·All-Powerful [Almighty; of Heaven’s Armies; of hosts], and to celebrate the Feast of ·Shelters [Booths; Tabernacles; Deut. 31:9–13]. "},{"num":17,"verse":"Anyone from the nations who does not go to Jerusalem to worship the King, the Lord ·All-Powerful [Almighty; of Heaven’s Armies; of hosts], will not have rain fall on his land. "},{"num":18,"verse":"If the Egyptians do not go to Jerusalem, they will not have rain. Then the Lord will send them the same ·terrible disease [plague] he sent the other nations that did not celebrate the Feast of ·Shelters [Booths; Tabernacles]. "},{"num":19,"verse":"This will be the punishment for Egypt and any nation that does not go up to celebrate the Feast of Shelters."},{"num":20,"verse":"·At that time [On that day] the horses’ bells will have written on them: holy to the lord. The cooking pots in the Temple of the Lord will be like the holy altar bowls. "},{"num":21,"verse":"Every pot in Jerusalem and Judah will be holy to the Lord ·All-Powerful [Almighty; of Heaven’s Armies; of hosts], and everyone who offers sacrifices will be able to take food from them and cook in them. ·At that time [On that day] there will not be any ·buyers or sellers [or Canaanite] in the Temple of the Lord [Matt. 21:12–13; John 2:13–16] ·All-Powerful [Almighty; of Heaven’s Armies; of hosts]."}]