[{"num":6,"verse":"Then Solomon said, The Lord has said that He would dwell in the thick darkness;"},{"num":2,"verse":"I have built You a house, [in which the dark Holy of Holies seems] a [fitting] abode for You, a place for You to dwell in forever."},{"num":3,"verse":"And the king turned his face and blessed all the assembly of Israel, and they all stood."},{"num":4,"verse":"And he said, Blessed be the Lord, the God of Israel, Who has fulfilled with His hands what He promised with His mouth to David my father, saying,"},{"num":5,"verse":"Since the day that I brought My people out of the land of Egypt, I chose no city among all the tribes of Israel to build a house in, that My Name might be there, neither chose I any man to be a ruler over My people Israel;"},{"num":6,"verse":"But I have chosen Jerusalem, that My Name [and the symbol of My presence] might be there, and I have chosen David to be over My people Israel."},{"num":7,"verse":"Now it was in the heart of David my father to build a house for the Name and renown of the Lord, the God of Israel."},{"num":8,"verse":"But the Lord said to David my father, Since it was in your heart to build a house for My Name and renown, you did well that it was in your heart."},{"num":9,"verse":"Yet you shall not build the house, but your son, who shall be born to you—he shall build the house for My Name."},{"num":10,"verse":"The Lord therefore has performed His word that He has spoken, for I have risen up in the place of David my father and sit on the throne of Israel, as the Lord promised, and have built the house for the Name of the Lord, the God of Israel."},{"num":11,"verse":"In it have I put the ark [the symbol of His presence], in which is the covenant of the Lord [the Ten Commandments] which He made with the people of Israel."},{"num":12,"verse":"And Solomon stood before the altar of the Lord in the presence of all the assembly of Israel and spread forth his hands."},{"num":13,"verse":"For he had made a bronze scaffold, five cubits square and three cubits high, and had set it in the midst of the court; upon it he stood, and he knelt upon his knees before all the assembly of Israel and spread forth his hands toward heaven,"},{"num":14,"verse":"And said, O Lord, God of Israel, there is no God like You in the heavens or in the earth, keeping covenant and showing mercy and loving-kindness to Your servants who walk before You with all their hearts,"},{"num":15,"verse":"You Who have kept Your promises to my father David and fulfilled with Your hand what You spoke with Your mouth, as it is today."},{"num":16,"verse":"Now therefore, O Lord, God of Israel, keep with Your servant David my father that which You promised him, saying, There shall not fail a man in My sight to sit on the throne of Israel, provided your children are careful to walk in My law as you, David, have walked before Me."},{"num":17,"verse":"Now then, O Lord, God of Israel, let Your word to Your servant David be verified."},{"num":18,"verse":"But will God actually dwell with men on the earth? Behold, heaven and the heaven of heavens cannot contain You; how much less this house which I have built!"},{"num":19,"verse":"Yet have respect for the prayer of Your servant and for his supplication, O Lord my God, to listen to the cry and the prayer which Your servant prays before You,"},{"num":20,"verse":"That Your eyes may be open upon this house day and night, toward the place in which You have said You would put Your Name [and the symbol of your presence], to listen to and heed the prayer which Your servant prays facing this place."},{"num":21,"verse":"So listen to and heed the requests of Your servant and Your people Israel which they shall make facing this place. Hear from Your dwelling place, heaven; and when You hear, forgive."},{"num":22,"verse":"If a man sins against his neighbor, and he is required to take an oath, and the oath comes before Your altar in this house,"},{"num":23,"verse":"Then hear from heaven and do; and judge Your servants, requiting the wicked by bringing his conduct upon his own head, and justifying the [uncompromisingly] righteous by giving him according to his righteousness (his uprightness and right standing with God)."},{"num":24,"verse":"If Your people Israel have been defeated before the enemy because they have sinned against You, and shall return, confess Your name [and You Yourself], and pray and make supplication before You in this house,"},{"num":25,"verse":"Then hear from heaven and forgive the sin of Your people Israel and bring them again to the land which You gave to them and their fathers."},{"num":26,"verse":"When the heavens are shut up and there is no rain because Your people have sinned against You, yet if they pray toward this place, confess your name [and You Yourself], and turn from their sin when You afflict them,"},{"num":27,"verse":"Then hear from heaven and forgive the sin of Your servants, [all of] Your people Israel, when You have taught them the good way in which they should walk. And send rain upon Your land which You have given to Your people for an inheritance."},{"num":28,"verse":"If there is famine in the land, if there is pestilence, blight, mildew, locusts, or caterpillars, if their enemies besiege them in any of their cities, whatever plague or sickness there may be,"},{"num":29,"verse":"Then whatever prayer or supplication any man or all of Your people Israel shall make—each knowing his own affliction and his own sorrow and stretching out his hands toward this house—"},{"num":30,"verse":"Then hear from heaven, Your dwelling place, and forgive, and render to every man according to all his ways, whose heart You know; for You, You only, know men’s hearts,"},{"num":31,"verse":"That they may fear You and walk in Your ways as long as they live in the land which You gave to our fathers."},{"num":32,"verse":"Also concerning the stranger who is not of Your people Israel but has come from a far country for Your great name’s sake and Your mighty power and Your outstretched arm—if he comes and prays toward this house,"},{"num":33,"verse":"Hear from heaven, from Your dwelling place, and do all for which the stranger calls to You, that all peoples of the earth may know Your name and fear You [reverently and worshipfully], as do Your people Israel, and may know that this house which I have built is called by Your Name."},{"num":34,"verse":"If Your people go out to war against their enemies by the way that You send them, and they pray to You facing this city [Jerusalem] which You have chosen and the house which I have built for Your Name,"},{"num":35,"verse":"Then hear from heaven their prayer and supplication, and maintain their cause."},{"num":36,"verse":"If they sin against You—for there is no man who does not sin—and You are angry with them and give them to enemies who take them captive to a land far or near;"},{"num":37,"verse":"Yet if they repent in the land to which they have been carried captive, and turn and pray there, saying, We have sinned, we have done wrong, and have dealt wickedly;"},{"num":38,"verse":"If they return to You with all their heart and soul in the land of their captivity, and pray facing their land which You gave to their fathers and toward the city which You have chosen and the house which I have built for Your Name;"},{"num":39,"verse":"Then hear from heaven, Your dwelling place, their prayer and supplications, and maintain their cause; and forgive Your people, who have sinned against You."},{"num":40,"verse":"Now, O my God, I beseech You, let Your eyes be open and Your ears attentive to the prayer offered in this temple."},{"num":41,"verse":"So now arise, O Lord God, and come into Your resting place, You and the ark of Your strength and power. Let Your priests, O Lord God, be clothed with salvation, and let Your saints (Your zealous ones) rejoice in good and in Your goodness."},{"num":42,"verse":"O Lord God, turn not away the face of [me] Your anointed one; [earnestly] remember Your good deeds, mercy, and steadfast love for David Your servant."}]