[{"header":"Lazarus is ill"},{"num":11,"verse":"A certain man, Lazarus, was ill. He was from Bethany, the village of Mary and her sister Martha."},{"num":2,"verse":"(This was the Mary who anointed the Lord with fragrant oil and wiped his feet with her hair. Her brother Lazarus was ill.)"},{"num":3,"verse":"So the sisters sent word to Jesus, saying, “Lord, the one whom you love is ill.”"},{"num":4,"verse":"When he heard this, Jesus said, “This illness isn’t fatal. It’s for the glory of God so that God’s Son can be glorified through it.”"},{"num":5,"verse":"Jesus loved Martha, her sister, and Lazarus."},{"num":6,"verse":"When he heard that Lazarus was ill, he stayed where he was. After two days,"},{"num":7,"verse":"he said to his disciples, “Let’s return to Judea again.”"},{"num":8,"verse":"The disciples replied, “Rabbi, the Jewish opposition wants to stone you, but you want to go back?”"},{"num":9,"verse":"Jesus answered, “Aren’t there twelve hours in the day? Whoever walks in the day doesn’t stumble because they see the light of the world."},{"num":10,"verse":"But whoever walks in the night does stumble because the light isn’t in them.”"},{"num":11,"verse":"He continued, “Our friend Lazarus is sleeping, but I am going in order to wake him up.”"},{"num":12,"verse":"The disciples said, “Lord, if he’s sleeping, he will get well.”"},{"num":13,"verse":"They thought Jesus meant that Lazarus was in a deep sleep, but Jesus had spoken about Lazarus’ death."},{"num":14,"verse":"Jesus told them plainly, “Lazarus has died."},{"num":15,"verse":"For your sakes, I’m glad I wasn’t there so that you can believe. Let’s go to him.”"},{"num":16,"verse":"Then Thomas (the one called Didymus) said to the other disciples, “Let us go too so that we may die with Jesus.”"},{"header":"Jesus with Martha and Mary"},{"num":17,"verse":"When Jesus arrived, he found that Lazarus had already been in the tomb for four days."},{"num":18,"verse":"Bethany was a little less than two miles from Jerusalem."},{"num":19,"verse":"Many Jews had come to comfort Martha and Mary after their brother’s death."},{"num":20,"verse":"When Martha heard that Jesus was coming, she went to meet him, while Mary remained in the house."},{"num":21,"verse":"Martha said to Jesus, “Lord, if you had been here, my brother wouldn’t have died."},{"num":22,"verse":"Even now I know that whatever you ask God, God will give you.”"},{"num":23,"verse":"Jesus told her, “Your brother will rise again.”"},{"num":24,"verse":"Martha replied, “I know that he will rise in the resurrection on the last day.”"},{"num":25,"verse":"Jesus said to her, “I am the resurrection and the life. Whoever believes in me will live, even though they die."},{"num":26,"verse":"Everyone who lives and believes in me will never die. Do you believe this?”"},{"num":27,"verse":"She replied, “Yes, Lord, I believe that you are the Christ, God’s Son, the one who is coming into the world.”"},{"num":28,"verse":"After she said this, she went and spoke privately to her sister Mary, “The teacher is here and he’s calling for you.”"},{"num":29,"verse":"When Mary heard this, she got up quickly and went to Jesus."},{"num":30,"verse":"He hadn’t entered the village but was still in the place where Martha had met him."},{"num":31,"verse":"When the Jews who were comforting Mary in the house saw her get up quickly and leave, they followed her. They assumed she was going to mourn at the tomb."},{"num":32,"verse":"When Mary arrived where Jesus was and saw him, she fell at his feet and said, “Lord, if you had been here, my brother wouldn’t have died.”"},{"num":33,"verse":"When Jesus saw her crying and the Jews who had come with her crying also, he was deeply disturbed and troubled."},{"num":34,"verse":"He asked, “Where have you laid him?”"},{"num":35,"verse":"Jesus began to cry."},{"num":36,"verse":"The Jews said, “See how much he loved him!”"},{"num":37,"verse":"But some of them said, “He healed the eyes of the man born blind. Couldn’t he have kept Lazarus from dying?”"},{"header":"Jesus at Lazarus’ tomb"},{"num":38,"verse":"Jesus was deeply disturbed again when he came to the tomb. It was a cave, and a stone covered the entrance."},{"num":39,"verse":"Jesus said, “Remove the stone.”"},{"num":40,"verse":"Jesus replied, “Didn’t I tell you that if you believe, you will see God’s glory?”"},{"num":41,"verse":"So they removed the stone. Jesus looked up and said, “Father, thank you for hearing me."},{"num":42,"verse":"I know you always hear me. I say this for the benefit of the crowd standing here so that they will believe that you sent me.”"},{"num":43,"verse":"Having said this, Jesus shouted with a loud voice, “Lazarus, come out!”"},{"num":44,"verse":"The dead man came out, his feet bound and his hands tied, and his face covered with a cloth. Jesus said to them, “Untie him and let him go.”"},{"num":45,"verse":"Therefore, many of the Jews who came with Mary and saw what Jesus did believed in him."},{"num":46,"verse":"But some of them went to the Pharisees and told them what Jesus had done."},{"header":"Caiaphas prophesies"},{"num":47,"verse":"Then the chief priests and Pharisees called together the council and said, “What are we going to do? This man is doing many miraculous signs!"},{"num":48,"verse":"If we let him go on like this, everyone will believe in him. Then the Romans will come and take away both our temple and our people.”"},{"num":49,"verse":"One of them, Caiaphas, who was high priest that year, told them, “You don’t know anything!"},{"num":50,"verse":"You don’t see that it is better for you that one man die for the people rather than the whole nation be destroyed.”"},{"num":51,"verse":"He didn’t say this on his own. As high priest that year, he prophesied that Jesus would soon die for the nation—"},{"num":52,"verse":"and not only for the nation. Jesus would also die so that God’s children scattered everywhere would be gathered together as one."},{"num":53,"verse":"From that day on they plotted to kill him."},{"header":"The Passover draws near"},{"num":54,"verse":"Therefore, Jesus was no longer active in public ministry among the Jewish leaders. Instead, he left Jerusalem and went to a place near the wilderness, to a city called Ephraim, where he stayed with his disciples."},{"num":55,"verse":"It was almost time for the Jewish Passover, and many people went from the countryside up to Jerusalem to purify themselves through ritual washing before the Passover."},{"num":56,"verse":"They were looking for Jesus. As they spoke to each other in the temple, they said, “What do you think? He won’t come to the festival, will he?”"},{"num":57,"verse":"The chief priests and Pharisees had given orders that anyone who knew where he was should report it, so they could arrest him."}]