[{"header":"Jesus Brings Lazarus Back to Life"},{"num":11,"verse":"Lazarus, who lived in Bethany, the village where Mary and her sister Martha lived, was sick. "},{"num":2,"verse":"(Mary was the woman who poured perfume on the Lord and wiped his feet with her hair. Her brother Lazarus was the one who was sick.)"},{"num":3,"verse":"So the sisters sent a messenger to tell Jesus, “Lord, your close friend is sick.”"},{"num":4,"verse":"When Jesus heard the message, he said, “His sickness won’t result in death. Instead, this sickness will bring glory to God so that the Son of God will receive glory through it.”"},{"num":5,"verse":"Jesus loved Martha, her sister, and Lazarus. "},{"num":6,"verse":"Yet, when Jesus heard that Lazarus was sick, he stayed where he was for two more days."},{"num":7,"verse":"Then, after the two days, Jesus said to his disciples, “Let’s go back to Judea.”"},{"num":8,"verse":"The disciples said to him, “Rabbi, not long ago the Jews wanted to stone you to death. Do you really want to go back there?”"},{"num":9,"verse":"Jesus answered, “Aren’t there twelve hours of daylight? Those who walk during the day don’t stumble, because they see the light of this world. "},{"num":10,"verse":"However, those who walk at night stumble because they have no light in themselves.”"},{"num":11,"verse":"After Jesus said this, he told his disciples, “Our friend Lazarus is sleeping, and I’m going to Bethany to wake him.”"},{"num":12,"verse":"His disciples said to him, “Lord, if he’s sleeping, he’ll get well.”"},{"num":13,"verse":"Jesus meant that Lazarus was dead, but the disciples thought Jesus meant that Lazarus was only sleeping. "},{"num":14,"verse":"Then Jesus told them plainly, “Lazarus has died, "},{"num":15,"verse":"but I’m glad that I wasn’t there so that you can grow in faith. Let’s go to Lazarus.”"},{"num":16,"verse":"Thomas, who was called Didymus, said to the rest of the disciples, “Let’s go so that we, too, can die with Jesus.”"},{"num":17,"verse":"When Jesus arrived, he found that Lazarus had been in the tomb for four days. "},{"num":18,"verse":"(Bethany was near Jerusalem, not quite two miles away.) "},{"num":19,"verse":"Many Jews had come to Martha and Mary to comfort them about their brother."},{"num":20,"verse":"When Martha heard that Jesus was coming, she went to meet him. Mary stayed at home. "},{"num":21,"verse":"Martha told Jesus, “Lord, if you had been here, my brother would not have died. "},{"num":22,"verse":"But even now I know that God will give you whatever you ask him.”"},{"num":23,"verse":"Jesus told Martha, “Your brother will come back to life.”"},{"num":24,"verse":"Martha answered Jesus, “I know that he’ll come back to life on the last day, when everyone will come back to life.”"},{"num":25,"verse":"Jesus said to her, “I am the one who brings people back to life, and I am life itself. Those who believe in me will live even if they die. "},{"num":26,"verse":"Everyone who lives and believes in me will never die. Do you believe that?”"},{"num":27,"verse":"Martha said to him, “Yes, Lord, I believe that you are the Messiah, the Son of God, the one who was expected to come into the world.”"},{"num":28,"verse":"After Martha had said this, she went back home and whispered to her sister Mary, “The teacher is here, and he is calling for you.”"},{"num":29,"verse":"When Mary heard this, she got up quickly and went to Jesus. "},{"num":30,"verse":"(Jesus had not yet come into the village but was still where Martha had met him.) "},{"num":31,"verse":"The Jews who were comforting Mary in the house saw her get up quickly and leave. So they followed her. They thought that she was going to the tomb to cry. "},{"num":32,"verse":"When Mary arrived where Jesus was and saw him, she knelt at his feet and said, “Lord, if you had been here, my brother would not have died.”"},{"num":33,"verse":"When Jesus saw her crying, and the Jews who were crying with her, he was deeply moved and troubled."},{"num":34,"verse":"So Jesus asked, “Where did you put Lazarus?”"},{"num":35,"verse":"Jesus cried. "},{"num":36,"verse":"The Jews said, “See how much Jesus loved him.” "},{"num":37,"verse":"But some of the Jews asked, “Couldn’t this man who gave a blind man sight keep Lazarus from dying?”"},{"num":38,"verse":"Deeply moved again, Jesus went to the tomb. It was a cave with a stone covering the entrance. "},{"num":39,"verse":"Jesus said, “Take the stone away.”"},{"num":40,"verse":"Jesus said to her, “Didn’t I tell you that if you believe, you would see God’s glory?” "},{"num":41,"verse":"So the stone was moved away from the entrance of the tomb."},{"num":42,"verse":"I’ve known that you always hear me. However, I’ve said this so that the crowd standing around me will believe that you sent me.” "},{"num":43,"verse":"After Jesus had said this, he shouted as loudly as he could, “Lazarus, come out!”"},{"num":44,"verse":"The dead man came out. Strips of cloth were wound around his feet and hands, and his face was wrapped with a handkerchief. Jesus told them, “Free Lazarus, and let him go.”"},{"header":"The Jewish Council Plans to Kill Jesus"},{"num":45,"verse":"Many Jews who had visited Mary and had seen what Jesus had done believed in him. "},{"num":46,"verse":"But some of them went to the Pharisees and told them what Jesus had done. "},{"num":47,"verse":"So the chief priests and the Pharisees called a meeting of the council. They asked, “What are we doing? This man is performing a lot of miracles. "},{"num":48,"verse":"If we let him continue what he’s doing, everyone will believe in him. Then the Romans will take away our position and our nation.”"},{"num":49,"verse":"One of them, Caiaphas, who was chief priest that year, told them, “You people don’t know anything. "},{"num":50,"verse":"You haven’t even considered this: It is better for one man to die for the people than for the whole nation to be destroyed.”"},{"num":51,"verse":"Caiaphas didn’t say this on his own. As chief priest that year, he prophesied that Jesus would die for the Jewish nation. "},{"num":52,"verse":"He prophesied that Jesus wouldn’t die merely for this nation, but that Jesus would die to bring God’s scattered children together and make them one."},{"num":53,"verse":"From that day on, the Jewish council planned to kill Jesus. "},{"num":54,"verse":"So Jesus no longer walked openly among the Jews. Instead, he left Bethany and went to the countryside near the desert, to a city called Ephraim, where he stayed with his disciples."},{"num":55,"verse":"The Jewish Passover was near. Many people came from the countryside to Jerusalem to purify themselves before the Passover. "},{"num":56,"verse":"As they stood in the temple courtyard, they looked for Jesus and asked each other, “Do you think that he’ll avoid coming to the festival?” "},{"num":57,"verse":"(The chief priests and the Pharisees had given orders that whoever knew where Jesus was should tell them so that they could arrest him.)"}]