[{"header":"The Death of Lazarus"},{"num":11,"verse":"Now a certain man was ill, Lazarus from Bethany, the village of Mary and her sister Martha. "},{"num":2,"verse":"Mary was the woman who anointed the Lord with perfume and wiped his feet with her hair. Her brother Lazarus was the one who was ill. "},{"num":3,"verse":"So the sisters sent word to Jesus and told him, “Lord, the one whom you love is ill.”"},{"num":4,"verse":"But when Jesus heard it, he said, “This illness isn’t meant to end in death. It’s for God’s glory, so that the Son of God may be glorified through it.” "},{"num":5,"verse":"Now Jesus loved Martha and her sister and Lazarus. "},{"num":6,"verse":"Yet, when he heard that Lazarus was ill, he stayed where he was for two more days."},{"num":7,"verse":"After this, he told the disciples, “Let’s go back to Judea.”"},{"num":8,"verse":"The disciples told him, “Rabbi, the Jewish leaders were just now trying to stone you to death, and you are going back there again?”"},{"num":9,"verse":"Jesus replied, “There are twelve hours in the day, aren’t there? If anyone walks during the day he does not stumble, because he sees the light of this world. "},{"num":10,"verse":"But if anyone walks at night he stumbles, because the light is not in him.” "},{"num":11,"verse":"These were the things he said."},{"num":12,"verse":"So the disciples told him, “Lord, if he has fallen asleep, he will get well.” "},{"num":13,"verse":"Jesus, however, had been speaking about his death, but they thought that he was speaking about resting or sleeping."},{"num":14,"verse":"Then Jesus told them plainly, “Lazarus has died. "},{"num":15,"verse":"For your sake I’m glad that I wasn’t there, so that you may believe. But let’s go to him.”"},{"num":16,"verse":"Then Thomas, who was called the Twin, told his fellow disciples, “Let’s go, too, so that we may die with him!”"},{"header":"Jesus the Resurrection and the Life"},{"num":17,"verse":"When Jesus arrived, he found that Lazarus had already been in the tomb for four days. "},{"num":18,"verse":"Now Bethany was near Jerusalem, about fifteen stadia away, "},{"num":19,"verse":"and many of the Jews had come to Martha and Mary to console them about their brother. "},{"num":20,"verse":"As soon as Martha heard that Jesus was coming, she went and met him, while Mary stayed at home."},{"num":21,"verse":"Martha told Jesus, “Lord, if you had been here, my brother would not have died. "},{"num":22,"verse":"But even now I know that whatever you ask of God, he will give it to you.”"},{"num":23,"verse":"Jesus told her, “Your brother will rise again.”"},{"num":24,"verse":"Martha told him, “I know that he will rise again in the resurrection on the last day.”"},{"num":25,"verse":"Jesus told her, “I am the resurrection and the life. The person who believes in me, even though he dies, will live. "},{"num":26,"verse":"Indeed, everyone who lives and believes in me will never die. Do you believe that?”"},{"num":27,"verse":"“Yes, Lord,” she told him. “I believe that you are the Messiah, the Son of God, the one who was to come into the world.”"},{"num":28,"verse":"When she had said this, she went away and called her sister Mary and told her privately, “The Teacher is here and is calling for you!”"},{"num":29,"verse":"As soon as Mary heard this, she got up quickly and went to him. "},{"num":30,"verse":"Now Jesus had not yet arrived at the village but was still at the place where Martha had met him. "},{"num":31,"verse":"When the Jews who had been with her, consoling her in the house, saw Mary get up quickly and go out, they followed her, thinking that she had gone to the tomb to cry there."},{"num":32,"verse":"As soon as Mary came to where Jesus was and saw him, she fell down at his feet and told him, “Lord, if you had been here, my brother wouldn’t have died.”"},{"num":33,"verse":"When Jesus saw her crying, and the Jews who had come with her crying, he was greatly troubled in spirit and deeply moved. "},{"num":34,"verse":"He asked, “Where have you put him?”"},{"num":35,"verse":"Jesus burst into tears."},{"num":36,"verse":"So the Jews said, “See how much he loved him!”"},{"num":37,"verse":"But some of them said, “Surely the one who opened the eyes of the blind man could have kept this man from dying, couldn’t he?”"},{"header":"Jesus Brings Lazarus Back to Life"},{"num":38,"verse":"Groaning deeply again, Jesus came to the tomb. It was a cave, and a stone was lying in front of it. "},{"num":39,"verse":"Jesus said, “Remove the stone.”"},{"num":40,"verse":"Jesus told her, “I told you that if you believed you would see God’s glory, didn’t I?” "},{"num":41,"verse":"So they removed the stone."},{"num":42,"verse":"I know that you always hear me, but I have said this for the sake of the crowd standing here, so that they may believe that you sent me.”"},{"num":43,"verse":"After saying this, he shouted with a loud voice, “Lazarus, come out!” "},{"num":44,"verse":"The man who had died came out, his hands and feet tied with strips of cloth, and his face wrapped in a handkerchief. Jesus told them, “Untie him, and let him go.”"},{"header":"The Jewish Council Plans to Kill Jesus(A)"},{"num":45,"verse":"Many of the Jews who had come with Mary and who had observed what Jesus did believed in him. "},{"num":46,"verse":"Some of them, however, went to the Pharisees and told them what Jesus had done. "},{"num":47,"verse":"So the high priests and the Pharisees assembled the Council and said, “What are we going to do? This man is performing many signs. "},{"num":48,"verse":"If we let him go on like this, everyone will believe in him, and the Romans will come and destroy both our Temple and our nation.”"},{"num":49,"verse":"But one of them, Caiaphas, who was high priest that year, told them, “You don’t know anything! "},{"num":50,"verse":"You don’t realize that it is better for you to have one man die for the people than to have the whole nation destroyed.” "},{"num":51,"verse":"Now he did not say this on his own initiative. As high priest that year, he prophesied that Jesus would die for the nation, "},{"num":52,"verse":"and not only for the nation, but that he would also gather into one the children of God who were scattered abroad. "},{"num":53,"verse":"So from that day on they resolved to put him to death. "},{"num":54,"verse":"As a result, Jesus no longer walked openly among the Jews. Instead, he went from there to a town called Ephraim in the region near the wilderness. There he remained with his disciples."},{"num":55,"verse":"Now the Jewish Passover was approaching, and before the Passover many people from the countryside went up to Jerusalem to purify themselves. "},{"num":56,"verse":"They kept looking for Jesus and saying to one another as they stood in the Temple, “What do you think? Surely he won’t come to the festival, will he?” "},{"num":57,"verse":"Now the high priests and the Pharisees had given orders that whoever knew where he was should tell them so that they could arrest him."}]