[{"header":"The Call of Jonah"},{"num":1,"verse":"Now the word of the Lord came to Jonah son of Amittai, saying, "},{"num":2,"verse":"“Get up, go to Nineveh, the great city, and cry out against it, because their wickedness has come up before Me.”"},{"num":3,"verse":"But Jonah got up to flee to Tarshish from the presence of the Lord. He went down to Joppa and found there a ship going to Tarshish. He paid its fare and went down into it to go with them to Tarshish from the presence of the Lord."},{"num":4,"verse":"But the Lord hurled a great wind upon the sea, and a mighty storm came upon the sea, so that the ship was in danger of breaking up. "},{"num":5,"verse":"Then the sailors were afraid, and each cried to his god. They tossed the ship’s cargo into the sea in order to lighten the load."},{"num":6,"verse":"The captain came to him and said, “What are you doing asleep? Get up, call to your god! Perhaps your god will consider us, so that we will not perish.”"},{"num":7,"verse":"The sailors said to one another, “Come, let us cast lots that we may know on whose account this disaster has come upon us.” So they cast lots, and the lot fell on Jonah."},{"num":8,"verse":"Then the sailors said to Jonah, “Tell us why this disaster has come upon us. What is your occupation? Where do you come from? What is your country? And from what people are you?”"},{"num":9,"verse":"Jonah replied, “I am a Hebrew, and I fear the Lord, the God of heaven, who made the sea and the dry land.”"},{"num":10,"verse":"Then the men were very afraid and said to him, “What is this you have done?” For the men knew that he was fleeing from the presence of the Lord because he had told them."},{"num":11,"verse":"Then they said to Jonah, “What shall we do to you, so that the sea may quiet down for us?” For the sea was growing stormier."},{"num":12,"verse":"So Jonah said to them, “Pick me up and toss me into the sea. Then the sea will quiet down for you. For I know that it is on my account this great storm has come upon you.”"},{"num":13,"verse":"Nevertheless, the men rowed hard to bring the ship to land, but they could not do it, for the sea grew more tempestuous against them. "},{"num":14,"verse":"Then they cried to the Lord and said, “Please, Lord, do not let us perish for this man’s life, and do not make us guilty for innocent blood, for You, Lord, have done as it pleased You.” "},{"num":15,"verse":"So they picked up Jonah and tossed him into the sea. Then the sea ceased from its raging. "},{"num":16,"verse":"Therefore the men were very afraid of the Lord, and they offered a sacrifice to the Lord and made vows."},{"header":"The Prayer and Deliverance of Jonah"},{"num":17,"verse":"Now the Lord appointed a great fish to swallow Jonah. And Jonah was in the belly of the fish three days and three nights."}]