[{"num":1,"verse":"Now the Devar Hashem came unto Yonah ben Amittai, saying,"},{"num":2,"verse":"Arise, go to Nineveh, that ha’ir hagedolah (great city), and preach against it; for their wickedness is come up before Me."},{"num":3,"verse":"But Yonah rose up to run away unto Tarshish from the presence of Hashem, and went down to Yafo; and he found an oniyah going to Tarshish; so he paid the fare thereof, and went down into it, to go with them unto Tarshish from the presence of Hashem."},{"num":4,"verse":"But Hashem sent out a ruach gedolah (great wind) into the yam (sea), and there was a sa’ar gadol (mighty tempest) in the yam, so that the oniyah was like to be broken."},{"num":5,"verse":"Then the mariners were afraid, and cried every man unto his g-d, and cast forth the cargoes that were in the oniyah into the yam, to lighten it of them. But Yonah was gone down into the hold of the ship; and he lay, and was fast asleep."},{"num":6,"verse":"So the shipmaster came to him, and said unto him, What meanest thou, O sleeper? Arise, call upon Eloheicha, if so be that HaElohim will think upon us, that we perish not."},{"num":7,"verse":"And they said every one to his fellow, Come, and let us cast goralot (lots), that we may have da’as for whose cause this ra’ah is upon us. So they cast goralot (lots), and the goral (lot) fell upon Yonah."},{"num":8,"verse":"Then said they unto him, Tell us, we pray thee, for whose cause ra’ah hazot (this evil) is upon us; What is thine occupation? And whence comest thou? What is thy country? And of what people art thou?"},{"num":9,"verse":"And he said unto them, Ivri anochi (I am a Hebrew); and I fear Hashem, Elohei HaShomayim, which hath made the yam and the yabashah (dry land, Bereshis 1:9)."},{"num":10,"verse":"Then were the men of yirah gedolah (great terror), and said unto him: Why hast thou done this? For the men knew that he was running away from the presence of Hashem, because he had told them."},{"num":11,"verse":"Then said they unto him, What shall we do unto thee, that the yam against us may be calm [see Yeshayah 53:5,8; Mt 12:39-40; 16:4]? For the yam did rage and was tempestuous."},{"num":12,"verse":"And he said unto them, Take me up, and cast me forth into the yam; so shall the yam be calm unto you: for I know that for my sake this sa’ar hagadol (great tempest, storm) is upon you."},{"num":13,"verse":"Nevertheless the men rowed hard to bring it to the yabashah; but they could not: for the yam did rage, and was tempestuous against them."},{"num":14,"verse":"Wherefore they cried unto Hashem, and said, We beseech Thee, Hashem, we beseech Thee, let us not perish for this man’s nefesh, and lay not upon us dahm naki (innocent blood); for Thou, Hashem, hast done just as it pleased Thee."},{"num":15,"verse":"So they took up Yonah, and cast him forth into the yam [see Yeshayah 53:5,8; Mt 12:39-40; 16:4]; and the yam ceased from her raging."},{"num":16,"verse":"Then the men feared Hashem with a yirah gedolah, and offered a sacrifice unto Hashem, and vowed nedarim."},{"num":2,"verse":"Now Hashem had prepared a dag gadol (great fish) to swallow up Yonah. And Yonah was in the belly of the dag shloshah yamim and shloshah leilot (three days and three nights)."}]