[{"num":1,"verse":"The Lord sent this message to Jonah, the son of Amittai:"},{"num":2,"verse":"“Go to the great city of Nineveh, and give them this announcement from the Lord: ‘I am going to destroy you, for your wickedness rises before me; it smells to highest heaven.’”"},{"num":3,"verse":"But Jonah was afraid to go and ran away from the Lord. He went down to the seacoast, to the port of Joppa, where he found a ship leaving for Tarshish. He bought a ticket, went on board, and climbed down into the dark hold of the ship to hide there from the Lord."},{"num":4,"verse":"But as the ship was sailing along, suddenly the Lord flung a terrific wind over the sea, causing a great storm that threatened to send them to the bottom. "},{"num":5,"verse":"Fearing for their lives, the desperate sailors shouted to their gods for help and threw the cargo overboard to lighten the ship. And all this time Jonah was sound asleep down in the hold."},{"num":6,"verse":"So the captain went down after him. “What do you mean,” he roared, “sleeping at a time like this? Get up and cry to your god, and see if he will have mercy on us and save us!”"},{"num":7,"verse":"Then the crew decided to draw straws to see which of them had offended the gods and caused this terrible storm; and Jonah drew the short one."},{"num":8,"verse":"“What have you done,” they asked, “to bring this awful storm upon us? Who are you? What is your work? What country are you from? What is your nationality?”"},{"num":9,"verse":"And he said, “I am a Jew; I worship Jehovah, the God of heaven, who made the earth and sea.” Then he told them he was running away from the Lord."},{"num":11,"verse":"“What should we do to you to stop the storm?” For it was getting worse and worse."},{"num":12,"verse":"“Throw me out into the sea,” he said, “and it will become calm again. For I know this terrible storm has come because of me.”"},{"num":13,"verse":"They tried harder to row the boat ashore, but couldn’t make it. The storm was too fierce to fight against. "},{"num":14,"verse":"Then they shouted out a prayer to Jehovah, Jonah’s God. “O Jehovah,” they pleaded, “don’t make us die for this man’s sin, and don’t hold us responsible for his death, for it is not our fault—you have sent this storm upon him for your own good reasons.”"},{"num":15,"verse":"Then they picked up Jonah and threw him overboard into the raging sea—and the storm stopped!"},{"num":16,"verse":"The men stood there in awe before Jehovah, and they sacrificed to him and vowed to serve him."},{"num":17,"verse":"Now the Lord had arranged for a great fish to swallow Jonah. And Jonah was inside the fish three days and three nights."}]