[{"header":"Israel's Idolatry Is Condemned"},{"num":57,"verse":"Good people die, and no one understands or even cares. But when they die, no calamity can hurt them. "},{"num":2,"verse":"Those who live good lives find peace and rest in death."},{"num":3,"verse":"Come here to be judged, you sinners! You are no better than sorcerers, adulterers, and prostitutes. "},{"num":4,"verse":"Who are you making fun of? Who are you liars jeering at? "},{"num":5,"verse":"You worship the fertility gods by having sex under those sacred trees of yours. You offer your children as sacrifices in the rocky caves near stream beds. "},{"num":6,"verse":"You take smooth stones from there and worship them as gods. You pour out wine as offerings to them and bring them grain offerings. Do you think I am pleased with all this? "},{"num":7,"verse":"You go to the high mountains to offer sacrifices and have sex. "},{"num":8,"verse":"You set up your obscene idols just inside your front doors. You forsake me; you take off your clothes and climb in your large beds with your lovers, whom you pay to sleep with you. And there you satisfy your lust. "},{"num":9,"verse":"You put on your perfumes and ointments and go to worship the god Molech. To find gods to worship, you send messengers far and wide, even to the world of the dead. "},{"num":10,"verse":"You wear yourselves out looking for other gods, but you never give up. You think your obscene idols give you strength, and so you never grow weak."},{"num":11,"verse":"The Lord says, “Who are these gods that make you afraid, so that you tell me lies and forget me completely? Have you stopped honoring me because I have kept silent for so long? "},{"num":12,"verse":"You think that what you do is right, but I will expose your conduct, and your idols will not be able to help you. "},{"num":13,"verse":"When you cry for help, let those idols of yours save you! A puff of wind will carry them off! But those who trust in me will live in the land and will worship me in my Temple.”"},{"header":"God's Promise of Help and Healing"},{"num":14,"verse":"The Lord says, “Let my people return to me. Remove every obstacle from their path! Build the road and make it ready!"},{"num":15,"verse":"“I am the high and holy God, who lives forever. I live in a high and holy place, but I also live with people who are humble and repentant, so that I can restore their confidence and hope. "},{"num":16,"verse":"I gave my people life, and I will not continue to accuse them or be angry with them forever. "},{"num":17,"verse":"I was angry with them because of their sin and greed, and so I punished them and abandoned them. But they were stubborn and kept on going their own way."},{"num":18,"verse":"“I have seen how they acted, but I will heal them. I will lead them and help them, and I will comfort those who mourn. "},{"num":19,"verse":"I offer peace to all, both near and far! I will heal my people. "},{"num":20,"verse":"But evil people are like the restless sea, whose waves never stop rolling in, bringing filth and muck. "},{"num":21,"verse":"There is no safety for sinners,” says the Lord."}]