[{"num":57,"verse":"¶ The righteous perishes, and no man lays it to heart: and merciful men are taken away, none considering that the righteous is taken away from the evil to come."},{"num":2,"verse":"He shall enter into peace: they shall rest in their beds, each one walking in his uprightness."},{"num":3,"verse":"¶ But come here, ye sons of the sorceress, generation of the adulterer and the whore."},{"num":4,"verse":"Against whom do ye sport yourselves? Against whom do ye make a wide mouth, and draw out the tongue? Are ye not rebellious sons, a lying seed of transgression,"},{"num":5,"verse":"inflaming yourselves with idols under every green tree, slaying the children in the valleys under the clefts of the rocks?"},{"num":6,"verse":"Among the smooth stones of the valley is thy portion; they, they are thy lot: even unto them hast thou poured a drink offering, thou hast offered a present. Should I not avenge these things?"},{"num":7,"verse":"Upon the lofty and high mountain thou hast set thy bed: even there thou didst go up to offer sacrifice."},{"num":8,"verse":"Behind the doors also and the posts thou hast set up thy remembrance: for thou hast discovered thyself to another than me, and art gone up; thou hast enlarged thy bed and made thee a covenant with them; thou didst love their bed wherever thou didst see it."},{"num":9,"verse":"And thou didst go to the king with ointment and didst multiply thy perfumes, and didst send thy messengers far off, and didst debase thyself even unto Sheol."},{"num":10,"verse":"Thou became wearied in the multitude of thy ways; yet thou didst not say, There is no remedy: thou hast found that which thou wast searching for; therefore thou repented not."},{"num":11,"verse":"And of whom hast thou reverenced or feared? Why dost thou lie; that thou hast not remembered me, nor have I come to thy thought? Have I not held my peace even of old, and thou hast never feared me?"},{"num":12,"verse":"I will declare thy righteousness, and thy works; for they shall not profit thee."},{"num":13,"verse":"¶ When thou criest, let thy companions deliver thee; but the wind shall carry them all away; vanity shall take them: but he that waits in me shall have the land by inheritance and shall possess the mountain of my holiness."},{"num":14,"verse":"And shall say, Clear away, clear away, level the way, take away the stumblingblocks out of the way of my people."},{"num":15,"verse":"For thus has said the high and lofty One that inhabits eternity, whose name is The Holy One; I dwell in the high place and in holiness and with him also that is of a contrite and humble spirit to cause the spirit of the humble to live and to cause the heart of the contrite ones to live."},{"num":16,"verse":"For I will not contend for ever, neither will I be always wroth: for by me is the spirit covered by the body, and I have made the souls."},{"num":17,"verse":"¶ For the iniquity of his covetousness I was wroth and smote him: I hid my face and was wroth, and he went on rebelliously in the way of his heart."},{"num":18,"verse":"I have seen his ways and will heal him: I will lead him also and restore comforts unto him and to his mourners."},{"num":19,"verse":"I create the fruit of the lips; Peace, peace to him that is far off and to him that is near, said the LORD; and healed him."},{"num":20,"verse":"But the wicked are like the sea in tempest, that cannot rest, whose waters cast up mire and dirt."},{"num":21,"verse":"There is no peace, saith my God, for the wicked."}]