[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(18) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Were brought under.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Were humbled, bowed down",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (the same word as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Chronicles 12:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 3:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Prevailed.—Was strong. (Psalm 18:13; Genesis 25:23.)",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Prevailed.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Was strong.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 18:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 25:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "They relied upon the Lord.—Isaiah 10:20. (Authorised Version, “stay upon.”)",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "They relied upon the Lord.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 10:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". (Authorised Version, “stay upon.”)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2 Chronicles",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "THE SECRET OF VICTORY2 Chronicles 13:18",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "THE SECRET OF VICTORY",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 13:18",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " These words are the summing-up of the story of a strange old-world battle between Jeroboam, the adventurer who rent the kingdom, and Abijah, the son of the foolish Rehoboam, whose unseasonable blustering had played into the usurper’s hands. The son was a wiser and better man than his father. It is characteristic of the ancient world, that before battle was joined Abijah made a long speech to the enemy, recounting the ritual deficiencies of the Northern kingdom, and proudly contrasting the punctilious correctness of the Temple service with the irregular cult set up by Jeroboam. He confidently pointed to the priests ‘with their trumpets’ in his army as the visible sign that ‘God is with us at our head,’ and while charging Israel with having ‘forsaken the Lord our God,’ to whom he and his people had kept true, besought them not to carry their rebellion to the extreme of fighting against their fathers’ God, and assured them that no success could attend their weapons in such a strife. The passionate appeal had no effect, but while Abijah was orating, Jeroboam was carrying out a ruse, and planting part of his troops behind Judah, so as to put them between two fires and draw a net round the outnumbered and outmanoeuvred enemy.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Abijah and his men suddenly detected their desperate position, and did the only wise thing. When, with a shock of surprise, they saw that ‘behold! the battle was before and behind them,’ they ‘cried unto the Lord, and the priests sounded with the trumpets.’ The sharp, short cry from thousands of agitated men ringed round by foes, and the blare of the trumpets were both prayers, and heartened the suppliants for their whirlwind charge, before which the men of Israel, double in number as they were, broke and fled. The defeat was thorough, and, for a while, Rehoboam and his kingdom were ‘brought under,’ and a comparatively long peace followed. Our text gathers up the lesson taught, not to Judah or Israel alone, by victory and defeat, when it declares that to rely upon the Lord is to prevail. It opens for us the secret of victory, in that old far-off struggle and in to-day’s conflicts.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. We note the faith of the fighters. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. We note the faith of the fighters.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘They relied,’ says the chronicler, ‘upon the Lord.’ Now the word rendered ‘relied’ is one of several picturesque words by which the Old Testament, which we are sometimes told, with a great flourish of learning, has no mention of ‘faith,’ expresses ‘trust,’ by metaphors drawn from bodily actions which symbolise the spiritual act. The word here literally signifies to lean on, as a feeble hand might on a staff, or a tremulous arm on a strong one. And does not that picture carry with it much insight into what the essence of Old Testament ‘trust’ or New Testament ‘faith’ is? If we think of faith as leaning, we shall not fall into that starved misconception of it which takes it to be nothing more than intellectual assent. We shall see there is a far fuller pulse of feeling than that beating in it. A man who leans on some support, does so because he knows that his own strength is insufficient for his need. The consciousness of weakness is the beginning of faith. He who has never despaired of himself has scarcely trusted in God. Abijah’s enemies were two to one of his own men. No wonder that they cried unto the Lord, and felt a stound of despair shake their courage. And who of us can face life with its heavy duties, its thick-clustering dangers and temptations, its certain struggles, its possible failures, and not feel the cold touch of dread gripping our hearts, though strong and brave? Surely he has had little experience, or has learned little wisdom from the experience he has had, who has yet to discover his own weakness. But the consciousness of weakness is by itself debilitating, and but increases the weakness of which it is painfully aware. There is no surer way to sap what strength we have than to tell ourselves what poor creatures we are. The purpose and end of self-contemplation which becomes aware of our own feebleness is to lead us to the contemplation of God, our immortal strength. Abijah’s assurance that ‘God is with us at our head’ rang out triumphantly. Faith has an upper and an under side: the under side is self-distrust; the upper, trust in God. He will never lean all his weight on a prop, who fancies that he can stand alone, or has other stays to hold him up.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But Abijah’s example teaches us another lesson-that for a vigorous faith, there must be obedience to all God’s known will. True, thank God! faith often springs in its power in a soul that is conscious but of sin, but a continuance in disobedience will inevitably kill faith. It was because Abijah and his people had kept ‘the charge of the Lord our God,’ that they were sure that God was with them. We can only be sure of God to lean on when we are doing His will, and we shall do His will only as we are sure that we lean on Him. Our trust in Him will be strong and operative in the measure in which our lives are conformed to His commandments. Much elaborate dissertation has been devoted to expounding what faith is, and the strong, vivid Scriptural conception of it has been woefully darkened and overlaid with cobwebs of theology, but surely this eloquent metaphor of our text tells us more than do many learned volumes. It bids us lean on God, rest the whole weight of our needs, our weaknesses, and our sins on Him. Like any human friend or helper, He is better pleased when we lean hard on Him than when we gingerly put a finger on His arm, and lay no pressure on it, as we do when in ceremonial fashion we seem to accept another’s support, and hold ourselves back from putting a weight on the offered arm. We cannot rely too utterly on Him. We honour Him most when we repose our whole selves on His strong arm.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. The increase of faith by sudden fear. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. The increase of faith by sudden fear.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘When Judah looked back, behold, the battle was before and behind them.’ The shock of seeing the flashing spears in the rear would make the bravest hold their breath for one overwhelming moment, but the next moment their faith in God surged back with tenfold force, increased by the sudden new peril. The sharp collision of flint and steel struck out a spark of faith. ‘What time I am afraid, I will trust in Thee,’ said an expert in the genesis and growth of trust. Peril kills a feeble trust, but vivifies it, if strong. The recognition of danger is meant to drive us to God. If each fresh difficulty or danger makes us tighten our clasp of Him, and lean the harder on Him, it has done its highest service to us, and we have conquered it, and are the stronger because of it. The storm that makes the traveller, fighting with the wind and the rain in his face, clasp his cloak tighter round him, does him no harm. The purpose of our trials is to drive us to God, and a fair-weather faith which had all but fallen asleep is often roused to energy that works wonders, by the sudden dash of danger flung into and disturbing a life. It is wise seamanship to make a run to get snugly behind the breakwater when a sudden gale springs up.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. The expression of faith in appeal to God. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. The expression of faith in appeal to God.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "When the ambush was unmasked, the surrounded men of Judah ‘cried unto the Lord, and the priests sounded with the trumpets,’ before they flung themselves on the enemy. We may be sure that their cry was short and sharp, and poignant with appeal to God. There would be no waste words, nor perfunctory petitions without wings of desire, in that cry. Should we not look for the essential elements of prayer rather to such cries, pressed from burdened hearts by a keen sense of absolute helplessness, and very careless of proprieties so long as they were shrill enough to pierce God’s ear and touch His heart, than to the formal petitions of well-ordered worship? A single ejaculation flung heavenward in a moment of despair or agony is more precious in God’s sight than a whole litany of half-hearted devotions.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The text puts in a striking form another lesson well worth learning, that, in the greatest crises, no time is better spent than time used for prayer. A rush on the enemy would not have served Abijah’s purpose nearly so well as that moment’s pause for crying to the Lord, before his charge. Hands lifted to heaven are nerved to clutch the sword and strike manfully. It is not only that Christ’s soldiers are to fight and pray, but that they fight by praying. That is true in the small conflicts and antagonisms of the lives of each of us, and it is true in regard to the agelong battle against ignorance and sin. Christian’s sword was named ‘All-prayer.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The priests, too, blew a prayer through their trumpets, for the ordinance had appointed that ‘when ye go to war . . . then shall ye sound an alarm with the trumpets; and ye shall be remembered before the Lord your God, and ye shall be saved from your enemies.’ The clear, strident blare was not intended to hearten warriors, or to sing defiance, but to remind God of His promises, and to bring Him on to the battlefield, as He had said that He would be. The truest prayer is that which but picks up the arrows of promise shot from heaven to earth, and casts them back from earth to heaven. He prays best who fills his mouth with God’s words, turning every ‘I will’ of His into ‘Do Thou!’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "IV. The strength that comes through faith. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "IV. The strength that comes through faith.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘As the men of Judah shouted, it came to pass that God smote Jeroboam and all Israel before Abijah and Judah.’ There is no such quickener of all a man’s natural force as even the lowest forms of faith. He who throws himself into any enterprise sure of success will often succeed just because he was sure he would. The world’s history is full of instances where men, with every odds against them, have plucked the flower safety out of the nettle danger, just because they trusted in their star, or their luck, or their destiny. We all know how a very crude faith turned a horde of wild Arabs into a conquering army, that in a century dominated the world from Damascus to Seville. The truth that is in ‘Christian Science’ is that many forms of disease yield to the patient’s firm persuasion of recovery. And from these and many other facts the natural power of faith is beginning to dawn on the most matter-of-fact and unspiritual people. They are beginning to think that perhaps Christ was right after all in saying ‘All things are possible to him that believeth,’ and that it is not such a blunder after all to make faith the first step to all holiness and purity, and the secret of victory in life’s tussle. Leaving out of view for the moment the supernatural effects of faith, which Christianity alleges are its constant consequences, it is clear that its natural effects are all in the direction of increasing the force of the trusting man. It calms, it heartens for all work, effort, and struggle. It imparts patience, it brightens hope, it forbids discouragement, it rebukes and cures despondency. And besides all this, there is the supernatural communication of a strength not our own, which is the constant result of Christian faith. Christian faith knits the soul and the Saviour in so close a union, that all that is Christ’s becomes the Christian’ s, and every believer may hear His Lover’s voice whispering to him what one of His servants once heard in an hour of despondency, ‘My grace is sufficient for thee, for My power is made perfect in weakness.’ Faith joins us to the Lord, and ‘he that is joined to the Lord is one spirit’; and that Lord has said to all His disciples, ‘I give thee Myself, and in Myself all that is Mine.’ We do not go to warfare at our own charges, but there will pass into and abide in our hearts the warlike might of the true King and Captain of the Lord’s host, and we shall hear the ring of His encouraging voice saying, ‘Be of good cheer! I have overcome the world.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "2 Chronicles 13:18",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 13:18",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Thus the children of Israel were brought under at that time — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "And had not the determinate counsel of God been otherwise, surely so great a blow would have brought them back to the house of David. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And Judah prevailed, because they relied on the God of their fathers — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "It was not by their own valour that they obtained this great victory, but by their relying on God, their depending on his power to help them, and their committing themselves and their cause to him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13:1-22 Abijah overcomes Jeroboam. - Jeroboam and his people, by apostacy and idolatry, merited the severe punishment Abijah was permitted to execute upon them. It appears from the character of Abijah, 1Ki 15:3, that he was not himself truly religious, yet he encouraged himself from the religion of his people. It is common for those that deny the power of godliness, to boast of the form of it. Many that have little religion themselves, value it in others. But it was true that there were numbers of pious worshippers in Judah, and that theirs was the more righteous cause. In their distress, when danger was on every side, which way should they look for deliverance unless upward? It is an unspeakable comfort, that our way thither is always open. They cried unto the Lord. Earnest prayer is crying. To the cry of prayer they added the shout of faith, and became more than conquerors. Jeroboam escaped the sword of Abijah, but God struck him; there is no escaping his sword.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Brought under - \"Humbled\" or \"defeated,\" not reduced to subjection. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13-17. But Jeroboam caused an ambushment to come about behind them—The oration of Abijah, however animating an effect it might have produced on his own troops, was unheeded by the party to whom it was addressed; for while he was wasting time in useless words, Jeroboam had ordered a detachment of his men to move quietly round the base of the hill, so that when Abijah stopped speaking, he and his followers found themselves surprised in the rear, while the main body of the Israelitish forces remained in front. A panic might have ensued, had not the leaders \"cried unto the Lord,\" and the priests \"sounded with the trumpets\"—the pledge of victory (Nu 10:9; 31:6). Reassured by the well-known signal, the men of Judah responded with a war shout, which, echoed by the whole army, was followed by an impetuous rush against the foe. The shock was resistless. The ranks of the Israelites were broken, for \"God smote Jeroboam and all Israel.\" They took to flight, and the merciless slaughter that ensued can be accounted for only by tracing it to the rancorous passions enkindled by a civil war.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " They put their trust in him, and confidently expected help from him; which is a disposition of heart that God prizeth and taketh kindly. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "2 Kings 18:5 2 Chronicles 20:20 Psalm 22:4 Daniel 3:28",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 18:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 20:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 22:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 3:28",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Thus the children of Israel were brought under at that time,.... Humbled and weakened, but not reduced to the government of the house of David: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the children of Judah prevailed; or grew strong: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "because they relied upon the Lord God of their fathers; trusted in him, and not in an arm of flesh; the Targum is,\"in the Word of the Lord God of their fathers.'' ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "because they relied upon the Lord God of their fathers; trusted in him, and not in an arm of flesh; the Targum is,\"in the Word of the Lord God of their fathers.'' ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Thus the children of Israel were brought under at that time, and the children of Judah prevailed, {n} because they relied upon the LORD God of their fathers.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Thus the children of Israel were brought under at that time, and the children of Judah prevailed, ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{n}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " because they relied upon the LORD God of their fathers.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(n) He shows that the stay of all kingdoms and assurance of victories depends on our trust and confidence in the Lord.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "because they relied",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Cp. note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 12:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2 Chronicles 13:18",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The results of this victory. The Israelites were bowed down, their power weakened; the men of Judah became strong, mighty, because they relied upon Jahve their God. Following up his victory, Abijah took from Jeroboam several cities with their surrounding domains: Bethel, the present Beitin, see on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 7:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; Jeshanah, occurring only here, and the position of which has not yet been ascertained; and Ephron (עפרון, Keth.; the Keri, on the contrary, עפרין). This city cannot well be identified with Mount Ephron, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 15:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; for that mountain was situated on the southern frontier of Benjamin, not far from Jerusalem, while the city Ephron is to be sought much farther north, in the neighbourhood of Bethel. C. v. Raumer and others identify Ephron or Ephrain both with Ophrah of Benjamin, which, it is conjectured, was situated near or in Tayibeh, to the east of Bethel, and with the Ἐφραΐ́μ, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 11:54",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", whither Jesus withdrew into the wilderness, which, according to Josephus, Bell. Jud. iv. 9. 9, lay in the neighbourhood of Bethel. See on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 18:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: The account of this war, which is peculiar to the Chronicle, and which de Wette declared, on utterly insufficient grounds, to be an invention of the chronicler (cf. against him my apol. Vers. ber die Chron. S. 444ff.), is thus regarded by Ewald (Gesch. Isr. iii. S. 466, der 2:Aufl.): \"The chronicler must certainly have found among his ancient authorities an account of this conclusion of the war, and we cannot but believe that we have here, in so far, authentic tradition;\" and only the details of the description are the results of free expansion by the chronicler, but in the speech 2 Chronicles 13:4-13 every word and every thought is marked by the peculiar colouring of the Chronicle. But this last assertion is contradicted by Ewald's own remark, i. S. 203, that \"in 2 Chronicles 13:4-7, 2 Chronicles 13:19-21, an antiquated manner of speech and representation appears, while in the other verses, on the contrary, those usual with the chronicler are found,\" - in support of which he adduces the words בליּעל בּני, 2 Chronicles 13:7, and מלח בּרית, 2 Chronicles 13:5. According to this view, Abijah's speech cannot have been freely draughted by the chronicler, but must have been derived, at least so far as the fundamental thoughts are concerned, from an ancient authority, doubtless the Midrash of the prophet Iddo, cited in 2 Chronicles 13:22. But Ewald's further remark (iii. S. 466), that the author of the Chronicle, because he regarded the heathenized Samaria of his time as the true representative of the old kingdom of the ten tribes, seized this opportunity to put into King Abijah's mouth a long denunciatory and didactic speech, addressed at the commencement of the battle to the enemy as rebels not merely against the house of David, but also against the true religion, is founded upon the unscriptural idea that the calf-worship of the Israelites was merely a somewhat sensuous form of the true Jahve-worship, and was fundamentally distinct from the heathen idolatry, and also from the idolatry of the later Samaritans. In the judgment of all the prophets, not only of Hosea and Amos, but also of the prophetic author of the book of Kings, the calf-worship was a defection from Jahve, the God of the fathers, - a forsaking of the commands of Jahve, and a serving of the Baals; cf. e.g., 1 Kings 13; 2 Kings 17:7-23. What Abijah says of the calf-worship of the Israelites, and of Judah's attitude to Jahve and His worship in the temple, is founded on the truth, and is also reconcilable with the statement in 1 Kings 15:3, that Abijah's heart was not wholly devoted to the Lord, like David's heart. Abijah had promoted the legal temple-worship even by consecratory gifts (1 Kings 15:15), and could consequently quite well bring forward the worship of God in Judah as the true worship, in contrast to the Israelitic calf-worship, for the discouragement of his enemies, and for the encouragement of his own army; and we may consequently regard the kernel, or the essential contents of the speech, as being historically well-founded. The account of the war, moreover, is also shown to be historical by the exact statement as to the conquered cities in 2 Chronicles 13:19, which evidently has been derived from ancient authorities. Only in the statements about the number of warriors, and of the slain Israelites, the numbers are not to be estimated according to the literal value of the figures; for they are, as has been already hinted in the commentary, only an expression in figures of the opinion of contemporaries of the war, that both kings had made a levy of all the men in their respective kingdoms capable of bearing arms, and that Jeroboam was defeated with such slaughter that he lost more than the half of his warriors.)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: The account of this war, which is peculiar to the Chronicle, and which de Wette declared, on utterly insufficient grounds, to be an invention of the chronicler (cf. against him my apol. Vers. ber die Chron. S. 444ff.), is thus regarded by Ewald (Gesch. Isr. iii. S. 466, der 2:Aufl.): \"The chronicler must certainly have found among his ancient authorities an account of this conclusion of the war, and we cannot but believe that we have here, in so far, authentic tradition;\" and only the details of the description are the results of free expansion by the chronicler, but in the speech ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 13:4-13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " every word and every thought is marked by the peculiar colouring of the Chronicle. But this last assertion is contradicted by Ewald's own remark, i. S. 203, that \"in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 13:4-7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 13:19-21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", an antiquated manner of speech and representation appears, while in the other verses, on the contrary, those usual with the chronicler are found,\" - in support of which he adduces the words בליּעל בּני, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 13:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and מלח בּרית, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 13:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". According to this view, Abijah's speech cannot have been freely draughted by the chronicler, but must have been derived, at least so far as the fundamental thoughts are concerned, from an ancient authority, doubtless the Midrash of the prophet Iddo, cited in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 13:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". But Ewald's further remark (iii. S. 466), that the author of the Chronicle, because he regarded the heathenized Samaria of his time as the true representative of the old kingdom of the ten tribes, seized this opportunity to put into King Abijah's mouth a long denunciatory and didactic speech, addressed at the commencement of the battle to the enemy as rebels not merely against the house of David, but also against the true religion, is founded upon the unscriptural idea that the calf-worship of the Israelites was merely a somewhat sensuous form of the true Jahve-worship, and was fundamentally distinct from the heathen idolatry, and also from the idolatry of the later Samaritans. In the judgment of all the prophets, not only of Hosea and Amos, but also of the prophetic author of the book of Kings, the calf-worship was a defection from Jahve, the God of the fathers, - a forsaking of the commands of Jahve, and a serving of the Baals; cf. e.g., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 17:7-23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". What Abijah says of the calf-worship of the Israelites, and of Judah's attitude to Jahve and His worship in the temple, is founded on the truth, and is also reconcilable with the statement in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 15:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", that Abijah's heart was not wholly devoted to the Lord, like David's heart. Abijah had promoted the legal temple-worship even by consecratory gifts (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 15:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and could consequently quite well bring forward the worship of God in Judah as the true worship, in contrast to the Israelitic calf-worship, for the discouragement of his enemies, and for the encouragement of his own army; and we may consequently regard the kernel, or the essential contents of the speech, as being historically well-founded. The account of the war, moreover, is also shown to be historical by the exact statement as to the conquered cities in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 13:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", which evidently has been derived from ancient authorities. Only in the statements about the number of warriors, and of the slain Israelites, the numbers are not to be estimated according to the literal value of the figures; for they are, as has been already hinted in the commentary, only an expression in figures of the opinion of contemporaries of the war, that both kings had made a levy of all the men in their respective kingdoms capable of bearing arms, and that Jeroboam was defeated with such slaughter that he lost more than the half of his warriors.)",
            "children": []
          }
        ]
      }
    ]
  }
]