[{"header":"Joseph Sets a Trap"},{"num":44,"verse":"Then Joseph gave a command to his servant. He said, “Fill the men’s sacks with as much grain as they can carry. Then put each man’s money into his sack with the grain."},{"num":2,"verse":"Put the youngest brother’s money in his sack too. But also put my special silver cup in his sack.” So the servant obeyed Joseph."},{"num":3,"verse":"Early the next morning the brothers and their donkeys were sent back to their country."},{"num":4,"verse":"After they had left the city, Joseph said to his servant, “Go and follow the men. Stop them and say to them, ‘We were good to you! So why have you been bad to us? Why did you steal my master’s silver cup?"},{"num":5,"verse":"My master drinks from that cup, and he uses it to learn secret things. What you did was wrong!’”"},{"num":6,"verse":"So the servant obeyed. He rode out to the brothers and stopped them. The servant said to them what Joseph had told him to say."},{"num":7,"verse":"But the brothers said to the servant, “Why does the governor say these things? We wouldn’t do anything like that!"},{"num":8,"verse":"We brought back the money that we found in our sacks before. So surely we wouldn’t steal silver or gold from your master’s house."},{"num":9,"verse":"If you find the silver cup in any of our sacks, let that man die. You can kill him, and we will be your slaves.”"},{"num":10,"verse":"The servant said, “I agree, except that only the man who is found to have the cup will be my slave. The others will be free.”"},{"header":"The Trap Is Sprung; Benjamin Is Caught"},{"num":11,"verse":"Then every brother quickly opened his sack on the ground."},{"num":12,"verse":"The servant started looking in the sacks. He started with the oldest brother and ended with the youngest. He found the cup in Benjamin’s sack."},{"num":13,"verse":"The brothers were very sad. They tore their clothes to show their sadness. They put their sacks back on the donkeys and went back to the city."},{"num":14,"verse":"When Judah and his brothers went back to Joseph’s house, Joseph was still there. The brothers fell to the ground and bowed down before him."},{"num":15,"verse":"Joseph said to them, “Why have you done this? Didn’t you know that I have a special way of learning secrets? No one is better at this than I am!”"},{"num":16,"verse":"Judah said, “Sir, there is nothing we can say. There is no way to explain. There is no way to show that we are not guilty. God has judged us guilty for something else we have done. So all of us, even Benjamin, will be your slaves.”"},{"num":17,"verse":"But Joseph said, “I will not make you all slaves! Only the man who stole the cup will be my slave. You others can go in peace to your father.”"},{"header":"Judah Pleads for Benjamin"},{"num":18,"verse":"Then Judah went to Joseph and said, “Sir, please let me speak plainly with you. Please don’t be angry with me. I know that you are like Pharaoh himself."},{"num":19,"verse":"When we were here before, you asked us, ‘Do you have a father or a brother?’"},{"num":20,"verse":"And we answered you, ‘We have a father—he is an old man. And we have a younger brother. Our father loves him because he was born while our father was old. This youngest son’s brother is dead, so he is the only son who is left from that mother. Our father loves him very much.’"},{"num":21,"verse":"Then you said to us, ‘Bring that brother to me. I want to see him.’"},{"num":22,"verse":"And we said to you, ‘That young boy cannot come. He cannot leave his father. If his father loses him, his father will be so sad that he will die.’"},{"num":23,"verse":"But you said to us, ‘You must bring your youngest brother, or I will not sell you grain again.’"},{"num":24,"verse":"So we went back to our father and told him what you said."},{"num":25,"verse":"“Later, our father said, ‘Go back and buy us some more food.’"},{"num":26,"verse":"We said to our father, ‘We cannot go without our youngest brother. The governor said he will not sell us grain again until he sees our youngest brother.’"},{"num":27,"verse":"Then my father said to us, ‘You know that my wife Rachel gave me two sons."},{"num":28,"verse":"I let one son go away, and he was killed by a wild animal. And I haven’t seen him since."},{"num":29,"verse":"If you take my other son away from me, and something happens to him, I will be sad enough to die.’"},{"num":30,"verse":"Now, imagine what will happen when we go home without our youngest brother—he is the most important thing in our father’s life!"},{"num":31,"verse":"Our father will die if he sees that the boy isn’t with us—and it will be our fault. We will send our father to his grave a very sad man."},{"num":32,"verse":"“I took responsibility for the young boy. I told my father, ‘If I don’t bring him back to you, you can blame me for the rest of my life.’"},{"num":33,"verse":"So now I beg you, please let the boy go back with his brothers, and I will stay and be your slave."},{"num":34,"verse":"I cannot go back to my father if the boy is not with me. I am very afraid of what would happen to my father.”"}]