[{"header":"The Lord Judges Israel for Worshiping False Gods"},{"num":6,"verse":"The Word of the Lord came to me, saying, "},{"num":2,"verse":"“Son of man, turn your face toward the mountains of Israel, and tell what is going to happen against them. "},{"num":3,"verse":"Say, ‘Mountains of Israel, listen to the Word of the Lord God! This is what the Lord God says to the mountains, the hills, the deep and wide valleys: “I Myself am going to bring a sword against you. And I will destroy your high places. "},{"num":4,"verse":"So your altars will be laid waste. Your altars for special perfume will be broken. And I will kill your people in front of your false gods. "},{"num":5,"verse":"I will lay the dead bodies of the sons of Israel in front of their false gods, and spread your bones around your altars. "},{"num":6,"verse":"In every place you live, cities will be laid waste and the high places will be destroyed. Your altars will be laid waste and destroyed. Your false gods will be broken and destroyed. Your altars for special perfume will come to an end. "},{"num":7,"verse":"Your people will fall dead among you, and you will know that I am the Lord."},{"num":8,"verse":"“But I will leave some of you alive. For some of you will get away from the sword when you are spread among the lands and nations. "},{"num":9,"verse":"Then those who get away will remember Me in the nations where they have been taken. They will remember how I have been hurt by their sinful hearts which turned away from Me, and by their sinful eyes which followed after their false gods. And they will hate themselves in their own eyes for the sins they have done, for all their sinful ways. "},{"num":10,"verse":"Then they will know that I am the Lord. I have not spoken with empty words that I would bring this trouble upon them.”’"},{"num":11,"verse":"“The Lord God says, ‘Clap your hands, and step hard with your feet, and say, “It is bad because of all the hated sins of the people of Israel! They will fall by the sword, hunger, and disease. "},{"num":12,"verse":"He who is far away will die by disease. And he who is near will be killed by the sword. He who stays and is shut in by armies will die by hunger. This is how I will send My anger upon them. "},{"num":13,"verse":"Then you will know that I am the Lord, when their dead lie among their false gods around their altars. They will lie on every high hill, on all the mountain tops, under every green tree, and under every oak tree with many leaves. Their dead will be in all the places where they burned special perfume to all their false gods. "},{"num":14,"verse":"I will put out My hand against them in every place they live. I will make the land more of a waste than the desert toward Diblah. Then they will know that I am the Lord.”’”"}]