[{"header":"Builders of the Wall"},{"num":3,"verse":"Eliashib the high priest and his ·fellow priests [brothers] went to work and rebuilt the Sheep Gate. They ·gave it to the Lord’s service [dedicated/consecrated it] and set its doors in place. They worked as far as the Tower of the Hundred and ·gave it to the Lord’s service [dedicated/consecrated it]. Then they went on to the Tower of Hananel. "},{"num":2,"verse":"Next to them, the people of Jericho built part of the wall, and Zaccur son of Imri built next to them."},{"num":3,"verse":"The sons of Hassenaah rebuilt the Fish Gate, laying its ·boards [beams] and setting its doors, bolts, and bars in place. "},{"num":4,"verse":"Meremoth son of Uriah, the son of Hakkoz, made repairs next to them. Meshullam son of Berekiah, the son of Meshezabel, made repairs next to Meremoth. And Zadok son of Baana made repairs next to Meshullam. "},{"num":5,"verse":"The people from Tekoa [a town ten miles south of Jerusalem] made repairs next to them, but the ·leading men of Tekoa [nobles] would not work under ·their supervisors [or their lords; or their Lord; or possibly a reference to Nehemiah]."},{"num":6,"verse":"Joiada son of Paseah and Meshullam son of Besodeiah repaired the Old Gate. They laid its ·boards [beams] and set its doors, bolts, and bars in place. "},{"num":7,"verse":"Next to them, Melatiah from Gibeon, other men from Gibeon and Mizpah, and Jadon from Meronoth made repairs. These places were ·ruled by [under the jurisdiction of] the governor of ·Trans-Euphrates [provinces west of the Euphrates River]. "},{"num":8,"verse":"Next to them, Uzziel son of Harhaiah, a goldsmith, made repairs. And next to him, Hananiah, a perfume maker, made repairs. These men rebuilt Jerusalem as far as the Broad Wall. "},{"num":9,"verse":"The next part of the wall was repaired by Rephaiah son of Hur, the ·ruler [official; head] of half of the district of Jerusalem. "},{"num":10,"verse":"Next to him, Jedaiah son of Harumaph made repairs ·opposite [across from] his own house. And next to him, Hattush son of Hashabneiah made repairs. "},{"num":11,"verse":"Malkijah son of Harim and Hasshub son of Pahath-Moab repaired another part of the wall and the Tower of the ·Ovens [Furnaces; Fire Pots; possibly the bakery district]. "},{"num":12,"verse":"Next to them Shallum son of Hallohesh, the ·ruler [official; head] of half of the district of Jerusalem, and his daughters made repairs."},{"num":13,"verse":"Hanun and the people of Zanoah repaired the Valley Gate, rebuilding it and setting its doors, bolts, and bars in place. They also repaired the ·five hundred yards [one thousand cubits] of the wall to the ·Trash [Garbage; Refuse; Dung] Gate."},{"num":14,"verse":"Malkijah son of Recab, the ·ruler [official; head] of the district of Beth Hakkerem, repaired the ·Trash [Garbage; Refuse; Dung] Gate. He rebuilt that gate and set its doors, bolts, and bars in place."},{"num":15,"verse":"Shallun son of Col-Hozeh, the ·ruler [official; head] of the district of Mizpah, repaired the Fountain Gate. He rebuilt it, ·put a roof over [covered] it, and set its doors, bolts, and bars in place. He also repaired the wall of the Pool of ·Siloam [or Shelah] next to the King’s Garden all the way to the steps that went down from the ·older part of the city [City of David]. "},{"num":16,"verse":"Next to Shallun was Nehemiah [not the governor] son of Azbuk, ·the ruler [official; head] of half of the district of Beth Zur. He made repairs ·opposite [across from] the tombs of David and as far as the ·man-made [artificial] pool and the House of the ·Heroes [Champions; Warriors; Mighty Men]."},{"num":17,"verse":"Next to him, the Levites made repairs, working under Rehum son of Bani. Next to him, Hashabiah, the ·ruler [official; head] of half of the district of Keilah, for his district. "},{"num":18,"verse":"Next to him, ·Binnui [or Bavvai] son of Henadad and his ·relatives [kinsmen; brothers] made repairs. ·Binnui [or Bavvai] was the ·ruler [official; head] of the other half of the district of Keilah. "},{"num":19,"verse":"Next to them, Ezer son of Jeshua, the ·ruler [official; head] of Mizpah, repaired another part of the wall. He worked across from the way up to the armory, as far as the ·bend [angle; buttress]. "},{"num":20,"verse":"Next to him, Baruch son of Zabbai worked ·hard [zealously] on the wall that went from the ·bend [angle; buttress] to the ·entrance to [door of] the house of Eliashib, the high priest. "},{"num":21,"verse":"Next to him, Meremoth son of Uriah, the son of Hakkoz, repaired the wall that went from the ·entrance to [door of] Eliashib’s house to the far end of it."},{"num":22,"verse":"Next to him worked the priests from the ·surrounding area [nearby district]. "},{"num":23,"verse":"Next to them, Benjamin and Hasshub made repairs ·in front of [across from] their own house. Next to them, Azariah son of Maaseiah, the son of Ananiah, made repairs ·beside [near] his own house. "},{"num":24,"verse":"Next to him, Binnui son of Henadad repaired ·the wall [another section] that went from Azariah’s house to the ·bend [angle; buttress] and on to the corner. "},{"num":25,"verse":"Palal son of Uzai worked across from the ·bend [angle; buttress] and by the tower on the upper ·palace [house of the king], which is near the courtyard of the guard. Next to Palal, Pedaiah son of Parosh made repairs. "},{"num":26,"verse":"The Temple servants who lived on the hill of Ophel made repairs as far as a point ·opposite [across from] the Water Gate. They worked toward the east and the ·tower that extends from the palace [projecting/protruding tower]. "},{"num":27,"verse":"Next to them, the people of Tekoa [v. 5] repaired ·the wall [another section] from the great ·tower that extends from the palace [projecting/protruding tower] to the wall of Ophel."},{"num":28,"verse":"The priests made repairs above the Horse Gate, each working ·in front of [across from] his own house. "},{"num":29,"verse":"Next to them, Zadok son of Immer made repairs across from his own house. Next to him, Shemaiah son of Shecaniah, the guard of the East Gate, made repairs. "},{"num":30,"verse":"Next to him, Hananiah son of Shelemiah, and Hanun, the sixth son of Zalaph, made repairs on another ·part of the wall [section]. Next to them, Meshullam son of Berekiah made repairs across from ·where he lived [his quarters]. "},{"num":31,"verse":"Next to him, Malkijah, one of the goldsmiths, made repairs. He worked as far as the house of the Temple servants and the ·traders [merchants], which is across from the Inspection Gate, and as far as the ·room above the corner of the wall [upper room at the corner]. "},{"num":32,"verse":"The goldsmiths and the traders made repairs between the ·room above the corner of the wall [upper room at the corner] and the Sheep Gate."}]