[{"header":"A List of the People Rebuilding Jerusalem’s Walls"},{"num":3,"verse":"The chief priest Eliashib and his relatives, the priests, started by rebuilding Sheep Gate. They dedicated it and set its doors in place. They rebuilt as far as the Tower of the Hundred, which they dedicated, and then as far as the Tower of Hananel. "},{"num":2,"verse":"The men from Jericho were rebuilding next to Eliashib. Zaccur, son of Imri, was next to them. "},{"num":3,"verse":"The sons of Hassenaah rebuilt Fish Gate. They laid its beams and set its doors, locks, and bars in place. "},{"num":4,"verse":"Next to them Meremoth, son of Uriah and grandson of Hakkoz, made repairs. Next to them Meshullam, son of Berechiah and grandson of Meshezabel, made repairs. Next to them Zadok, son of Baana, made repairs. "},{"num":5,"verse":"Next to them the men from Tekoa made repairs. However, the nobles wouldn’t lower themselves to work under supervisors."},{"num":6,"verse":"Joiada, Paseah’s son, and Meshullam, Besodeiah’s son, made repairs on Old Gate. They laid its beams and set its doors, locks, and bars in place. "},{"num":7,"verse":"Next to them Melatiah from Gibeon and Jadon from Meronoth, with men from Gibeon and Mizpah, made repairs on the wall. They did this under the authority of the governor ⌞from the province⌟ west of the Euphrates River. "},{"num":8,"verse":"Next to them Uzziel, Harhaiah’s son, a goldsmith, made repairs. Next to him Hananiah, a perfume maker, made repairs. They left out part of Jerusalem as far as Broad Wall. "},{"num":9,"verse":"Next to them Rephaiah, Hur’s son, an official in charge of half a district of Jerusalem, made repairs. "},{"num":10,"verse":"Next to them Jedaiah, Harumaph’s son, made repairs across from his own home. Next to them Hattush, Hashabneiah’s son, made repairs. "},{"num":11,"verse":"Malchiah, Harim’s son, and Hasshub, Pahath Moab’s son, made repairs on a section that included the Tower of the Ovens. "},{"num":12,"verse":"Next to them Shallum, Hallohesh’s son, an official in charge of half a district of Jerusalem, made repairs with the help of his daughters."},{"num":13,"verse":"Hanun and the people of Zanoah repaired Valley Gate. They rebuilt it and set its doors, locks, and bars in place, and they repaired 1,500 feet of the wall, as far as Dung Gate. "},{"num":14,"verse":"Dung Gate itself was repaired by Malchiah, Rechab’s son, the official in charge of the district of Beth Hakkerem. He rebuilt it and set its doors, locks, and bars in place."},{"num":15,"verse":"Shallun, Col Hozeh’s son, the official in charge of the district of Mizpah, repaired Fountain Gate. He rebuilt it, put a roof over it, and set its doors, locks, and bars in place. He also made repairs on the wall of the Pool of Shelah by the King’s Garden as far as the stairs going down from the City of David. "},{"num":16,"verse":"After him Nehemiah, Azbuk’s son, the official in charge of half the district of Beth Zur, made repairs all the way to a point across from the tombs of David as far as the pool and the soldiers’ barracks. "},{"num":17,"verse":"After him the Levites, including Rehum (Bani’s son), made repairs. Next to him Hashabiah, the official in charge of half the district of Keilah, made repairs for his district. "},{"num":18,"verse":"After him their relatives made repairs. This included Binnui, Henadad’s son, the official in charge of half the district of Keilah. "},{"num":19,"verse":"Next to him Ezer, Jeshua’s son, the official in charge of Mizpah, repaired a section across from the ascent to the Armory at the Angle. "},{"num":20,"verse":"After him Baruch, Zabbai’s son, made repairs on a section from the Angle to the door of the house of the chief priest Eliashib. "},{"num":21,"verse":"After him Meremoth, son of Uriah and grandson of Hakkoz, made repairs on a section from the door of Eliashib’s house to the end of Eliashib’s house. "},{"num":22,"verse":"After him the priests who lived in that area made repairs. "},{"num":23,"verse":"After them Benjamin and Hasshub made repairs across from their own homes. After them Azariah, son of Maaseiah and grandson of Ananiah, made repairs next to his home. "},{"num":24,"verse":"After him Binnui, Henadad’s son, made repairs on a section from Azariah’s home to the Angle and to the corner of the wall. "},{"num":25,"verse":"Palal, Uzai’s son, made repairs across from the Angle and the upper tower that projects from the king’s palace to the guards’ courtyard. After him Pedaiah, Parosh’s son, "},{"num":26,"verse":"and the temple servants who were living on the Ophel made repairs on the wall as far as a point across from Water Gate toward the east and the projecting tower. "},{"num":27,"verse":"After him the men from Tekoa repaired a section across from the large projecting tower as far as the Wall of the Ophel."},{"num":28,"verse":"Above Horse Gate the priests made repairs. Each priest made repairs across from his own home. "},{"num":29,"verse":"After them Zadok, Immer’s son, made repairs across from his own home. After him Shemaiah, Shecaniah’s son, the guard at East Gate, made repairs. "},{"num":30,"verse":"After him Hananiah, Shelemiah’s son, and Hanun, Zalaph’s sixth son, repaired another section. After him Meshullam, Berechiah’s son, made repairs across from his living quarters. "},{"num":31,"verse":"After him Malchiah, one of the goldsmiths, made repairs as far as the building that housed the temple servants and merchants across from Inspection Gate and as far as the upper room at the corner. "},{"num":32,"verse":"The goldsmiths and merchants made repairs between the upper room at the corner and Sheep Gate."}]