[{"header":"Work on the Wall"},{"num":3,"verse":"Then Eliashib the head religious leader and his brothers the religious leaders started to work and built the Sheep Gate. They set it apart as holy, and hung its doors. They set apart as holy the wall to the Tower of the Hundred, and to the Tower of Hananel. "},{"num":2,"verse":"The men of Jericho built next to him. And Zaccur the son of Imri built next to them."},{"num":3,"verse":"The sons of Hassenaah built the Fish Gate. They laid the long wood pieces that hold up the gate and hung its doors with its iron pieces. "},{"num":4,"verse":"Next to them Meremoth the son of Uriah, son of Hakkoz, did the needed work. Next to him Meshullam the son of Berechiah, son of Meshezabel, did the needed work. And next to him Zadok the son of Baana did the needed work. "},{"num":5,"verse":"Next to him the Tekoites did the needed work, but their rulers would not do the work they were told to do by their lords."},{"num":6,"verse":"Joiada the son of Paseah and Meshullam the son of Besodeiah did the needed work on the Old Gate. They laid its long wood pieces and hung its doors with its iron pieces. "},{"num":7,"verse":"Next to them Melatiah the Gibeonite and Jadon the Meronothite did the needed work. They were the men of Gibeon and Mizpah, who were under the rule of the leader of the land on the other side of the River. "},{"num":8,"verse":"Next to them Uzziel the son of Harhaiah, who worked with gold, did the needed work. Next to him Hananiah, one of the men who made perfume, did the needed work. They made Jerusalem like new as far as the Wide Wall. "},{"num":9,"verse":"Next to them Rephaiah the son of Hur, the leader of half of Jerusalem, did the needed work. "},{"num":10,"verse":"Next to them Jedaiah the son of Harumaph did the needed work beside his house. And next to him Hattush the son of Hashabneiah did the needed work. "},{"num":11,"verse":"Malchijah the son of Harim and Hasshub the son of Pahath-moab did the needed work on another part and on the Tower of the Stoves. "},{"num":12,"verse":"Next to him Shallum the son of Hallohesh, the leader of half of Jerusalem, did the needed work, he and his daughters. "},{"num":13,"verse":"Hanun and the people of Zanoah did the needed work on the Valley Gate. They built it and hung its doors with its iron pieces. And they built the wall to the Waste Gate, as far as 500 long steps. "},{"num":14,"verse":"Malchijah the son of Rechab, the leader of Beth-haccherem did the needed work on the Waste Gate. He built it and hung its doors with its iron pieces. "},{"num":15,"verse":"Shallum the son of Col-hozeh, the leader of Mizpah, did the needed work on the Well Gate. He built it, covered it, and hung its doors with its iron pieces. And he built the wall of the Pool of Shelah at the King’s Garden as far as the steps that go down from the City of David. "},{"num":16,"verse":"After him Nehemiah the son of Azbuk, leader of half of Beth-zur, did the needed work as far as David’s grave, and as far as the Man-made Pool and the House of the Powerful Men."},{"header":"Levites Who Worked on the Wall"},{"num":17,"verse":"After him the Levites did the needed work, led by Rehum the son of Bani. Next to him Hashabiah, the leader of half of Keilah, did the needed work for his part of the city. "},{"num":18,"verse":"After him their brothers did the needed work, led by Bavvai the son of Henadad, leader of the other half of Keilah. "},{"num":19,"verse":"Next to him Ezer the son of Jeshua, the leader of Mizpah, did the needed work on another part, in front of the hill up to the place where the things for battle were kept at the turn of the wall. "},{"num":20,"verse":"After him Baruch the son of Zabbai did the needed work with much care on another part, from the turn of the wall to the door of the house of Eliashib the head religious leader. "},{"num":21,"verse":"After him Meremoth the son of Uriah, son of Hakkoz did the needed work on another part from the door of Eliashib’s house to the end of the house."},{"header":"Religious Leaders Who Worked on the Wall"},{"num":22,"verse":"After him the religious leaders, the men of the valley, did the needed work. "},{"num":23,"verse":"After them Benjamin and Hasshub did the needed work in front of their house. After them Azariah the son of Maaseiah, son of Ananiah, did the needed work beside his house. "},{"num":24,"verse":"After him Binnui the son of Henadad did the needed work on another part, from the house of Azariah as far as the turn of the wall, and to the corner. "},{"num":25,"verse":"Palal the son of Uzai did the needed work in front of the turn of the wall and the tower which stands out from the upper house of the king, by the open space of the house soldiers. After him Pedaiah the son of Parosh "},{"num":26,"verse":"and the servants of the house of worship living in Ophel did the needed work as far as the front of the Water Gate on the east and the tall tower. "},{"num":27,"verse":"After him the Tekoites did the needed work on another part in front of the tall tower and as far as the wall of Ophel."},{"num":28,"verse":"The religious leaders did the needed work above the Horse Gate. Each one worked in front of his house. "},{"num":29,"verse":"After them Zadok the son of Immer did the needed work in front of his house. And after him Shemaiah the son of Shecaniah, the keeper of the East Gate, did the needed work. "},{"num":30,"verse":"After him Hananiah the son of Shelemiah, and Hanun the sixth son of Zalaph, did the needed work on another part. After him Meshullam the son of Berechiah did the needed work in front of his own room. "},{"num":31,"verse":"After him Malchijah, one of the men who worked with gold, did the needed work as far as the house of the servants of the Lord’s house and of the traders. He worked in front of the Master Gate and as far as the upper room of the corner. "},{"num":32,"verse":"The gold-workers and the traders did the needed work between the upper room of the corner and the Sheep Gate."}]