[{"header":"Visit of the Queen of Sheba"},{"num":9,"verse":"When the queen of Sheba heard of the fame of Solomon, she came to Jerusalem to test Solomon with riddles. She was accompanied by a very large number of attendants, with camels bearing spices (balsam oil) and a large amount of gold and precious stones. And when she came to Solomon, she talked with him about all that was on her mind. "},{"num":2,"verse":"Solomon answered all her questions; nothing was hidden from him which he did not make clear to her. "},{"num":3,"verse":"So when the queen of Sheba saw the [depth of] Solomon’s wisdom, and the house which he had built, "},{"num":4,"verse":"and the food of his table, the [vast] seating order of his officials, the attendance and service of his ministers and their attire, his cupbearers and their attire, and his stairway by which he went up to the house of the Lord, she was breathless. "},{"num":5,"verse":"She said to the king, “The report which I heard in my own land regarding your [accomplishments and your] words and your wisdom was true, "},{"num":6,"verse":"but I did not believe the reports until I came and saw it with my own eyes. Behold, the half of the greatness of your wisdom was not told to me; you have surpassed the report that I heard. "},{"num":7,"verse":"Blessed and fortunate are your people, how blessed and fortunate are these servants of yours who stand before you continually and hear your wisdom! "},{"num":8,"verse":"Blessed be the Lord your God, who delighted in you, setting you on His throne as king for the Lord your God; because your God loved Israel, establishing them forever, therefore He made you king over them, to do justice and righteousness.” "},{"num":9,"verse":"Then she gave the king a hundred and twenty talents of gold, a very large amount of spices (balsam oil) and precious stones; there was no such spice [anywhere] like that which the queen of Sheba gave to King Solomon."},{"num":10,"verse":"The servants of Huram and those of Solomon, who brought gold from Ophir, also brought almug trees and precious stones. "},{"num":11,"verse":"From the almug timber the king made stairways for the house of the Lord and for the king’s palace, and lyres and harps for the singers; none like that was seen before in the land of Judah."},{"num":12,"verse":"King Solomon gave to the queen of Sheba all [the things] she desired, whatever she asked, besides a return for what she had brought to the king. So she returned to her own land with her servants."},{"header":"Solomon’s Wealth and Power"},{"num":13,"verse":"Now the weight of gold which came to Solomon in one year was 666 talents, "},{"num":14,"verse":"besides what the traders and merchants brought; and all the kings of Arabia and the governors of the country brought gold and silver to Solomon. "},{"num":15,"verse":"King Solomon made two hundred large shields of beaten gold, using six hundred shekels of beaten gold on each large shield. "},{"num":16,"verse":"And he made three hundred [smaller] shields of beaten gold, using three hundred shekels of gold on each shield; and the king put them in the house of the Forest of Lebanon."},{"num":17,"verse":"Moreover, the king made a great throne of ivory and overlaid it with pure gold. "},{"num":18,"verse":"There were six steps to the throne and a golden footstool attached to the throne, and arms on each side of the seat, with two lions standing beside the arms. "},{"num":19,"verse":"Also, twelve lions were standing there, one on each side of the six steps. Nothing like it had ever been made for any [other] kingdom. "},{"num":20,"verse":"All King Solomon’s drinking vessels were of gold, and all the vessels of the house of the Forest of Lebanon were of pure gold; silver was not considered valuable in the days of Solomon. "},{"num":21,"verse":"For the king’s ships went to Tarshish with the servants of Huram; once every three years the ships of Tarshish came bringing gold and silver, ivory and apes and peacocks."},{"num":22,"verse":"So King Solomon surpassed all the kings of the earth in wealth and wisdom. "},{"num":23,"verse":"And all the kings of the earth were seeking the presence of Solomon, to hear his wisdom which God had put into his heart. "},{"num":24,"verse":"Each man brought his gift, articles of silver and gold, garments, weapons, spices, horses and mules, so much year by year."},{"num":25,"verse":"Now Solomon had 4,000 stalls for horses and chariots, and 12,000 horsemen, and he stationed them in the chariot cities or with the king at Jerusalem. "},{"num":26,"verse":"He ruled over all the kings from the Euphrates River to the land of the Philistines, and as far as the border of Egypt. "},{"num":27,"verse":"The king made silver in Jerusalem as common as stones, and cedar wood as plentiful as the sycamore-fig trees that are in the lowland. "},{"num":28,"verse":"And they were importing horses for Solomon from Egypt and from all [the other] countries."},{"num":29,"verse":"Now the rest of the acts of Solomon, from the first to the last, are they not written in the records of Nathan the prophet, and in the prophecy of Ahijah the Shilonite, and in the visions of Iddo the seer concerning Jeroboam the son of Nebat? "},{"num":30,"verse":"Solomon reigned forty years in Jerusalem over all Israel."},{"header":"Death of Solomon"},{"num":31,"verse":"And Solomon slept with his fathers [in death]; he was buried in the city of his father David. Rehoboam his son reigned in his place."}]