[{"header":"Salutation"},{"num":1,"verse":"Peter, an apostle of Jesus Christ,"},{"num":2,"verse":"chosen and destined by God the Father and sanctified by the Spirit for obedience to Jesus Christ and for sprinkling with his blood:"},{"header":"A Living Hope"},{"num":3,"verse":"Blessed be the God and Father of our Lord Jesus Christ! By his great mercy we have been born anew to a living hope through the resurrection of Jesus Christ from the dead, "},{"num":4,"verse":"and to an inheritance which is imperishable, undefiled, and unfading, kept in heaven for you, "},{"num":5,"verse":"who by God’s power are guarded through faith for a salvation ready to be revealed in the last time. "},{"num":6,"verse":"In this you rejoice, though now for a little while you may have to suffer various trials, "},{"num":7,"verse":"so that the genuineness of your faith, more precious than gold which though perishable is tested by fire, may redound to praise and glory and honor at the revelation of Jesus Christ. "},{"num":8,"verse":"Without having seen him you love him; though you do not now see him you believe in him and rejoice with unutterable and exalted joy. "},{"num":9,"verse":"As the outcome of your faith you obtain the salvation of your souls."},{"num":10,"verse":"The prophets who prophesied of the grace that was to be yours searched and inquired about this salvation; "},{"num":11,"verse":"they inquired what person or time was indicated by the Spirit of Christ within them when predicting the sufferings of Christ and the subsequent glory. "},{"num":12,"verse":"It was revealed to them that they were serving not themselves but you, in the things which have now been announced to you by those who preached the good news to you through the Holy Spirit sent from heaven, things into which angels long to look."},{"header":"A Call to Holy Living"},{"num":13,"verse":"Therefore gird up your minds, be sober, set your hope fully upon the grace that is coming to you at the revelation of Jesus Christ. "},{"num":14,"verse":"As obedient children, do not be conformed to the passions of your former ignorance, "},{"num":15,"verse":"but as he who called you is holy, be holy yourselves in all your conduct; "},{"num":16,"verse":"since it is written, “You shall be holy, for I am holy.” "},{"num":17,"verse":"And if you invoke as Father him who judges each one impartially according to his deeds, conduct yourselves with fear throughout the time of your exile. "},{"num":18,"verse":"You know that you were ransomed from the futile ways inherited from your fathers, not with perishable things such as silver or gold, "},{"num":19,"verse":"but with the precious blood of Christ, like that of a lamb without blemish or spot. "},{"num":20,"verse":"He was destined before the foundation of the world but was made manifest at the end of the times for your sake. "},{"num":21,"verse":"Through him you have confidence in God, who raised him from the dead and gave him glory, so that your faith and hope are in God."},{"num":22,"verse":"Having purified your souls by your obedience to the truth for a sincere love of the brethren, love one another earnestly from the heart. "},{"num":23,"verse":"You have been born anew, not of perishable seed but of imperishable, through the living and abiding word of God; "},{"num":24,"verse":"for"}]