[{"num":9,"verse":"The burden of the Devar Hashem against Eretz Chadrach, and Damascus its menuchah (resting place); for toward Hashem shall be the eyes of man as of Kol Shivtei Yisroel (all the tribes of Israel)."},{"num":2,"verse":"And Chamat at its border; Tzor and Tzidon, though it be very wise."},{"num":3,"verse":"And Tzor did build herself a matzor (stronghold), and heaped up kesef like the dust, and fine gold like the mire of the streets."},{"num":4,"verse":"Hinei, Adonoi will cause it to be taken, and He will strike her power on the yam; and she shall be devoured with eish."},{"num":5,"verse":"Ashkelon shall see it, and fear; Azah (Gaza) also shall see it, and tremble greatly, and Ekron; for her hope shall be put to shame; and Melech shall perish out of Azah (Gaza), and Ashkelon shall not be inhabited."},{"num":6,"verse":"And mamzer shall dwell in Ashdod, and I will cut off the ga’on (pride) of the Pelishtim (Philistines)."},{"num":7,"verse":"And I will take away his dahm out of his mouth, and his abominations from between his teeth; but he will also remain to Eloheinu, and he shall be as a tribe prince in Yehudah, and Ekron like the Yevusi (Jebusite)."},{"num":8,"verse":"And I will encamp about Mine Bais against military power, because of him that goes maurading to and fro; and no oppressor shall pass through them any more; for now I am keeping watch with Mine eyes."},{"num":9,"verse":"Rejoice greatly, O Bat Tziyon; shout, O Bat Yerushalayim; hinei, thy Melech cometh unto thee, tzaddik, and having Salvation; ani (lowly, meek), and riding upon a chamor, even upon a colt the foal of a donkey. [Mt 21:5; Yn 12:15]"},{"num":10,"verse":"And I will cut off the chariot from Ephrayim, and the war horse from Yerushalayim, and the battle bow shall be cut off. He shall proclaim shalom unto the Goyim; and His [Moshiach’s] dominion shall be from yam even to yam, and from the [Euphrates] river even to the ends of ha’aretz."},{"num":11,"verse":"As for thee also, by the dahm of thy Brit I release thy prisoners out of the pit wherein is no mayim [T.N. Notice the blood of the Covenent is essential to Israel’s Orthodox faith]."},{"num":12,"verse":"Return to the stronghold, ye prisoners of tikvah (hope); even today do I proclaim that I will repay double unto thee;"},{"num":13,"verse":"I will bend Yehudah as I bend My keshet (bow), fill it with Ephrayim, and I will rouse thy banim, O Tziyon, against thy banim, O Yavan (Greece), and make thee like the cherev (sword) of a gibbor (mighty man)."},{"num":14,"verse":"And Hashem shall be seen over them, and his arrow shall go forth as the lightning; and Adonoi Hashem shall sound the shofar, and shall march forth with storms of the south."},{"num":15,"verse":"Hashem Tzva’os shall shield them; and they shall devour, and subdue with sling stones; and they shall drink, and shall roar as through yayin; and they shall be full like a bowl, like the corners of the mizbe’ach."},{"num":16,"verse":"And Hashem Eloheihem shall save them in Yom HaHu as the tzon of His people; for they shall be as the jewels of a crown, sparkling in His land."},{"num":17,"verse":"For how great is its goodness, and how great is its beauty! Grain shall make the bochurim thrive, and tirosh, the betulot."}]