[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Numbers 23:12-13",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 23:12-13",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Must I not — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Ought I not? Is it not my duty? Canst thou blame me for it? ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Thou shalt not see them all — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Perhaps he thought the sight of all of them might discourage him, or, as it did before, raise his fancy to an admiration of the multitude and felicity of the people.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "23:11-30 Balak was angry with Balaam. Thus a confession of God's overruling power is extorted from a wicked prophet, to the confusion of a wicked prince. A second time the curse is turned into a blessing; and this blessing is both larger and stronger than the former. Men change their minds, and break their words; but God never changes his mind, and therefore never recalls his promise. And when in Scripture he is said to repent, it does not mean any change of his mind; but only a change of his way. There was sin in Jacob, and God saw it; but there was not such as might provoke him to give them up to ruin. If the Lord sees that we trust in his mercy, and accept of his salvation; that we indulge no secret lust, and continue not in rebellion, but endeavour to serve and glorify him; we may be sure that he looks upon us as accepted in Christ, that our sins are all pardoned. Oh the wonders of providence and grace, the wonders of redeeming love, of pardoning mercy, of the new-creating Spirit! Balak had no hope of ruining Israel, and Balaam showed that he had more reason to fear being ruined by them. Since Balaam cannot say what he would have him, Balak wished him to say nothing. But though there are many devices in man's heart, God's counsels shall stand. Yet they resolve to make another attempt, though they had no promise on which to build their hopes. Let us, who have a promise that the vision at the end shall speak and not lie, continue earnest in prayer, Lu 18:1.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The fourth part of Israel - i. e., each one of the four camps, into which the host of Israel was divided (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), seemed to swarm with innumerable multitudes. Possibly Balaam could only see one camp. Balaam bears testimony in this verse to the fulfillment of the promises in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 13:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 28:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The righteous - i. e., the ancestors of Israel, who \"died in faith, not having received the promises, but having seen them afar off\" Hebrews 11:13. With their histories Balaam was familiar, particularly with that of Abraham, \"the righteous man\" whom God had \"raised up from the east (and) called to His foot\" Isaiah 41:2.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The righteous - i. e., the ancestors of Israel, who \"died in faith, not having received the promises, but having seen them afar off\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 11:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". With their histories Balaam was familiar, particularly with that of Abraham, \"the righteous man\" whom God had \"raised up from the east (and) called to His foot\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 41:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Let my last end be like his - Render rather, \"last estate,\" for the reference is not so much to the act of death, as to all that followed upon it - to the future, in which the name and influence of the deceased person would be perpetuated. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Let my last end be like his - Render rather, \"last estate,\" for the reference is not so much to the act of death, as to all that followed upon it - to the future, in which the name and influence of the deceased person would be perpetuated. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10. Who can count the dust of Jacob?—an Oriental hyperbole for a very populous nation, as Jacob's posterity was promised to be (Ge 13:16; 28:14).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the number of the fourth part of Israel—that is, the camp consisted of four divisions; every one of these parts was formidable in numbers.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Let me die the death of the righteous—Hebrew, \"of Jeshurun\"; or, the Israelites. The meaning is: they are a people happy, above all others, not only in life, but at death, from their knowledge of the true God, and their hope through His grace. Balaam is a representative of a large class in the world, who express a wish for the blessedness which Christ has promised to His people but are averse to imitate the mind that was in Him.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " I speak not these words by my own choice, but by the constraint of a higher power, which I cannot resist. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And he answered and said,.... By reply to Balak: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "must I not take heed to speak that which the Lord hath put in my mouth? pretending a great regard to the word of God, and to great carefulness to speak it, exactly and punctually as he received it, whereas he was forced to it, and could not do otherwise. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "must I not take heed to speak that which the Lord hath put in my mouth? pretending a great regard to the word of God, and to great carefulness to speak it, exactly and punctually as he received it, whereas he was forced to it, and could not do otherwise. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And he answered and said, Must I not take heed to speak that which the LORD hath put in my mouth?",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Balak reproached Balaam for this utterance, which announced blessings to the Israelites instead of curses. But he met his reproaches with the remark, that he was bound by the command of Jehovah. The infinitive absolute, בּרך, after the finite verb, expresses the fact that Balaam had continued to give utterance to nothing but blessings. לדבּר שׁמר, to observe to speak; שׁמר, to notice carefully, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 5:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 5:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc. But Balak thought that the reason might be found in the unfavourable locality; he therefore led the seer to \"the field of the watchers, upon the top of Pisgah,\" whence he could see the whole of the people of Israel. The words וגו תּראנּוּ אשׁר (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 23:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") are to be rendered, \"whence thou wilt see it (Israel); thou seest only the end of it, but not the whole of it\" (sc., here upon Bamoth-baal). This is required by a comparison of the verse before us with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 22:41",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where it is most unquestionably stated, that upon the top of Bamoth-baal Balaam only saw \"the end of the people.\" For this reason Balak regarded that place as unfavourable, and wished to lead the seer to a place from which he could see the people, without any limitation whatever. Consequently, notwithstanding the omission of כּי (for), the words קצהוּ אפס can only be intended to assign the reason why Balak supposed the first utterances of Balaam to have been unfavourable. קצהוּ  equals  העם קצה, the end of the people (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 22:41",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), cannot possibly signify the whole nation, or, as Marck, de Geer, Gesenius, and Kurtz suppose, \"the people from one end to the other,\" in which case העם קצה (the end of the people) would signify the very opposite of קצהוּ (the end of it); for העם קצה is not interchangeable, or to be identified, with מקּצה כּל־העם (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 19:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), \"the whole people, from the end or extremity of it,\" or from its last man; in other words, \"to the very last man.\" Still less does העם קצה אפס signify \"the uttermost end of the whole people, the end of the entire people,\" notwithstanding the fact that Kurtz regards the expression, \"the end of the end of the people,\" as an intolerable tautology. קבנו, imperative with nun epenth., from קבב. The \"field of the watchers,\" or \"spies (zophim), upon the top of Pisgah,\" corresponds, no doubt, to \"the field of Moab, upon the top of Pisgah,\" on the west of Heshbon (see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 21:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Mount Nebo, from which Moses surveyed the land of Canaan in all its length and breadth, was one summit, and possibly the summit of Pisgah (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 3:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 34:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The field of the spies was very probably a tract of table-land upon Nebo; and so called either because watchers were stationed there in times of disturbance, to keep a look-out all round, or possibly because it was a place where augurs made their observations of the heavens and of birds (Knobel). The locality has not been thoroughly explored by travellers; but from the spot alluded to, it must have been possible to overlook a very large portion of the Arboth Moab. Still farther to the north, and nearer to the camp of the Israelites in these Arboth, was the summit of Peor, to which Balak afterwards conducted Balaam (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 23:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and where he not only saw the whole of the people, but could see distinctly the camps of the different tribes (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 24:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      }
    ]
  }
]