[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(2) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And Balak and Balaam offered.—",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "It is more probable that Balak, as a king, performed priestly functions than that Balaam performed them alone. (See Note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 22:40",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "23:1-10 With the camps of Israel full in view, Balaam ordered seven altars to be built, and a bullock and a ram to be offered on each. Oh the sottishness of superstition, to imagine that God will be at man's beck! The curse is turned into a blessing, by the overruling power of God, in love to Israel. God designed to serve his own glory by Balaam, and therefore met him. If God put a word into the mouth of Balaam, who would have defied God and Israel, surely he will not be wanting to those who desire to glorify God, and to edify his people; it shall be given what they should speak. He who opened the mouth of the ass, caused the mouth of this wicked man to speak words as contrary to the desire of his heart, as those of the ass were to the powers of the brute. The miracle was as great in the one case as in the other. Balaam pronounces Israel safe. He owns he could do no more than God suffered him to do. He pronounces them happy in their distinction from the rest of the nations. Happy in their numbers, which made them both honourable and formidable. Happy in their last end. Death is the end of all men; even the righteous must die, and it is good for us to think of this with regard to ourselves, as Balaam does here, speaking of his own death. He pronounces the righteous truly blessed, not only while they live, but when they die; which makes their death even more desirable than life itself. But there are many who desire to die the death of the righteous, but do not endeavour to live the life of the righteous; gladly would they have an end like theirs, but not a way like theirs. They would be saints in heaven, but not saints on earth. This saying of Balaam's is only a wish, not a prayer; it is a vain wish, being only a wish for the end, without any care for the means. Many seek to quiet their consciences with the promise of future amendment, or take up with some false hope, while they neglect the only way of salvation, by which a sinner can be righteous before God.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Balaam, after the general custom of the pagan, prefaced his divinations by sacrifice. In the number of the altars regard was probably had to the number of the then known planets. Yet Balaam evidently intended his sacrifice as an offering to the true God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "CHAPTER 23",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Nu 23:1-30. Balak's Sacrifices.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. Balaam said unto Balak, Build me here seven altars—Balak, being a heathen, would naturally suppose these altars were erected in honor of Baal, the patron deity of his country. It is evident, from Nu 23:4 that they were prepared for the worship of the true God; although in choosing the high places of Baal as their site and rearing a number of altars (2Ki 18:22; Isa 17:8; Jer 11:13; Ho 8:11; 10:1), instead of one only, as God had appointed, Balaam blended his own superstitions with the divine worship. The heathen, both in ancient and modern times, attached a mysterious virtue to the number seven; and Balaam, in ordering the preparation of so many altars, designed to mystify and delude the king.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Balak by procuring them and Balaam by offering them; through in ancient times kings’ were priests also, and so might perform a priestly work, as this was. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Balak did as Balaam had spoken,.... Ordered seven altars to be built, and prepared seven bullocks and rams for sacrifice: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and Balak and Balsam offered on every altar a bullock and a ram; both seem to be concerned in offering the sacrifices; Balak, though a king, it being usual for kings to be priests also, as Melchizedek was, and Balaam as a prophet; and these sacrifices were offered to the true God, as seems clear from Numbers 23:4 and to which Balak, at the direction of Balaam, agreed, in order to gain the Lord on his side, that he might prevail over the people of Israel. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and Balak and Balsam offered on every altar a bullock and a ram; both seem to be concerned in offering the sacrifices; Balak, though a king, it being usual for kings to be priests also, as Melchizedek was, and Balaam as a prophet; and these sacrifices were offered to the true God, as seems clear from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 23:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and to which Balak, at the direction of Balaam, agreed, in order to gain the Lord on his side, that he might prevail over the people of Israel. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Balak did as Balaam had spoken; and (a) Balak and Balaam offered on every altar a bullock and a ram.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And Balak did as Balaam had spoken; and (a) Balak and Balaam offered on ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "every",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " altar a bullock and a ram.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) For among the Gentiles the kings often used to sacrifice, as did the priests.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Balaam's First Words. - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 23:1-3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Preparations for the first act, which was performed at Bamoth-baal. At Balaam's command Balak built seven altars, and then selected seven bullocks and seven rams, which they immediately sacrificed, namely, one bullock and one ram upon each altar. The nations of antiquity generally accompanied all their more important undertakings with sacrifices, to make sure of the protection and help of the gods; but this was especially the case with their ceremonies of adjuration. According to Diod. Sic. ii. 29, the Chaldeans sought to avert calamity and secure prosperity by sacrifices and adjurations. The same thing is also related of other nations (see Hengstenberg, Balaam, p. 392). Accordingly, Balaam also did everything that appeared necessary, according to his own religious notions, to ensure the success of Balak's undertaking, and bring about the desired result. The erection of seven altars, and the sacrifice of seven animals of each kind, are to be explained from the sacredness acquired by this number, through the creation of the world in seven days, as being the stamp of work that was well-pleasing to God. The sacrifices were burnt-offerings, and were offered by themselves to Jehovah, whom Balaam acknowledged as his God. ",
        "children": []
      }
    ]
  }
]