[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(9) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "For from the top of",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "the rocks I see him . . . —",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "From the summit of the rocky mountain on which Balak had erected his seven altars, Balaam, according to one interpretation (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 22:41",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and Note), had a full view of the outstretched camps of Israel.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Lo, the people shall dwell alone . . . —Better, Lo, it is a people that dwelleth alone, and that is not numbered, &c. In the fact that the host of Israel dwelt by itself in a separate encampment, Balaam discerned a type of the essential separation of Israel from the surrounding nations. When Israel adopted the ways of the heathen nations it speedily lost its external independence. Hengstenberg observes upon the last clause of this verse as follows:—“How truly Balaam said that Israel ‘did not reckon itself with the heathen’ appears from the fact that while all the powerful empires of the ancient world—the Egyptian, Assyrian, Babylonian, and others—have utterly perished, Israel (which even under the Old Covenant was rescued from so many dangers that threatened its entire destruction, particularly in being brought back from exile) flourishes anew in the Church of the New Covenant, and continues also to exist in that part of it which, though at present rejected, is destined to restoration at a future period.” (History of Balaam, &c., p. 409.)",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Lo, the people shall dwell alone . . . —",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Better, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Lo, it is a people that dwelleth alone, and that is not numbered, &c. ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "In the fact that the host of Israel dwelt by itself in a separate encampment, Balaam discerned a type of the essential separation of Israel from the surrounding nations. When Israel adopted the ways of the heathen nations it speedily lost its external independence. Hengstenberg observes upon the last clause of this verse as follows:—“How truly Balaam said that Israel ‘did not reckon itself with the heathen’ appears from the fact that while all the powerful empires of the ancient world—the Egyptian, Assyrian, Babylonian, and others—have utterly perished, Israel (which even under the Old Covenant was rescued from so many dangers that threatened its entire destruction, particularly in being brought back from exile) flourishes anew in the Church of the New Covenant, and continues also to exist in that part of it which, though at present rejected, is destined to restoration at a future period.” (",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "History of Balaam, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "&c., p. 409.)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Numbers 23:9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 23:9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "From the hills I behold him ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— The hills on which he then stood. This and the former expression may relate not only to the present view he had of the camp of Israel, but to their future settlement in Canaan; wherein they were represented to the eye of his mind, as dwelling securely under the protection of the Almighty.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The people shall dwell alone — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Separated from other nations by peculiar laws, religion, and manners. See on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 19:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 20:24-26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 3:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". By which means they had so little communication with the Gentiles, that they were called an unsociable people, and thought to have an enmity to the rest of the world, as we may read in Diodorus Siculus, Tacitus, and others.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "And here we may reflect with the greatest admiration upon what Balaam said on this occasion; and be convinced that he was indeed under the influence of that Spirit to whom all things are known, at all times, from the beginning to the end. For how could he otherwise, as Bishop Newton properly argues, “upon a distant view only of a people whom he had never seen or known before, have discovered the genius and manners, not only of the people then living, but of their posterity to the latest generations? What renders it more extraordinary is, the singularity of the character, that they should differ from all the people in the world, and should dwell by themselves among the nations, without mixing and incorporating with any. The time too when this was affirmed increases the wonder, it being before the people were well known in the world, before their religion and government were established, and even before they had obtained a settlement anywhere; but yet that the character was fully verified in the event, not only all history testifies, but we have even ocular demonstration at this day. The Jews, in their religion and laws, their rites and ceremonies, their manners and customs, were so totally different from all other nations, that they had little intercourse or communication with them. An eminent author hath shown that there was a general intercommunity among the gods of paganism; but no such thing was allowed between the God of Israel and the gods of the nations. There was to be no fellowship between God and Belial, though there might be between Belial and Dagon. And hence the Jews were branded for their inhumanity and unsociableness; and they as generally hated, as they were hated by, the rest of mankind. Other nations, the conquerors and the conquered, have often associated and united, as one body, under the same laws; but the Jews, in their captivities, have commonly been more bigoted to their own religion, and more tenacious of their own rites and ceremonies, than at other times. And even now, while they are dispersed among all nations, they yet live distinct and separate from all, trading only with others, but eating, marrying, and conversing chiefly among themselves. We see, therefore, how exactly and wonderfully Balaam characterized the whole race, from the first to the last, when he said, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Lo, the people shall dwell alone, and shall not be reckoned among the nations.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "23:1-10 With the camps of Israel full in view, Balaam ordered seven altars to be built, and a bullock and a ram to be offered on each. Oh the sottishness of superstition, to imagine that God will be at man's beck! The curse is turned into a blessing, by the overruling power of God, in love to Israel. God designed to serve his own glory by Balaam, and therefore met him. If God put a word into the mouth of Balaam, who would have defied God and Israel, surely he will not be wanting to those who desire to glorify God, and to edify his people; it shall be given what they should speak. He who opened the mouth of the ass, caused the mouth of this wicked man to speak words as contrary to the desire of his heart, as those of the ass were to the powers of the brute. The miracle was as great in the one case as in the other. Balaam pronounces Israel safe. He owns he could do no more than God suffered him to do. He pronounces them happy in their distinction from the rest of the nations. Happy in their numbers, which made them both honourable and formidable. Happy in their last end. Death is the end of all men; even the righteous must die, and it is good for us to think of this with regard to ourselves, as Balaam does here, speaking of his own death. He pronounces the righteous truly blessed, not only while they live, but when they die; which makes their death even more desirable than life itself. But there are many who desire to die the death of the righteous, but do not endeavour to live the life of the righteous; gladly would they have an end like theirs, but not a way like theirs. They would be saints in heaven, but not saints on earth. This saying of Balaam's is only a wish, not a prayer; it is a vain wish, being only a wish for the end, without any care for the means. Many seek to quiet their consciences with the promise of future amendment, or take up with some false hope, while they neglect the only way of salvation, by which a sinner can be righteous before God.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "For from the top of the rocks ... - The \"for\" indicates the constraint under which Balaam felt himself. He had been met by God in his own way; from the cliff he had watched for the expected augury; and by the light of this he here interprets, according to the rules of his art, the destiny of Israel.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Dwell alone - i. e., apart from others, undisturbed by their tumults, and therefore in safety and just security. Compare the same idea in marginal reference; Jeremiah 49:31; and Micah 7:14. This tranquility was realized by the Israelites so long as they clave to God as their shelter and protection. But the inward \"dwelling alone\" was the indispensable condition of the outward \"dwelling alone,\" and so soon as the influence of the pagan world affected Israel internally, the external power of paganism prevailed also. Balaam himself, when he eventually counseled tempting the people into sin, acted upon the knowledge that God's blessing and Israel's prosperity depended essentially on faithfulness to God. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Dwell alone - i. e., apart from others, undisturbed by their tumults, and therefore in safety and just security. Compare the same idea in marginal reference; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 49:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 7:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". This tranquility was realized by the Israelites so long as they clave to God as their shelter and protection. But the inward \"dwelling alone\" was the indispensable condition of the outward \"dwelling alone,\" and so soon as the influence of the pagan world affected Israel internally, the external power of paganism prevailed also. Balaam himself, when he eventually counseled tempting the people into sin, acted upon the knowledge that God's blessing and Israel's prosperity depended essentially on faithfulness to God. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9. from the top—literally, \"a bare place\" on the rocks, to which Balak had taken him, for it was deemed necessary to see the people who were to be devoted to destruction. But that commanding prospect could contribute nothing to the accomplishment of the king's object, for the destiny of Israel was to be a distinct, peculiar people, separated from the rest of the nations in government, religion, customs, and divine protection (De 33:28). So that although I might be able to gratify your wishes against other people, I can do nothing against them (Ex 19:5; Le 20:24).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "From the top of the rocks, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " upon which I now stand, I see the people, according to thy desire, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Numbers 22:41",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 22:41",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", but cannot improve that sight to the end for which thou didst design it, to wit, to curse them. This people are of a distinct kind from others, God’s peculiar people, separated from all other nations, as in religion and laws, also in Divine protection; and therefore my enchantments cannot have that power against them which they have against other persons and people. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Exodus 19:5 Leviticus 20:21,26",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 19:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 20:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",26",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "For from the top of the rocks I see him, and from the hills I behold him,.... That is, Israel in their camps; Balaam being at this time on the top of a rock, or on an high hill, from whence he had a view of Israel, encamped in the plains of Moab below him: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "lo, the people shall dwell alone; this certainly respects their dwelling in the land of Canaan, where they dwelt a separate people from all others, distinguished by their language, religion, laws, customs, and manner of living, being different both in their clothing, and in their food, from other people; nor had they dealings, nor did they company with those of other nations; see Esther 3:8 \"or shall dwell safely\" (z), or securely, not so much because of the situation of their country, but because of the protection of the Almighty; see Deuteronomy 33:28. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "lo, the people shall dwell alone; this certainly respects their dwelling in the land of Canaan, where they dwelt a separate people from all others, distinguished by their language, religion, laws, customs, and manner of living, being different both in their clothing, and in their food, from other people; nor had they dealings, nor did they company with those of other nations; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Esther 3:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " \"or shall dwell safely\" (z), or securely, not so much because of the situation of their country, but because of the protection of the Almighty; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 33:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and shall not be reckoned among the nations; as belonging to them, shall not be made of any account by them, but be despised and reproached for their religion chiefly; nor reckon themselves of them, nor mix with them; so the Targum of Jerusalem,\"they shall not be mixed;''or, as Jonathan,\"they shall not be led in the laws of the people;''and though they are now scattered among the people and nations of the world, yet they are not mixed with them, nor reckoned to be a part of them; nor do they reckon themselves to be of them, but are a separate distinct people from them. Thus Israel, or the people of God in a spiritual sense, dwell alone; not solitarily, or without company, in every sense, for they have the company of Father, Son, and Spirit, of angels and saints; but they dwell in God, in Christ, in the house of God, and with one another, separately and distinctly from the world: they are a separate people in the love of God; in the choice of them in Christ; in the covenant of grace made with them in him; in redemption by him; in his intercession for them; in effectual calling; as they will be in the resurrection morn, and in heaven to all eternity: and they shall dwell safely, God being around them; Christ the rock and fortress of them; the Spirit in them being greater than he that is in the world; angels their guardians, and they in a strong city, whose walls and bulwarks are salvation: nor are they reckoned among the nations; they are chosen, redeemed, and called out of them, and are not accounted of by them any other than the refuse and offscouring of all things; nor do they reckon themselves to be of the world, but as pilgrims and strangers in it. Baal Hatturim refers this prophecy to the days of the Messiah; see Jeremiah 23:5. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and shall not be reckoned among the nations; as belonging to them, shall not be made of any account by them, but be despised and reproached for their religion chiefly; nor reckon themselves of them, nor mix with them; so the Targum of Jerusalem,\"they shall not be mixed;''or, as Jonathan,\"they shall not be led in the laws of the people;''and though they are now scattered among the people and nations of the world, yet they are not mixed with them, nor reckoned to be a part of them; nor do they reckon themselves to be of them, but are a separate distinct people from them. Thus Israel, or the people of God in a spiritual sense, dwell alone; not solitarily, or without company, in every sense, for they have the company of Father, Son, and Spirit, of angels and saints; but they dwell in God, in Christ, in the house of God, and with one another, separately and distinctly from the world: they are a separate people in the love of God; in the choice of them in Christ; in the covenant of grace made with them in him; in redemption by him; in his intercession for them; in effectual calling; as they will be in the resurrection morn, and in heaven to all eternity: and they shall dwell safely, God being around them; Christ the rock and fortress of them; the Spirit in them being greater than he that is in the world; angels their guardians, and they in a strong city, whose walls and bulwarks are salvation: nor are they reckoned among the nations; they are chosen, redeemed, and called out of them, and are not accounted of by them any other than the refuse and offscouring of all things; nor do they reckon themselves to be of the world, but as pilgrims and strangers in it. Baal Hatturim refers this prophecy to the days of the Messiah; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 23:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(z) \"confidenter\", Pagninus; \"securus\", Vatablus. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(z) \"confidenter\", Pagninus; \"securus\", Vatablus. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "For from the top of the rocks I see him, and from the hills I behold him: lo, the people shall dwell alone, and shall not be reckoned among the {e} nations.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "For from the top of the rocks I see him, and from the hills I behold him: lo, the people shall dwell alone, and shall not be reckoned among the ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{e}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " nations.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) But shall have religion and laws apart.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "reckoneth not itself",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "among the nations",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Israel felt themselves to be completely separate from, and superior to, other nations because they possessed Jehovah’s love and protection.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 9.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "people shall dwell alone, and shall not be reckoned.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Rather, \"It is a people that dwelleth apart, and is ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "not",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " numbered.\" It was not the outward isolation on which his eye was fixed, for that indeed was only temporary and accidental, but the religious and moral separateness of Israel as the chosen people of God, which was the very secret of their national greatness. Numbers 23:9",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "\"How shall I curse whom God does not curse, and how threaten whom Jehovah does not threaten?\" Balak imagined, like all the heathen, that Balaam, as a goetes and magician, could distribute blessings and curses according to his own will, and put such constraint upon his God as to make Him subservient to his own will (see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 22:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The seer opposes this delusion: The God of Israel does not curse His people, and therefore His servant cannot curse them. The following verses (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 23:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 23:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") give the reason why: \"For from the top of the rocks I see him, and from the hills I behold him. Lo, it is a people that dwelleth apart, and is not numbered among the heathen. Who determines the dust of Jacob, and in number the fourth part of Israel? Let my soul die the death of the righteous, and my end be like his?\" There were two reasons which rendered it impossible for Balaam to curse Israel: (1) Because they were a people both outwardly and inwardly different from other nations, and (2) because they were a people richly blessed and highly favoured by God. From the top of the mountains Balaam looked down upon the people of Israel. The outward and earthly height upon which he stood was the substratum of the spiritual height upon which the Spirit of God had placed him, and had so enlightened his mental sight, that he was able to discern all the peculiarities and the true nature of Israel. In this respect the first thing that met his view was the fact that this people dwelt alone. Dwelling alone does not denote a quiet and safe retirement, as many commentators have inferred from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 33:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 49:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 7:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but, according to the parallel clause, \"it is not reckoned among the nations,\" it expresses the separation of Israel from the rest of the nations. This separation was manifested outwardly to the seer's eye in the fact that \"the host of Israel dwelt by itself in a separate encampment upon the plain. In this his spirit discerned the inward and essential separation of Israel from all the heathen\" (Baumgarten). This outward \"dwelling alone\" was a symbol of their inward separation from the heathen world, by virtue of which Israel was not only saved from the fate of the heathen world, but could not be overcome by the heathen; of course only so long as they themselves should inwardly maintain this separation from the heathen, and faithfully continue in covenant with the Lord their God, who had separated them from among the nations to be His own possession. As soon as Israel lost itself in heathen ways, it also lost its own external independence. This rule applies to the Israel of the New Testament as well as the Israel of the Old, to the congregation or Church of God of all ages. יתחשּׁב לע, \"it does not reckon itself among the heathen nations,\" i.e., it does not share the lot of the other nations, because it has a different God and protector from the heathen (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 4:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 33:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The truth of this has been so marvellously realized in the history of the Israelites, notwithstanding their falling short of the idea of their divine calling, \"that whereas all the mightier kingdoms of the ancient world, Egypt, Assyria, Babel, etc., have perished without a trace, Israel, after being rescued from so many dangers which threatened utter destruction under the Old Testament, still flourishes in the Church of the New Testament, and continues also to exist in that part which, though rejected now, is destined one day to be restored\" (Hengstenberg).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In this state of separation from the other nations, Israel rejoiced in the blessing of its God, which was already visible in the innumerable multitude into which it had grown. \"Who has ever determined the dust of Jacob?\" As the dust cannot be numbered, so is the multitude of Israel innumerable. These words point back to the promise in Genesis 13:16, and applied quite as much to the existing state as to the future of Israel. The beginning of the miraculous fulfilment of the promise given to the patriarchs of an innumerable posterity, was already before their eyes (cf. Deuteronomy 10:22). Even now the fourth part of Israel is not to be reckoned. Balaam speaks of the fourth part with reference to the division of the nation into four camps (ch. 2), of which he could see only one from his point of view (Numbers 22:41), and therefore only the fourth part of the nation. מספּר is an accusative of definition, and the subject and verb are to be repeated from the first clause; so that there is no necessity to alter מספּר into ספר מי. - But Israel was not only visibly blessed by God with an innumerable increase; it was also inwardly exalted into a people of ישׁרים, righteous or honourable men. The predicate ישׁרים is applied to Israel on account of its divine calling, because it had a God who was just and right, a God of truth and without iniquity (Deuteronomy 32:4), or because the God of Israel was holy, and sanctified His people (Leviticus 20:7-8; Exodus 31:13) and made them into a Jeshurun (Deuteronomy 32:15; Deuteronomy 33:5, Deuteronomy 33:26). Righteousness, probity, is the idea and destination of this people, which has never entirely lost it, though it has never fully realized it. Even in times of general apostasy from the Lord, there was always an ἐκλογή in the nation, of which probity and righteousness could truly be predicated (cf. 1 Kings 19:18). The righteousness of the Israelites was \"a product of the institutions which God had established among them, of the revelation of His holy will which He had given them in His law, of the forgiveness of sins which He had linked on to the offering of sacrifices, and of the communication of His Spirit, which was ever living and at work in His Church, and in it alone\" (Hengstenberg). Such a people Balaam could not curse; he could only wish that the end of his own life might resemble the end of these righteous men. Death is introduced here as the end and completion of life. \"Balaam desires for himself the entire, full, indestructible, and inalienable blessedness of the Israelite, of which death is both the close and completion, and also the seal and attestation\" (Kurtz). This desire did not involve the certain hope of a blessed life beyond the grave, which the Israelites themselves did not then possess; it simply expressed the thought that the death of a pious Israelite was a desirable good. And this it was, whether viewed in the light of the past, the present, or the future. In the hour of death the pious Israelite could look back with blessed satisfaction to a long life, rich \"in traces of the beneficent, forgiving, delivering, and saving grace of God;\" he could comfort himself with the delightful hope of living on in his children and his children's children, and in them of participating in the future fulfilment of the divine promises of grace; and lastly, when dying in possession of the love and grace of God, he could depart hence with the joyful confidence of being gathered to his fathers in Sheol (Genesis 25:8). ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In this state of separation from the other nations, Israel rejoiced in the blessing of its God, which was already visible in the innumerable multitude into which it had grown. \"Who has ever determined the dust of Jacob?\" As the dust cannot be numbered, so is the multitude of Israel innumerable. These words point back to the promise in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 13:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and applied quite as much to the existing state as to the future of Israel. The beginning of the miraculous fulfilment of the promise given to the patriarchs of an innumerable posterity, was already before their eyes (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 10:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Even now the fourth part of Israel is not to be reckoned. Balaam speaks of the fourth part with reference to the division of the nation into four camps (ch. 2), of which he could see only one from his point of view (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 22:41",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and therefore only the fourth part of the nation. מספּר is an accusative of definition, and the subject and verb are to be repeated from the first clause; so that there is no necessity to alter מספּר into ספר מי. - But Israel was not only visibly blessed by God with an innumerable increase; it was also inwardly exalted into a people of ישׁרים, righteous or honourable men. The predicate ישׁרים is applied to Israel on account of its divine calling, because it had a God who was just and right, a God of truth and without iniquity (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 32:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), or because the God of Israel was holy, and sanctified His people (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 20:7-8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 31:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") and made them into a Jeshurun (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 32:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 33:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 33:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Righteousness, probity, is the idea and destination of this people, which has never entirely lost it, though it has never fully realized it. Even in times of general apostasy from the Lord, there was always an ἐκλογή in the nation, of which probity and righteousness could truly be predicated (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 19:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The righteousness of the Israelites was \"a product of the institutions which God had established among them, of the revelation of His holy will which He had given them in His law, of the forgiveness of sins which He had linked on to the offering of sacrifices, and of the communication of His Spirit, which was ever living and at work in His Church, and in it alone\" (Hengstenberg). Such a people Balaam could not curse; he could only wish that the end of his own life might resemble the end of these righteous men. Death is introduced here as the end and completion of life. \"Balaam desires for himself the entire, full, indestructible, and inalienable blessedness of the Israelite, of which death is both the close and completion, and also the seal and attestation\" (Kurtz). This desire did not involve the certain hope of a blessed life beyond the grave, which the Israelites themselves did not then possess; it simply expressed the thought that the death of a pious Israelite was a desirable good. And this it was, whether viewed in the light of the past, the present, or the future. In the hour of death the pious Israelite could look back with blessed satisfaction to a long life, rich \"in traces of the beneficent, forgiving, delivering, and saving grace of God;\" he could comfort himself with the delightful hope of living on in his children and his children's children, and in them of participating in the future fulfilment of the divine promises of grace; and lastly, when dying in possession of the love and grace of God, he could depart hence with the joyful confidence of being gathered to his fathers in Sheol (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 25:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). ",
            "children": []
          }
        ]
      }
    ]
  }
]