[{"num":9,"verse":"And Rebbe, Melech HaMoshiach was saying to them, Omein, I say to you, there are some of those standing here who shall not taste mavet (death) until they see that the Malchut Hashem has come in gevurah."},{"num":2,"verse":"And after shishah yamim Rebbe, Melech HaMoshiach takes Kefa and Yaakov and Yochanan, and brought them up a high mountain by themselves. And Rebbe, Melech HaMoshiach was transfigured before them;"},{"num":3,"verse":"And his garments became like a dazzlingly brilliant kittel, gantz (exceedingly) white, more white than anyone on earth could bleach them."},{"num":4,"verse":"And Eliyahu Hanavi appeared to them along with Moshe (Rabbeinu), and they were talking with Rebbe, Melech HaMoshiach."},{"num":5,"verse":"And in reply, to Rebbe, Melech HaMoshiach, Kefa says: Rebbe, it is tov [for] us to be here, and let us make shalosh sukkot, one for you and one for Moshe (Rabbeinu) and one for Eliyahu Hanavi."},{"num":6,"verse":"Kefa did not know what he was answering, for they were tzufloigen (dazed) with pachad (terror)."},{"num":7,"verse":"And there came an anan (cloud) that was overshadowing them, and there came a bat kol out of the anan, ZEH BENI AHUVI, ELAV TISHMAUN (Listen to him!) (TEHILLIM 2:7) [SHEMOT 24:16]"},{"num":8,"verse":"And suddenly, when they looked around, they saw no one in their company any more, except only Rebbe, Melech HaMoshiach."},{"num":9,"verse":"And [as] they were coming down from the mountain, he gave instructions to them that they should tell no one what they saw, except when the Ben HaAdam [Moshiach, DANIEL 7:13-14] should stand up in his Techiyas HaMoshiach."},{"num":10,"verse":"And they retained Rebbe, Melech HaMoshiach’s dvar, discussing among themselves what he might mean by the Techiyas HaMoshiach from HaMesim."},{"num":11,"verse":"And they were questioning him, saying, Why is it that the Sofrim (Scribes) say it is necessary for Eliyahu Hanavi to come rishonah (first)?"},{"num":12,"verse":"And Rebbe, Melech HaMoshiach said to them, Eliyahu Hanavi indeed does come rishonah and brings tikkun (restoration) to all things. And yet how is it written of the Ben HaAdam [Moshiach] that he must suffer many things and be NIVZEH VACHADAL (despised and rejected YESHAYAH 53:3)?"},{"num":13,"verse":"But I say to you, that Eliyahu Hanavi has indeed come, and they did to him whatever they pleased, just as it has been written concerning him. [MELACHIM ALEF 19:2, 10; MALACHI 3:23f (4:5f)]"},{"num":14,"verse":"And when they returned to the talmidim, they saw a great multitude around them and [the] Sofrim (Scribes) arguing with Rebbe, Melech HaMoshiach’s talmidim."},{"num":15,"verse":"And ofen ort, as soon as the multitude saw Rebbe, Melech HaMoshiach, they were surprised and began running up to [him] with Birkat Shalom greetings."},{"num":16,"verse":"And Rebbe, Melech HaMoshiach questioned them, About what are you arguing with them?"},{"num":17,"verse":"And one of the multitude answered Rebbe, Melech HaMoshiach: Rabbi, I brought beni (my son) to you, because he has a shed that makes him illem (mute)."},{"num":18,"verse":"And whenever it seizes him, it throws him into convulsions and he foams at the mouth, and grinds his teeth, and becomes rigid. And I told your talmidim in order that they might cast it out, and they did not have the koach."},{"num":19,"verse":"In reply to them, Rebbe, Melech HaMoshiach says, O dor without emunah, how long will I be with you? How long will I put up with you? Bring the bocher to me!"},{"num":20,"verse":"They brought the bocher to him. And when the shed saw Rebbe, Melech HaMoshiach, it threw the bocher into convulsions, and, falling to the ground, the bocher began rolling around foaming at the mouth."},{"num":21,"verse":"And Rebbe, Melech HaMoshiach questioned the bocher’s abba, How long has this been happening to him? And he said, From kinderyoren."},{"num":22,"verse":"And also it has often thrown him into the eish and into the mayim that it might destroy him. But if you can do anything, grant rachmei shomayim upon us and help us!"},{"num":23,"verse":"Rebbe, Melech HaMoshiach said to him, If you can?!! All things are possible to him who has emunah!"},{"num":24,"verse":"Ofen ort (immediately) the abba of the bocher cried out and began saying, Ani maamin (I believe)! Help my lack of emunah!"},{"num":25,"verse":"And Rebbe, Melech HaMoshiach, having seen that a multitude was gathering, rebuked the ruach hatumah (unclean spirit), saying to it, You cheresh-illem (deaf and mute) ruach hatemeiah, I command you, come out from him and do not ever enter into him again!"},{"num":26,"verse":"And after shrieking a shrai (scream) and throwing the bocher into violent seizures, the ruach hatemeiah came out. And the bocher was so like a geviyah (corpse) that many exclaimed he was niftar."},{"num":27,"verse":"But Rebbe, Melech HaMoshiach, having grasped the hand of the bocher, lifted him up; and the bocher stood up."},{"num":28,"verse":"And, having entered into a bais, his talmidim began questioning Rebbe, Melech HaMoshiach in a yechidus: Why were we not able to perform the gerush shedim (exorcism)?"},{"num":29,"verse":"And Rebbe, Melech HaMoshiach said to them, This kind of gerush shedim is accomplished only by davening with tzomot."},{"num":30,"verse":"And from there they went forth and were passing through the Galil, and Rebbe, Melech HaMoshiach did not want anyone to have daas."},{"num":31,"verse":"For Rebbe, Melech HaMoshiach was teaching his talmidim and was saying to them, The Ben HaAdam [Moshiach, DANIEL 7:13-14] is to be betrayed into the hands of Bnei Adam, and MOSHIACH YIKARET (Moshiach will be violently killed, DANIEL 9:26), and when he has been killed and has his histalkus (passing), he will rise in his Techiyas HaMoshiach from HaMesim on Yom HaShelishi (the Third Day)."},{"num":32,"verse":"But they did not have binah concerning this dvar, and they were afraid to inquire further."},{"num":33,"verse":"And they came to Kfar-Nachum. And when Rebbe, Melech HaMoshiach was in the bais, he began questioning them, What were you arguing about baderech (on the road)?"},{"num":34,"verse":"But they were keeping silent, for baderech they were discussing with one another which of the talmidim was hagadol."},{"num":35,"verse":"And sitting down, Rebbe, Melech HaMoshiach called the Shneym Asar and says to them, If anyone wishes to be Rishon (First), he shall be Acharon (Last), and mesharet (minister, servant) of all."},{"num":36,"verse":"And having taken a yeled, Rebbe, Melech HaMoshiach set him in [the] center of them, and, having taken the yeled into his arms, he said to them,"},{"num":37,"verse":"Whoever receives one yeled such as this biShmi (in my Name) receives me, and whoever receives me, receives not only me but the One who sent me."},{"num":38,"verse":"Yochanan said to him, Rebbe, we saw someone performing a gerush shedim in your Name, and we were trying to stop him, because he was not one of your chasidim. [BAMIDBAR 11:27-29]"},{"num":39,"verse":"But Rebbe, Melech HaMoshiach said, Do not stop him, for no one who will accomplish niflaot (wonders) biShmi (in my Name) will be able soon afterward to speak lashon hora about me."},{"num":40,"verse":"For the one who is not our mitnagged is for us."},{"num":41,"verse":"For whoever gives you to drink a kos of mayim (cup of water) biShmi (in my Name) because you are talmidim of Rebbe, Melech HaMoshiach, omein, I say to you, he shall not lose his sachar (reward)."},{"num":42,"verse":"And whoever causes a michshol (stumbling block) for one of these little ones, the maaminim b’Moshiach who have emunah in me, it would be better for him if a heavy millstone, one turned by a donkey, were hung around his neck and he were cast into the sea."},{"num":43,"verse":"And if your yad causes you a michshol, cut off your yad; for it is better for you if you enter Chayyei Olam as an amputee, than, having both yadayim, you go away into Gehinnom, into the EISH LO TIKHBEH (fire not [ever] extinguished, YESHAYAH 66:24),"},{"num":44,"verse":"Where their TOLAAT LO TAMUT (worm does not die YESHAYAH 66:24) and EISH LO TIKHBEH (the fire not [ever] extinguished YESHAYAH 66:24).]"},{"num":45,"verse":"And if your regel (foot) causes you a michshol, cut off your regel; it is better for you to enter Chayyei Olam lame, than, having both raglayim, to be cast into Gehinnom,"},{"num":46,"verse":"Where their TOLAAT LO TAMUT (worm does not die YESHAYAH 66:24) and EISH LO TIKHBEH (the fire not [ever] extinguished YESHAYAH 66:24).]"},{"num":47,"verse":"And if your ayin (eye) causes you a michshol, take it out; for it is better for you to enter the Malchut Hashem one-eyed, than, having both eynayim, to be cast into Gehinnom,"},{"num":48,"verse":"Where their TOLAAT LO TAMUT (worm does not die YESHAYAH 66:24) and EISH LO TIKHBEH (the fire not [ever] extinguished YESHAYAH 66:24)."},{"num":49,"verse":"For everyone will have eish as his melach (salt). [VAYIKRA 2:13]"},{"num":50,"verse":"Melach is tov, but if the melach becomes unsalty, by what [means] will you make it salty again? Have melach in yourselves. And among yourselves let there be shalom."}]