[{"num":2,"verse":"Six days after saying this, Jesus took Peter, James, and John and led them up onto a high mountaintop by themselves. There He was transformed "},{"num":3,"verse":"so that His clothing became intensely white, brighter than any earthly cleaner could bleach them. "},{"num":4,"verse":"Elijah and Moses appeared to them and talked with Jesus."},{"num":6,"verse":"He was babbling and did not know what he was saying because they were terrified by what they were witnessing."},{"num":7,"verse":"Then a cloud surrounded them, and they heard a voice within that cloud."},{"num":8,"verse":"All of a sudden, they looked about and all they had seen was gone. They stood alone on the mountain with Jesus."},{"num":9,"verse":"On their way back down, He urged them not to tell anyone what they had witnessed until the Son of Man had risen from the dead, "},{"num":10,"verse":"so they kept it all to themselves."},{"num":14,"verse":"When they reached the rest of the disciples, Jesus saw that a large crowd had gathered and that among them the scribes were asking questions. "},{"num":15,"verse":"Right when the crowd saw Jesus, they were overcome with awe and surged forward immediately, nearly running over the disciples."},{"num":20,"verse":"They brought the boy toward Jesus; but as soon as He drew near, the spirit took control of the boy and threw him on the ground, where he rolled, foaming at the mouth."},{"num":25,"verse":"Jesus noticed that a crowd had gathered around them now. He issued a command to the unclean spirit."},{"num":26,"verse":"The spirit shrieked and caused the boy to thrash about; then it came out of the boy and left him lying as still as death. Many of those in the crowd whispered that he was dead. "},{"num":27,"verse":"But Jesus took the boy by the hand and lifted him to his feet."},{"num":28,"verse":"Later He and His disciples gathered privately in a house."},{"num":30,"verse":"When they left that place, they passed secretly through Galilee."},{"num":32,"verse":"But again they did not understand His meaning, and they were afraid to ask Him for an explanation."},{"num":33,"verse":"At last, they came to Capernaum where they gathered in a house."},{"num":34,"verse":"They looked down at the floor and wouldn’t answer, for they had been arguing among themselves about who was the greatest of Jesus’ disciples."},{"num":35,"verse":"He sat down with the twelve to teach them."},{"num":36,"verse":"He then called forward a child, set the child in the middle of them, and took the child in His arms."}]