[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(3) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The Lord shall.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Translate, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "May Jehovah cut off.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Proud things.—Literally, great things. Vulg., linguam magniloquam.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Proud things.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Literally, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "great things. ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Vulg., ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "linguam magniloquam.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 12:3. ",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 12:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The Lord shall cut off all flattering lips ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— All such as speak kind things to any one, at the same time that they mean quite the contrary in their hearts; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and the tongue that speaketh proud things ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Hebrew, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "גדלות",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "gedoleth, great things, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "great words, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "boasting what they have done, or declaring, or threatening what they will do, and what great things they will effect, namely, with their tongues, as they themselves explain it in the next words.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12:1-8 The psalmist begs help of God, because there were none among men whom he durst trust. - This psalm furnishes good thoughts for bad times; a man may comfort himself with such meditations and prayers. Let us see what makes the times bad, and when they may be said to be so. Ask the children of this world, What makes the times bad? they will tell you, Scarcity of money, decay of trade, and the desolations of war, make the times bad: but the Scripture lays the badness of the times on causes of another nature, 2Ti 3:1, c.: perilous times shall come, for sin shall abound; and of this David complains. When piety decays times really are bad. He who made man's mouth will call him to an account for his proud, profane, dissembling, or even useless words. When the poor and needy are oppressed, then the times are very bad. God himself takes notice of the oppression of the poor, and the sighing of the needy. When wickedness abounds, and is countenanced by those in authority, then the times are very bad. See with what good things we are here furnished for such bad times; and we cannot tell what times we may be reserved for. 1. We have a God to go to, from whom we may ask and expect the redress of all our grievances. 2. God will certainly punish and restrain false and proud men. 3. God will work deliverance for his oppressed people. His help is given in the fittest time. Though men are false, God is faithful; though they are not to be trusted, God is. The preciousness of God's word is compared to silver refined to the highest degree. How many proofs have been given of its power and truth! God will secure his chosen remnant, however bad the times are. As long as the world stands, there will be a generation of proud and wicked men. But all God's people are put into the hands of Christ our Saviour; there they are in safety, for none can pluck them thence; being built on Him, the Rock, they are safe, notwithstanding temptation or persecution come with ever so much force upon them.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The Lord shall cut off - This might be rendered, \"May the Lord cut off,\" implying a wish on the part of the psalmist that it might occur. But probably the common rendering is the correct one. It is the statement of a solemn truth, designed for warning, that all such persons would be punished.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "All flattering lips - The meaning is, that he will cut off all \"persons\" who use flattery; that is, he will cut them off from the favors which he will show to his own people, or will punish them. The word used here is the common one to denote disowning or excommunicating, and derives its meaning from the act of separating offenders from a community. See Genesis 17:14; Leviticus 17:10; Leviticus 18:29; Leviticus 20:3, Leviticus 20:6; et soepe.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "All flattering lips - The meaning is, that he will cut off all \"persons\" who use flattery; that is, he will cut them off from the favors which he will show to his own people, or will punish them. The word used here is the common one to denote disowning or excommunicating, and derives its meaning from the act of separating offenders from a community. See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 17:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 17:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 18:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 20:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 20:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; et soepe.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And the tongue that speaketh proud things - That boasts, or is self-confident. For an example of this, see Isaiah 28:15; and compare the notes at that passage. It was this disposition to falsehood, flattery, and boasting, which constituted the fact stated in Psalm 12:1, that \"godly\" and \"faithful\" men - men on whom reliance might be placed, whose word might be trusted, and whose promised aid in the cause of truth might be depended on - had seemed to \"fail\" among men. That is, no such men could be found.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And the tongue that speaketh proud things - That boasts, or is self-confident. For an example of this, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 28:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and compare the notes at that passage. It was this disposition to falsehood, flattery, and boasting, which constituted the fact stated in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 12:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", that \"godly\" and \"faithful\" men - men on whom reliance might be placed, whose word might be trusted, and whose promised aid in the cause of truth might be depended on - had seemed to \"fail\" among men. That is, no such men could be found.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3, 4. Boasting (Da 7:25) is, like flattery, a species of lying.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "lips, and … tongue—for persons.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "lips, and … tongue—for persons.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "The Treasury of David",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3 The Lord shall cut off all flattering lips, and the tongue that speaketh proud things:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "4 Who have said, With our tongue will we prevail; our lips are our own: who is lord over us?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Total destruction shall overwhelm the lovers of flattery and pride, but meanwhile how they hector and fume! Well did the apostle call them \"raging waves of the sea, foaming out their own shame.\" Free-thinkers are generally very free-talkers, and they are never more at ease than when railing at God's dominion, and arrogating to themselves unbounded license. Strange is it that the easy yoke of the Lord should so gall the shoulders of the proud, while the iron bands of Satan they bind about themselves as chains of honour: they boastfully cry unto God, \"Who is lord over us?\" and hear not the hollow voice of the evil one, who cries from the infernal lake, \"I am your Lord, and right faithfully do ye serve me.\" Alas, poor fools, their pride and glory shall be cut off like a fading flower! May God grant that our soul may not be gathered with them. It is worthy of observation that flattering lips, and tongues speaking proud things, are classed together: the fitness of this is clear, for they are guilty of the same vice, the first flatters another, and the second flatters himself, in both cases a lie is in their right hands. One generally imagines that flatterers are such mean parasites, so cringing and fawning, that they cannot be proud; but the wise man will tell you that while all pride is truly meanness, there is in the very lowest meanness no small degree of pride. Csar's horse is even more proud of carrying Csar, than Csar is of riding him. The mat on which the emperor wiped his shoes, boasts vaingloriously, crying out, \"I cleaned the imperial boots.\" None are so detestably domineering as the little creatures who creep into office by cringing to the great; those are bad times, indeed, in which these obnoxious beings are numerous and powerful. No wonder that the justice of God in cutting off such injurious persons is matter for a Psalm, for both earth and heaven are weary of such provoking offenders, whose presence is a very plague to the people afflicted thereby. Men cannot tame the tongues of such boastful flatterers; but the Lord's remedy if sharp is sure, and is an unanswerable answer to their swelling words of vanity. ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "great things",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "great words",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", either bragging or threatening what they will do, and what great things they will effect, to wit, by their tongues, as they themselves explain it in the next verse, which they will use so cunningly and powerfully, that they shall not need to use their hands, or strike a stroke. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The Lord shall cut off all flattering lips,.... This is either a prophecy or a prayer, as Aben Ezra and Kimchi observe; that God either would or should cut off such who used flattery with their lips, by inflicting some judgment in this life, or everlasting punishment hereafter; by taking them away by death \"out of the world\", as the Targum paraphrases it; or by casting them into hell, where all liars and deceitful persons will have their portion; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 32:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the tongue that speaketh proud things, or \"great things\" (f), as the little horn, Daniel 7:20; and the beast, or Romish antichrist, who is designed by both, Revelation 13:5; and which will be accomplished when Christ shall destroy him with the breath of his mouth, and the brightness of his coming; and indeed every tongue that riseth up against God, Christ, and his people, will be condemned; when ungodly sinners will be convinced of all their hard speeches, Isaiah 54:17, Jde 1:15. Perhaps some regard may be had to the tongue of Doeg the Edomite; see Psalm 52:3. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and the tongue that speaketh proud things, or \"great things\" (f), as the little horn, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 7:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and the beast, or Romish antichrist, who is designed by both, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 13:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and which will be accomplished when Christ shall destroy him with the breath of his mouth, and the brightness of his coming; and indeed every tongue that riseth up against God, Christ, and his people, will be condemned; when ungodly sinners will be convinced of all their hard speeches, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 54:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", Jde 1:15. Perhaps some regard may be had to the tongue of Doeg the Edomite; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 52:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(f) \"magna\", Pagninus, Montanus, Vatablus, Piscator, Gejerus, Michaelis; \"grandia\", Cocceius. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(f) \"magna\", Pagninus, Montanus, Vatablus, Piscator, Gejerus, Michaelis; \"grandia\", Cocceius. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "The LORD shall cut off all flattering lips, and the tongue that speaketh proud things:",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Render: May Jehovah cut off &c. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 31:17-18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "proud things",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Lit. as R.V., great things; further defined in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Psalm 12:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 12:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "3, 4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The prayer for help passes into a prayer for the excision of these false-hearted braggarts. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 5:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 3.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The Lord shall cut off all flattering lips",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The complaint having been made, a threat follows (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 10:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 11:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 17:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.). The men who flatter with their lips, beguiling and cozening their victims to get them completely into their power, shall be \"cut off\" from the congregation (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 17:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 12:15, 19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 7:20, 27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 17:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And the tongue that speaketh proud things",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "greet rhinos",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but proud and lofty boastings are intended (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 7:8, 20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The same man sometimes cozens with smooth words, sometimes blusters and talks big. Psalm 12:3",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(Heb.: 12:4-5) In this instance the voluntative has its own proper signification: may He root out (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 109:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and the oppositive ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 11:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Flattering lips and a vaunting tongue are one, insofar as the braggart becomes a flatterer when it serves his own selfish interest. אשׁר refers to lips and tongue, which are put for their possessors. The Hiph. הגבּיר may mean either to impart strength, or to give proof of strength. The combination with ל, not בּ, favours the former: we will give emphasis to our tongue (this is their self-confident declaration). Hupfeld renders it, contrary to the meaning of the Hiph.: over our tongue we have power, and Ewald and Olshausen, on the ground of an erroneous interpretation of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 9:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", render: we make or have a firm covenant with our tongue. They describe their lips as being their confederates (את as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 9:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and by the expression \"who is lord over us\" they declare themselves to be absolutely free, and exalted above all authority. If any authority were to assert itself over them, their mouth would put it down and their tongue would thrash it into submission. But Jahve, whom this making of themselves into gods challenges, will not always suffer His own people to be thus enslaved. ",
        "children": []
      }
    ]
  }
]