[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(4) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "With our tongue.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—This is the proud saying just mentioned, and is plainly a boast of the power possessed by those who have the ear of persons in authority, and can adroitly “make the worse appear the better cause”; or being themselves in high places, can, like Angelo in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Measure for Measure, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "defy the accusations of their victims:—",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "“Who will believe thee, Isabel?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "My place in the State",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Will so your accusation overweigh",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "That you shall stifle in your own report,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And smell of calumny.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "But there is great difference of opinion as to the proper rendering, “with our tongues will we prevail.” Some render, “we are masters of our tongues”; others, “with our tongues we confederate”: i.e., “our tongues are our allies.” The last rendering agrees best with the next clause.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "But there is great difference of opinion as to the proper rendering, “with our tongues will we prevail.” Some render, “we are masters of our tongues”; others, “with our tongues we confederate”: ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "i.e.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", “our tongues are our allies.” The last rendering agrees best with the next clause.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Our lips are our own.—Literally, are with us: i.e., on our side. (Comp. 2Kings 9:32.)",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Our lips are our own.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Literally, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "are with us: i.e., ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "on our side. (Comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2Kings 9:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 12:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 12:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "With our tongues will we prevail — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "By raising and spreading evil reports concerning him. We will have the better of all that oppose us; and our tongues are the instruments whereby we will get the victory. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Our lips are our own — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "At our own disposal to speak what we please. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Who is lord over us? ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Who can, or has any right to control us; or to call us to an account?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12:1-8 The psalmist begs help of God, because there were none among men whom he durst trust. - This psalm furnishes good thoughts for bad times; a man may comfort himself with such meditations and prayers. Let us see what makes the times bad, and when they may be said to be so. Ask the children of this world, What makes the times bad? they will tell you, Scarcity of money, decay of trade, and the desolations of war, make the times bad: but the Scripture lays the badness of the times on causes of another nature, 2Ti 3:1, c.: perilous times shall come, for sin shall abound; and of this David complains. When piety decays times really are bad. He who made man's mouth will call him to an account for his proud, profane, dissembling, or even useless words. When the poor and needy are oppressed, then the times are very bad. God himself takes notice of the oppression of the poor, and the sighing of the needy. When wickedness abounds, and is countenanced by those in authority, then the times are very bad. See with what good things we are here furnished for such bad times; and we cannot tell what times we may be reserved for. 1. We have a God to go to, from whom we may ask and expect the redress of all our grievances. 2. God will certainly punish and restrain false and proud men. 3. God will work deliverance for his oppressed people. His help is given in the fittest time. Though men are false, God is faithful; though they are not to be trusted, God is. The preciousness of God's word is compared to silver refined to the highest degree. How many proofs have been given of its power and truth! God will secure his chosen remnant, however bad the times are. As long as the world stands, there will be a generation of proud and wicked men. But all God's people are put into the hands of Christ our Saviour; there they are in safety, for none can pluck them thence; being built on Him, the Rock, they are safe, notwithstanding temptation or persecution come with ever so much force upon them.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Who have said - Who habitually say. This does not mean that they had formally and openly said this - for none would be likely to do so - but that they had practically and really said this by their conduct. They acted as if it were the real principle on which they framed their lives, that they might use their tongues as they pleased.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "With our tongue - literally, \"as to,\" or \"in respect to our tongue;\" that is, by our tongue. It was by the tongue that they expected to accomplish their purposes. It was not by direct power, or by violence, but by the power of speech.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Will we prevail - literally, \"We will do mightily;\" that is, they would accomplish their purposes. They relied on the power of speech - on their ability in influencing others; in deceiving others; in persuading others to fall in with their plans.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Our lips are our own - That is, we may use them as we please; no one has a right to control us in the use of what properly belongs to ourselves. It cannot be meant that they intended to assert this openly as a right, for there are perhaps none who will not admit in words that they are responsible for what they \"say,\" as well as for what they \"do.\" But their conduct was such that this was the fair interpretation to be placed on what they said. They would speak this if they openly professed and avowed what was their real opinion.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Who is lord over us? - That is, who has a right to control us in the case? There are many who practically avow this as a principle of conduct, and who seem to feel that they are not responsible for their words, however much they may admit their responsibility for their actions. There is usually a greater degree of recklessness among men in regard to their speech than in regard to their conduct; and many a man who would shrink from doing another wrong by an act of dishonesty in business, may be utterly reckless as to doing him wrong by an unkind remark. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Who is lord over us? - That is, who has a right to control us in the case? There are many who practically avow this as a principle of conduct, and who seem to feel that they are not responsible for their words, however much they may admit their responsibility for their actions. There is usually a greater degree of recklessness among men in regard to their speech than in regard to their conduct; and many a man who would shrink from doing another wrong by an act of dishonesty in business, may be utterly reckless as to doing him wrong by an unkind remark. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3, 4. Boasting (Da 7:25) is, like flattery, a species of lying.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "lips, and … tongue—for persons.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "With our tongue will we prevail, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " by raising and spreading slanders and evil reports concerning him, whereby both Saul will be highly and implacably enraged against David, and the hearts of the people alienated from him; which was indeed a very likely way to prevail against, him, and that by their tongues only. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Our lips are our own, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. at our own dispose to speak what we please. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Who is lord over us; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " who can control or restrain us? This was not the language of their mouths, for they were Israelites, that owned a God above them, and they were subjects of Saul; but the language of their actions. Scripture oft tells us not only what men do actually say, but what they would say if they durst, or what their actions mean, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 94:7 Malachi 1:12 13 2:17",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 94:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Malachi 1:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 13 2:17",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". They take as great a liberty in their speech as if they believed there was no God or man superior to them; because neither the fear of God, nor the reverence of men, can keep them from speaking whatsoever they please, or what they suppose makes for their interest. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Who have said, with our tongue will we prevail,.... Either through the eloquence of them, or the outward force and power with which they are backed. The sense is, as we say, so shall it be; our words are laws, and shall be obeyed, there is no standing against them; our edicts and decrees shall everywhere be regarded: or \"we will make one to prevail\", or \"have the dominion\" (g); meaning antichrist, the man of sin; for all this is true of the tongues of the antichristian party, and of their laws, edicts, and decrees and which have obtained everywhere, and by which the wicked one has been established in his tyrannical power and authority; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "our lips are our own, or \"with us\" (h): we will say what we please, and make what laws and decrees we think fit, and impose them upon men; and so change times and laws without control, Daniel 7:25; ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "our lips are our own, or \"with us\" (h): we will say what we please, and make what laws and decrees we think fit, and impose them upon men; and so change times and laws without control, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 7:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "who is Lord over us? which is the very language and conduct of antichrist, who opposes and exalts himself above all that is called God, 2 Thessalonians 2:4; and is indeed the language of the hearts and lives of all wicked and ungodly men, sons of Belial, men without any yoke or restraint; who walk, and are resolved to walk, after the imagination of their own evil hearts; not knowing the Lord, and being unwilling to obey him, or to be restrained by him; see Exodus 5:2. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "who is Lord over us? which is the very language and conduct of antichrist, who opposes and exalts himself above all that is called God, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Thessalonians 2:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and is indeed the language of the hearts and lives of all wicked and ungodly men, sons of Belial, men without any yoke or restraint; who walk, and are resolved to walk, after the imagination of their own evil hearts; not knowing the Lord, and being unwilling to obey him, or to be restrained by him; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 5:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(g) \"prevalere ac dominare, faciemus, scil. aliquem regem, dominum\", Cocceius. (h) \"nobiscum\", Musculus, Pagninus, Montanus, Vatablus, Cocceius, Gejerus, Michaelis; so Junius & Tremellius, Piscator, Ainsworth. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(g) \"prevalere ac dominare, faciemus, scil. aliquem regem, dominum\", Cocceius. (h) \"nobiscum\", Musculus, Pagninus, Montanus, Vatablus, Cocceius, Gejerus, Michaelis; so Junius & Tremellius, Piscator, Ainsworth. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Who have said, {c} With our tongue will we prevail; our lips are our own: who is lord over us?",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Who have said, ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{c}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " With our tongue will we prevail; our lips ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "are",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " our own: who ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " lord over us?",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) They think themselves able to persuade whatever they take in hand.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Who",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Namely, the owners of the flattering lips and boastful tongues. ‘",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Our tongue",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",’ they say, ‘",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "we will make mighty: our lips are with us",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",’ under our own control, at command as faithful allies; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "who is lord over us",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "? No one can call us to account for our use of them (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 10:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Unscrupulous courtiers appear to be meant, who deliberately propose to obtain their own ends by reckless disregard of truth, e.g. by flattery, slander, false witness, and the like.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 4.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Who have said, With our tongue will we prevail",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "through our tongues are we powerful",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " whatever we desire we can accomplish through our tongues - by persuasion, or by menaces, or by skill in argument. Success in pleading before courts of law is, perhaps, included. Our lips are our own; literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "are with us",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " are on our side, are our helpers (\"Nobis auxilio et praesto sunt,\" Michaelis). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Who is lord over us?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Who, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", can interfere with us and impede our action? They do not believe in any righteous Judge and Controller of the world, who can step in to frustrate their plans, upset their designs, and bring them to ruin (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 10:4, 11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 14:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Psalm 12:4",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(Heb.: 12:4-5) In this instance the voluntative has its own proper signification: may He root out (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 109:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and the oppositive ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 11:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Flattering lips and a vaunting tongue are one, insofar as the braggart becomes a flatterer when it serves his own selfish interest. אשׁר refers to lips and tongue, which are put for their possessors. The Hiph. הגבּיר may mean either to impart strength, or to give proof of strength. The combination with ל, not בּ, favours the former: we will give emphasis to our tongue (this is their self-confident declaration). Hupfeld renders it, contrary to the meaning of the Hiph.: over our tongue we have power, and Ewald and Olshausen, on the ground of an erroneous interpretation of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 9:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", render: we make or have a firm covenant with our tongue. They describe their lips as being their confederates (את as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 9:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and by the expression \"who is lord over us\" they declare themselves to be absolutely free, and exalted above all authority. If any authority were to assert itself over them, their mouth would put it down and their tongue would thrash it into submission. But Jahve, whom this making of themselves into gods challenges, will not always suffer His own people to be thus enslaved. ",
        "children": []
      }
    ]
  }
]