[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(12, 13) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Then shall ye call upon me . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The words need no comment, but they cannot be passed over without dwelling on the infinite tenderness which they manifest in the prophet’s soul, the reflex of a like tenderness in the mind of God, from whom he gives the message. It is the anticipation of the like message from the lips of Christ, “He that seeketh findeth, and to him that knocketh it shall be opened” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 7:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). As they stand, the words are an echo of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 4:29-30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 29:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 30:3-5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "29:8-19 Let men beware how they call those prophets whom they choose after their own fancies, and how they consider their fancies and dreams to be revelations from God. False prophets flatter people in their sins, because they love to be flattered; and they speak smoothly to their prophets, that their prophets may speak smoothly to them. God promises that they should return after seventy years were accomplished. By this it appears, that the seventy years of the captivity are not to be reckoned from the last captivity, but the first. It will be the bringing to pass of God's good word to them. This shall form God's purposes. We often do not know our own minds, but the Lord is never at an uncertainty. We are sometimes ready to fear that God's designs are all against us; but as to his own people, even that which seems evil, is for good. He will give them, not the expectations of their fears, or the expectations of their fancies, but the expectations of their faith; the end he has promised, which will be the best for them. When the Lord pours out an especial spirit of prayer, it is a good sign that he is coming toward us in mercy. Promises are given to quicken and encourage prayer. He never said, Seek ye me in vain. Those who remained at Jerusalem would be utterly destroyed, notwithstanding what the false prophets said to the contrary. The reason has often been given, and it justifies the eternal ruin of impenitent sinners; Because they have not hearkened to my words; I called, but they refused.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "An expected end - Rather, a future and a hope. The nation shall not come to an end; the exile shall be followed by a restoration. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12. Fulfilled (Da 9:3, &c.). When God designs mercy, He puts it into the hearts of His people to pray for the mercy designed. When such a spirit of prayer is poured out, it is a sure sign of coming mercy.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "go—to the temple and other places of prayer: contrasted with their previous sloth as to going to seek God.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " I will not only give you a temporal salvation and deliverance, and bring you into your own land, but you shall go thither with new hearts; you shall worship idols no more, but you shall worship me, and be serious and diligent in your addresses and applications to me, and I will listen to you in those applications. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then shall ye call upon me,.... When the expected end is about to be given; when God intends and is about to bestow a mercy, he gives his people a spirit of prayer to ask for it; and even the promise of it is a considerable argument to encourage and engage more to pray for it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and ye shall go and pray unto me: walk in my ways; so Jarchi, Kimchi, and Ben Melech; or rather ye shall go into your private closets, or into those public places where prayer was wont to be made, and there put up your petitions; or it may be the meaning is, that they should continue praying unto him; should pray without ceasing, until they enjoyed the blessing, and had the expected end given them: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and I will hearken unto you: God is a God hearing prayer; he listens to the requests of his people, and answers them in his own time and way; which is no small encouragement to pray unto him. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and I will hearken unto you: God is a God hearing prayer; he listens to the requests of his people, and answers them in his own time and way; which is no small encouragement to pray unto him. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Then shall ye call upon me, and ye shall go and pray unto me, and I will hearken unto you.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The MT. is awkward, as it stands. The LXX have merely “and pray unto me, and I will hearken unto you.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 12.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And ye shall go and pray unto me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"Go,\" that is, to the places \"where prayer is wont to be made.\" The clause seems to refer to common prayer for a common object. Comp. striking passages in Solomon's prayer (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 8:48",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and in Deuteronomy (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 4:29, 30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Jeremiah 29:12",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "At ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 29:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the contents of the letter begin. Jeremiah warns the people to prepare for a lengthened sojourn in Babylonia, and exhorts them to settle down there. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 29:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"Build houses and dwell (therein), and plant gardens and eat the fruit of them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 29:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Take wives and beget sons and daughters, and take for your sons wives and give your daughters to husbands, that they may bear sons and daughters; and increase there and not diminish. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 29:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And seek the safety of the city whither I have carried you captive, and pray for it to Jahveh, and in its safety shall be safety to you.\" The imperatives \"increase and not diminish\" give the consequence of what has been said just before. \"The city whither I have carried you captive\" is not precisely Babylon, but every place whither separate companies of the exiles have been transported. And pray for the city whither you are come, because in this you further your own welfare, instead of looking for advantage to yourselves from the fall of the Chaldean empire, from the calamity of your heathen fellow-citizens. - With this is suitably joined immediately the warning against putting trust in the delusive hopes held out by the false prophets. \"For thus saith Jahve of hosts, the God of Israel: Let not your prophets, that are in the midst of you, and your soothsayers, deceive you, and hearken not to your dreams which ye cause to be dreamed; for falsely they prophesy to you in my name; I have not sent them, saith Jahveh.\" מחלמים is somewhat singular, since we have no other example of the Hiph. of חלם in its sig. dream (in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 38:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the Hiph. of the same root means to preserve in good health); but the Hiph. may here express the people's spontaneity in the matter of dreams: which ye cause to be dreamed for you (Hitz.). Thus there would be no need to alter the reading into חלמים; a precedent for the defective spelling being found in מעזרים, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 28:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". What the false prophets gave out is not expressly intimated, but may be gathered from the context ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 29:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", namely, that the yoke of Babylon would soon be broken and captivity come to an end. - This warning is justified in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 29:10-14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where God's decree is set forth. The deliverance will not come about till after seventy years; but then the Lord will fulfil to His people His promise of grace. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 29:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"For thus saith Jahveh: When as seventy years are fulfilled for Babylon, I will visit you, and perform to you my good word, to bring you back to this place. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 29:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". For I know the thoughts that I think toward you, saith Jahveh, thoughts of peace and not for evil, to give you (a) destiny and hope. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 29:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And ye will call upon me, and go and pray unto me, and I will hear you. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 29:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And ye will seek me, and find me, if ye search for me with all your heart. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 29:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And I will let myself be found of you, saith Jahve, and will turn your captivity, and gather you out of all the peoples and from all the places whither I have driven you, saith Jahveh, and will bring you again to the place whence I have carried you away.\" -  לפי מלאת, according to the measure of the fulfilment of seventy years for Babel. These words point back to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 25:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., and we must reckon from the date of that prediction. פּקד c. accus. sig. to visit in a good sense, to look favourably on one and take his part. \"My good word\" is expounded by the following infinitive clause. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 29:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"I know my thoughts\" is not to be taken, as by Jerome, J. D. Mich., etc., as in contrast with the false prophets: I know, but they do not. This antithesis is not in keeping with what follows. The meaning is rather: Although I appoint so long a term for the fulfilment of the plan of redemption, yet fear not that I have utterly rejected you; I know well what my design is in your regard. My thoughts toward you are thoughts of God, not of evil. Although now I inflict lengthened sufferings on you, yet this chastisement but serves to bring about your welfare in the future (Chr. B. Mich., Graf, etc.). - To give you אחרית, lit., last, i.e., issue or future, and hope. For this sig. cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 8:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 5:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc. This future destiny and hope can, however, only be realized if by the sorrows of exile you permit yourselves to be brought to a knowledge of your sins, and return penitent to me. Then ye will call on me and pray, and I will hear you. \"And ye will go,\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 29:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is not the apodosis to \"ye will call,\" since there is no further explanation of it, and since the simple הלך can neither mean to go away satisfied nor to have success. \"Go\" must be taken with what follows: go to the place of prayer (Ew., Umbr., Gr. Ng.). In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 29:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " אתי is to be repeated after \"find.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 29:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 29:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " are a renewal of the promise, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 4:29-30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 29:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is a brief summary of the promise, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 30:3-5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", whence is taken the graphic expression שׁוּב את־שׁבוּת; see on that passage. - Thereafter in ",
        "children": []
      }
    ]
  }
]