[{"header":"Joseph's Brothers Return to Egypt with Benjamin"},{"num":43,"verse":"The famine in Canaan got worse, "},{"num":2,"verse":"and when the family of Jacob had eaten all the grain which had been brought from Egypt, Jacob said to his sons, “Go back and buy a little food for us.”"},{"num":3,"verse":"Judah said to him, “The man sternly warned us that we would not be admitted to his presence unless we had our brother with us. "},{"num":4,"verse":"If you are willing to send our brother with us, we will go and buy food for you. "},{"num":5,"verse":"If you are not willing, we will not go, because the man told us we would not be admitted to his presence unless our brother was with us.”"},{"num":6,"verse":"Jacob said, “Why did you cause me so much trouble by telling the man that you had another brother?”"},{"num":7,"verse":"They answered, “The man kept asking about us and our family, ‘Is your father still living? Do you have another brother?’ We had to answer his questions. How could we know that he would tell us to bring our brother with us?”"},{"num":8,"verse":"Judah said to his father, “Send the boy with me, and we will leave at once. Then none of us will starve to death. "},{"num":9,"verse":"I will pledge my own life, and you can hold me responsible for him. If I do not bring him back to you safe and sound, I will always bear the blame. "},{"num":10,"verse":"If we had not waited so long, we could have been there and back twice by now.”"},{"num":11,"verse":"Their father said to them, “If that is how it has to be, then take the best products of the land in your packs as a present for the governor: a little resin, a little honey, spices, pistachio nuts, and almonds. "},{"num":12,"verse":"Take with you also twice as much money, because you must take back the money that was returned in the top of your sacks. Maybe it was a mistake. "},{"num":13,"verse":"Take your brother and return at once. "},{"num":14,"verse":"May Almighty God cause the man to have pity on you, so that he will give Benjamin and your other brother back to you. As for me, if I must lose my children, I must lose them.”"},{"num":15,"verse":"So the brothers took the gifts and twice as much money, and set out for Egypt with Benjamin. There they presented themselves to Joseph. "},{"num":16,"verse":"When Joseph saw Benjamin with them, he said to the servant in charge of his house, “Take these men to my house. They are going to eat with me at noon, so kill an animal and prepare it.” "},{"num":17,"verse":"The servant did as he was commanded and took the brothers to Joseph's house."},{"num":18,"verse":"As they were being brought to the house, they were afraid and thought, “We are being brought here because of the money that was returned in our sacks the first time. They will suddenly attack us, take our donkeys, and make us his slaves.” "},{"num":19,"verse":"So at the door of the house, they said to the servant in charge, "},{"num":20,"verse":"“If you please, sir, we came here once before to buy food. "},{"num":21,"verse":"When we set up camp on the way home, we opened our sacks, and each man found his money in the top of his sack—every bit of it. We have brought it back to you. "},{"num":22,"verse":"We have also brought some more money with us to buy more food. We do not know who put our money back in our sacks.”"},{"num":23,"verse":"The servant said, “Don't worry. Don't be afraid. Your God, the God of your father, must have put the money in your sacks for you. I received your payment.” Then he brought Simeon to them."},{"num":24,"verse":"The servant took the brothers into the house. He gave them water so that they could wash their feet, and he fed their donkeys. "},{"num":25,"verse":"They got their gifts ready to present to Joseph when he arrived at noon, because they had been told that they were to eat with him. "},{"num":26,"verse":"When Joseph got home, they took the gifts into the house to him and bowed down to the ground before him. "},{"num":27,"verse":"He asked about their health and then said, “You told me about your old father—how is he? Is he still alive and well?”"},{"num":28,"verse":"They answered, “Your humble servant, our father, is still alive and well.” And they knelt and bowed down before him."},{"num":29,"verse":"When Joseph saw his brother Benjamin, he said, “So this is your youngest brother, the one you told me about. God bless you, my son.” "},{"num":30,"verse":"Then Joseph left suddenly, because his heart was full of tender feelings for his brother. He was about to break down, so he went to his room and cried. "},{"num":31,"verse":"After he had washed his face, he came out, and controlling himself, he ordered the meal to be served. "},{"num":32,"verse":"Joseph was served at one table and his brothers at another. The Egyptians who were eating there were served separately, because they considered it beneath their dignity to eat with Hebrews. "},{"num":33,"verse":"The brothers had been seated at the table, facing Joseph, in the order of their age from the oldest to the youngest. When they saw how they had been seated, they looked at one another in amazement. "},{"num":34,"verse":"Food was served to them from Joseph's table, and Benjamin was served five times as much as the rest of them. So they ate and drank with Joseph until they were drunk."}]