[{"header":"Greeting"},{"num":1,"verse":"From Paul, an apostle of Christ Jesus by God’s will, to promote the promise of life that is in Christ Jesus."},{"num":2,"verse":"To Timothy, my dear child."},{"header":"Thanksgiving and prayer"},{"num":3,"verse":"I’m grateful to God, whom I serve with a good conscience as my ancestors did. I constantly remember you in my prayers day and night."},{"num":4,"verse":"When I remember your tears, I long to see you so that I can be filled with happiness."},{"num":5,"verse":"I’m reminded of your authentic faith, which first lived in your grandmother Lois and your mother Eunice. I’m sure that this faith is also inside you."},{"num":6,"verse":"Because of this, I’m reminding you to revive God’s gift that is in you through the laying on of my hands."},{"num":7,"verse":"God didn’t give us a spirit that is timid but one that is powerful, loving, and self-controlled."},{"header":"Don’t be ashamed of the testimony"},{"num":8,"verse":"So don’t be ashamed of the testimony about the Lord or of me, his prisoner. Instead, share the suffering for the good news, depending on God’s power."},{"num":9,"verse":"God is the one who saved and called us with a holy calling. This wasn’t based on what we have done, but it was based on his own purpose and grace that he gave us in Christ Jesus before time began."},{"num":10,"verse":"Now his grace is revealed through the appearance of our savior, Christ Jesus. He destroyed death and brought life and immortality into clear focus through the good news."},{"num":11,"verse":"I was appointed a messenger, apostle, and teacher of this good news."},{"num":12,"verse":"This is also why I’m suffering the way I do, but I’m not ashamed. I know the one in whom I’ve placed my trust. I’m convinced that God is powerful enough to protect what he has placed in my trust until that day."},{"num":13,"verse":"Hold on to the pattern of sound teaching that you heard from me with the faith and love that are in Christ Jesus."},{"num":14,"verse":"Protect this good thing that has been placed in your trust through the Holy Spirit who lives in us."},{"num":15,"verse":"You know that everyone in Asia has turned away from me, including Phygelus and Hermogenes."},{"num":16,"verse":"May the Lord show mercy to Onesiphorus’ household, because he supported me many times and he wasn’t ashamed of my imprisonment."},{"num":17,"verse":"After I arrived in Rome, he quickly looked for me and found me."},{"num":18,"verse":"May the Lord allow him to find his mercy on that day (and you know very well how much he served me in Ephesus)."}]