[{"header":"Greeting"},{"num":1,"verse":"Paul, an emissary of Messiah Yeshua through the will of God, according to the promise of life in Messiah Yeshua."},{"num":2,"verse":"To Timothy my beloved child:"},{"header":"Stir up God’s Charisma in You"},{"num":3,"verse":"I thank God, whom I serve with a clear conscience as my forefathers did, when I continually remember you in my prayers night and day. "},{"num":4,"verse":"I remember your tears, and I long to see you so that I may be filled with joy. "},{"num":5,"verse":"I recall the genuine faithfulness within you, which first lived in your grandmother Lois and your mother Eunice, and I am sure it is within you as well. "},{"num":6,"verse":"For this reason I remind you to fan into flame the gift of God, which is in you through the laying on of my hands. "},{"num":7,"verse":"For God has not given us a spirit of timidity but of power and love and self-discipline."},{"header":"Suffer with Me—for the Good News!"},{"num":8,"verse":"Therefore do not be ashamed of the testimony of our Lord or of me His prisoner, but share in suffering for the Good News according to the power of God. "},{"num":9,"verse":"He has saved us and called us with a holy calling—not because of our deeds but because of His own purpose and grace. This grace was given to us in Messiah Yeshua before time began, "},{"num":10,"verse":"but now has been revealed through the appearing of our Savior Messiah Yeshua. Indeed, He nullified the power of death and brought life and immortality to light through the Good News."},{"num":11,"verse":"For this Good News I was appointed a herald and an emissary and a teacher. "},{"num":12,"verse":"For this reason I also am suffering these things—but I am not ashamed, for I know in whom I have trusted and I am convinced He is able to safeguard what I have entrusted to Him until that Day."},{"num":13,"verse":"Keep the standard of sound words you have heard from me, in the faithfulness and love that are in Messiah Yeshua. "},{"num":14,"verse":"Guard the good that has been entrusted to you, through the Ruach ha-Kodesh who dwells in us."},{"num":15,"verse":"You are aware that everyone in Asia has turned away from me—including Phygelus and Hermogenes. "},{"num":16,"verse":"May the Lord grant mercy to the household of Onesiphorus, because he often refreshed me and was not ashamed of my imprisonment. "},{"num":17,"verse":"On the contrary, when he was in Rome he zealously searched for me and found me. "},{"num":18,"verse":"May the Lord grant him to find mercy from the Lord in that day! You know very well how much he served in Ephesus."}]