[{"num":1,"verse":"I am Paul. I am an apostle of Christ Jesus because God wanted me to be. This is because God has promised life through Christ Jesus."},{"num":2,"verse":"Timothy, you are my son and I love you very much. May God the Father, and Christ Jesus our Lord, bless you. May they be kind to you and give you peace."},{"num":3,"verse":"I worship God with a clean heart, as my fathers did. And I thank God when I talk to him about you. I always do this night and day."},{"num":4,"verse":"I want very much to see you. I remember how you cried when we left you. When I see you, how happy I shall be!"},{"num":5,"verse":"I remember that you really believe. Your grandmother Lois believed first. Your mother Eunice believed too. I am sure that you believe in the same way."},{"num":6,"verse":"That is why I am telling you again. You must use God's gift. It was given to you when I put my hands on your head."},{"num":7,"verse":"God has not given us a spirit of fear. But he has given us a spirit of power and love and self-control."},{"num":8,"verse":"So do not be ashamed to talk about our Lord. And do not be ashamed of me. I am his prisoner. Be patient in your trouble also, because you tell the good news. God will give you the power to do it."},{"num":9,"verse":"God saved us and called us to live a holy life. He did not do it because of the good things we have done. He did it because he himself planned to do it, and wanted to do it. That was the blessing he gave us in Christ Jesus. He had this plan before he made the world."},{"num":10,"verse":"But now he has made it real through the coming of Jesus Christ who saves. He has put death out of the way. He has shown people can have everlasting life by telling them the good news."},{"num":11,"verse":"I have been chosen to tell that good news. I have been chosen to go out and teach it to those who are not Jews."},{"num":12,"verse":"That is why I have this trouble. But I am not ashamed of it because I know the one whom I have trusted. And I am sure he is able to keep safe what I have trusted to him. He will keep it safe until that great day when he comes again."},{"num":13,"verse":"Take what I have taught you as a guide for good teaching. Keep believing in Christ Jesus and loving him."},{"num":14,"verse":"Keep safe that good thing which was trusted to you. The Holy Spirit who lives in us will help you."},{"num":15,"verse":"You know that all the men who live in the country of Asia Minor have left me. Phygellus and Hermogenes are among them."},{"num":16,"verse":"I hope the Lord will be kind to the family of Onesiphorus. He has often helped me. He has not been ashamed of me in prison."},{"num":17,"verse":"When he came to the city of Rome, he looked for me until he found me."},{"num":18,"verse":"I hope the Lord will be kind to him on that great day. You know very well all that he did for me in the city of Ephesus."}]