[{"header":"Esau Moves"},{"num":36,"verse":"Now these are the records of the descendants of Esau, (that is, Edom)."},{"num":2,"verse":"Esau took his [three] wives from the daughters of Canaan: Adah the daughter of Elon the Hittite, and Oholibamah the daughter of Anah, the son of Zibeon the Hivite, "},{"num":3,"verse":"and Basemath, Ishmael’s daughter, sister of Nebaioth. "},{"num":4,"verse":"Adah bore Eliphaz to Esau, and Basemath bore Reuel, "},{"num":5,"verse":"and Oholibamah bore Jeush, Jalam, and Korah. These are the sons of Esau born to him in Canaan."},{"num":6,"verse":"Now Esau took his wives and his sons and his daughters and all the members of his household, and his livestock and all his cattle and all his possessions which he had acquired in the land of Canaan, and he went to a land away from his brother Jacob. "},{"num":7,"verse":"For their [great flocks and herds and] possessions made it impossible for them to live together [in the same region]; the land in which they lived temporarily could not support them because of their livestock. "},{"num":8,"verse":"So Esau lived in the hill country of Seir; Esau is Edom."},{"header":"Descendants of Esau"},{"num":9,"verse":"These are the records of the generations of Esau the father of the Edomites in the hill country of Seir. "},{"num":10,"verse":"These are the names of Esau’s sons: Eliphaz, the son of Adah, Esau’s wife, and Reuel, the son of Basemath, Esau’s wife. "},{"num":11,"verse":"And the sons of Eliphaz were Teman, Omar, Zepho, Gatam, and Kenaz. "},{"num":12,"verse":"And Timna was a concubine of Eliphaz, Esau’s son; and she bore Amalek to Eliphaz. These are the sons of Adah, Esau’s wife. "},{"num":13,"verse":"These are the sons of Reuel: Nahath, Zerah, Shammah, and Mizzah. These are the sons of Basemath, Esau’s wife. "},{"num":14,"verse":"And these are the sons of Oholibamah, Esau’s wife, the daughter of Anah, the son of Zibeon. She bore to Esau: Jeush, Jalam, and Korah."},{"num":15,"verse":"These are the tribal chiefs of the sons of Esau: The sons of Eliphaz, the firstborn of Esau: Chiefs Teman, Omar, Zepho, Kenaz, "},{"num":16,"verse":"Korah, Gatam, and Amalek. These are the chiefs of Eliphaz in the land of Edom; they are the sons of Adah. "},{"num":17,"verse":"These are the sons of Reuel, Esau’s son: Chiefs Nahath, Zerah, Shammah, Mizzah. These are the chiefs of Reuel in the land of Edom; they are the sons of Basemath, Esau’s wife. "},{"num":18,"verse":"These are the sons of Oholibamah, Esau’s wife: Chiefs Jeush, Jalam, and Korah. These are the chiefs born of Oholibamah, daughter of Anah, Esau’s wife. "},{"num":19,"verse":"These are the sons of Esau, (that is, Edom), and these are their chiefs."},{"num":20,"verse":"These are the sons of Seir the Horite, the inhabitants of the land: Lotan, Shobal, Zibeon, Anah, "},{"num":21,"verse":"Dishon, Ezer, and Dishan. These are the chiefs of the Horites, the sons of Seir in the land of Edom. "},{"num":22,"verse":"The sons of Lotan are Hori and Hemam; and Lotan’s sister is Timna. "},{"num":23,"verse":"The sons of Shobal are these: Alvan, Manahath, Ebal, Shepho, and Onam. "},{"num":24,"verse":"These are the sons of Zibeon: Aiah and Anah. This is the Anah who found the hot springs in the wilderness as he pastured the donkeys of Zibeon his father. "},{"num":25,"verse":"The children of Anah are these: Dishon and Oholibamah [Esau’s wife], the daughter of Anah. "},{"num":26,"verse":"These are the sons of Dishon: Hemdan, Eshban, Ithran, and Cheran. "},{"num":27,"verse":"Ezer’s sons are these: Bilhan, Zaavan, and Akan. "},{"num":28,"verse":"The sons of Dishan are these: Uz and Aran. "},{"num":29,"verse":"The Horite chiefs are these: Chiefs Lotan, Shobal, Zibeon, Anah, "},{"num":30,"verse":"Dishon, Ezer, Dishan. These are the Horite chiefs, according to their various clans in the land of Seir."},{"num":31,"verse":"And these are the kings who reigned in the land of Edom before any king reigned over the Israelites: "},{"num":32,"verse":"Bela the son of Beor reigned in Edom, and the name of his city was Dinhabah. "},{"num":33,"verse":"Now Bela died, and Jobab the son of Zerah of Bozrah reigned as his successor. "},{"num":34,"verse":"Then Jobab died, and Husham of the land of the Temanites reigned as his successor. "},{"num":35,"verse":"And Husham died, and Hadad the son of Bedad, who defeated Midian in the country of Moab, reigned as his successor. The name of his [walled] city was Avith. "},{"num":36,"verse":"Hadad died, and Samlah of Masrekah succeeded him. "},{"num":37,"verse":"Then Samlah died, and Shaul of Rehoboth on the river [Euphrates] reigned as his successor. "},{"num":38,"verse":"And Shaul died, and Baal-hanan son of Achbor reigned as his successor. "},{"num":39,"verse":"Baal-hanan the son of Achbor died, and then Hadar reigned [as his successor]. His [walled] city was Pau; his wife’s name was Mehetabel the daughter of Matred, the daughter of Mezahab."},{"num":40,"verse":"And these are the names of the tribal chiefs of Esau, according to their families and places of residence, by their names: Chiefs Timna, Alvah, Jetheth, "},{"num":41,"verse":"Oholibamah, Elah, Pinon, "},{"num":42,"verse":"Kenaz, Teman, Mibzar, "},{"num":43,"verse":"Magdiel, and Iram. These are the tribal chiefs of Edom (that is, of Esau the father of the Edomites), according to their dwelling places in the land of their possession."}]