[{"header":"Chapter 36"},{"num":1,"verse":"List of the Clans Established in Edom. These are the descendants of Esau, that is, of Edom."},{"num":2,"verse":"Esau married women from the daughters of the Canaanites: Adah, the daughter of Elon the Hittite, Oholibamah, the daughter of Anah, who was the son of Zibeon the Hivite,"},{"num":3,"verse":"and Basemath, the daughter of Ishmael and the sister of Nebaioth."},{"num":4,"verse":"Adah bore Eliphaz to Esau, and Basemath bore Reuel."},{"num":5,"verse":"Oholibamah bore Jeush, Jalam, and Korah. These were the sons of Esau who were born in the land of Canaan."},{"num":6,"verse":"Esau took his wives and sons and daughters and all the people who were in his household, his flocks and all his animals and all his possessions that he acquired in the land of Canaan, and he went into the land of Seir, far from his brother Jacob."},{"num":7,"verse":"Their possessions, in fact, were too extensive for them to live together, and the land in which they were living could not sustain the grazing of all their animals."},{"num":8,"verse":"Esau thus dwelt in the mountains of Seir. Now Esau is Edom."},{"num":9,"verse":"These are the descendants of Esau, the father of the Edomites, in the mountains of Seir."},{"num":10,"verse":"These are the names of the sons of Esau:"},{"num":11,"verse":"The sons of Eliphaz:"},{"num":12,"verse":"Eliphaz, the son of Esau, had a concubine named Timna, who bore Amalek to Eliphaz. These were the sons of Ada, the wife of Esau."},{"num":13,"verse":"These are the sons of Reuel:"},{"num":14,"verse":"These are the sons of Oholibamah, the wife of Esau, the daughter of Anah, who was the son of Zibeon, whom she bore to Esau:"},{"num":15,"verse":"These are the leaders of the clans of Esau’s descendants:"},{"num":17,"verse":"These are the sons of Reuel, Esau’s son:"},{"num":18,"verse":"These are the sons of Oholibamah, Esau’s wife:"},{"num":19,"verse":"Such are the sons of Esau, that is Edom, and such are the leaders of the clans."},{"num":20,"verse":"These are the sons of Seir the Hittite who were living in the land:"},{"num":22,"verse":"The sons of Lotan:"},{"num":23,"verse":"The sons of Shobal:"},{"num":24,"verse":"The sons of Zibeon:"},{"num":25,"verse":"The children of Anah:"},{"num":26,"verse":"The sons of Dishon:"},{"num":27,"verse":"The sons of Ezer:"},{"num":28,"verse":"The sons of Dishan:"},{"num":29,"verse":"These are the leaders of the clans of the Horites:"},{"num":31,"verse":"These are the kings who ruled in the land of Edom before the kings of Israel ruled over them:"},{"num":32,"verse":"Bela, the son of Beor, reigned in Edom, and his city was called Dinhabah."},{"num":33,"verse":"Bela died and his son Jobab, the son of Zerah of Bozrah, reigned in his place."},{"num":34,"verse":"Jobab died and Husham of the land of the Temanites reigned in his place."},{"num":35,"verse":"Husham died and Hadad, the son of Bedad, who defeated the Midianites in the steppe of Moab, reigned in his place. His city was called Avith."},{"num":36,"verse":"Hadad died and Samlah of Masrekah reigned in his place."},{"num":37,"verse":"Samlah died and Shaul of Rehoboth by the River ruled in his place."},{"num":38,"verse":"Shaul died and Baal-hanan, the son of Achbor, reigned in his place."},{"num":39,"verse":"Baal-hanan, son of Achbor, died and Hadar reigned in his place. His city was called Pau. His wife’s name was Mehetabel. She was the daughter of Matred from Mezahab."},{"num":40,"verse":"These are the names of the leaders of Esau according to their clans, their lands, and their names:"}]