[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(1) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "By thy name.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—See Note, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 20:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". (Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 30:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Judge me by thy strength—i.e., in Thy power see that justice is done me.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Judge me by thy strength",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "i.e.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", in Thy power see that justice is done me.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 54:1-3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 54:1-3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Save me by thy name — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That is, by thy own strength, as the next words explain it, because I have no other refuge. Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for thy name, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "for thy own glory, which is concerned in my deliverance. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And judge me —",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Give sentence for me, or plead my cause. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For strangers are risen up against me — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The Ziphites, whom, though Israelites, he calls strangers in regard of their barbarous and perfidious conduct toward him, by which they showed themselves to be ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "estranged from God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "as the wicked are said to be, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 58:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and from the commonwealth of Israel, and from all the laws of piety and humanity. For which causes he calls such persons ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "heathen, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 59:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and elsewhere. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "They have not set God before them — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "They have cast off all regard to his presence and authority, and all fear of his judgments.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "54:1-3 God is faithful, though men are not to be trusted, and it is well for us it is so. David has no other plea to depend upon than God's name, no other power to depend upon than God's strength, and these he makes his refuge and confidence. This would be the effectual answer to his prayers. Looking unto David, betrayed by the men of Judah, and to Jesus, betrayed by one of his apostles, what can we expect from any who have not set God before them, save ingratitude, treachery, malice, and cruelty? What bonds of nature, or friendship, or gratitude, or covenant, will hold those that have broken through the fear of God? Selah; Mark this. Let us set God before us at all times; for if we do not, we are in danger of despair.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Save me, O God, by thy name - The word \"name\" here may include the perfections or attributes properly implied in the name. It is a calling on God as God, or in view of all that is implied in his name, or that constitutes the idea of \"God.\" That name would imply all of power and benevolence that was necessary to secure his salvation or safety. The particular object of the prayer here is that God would save him from the design of the Ziphims to betray him to Saul. In some way David seems to have been apprised of the information which they had given to Saul, or at least to have suspected it so strongly that he felt it was necessary for him to move from place to place in order to find safety.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And judqe me by thy strength - The word \"judge\" here is used in the sense of declaring a judgment in his favor, or of vindicating him. See the notes at Psalm 7:8. Compare Psalm 18:20; Psalm 26:1; Psalm 43:1. The idea is, Vindicate or save me by thy power. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And judqe me by thy strength - The word \"judge\" here is used in the sense of declaring a judgment in his favor, or of vindicating him. See the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 7:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 18:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 26:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 43:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The idea is, Vindicate or save me by thy power. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "PSALM 54",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ps 54:1-7. See on [596]Ps 4:1, title; [597]Ps 32:1, title; for the history, see 1Sa 23:19, 29; 26:1-25. After an earnest cry for help, the Psalmist promises praise in the assurance of a hearing.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. by thy name—(Ps 5:11), specially, power.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "judge me—as in Ps 7:8; 26:1.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "judge me—as in Ps 7:8; 26:1.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "The Treasury of David",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1 Save me, O God, by thy name, and judge me by thy strength.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "2 Hear my prayer, O God; give ear to the words of my mouth.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "3 For strangers are risen up against me, and oppressors seek after my soul: they have not set God before them. Selah.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 54:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 54:1",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Save me, O God.\" Thou art my Saviour; all around me are my foes and their eager helpers. No shelter is permitted me. Every land rejects me and denies me rest. But thou, O God, wilt give me refuge, and deliver me from all my enemies. \"By thy name,\" by thy great and glorious nature. Employ all thine attributes for me. Let every one of the perfections which are blended in thy divine name work for me. Is not thine honour pledged for my defence? \"And judge me by thy strength.\" Render justice to me, for none else will or can. Thou canst give me efficient justice, and right my wrongs by thine omnipotence. We dare not appeal to God in a bad cause, but when we know that we can fearlessly carry our cause before his justice we may well commit it to his power.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 54:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 54:2",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Hear my prayer, O God.\" This has ever been the defence of saints. As long as God hath an open ear we cannot be shut up in trouble. All other weapons may be useless, but all-prayer is evermore available. No enemy can spike this gun. \"Give ear to the words of thy mouth.\" Vocal prayer helps the supplicant, and we keep our minds more fully awake when we can use our tongues as well as our hearts. But what is prayer if God hear not? It is all one whether we babble nonsense or plead arguments if our God grant us not a hearing. When his case had become dangerous, David could not afford to pray out of mere custom, he must succeed in his pleadings, or become the prey of his adversary.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 54:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 54:3",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"For strangers are risen up against me.\" Those who had no cause for ill-will had gone against him; persons to whom he could have given no offence, for they were strangers to him. They were aliens to his God also, and should these be allowed to worry and destroy him. A child may well complain to his father when strangers come in to molest him? What right have they to interfere? Let them leave off meddling and mind their own concerns. \"And oppressors seek after my soul.\" Saul, that persecuting tyrant, had stamped his own image on many more. Kings generally coin their own likeness. He led the way, and others followed seeking David's soul, his blood, his life, his very existence. Cruel and intense were they in their malice, they would utterly crush the good man; no half measures would content them. \"They have not set God before them.\" They had no more regard for right and justice than if they knew no God, or cared for none. Had they regarded God they would not have betrayed the innocent to be hunted down like a poor harmless stag. David felt that atheism lay at the bottom of the enmity which pursued him. Good men are hated for God's sake, and this is a good plea for them to urge in prayer. \"Selah.\" As if he said, \"Enough of this, let us pause.\" He is out of breath with indignation. A sense of wrong bids him suspend the music awhile. It may also be observed, that more pauses would, as a rule, improve our devotions: we are usually too much in a hurry: a little more holy meditation would make our words more suitable and our emotions more fervent. Of which he speaks 1 Samuel 23, when they did seek to betray him a second time. The psalmist, complaining of his oppressors, prayeth forGod’s protection; and for the righteous punishment of his enemies, Psalm 54:1-3. Placing his hope in God’s help, Psalm 54:4,5, he promiseth a free sacrifice of thanksgiving to him, Psalm 54:6,7.  By thy name,  i. e. by thy own strength, as the next words explain it, because I have no other refuge. Or, for thy name, i.e. for thy own glory, which is concerned in my deliverance. Judge me,  i.e. judge or give sentence for me, or plead my cause, as this phrase is oft taken, as we have seen. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"For strangers are risen up against me.\" Those who had no cause for ill-will had gone against him; persons to whom he could have given no offence, for they were strangers to him. They were aliens to his God also, and should these be allowed to worry and destroy him. A child may well complain to his father when strangers come in to molest him? What right have they to interfere? Let them leave off meddling and mind their own concerns. \"And oppressors seek after my soul.\" Saul, that persecuting tyrant, had stamped his own image on many more. Kings generally coin their own likeness. He led the way, and others followed seeking David's soul, his blood, his life, his very existence. Cruel and intense were they in their malice, they would utterly crush the good man; no half measures would content them. \"They have not set God before them.\" They had no more regard for right and justice than if they knew no God, or cared for none. Had they regarded God they would not have betrayed the innocent to be hunted down like a poor harmless stag. David felt that atheism lay at the bottom of the enmity which pursued him. Good men are hated for God's sake, and this is a good plea for them to urge in prayer. \"Selah.\" As if he said, \"Enough of this, let us pause.\" He is out of breath with indignation. A sense of wrong bids him suspend the music awhile. It may also be observed, that more pauses would, as a rule, improve our devotions: we are usually too much in a hurry: a little more holy meditation would make our words more suitable and our emotions more fervent. Of which he speaks ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "1 Samuel 23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", when they did seek to betray him a second time. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "The psalmist, complaining of his oppressors, prayeth forGod’s protection; and for the righteous punishment of his enemies, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 54:1-3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Placing his hope in God’s help, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 54:4,5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", he promiseth a free sacrifice of thanksgiving to him, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 54:6,7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "By thy name, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " i. e. by thy own strength, as the next words explain it, because I have no other refuge. Or, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "for thy name",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", i.e. for thy own glory, which is concerned in my deliverance. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Judge me, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " i.e. judge or give sentence for me, or plead my cause, as this phrase is oft taken, as we have seen. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Save me, O God, by thy name,.... That is, by himself, by his power, and of his grace and goodness; the Lord's name is often used for himself. David in his distress applies to his God for salvation and deliverance, who only could give it; which was right; and his prayer was remarkably heard and answered: for when Saul came down upon the first discovery, and beset David and his men all around, just as he was about to seize the prey, tidings came to him of the invasion of the Philistines; which obliged him directly to quit his pursuit of David, and return in haste for the defence of his country, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 23:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and upon the second discovery, when Saul came again to take him, Saul was delivered into the hands of David, who could have took away his life if he would; but he only took his spear and cruse of water by his bolster, as a proof of his being in his power, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 26:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Of such avail is the effectual fervent prayer of a righteous man. This prayer is suitable enough to David's antitype and son, the Messiah; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 69:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and especially to sensible sinners; who, being made acquainted with, their lost and perishing condition, inquire the way of salvation; and finding it is not by works, but by Christ alone, apply in that way for it, and desire that God would save them by his Son; who is his name, in whom his name is, and whose name Jesus, a Saviour, is of God's giving; and this name is a strong tower, whither such souls, sensible of danger, flee and are safe; nor is there any other name in which salvation is, and which is therefore exceeding precious, and like ointment poured forth; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 23:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Or, \"for thy name's sake\" (h); for the sake of the glory of his divine perfections; which was displayed in the deliverance of David, and more abundantly in the salvation of lost sinners; such as the wisdom, power, faithfulness, justice, grace and mercy of God. Such a petition shows that man cannot save himself; that no creature, none but God can save him; and that a sensible sinner desires to be saved in such a way that God may be glorified; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and judge me by thy strength; David, though innocent, had many charges laid against him; his enemies were lively and strong; he puts his cause into the hands of the Lord, his strong Redeemer, who was able to plead it thoroughly against those that strove with him; so Christ, his antitype, committed his cause to him that judgeth righteously, 1 Peter 2:23; and so should every believer. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and judge me by thy strength; David, though innocent, had many charges laid against him; his enemies were lively and strong; he puts his cause into the hands of the Lord, his strong Redeemer, who was able to plead it thoroughly against those that strove with him; so Christ, his antitype, committed his cause to him that judgeth righteously, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Peter 2:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and so should every believer. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(h) \"propter nomen tuum\", Junius & Tremellius, Piscator, Gejerus, Amama, Michaelis. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(h) \"propter nomen tuum\", Junius & Tremellius, Piscator, Gejerus, Amama, Michaelis. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "<A Psalm of David, when the Ziphims came and said to Saul, Doth not David hide himself with us?>> Save me, O God, {a} by thy name, and judge me by thy strength.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "<",
            "children": []
          },
          {
            "element": "to",
            "class": "",
            "text": "A Psalm of David, when the Ziphims came and said to Saul, Doth not David hide himself with us?>> Save me, O God, {a} by thy name, and judge me by thy strength.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) He declares that when all means fail, God will deliver even by miracle, they who call to him with an upright conscience.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "by thy name",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] God’s name is the manifestation of His character, the sum of His revealed attributes. The Psalmist can appeal to it, for He has declared that it is His will to save those who put their trust in Him. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 5:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "judge me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Do me justice. Confident in the goodness of his cause, he is sure that if right is done him, he will be delivered. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 24:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 7:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 9:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 26:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 35:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 43:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "by thy strength",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] R.V., in thy might. God has not only the will, but the power to deliver His servant. He is “a mighty one who will save” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zephaniah 3:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 1.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Save me, O God, by thy Name;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " by the qualities of which thy \"Name\" is significant - power, goodness, and truth. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And judge me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " \"vindicate me,\" or \"judge my cause.\" By thy strength; or, \"thy might\" - the might which thou possessest as a ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "gibbor",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or \"hero.\" Psalm 54:1",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(Heb.: 54:3-5) This short song is divided into two parts by Sela The first half prays for help and answer. The Name of God is the manifestation of His nature, which has mercy as its central point (for the Name of God is טּוב, v. 8, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 52:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), so that בּשׁמך (which is here the parallel word to בּגבוּרתך) is consequently equivalent to בּחסדּך. The obtaining of right for any one (דּין like שׁפט, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 7:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and frequently, עשׂה דּין, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 9:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") is attributed to the all-conquering might of God, which is only one side of the divine Name, i.e., of the divine nature which manifests itself in the diversity of its attributes. האזין (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 54:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") is construed with ל (cf. אל, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 87:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") like הטּה אזן, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 78:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Targum, misled by ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 86:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", reads זרים instead of זרים in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 54:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The inscription leads one to think of the Ziphites in particular in connection with \"strangers\" and \"violent men.\" The two words in most instances denote foreign enemies, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 25:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 29:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 31:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but זר is also a stranger in the widest sense, regulated in each instance according to the opposite, e.g., the non-priest, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 22:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and one's fellow-countrymen can also turn out to be עריצים, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 15:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Ziphites, although Judaeans like David, might be called \"strangers,\" because they had taken the side against David; and \"violent men,\" because they pledged themselves to seize and deliver him up. Under other circumstances this might have been their duty as subjects. In this instance, however, it was godlessness, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 54:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 86:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") says. Any one at that time in Israel who feared God more than man, could not lend himself to be made a tool of Saul's blind fury. God had already manifestly enough acknowledged David. ",
        "children": []
      }
    ]
  }
]