[{"num":10,"verse":"“ I  tell legō you hymeis the  solemn amēn truth amēn,  the ho one  who  does  not mē enter eiserchomai the ho sheepfold aulē through dia the ho gate thura,  · ho but alla climbs anabainō in  by  some  other  way allachothen,  is eimi a  thief kleptēs and kai a  robber lēstēs. "},{"num":2,"verse":"But de the ho one  who  enters eiserchomai by dia the ho gate thura is eimi the  shepherd poimēn of  the ho sheep probaton. "},{"num":3,"verse":"The ho watchman thurōros allows  him houtos to  enter anoigō,  and kai the ho sheep probaton pay  attention  to akouō · ho his autos voice phōnē;  · kai he  calls phōneō · ho his idios own  sheep probaton by kata name onoma and kai leads exagō them autos out. "},{"num":4,"verse":"When hotan he  has  brought  out ekballō all pas · ho his idios own ,  he  walks poreuō on  ahead emprosthen of  them autos,  and kai the ho sheep probaton follow akoloutheō him autos because hoti they  know oida · ho his autos voice phōnē. "},{"num":5,"verse":"They  will akoloutheō never ou follow akoloutheō a  stranger allotrios,  · de but alla will  run pheugō away  from apo him autos,  because hoti they  do  not ou know oida the ho voice phōnē of ho strangers allotrios.” "},{"num":6,"verse":"Jesus Iēsous told legō them autos this houtos · ho figurative paroimia story ,  · ho but de they ekeinos did  not ou understand ginōskō what tis he  was  saying laleō to  them autos. "},{"num":7,"verse":"So oun Jesus Iēsous said legō once  again palin,  · ho “ I  tell legō you hymeis the  solemn  truth amēn,  I egō am eimi the ho gate thura for  the ho sheep probaton. "},{"num":8,"verse":"All pas who hosos came erchomai before pro me egō were eimi thieves kleptēs and kai robbers lēstēs,  but alla the ho sheep probaton did  not ou listen akouō to  them autos. "},{"num":9,"verse":"I egō am eimi the ho gate thura.  If ean anyone tis enters eiserchomai through dia me egō,  he  will  be  saved sōzō;  · kai he  will  come eiserchomai in  and kai go exerchomai out  and kai find heuriskō pasture nomē. "},{"num":10,"verse":"The ho thief kleptēs comes erchomai only ei mē to hina steal kleptō and kai slaughter thuō and kai destroy apollymi;  I egō have  come erchomai that hina they  may  have echō life zōē,  and kai have echō it  abundantly perissos. "},{"num":11,"verse":"“ I egō am eimi the ho good kalos shepherd poimēn;  · ho the ho good kalos shepherd poimēn · ho lays  down tithēmi · ho his autos life psychē for hyper the ho sheep probaton. "},{"num":12,"verse":"The ho hired misthōtos hand ,  since kai he  is eimi not ou a  shepherd poimēn and  the ho sheep probaton do  not ou belong eimi to  him idios,  sees theōreō a ho wolf lykos coming erchomai and kai abandons aphiēmi the ho sheep probaton and kai runs pheugō away — and kai the ho wolf lykos attacks harpazō the  flock autos and kai scatters them. "},{"num":13,"verse":"He does this  because hoti he  is eimi simply a  hired misthōtos hand  and kai has  no ou real  concern melei for peri the ho sheep probaton. "},{"num":14,"verse":"I egō am eimi the ho good kalos shepherd poimēn.  · ho · kai I  know ginōskō · ho my emos own  and kai they emos know ginōskō me egō,  · ho"},{"num":15,"verse":"just kathōs as  the ho Father patēr knows ginōskō me egō and kagō I  know ginōskō the ho Father patēr;  and kai I  lay  down tithēmi · ho my egō life psychē for hyper my ho sheep probaton. "},{"num":16,"verse":"· kai I  have echō other allos sheep probaton which hos are eimi not ou of ek · ho this houtos fold aulē.  These kakeinos too  I egō must dei bring agō.  · kai They  will  listen  to akouō · ho my egō voice phōnē,  and kai there  will  be ginomai one heis flock poimnē, with  one heis shepherd poimēn. "},{"num":17,"verse":"Therefore dia houtos the ho Father patēr loves agapaō me egō,  because hoti I egō lay tithēmi down  · ho my egō life psychē in  order hina that  I  may  take lambanō it autos back  again palin. "},{"num":18,"verse":"No oudeis one  takes airō it autos away  from apo me egō,  but alla I egō lay tithēmi it autos down  of apo my emautou own  free will.  I  have echō the  power exousia to  lay tithēmi it autos down ,  and kai I  have echō the  power exousia to  take lambanō it autos back  again palin.  This houtos · ho command entolē I  received lambanō from para · ho my egō Father patēr.” "},{"num":19,"verse":"Once  again palin there  was ginomai a  division schisma among en the ho Jews Ioudaios because dia of  · ho these houtos words logos. "},{"num":20,"verse":"Many polys of ek them autos were  saying legō,  · de “ He  is  demon-possessed daimonion and kai out  of  control mainomai.  Why tis are  you  listening  to akouō him autos?” "},{"num":21,"verse":"Others allos were  saying legō, “ These houtos are eimi not ou the ho words rhēma of  a  man  possessed  by  a  demon daimonizomai.  Can dynamai a  demon daimonion open anoigō the  eyes ophthalmos of  the  blind typhlos?” "},{"num":22,"verse":"At  that  time tote the ho festival  of  Dedication enkainia was  taking ginomai place  in en · ho Jerusalem Hierosolyma.  It  was eimi winter cheimōn, "},{"num":23,"verse":"and kai Jesus Iēsous was  walking peripateō · ho in en the ho temple hieron area ,  in en · ho Solomon’ s Solomōn Portico stoa.  · ho"},{"num":24,"verse":"The ho Jews Ioudaios surrounded kykloō him autos and kai asked legō, “ How  much  longer heōs will  you  provoke airō us hēmeis to airō · ho anger psychē?  If ei you sy are eimi the ho Christ Christos,  tell legō us hēmeis plainly parrēsia.” "},{"num":25,"verse":"Jesus Iēsous answered apokrinomai them autos,  · ho “ I  did  tell legō you hymeis,  yet kai you  do  not ou believe pisteuō.  The ho works ergon that hos I egō am  doing poieō in en · ho my egō Father’ s patēr name onoma · ho speak martyreō on  my egō behalf peri. "},{"num":26,"verse":"But alla you hymeis do  not ou believe pisteuō because hoti you  are eimi not ou part ek of ho my emos flock probaton.  · ho"},{"num":27,"verse":"· ho My emos sheep probaton · ho listen  to akouō · ho my egō voice phōnē,  and kagō I  know ginōskō them autos.  · kai They  follow akoloutheō me egō, "},{"num":28,"verse":"and kagō I  give didōmi them autos eternal aiōnios life zōē.  · kai They  will  never ou mē perish apollymi,  and kai no ou one tis will  ever  snatch harpazō them autos out ek of  · ho my egō hand cheir. "},{"num":29,"verse":"· ho My egō Father patēr,  who hos has  given didōmi them  to  me egō,  is eimi more  powerful megas than  all pas,  and kai no oudeis one  can dynamai snatch harpazō them  out ek of  my ho Father’ s patēr hand cheir.  · ho"},{"num":30,"verse":"I egō and kai the ho Father patēr are eimi one heis.” "},{"num":31,"verse":"The ho Jews Ioudaios again palin brought bastazō stones lithos to hina stone lithazō him autos. "},{"num":32,"verse":"Jesus Iēsous said apokrinomai to  them autos,  · ho “ I  have  shown deiknymi you hymeis many polys noble kalos works ergon from ek the ho Father patēr;  for dia which poios one ergon of  them autos do  you  intend  to  stone lithazō me egō?” "},{"num":33,"verse":"The ho Jews Ioudaios answered apokrinomai him autos, “It is  not ou for peri a  noble kalos work ergon that  we  intend  to  stone lithazō you sy but alla for peri blasphemy blasphēmia;  · kai it is  because hoti you sy, a  mere  man anthrōpos,  are  making poieō yourself seautou God theos.” "},{"num":34,"verse":"Jesus Iēsous answered apokrinomai them autos,  · ho “ Is  it eimi not ou written graphō in en · ho your hymeis law nomos, ‘ I egō said legō,  you  are eimi gods theos’? "},{"num":35,"verse":"If ei the scripture  called legō them ekeinos ‘ gods theos’  to pros whom hos the ho word logos of ho God theos came ginomai— and kai scripture graphē cannot ou dynamai be  annulled lyō · ho— "},{"num":36,"verse":"do legō you hymeis say legō regarding  the one  whom hos the ho Father patēr consecrated hagiazō and kai sent apostellō into eis the ho world kosmos, ‘ You  are  blaspheming blasphēmeō,’  because hoti I  said legō, ‘ I  am eimi the  Son hyios of ho God theos’? "},{"num":37,"verse":"If ei I  am  not ou doing poieō the ho works ergon of ho my egō Father patēr, then  do  not mē believe pisteuō me egō; "},{"num":38,"verse":"but de if ei I  am  doing poieō them,  even kan if  you  do pisteuō not mē believe pisteuō me egō,  believe pisteuō the ho works ergon,  that hina you  may  come  to  know ginōskō and kai be  certain ginōskō that hoti the ho Father patēr is  in en me egō and kagō that  I  am  in en the ho Father patēr.” "},{"num":39,"verse":"So oun once  again palin they  tried zēteō to  arrest piazō him autos,  but kai he  escaped exerchomai out ek of  · ho their autos grasp cheir. "},{"num":40,"verse":"· kai He  went aperchomai away  again palin across peran the ho Jordan Iordanēs to eis the ho place topos where hopou John Iōannēs had  been eimi baptizing baptizō at an  · ho earlier prōton time ,  and kai there ekei he  remained menō. "},{"num":41,"verse":"· kai Many polys people  came erchomai to pros him autos and kai were  saying legō, “ John Iōannēs performed poieō no oudeis miraculous sēmeion sign ,  but de everything pas he Iōannēs said legō about peri this houtos man  was eimi true alēthēs!” "},{"num":42,"verse":"And kai many polys in  that  place ekei came  to  believe pisteuō in eis Jesus autos. "}]