[{"num":23,"verse":"In the seventh year of Athaliah’s reign, Jehoiada strengthened his position by making an agreement with the company commanders: Azariah, son of Jeroham, Ishmael, son of Jehohanan, Azariah, son of Obed, Maaseiah, son of Adaiah, and Elishaphat, son of Zichri. "},{"num":2,"verse":"They went around Judah, gathered the Levites from all the cities of Judah and the leaders of the families of Israel, and came to Jerusalem. "},{"num":3,"verse":"The whole assembly made an agreement with the king in Elohim’s temple."},{"num":4,"verse":"This is what you must do: One third of you, the priests and Levites who are on duty on the day of worship, must guard the gates. "},{"num":5,"verse":"Another third must be at the royal palace. And another third must be at Foundation Gate. All the people must be in the courtyards of Yahweh’s temple. "},{"num":6,"verse":"No one should come into Yahweh’s temple except the priests and the Levites who are on duty with them. They may enter because they are holy, but all other people should follow Yahweh’s regulations. "},{"num":7,"verse":"The Levites should surround the king. Each man should have his weapon in his hand. Kill anyone who tries to come into the temple. Stay with the king wherever he goes.”"},{"num":8,"verse":"So the Levites and all the Judeans did what the priest Jehoiada had ordered them. Each took his men who were coming on duty on the day of worship as well as those who were about to go off duty. Jehoiada had not dismissed the priestly divisions."},{"num":9,"verse":"Jehoiada gave the commanders the spears and the small and large shields that had belonged to King David but were now in Elohim’s temple. "},{"num":10,"verse":"All the troops stood with their weapons drawn. They were stationed around the king and around the altar and the temple (from the south side to the north side of the temple). "},{"num":11,"verse":"Then they brought out the king’s son, gave him the crown and the religious instructions, and Jehoiada and his sons made him king by anointing him. They said, “Long live the king!”"},{"num":12,"verse":"When Athaliah heard the people running and praising the king, she went into Yahweh’s temple, where the people were. "},{"num":13,"verse":"She looked, and the king was standing by the pillar at the entrance. The commanders and the trumpeters were by his side. All the people of the land were rejoicing and blowing trumpets. The singers were leading the celebration with songs accompanied by musical instruments. As Athaliah tore her clothes in distress, she said, “Treason, treason!”"},{"num":14,"verse":"Then the priest Jehoiada brought the company commanders who were in charge of the army out of the temple. He said to them, “Take her out of the temple. Use your sword to kill anyone who follows her.” (The priest had said, “Don’t kill her in Yahweh’s temple.”) "},{"num":15,"verse":"So they arrested her as she entered Horse Gate of the royal palace, and they killed her there."},{"num":16,"verse":"Jehoiada made a promise to the Lord on behalf of the king and his people that they would be Yahweh’s people. "},{"num":17,"verse":"Then all the people went to the temple of Baal and tore it down. They smashed Baal’s altars and his statues and killed Mattan, the priest of Baal, in front of the altars."},{"num":18,"verse":"Next, Jehoiada appointed officials to be in charge of Yahweh’s temple under the direction of the priests and Levites. (David had arranged them in divisions for Yahweh’s temple. They were appointed to sacrifice burnt offerings to Yahweh as it is written in Moses’ Teachings. They made these offerings with joy and singing as David had directed.) "},{"num":19,"verse":"Jehoiada appointed gatekeepers for the gates of Yahweh’s temple so that no one who was unclean for any reason could enter."},{"num":20,"verse":"He took the company commanders, the nobles, the people’s governors, and all the people of the land, and they brought the king from Yahweh’s temple. They went through Upper Gate to the royal palace and seated the king on the royal throne. The nobles, the governors of the people, and "},{"num":21,"verse":"all the people of the land were celebrating. But the city was quiet because they had killed Athaliah with a sword."}]