[[],[{"type":"prose","content":"But in the seventh year Jehoiada took courage, and entered into a compact with the commanders of the hundreds, Azariah son of Jeroham, Ishmael son of Jehohanan, Azariah son of Obed, Maaseiah son of Adaiah, and Elishaphat son of Zichri. "}],[{"type":"prose","content":"They went around through Judah and gathered the Levites from all the towns of Judah, and the heads of families of Israel, and they came to Jerusalem. "}],[{"type":"prose","content":"Then the whole assembly made a covenant with the king in the house of God. Jehoiada said to them, “Here is the king’s son! Let him reign, as the  promised concerning the sons of David. "}],[{"type":"prose","content":"This is what you are to do: one-third of you, priests and Levites, who come on duty on the sabbath, shall be gatekeepers, "}],[{"type":"prose","content":"one-third shall be at the king’s house, and one-third at the Gate of the Foundation; and all the people shall be in the courts of the house of the . "}],[{"type":"prose","content":"Do not let anyone enter the house of the  except the priests and ministering Levites; they may enter, for they are holy, but all the other people shall observe the instructions of the . "}],[{"type":"prose","content":"The Levites shall surround the king, each with his weapons in his hand; and whoever enters the house shall be killed. Stay with the king in his comings and goings.”"},{"type":"header","content":"Joash Crowned King"}],[{"type":"prose","content":"The Levites and all Judah did according to all that the priest Jehoiada commanded; each brought his men, who were to come on duty on the sabbath, with those who were to go off duty on the sabbath; for the priest Jehoiada did not dismiss the divisions. "}],[{"type":"prose","content":"The priest Jehoiada delivered to the captains the spears and the large and small shields that had been King David’s, which were in the house of God; "}],[{"type":"prose","content":"and he set all the people as a guard for the king, everyone with weapon in hand, from the south side of the house to the north side of the house, around the altar and the house. "}],[{"type":"prose","content":"Then he brought out the king’s son, put the crown on him, and gave him the covenant; they proclaimed him king, and Jehoiada and his sons anointed him; and they shouted, “Long live the king!”"},{"type":"header","content":"Athaliah Murdered"}],[{"type":"prose","content":"When Athaliah heard the noise of the people running and praising the king, she went into the house of the  to the people; "}],[{"type":"prose","content":"and when she looked, there was the king standing by his pillar at the entrance, and the captains and the trumpeters beside the king, and all the people of the land rejoicing and blowing trumpets, and the singers with their musical instruments leading in the celebration. Athaliah tore her clothes, and cried, “Treason! Treason!” "}],[{"type":"prose","content":"Then the priest Jehoiada brought out the captains who were set over the army, saying to them, “Bring her out between the ranks; anyone who follows her is to be put to the sword.” For the priest said, “Do not put her to death in the house of the .” "}],[{"type":"prose","content":"So they laid hands on her; she went into the entrance of the Horse Gate of the king’s house, and there they put her to death."}],[{"type":"prose","content":"Jehoiada made a covenant between himself and all the people and the king that they should be the ’s people. "}],[{"type":"prose","content":"Then all the people went to the house of Baal, and tore it down; his altars and his images they broke in pieces, and they killed Mattan, the priest of Baal, in front of the altars. "}],[{"type":"prose","content":"Jehoiada assigned the care of the house of the  to the levitical priests whom David had organized to be in charge of the house of the , to offer burnt offerings to the , as it is written in the law of Moses, with rejoicing and with singing, according to the order of David. "}],[{"type":"prose","content":"He stationed the gatekeepers at the gates of the house of the  so that no one should enter who was in any way unclean. "}],[{"type":"prose","content":"And he took the captains, the nobles, the governors of the people, and all the people of the land, and they brought the king down from the house of the , marching through the upper gate to the king’s house. They set the king on the royal throne. "}],[{"type":"prose","content":"So all the people of the land rejoiced, and the city was quiet after Athaliah had been killed with the sword."}]]