[{"num":23,"verse":"Now in the seventh year Jehoiada strengthened himself and brought the officers of hundreds—Azariah the son of Jeroham, Ishmael the son of Jehohanan, Azariah the son of Obed, Maaseiah the son of Adaiah, and Elishaphat the son of Zichri—into a covenant with him. "},{"num":2,"verse":"They went throughout Judah and gathered the Levites from all the cities of Judah and the leading patriarchs of Israel. They came to Jerusalem "},{"num":3,"verse":"and the entire congregation made a covenant with the king in the House of God. Then he said to them:"},{"num":4,"verse":"This is what you should do: a third of you, kohanim and Levites coming on duty on Shabbat will keep watch at the gates, "},{"num":5,"verse":"a third of you shall be in the royal palace, and a third at the Foundation Gate, and all the people shall be in the courtyard, and all the people should be in the courtyard of the House of Adonai. "},{"num":6,"verse":"But let no one enter into the House of Adonai except the kohanim and the ministering Levites. They may come in, for they are kadosh, and let all the people observe the service of Adonai. "},{"num":7,"verse":"The Levites will surround the king on all sides, every man with his weapons in his hand, and whoever enters the House, let him be killed. Stay close to the king in his comings and goings.”"},{"num":8,"verse":"So the Levites and all Judah did according to all that Jehoiada the kohen commanded. Each took his men, those that were on duty on Shabbat and those who went off duty on Shabbat, for Jehoiada the kohen had not dismissed any of the divisions. "},{"num":9,"verse":"And Jehoiada the kohen delivered to the officers of hundreds King David’s spears, shields and bucklers that were in the House of God. "},{"num":10,"verse":"Then he stationed all the people, each man with his weapon in his hand around the king—from the south side of the House to the north side of the House by the altar and by the House."},{"num":11,"verse":"Then they brought out the king’s son and placed upon him the crown and the insignia. They proclaimed him king, and Jehoiada and his sons anointed him and declared, “Long live the king!”"},{"num":12,"verse":"When Athaliah heard the shouting of the people running and praising the king, she came to the people to the House of Adonai. "},{"num":13,"verse":"She looked, and behold, the king was standing by his pillar at the entrance and the officers and the trumpeters were beside the king. All the people of the land were rejoicing and blowing the trumpets, and the singers with their musical instruments were leading the praise. So Athaliah tore her clothes and said, “Treason, treason!”"},{"num":14,"verse":"Jehoiada the kohen brought out the officers of hundreds who were set over the army, and said to them, “Bring her out from between the ranks and put to the sword anyone who follows her.”"},{"num":15,"verse":"So they seized her as she arrived at the entrance of the Horse Gate of the royal palace and killed her there. "},{"num":16,"verse":"Then Jehoiada made a covenant between himself, all the people and the king to be the people of Adonai. "},{"num":17,"verse":"All the people went to the house of Baal and tore it down, smashed its altars and images into pieces, and slew Mattan, the priest of Baal, in front of the altars."},{"num":18,"verse":"Then Jehoiada placed the oversight of the House of Adonai under the authority of the Levitical kohanim, whom David had assigned over the House of Adonai to offer the burnt offerings of Adonai, as it is written in the Torah of Moses, accompanied by rejoicing and singing as ordered by David. "},{"num":19,"verse":"He also stationed gatekeepers at the gates of the House of Adonai so that no one who was ritually impure for any reason could enter. "},{"num":20,"verse":"He took the officers of hundreds, the nobles, the rulers of the people and all the people of the land, and brought the king down from the House of Adonai. They came through the upper gate of the royal house and seated the king upon the royal throne, "},{"num":21,"verse":"and all the people of the land rejoiced. The city was quiet for Athaliah had been slain with the sword."}]