[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(2) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Grace be to you.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 1:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Corinthians 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1:1-11 We are encouraged to come boldly to the throne of grace, that we may obtain mercy, and find grace to help in time of need. The Lord is able to give peace to the troubled conscience, and to calm the raging passions of the soul. These blessings are given by him, as the Father of his redeemed family. It is our Saviour who says, Let not your heart be troubled. All comforts come from God, and our sweetest comforts are in him. He speaks peace to souls by granting the free remission of sins; and he comforts them by the enlivening influences of the Holy Spirit, and by the rich mercies of his grace. He is able to bind up the broken-hearted, to heal the most painful wounds, and also to give hope and joy under the heaviest sorrows. The favours God bestows on us, are not only to make us cheerful, but also that we may be useful to others. He sends comforts enough to support such as simply trust in and serve him. If we should be brought so low as to despair even of life, yet we may then trust God, who can bring back even from death. Their hope and trust were not in vain; nor shall any be ashamed who trust in the Lord. Past experiences encourage faith and hope, and lay us under obligation to trust in God for time to come. And it is our duty, not only to help one another with prayer, but in praise and thanksgiving, and thereby to make suitable returns for benefits received. Thus both trials and mercies will end in good to ourselves and others.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Grace be to you ... - This is the usual Christian salutation; see the ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 1:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " note; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " note. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "THE SECOND EPISTLE OF PAUL THE APOSTLE TO THE CORINTHIANS Commentary by A. R. Faussett   ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "INTRODUCTION",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The following reasons seem to have induced Paul to write this Second Epistle to the Corinthians: (1) That he might explain the reasons for his having deferred to pay them his promised visit, by taking Corinth as his way to Macedonia (1Co 4:19; 2Co 1:15, 16; compare 1Co 16:5); and so that he might set forth to them his apostolic walk in general (2Co 1:12, 24; 6:3-13; 7:2). (2) That he might commend their obedience in reference to the directions in his First Epistle, and at the same time direct them now to forgive the offender, as having been punished sufficiently (2Co 2:1-11; 7:6-16). (3) That he might urge them to collect for the poor saints at Jerusalem (2Co 8:1-9, 15). (4) That he might maintain his apostolic authority and reprove gainsayers.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The external testimonies for its genuineness are Irenæus [Against Heresies, 3,7,1]; Athenagoras [Of the Resurrection of the Dead]; Clement of Alexandria [Miscellanies, 3, p. 94; 4, p. 101]; Tertullian [On Modesty, 13].",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The TIME OF WRITING was after Pentecost, A.D. 57, when Paul left Ephesus for Troas. Having stayed in the latter place for some time preaching the Gospel with effect (2Co 2:12), he went on to Macedonia, being eager to meet Titus there, having been disappointed in his not coming to Troas, as had been agreed on between them. Having heard from him the tidings he so much desired of the good effect produced on the Corinthians by his First Epistle, and after having tested the liberality of the Macedonian churches (2Co 8:1), he wrote this Second Epistle, and then went on to Greece, where he abode for three months; and then, after travelling by land, reached Philippi on his return at Passover or Easter, A.D. 58 (Ac 20:1-6). So that this Epistle must have been written about autumn, A.D. 57.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Macedonia was THE PLACE from which it was written (2Co 9:2, where the present tense, \"I boast,\" or \"am boasting,\" implies his presence then in Macedonia). In Asia (Lydian Asia) he had undergone some great peril of his life (2Co 1:8, 9), whether the reference be [Paley] to the tumult at Ephesus (Ac 19:23-41), or, as Alford thinks, to a dangerous illness in which he despaired of life. Thence he passed by Troas to Philippi, the first city which would meet him in entering Macedonia. The importance of the Philippian Church would induce him to stay there some time; as also his desire to collect contributions from the Macedonian churches for the poor saints at Jerusalem. His anxiety of mind is recorded (2Co 7:5) as occurring when he came into Macedonia, and therefore must have been at Philippi, which was the first city of Macedonia in coming from Troas; and here, too, from 2Co 7:6, compared with 2Co 7:5, must have been the scene of his receiving the comforting tidings from Titus. \"Macedonia\" is used for Philippi in 2Co 11:9, as is proved by comparison with Php 4:15, 16. So it is probably used here (2Co 7:5). Alford argues from 2Co 8:1, where he speaks of the \"grace bestowed on the churches (plural) of Macedonia,\" that Paul must have visited other churches in Macedonia, besides Philippi, when he wrote, for example, Thessalonica, Berea, &c., and that Philippi, the first on his route, is less likely to have been the scene of his writing than the last on his route, whichever it was, perhaps Thessalonica. But Philippi, as being the chief town of the province, was probably the place to which all the collections of the churches were sent. Ancient tradition, too (as appears from the subscription to this Epistle), favors the view that Philippi was the place from which this Epistle was sent by the hands of Titus who received, besides, a charge to prosecute at Corinth the collection which he had begun at his first visit (2Co 8:6).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The STYLE is most varied, and passes rapidly from one phase of feeling to another; now joyous and consolatory, again severe and full of reproof; at one time gentle and affectionate, at another, sternly rebuking opponents and upholding his dignity as an apostle. This variety of style accords with the warm and earnest character of the apostle, which nowhere is manifested more beautifully than in this Epistle. His bodily frailty, and the chronic malady under which he suffered, and which is often alluded to (2Co 4:7; 5:1-4; 12:7-9; compare Note, see on [2299]2Co 1:8), must have been especially trying to one of his ardent temperament. But besides this, was the more pressing anxiety of the \"care of all the churches.\" At Corinth, as elsewhere, Judaizing emissaries wished to bind legal fetters of letter and form (compare 2Co 3:3-18) on the freedom and catholicity of the Church. On the other hand, there were free thinkers who defended their immorality of practice by infidel theories (1Co 15:12, 32-36). These were the \"fightings without,\" and \"fears within\" (2Co 7:5, 6) which agitated the apostle's mind until Titus brought him comforting tidings from Corinth. Even then, while the majority at Corinth had testified their repentance, and, as Paul had desired, excommunicated the incestuous person, and contributed for the poor Christians of Judea, there was still a minority who, more contemptuously than ever, resisted the apostle. These accused him of crafty and mercenary motives, as if he had personal gain in view in the collection being made; and this, notwithstanding his scrupulous care to be above the possibility of reasonable suspicion, by having others besides himself to take charge of the money. This insinuation was palpably inconsistent with their other charge, that he could be no true apostle, as he did not claim maintenance from the churches which he founded. Another accusation they brought of cowardly weakness; that he was always threatening severe measures without daring to execute them (2Co 10:8-16; 13:2); and that he was vacillating in his teaching and practice, circumcising Timothy, and yet withholding circumcision from Titus; a Jew among the Jews, and a Greek among the Greeks. That most of these opponents were of the Judaizing party in the Church, appears from 2Co 11:22. They seem to have been headed by an emissary from Judea (\"he that cometh,\" 2Co 11:4), who had brought \"letters of commendation\" (2Co 3:1) from members of the Church at Jerusalem, and who boasted of his purity of Hebrew descent, and his close connection with Christ Himself (2Co 11:13, 23). His partisans contrasted his high pretensions with the timid humility of Paul (1Co 2:3); and his rhetoric with the apostle's plain and unadorned style (2Co 11:6; 10:10, 13). It was this state of things at Corinth, reported by Titus, that caused Paul to send him back forthwith thither with this Second Epistle, which is addressed, not to Corinth only (1Co 1:2), but to all the churches also in Achaia (2Co 1:1), which had in some degree been affected by the same causes as affected the Corinthian Church. The widely different tone in different parts of the Epistle is due to the diversity which existed at Corinth between the penitent majority and the refractory minority. The former he addresses with the warmest affection; the latter with menace and warning. Two deputies, chosen by the churches to take charge of the contribution to be collected at Corinth, accompanied Titus (2Co 8:18, 19, 22).   ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "CHAPTER 1",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "2Co 1:1-24. The Heading; Paul's Consolations in Recent Trials in Asia; His Sincerity towards the Corinthians; Explanation of His Not Having Visited Them as He Had Purposed.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. Timothy our brother—When writing to Timothy himself, he calls him \"my son\" (1Ti 1:18). Writing of him, \"brother,\" and \"my beloved son\" (1Co 4:17). He had been sent before to Macedonia, and had met Paul at Philippi, when the apostle passed over from Troas to Macedonia (compare 2Co 2:12, 13; see on [2300]1Co 16:10, 11).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "in all Achaia—comprising Hellas and the Peloponnese. The Gentiles themselves, and Annæus Gallio, the proconsul (Ac 18:12-16), strongly testified their disapproval of the accusation brought by the Jews against Paul. Hence, the apostle was enabled to labor in the whole province of Achaia with such success as to establish several churches there (1Th 1:8; 2Th 1:4), where, writing from Corinth, he speaks of the \"churches,\" namely, not only the Corinthian, but others also—Athens, Cenchrea, and, perhaps, Sicyon, Argos, &c. He addresses \"the Church in Corinth,\" directly, and all \"the saints\" in the province, indirectly. In Ga 1:2 all the \"churches\" are addressed directly in the same circular Epistle. Hence, here he does not say, all the churches, but \"all the saints.\"",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " This was the apostle’s common salutation, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Romans 1:7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 1:7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole on \"Romans 1:7\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole on \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 1:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1 Corinthians 1:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 1:3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; where it is observable, that not the Father only, but the Lord Jesus Christ is invoked, and made the Author of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "grace, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which is the free love of God, and of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "peace, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which signifieth either reconciliation with God upon the free pardon of our sin, or union with men, and brotherly love amongst themselves. The heathens used to begin their epistles with wishing one another health and prosperity; but the apostle hath shown us a more Christian way, and more suited to the faith of Christians, who believe the love and favour of God the greatest and most desirable blessings. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Grace be to you,.... This salutation is the same with that in the former epistle, and is common to all his epistles; See Gill on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 1:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Grace be to you and peace from God our Father, and from the Lord Jesus Christ.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Corinthians 1:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀπὸ Θεοῦ πατρὸς κ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "λ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".: this coupling of the names of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "God our Father",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the Lord Jesus Christ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as alike the source of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "grace and peace",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is most significant in its bearing upon St. Paul’s Christology (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Corinthians 13:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "I. The Obedience of the Corinthians to the Instructions of the First Epistle (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Corinthians 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Corinthians 7:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). This is the main topic of the first section of this Epistle. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Corinthians 1:3-7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : THANKSGIVING; GOD’S CONSOLATIONS AND THE SYMPATHY OF SORROW. St. Paul’s habit is to begin his letters with an expression of thankfulness for the Christian progress of his correspondents. The only exceptions are the Epp. to Titus and to the Galatians (in this case he had received bad news from Galatia). In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Timothy 1:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the cause of his thankfulness is the exhibition of the Divine mercy to himself; and this Epistle begins with a like thought, from which he passes (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Corinthians 1:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") to his confident belief that the Corinthian Christians are still his ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καύχημα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It was especially important that a letter which was so largely taken up with rebuke and with the assertion of his apostolical authority should begin with a message of sympathy and hopefulness (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Corinthians 1:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff.).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Grace",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] See note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and below, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "2 Corinthians 1:12",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Corinthians 1:12",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "be to you and peace from God our Father, and from the Lord Jesus Christ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Here, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (see note there), Jesus Christ is associated with the Father as the source of grace and peace.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 2.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Grace be to you and peace.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " On this pregnant synthesis of the Greek and Hebrew greetings, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 1:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". 2 Corinthians 1:2",
        "children": []
      }
    ]
  }
]