[{"header":"Chapter 7"},{"num":1,"verse":"Now that the wall had been rebuilt, I had the doors set up, and the gatekeepers, the singers, and the Levites were put in charge of them. "},{"num":2,"verse":"Over Jerusalem I placed Hanani, my brother, and Hananiah, the commander of the citadel, who was more trustworthy and God-fearing than most. "},{"num":3,"verse":"I said to them: “The gates of Jerusalem are not to be opened until the sun is hot, and while the sun is still shining they shall shut and bar the doors. Appoint as sentinels the inhabitants of Jerusalem, some at their watch posts, and others in front of their own houses.”"},{"num":4,"verse":"Census of the Province. Now, the city was quite wide and spacious, but its population was small, and none of the houses had been rebuilt. "},{"num":5,"verse":"When my God had inspired me to gather together the nobles, the magistrates, and the people, and to examine their family records, I came upon the family list of those who had returned in the earliest period. There I found the following written:"},{"num":6,"verse":"These are the inhabitants of the province who returned from the captivity of the exiles whom Nebuchadnezzar, king of Babylon, had carried away, and who came back to Jerusalem and Judah, to their own cities: "},{"num":7,"verse":"They returned with Zerubbabel, Jeshua, Nehemiah, Azariah, Raamiah, Nahamani, Mordecai, Bilshan, Mispereth, Bigvai, Nehum, and Baanah."},{"num":8,"verse":"descendants of Parosh, two thousand one hundred and seventy-two; "},{"num":9,"verse":"descendants of Shephatiah, three hundred and seventy-two; "},{"num":10,"verse":"descendants of Arah, six hundred and fifty-two; "},{"num":11,"verse":"descendants of Pahath-moab who were descendants of Jeshua and Joab, two thousand eight hundred and eighteen; "},{"num":12,"verse":"descendants of Elam, one thousand two hundred and fifty-four; "},{"num":13,"verse":"descendants of Zattu, eight hundred and forty-five; "},{"num":14,"verse":"descendants of Zaccai, seven hundred and sixty; "},{"num":15,"verse":"descendants of Binnui, six hundred and forty-eight; "},{"num":16,"verse":"descendants of Bebai, six hundred and twenty-eight; "},{"num":17,"verse":"descendants of Azgad, two thousand three hundred and twenty-two; "},{"num":18,"verse":"descendants of Adonikam, six hundred and sixty-seven; "},{"num":19,"verse":"descendants of Bigvai, two thousand and sixty-seven; "},{"num":20,"verse":"descendants of Adin, six hundred and fifty-five; "},{"num":21,"verse":"descendants of Ater who were descendants of Hezekiah, ninety-eight; "},{"num":22,"verse":"descendants of Hashum, three hundred and twenty-eight; "},{"num":23,"verse":"descendants of Bezai, three hundred and twenty-four; "},{"num":24,"verse":"descendants of Hariph, one hundred and twelve; "},{"num":25,"verse":"descendants of Gibeon, ninety-five; "},{"num":26,"verse":"people of Bethlehem and Netophah, one hundred and eighty-eight; "},{"num":27,"verse":"people of Anathoth, one hundred and twenty-eight; "},{"num":28,"verse":"people of Beth-azmaveth, forty-two; "},{"num":29,"verse":"people of Kiriath-jearim, Chephirah, and Beeroth, seven hundred and forty-three; "},{"num":30,"verse":"people of Ramah and Geba, six hundred and twenty-one; "},{"num":31,"verse":"people of Michmas, one hundred and twenty-two; "},{"num":32,"verse":"people of Bethel and Ai, one hundred and twenty-three; "},{"num":33,"verse":"people of Nebo, fifty-two; "},{"num":34,"verse":"descendants of the other Elam, one thousand two hundred and fifty-four; "},{"num":35,"verse":"descendants of Harim, three hundred and twenty; "},{"num":36,"verse":"descendants of Jericho, three hundred and forty-five; "},{"num":37,"verse":"descendants of Lod, Hadid, and Ono, seven hundred and twenty-one; "},{"num":38,"verse":"descendants of Senaah, three thousand nine hundred and thirty."},{"num":39,"verse":"The priests: descendants of Jedaiah of the house of Jeshua, nine hundred and seventy-three; "},{"num":40,"verse":"descendants of Immer, one thousand and fifty-two; "},{"num":41,"verse":"descendants of Pashhur, one thousand two hundred and forty-seven; "},{"num":42,"verse":"descendants of Harim, one thousand and seventeen."},{"num":43,"verse":"The Levites: descendants of Jeshua, Kadmiel of the descendants of Hodeviah, seventy-four."},{"num":44,"verse":"The singers: descendants of Asaph, one hundred and forty-eight."},{"num":45,"verse":"The gatekeepers: descendants of Shallum, descendants of Ater, descendants of Talmon, descendants of Akkub, descendants of Hatita, descendants of Shobai, one hundred and thirty-eight."},{"num":46,"verse":"The temple servants: descendants of Ziha, descendants of Hasupha, descendants of Tabbaoth, "},{"num":47,"verse":"descendants of Keros, descendants of Sia, descendants of Padon, "},{"num":48,"verse":"descendants of Lebana, descendants of Hagaba, descendants of Shalmai, "},{"num":49,"verse":"descendants of Hanan, descendants of Giddel, descendants of Gahar, "},{"num":50,"verse":"descendants of Reaiah, descendants of Rezin, descendants of Nekoda, "},{"num":51,"verse":"descendants of Gazzam, descendants of Uzza, descendants of Paseah, "},{"num":52,"verse":"descendants of Besai, descendants of the Meunites, descendants of the Nephusites, "},{"num":53,"verse":"descendants of Bakbuk, descendants of Hakupha, descendants of Harhur, "},{"num":54,"verse":"descendants of Bazlith, descendants of Mehida, descendants of Harsha, "},{"num":55,"verse":"descendants of Barkos, descendants of Sisera, descendants of Temah, "},{"num":56,"verse":"descendants of Neziah, descendants of Hatipha."},{"num":57,"verse":"Descendants of Solomon’s servants: descendants of Sotai, descendants of Sophereth, descendants of Perida, "},{"num":58,"verse":"descendants of Jaala, descendants of Darkon, descendants of Giddel, "},{"num":59,"verse":"descendants of Shephatiah, descendants of Hattil, descendants of Pochereth-hazzebaim, descendants of Amon. "},{"num":60,"verse":"The total of the temple servants and the descendants of Solomon’s servants was three hundred and ninety-two."},{"num":61,"verse":"The following who returned from Tel-melah, Tel-harsha, Cherub, Addon, and Immer were unable to prove that their ancestral houses and their descent were Israelite: "},{"num":62,"verse":"descendants of Delaiah, descendants of Tobiah, descendants of Nekoda, six hundred and forty-two. "},{"num":63,"verse":"Also, of the priests: descendants of Hobaiah, descendants of Hakkoz, descendants of Barzillai (he had married one of the daughters of Barzillai the Gileadite and was named after him). "},{"num":64,"verse":"These men searched their family records, but their names could not be found written there; hence they were disqualified from the priesthood, "},{"num":65,"verse":"and the governor ordered them not to partake of the most holy foods until there should be a priest to consult the Urim and Thummim."},{"num":66,"verse":"The entire assembly taken together came to forty-two thousand three hundred and sixty, "},{"num":67,"verse":"not counting their male and female servants, who were seven thousand three hundred and thirty-seven. They also had two hundred male and female singers. Their horses were seven hundred and thirty-six, their mules two hundred and forty-five, "},{"num":68,"verse":"their camels four hundred and thirty-five, their donkeys six thousand seven hundred and twenty."},{"num":69,"verse":"Certain of the heads of ancestral houses contributed to the temple service. The governor put into the treasury one thousand drachmas of gold, fifty basins, thirty vestments for priests, and five hundred minas of silver. "},{"num":70,"verse":"Some of the heads of ancestral houses contributed to the treasury for the temple service: twenty thousand drachmas of gold and two thousand two hundred minas of silver. "},{"num":71,"verse":"The contributions of the rest of the people amounted to twenty thousand drachmas of gold, two thousand minas of silver, and sixty-seven vestments for priests."},{"num":72,"verse":"The priests, the Levites, the gatekeepers, the singers, the temple servants, and all Israel took up residence in their cities."}]