[{"header":"The 144,000 People of Israel"},{"num":7,"verse":"After this I saw four angels standing at the four corners of the earth, holding back the four winds so that no wind should blow on the earth or the sea or against any tree. "},{"num":2,"verse":"And I saw another angel coming up from the east with the seal of the living God. He called out in a loud voice to the four angels to whom God had given the power to damage the earth and the sea. "},{"num":3,"verse":"The angel said, “Do not harm the earth, the sea, or the trees, until we mark the servants of our God with a seal on their foreheads.” "},{"num":4,"verse":"And I was told that the number of those who were marked with God's seal on their foreheads was 144,000. They were from the twelve tribes of Israel, "},{"num":5,"verse":"twelve thousand from each tribe: Judah, Reuben, Gad, Asher, Naphtali, Manasseh, Simeon, Levi, Issachar, Zebulun, Joseph, and Benjamin."},{"header":"The Enormous Crowd"},{"num":9,"verse":"After this I looked, and there was an enormous crowd—no one could count all the people! They were from every race, tribe, nation, and language, and they stood in front of the throne and of the Lamb, dressed in white robes and holding palm branches in their hands. "},{"num":10,"verse":"They called out in a loud voice: “Salvation comes from our God, who sits on the throne, and from the Lamb!” "},{"num":11,"verse":"All the angels stood around the throne, the elders, and the four living creatures. Then they threw themselves face downward in front of the throne and worshiped God, "},{"num":12,"verse":"saying, “Amen! Praise, glory, wisdom, thanksgiving, honor, power, and might belong to our God forever and ever! Amen!”"},{"num":13,"verse":"One of the elders asked me, “Who are these people dressed in white robes, and where do they come from?”"},{"num":14,"verse":"“I don't know, sir. You do,” I answered."},{"num":15,"verse":"That is why they stand before God's throne and serve him day and night in his temple. He who sits on the throne will protect them with his presence. "},{"num":16,"verse":"Never again will they hunger or thirst; neither sun nor any scorching heat will burn them, "},{"num":17,"verse":"because the Lamb, who is in the center of the throne, will be their shepherd, and he will guide them to springs of life-giving water. And God will wipe away every tear from their eyes.”"}]