[{"num":7,"verse":"1 The Angels coming to hurt the earth, 3 are stayed until the elect of the Lord, 5 of all tribes were sealed. 13 Such as suffered persecution for Christ’s sake, 16 have great felicity, 17 and joy."},{"num":1,"verse":"And after that, I saw four Angels stand on the four corners of the earth, holding the four winds of the earth, that the winds should not blow on the earth, neither on the sea, neither on any tree."},{"num":2,"verse":"And I saw another Angel come up from the East, which had the seal of the living God, and he cried with a loud voice to the four Angels to whom power was given to hurt the earth, and the sea, saying,"},{"num":3,"verse":"Hurt ye not the earth, neither the sea, neither the trees, till we have sealed the servants of our God in their foreheads."},{"num":4,"verse":"And I heard the number of them, which were sealed, and there were sealed an hundred and four and forty thousand of all the tribes of the children of Israel."},{"num":5,"verse":"Out of the tribe of Judah were sealed twelve thousand. Of the tribe of Reuben were sealed twelve thousand. Of the tribe of Gad were sealed twelve thousand."},{"num":6,"verse":"Of the tribe of Asher were sealed twelve thousand. Of the tribe of Naphtali were sealed twelve thousand. Of the tribe of Manasseh were sealed twelve thousand."},{"num":7,"verse":"Of the tribe of Simeon were sealed twelve thousand. Of the tribe of Levi were sealed twelve thousand. Of the tribe of Issachar were sealed twelve thousand. Of the tribe of Zebulun were sealed twelve thousand."},{"num":8,"verse":"Of the tribe of Joseph were sealed twelve thousand. Of the tribe of Benjamin were sealed twelve thousand."},{"num":9,"verse":"After these things I beheld, and lo, a great multitude, which no man could number, of all nations and kindreds, and people, and tongues stood before the throne, and before the Lamb, clothed with long white robes, and palms in their hands."},{"num":10,"verse":"And they cried with a loud voice, saying, Salvation cometh of our God, that sitteth upon the throne, and of the Lamb."},{"num":11,"verse":"And all the Angels stood round about the throne, and about the Elders, and the four beasts, and they fell before the throne on their faces, and worshipped God,"},{"num":12,"verse":"Saying, Amen, Praise and glory, and wisdom, and thanks, and honor, and power, and might, be unto our God for evermore, Amen."},{"num":13,"verse":"And one of the Elders spake, saying unto me, What are these which are arrayed in long white robes? and whence came they?"},{"num":14,"verse":"And I said unto him, Lord, thou knowest. And he said unto me, These are they which came out of great tribulation, and have washed their long robes, and have made their long robes white in the blood of the Lamb."},{"num":15,"verse":"Therefore are they in the presence of the throne of God, and serve him day and night in his Temple, and he that sitteth on the throne will dwell among them."},{"num":16,"verse":"They shall hunger no more, neither thirst anymore, neither shall the sun light on them, neither any heat."},{"num":17,"verse":"For the Lamb, which is in the midst of the throne, shall govern them, and shall lead them unto the lively fountains of waters, and God shall wipe away all tears from their eyes."}]