[{"header":"The 144,000 People of Israel"},{"num":7,"verse":"After the vision of these things I saw four angels standing at the four corners of the earth. The angels were holding the four winds of the earth to keep them from blowing on the land or on the sea or on any tree. "},{"num":2,"verse":"Then I saw another angel coming up from the east who had the seal of the living God. And he called out in a loud voice to the four angels to whom God had given power to harm the earth and the sea. "},{"num":3,"verse":"He said to them, “Do not harm the land or the sea or the trees until we mark with a sign the foreheads of the people who serve our God.” "},{"num":4,"verse":"Then I heard how many people were marked with the sign. There were one hundred forty-four thousand from every tribe of the people of Israel."},{"header":"The Great Crowd Worships God"},{"num":9,"verse":"After the vision of these things I looked, and there was a great number of people, so many that no one could count them. They were from every nation, tribe, people, and language of the earth. They were all standing before the throne and before the Lamb, wearing white robes and holding palm branches in their hands. "},{"num":10,"verse":"They were shouting in a loud voice, “Salvation belongs to our God, who sits on the throne, and to the Lamb.” "},{"num":11,"verse":"All the angels were standing around the throne and the elders and the four living creatures. They all bowed down on their faces before the throne and worshiped God, "},{"num":12,"verse":"saying, “Amen! Praise, glory, wisdom, thanks, honor, power, and strength belong to our God forever and ever. Amen!”"},{"num":13,"verse":"Then one of the elders asked me, “Who are these people dressed in white robes? Where did they come from?”"},{"num":14,"verse":"I answered, “You know, sir.”"},{"num":15,"verse":"Because of this, they are before the throne of God. They worship him day and night in his temple. And the One who sits on the throne will be present with them. "},{"num":16,"verse":"Those people will never be hungry again, and they will never be thirsty again. The sun will not hurt them, and no heat will burn them, "},{"num":17,"verse":"because the Lamb at the center of the throne will be their shepherd. He will lead them to springs of water that give life. And God will wipe away every tear from their eyes.”"}]