[{"num":7,"verse":"And after that, I saw four angels stand on the four corners of the earth, holding the four winds of the earth so that the winds would not blow on the land, nor on the sea, nor on any tree.  "},{"num":2,"verse":"And I saw another angel ascend from the rising of the sun, who had the seal of the living God, and he cried with a loud voice to the four angels (to whom power was given to hurt the land and the sea), "},{"num":3,"verse":"saying, Do not hurt the land, nor the sea, nor the trees, till we have sealed the servants of our God in their foreheads."},{"num":4,"verse":"And I heard the number of those who were sealed, and there were sealed 144,000 of all the tribes of the children of Israel. "},{"num":5,"verse":"Of the tribe of Judah were sealed twelve thousand. Of the tribe of Reuben were sealed twelve thousand. Of the tribe of Gad were sealed twelve thousand. "},{"num":6,"verse":"Of the tribe of Asher were sealed twelve thousand. Of the tribe of Naphtali were sealed twelve thousand. Of the tribe of Manasseh were sealed twelve thousand. "},{"num":7,"verse":"Of the tribe of Simeon were sealed twelve thousand. Of the tribe of Levi were sealed twelve thousand. Of the tribe of Issachar were sealed twelve thousand. "},{"num":8,"verse":"Of the tribe of Zebulun were sealed twelve thousand. Of the tribe of Joseph were sealed twelve thousand. Of the tribe of Benjamin were sealed twelve thousand."},{"num":9,"verse":"After this I looked, and lo, a great multitude which no man could number of all nations and people and tongues stood before the seat and before the Lamb, clothed with long white garments and palms in their hands, "},{"num":10,"verse":"and cried out with a loud voice, saying, Salvation be ascribed to him who sits upon the seat of our God and to the Lamb! "},{"num":11,"verse":"And all the angels stood round about the seat, and about the elders and the four living creatures, and fell before the seat on their faces, and worshipped God, "},{"num":12,"verse":"saying, Amen! Blessing and glory, wisdom and thanks, and honour, and power, and might, be to our God forevermore. Amen."},{"num":13,"verse":"And one of the elders spoke, saying to me, Who are these who are arrayed in long white garments, and where are they from? "},{"num":14,"verse":"And I said to him, Lord, you know. And he said to me, They are those who came out of great tribulation, and made their garments large, and made them white in the blood of the Lamb. "},{"num":15,"verse":"Therefore they are in the presence of the seat of God, and serve him day and night in his temple. And he who sits in the seat will dwell among them. "},{"num":16,"verse":"They will hunger no more, neither thirst; nor will the sun light on them, nor any heat. "},{"num":17,"verse":"For the Lamb who is at the centre of the seat shall feed them, and shall lead them to fountains of living water, and God shall wipe away all tears from their eyes."}]