[[],[{"type":"header","content":"God’s Covenant with David"},{"type":"prose","content":"As David sat in his house (palace), he said to Nathan the prophet, “Behold, I live in a house of cedars, while the ark of the covenant of the  is under tent curtains.” "}],[{"type":"prose","content":"Then Nathan said to David, “Do all that is in your heart, for God is with you.”"}],[{"type":"prose","content":"But it came about that same night that the word of God came to Nathan, saying, "}],[{"type":"prose","content":"“Go and tell David My servant, ‘Thus says the , “You shall not build a house for Me to dwell in; "}],[{"type":"prose","content":"for I have not dwelt in a house since the day that I brought Israel up [from Egypt] until this day, but I have gone from tent to tent and from  dwelling place . "}],[{"type":"prose","content":"Wherever I have walked with all Israel, did I say a word to any of the judges of Israel, whom I commanded to shepherd My people, saying, ‘Why have you not built for Me a house of cedar?’”’ "}],[{"type":"prose","content":"Now, therefore, this is what you shall say to My servant David: ‘Thus says the  of hosts, “I took you from the pasture, from following the sheep, to be leader over My people Israel. "}],[{"type":"prose","content":"I have been with you wherever you have gone, and I have cut off all your enemies from before you; and I will make your name like the name of the great ones of the earth. "}],[{"type":"prose","content":"I will appoint a place for My people Israel, and will plant them, so that they may live in their own place and not be moved again [nor tremble with fear]; and the wicked will not waste (persecute) them anymore, as formerly, "}],[{"type":"prose","content":"since the time that I commanded judges to be over My people Israel. And I will humble  subdue all your enemies.“Furthermore, I tell you that the  will build you a house (a blessed posterity). "}],[{"type":"prose","content":"And it shall come to pass that when your days are completed and you must go to be with your fathers [in death], I will raise up  your descendants after you, one of your own sons; and I will establish his kingdom. "}],[{"type":"prose","content":"He shall build Me a house, and I will establish his throne forever. "}],[{"type":"prose","content":"I will be his father and he shall be My son; and I will not take My steadfast love  mercy away from him, as I took it from him (King Saul) who was before you. "}],[{"type":"prose","content":"But I will settle him in My house and in My kingdom forever, and his throne shall be established forevermore.”’” "}],[{"type":"prose","content":"According to all these words and according to all this vision, so Nathan spoke to David."},{"type":"header","content":"David’s Prayer in Response"}],[{"type":"prose","content":"Then David the king went in and sat before the  and said, “Who am I, O  God, and what is my house  family that You have brought me this far? "}],[{"type":"prose","content":"This was a small thing in Your eyes, O God; but You have spoken of Your servant’s house for a great while to come, and have regarded me according to the standard  estate of a man of high degree (prominence), O  God. "}],[{"type":"prose","content":"What more can David say to You for the honor  Your servant? For You know Your servant. "}],[{"type":"prose","content":"O , for Your servant’s sake, and in accordance with Your own heart, You have accomplished all this greatness, to make known all these great things. "}],[{"type":"prose","content":"O , there is no one like You, nor is there any God except You, according to all that we have heard with our ears. "}],[{"type":"prose","content":"And what one nation on the earth is like Your people Israel, whom God went to redeem for Himself as a people, to make a name for Yourself by great and awesome  terrible things, by driving out nations from before Your people, whom You redeemed out of Egypt? "}],[{"type":"prose","content":"You made Your people Israel Your own people forever, and You, , became their God."}],[{"type":"prose","content":"“Therefore now, O , let the word which You have spoken concerning Your servant and his house endure forever, and do as You have said. "}],[{"type":"prose","content":"Let Your name [and the character that it denotes] endure and be magnified forever, saying, ‘The  of hosts is the God of Israel, yes, a God to Israel; and the house of Your servant David is established before You.’ "}],[{"type":"prose","content":"For You, O my God, have revealed to Your servant that You will build for him a house (descendants); therefore Your servant has found  to pray before You. "}],[{"type":"prose","content":"And now, O , You are God, and you have spoken  promised this good thing to Your servant. "}],[{"type":"prose","content":"Therefore may it please You to bless the house (descendants) of Your servant, that it may continue before You forever; for what You bless, O , is blessed forever.”"}]]