[{"header":"God’s Promise to David"},{"num":17,"verse":"When David moved into his palace, he said to Nathan the prophet, “Look, I am living in a palace made of cedar, but the Ark of the Agreement with the Lord sits in a tent.”"},{"num":2,"verse":"Nathan said to David, “Do what you want to do, because God is with you.”"},{"num":3,"verse":"But that night God spoke his word to Nathan, saying, "},{"num":4,"verse":"“Go and tell David my servant, ‘This is what the Lord says: You are not the person to build a house for me to live in. "},{"num":5,"verse":"From the time I brought Israel out of Egypt until now I have not lived in a house. I have moved from one tent site to another and from one place to another. "},{"num":6,"verse":"As I have moved with the Israelites to different places, I have never said to the leaders, whom I commanded to take care of my people, “Why haven’t you built me a house of cedar?”’"},{"num":7,"verse":"“Now, tell my servant David: ‘This is what the Lord All-Powerful says: I took you from the pasture and from tending the sheep and made you king of my people Israel. "},{"num":8,"verse":"I have been with you everywhere you have gone. I have defeated your enemies for you. I will make you as famous as any of the great people on the earth. "},{"num":9,"verse":"I will choose a place for my people Israel, and I will plant them so they can live in their own homes. They will not be bothered anymore. Wicked people will no longer hurt them as they have in the past "},{"num":10,"verse":"when I chose judges for my people Israel. I will defeat all your enemies."},{"num":11,"verse":"When you die and join your ancestors, I will make one of your sons the new king, and I will set up his kingdom. "},{"num":12,"verse":"He will build a house for me, and I will let his kingdom rule always. "},{"num":13,"verse":"I will be his father, and he will be my son. I took away my love from Saul, who ruled before you, but I will never stop loving your son. "},{"num":14,"verse":"I will put him in charge of my house and kingdom forever. His family will rule forever.’”"},{"num":15,"verse":"Nathan told David everything God had said in this vision."},{"header":"David Prays to God"},{"num":16,"verse":"Then King David went in and sat in front of the Lord. David said, “Lord God, who am I? What is my family? Why did you bring me to this point? "},{"num":17,"verse":"But that was not enough for you, God. You have also made promises about my future family. Lord God, you have treated me like a very important person."},{"num":18,"verse":"“What more can I say to you for honoring me, your servant? You know me so well. "},{"num":19,"verse":"Lord, you have done this wonderful thing for my sake and because you wanted to. You have made known all these great things."},{"num":20,"verse":"“There is no one like you, Lord. There is no God except you. We have heard all this ourselves! "},{"num":21,"verse":"There is no nation like your people Israel. They are the only people on earth that God chose to be his own. You made your name well known by the great and wonderful things you did for them. You went ahead of them and forced other nations out of the land. You freed your people from slavery in Egypt. "},{"num":22,"verse":"You made the people of Israel your very own people forever, and, Lord, you are their God."},{"num":23,"verse":"“Lord, keep the promise forever that you made about my family and me, your servant. Do what you have said. "},{"num":24,"verse":"Then you will be honored always, and people will say, ‘The Lord All-Powerful, the God over Israel, is Israel’s God!’ And the family of your servant David will continue before you."},{"num":25,"verse":"“My God, you have told me that you would make my family great. So I, your servant, am brave enough to pray to you. "},{"num":26,"verse":"Lord, you are God, and you have promised these good things to me, your servant. "},{"num":27,"verse":"You have chosen to bless my family. Let it continue before you always. Lord, you have blessed my family, so it will always be blessed.”"}]