[{"header":"David’s Wish to Build a House for God(A)"},{"num":17,"verse":"When David was living in his house, he said to the prophet Nathan, “I’m living in a house made of cedar, while the ark of Yahweh’s promise is inside a tent.”"},{"num":2,"verse":"Nathan told David, “Do everything you have in mind, because Elohim is with you.”"},{"num":3,"verse":"But that same night Elohim spoke his word to Nathan: "},{"num":4,"verse":"“Say to David, my servant, ‘This is what Yahweh says: You must not build this house for me to live in. "},{"num":5,"verse":"I haven’t lived in a house from the day I brought Israel out of Egypt to this day, but I’ve gone from tent site to tent site, moving the tent of meeting from one location to another. "},{"num":6,"verse":"In all the places I’ve moved with all Israel, did I ever ask any of the judges of Israel whom I ordered to be shepherds of my people why they didn’t build me a house of cedar?’"},{"num":7,"verse":"“Now this is what you will say to my servant David: ‘This is what Yahweh Tsebaoth says: I took you from the pasture where you followed sheep so that you could be the leader of my people Israel. "},{"num":8,"verse":"I was with you wherever you went, and I destroyed all your enemies in front of you. I will make your name like the names of the greatest people on earth. "},{"num":9,"verse":"I will make a place for my people Israel and plant them there. They will live in their own place and not be troubled anymore. The wicked will no longer frighten them as they used to do "},{"num":10,"verse":"ever since I appointed judges to rule my people Israel. I will crush all your enemies. I even tell you that I, Yahweh, will build a house for you."},{"num":11,"verse":"“‘When the time comes for you to go and be with your ancestors, I will send one of your descendants. He will be one of your sons. I will establish his kingdom. "},{"num":12,"verse":"He will build a house for me, and I will establish his throne forever. "},{"num":13,"verse":"I will be his Ab, and he will be my Son. And I will never stop showing him my love as I did to your predecessor. "},{"num":14,"verse":"I will place him in my royal house forever, and his throne will be established forever.’”"},{"num":15,"verse":"Nathan told David all these words and everything he had seen."},{"num":16,"verse":"Then King David went into the tent and sat in front of Yahweh. “Who am I, Yahweh Elohim,” he asked, “and why is my house so important that you have brought me this far? "},{"num":17,"verse":"And this you consider to be a small act, Elohim. You’ve spoken about the distant future of my house. Yahweh Elohim, you’ve shown me the generation of the great man."},{"num":18,"verse":"“What more can I do for you in light of the honor you have given to me and since you know me so well! "},{"num":19,"verse":"Yahweh, you’ve done this great thing for my sake and your own desire. You made this great thing known to me."},{"num":20,"verse":"“Yahweh, there is no one like you, and there is no other god except you, as we have heard with our own ears. "},{"num":21,"verse":"Who is like your people Israel? It is the one nation on earth that Elohim came to free in order to make its people his own, to make your name known, and to do great and wonderful things for them. You forced the nations and their gods out of the way of your people, whom you freed from Egypt. "},{"num":22,"verse":"You made the people of Israel to be your people forever. And you, Yahweh, became their Elohim."},{"num":23,"verse":"“Now, Yahweh, faithfully keep the promise you made to me and my house forever. Do as you promised. "},{"num":24,"verse":"Your name will endure and be respected forever when people say, ‘Yahweh Tsebaoth, the Elohim of Israel, is Israel’s Elohim.’ And the house of David, your servant, will be established in your presence. "},{"num":25,"verse":"You, my Elohim, have revealed especially to me that you will build me a house. That is why I have found the courage to pray to you."},{"num":26,"verse":"“Yahweh, you are Elohim. You promised me this good thing. "},{"num":27,"verse":"Now, you were pleased to bless my house so that it may continue in your presence forever. Indeed, you, Yahweh, have blessed it. It will be blessed forever.”"}]