[{"num":31,"verse":"2 A comparison of the prosperity of Pharaoh with the prosperity of the Assyrians. 10 He prophesieth a like destruction to them both."},{"num":1,"verse":"And in the eleventh year, in the third month, and in the first day of the month the word of the Lord came unto me, saying,"},{"num":2,"verse":"Son of man, speak unto Pharaoh king of Egypt, and to his multitude, Whom art thou like in thy greatness?"},{"num":3,"verse":"Behold, Assyria was like a cedar in Lebanon with fair branches, and with thick shadowing boughs, and shot up very high, and his top was among the thick boughs."},{"num":4,"verse":"The waters nourished him, and the deep exalted him on high with her rivers running round about his plants, and sent out her little rivers unto all the trees of the field."},{"num":5,"verse":"Therefore his height was exalted above all the trees of the field, and his boughs were multiplied, and his branches were long, because of the multitude of the waters, which the deep sent out."},{"num":6,"verse":"All the fowls of the heavens made their nests in his boughs, and under his branches did all the beasts of the field bring forth their young, and under his shadow dwelt all mighty nations."},{"num":7,"verse":"Thus was he fair in his greatness, and in the length of his branches: for his root was near great waters."},{"num":8,"verse":"The cedars in the garden of God could not hide him: no fir tree was like his branches: and the chestnut trees were not like his boughs: all the trees in the garden of God were not like unto him in his beauty."},{"num":9,"verse":"I made him fair by the multitude of his branches: so that all the trees of Eden, that were in the garden of God, envied him."},{"num":10,"verse":"Therefore thus saith the Lord God, Because he is lifted up on high, and hath shot up his top among the thick boughs, and his heart is lifted up in his height,"},{"num":11,"verse":"I have therefore delivered him into the hands of the mightiest among the heathen: he shall handle him, for I have cast him away for his wickedness."},{"num":12,"verse":"And the strangers have destroyed him, even the terrible nations, and they have left him upon the mountains, and in all the valleys his branches are fallen, and his boughs are broken by all the rivers of the land: and all the people of the earth are departed from his shadow, and have forsaken him."},{"num":13,"verse":"Upon his ruin shall all the fowls of the heaven remain, and all the beasts of the field shall be upon his branches,"},{"num":14,"verse":"So that none of all the trees by the waters shall be exalted by their height, neither shall shoot up their top among the thick boughs, neither shall their leaves stand up in their height, which drink so much water: for they are all delivered unto death in the nether parts of the earth in the midst of the children of men among them that go down to the pit."},{"num":15,"verse":"Thus saith the Lord God, In the day when he went down to hell, I caused them to mourn, and I covered the deep for him, and I did restrain the floods thereof, and the great waters were stayed: I caused Lebanon to mourn for him, and all the trees of the field fainted."},{"num":16,"verse":"I made the nations to shake at the sound of his fall, when I cast him down to hell, with them that descend into the pit, and all the excellent trees of Eden, and the best of Lebanon: even all that are nourished with waters, shall be comforted in the nether parts of the earth."},{"num":17,"verse":"They also went down to hell with him unto them that were slain with the sword, and his arm, and they that dwelt under his shadow in the midst of the heathen."},{"num":18,"verse":"To whom art thou thus like in glory and in greatness among the trees of Eden? yet thou shalt be cast down with the trees of Eden unto the nether parts of the earth: thou shalt sleep in the midst of the uncircumcised, with them that be slain by the sword: this is Pharaoh and all his multitude, saith the Lord God."}]