[[],[{"type":"header","content":"The Lofty Cedar"},{"type":"prose","content":"In the eleventh year, in the third month, on the first day of the month, the word of the LORD came to me: "}],[{"type":"prose","content":"Mortal, say to Pharaoh king of Egypt and to his hordes:"},{"type":"poetry","content":"Whom are you like in your greatness?"},{"type":"poetry","content":"with fair branches and forest shade,"}],[{"type":"poetry","content":"The waters nourished it,"},{"type":"poetry","content":"making its rivers flow"},{"type":"poetry","content":"sending forth its streams"}],[{"type":"poetry","content":"So it towered high"},{"type":"poetry","content":"its boughs grew large"}],[{"type":"poetry","content":"All the birds of the air"},{"type":"poetry","content":"under its branches all the animals of the field"},{"type":"poetry","content":"and in its shade"}],[{"type":"poetry","content":"It was beautiful in its greatness,"},{"type":"poetry","content":"for its roots went down"}],[{"type":"poetry","content":"The cedars in the garden of God could not rival it,"},{"type":"poetry","content":"the plane trees were as nothing"},{"type":"poetry","content":"no tree in the garden of God"}],[{"type":"poetry","content":"I made it beautiful"},{"type":"poetry","content":"the envy of all the trees of Eden"}],[{"type":"prose","content":"Therefore thus says the Lord GOD: Because it towered high and set its top among the clouds, and its heart was proud of its height, "}],[{"type":"prose","content":"I gave it into the hand of the prince of the nations; he has dealt with it as its wickedness deserves. I have cast it out. "}],[{"type":"prose","content":"Foreigners from the most terrible of the nations have cut it down and left it. On the mountains and in all the valleys its branches have fallen, and its boughs lie broken in all the watercourses of the land; and all the peoples of the earth went away from its shade and left it."}],[{"type":"poetry","content":"On its fallen trunk settle"},{"type":"poetry","content":"and among its boughs lodge"}],[{"type":"prose","content":"All this is in order that no trees by the waters may grow to lofty height or set their tops among the clouds, and that no trees that drink water may reach up to them in height."},{"type":"poetry","content":"For all of them are handed over to death,"},{"type":"poetry","content":"along with all mortals,"}],[{"type":"prose","content":"Thus says the Lord GOD: On the day it went down to Sheol I closed the deep over it and covered it; I restrained its rivers, and its mighty waters were checked. I clothed Lebanon in gloom for it, and all the trees of the field fainted because of it. "}],[{"type":"prose","content":"I made the nations quake at the sound of its fall, when I cast it down to Sheol with those who go down to the Pit; and all the trees of Eden, the choice and best of Lebanon, all that were well watered, were consoled in the world below. "}],[{"type":"prose","content":"They also went down to Sheol with it, to those killed by the sword, along with its allies, those who lived in its shade among the nations."}],[{"type":"prose","content":"Which among the trees of Eden was like you in glory and in greatness? Now you shall be brought down with the trees of Eden to the world below; you shall lie among the uncircumcised, with those who are killed by the sword. This is Pharaoh and all his horde, says the Lord GOD."}]]