[{"header":"Paul’s voyage to Rome"},{"num":27,"verse":"When it was determined that we were to sail to Italy, Paul and some other prisoners were placed in the custody of a centurion named Julius of the Imperial Company."},{"num":2,"verse":"We boarded a ship from Adramyttium that was about to sail for ports along the coast of the province of Asia. So we put out to sea. Aristarchus, a Macedonian from Thessalonica, came with us."},{"num":3,"verse":"The next day we landed in Sidon. Julius treated Paul kindly and permitted him to go to some friends so they could take care of him."},{"num":4,"verse":"From there we sailed off. We passed Cyprus, using the island to shelter us from the headwinds."},{"num":5,"verse":"We sailed across the open sea off the coast of Cilicia and Pamphylia, and landed in Myra in Lycia."},{"num":6,"verse":"There the centurion found an Alexandrian ship headed for Italy and put us on board."},{"num":7,"verse":"After many days of slow and difficult sailing, we arrived off the coast of Cnidus. The wind wouldn’t allow us to go farther, so we sailed under the shelter of Crete off Salmone."},{"num":8,"verse":"We sailed along the coast only with difficulty until we came to a place called Good Harbors, near the city of Lasea."},{"num":9,"verse":"Much time had been lost, and the voyage was now dangerous since the Day of Reconciliation had already passed. Paul warned them,"},{"num":10,"verse":"“Men, I see that our voyage will suffer damage and great loss, not only for the cargo and ship but also for our lives.”"},{"num":11,"verse":"But the centurion was persuaded more by the ship’s pilot and captain than by Paul’s advice."},{"num":12,"verse":"Since the harbor was unsuitable for spending the winter, the majority supported a plan to put out to sea from there. They thought they might reach Phoenix in Crete and spend the winter in its harbor, which faced southwest and northwest."},{"num":13,"verse":"When a gentle south wind began to blow, they thought they could carry out their plan. They pulled up anchor and sailed closely along the coast of Crete."},{"num":14,"verse":"Before long, a hurricane-strength wind known as a northeaster swept down from Crete."},{"num":15,"verse":"The ship was caught in the storm and couldn’t be turned into the wind. So we gave in to it, and it carried us along."},{"num":16,"verse":"After sailing under the shelter of an island called Cauda, we were able to control the lifeboat only with difficulty."},{"num":17,"verse":"They brought the lifeboat aboard, then began to wrap the ship with cables to hold it together. Fearing they might run aground on the sandbars of the Gulf of Syrtis, they lowered the anchor and let the ship be carried along."},{"num":18,"verse":"We were so battered by the violent storm that the next day the men began throwing cargo overboard."},{"num":19,"verse":"On the third day, they picked up the ship’s gear and hurled it into the sea."},{"num":20,"verse":"When neither the sun nor the moon appeared for many days and the raging storm continued to pound us, all hope of our being saved from this peril faded."},{"num":21,"verse":"For a long time no one had eaten. Paul stood up among them and said, “Men, you should have complied with my instructions not to sail from Crete. Then we would have avoided this damage and loss."},{"num":22,"verse":"Now I urge you to be encouraged. Not one of your lives will be lost, though we will lose the ship."},{"num":23,"verse":"Last night an angel from the God to whom I belong and whom I worship stood beside me."},{"num":24,"verse":"The angel said, ‘Don’t be afraid, Paul! You must stand before Caesar! Indeed, God has also graciously given you everyone sailing with you.’"},{"num":25,"verse":"Be encouraged, men! I have faith in God that it will be exactly as he told me."},{"num":26,"verse":"However, we must run aground on some island.”"},{"num":27,"verse":"On the fourteenth night, we were being carried across the Adriatic Sea. Around midnight the sailors began to suspect that land was near."},{"num":28,"verse":"They dropped a weighted line to take soundings and found the water to be about one hundred twenty feet deep. After proceeding a little farther, we took soundings again and found the water to be about ninety feet deep."},{"num":29,"verse":"Afraid that we might run aground somewhere on the rocks, they hurled out four anchors from the stern and began to pray for daylight."},{"num":30,"verse":"The sailors tried to abandon the ship by lowering the lifeboat into the sea, pretending they were going to lower anchors from the bow."},{"num":31,"verse":"Paul said to the centurion and his soldiers, “Unless they stay in the ship, you can’t be saved from peril.”"},{"num":32,"verse":"The soldiers then cut the ropes to the lifeboat and let it drift away."},{"num":33,"verse":"Just before daybreak, Paul urged everyone to eat. He said, “This is the fourteenth day you’ve lived in suspense, and you’ve not had even a bite to eat."},{"num":34,"verse":"I urge you to take some food. Your health depends on it. None of you will lose a single hair from his head.”"},{"num":35,"verse":"After he said these things, he took bread, gave thanks to God in front of them all, then broke it and began to eat."},{"num":36,"verse":"Everyone was encouraged and took some food."},{"num":37,"verse":"(In all, there were two hundred seventy-six of us on the ship.)"},{"num":38,"verse":"When they had eaten as much as they wanted, they lightened the ship by throwing the grain into the sea."},{"num":39,"verse":"In the morning light they saw a bay with a sandy beach. They didn’t know what land it was, but they thought they might possibly be able to run the ship aground."},{"num":40,"verse":"They cut the anchors loose and left them in the sea. At the same time, they untied the ropes that ran back to the rudders. They raised the foresail to catch the wind and made for the beach."},{"num":41,"verse":"But they struck a sandbar and the ship ran aground. The bow was stuck and wouldn’t move, and the stern was broken into pieces by the force of the waves."},{"num":42,"verse":"The soldiers decided to kill the prisoners to keep them from swimming to shore and escaping."},{"num":43,"verse":"However, the centurion wanted to save Paul, so he stopped them from carrying out their plan. He ordered those who could swim to jump overboard first and head for land."},{"num":44,"verse":"He ordered the rest to grab hold of planks or debris from the ship. In this way, everyone reached land safely."}]