[{"header":"Paul Sails for Rome"},{"num":27,"verse":"When it was decided that we should sail to Italy, Paul and some other prisoners were turned over to an army officer. His name was Julius, and he belonged to the emperor’s division. "},{"num":2,"verse":"We set sail on a ship from the city of Adramyttium. The ship was going to stop at ports on the coast of the province of Asia. Aristarchus, a Macedonian from the city of Thessalonica, went with us."},{"num":3,"verse":"The next day we arrived at the city of Sidon. Julius treated Paul kindly and allowed him to visit his friends and receive any care he needed. "},{"num":4,"verse":"Leaving Sidon, we sailed on the northern side of the island of Cyprus because we were traveling against the wind. "},{"num":5,"verse":"We sailed along the coast of the provinces of Cilicia and Pamphylia and arrived at the city of Myra in the province of Lycia. "},{"num":6,"verse":"In Myra the officer found a ship from Alexandria that was on its way to Italy and put us on it. "},{"num":7,"verse":"We were sailing slowly for a number of days. Our difficulties began along the coast of the city of Cnidus because the wind would not let us go further. So at Cape Salmone, we started to sail for the south side of the island of Crete. "},{"num":8,"verse":"We had difficulty sailing along the shore of Crete. We finally came to a port called Fair Harbors. The port was near the city of Lasea."},{"num":9,"verse":"We had lost so much time that the day of fasting had already past. Sailing was now dangerous, so Paul advised them, "},{"num":10,"verse":"“Men, we’re going to face a disaster and heavy losses on this voyage. This disaster will cause damage to the cargo and the ship, and it will affect our lives.” "},{"num":11,"verse":"However, the officer was persuaded by what the pilot and the owner of the ship said and not by what Paul said. "},{"num":12,"verse":"Since the harbor was not a good place to spend the winter, most of the men decided to sail from there. They hoped to reach the city of Phoenix somehow and spend the winter there. (Phoenix is a harbor that faces the southwest and northwest winds and is located on the island of Crete.)"},{"num":13,"verse":"When a gentle breeze began to blow from the south, the men thought their plan would work. They raised the anchor and sailed close to the shore of Crete."},{"num":14,"verse":"Soon a powerful wind (called a northeaster) blew from the island. "},{"num":15,"verse":"The wind carried the ship away, and we couldn’t sail against the wind. We couldn’t do anything, so we were carried along by the wind. "},{"num":16,"verse":"As we drifted to the sheltered side of a small island called Cauda, we barely got control of the ship’s lifeboat. "},{"num":17,"verse":"The men pulled it up on deck. Then they passed ropes under the ship to reinforce it. Fearing that they would hit the large sandbank off the shores of Libya, they lowered the sail and were carried along by the wind. "},{"num":18,"verse":"We continued to be tossed so violently by the storm that the next day the men began to throw the cargo overboard. "},{"num":19,"verse":"On the third day they threw the ship’s equipment overboard. "},{"num":20,"verse":"For a number of days we couldn’t see the sun or the stars. The storm wouldn’t let up. It was so severe that we finally began to lose any hope of coming out of it alive."},{"num":21,"verse":"Since hardly anyone wanted to eat, Paul stood among them and said, “Men, you should have followed my advice not to sail from Crete. You would have avoided this disaster and loss. "},{"num":22,"verse":"Now I advise you to have courage. No one will lose his life. Only the ship will be destroyed. "},{"num":23,"verse":"I know this because an angel from the God to whom I belong and whom I serve stood by me last night. "},{"num":24,"verse":"The angel told me, ‘Don’t be afraid, Paul! You must present your case to the emperor. God has granted safety to everyone who is sailing with you.’ "},{"num":25,"verse":"So have courage, men! I trust God that everything will turn out as he told me. "},{"num":26,"verse":"However, we will run aground on some island.”"},{"header":"The Shipwreck"},{"num":27,"verse":"On the fourteenth night we were still drifting through the Mediterranean Sea. About midnight the sailors suspected that we were approaching land. "},{"num":28,"verse":"So they threw a line with a weight on it into the water. It sank 120 feet. They waited a little while and did the same thing again. This time the line sank 90 feet. "},{"num":29,"verse":"Fearing we might hit rocks, they dropped four anchors from the back of the ship and prayed for morning to come."},{"num":30,"verse":"The sailors tried to escape from the ship. They let the lifeboat down into the sea and pretended they were going to lay out the anchors from the front of the ship. "},{"num":31,"verse":"Paul told the officer and the soldiers, “If these sailors don’t stay on the ship, you have no hope of staying alive.” "},{"num":32,"verse":"Then the soldiers cut the ropes that held the lifeboat and let it drift away."},{"num":33,"verse":"Just before daybreak Paul was encouraging everyone to have something to eat. “This is the fourteenth day you have waited and have had nothing to eat. "},{"num":34,"verse":"So I’m encouraging you to eat something. Eating will help you survive, since not a hair from anyone’s head will be lost.” "},{"num":35,"verse":"After Paul said this, he took some bread, thanked God in front of everyone, broke it, and began to eat. "},{"num":36,"verse":"Everyone was encouraged and had something to eat. "},{"num":37,"verse":"(There were 276 of us on the ship.) "},{"num":38,"verse":"After the people had eaten all they wanted, they lightened the ship by dumping the wheat into the sea."},{"num":39,"verse":"In the morning they couldn’t recognize the land, but they could see a bay with a beach. So they decided to try to run the ship ashore. "},{"num":40,"verse":"They cut the anchors free and left them in the sea. At the same time they untied the ropes that held the steering oars. Then they raised the top sail to catch the wind and steered the ship to the shore. "},{"num":41,"verse":"They struck a sandbar in the water and ran the ship aground. The front of the ship stuck and couldn’t be moved, while the back of the ship was broken to pieces by the force of the waves."},{"num":42,"verse":"The soldiers had a plan to kill the prisoners to keep them from swimming away and escaping. "},{"num":43,"verse":"However, the officer wanted to save Paul, so he stopped the soldiers from carrying out their plan. He ordered those who could swim to jump overboard first and swim ashore. "},{"num":44,"verse":"Then he ordered the rest to follow on planks or some other pieces ⌞of wood⌟ from the ship. In this way everyone got to shore safely."}]