[{"header":"Chapter 27"},{"num":1,"verse":"Departure for Rome. When it was decided that we should sail to Italy, they handed Paul and some other prisoners over to a centurion named Julius of the Cohort Augusta. "},{"num":2,"verse":"We went on board a ship from Adramyttium bound for ports in the province of Asia and set sail. Aristarchus, a Macedonian from Thessalonica, was with us. "},{"num":3,"verse":"On the following day we put in at Sidon where Julius was kind enough to allow Paul to visit his friends who took care of him. "},{"num":4,"verse":"From there we put out to sea and sailed around the sheltered side of Cyprus because of the headwinds, "},{"num":5,"verse":"and crossing the open sea off the coast of Cilicia and Pamphylia we came to Myra in Lycia."},{"num":6,"verse":"Storm and Shipwreck. There the centurion found an Alexandrian ship that was sailing to Italy and put us on board. "},{"num":7,"verse":"For many days we made little headway, arriving at Cnidus only with difficulty, and because the wind would not permit us to continue our course we sailed for the sheltered side of Crete off Salmone. "},{"num":8,"verse":"We sailed past it with difficulty and reached a place called Fair Havens, near which was the city of Lasea."},{"num":9,"verse":"Much time had now passed and sailing had become hazardous because the time of the fast had already gone by, so Paul warned them, "},{"num":10,"verse":"“Men, I can see that this voyage will result in severe damage and heavy loss not only to the cargo and the ship, but also to our lives.” "},{"num":11,"verse":"The centurion, however, paid more attention to the pilot and to the owner of the ship than to what Paul said. "},{"num":12,"verse":"Since the harbor was unfavorably situated for spending the winter, the majority planned to put out to sea from there in the hope of reaching Phoenix, a port in Crete facing west-northwest, there to spend the winter."},{"num":13,"verse":"A south wind blew gently, and thinking they had attained their objective, they weighed anchor and sailed along close to the coast of Crete. "},{"num":14,"verse":"Before long an offshore wind of hurricane force called a “Northeaster” struck. "},{"num":15,"verse":"Since the ship was caught up in it and could not head into the wind we gave way and let ourselves be driven. "},{"num":16,"verse":"We passed along the sheltered side of an island named Cauda and managed only with difficulty to get the dinghy under control. "},{"num":17,"verse":"They hoisted it aboard, then used cables to undergird the ship. Because of their fear that they would run aground on the shoal of Syrtis, they lowered the drift anchor and were carried along in this way. "},{"num":18,"verse":"We were being pounded by the storm so violently that the next day they jettisoned some cargo, "},{"num":19,"verse":"and on the third day with their own hands they threw even the ship’s tackle overboard. "},{"num":20,"verse":"Neither the sun nor the stars were visible for many days, and no small storm raged. Finally, all hope of our surviving was taken away."},{"num":21,"verse":"When many would no longer eat, Paul stood among them and said, “Men, you should have taken my advice and not have set sail from Crete and you would have avoided this disastrous loss. "},{"num":22,"verse":"I urge you now to keep up your courage; not one of you will be lost, only the ship. "},{"num":23,"verse":"For last night an angel of the God to whom [I] belong and whom I serve stood by me "},{"num":24,"verse":"and said, ‘Do not be afraid, Paul. You are destined to stand before Caesar; and behold, for your sake, God has granted safety to all who are sailing with you.’ "},{"num":25,"verse":"Therefore, keep up your courage, men; I trust in God that it will turn out as I have been told. "},{"num":26,"verse":"We are destined to run aground on some island.”"},{"num":27,"verse":"On the fourteenth night, as we were still being driven about on the Adriatic Sea, toward midnight the sailors began to suspect that they were nearing land. "},{"num":28,"verse":"They took soundings and found twenty fathoms; a little farther on, they again took soundings and found fifteen fathoms. "},{"num":29,"verse":"Fearing that we would run aground on a rocky coast, they dropped four anchors from the stern and prayed for day to come. "},{"num":30,"verse":"The sailors then tried to abandon ship; they lowered the dinghy to the sea on the pretext of going to lay out anchors from the bow. "},{"num":31,"verse":"But Paul said to the centurion and the soldiers, “Unless these men stay with the ship, you cannot be saved.” "},{"num":32,"verse":"So the soldiers cut the ropes of the dinghy and set it adrift."},{"num":33,"verse":"Until the day began to dawn, Paul kept urging all to take some food. He said, “Today is the fourteenth day that you have been waiting, going hungry and eating nothing. "},{"num":34,"verse":"I urge you, therefore, to take some food; it will help you survive. Not a hair of the head of anyone of you will be lost.” "},{"num":35,"verse":"When he said this, he took bread, gave thanks to God in front of them all, broke it, and began to eat. "},{"num":36,"verse":"They were all encouraged, and took some food themselves. "},{"num":37,"verse":"In all, there were two hundred seventy-six of us on the ship. "},{"num":38,"verse":"After they had eaten enough, they lightened the ship by throwing the wheat into the sea."},{"num":39,"verse":"When day came they did not recognize the land, but made out a bay with a beach. They planned to run the ship ashore on it, if they could. "},{"num":40,"verse":"So they cast off the anchors and abandoned them to the sea, and at the same time they unfastened the lines of the rudders, and hoisting the foresail into the wind, they made for the beach. "},{"num":41,"verse":"But they struck a sandbar and ran the ship aground. The bow was wedged in and could not be moved, but the stern began to break up under the pounding [of the waves]. "},{"num":42,"verse":"The soldiers planned to kill the prisoners so that none might swim away and escape, "},{"num":43,"verse":"but the centurion wanted to save Paul and so kept them from carrying out their plan. He ordered those who could swim to jump overboard first and get to the shore, "},{"num":44,"verse":"and then the rest, some on planks, others on debris from the ship. In this way, all reached shore safely."}]