[{"num":27,"verse":"Now when it was decided that we should sail into Italy, they delivered Paul and some other prisoners to a Centurion from the band of Augustus named Julius."},{"num":2,"verse":"And we boarded a ship of Adramyttium, intending to sail along the coasts of Asia, and launched forth, and had Aristarchus of Macedonia (a Thessalonian) with us."},{"num":3,"verse":"And the next day we arrived at Sidon. And Julius treated Paul kindly and gave him liberty to go to his friends, so that they might refresh him."},{"num":4,"verse":"And from there we launched, and sailed to the leeward side of Cyprus, because the winds were contrary."},{"num":5,"verse":"Then we sailed over the sea, by Cilicia and Pamphilia, and came to Myra, in Lycia."},{"num":6,"verse":"And the Centurion found a ship of Alexandria there, sailing into Italy. And he put us in it."},{"num":7,"verse":"And when we had sailed slowly for many days, and had arrived off Cnidus with difficulty (because the wind did not allow it), we sailed to the leeward side of Crete, near Salmone,"},{"num":8,"verse":"And with much difficulty, we sailed beyond it and came to a place called the Fair Havens (near the city, Lasea)."},{"num":9,"verse":"So, after much time had been spent, and sailing was now dangerous (and also because the Fast had now passed), Paul admonished them,"},{"num":10,"verse":"saying, “Sirs! I perceive that this voyage will cause injury, and much loss, not only of the cargo and the ship, but also of our lives.”"},{"num":11,"verse":"But the Centurion believed the governor and the master of the ship rather than those things which were spoken by Paul."},{"num":12,"verse":"And because the harbor was not suitable to winter in, many advised to depart from there, if by some means they might reach Phoenix to winter, which is a harbor of Crete, looking toward the southwest and northwest."},{"num":13,"verse":"And when the southern wind blew softly, they determined conditions were right, weighed anchor, and sailed close by Crete."},{"num":14,"verse":"But soon thereafter a stormy wind arose, called Euroclydon."},{"num":15,"verse":"And when the ship was caught, and could not resist the wind, we let her go, and were carried away."},{"num":16,"verse":"And we ran under the shelter of a little Isle named Clauda, and had much difficulty securing the skiff,"},{"num":17,"verse":"which they took up with everyone’s help. And undergirding the ship (fearing they might have fallen into Syrtis), they set sail and so were carried."},{"num":18,"verse":"The next day, when we were tossed with a strong storm, they lightened the ship."},{"num":19,"verse":"And the third day, we cast out the tackling of the ship with our own hands."},{"num":20,"verse":"And then, when neither sun nor stars appeared for many days (and no small storm was upon us), all hope that we would be saved was taken away."},{"num":21,"verse":"But after a long abstinence from food, Paul stood in the midst of them, and said, “Sirs! You should have listened to me, and not have set sail from Crete, incurring this hurt and loss."},{"num":22,"verse":"“But now, I admonish you to be of good courage! For there among you shall be no loss of anyone’s life, only of the ship."},{"num":23,"verse":"“For the Angel of God (Whose I am, and Whom I serve) stood by me this night,"},{"num":24,"verse":"Saying, ‘Fear not, Paul! For you must be brought before Caesar! And lo, all who sail with you God has given to you freely.’"},{"num":25,"verse":"“Therefore, sirs, be of good courage! For I believe God, that it shall be as it has been told to me."},{"num":26,"verse":"“However, we must be cast ashore on a certain island.”"},{"num":27,"verse":"And when the fourteenth night had come, as we were carried to and fro in the Adriatic (about midnight), the shipmen suspected that some country approached."},{"num":28,"verse":"And they sounded and found it to be twenty fathoms. And when they had gone a little further, they sounded again, and found it to be fifteen fathoms."},{"num":29,"verse":"Then, fearing they would have fallen into some rough places, they cast four anchors out of the stern, and wished for the day to come."},{"num":30,"verse":"Now as the sailors were about to escape the ship, and had let down the skiff into the sea, under a pretense of casting anchors from the bow,"},{"num":31,"verse":"Paul said to the Centurion and the soldiers, “Unless these stay in the ship, you cannot be safe!”"},{"num":32,"verse":"Then the soldiers cut off the ropes of the skiff, and let it fall away."},{"num":33,"verse":"And as the day dawned, Paul encouraged them all to eat, saying, “This is the fourteenth day that you have expectantly waited, and continued fasting, receiving nothing."},{"num":34,"verse":"“Therefore I encourage you to eat! For this is for your safety. For not a hair shall fall from the head of any of you!”"},{"num":35,"verse":"And when he had said this, he took bread (and gave thanks to God in the presence of them all), and broke it, and began to eat."},{"num":36,"verse":"Then they were all encouraged. And they also ate."},{"num":37,"verse":"Now there were altogether two hundred seventy-six souls onboard the ship."},{"num":38,"verse":"And when they had eaten enough, they lightened the ship and cast out the wheat into the sea."},{"num":39,"verse":"And when it was day, they did not recognize the country. But they spied a certain creek with a bank, into which they intended (if possible) to thrust in the ship."},{"num":40,"verse":"So when they had taken up the anchors, they committed to the sea, and released the rudder ropes, and hoisted up the mainsail to the wind, and drew to the shore."},{"num":41,"verse":"And having fallen into a place where two seas met, they thrust in the ship. And the bow stuck fast, and could not be moved. But the stern was broken with the violence of the waves."},{"num":42,"verse":"Then the soldiers planned to kill the prisoners, so that none of them could swim away and escape."},{"num":43,"verse":"But the Centurion (wanting to save Paul) stopped them from carrying out this plan, and commanded that those who could swim should cast themselves into the sea first, and get to land"},{"num":44,"verse":"(as well as the others - some on boards, and some on certain pieces of the ship). And so it happened that they all were brought safely to land."}]