[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(18) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Certain philosophers of the Epicureans, and of the Stoicks.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The two schools were at this time the great representatives of Greek thought. The former took its name from its founder, Epicurus, who lived a long and tranquil life at Athens, from B.C. 342 to 270. As holding their meetings in a garden, which he had left b",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "y",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " his will in trust as a place of study for his disciples, they were sometimes known as the School of the Garden, and as such were distinguished from those of the Porch (Diog. Laert. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Epic.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " c. 10). His speculations embraced at once a physical and an ethical solution of the problems of the universe. Rejecting, as all thinking men did, the popular Polytheism, which yet they did not dare openly to renounce, he taught that the gods, in their eternal tranquillity, were too far off from man to trouble themselves about his sorrows or his sins. They needed no sacrifices and answered no prayers. The superstition which enslaved the minds of most men was the great evil of the world, the source of its crimes and miseries. The last enemy to be destroyed was with him, as in our own time with Strauss, the belief in an immortality of retribution. A man’s first step towards happiness and wisdom was to emancipate himself from its thraldom; the next was to recognise that happiness consisted in the greatest aggregate of pleasurable emotions. Experience taught that what are called pleasures are often more than counterbalanced by the pains that follow, and sensual excesses were therefore to be avoided. Epicurus’s own life seems to have been distinguished by generosity, self-control, and general kindliness, and even by piety and patriotism (Diog. Laert. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Epic.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " c. 5). But as no law was recognised as written in the heart, and human laws were looked on as mere conventional arrangements, each man was left to form his own estimate of what would give him most pleasure, and most men decided for a life of ease and self-indulgence; sometimes balanced by prudential calculations, sometimes sinking into mere voluptuousness. The poetry of Horace presents, perhaps, the most attractive phase of popular Epicureanism; the sense which has come to be attached to the modern word “Epicure,” as applied to one whose life is devoted to the indulgence of the sense of taste, shows to what a depth of degradation it might sink.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In the world of physics, Epicurus has been claimed as anticipating some of the results of modern science. The ideas of creation and control were alike excluded. Matter had existed from eternity, and the infinite atoms of which it was composed had, under the action of attractive and Tepelling forces as yet unknown, entered into manifold combinations, out of which had issued, as the last stage of the evolution, the world of nature as it now lies before us. The poem of Lucretius, De Rerum Naturâ, may be regarded as the grandest utterance of this negative and practically atheistic system, but its real nobleness lies chiefly in its indignant protest against the superstition which had cast its veil of thick darkness over all the nations.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In the world of physics, Epicurus has been claimed as anticipating some of the results of modern science. The ideas of creation and control were alike excluded. Matter had existed from eternity, and the infinite atoms of which it was composed had, under the action of attractive and Tepelling forces as yet unknown, entered into manifold combinations, out of which had issued, as the last stage of the evolution, the world of nature as it now lies before us. The poem of Lucretius, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "De Rerum Naturâ, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "may be regarded as the grandest utterance of this negative and practically atheistic system, but its real nobleness lies chiefly in its indignant protest against the superstition which had cast its veil of thick darkness over all the nations.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "It may be well to give one or two characteristic examples of each of these phases. On the one side we have the ever-recurring advice of the popular poet of society to remember that life is short, and to make the most of it:—",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "“Quid sit futurum cras, fuge quærere: et,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Quern Fors dierum cunque dabit, lucro",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Appone.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "[“Strive not the morrow’s chance to know,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "But count whate’er the Fates bestow",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "As given thee for thy gain.”]—Hor. Od. i. 9.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "As given thee for thy gain.”]—Hor. ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Od.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " i. 9.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "“Sapias, vina liques, et spatio brevi",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Spem longam reseces. Dum loquimur, fugerit invida",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ætas. Carpe diem, quam minimum credula postero.”",
        "children": [
          {
            "element": "span",
            "class": "ital",
            "text": "Ætas.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Carpe diem, quam minimum credula postero.”",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "[“Be wise, and let your wines flow clear,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And as you greet each short-lived year,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Curb hope’s delusive play:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "E’en as we speak, our life glides by;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Enjoy the moments as they fly,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Nor trust the far-off day.”]—Od. i. 11.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The student of Scripture will recognise an Epicurean element of this kind in one of the two voices that alternate in the Book of Ecclesiastes, “It is good and comely for one to eat and to drink, and to enjoy the good of all his labour that he taketh under the sun all the days of his life” (Ecclesiastes 5:18. Comp. also Ecclesiastes 3:19; Ecclesiastes 8:15; Ecclesiastes 9:7). It appears as the avowed principle of the evil-doers in the Apocryphal Book of Wisdom which, as probably the work of a contemporary writer, represents the impression made by the dominant Horatian phase of Epicureanism on a devout and thoughtful Jew:—",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The student of Scripture will recognise an Epicurean element of this kind in one of the two voices that alternate in the Book of Ecclesiastes, “It is good and comely for one to eat and to drink, and to enjoy the good of all his labour that he taketh under the sun all the days of his life” (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ecclesiastes 5:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Comp. also ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ecclesiastes 3:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ecclesiastes 8:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ecclesiastes 9:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). It appears as the avowed principle of the evil-doers in the Apocryphal Book of Wisdom which, as probably the work of a contemporary writer, represents the impression made by the dominant Horatian phase of Epicureanism on a devout and thoughtful Jew:—",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "“Our time is a very shadow that passeth away . . . Come on, therefore, let us enjoy the good things that are present . . . Let us crown ourselves with rose-buds before they are withered . . . Let none of us go without his part of our voluptuousness.”—Wisdom Of Solomon 2:5-9.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "“Our time is a very shadow that passeth away . . . Come on, therefore, let us enjoy the good things that are present . . . Let us crown ourselves with rose-buds before they are withered . . . Let none of us go without his part of our voluptuousness.”—",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Wisdom Of Solomon 2:5-9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "There is a nobler ring, it must be owned, in the bold language in which Lucretius sings the praises of Epicurus:—",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "“When this our life lay crushed before men’s eyes",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Beneath the yoke of Faith, who from on high",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "With horrid aspect frightened mortal hearts,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "It was a Greek, himself a mortal too,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Who first had courage to lift up his eyes",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And to her face withstand her. Tales of gods,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And thunderbolts from Heaven, with all their threats,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Were impotent to stay him. . . .",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": ". . . . So at last",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Faith in its turn lies trampled under foot,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And we through him have triumphed over Heaven.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "De Rer. Nat. i. 67-80.",
        "children": [
          {
            "element": "span",
            "class": "ital",
            "text": "De Rer. Nat.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " i. 67-80.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "We can understand how St. Paul would assert, as against this school of thought, the personality of the living God, as Creator, Ruler, Father; the binding force of the law written in the heart; intuitive morality as against mere utilitarianism; the nobleness of a hero-soul raised above pleasure, and living, not for itself, but for others and for God. And in so teaching them he, in this respect differing from the mere professor of a higher philosophy, would point to the Resurrection and the Judgment as that which should confound the pleasure-seeker by giving him tribulation and anguish, and should assign glory and immortality to the patient worker of righteousness. (Comp. Romans 2:7-9.)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "We can understand how St. Paul would assert, as against this school of thought, the personality of the living God, as Creator, Ruler, Father; the binding force of the law written in the heart; intuitive morality as against mere utilitarianism; the nobleness of a hero-soul raised above pleasure, and living, not for itself, but for others and for God. And in so teaching them he, in this respect differing from the mere professor of a higher philosophy, would point to the Resurrection and the Judgment as that which should confound the pleasure-seeker by giving him tribulation and anguish, and should assign glory and immortality to the patient worker of righteousness. (Comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 2:7-9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The Stoics—who took their name, not from their founder (Zeno, of Citium in Cyprus), but from the Stoa pækilè, the painted porch, at Athens, adorned with frescoes of the battle of Marathon, where Zeno used to teach—presented a higher phase of thought. Josephus (Vit. c. 2) compares them with the Pharisees, and their relation to the moral life of heathenism at this time presented many features analogous to those which we find in the influence of that sect in Palestine. They taught that true wisdom consisted in being the master, and not the slave, of circumstances. The things which are not in our power are not things to seek after, nor shrink from, but to be accepted with a calm equanimity. The seeker after wisdom learnt, therefore, to be indifferent alike to pleasure or pain, and aimed at an absolute apathy. The theology of the Stoics was also of a nobler kind than that of Epicurus. They spoke of a divine Mind pervading the universe, and ordering all things by its Providence. They recognised its government in the lives of nations and individual men, and probably reconciled, as the Pharisees did, their acceptance of its decrees with a practical belief in the freedom of the individual will. In the Manual of Ethics, by Epictetus, under Nero, and the Meditations of Marcus Aurelius, we see how the slave and the emperor stood on common ground. In Seneca, we see now often the Stoics spoke in the accents of Christian ethics. Many of the Stoics were sought after as tutors for the sons of noble families, and occupied a position of influence not unlike that of Jesuit confessors and directors in France in the seventeenth and eighteenth centuries. The main drawbacks were (1) that in aiming at apathy for themselves they shut out sympathy with others as disturbing their tranquillity; (2) that in striving after an ethical perfection in the strength of their own will they anticipated the position of the Pelagians in the history of the Christian Church; and (3) that, as with the Pharisees, the high ideal was often but a mask for selfish and corrupt lives. They, also, were too often “hypocrites,” acting a part before the world to which their true character did not correspond. In the language of the satirist—",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The Stoics—who took their name, not from their founder (Zeno, of Citium in Cyprus), but from the ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Stoa pækilè, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "the painted porch, at Athens, adorned with frescoes of the battle of Marathon, where Zeno used to teach—presented a higher phase of thought. Josephus (",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Vit. c.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 2) compares them with the Pharisees, and their relation to the moral life of heathenism at this time presented many features analogous to those which we find in the influence of that sect in Palestine. They taught that true wisdom consisted in being the master, and not the slave, of circumstances. The things which are not in our power are not things to seek after, nor shrink from, but to be accepted with a calm equanimity. The seeker after wisdom learnt, therefore, to be indifferent alike to pleasure or pain, and aimed at an absolute apathy. The theology of the Stoics was also of a nobler kind than that of Epicurus. They spoke of a divine Mind pervading the universe, and ordering all things by its Providence. They recognised its government in the lives of nations and individual men, and probably reconciled, as the Pharisees did, their acceptance of its decrees with a practical belief in the freedom of the individual will. In the ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Manual of Ethics, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "by Epictetus, under Nero, and the ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Meditations",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " of Marcus Aurelius, we see how the slave and the emperor stood on common ground. In Seneca, we see now often the Stoics spoke in the accents of Christian ethics. Many of the Stoics were sought after as tutors for the sons of noble families, and occupied a position of influence not unlike that of Jesuit confessors and directors in France in the seventeenth and eighteenth centuries. The main drawbacks were (1) that in aiming at apathy for themselves they shut out sympathy with others as disturbing their tranquillity; (2) that in striving after an ethical perfection in the strength of their own will they anticipated the position of the Pelagians in the history of the Christian Church; and (3) that, as with the Pharisees, the high ideal was often but a mask for selfish and corrupt lives. They, also, were too often “hypocrites,” acting a part before the world to which their true character did not correspond. In the language of the satirist—",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "“Qui Curios simulant et Bacchanalia vivunt.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "[“They pose as heroes, and as drunkards live.”]",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "—Juvenal, Sat. ii. 3.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "—Juvenal, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Sat.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ii. 3.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "It is evident that there would be many points of sympathy between the better representatives of this school and St. Paul, but for them also the message that spoke of Jesus and the Resurrection—of God sending His Son into the world to be first crucified and then raised from the dead—would seem an idle dream, and they would shrink from the thought that they needed pardon and redemption, and could do nothing true and good in their own strength without the grace of God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "What will this babbler say?—Better, What might this babbler mean? The Greek noun, literally seed-picker, was primarily applied to a small bird of the finch tribe. The idle gossips of the agora picking up news, and, eager to retail it, the chattering parasites of feasts, were likened by the quick wit of Athenian humourists to such a bird as it hopped and chirped. So Zeno himself called one of his disciples, who had more words than wisdom, by the same contemptuous name (Diog. Laert. Zeno, c. 19). The philosophers, in their scorn of the stranger who was so ready to discuss great questions with any whom he met, applied the derisive epithet to him.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "What will this babbler say?",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Better, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "What might this babbler mean?",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " The Greek noun, literally ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "seed-picker, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "was primarily applied to a small bird of the finch tribe. The idle gossips of the ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "agora",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " picking up news, and, eager to retail it, the chattering parasites of feasts, were likened by the quick wit of Athenian humourists to such a bird as it hopped and chirped. So Zeno himself called one of his disciples, who had more words than wisdom, by the same contemptuous name (Diog. Laert. ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Zeno, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "c. 19). The philosophers, in their scorn of the stranger who was so ready to discuss great questions with any whom he met, applied the derisive epithet to him.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "He seemeth to be a setter forth of strange gods.—This was, it will be remembered, the precise charge on which Socrates had been condemned (Xenoph. Memor. i. 1, § 1). In his case it rested on his constant reference to the dæmôn, the divine monitor who checked and guided him, in whose voice he heard something like the voice of God; but the secret of his condemnation by his countrymen was to be found less in what he actually taught than in the questions with which he vexed their inmost soul, and made them conscious of ignorance or baseness. The questions of St. Paul, as he reasoned “of righteousness, temperance, and judgment to come,” were equally disturbing.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "He seemeth to be a setter forth of strange gods.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—This was, it will be remembered, the precise charge on which Socrates had been condemned (Xenoph. ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Memor.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " i. 1, § 1). In his case it rested on his constant reference to the ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "dæmôn, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "the divine monitor who checked and guided him, in whose voice he heard something like the voice of God; but the secret of his condemnation by his countrymen was to be found less in what he actually taught than in the questions with which he vexed their inmost soul, and made them conscious of ignorance or baseness. The questions of St. Paul, as he reasoned “of righteousness, temperance, and judgment to come,” were equally disturbing.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Because he preached unto them Jesus, and the resurrection.—The verb implies continuous action. This was the ever-recurring theme of his discourses. It is possible that with the strong tendency of the Greek mind to personify all attributes and abstract thoughts, St. Paul’s hearers saw in the word Anastasis (= Resurrection) the name of a new goddess, representing the idea of immortality, to be worshipped in conjunction with Jesus, and therefore they used the plural and spoke of his bringing in “strange gods.” So temples and altars had been dedicated to Concord, and the history of Athens told how Epimenides had bidden them erect two altars to Insolence and Outrage (Cicero, De Leg. ii. 11), as the two demons by whom their city was being brought to ruin. What startled them in the Apostle was that he taught not only the immortality of the soul—that had entered into the popular mythical belief, and had been enforced with philosophical arguments by Socrates and Plato—but the resurrection of the body. In 1Corinthians 15:35 we see the character of the objections raised to this doctrine, and the manner in which St. Paul answered them.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Because he preached unto them Jesus, and the resurrection.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The verb implies continuous action. This was the ever-recurring theme of his discourses. It is possible that with the strong tendency of the Greek mind to personify all attributes and abstract thoughts, St. Paul’s hearers saw in the word ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Anastasis ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "(= Resurrection) the name of a new goddess, representing the idea of immortality, to be worshipped in conjunction with Jesus, and therefore they used the plural and spoke of his bringing in “strange gods.” So temples and altars had been dedicated to Concord, and the history of Athens told how Epimenides had bidden them erect two altars to Insolence and Outrage (Cicero, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "De Leg.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ii. 11), as the two demons by whom their city was being brought to ruin. What startled them in the Apostle was that he taught not only the immortality of the soul—that had entered into the popular mythical belief, and had been enforced with philosophical arguments by Socrates and Plato—but the resurrection of the body. In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Corinthians 15:35",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " we see the character of the objections raised to this doctrine, and the manner in which St. Paul answered them.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Acts 17:18",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 17:18",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Then certain philosophers of the Epicureans and of the Stoics encountered him ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Greek, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "συνεβαλλον αυτω",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "opposed themselves to him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The Epicureans entirely denied a providence, and held the world to be the effect of mere chance; asserting sensual pleasure to be man’s chief good, and that the soul and body died together. The Stoics held that matter was eternal; that all things were governed by irresistible fate; that virtue was its own sufficient reward, and vice its own sufficient punishment. It is easy to see how happily the apostle levels his discourse at some of the most important errors of each sect, while, without expressly attacking either, he gives a plain summary of his own religious principles. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Some said, What will this babbler say? ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Such is the language of natural reason, full of, and satisfied with, itself. The expression, rendered ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "babbler, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "σπερμολγος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", (which properly signifies a contemptible person, that picks up scattered seed in the market, or elsewhere, and which Dr. Doddridge translates, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "retailer of scraps; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and Mr. Fleming, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "holder forth;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") admirably expresses the contempt which these philosophers had of this unknown foreigner, who pretended to teach all the several professors of their learned and illustrious body. Yet even here Paul had some fruit, though nowhere less than at Athens. And no wonder, since this city was a seminary of philosophers, who have ever been the pest of true religion. Others said, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He seemeth to be a setter forth ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Καταγγελευς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a proclaimer ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(this expression he returns to them at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 17:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of strange gods ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Such as are not known even at Athens. The original expression, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ξενων δαιμονιων",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", signifies ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "strange, or foreign demons. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "By ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "demons, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "however, they did not understand ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "devils, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or evil beings, as we do; but rather men, who had lived on earth, and were afterward deified; distinguishing them from the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "θεοι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "gods, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "who, they thought, were such by nature. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Because he preached to them Jesus and the resurrection ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— The former of which, through their negligence in attending they ridiculously took for a deified man, and the other for a goddess. And, as stupid as this mistake was, it is the less to be wondered at, since the Athenians might as well count the resurrection a deity, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shame, famine, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "desire; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or as the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "fever, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and some other things too scandalous to be here named, were accounted deities among the Romans.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "17:16-21 Athens was then famed for polite learning, philosophy, and the fine arts; but none are more childish and superstitious, more impious, or more credulous, than some persons, deemed eminent for learning and ability. It was wholly given to idolatry. The zealous advocate for the cause of Christ will be ready to plead for it in all companies, as occasion offers. Most of these learned men took no notice of Paul; but some, whose principles were the most directly contrary to Christianity, made remarks upon him. The apostle ever dwelt upon two points, which are indeed the principal doctrines of Christianity, Christ and a future state; Christ our way, and heaven our end. They looked on this as very different from the knowledge for many ages taught and professed at Athens; they desire to know more of it, but only because it was new and strange. They led him to the place where judges sat who inquired into such matters. They asked about Paul's doctrine, not because it was good, but because it was new. Great talkers are always busy-bodies. They spend their time in nothing else, and a very uncomfortable account they have to give of their time who thus spend it. Time is precious, and we are concerned to employ it well, because eternity depends upon it, but much is wasted in unprofitable conversation.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then certain philosophers - Athens was distinguished, among all the cities of Greece and the world, for the cultivation of a subtle and refined philosophy. This was their boast, and the object of their constant search and study, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 1:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Of the Epicureans - This sect of philosophers was so named from Epicurus, who lived about 300 years before the Christian era. They denied that the world was created by God, and that the gods exercised any care or providence over human affairs, and also the immortality of the soul. Against these positions of the sect Paul directed his main argument in proving that the world was created and governed by God. One of the distinguishing doctrines of Epicurus was that pleasure was the summum bonum, or chief good, and that virtue was to be practiced only as it contributed to pleasure. By pleasure, however, Epicurus did not mean sensual and groveling appetites and degraded vices, but rational pleasure, properly regulated and governed. See Good's \"Book of Nature.\" But whatever his views were, it is certain that his followers had embraced the doctrine that the pleasures of sense were to be practiced without restraint. Both in principle and practice, therefore, they devoted themselves to a life of gaiety and sensuality, and sought happiness only in indolence, effeminacy, and voluptuousness. Confident in the belief that the world was not under the administration of a God of justice, they gave themselves up to the indulgence of every passion the infidels of their time, and the exact example of the frivolous and fashionable multitudes of all times, that live without God, and that seek pleasure as their chief good.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And of the Stoics - This was a sect of philosophers, so named from the Greek στοά  stoa, a porch or portico, because Zeno, the founder of the sect, held his school and taught in a porch, in the city of Athens. Zeno was born in the island of Cyprus, but the greater part of his life was spent at Athens in teaching philosophy. After having taught publicly 48 years, he died at the age of 96, that is, 264 years before Christ. The doctrines of the sect were, that the universe was created by God; that all things were fixed by Fate; that even God was under the dominion of fatal necessity; that the Fates were to be submitted to; that the passions and affections were to be suppressed and restrained; that happiness consisted in the insensibility of the soul to pain; and that a man should gain an absolute mastery over all the passions and affections of his nature. They were stern in their views of virtue, and, like the Pharisees, prided themselves on their own righteousness. They supposed that matter was eternal, and that God was either the animating principle or soul of the world, or that all things were a part of God. They fluctuated much in their views of a future state; some of them holding that the soul would exist only until the destruction of the universe, and others that it would finally be absorbed into the divine essence and become a part of God. It will be readily seen, therefore, with what pertinency Paul discoursed to them. The leading doctrines of both sects were met by him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Encountered him - Contended with him; opposed themselves to him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And some said - This was said in scorn and contempt. He had excited attention; but they scorned such doctrines as they supposed would be delivered by an unknown foreigner from Judea.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "What will this babbler say? - Margin, \"base fellow.\" Greek: σπερμολόγος  spermologos. The word occurs nowhere else in the New Testament. It properly means \"one who collects seeds,\" and was applied by the Greeks to the poor persons who collected the scattered grain in the fields after harvest, or to gleaners; and also to the poor who obtained a precarious subsistence around the markets and in the streets. It was also applied to birds that picked up the scattered seeds of grain in the field or in the markets. The word came hence to have a twofold signification:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) It denoted the poor, the needy, and the vile the refuse and offscouring of society; and,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(2) From the birds which were thus employed, and which were troublesome by their continual unmusical sounds, it came to denote those who were talkative, garrulous, and opinionated those who collected the opinions of others, or scraps of knowledge, and retailed them fluently, without order or method. It was a word, therefore, expressive of their contempt for an unknown foreigner who should pretend to instruct the learned men and philosophers of Greece. Doddridge renders it \"retailer of scraps.\" Syriac, \"collector of words.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Other some - Others.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "He seemeth to be a setter forth - He announces or declares the existence of strange gods. The reason why they supposed this was, that he made the capital points of his preaching to be Jesus and the resurrection, which they mistook for the names of divinities.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Of strange gods - Of foreign gods, or demons. They worshipped many gods themselves, and as they believed that every country had its own special divinities, they supposed that Paul had come to announce the existence of some such foreign, and to them unknown gods. The word translated \"gods\" (δαιμονίων  daimoniōn) denotes properly \"the genii, or spirits who were superior to human beings, but inferior to the gods.\" It is, however, often employed to denote the gods themselves, and is evidently so used here. The gods among the Greeks were such as were supposed to have that rank by nature. The demons were such as had been exalted to divinity from being heroes and distinguished men.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "He preached unto them Jesus - He proclaimed him as the Messiah. The mistake which they made by supposing that Jesus was a foreign divinity was one which was perfectly natural for minds degraded like theirs by idolatry. They had no idea of a pure God; they knew nothing of the doctrine of the Messiah; and they naturally supposed, therefore, that he of whom Paul spoke so much must be a god of some other nation, of a rank similar to their own divinities.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And the resurrection - The resurrection of Jesus, and through him the resurrection of the dead. It is evident, I think, that by the resurrection τὴν ἀνάστασιν  tēn anastasin they understood him to refer to the name of some goddess. Such was the interpretation of Chrysostom. The Greeks had erected altars to Shame, and Famine, and Desire (Paus., i. 17), and it is probable that they supposed \"the resurrection,\" or the Anastasis, to be the name also of some unknown goddess who presided over the resurrection. Thus, they regarded him as a setter forth of two foreign or strange gods, Jesus, and the Anastasis, or resurrection. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And the resurrection - The resurrection of Jesus, and through him the resurrection of the dead. It is evident, I think, that by the resurrection τὴν ἀνάστασιν  tēn anastasin they understood him to refer to the name of some goddess. Such was the interpretation of Chrysostom. The Greeks had erected altars to Shame, and Famine, and Desire (Paus., i. 17), and it is probable that they supposed \"the resurrection,\" or the Anastasis, to be the name also of some unknown goddess who presided over the resurrection. Thus, they regarded him as a setter forth of two foreign or strange gods, Jesus, and the Anastasis, or resurrection. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "18-21. certain … of the Epicureans—a well-known school of atheistic materialists, who taught that pleasure was the chief end of human existence; a principle which the more rational interpreted in a refined sense, while the sensual explained it in its coarser meaning.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and of the Stoics—a celebrated school of severe and lofty pantheists, whose principle was that the universe was under the law of an iron necessity, the spirit of which was what is called the Deity: and that a passionless conformity of the human will to this law, unmoved by all external circumstances and changes, is the perfection of virtue. While therefore the Stoical was in itself superior to the Epicurean system, both were alike hostile to the Gospel. \"The two enemies it has ever had to contend with are the two ruling principles of the Epicureans and Stoics—Pleasure and Pride\" [Howson].",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "What will this babbler say?—The word, which means \"a picker-up of seeds,\" bird-like, is applied to a gatherer and retailer of scraps of knowledge, a prater; a general term of contempt for any pretended teacher.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "a setter forth of strange gods—\"demons,\" but in the Greek (not Jewish) sense of \"objects of worship.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "because he preached Jesus and the resurrection—Not as if they thought he made these to be two divinities: the strange gods were Jehovah and the Risen Saviour, ordained to judge the world.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Both these sects of philosophers were the most opposite to Christianity of all others: ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. The ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Epicureans",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (so called from one Epicurus) did generally deny, that the world was made, or that it is governed, by God; as also, that there were any rewards or punishments for men after death, holding nothing to be good but what was so to their senses: and if so, were indeed swine rather than men. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. The ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Stoics",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " were so called from the place where they met at first; and held as bad opinions as the other did; and denied that their wise men were inferior to their gods, and in some respect preferred them before their gods; which their Seneca was not free from, Epist. 73. And no wonder if such men oppose the gospel what they may. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "What will this babbler say?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " They make Paul so contemptible, comparing him to such as live by the off falls of corn, which was used to be gathered up as they fell down in measuring, and left to be fed upon by the meanest and poorest of the people. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "A setter forth of strange gods; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " they might amongst the Athenians bring in by public authority as many gods as they would, but none out of their private opinions; which was the fault charged upon Socrates. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And the resurrection; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " so ignorantly, or maliciously, did they pervert St. Paul’s words, that they accuse him for making the resurrection a god too. Probably they heard him often naming the word, and magnifying of the resurrection, as without which we were without hope. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then certain philosophers of the Epicureans,.... These were so called from Epicurus, the son of Neocles, who was born 342 years before Christ, and taught philosophy at Athens, in his garden; the principal tenets of which were, that the world was not made by any deity, or with any design, but came into its being and form, through a fortuitous concourse of atoms, of various sizes and magnitude, which met, and jumbled, and cemented together, and so formed the world; and that the world is not governed by the providence of God; for though he did not deny the being of God, yet he thought it below his notice, and beneath his majesty to concern himself with its affairs; and also, that the chief happiness of men lies in pleasure. His followers were called \"Epicureans\"; of which there have been two sorts; the one were called the strict or rigid \"Epicureans\", who placed all happiness in the pleasure of the mind, arising from the practice of moral virtue, and which is thought by some to be the true principle of \"Epicureans\"; the other were called the loose, or the remiss Epicureans, who understood their master in the gross sense, and placed all their happiness in the pleasure of the body, in brutal and sensual pleasure, in living a voluptuous life, in eating and drinking, &c. and this is the common notion imbibed of an Epicurean. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And of the Stoics: the author of this sect was Zeno, whose followers were so called from the Greek word \"Stoa\", which signifies a portico, or piazza, under which Zeno used to walk, and teach his philosophy, and where great numbers of disciples attended him, who from hence were called \"Stoics\": their chief tenets were, that there is but one God, and that the world was made by him, and is governed by fate; that happiness lies in virtue, and virtue has its own reward in itself; that all virtues are linked together, and all vices are equal; that a wise and good man is destitute of all passion, and uneasiness of mind, is always the same, and always joyful, and ever happy in the greatest torture, pain being no real evil; that the soul lives after the body, and that the world will be destroyed by fire. Now the philosophers of these two sects ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "encountered him; the Apostle Paul; they attacked him, and disputed with him upon some points, which were contrary to their philosophy: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and some said, what will this babbler say? this talking, prating fellow? though the word here used does not signify, as some have thought, a sower of words; as if they meant, that the apostle was a dealer is many words, a verbose man, and full of words, but not matter; but it properly signifies a gatherer of seeds; and the allusion is either to a set of idle people, that used to go to markets and fairs, and pick up seeds of corn, that were shook out of sacks, upon which they lived; and so the word came to be used for an idle good for nothing fellow, and for one that picked up tales and fables, and carried them about for a livelihood. So Demosthenes, in a way of reproach, called Aeschincs by this name; and such an one was the apostle reckoned: or the metaphor is taken from little birds, as the sparrow, &c. that pick up seeds, and live upon them, and are of no value and use. Harpocratian says (d), there is a certain little bird, of the jay or jackdaw kind, which is called \"Spermologos\" (the word here used), from its picking up of seeds, of which Aristophanes makes mention; and that from this a base and contemptible man, and one that lives by others, is called by this name: from whence we may learn in what a contemptuous manner the apostle was used in this polite city, by these men of learning. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Other some, he seemeth to be a setter forth of strange gods; other than those worshipped in the city of Athens: this was the charge which Melitus brought against Socrates; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Socrates (says he (e)) has acted an unrighteous part; the gods, whom the city reckons such, he does not, introducing other and new gods.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Aelianus (f) represents him as censured by Aristophanes, as one that introduced , \"strange gods\", though he neither knew them, nor honoured them. The reason why they thought the apostle was for bringing in other gods, than which nothing was more foreign from him, was, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "because he preached unto them Jesus, and the resurrection: the Syriac version reads, \"and his resurrection\"; that is, the resurrection of Christ; the Arabic version renders it, \"the resurrection from the dead\"; the general resurrection; both doubtless were preached by him, see Acts 17:32 Jesus they took for one strange and new God, they had never heard of before, and \"Anastasis\", or \"the resurrection\", for another; which need not be wondered at, when they had altars erected for Mercy, Fame, Shame, and Desire; see Gill on Acts 17:16. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "because he preached unto them Jesus, and the resurrection: the Syriac version reads, \"and his resurrection\"; that is, the resurrection of Christ; the Arabic version renders it, \"the resurrection from the dead\"; the general resurrection; both doubtless were preached by him, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 17:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Jesus they took for one strange and new God, they had never heard of before, and \"Anastasis\", or \"the resurrection\", for another; which need not be wondered at, when they had altars erected for Mercy, Fame, Shame, and Desire; see Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 17:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(d) Lexicon, p. 271, 272. (e) Laertius in Vita Socratis. (f) Var. Hist. l. 2. c. 13. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(d) Lexicon, p. 271, 272. (e) Laertius in Vita Socratis. (f) Var. Hist. l. 2. c. 13. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "{10} Then certain philosophers of the Epicureans, and of the Stoicks, encountered him. And some said, What will this {i} babbler say? other some, He seemeth to be a setter forth of strange gods: because he preached unto them Jesus, and the resurrection.",
        "children": [
          {
            "element": "span",
            "class": "cverse3",
            "text": "{10}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Then certain philosophers of the Epicureans, and of the Stoicks, encountered him. And some said, What will this ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{i}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " babbler say? other some, He seemeth to be a setter forth of strange gods: because he preached unto them Jesus, and the resurrection.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(10) Two special sects of the philosophers set themselves against Christ: the Epicures, who mock and scoff at religion: and the Stoics, who decide religious matters according to their own thinking.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(i) Literally, seed gatherer: a borrowed kind of speech taken from birds which spoil corn, and is applied to those who without any skill blurt out the knowledge which they have gotten by hearing this man and that man.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Meyer's NT Commentary",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 17:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". That it was Epicureans and Stoics who fell into conflict with him (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "συνέβαλλον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 14:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and not Academics and Peripatetics, is to be explained—apart from the greater popularity of the two former, and from the circumstance that they were in this later period the most numerous at Athens—from the greater contrast of their philosophic tenets with the doctrines of Christianity. The one had their principle of pleasure, and the other their pride of virtue! and both repudiated faith in the Divine Providence. Comp. Hermann, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Culturgesch. d. Gr. u. Röm",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". I. p. 237 f.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The opinion of these philosophers was twofold. Some, with vain scholastic conceit, pronounced Paul’s discourses, which lacked the matter and form of Hellenic philosophy, to be idle talk, undeserving of attention, and would have nothing further to do with him. Others were at least curious about this new matter, considered the singular stranger as an announcer of strange divinities, and took him with them, in order to hear more from him and to allow their fellow-citizens to hear him, to the Areopagus, etc.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τί ἂν θέλοι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " … ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "λέγειν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] if, namely, his speaking is to have a meaning. See on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 2:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὁ σπερμολόγος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] originally ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the rook",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Aristoph. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Av",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". 232, 579). Then in a twofold figurative meaning: (1) from the manner in which that bird feeds, a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "parasite",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and (2) from its chattering voice, a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "babbler",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Dem. 269. 19; Athen. viii. p. 344 C). So here, as the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "speaking",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of Paul gave occasion to this contemptuous designation. See also Dissen, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ad Dem. de cor",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". p. 297.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "δαιμονίων",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "divinities",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", quite generally. The ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "plural is indefinite",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and denotes the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "category",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (see on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 2:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). According to de Wette, it is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Jesus",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the Risen One and the living ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that are meant in contrast to the Greek gods,—an element, however, which, according to the subjoined remark of Luke, appears as ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "imported",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The judgment of the philosophers, very similar to the charge previously brought against Socrates (Xen. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Mem",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". i. 1. 1), but not framed possibly in imitation of it (in opposition to Zeller), was founded on their belief that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Jesus",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", whom Paul preached and even set forth as ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a raiser of the dead",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", must be assumed, doubtless, to be a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "foreign divinity",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", whose announcer (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καταγγελεύς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", not elsewhere preserved) Paul desired to be. Hence Luke adds the explanatory statement: ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὅτι τὸν Ἰησοῦν κ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀνάστ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "εὐηγγ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Chrysostom, Oecumenius, Alexander Moras, Selden, Hammond, Spencer, Heinrichs, Baur,[64] Lange, and Baumgarten, strangely imagine that the philosophers meant the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἀνάστασις",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "goddess",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " announced by Paul Comp. also Ewald, p. 494 f. But if Luke had aimed at this by his explanatory remark, he must have indicated it more precisely, especially as it is in itself improbable that the philosophers could, even in mere irony, derive from the words of the apostle a goddess ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἀνάστασις",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", for Paul doubtless announced ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "who",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " would raise the dead. Olearius referred ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀνάστ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". not to the general resurrection of the dead, but to the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "resurrection of Jesus",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; so also Bengel. But Luke, in that case, in order not to be misunderstood, must have added ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "αὐτοῦ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which (see the critical remarks) he has not done.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[64] See his ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Paulus",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", I. p. 192, ed. 2 : the ironical popular wit had out of Jesus and the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀνάστασις",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " made a pair of divinities.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 17:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "συνέβαλλον αὐτῷ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": a word peculiar to St. Luke; three times in his Gospel, four times in Acts; it need not have necessarily a hostile sense as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 14:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but simply means that amongst the chance comers in the Agora there were some who “engaged in discussions,” with him (so Blass like Latin, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "consilia conferre, sc.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "λόγους",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), a meaning perhaps suggested by the imperfect. Grotius and others take it as “translatio de prœliis sumpta, ut apparet, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 14:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Utitur ita sæpe Polybius, quem sequi amat Lucas.”—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἐπικουρείων",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": so called from Epicurus, 342–270 B.C.; his disciples were known also as the School of the Garden, from the garden in Athens where the master instructed them, in distinction from the disciples of the Porch or the Academy. We must be careful to remember that as in numberless other cases, so the system of the founder suffered at the hands of his successors, and that the life of Epicurus himself was far removed from that of a mere sensualist, or “Epicure” in its later sense. But it was evident that a life which made pleasure and happiness the be-all and end-all of existence, however safeguarded by the conditions imposed at the outset by Epicurus, was liable to degenerate into a mere series of prudential calculations, or a mere indulgence of the senses and appetites. In his determination to rid men of the superstitious fears which were the chief cause of the miseries of humanity, Epicurus opposed the popular Polytheism, and regarded the gods as living a life of passionless calm far removed from mundane strifes and sorrows, “careless of mankind”. The Stoics branded Epicurus as an Atheist, but the materialistic creed of Epicurus and his followers had at all events this merit, that its bold criticism of existing beliefs was serviceable in undermining the prevailing acceptance of a gross and crude mythology, whilst it helped to assert in contradistinction to a paralysing fatalism the doctrine of the freedom of man’s will (see F. C. Conybeare, “Epicureans,” Hastings’ B.D.; Westcott, “Epicureans,” B.D.2; Wallace, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Epicureanism",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Στωϊκῶν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": The Stoics, so called from the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Stoa Pæcile",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " at Athens where Zeno of Citium, the founder of the school, 340–260 B.C., met his pupils, and where his successors debated (Capes, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Stoics",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", p. 30), spoke in their theology of a providence ruling the world, of a first cause and a governing mind. But their creed was essentially Pantheistic, although the verses of Cleanthes’ Hymn (“the most important document of the Stoic theology,” Ueberweg) seemed to breathe the accents of a higher and nobler belief. But no devotional phrases could disguise a Pantheism which regarded the world as the body of God, and God as the soul of the world, which held that apart from external nature the Supreme God had no existence which identified Him with fate and necessity, while the history of the universe was an unfolding of the providence of God, but a providence which was but another name for the chain of causation and consequences, inviolable, eternal. The leading maxims of the ethical system of the Stoics was the injunction to live according to nature, although the expression of the rule varied in the earlier and later schools. But as this life was best realised in conformity to the law of the universe, in conformity with reason as the highest element in man, the Stoic ideal, in spite of its recognition of virtue, became not merely stern and intellectual, but impassive and austere; in aiming at ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "apathy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the Stoic lost ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sympathy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " with the most ennobling and energetic emotions, and thus wrapped up in the cloak of his own virtue he justified, at least from an ethical point of view, the description which classed him as the Pharisee of Greek philosophy. In addressing an audience composed at all events in part of the representatives of these two great philosophic schools it may be said that St. Paul was not unmindful of his own former training in the early home of Stoicism (see on p. 235). And so in speaking of creation and providence, of the unity of nations in the recognition of all that was true even in Pantheism, St. Paul has been described as taking the Stoic side against the Epicureans, or at least we may say that he in his speech asserts against some of the cardinal errors of the Epicureans the creative and superintending power of God. But to the Stoic and Epicurean alike the Christian Creed would proclaim that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "All’s Love, yet all’s Law",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; to the Stoic and Epicurean alike, the Pharisee and Sadducee of the world of philosophy, the bidding came to repent and obey the Gospel, no less than to the crowd whom sages and philosophers despised: “Paulus summa arte orationem suam ita temperat, ut modo cum vulgo contra Philosophos, modo cum Philosophis contra plebem, modo contra utrosque pugnet,” Wetstein; see Capes, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Stoicism",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; Lightfoot, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Philippians",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “St. Paul and Seneca”; Zahn, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Der Stoiker Epiktet und sein Verhältniss zum Christenthum;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Ueberweg, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Hist, of Phil.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", i., p. 185 ff.; Rendall, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Marcus Antoninus",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Introd. (1898); Gore, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ephesians",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", p. 253 ff.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καί τινες ἔλεγον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": these are generally taken to include the philosophers, and the remarks following are referred to them; sometimes the first question to the Epicureans, and the second criticism to the Stoics. But it has recently been maintained that we need not refer to the two sects of philosophers this unfavourable criticism on St. Paul; “Epicureans,” Conybeare in Hastings’ B.D. Certainly the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οἱ δέ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " has no ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οἱ μέν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as if two opposing schools were meant. The punctuation in R.V., which simply states the fact that amongst those in the Agora certain also ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τινὲς δὲ καὶ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of the philosophers, etc., admits of this view that the criticisms were uttered not by the philosophers, but by the curious crowd which thronged the Agora. Ramsay however takes the verse as marking the opinions of the philosophers, and the use of the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "σπερμολόγος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " by Zeno of one of his followers may help to confirm this.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τί ἂν θέλοι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": “what would this babbler say?” R.V., not future as in A.V.; the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἄν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " with optative being used to express what would happen as the fulfilment of some supposed condition, Burton, p. 79, so Viteau, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Le Grec du N. T.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", p. 33 (1893), the condition being if we would listen to him, or if his words have any meaning; optative with ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἄν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " only in Luke, see Burton, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "u. s.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "σπερμολόγος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": primarily an adjective, -",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; as a substantive ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὁ σπερ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". of a rook or crow, or some small bird, picking up seeds, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Arist., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Av.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", 233, 580. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "σπέρμα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "-",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "λέγω",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": so far as derivation is concerned it is not connected with ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "σπείρω",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "-",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "λόγους",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Latin, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "seminiverbius",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (so Augustine, Wycliffe, “sower of words”). The accent shows that this latter derivation is incorrect. Hence a man hanging about the shops and the markets, picking up scraps which fell from the loads and thus gaining a livelihood, so a parasite, one who lives at the expense of others, a hanger-on, Eustathius on Hom., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Odys.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", v., 490; see in Grimm, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sub v.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; so Dem. speaks of Aeschines, 269, 19, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "σπερ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "περίτριμμα ἀγορᾶς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The word thus came to be used of a man who picked up scraps of information, and retailed them at second hand. So Eustathius speaks of rhetoricians who were mere collectors of words and consistent plagiarists ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "διʼ ὅλου σπερμολογοῦντες",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; so again he remarks that the word is applied to those who make a show in unscientific style of knowledge which they have got from misunderstanding of lectures (see for these quotations Ramsay, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Expositor",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", September, 1899, p. 222, and the whole article “St. Paul in Athens”). Ramsay maintains therefore that there is no instance of the classical use of the word as a babbler or mere talker, and he sees in the word a piece of Athenian slang, caught up as the Athenians had themselves used it (“sine dubio hoc ex ipso ore Atheniensium auctor excepit” Blass), and applied to one who was quite outside any literary circle, an ignorant, vulgar plagiarist. At the same time it is perhaps difficult to find any single word more to the point than “babbler,” A. and R.V. (Tyndall), for, as Alford urges, it both signifies one who talks fluently to no purpose, and hints also that his talk is not his own. We may, however, well owe this rendering to the fact that ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "σπερμολόγος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " was wrongly derived, as if it meant ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "seminator verborum",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", whereas its true derivation is given above. De Wette, Overbeck, Nösgen, Weiss, Holtzmann, Zöckler, Wendt, all so render it. An ingenious attempt has been made to connect the word with the Aretalogi (Juvenal, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Sat.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", xv., 16; Suet, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Aug",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "[309], 74) or praters about virtue, who hired themselves as entertainers for the wealthy Roman nobles at their dinners: “mendax aretalogus,” Juv., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "u. s.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; Zöckler, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in loco",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". For instances of the use of the word see Wetstein, Ramsay, Nösgen, Bethge, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Die Paulinischen Reden",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", p. 77; Rendall (who agrees with Ramsay), and “Babbler,” Hastings’ B.D.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ξένωνδαιμ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "δοκεῖ καταγ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".: The same kind of accusation had been already made against Socrates, Xen., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Mem.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", i., 1, as also against Anaxagoras and Protagoras, see Josephus, . ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Apion.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ii., 38, who also tells us how a certain priestess had been condemned in Athens ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὅτι ξένους ἐμύει θεούς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In Athens the introduction of strange gods was a capital offence, if by such an introduction the home deities were rejected and the state religion disturbed, but there is nothing to show that the Athenians regarded Paul’s teaching in this light, and there is no evidence that the Areopagus had cognisance of serious charges of impiety or of the introduction of foreign religion (Ramsay, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "St. Paul",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", p. 247).—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ξένων",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": “strange,” ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", foreign.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "δαιμονίων",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " used here like the Greek ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "δαιμόνιον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in a neutral sense which might refer to deities good or bad. In classical Greek we have ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καινὰ δαιμόνια",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the charge against Socrates, Xen., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Mem.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", i., 1; Plato, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Apol.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", 24 B. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καταγγελεὺς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": only here in N.T., not found in LXX or classical Greek, the verb ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καταγγέλλειν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " occurs twice in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Ma 8:36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Ma 9:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", of declaring abroad the power of the God of the Jews. In Plutarch we have ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "κατάγγελος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "δοκεῖ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", see Burton, p. 153; on the personal construction with ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "δοκεῖ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Galatians 2:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jam 1:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τὸν Ἰ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καὶ τὴν ἀνάστασιν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", see critical note. It is possible that the Athenians thought that Paul was preaching two strange, deities, Jesus and Resurrection (the latter as a female deity ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἀνάστασις",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), just as they had their own altars erected to Pity, Piety, Modesty, a view which gains support not only from the collocation of the words, but from the use of the article with both, and from the supposition that Paul was held to be a preacher of more than one strange God; so Chrys., Oecum., Selden, and list given by Wendt (1888), ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in loco",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Wendt also (1899) inclines to this view, which is adopted by Renan, Overbeck, Holtzmann, Felten, McGiffert, Knabenbauer, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " also the punctuation in R.V., which may imply this view (see Humphry on R.V., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in loco",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). As against this view see Hackett’s note, p. 213, who thinks it hardly conceivable that the Apostle could express himself so obscurely on the subject as to afford any occasion for this gross mistake (so also Farrar). The article before ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀνάσ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". is taken by Nösgen as referring simply to the general resurrection, a view which he regards as agreeing with the prominence given to the doctrine in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 17:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It is argued that if ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀνάσ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". referred to the resurrection of Jesus we should have ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "αὐτοῦ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which has crept into some copies, but the address itself shows that the Apostle spoke of the resurrection of Jesus as affording a pledge of a general resurrection.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[309] Augustine.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "philosophers of the Epicureans and of the Stoicks",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] In St Paul’s day these two systems of philosophy were most prominent throughout the Roman world, and were regarded as conflicting though in many points they bear a strong likeness to one another. Both were the result of a desire to find some better principle for the guidance of man’s moral nature than could be found in the so-called religious systems of Greece and Rome. But before the Christian era much that was best in both schools had sadly degenerated from its pristine character.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The founder of the Stoics was Zeno of Citium in Cyprus. His precise date is uncertain, but he flourished in the century between b.c. 350–250. The first lesson of his teaching was that the highest duty of the philosopher was to practise virtue. For the doing this knowledge was necessary, and the only knowledge that could be relied on was that which was based upon sensation. Reality belonged only to material things such as the senses could appreciate. In this manner the Stoic philosophy became materialist. For though owning the existence of God and of the soul in man, Zeno and his followers spake of these as, in some sense, material. But they termed God the soul of the universe, and taught that all things are produced from him, and will at last be absorbed into him again. And then a new world-cycle will begin and be in all respects like that which went before. So the Stoics were Pantheists. They taught moreover that the universe was governed by unchanging law, that the lot of individuals, and the occurrence of particular events were all uncertain. The care of Providence was for the fabric of the universe, and only indirectly extended to particulars or individuals whose lot was bound up with the unchanging course of fixed law. The Stoics therefore were fatalists. The way in which the individual could make the nearest approach to happiness was by bringing himself, through knowledge, into harmony with the course of the universe. But so unimportant did the individual appear to these philosophers, that suicide was held to be lawful, and at times praiseworthy. They were conscious of both physical and moral evil in the world, and from this men might escape by self-inflicted death. They taught however that, though the virtuous might have to suffer, no real evil happens to them, nor real good to the vicious. Fortified with this thought, the Stoic trained himself to be proudly independent of externals, and to bear evils, should they come, with indifference, and thus he strove to secure undisturbed peace of mind. Materialism, Pantheism, Fatalism and pride, were the features of one of the systems into contact with which St Paul was brought at Athens.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The Epicureans (named from Epicurus, born at Samos b.c. 342) agreed with the Stoics that philosophy should seek to promote the happiness of man, but maintained that this end could be best gained by the pursuit of pleasure. By this language they did not intend profligate pleasure, but a state wherein the body was free from pain and the mind from disturbance. They too made the senses their means of judging of what is pleasure, and so with them man became the measure of all good for himself. Thus the Epicureans were materialists. But differing from the Stoics they taught the world was formed by chance, and that the gods had no concern in its creation. Their gods were described as perfectly happy, dwelling apart and caring neither for the world nor its inhabitants. Thus the Epicureans were practical atheists. With them man might approach to a state of happiness by circumscribing his wants, so that life might be free from care. To restrain the senses was the Epicurean road to happiness, to crush them as much as possible into insensibility was the path of the Stoic. But having such thoughts of the gods, neither system had in any way run counter to the popular theology. By doing so the Stoic would fear lest he should be thought to deny God altogether, while the Epicurean, though thinking all such worship folly, yet felt it too great an interruption to the pleasure which he sought to become an advocate of the abolition of idol worship. So St Paul found Athens crowded with the images and altars of the gods.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "What will this babbler say",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Better, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "What",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "would",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c. The A.V. conceals the fact that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "will",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " here signifies “meaneth” or “wisheth” to say, “What would he go on to say if we would listen?”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The word rendered “babbler” is not found elsewhere in N. T. In profane writers it is used of birds picking up scattered grain, and then figuratively of men who pick up a living as best they may, and hence are willing to flatter for the sake of what they can get, and so are men without principle or ground in what they say.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a setter forth of strange gods",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The word ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "δαιμόνια",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " here rendered “gods” is the word from which the English “demon” is derived. It was used in classical Greek mostly to denote some inferior order of divine beings. It was one of the accusations brought against Socrates and the charge on which he was condemned that he introduced new ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "daimonia",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Xen. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Mem",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". i. 1, 2; Plato, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Apol",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". 40 a &c.). It has been thought by some that the Athenians, by using the plural word, understood that “Jesus” was one new divinity and “Anastasis” (the Resurrection) another. But it is not necessary to suppose this. They might very well speak of a preacher of Jesus as a setter forth of new ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "divinities",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". For they evidently saw that he had more to say than they had yet heard.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Times seem changed at Athens since the prosecution of Socrates, for it is not anger, but scornful curiosity which prompts the language of the speakers. They do not mean to assail Paul for his teaching, and amid the abundance of idols, they perhaps now would have felt no difficulty in allowing Jesus a place, provided he did not seek to overthrow all the rest of their divinities.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The nature of St Paul’s teaching “in the market-place” has not been mentioned until we are told that it was of “Jesus and the resurrection.” We may take this as a specimen of the way in which the author of the Acts has dealt with his materials. He has not seen it needful here to do more than specify in half-a-dozen words what St Paul had spoken about; and so when we have a report of a speech we need not suppose that he has given, or intended to give, more than a summary of what the speaker said, and, adhering to the subtance, has cast his abbreviated record into such form as best fitted his narrative.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 17:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". [",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Τινὲς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "some",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") It is not without danger to despise any one, before that you have informed yourself what kind of a person he is.—V. g.]—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "συνέβαλλον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "encountered",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " him.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τί",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "what",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") The pride of overloaded (satisfied with its own fulness) and fastidious (contemptuous) reason hereby gives itself vent.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "σπερμόλογος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Hesychius explains ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "σπερμόλογος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "φλύαρος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καὶ ὁ τὰ σπέρματα συλλέγων",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καὶ κολοιῶδες ζῶον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a seed-picker, trifling and jackdaw like",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Compare Eustathius. The ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "seed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of Paul was not without its fruit: whereas the philosophers of Athens were void of all fruit. Henry Bullinger says, “Nowhere did Paul teach with less fruit resulting than at Athens: nor is it strange, seeing that there was in that same city a kind of den and covert of philosophers who always stood forth, a most immediate and deadly bane to true piety.”—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ξένων",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of foreign, strange",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") which the Athenians heretofore had not had.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καταγγελεὺς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "an announcer, setter forth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") This word Paul gives back to them in his turn, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 17:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : I do ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "announce",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to you.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὅτι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") This ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "because",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is to be referred to the words, “But others said.”—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀνάστασιν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the resurrection",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") They fancied that Paul spoke of Jesus in such a way, as if He had been made a ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "δαιμόνιον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "· they did not fancy that the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀνάστασις",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "resurrection",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " itself, was being set before them as a goddess.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "εὐηγγελίζετο",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he was preaching",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") in the brief conversation with them, whereby he was sounding their state of mind. See foll. verse.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 18.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "- And certain also of the Epicurean and Stoic philosophers",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "then certain philosophers of the Epicureans, and of the Stoicks",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", A.V.; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "would",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "will",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", A.V.; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "preached",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "preached unto them",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", A.V. and T.R. The ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Epicureans",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (so called from Epicurus, their founder) and the ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Stoics",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (so called from the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "στοά",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the colonnade or piazza where Zeno their founder taught) were the most numerous sects at Athens at this time; and their respective tenets were the most opposite to the doctrines of the gospel. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Encountered him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "σύνεβαλλον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 4:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it is followed by ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "πρός",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and is properly rendered \"conferred;\" here it is followed by the dative, and may be understood to mean \"disputed\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "συμβάλλειν λόγους",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). It may, however, not less properly be taken in the sense of a hostile encounter of words, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 14:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and frequently in classical Greek. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "This babbler",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "σπερμολόγος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "a picker-up of seeds",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", applied to a crow (Aristoph., 'Ayes,' 232, 579). Plutarch too ('Demet.,' 28) has ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "σπερμολόγοι ὅρνιθες",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", birds picking up seeds. Hence it is used of idle hangers-on in the markets, who get a livelihood by what they can pick up, and so generally of empty, worthless fellows. Hence it is further applied to those who pick up scraps of knowledge from one or another and \"babble them indifferently in all companies\" (Johnson's 'Dictionary,' under \"Babble\")",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": ". A",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " setter forth of strange gods. There does not seem to be the least ground for Chrysostom's suggestion that they took ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Anastasis",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (the Resurrection) for the name of a goddess. But the preaching of Jesus the Son of God, himself risen from the dead (ver. 31), and hereafter to be the Judge of quick and dead at the general resurrection, was naturally, to both Stoics and Epicureans, ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "a setting forth of strange gods",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "Χένα δαιμόνια",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " are \"foreign deities,\" or \"daemons,\" inferior gods. The word ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "καταγγελεύς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", a setter forth, does not occur elsewhere. But the nearly identical word ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "κατάγγελος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is used by Plutarch. Acts 17:18",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Epicureans",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Disciples of Epicurus, and atheists. They acknowledged God in words, but denied his providence and superintendence over the world. According to them, the soul was material and annihilated at death. Pleasure was their chief good; and whatever higher sense their founder might have attached to this doctrine, his followers, in the apostle's day, were given to gross sensualism.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Stoics",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Pantheists. God was the soul of the world, or the world was God. Everything was governed by fate, to which God himself was subject. They denied the universal and perpetual immortality of the soul; some supposing that it was swallowed up in deity; others, that it survived only till the final conflagration; others, that immortality was restricted to the wise and good. Virtue was its own reward, and vice its own punishment. Pleasure was no good, and pain no evil. The name Stoic was derived from stoa, a porch. Zeno, the founder of the Stoic sect, held his school in the Stoa Poecile, or painted portico, so called because adorned with pictures by the best masters.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Babbler (σπερμολόγος)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Lit., seed-picker: a bird which picks up seeds in the streets and markets; hence one who picks up and retails scraps of news. Trench (\"Authorized Version of the New Testament\") cites a parallel from Shakespeare:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"This fellow picks up wit as pigeons peas,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And utters it again when Jove doth please.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "He is wit's pedler, and retails his wares",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "At wakes, and wassails, meetings, markets, fairs.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Love's Labor's Lost, v., 2.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Setter-forth (καταγγελεὺς)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "See on declare, Acts 17:23. Compare 1 Peter 4:4, 1 Peter 4:12.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See on declare, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 17:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Peter 4:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Peter 4:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Strange",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...",
        "children": []
      }
    ]
  }
]