[{"num":11,"verse":"When Rehoboam came to Jerusalem, he called together from the house of Judah and Benjamin one hundred and eighty thousand choice men to make war and to battle with Israel in order to restore the kingdom to Rehoboam."},{"num":2,"verse":"But the word of the Lord came to Shemaiah the man of God saying: "},{"num":3,"verse":"Speak to Rehoboam, son of Solomon and king of Judah, and to all Israel in Judah and Benjamin, "},{"num":4,"verse":"“So says the Lord: You are not to go up and fight against your brothers. Each man must return to his house, for this event is from Me.” So they obeyed the word of the Lord and turned back from attacking Jeroboam."},{"header":"Rehoboam Secures the Kingdom"},{"num":5,"verse":"So Rehoboam dwelled in Jerusalem and built siege cities in Judah. "},{"num":6,"verse":"He built Bethlehem, Etam, Tekoa, "},{"num":7,"verse":"Beth Zur in the east, Soko, Adullam, "},{"num":8,"verse":"Gath, Mareshah in the west, Ziph, "},{"num":9,"verse":"Adoraim, Lachish in the south, Azekah, "},{"num":10,"verse":"Zorah, Aijalon in the northwest, and central Hebron, all of which were fortified cities in Judah and Benjamin. "},{"num":11,"verse":"He strengthened the fortresses and set leaders in them with stockpiles of food, oil, and wine. "},{"num":12,"verse":"And in all the cities he placed shields and spears, and he greatly strengthened these places. So he held Judah and Benjamin."},{"num":13,"verse":"And the priests and Levites in all Israel came before him from all their territories. "},{"num":14,"verse":"For the Levites left their pasture lands and properties, and they traveled to Judah and Jerusalem because Jeroboam and his sons excluded them from serving as priests to the Lord. "},{"num":15,"verse":"And he set for himself priests for the high places and for the goat and calf idols that he made. "},{"num":16,"verse":"And those who set their hearts to seek the Lord God of Israel followed after them from all the tribes of Israel, and they came to Jerusalem to sacrifice to the Lord God of their fathers. "},{"num":17,"verse":"So they strengthened the kingdom of Judah and supported Rehoboam, the son of Solomon, for three years, for they walked in the way of David and Solomon for three years."},{"header":"Rehoboam’s Family"},{"num":18,"verse":"And Rehoboam took Mahalath for a wife, the daughter of both Jerimoth the son of David and of Abihail the daughter of Eliab the son of Jesse, "},{"num":19,"verse":"and she bore sons to him: Jeush, Shemariah, and Zaham. "},{"num":20,"verse":"Then after her he took Maakah the daughter of Absalom. And she bore to him Abijah, Attai, Ziza, and Shelomith. "},{"num":21,"verse":"And Rehoboam loved Maakah the daughter of Absalom more than his other wives and concubines (for he took eighteen wives and sixty concubines), and he had twenty-eight sons and sixty daughters."},{"num":22,"verse":"And Rehoboam set Abijah the son of Maakah as chief and head over his brothers for he planned to make him king. "},{"num":23,"verse":"And he was discerning and spread out all his sons to all the lands of Judah and Benjamin, even among the fortified cities, and he provided for them an abundance of provisions and wives."}]