[{"header":"Shemaiah’s Prophecy"},{"num":11,"verse":"When Rehoboam arrived at Jerusalem, he mobilized the men of Judah and Benjamin—180,000 select troops—to fight against Israel and to restore the kingdom to himself."},{"num":2,"verse":"But the Lord said to Shemaiah, the man of God,"},{"num":3,"verse":"“Say to Rehoboam son of Solomon, king of Judah, and to all the Israelites in Judah and Benjamin:"},{"num":4,"verse":"‘This is what the Lord says: Do not fight against your relatives. Go back home, for what has happened is my doing!’” So they obeyed the message of the Lord and did not fight against Jeroboam."},{"header":"Rehoboam Fortifies Judah"},{"num":5,"verse":"Rehoboam remained in Jerusalem and fortified various towns for the defense of Judah."},{"num":6,"verse":"He built up Bethlehem, Etam, Tekoa,"},{"num":7,"verse":"Beth-zur, Soco, Adullam,"},{"num":8,"verse":"Gath, Mareshah, Ziph,"},{"num":9,"verse":"Adoraim, Lachish, Azekah,"},{"num":10,"verse":"Zorah, Aijalon, and Hebron. These became the fortified towns of Judah and Benjamin."},{"num":11,"verse":"Rehoboam strengthened their defenses and stationed commanders in them, and he stored supplies of food, olive oil, and wine."},{"num":12,"verse":"He also put shields and spears in these towns as a further safety measure. So only Judah and Benjamin remained under his control."},{"num":13,"verse":"But all the priests and Levites living among the northern tribes of Israel sided with Rehoboam."},{"num":14,"verse":"The Levites even abandoned their pasturelands and property and moved to Judah and Jerusalem, because Jeroboam and his sons would not allow them to serve the Lord as priests."},{"num":15,"verse":"Jeroboam appointed his own priests to serve at the pagan shrines, where they worshiped the goat and calf idols he had made."},{"num":16,"verse":"From all the tribes of Israel, those who sincerely wanted to worship the Lord, the God of Israel, followed the Levites to Jerusalem, where they could offer sacrifices to the Lord, the God of their ancestors."},{"num":17,"verse":"This strengthened the kingdom of Judah, and for three years they supported Rehoboam son of Solomon, for during those years they faithfully followed in the footsteps of David and Solomon."},{"header":"Rehoboam’s Family"},{"num":18,"verse":"Rehoboam married his cousin Mahalath, the daughter of David’s son Jerimoth and of Abihail, the daughter of Eliab son of Jesse."},{"num":19,"verse":"Mahalath had three sons—Jeush, Shemariah, and Zaham."},{"num":20,"verse":"Later Rehoboam married another cousin, Maacah, the granddaughter of Absalom. Maacah gave birth to Abijah, Attai, Ziza, and Shelomith."},{"num":21,"verse":"Rehoboam loved Maacah more than any of his other wives and concubines. In all, he had eighteen wives and sixty concubines, and they gave birth to twenty-eight sons and sixty daughters."},{"num":22,"verse":"Rehoboam appointed Maacah’s son Abijah as leader among the princes, making it clear that he would be the next king."},{"num":23,"verse":"Rehoboam also wisely gave responsibilities to his other sons and stationed some of them in the fortified towns throughout the land of Judah and Benjamin. He provided them with generous provisions, and he found many wives for them."}]