[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(30) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "One portion of fifty.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The Levites were much more numerous than the priests, and consequently it was ordered that they should have two per cent. of the spoil which fell to the congregation, whereas the priests had only one-fifth percent, of a like amount. The portion of the Levites, therefore, was 320 maidens, 6,750 sheep and goats, 720 oxen, and 610 asses.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "31:25-47 Whatever we have, God justly claims a part. Out of the people's share God required one in fifty, but out of the soldiers' share only one in five hundred. The less opportunity we have of honouring God with personal services, the more should we give in money or value.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "An heave-offering - Render simply an offering, and compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 18:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The verb from which the word here rendered \"heave-offering\" is derived, is rightly translated \"levy\" in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 31:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "25-39. Take the sum of the prey that was taken—that is, of the captives and cattle, which, having been first lumped together according to ancient usage (Ex 15:9; Jud 5:30), were divided into two equal parts: the one to the people at large, who had sustained a common injury from the Midianites and who were all liable to serve: and the other portion to the combatants, who, having encountered the labors and perils of war, justly received the largest share. From both parts, however, a certain deduction was taken for the sanctuary, as a thank offering to God for preservation and for victory. The soldiers had greatly the advantage in the distribution; for a five-hundredth part only of their half went to the priest, while a fiftieth part of the congregation's half was given to the Levites.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "One portion of fifty; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " whereas the former part was one of five hundred: the reason of the difference is, partly because this was taken out of the people’s portion, whose hazards being less than the others, their gains also in all reason were to be less; partly because this was to be distributed into more hands, the Levites being now numerous, when the priests were but few. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And of the children of Israel's half, thou shall take one portion of fifty,.... Which was abundantly more than what was taken out of the part of the soldiers; and the reason of it is plain and easy to be discerned; the soldiers had taken much pains, and gone through much fatigue, as well as had hazarded their lives, and therefore less was to be taken from them; and besides the tribute levied out of their half was to be given to the priests, who were not so numerous as the Levites, among whom the part out of the half of the congregation was to be distributed: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "of the persons; of the women, as the Targums of Jonathan, one of fifty out of them was to be given to the Levites to be their handmaids, or to be taken in marriage by them, or their sons, when fit for it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "of the beeves, of the asses, and of the sheep, of all manner of beasts; of oxen, asses, sheep, and goats, one out of fifty of each of these sorts were to be taken. Aben Ezra observes, no mention is made of camels, being but few, and no part taken: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and give them unto the Levites, which keep the charge of the tabernacle of the Lord; for these being employed in the service of the tabernacle, came in for their share of the tribute levied unto the Lord. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and give them unto the Levites, which keep the charge of the tabernacle of the Lord; for these being employed in the service of the tabernacle, came in for their share of the tribute levied unto the Lord. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And of the children of Israel's half, thou shalt take {l} one portion of fifty, of the persons, of the beeves, of the asses, and of the flocks, of all manner of beasts, and give them unto the Levites, which keep the charge of the tabernacle of the LORD.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And of the children of Israel's half, thou shalt take ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{l}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " one portion of fifty, of the persons, of the beeves, of the asses, and of the flocks, of all manner of beasts, and give them unto the Levites, which keep the charge of the tabernacle of the LORD.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(l) The Israelites who had not been at war, of every fiftieth paid one to the Lord: and the soldiers one of every five hundred.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 30.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "One portion of fifty.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Two percent of the prey. This probably corresponded very closely to the number of Levites as compared with the twelve tribes, and would tend to show that God intended the Levites to be neither better nor worse off than their neighbours. Numbers 31:30",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Distribution of the Booty. - God directed Moses, with Eleazar and the heads of the fathers' houses (\"fathers\" for \"fathers' houses:\" see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 6:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") of the congregation, to take the whole of the booty in men and cattle, and divide it into two halves: one for the men of war (המּלחמה תּפשׂי, those who grasped at war, who engaged in war), the other for the congregation, and to levy a tribute upon it (מכס  equals  מכסה, computatio, a certain amount: see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 12:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") for Jehovah. Of the half that came to the warriors, one person and one head of cattle were to be handed over to Eleazar the priest out of every 500 (i.e., one-fifth per cent.), as a heave-offering for Jehovah; and of the other half that was set apart for the children of Israel, i.e., for the congregation, one out of every fifty (i.e., 2 per cent.) was to be taken for the Levites. אחז, laid hold of, i.e., snatched out of the whole number during the process of counting; not seized or touched by the lot, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 24:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as there was no reason for resorting to the lot in this instance. The division of the booty into two equal halves, one of which was given to the warriors, and the other to the congregation that had taken no part in the war, was perfectly reasonable and just. As the 12,000 warriors had been chosen out of the whole congregation to carry on the war on their behalf, the congregation itself could properly lay claim to its share of the booty. But as the 12,000 had had all the trouble, hardships, and dangers of the war, they could very properly reckon upon some reward for their service; and this was granted them by their receiving quite as much as the whole of the congregation which had taken no part in the war-in fact, more, because the warriors only gave one-fifth per cent. of their share as a thank-offering for the victory that had been granted them, whilst those who remained at home had to give 2 per cent. of their share to Jehovah for the benefit of the priests and Levites. The arrangement, however, was only made for this particular case, and not as a law for all times, although it was a general rule that those who remained at home received a share of the booty brought back by the warriors (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 22:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 30:24-25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; 2 Macc. 8:28, 30). ",
        "children": []
      }
    ]
  }
]