[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(10) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "If riches increase.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Even if by honest means you grow rich, distrust your wealth.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 62:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 62:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Trust not in oppression — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That is, in riches gotten by fraud and violence; or in the arts of acquiring them. As you must not trust in any other men, so neither must you trust to yourselves, nor to your own wit, or industry, or courage, by which you may oppress others, and so think to secure and enrich yourselves. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And become not vain in robbery — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Lifting up and feeding yourselves with vain hopes of safety and felicity from those riches which you take from others by robbery and violence. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "If riches increase, set not your heart on them — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "So as to esteem and inordinately love them, to place your hope, and trust, and chief joy in them, or so as to grow proud and insolent because of them.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "62:8-12 Those who have found the comfort of the ways of God themselves, will invite others into those ways; we shall never have the less for others sharing with us. the good counsel given is, to trust wholly in God. We must so trust in him at all times, as not at any time to put that trust in ourselves, or in any creature, which is to be put in him only. Trust in him to guide us when in doubt, to protect us when in danger, to supply us when in want, to strengthen us for every good word and work. We must lay out wants and our wishes before him, and then patiently submit our wills to his: this is pouring out our hearts. God is a refuge for all, even for as many as will take shelter in him. The psalmist warns against trusting in men. The multitude, those of low degree, are changeable as the wind. The rich and noble seem to have much in their power, and lavish promises; but those that depend on them, are disappointed. Weighed in the balance of Scripture, all that man can do to make us happy is lighter than vanity itself. It is hard to have riches, and not to trust in them if they increase, though by lawful and honest means; but we must take heed, lest we set our affections unduly upon them. A smiling world is the most likely to draw the heart from God, on whom alone it should be set. The consistent believer receives all from God as a trust; and he seeks to use it to his glory, as a steward who must render an account. God hath spoken as it were once for all, that power belongs to him alone. He can punish and destroy. Mercy also belongs to him; and his recompensing the imperfect services of those that believe in him, blotting out their transgressions for the Redeemer's sake, is a proof of abundant mercy, and encourages us to trust in him. Let us trust in his mercy and grace, and abound in his work, expecting mercies from him alone.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Trust not in oppression - The general meaning here is, that we are not to trust in anything but God. In the previous verse the psalmist had stated reasons why we should not trust in men of any rank. In this verse he enumerates several things on which people are accustomed to rely, or in which they place confidence, and he says that we should put no confidence in them in respect to the help which we need, or the great objects which are to be accomplished by us. The first thing mentioned is oppression; and the idea is, that we must not hope to accomplish our object by oppressing others; extorting their property or their service; making them by force subject to us, and subservient to our wishes. Many do this. Conquerors do it. Tyrants do it. The owners of slaves do it.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And become not vain in robbery - That is, Do not resort to theft or robbery, and depend on that for what is needed in life. Many do. The great robbers of the world - conquerors - have done it. Thieves and burglars do it. People who seek to defraud others of their earnings do it. They who withhold wages from laborers, and they who cheat in trade, do it.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "If riches increase, set not your heart upon them - If you become rich without oppression, or without robbery. If your riches seem to grow of themselves - for that is the meaning of the original word (compare Mark 4:2) - do not rely on them as being all that you require. People are prone to do this. The rich man confides in his wealth, and supposes that he has all he needs. The psalmist says that none of these things constitute the true reliance of man. None of them can supply his real needs; none can defend him in the great perils of his existence; hone can save his soul. He needs, over and above all these, a God and Saviour; and it is such a God and Saviour only that can meet the real needs of his nature. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "If riches increase, set not your heart upon them - If you become rich without oppression, or without robbery. If your riches seem to grow of themselves - for that is the meaning of the original word (compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 4:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") - do not rely on them as being all that you require. People are prone to do this. The rich man confides in his wealth, and supposes that he has all he needs. The psalmist says that none of these things constitute the true reliance of man. None of them can supply his real needs; none can defend him in the great perils of his existence; hone can save his soul. He needs, over and above all these, a God and Saviour; and it is such a God and Saviour only that can meet the real needs of his nature. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10. Not only are oppression and robbery, which are wicked means of wealth, no grounds of boasting; but even wealth, increasing lawfully, ought not to engross the heart.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Trust not in oppression; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as you may not trust any other men, so neither must you trust to yourselves, nor to your own wit, or industry, or courage, by which you may oppress others, and so think to secure and enrich yourselves. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Become not vain; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " lifting up and feeding yourselves with vain hopes, and expectations of safety and felicity, from those riches which you take from others by robbery or violence. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Set not your heart upon them; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " so as to please yourselves immoderately in them, to place your hope, and trust, and chief joy in them, or to grow proud and insolent because of them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Trust not in oppression,.... Either in the power of oppressing others; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 30:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; or in riches gotten by oppression, which being put into a man's hand by his friend, he keeps, and will not return them; so Aben Ezra and Kimchi interpret it of mammon unlawfully obtained; mammon of unrighteousness, or unrighteous mammon; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 17:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and become not vain in robbery; in riches gotten by open rapine and theft; and men become vain herein when they boast of such riches, place their confidence in them, and think to make atonement for their sins by burnt sacrifices purchased with them, Isaiah 61:8; ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and become not vain in robbery; in riches gotten by open rapine and theft; and men become vain herein when they boast of such riches, place their confidence in them, and think to make atonement for their sins by burnt sacrifices purchased with them, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 61:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "if riches increase; in a lawful way, in such manner as the fruits of the earth do, as the word (m) used signifies: if they increase in great abundance from a little, as from one grain of corn many proceed; and insensibly, as the seed sown grows up, a man knows not how, through diligence and the blessing of God from heaven; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "set not your heart upon them; your affections on them; they are ensnaring, they are apt to take the heart from God, to draw off the affections from Christ and things above, to choke the word, and lead into many temptations and harmful lusts; let not your hearts be elated, or lifted up with them; be not highminded, or filled with pride and vanity on account of them; nor put any trust in them, for they are uncertain things. Jarchi interprets it of the increase of the riches of others; see Psalm 49:16. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "set not your heart upon them; your affections on them; they are ensnaring, they are apt to take the heart from God, to draw off the affections from Christ and things above, to choke the word, and lead into many temptations and harmful lusts; let not your hearts be elated, or lifted up with them; be not highminded, or filled with pride and vanity on account of them; nor put any trust in them, for they are uncertain things. Jarchi interprets it of the increase of the riches of others; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 49:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(m) \"cum pullulaverit\", Montanus; \"efflorescunt\", Cocceius; \"germinant, fructificant\", Amama. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(m) \"cum pullulaverit\", Montanus; \"efflorescunt\", Cocceius; \"germinant, fructificant\", Amama. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Trust not in oppression, and {h} become not vain in robbery: if riches increase, set not your heart upon them.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Trust not in oppression, and ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{h}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " become not vain in robbery: if riches increase, set not your heart ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "upon them",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(h) Give yourselves wholly to God by putting away all things that are contrary to his law.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The first two lines (cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Psalm 62:9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 62:9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", 11 ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a, b",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") are a rhythmical division of what is logically one sentence: put not vain trust in oppression and robbery.’ Do not rely, for you will only be deceived, upon wealth and material resources amassed by violence and wrong, instead of trusting in God (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Psalm 62:8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 62:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "). It is a warning against the old temptation to follow might rather than right. ‘Oppression and robbery’ are often coupled. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 6:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 6:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 22:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 30:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "if riches increase",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " &c.] Lit. if riches grow, pay no regard. The Psalmist addresses those who were in danger of being tempted to covet the power which wealth brings, no matter what might be the means used for obtaining it. There are indications that social discontent was a factor in the momentary success of Absalom’s rebellion (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 4:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 10.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Trust not in oppression",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (comp. ver. 3). The class that supported Absalom was the class of oppressors in Israel, whom David kept under and restrained as far as possible. The writer warns them against trusting in their power to oppress, since such strength as they have is not their own, but lent them by God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And become not vain in robbery;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "rely not vainly on robbery",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Kay). Do not suppose that God will allow you to continue oppressing and robbing. Such a belief is a vain illusion. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "If riches increase, set not your heart",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " upon them. Even when wealth accumulates naturally, and not as the result of ill-doing, it is not a thing to be trusted or set store by. Psalm 62:10",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Just as all men with everything earthly upon which they rely are perishable, so also the purely earthly form which the new kingship has assumed carries within itself the germ of ruin; and God will decide as Judge, between the dethroned and the usurpers, in accordance with the relationship in which they stand to Him. This is the internal connection of the third group with the two preceding ones. By means of the strophe vv. 10-13, our Psalm is brought into the closest reciprocal relationship with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 39:1-13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Concerning בּני־אדם and בּני־אישׁ vid., on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 49:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 4:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The accentuation divides ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 62:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " quite correctly. The Athnach does not mark בּמאזנים לעלות as an independent clause: they are upon the balance לעלות, for a going up; they must rise, so light are they (Hengstenberg). Certainly this expression of the periphrastic future is possible (vid., on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 25:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 1:1-6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " :17), still we feel the want here of the subject, which cannot be dispensed within the clause as an independent one. Since, however, the combining of the words with what follows is forbidden by the fact that the infinitive with ל in the sense of the ablat. gerund. always comes after the principal clause, not before it (Ew. 280, d), we interpret: upon the balances ad ascendendum  equals  certo ascensuri, and in fact so that this is an attributive that is co-ordinate with כּזב. Is the clause following now meant to affirm that men, one and all, belong to nothingness or vanity (מן partitivum), or that they are less than nothing (מן comparat.)? Umbreit, Stier, and others explain ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 40:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " also in the latter way; but parallels like ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 41:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " do not favour this rendering, and such as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 44:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " are opposed to it. So also here the meaning is not that men stand under the category of that which is worthless or vain, but that they belong to the domain of the worthless or vain.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The warning in Psalm 62:11 does not refer to the Absalomites, but, pointing to these as furnishing a salutary example, to those who, at the sight of the prosperous condition and joyous life on that side, might perhaps be seized with envy and covetousness. Beside בּטח בּ the meaning of הבל בּ is nevertheless not: to set in vain hope upon anything (for the idea of hoping does not exist in this verb in itself, Job 27:12; Jeremiah 2:5, nor in this construction of the verb), but: to be befooled, blinded by something vain (Hitzig). Just as they are not to suffer their heart to be befooled by their own unjust acquisition, so also are they not, when the property of others increases (נוּב, root נב, to raise one's self, to mount up; cf. Arabic nabata, to sprout up, grow; nabara, to raise; intransitive, to increase, and many other verbal stems), to turn their heart towards it, as though it were something great and fortunate, that merited special attention and commanded respect. Two great truths are divinely attested to the poet. It is not to be rendered: once hath God spoken, now twice (Job 40:5; 2 Kings 6:10) have I heard this; but after Psalm 89:36 : One thing hath God spoken, two things (it is) that I have heard; or in accordance with the interpunction, which here, as in Psalm 12:8 (cf. on Psalm 9:16), is not to be called in question: these two things have I heard. Two divine utterances actually do follow. The two great truths are: (1) that God has the power over everything earthly, that consequently nothing takes place without Him, and that whatever is opposed to Him must sooner or later succumb; (2) that of this very God, the sovereign Lord (אדני), is mercy also, the energy of which is measured by His omnipotence, and which does not suffer him to succumb upon whom it is bestowed. With כּי the poet establishes these two revealed maxims which God has impressed upon his mind, from His righteous government as displayed in the history of men. He recompenses each one in accordance with his doing, κατὰ τὰ ἔργα αὐτοῦ, as Paul confesses (Romans 2:6) no less than David, and even (vid., lxx) in the words of David. It shall be recompensed unto every man according to his conduct, which is the issue of his relationship to God. He who rises in opposition to the will and order of God, shall feel God's power (עז) as a power for punishment that dashes in pieces; and he who, anxious for salvation, resigns his own will to the will of God, receives from God's mercy or loving-kindness (חסד), as from an overflowing fulness, the promised reward of faithfulness: his resignation becomes experience, and his hoping attainment. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The warning in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 62:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " does not refer to the Absalomites, but, pointing to these as furnishing a salutary example, to those who, at the sight of the prosperous condition and joyous life on that side, might perhaps be seized with envy and covetousness. Beside בּטח בּ the meaning of הבל בּ is nevertheless not: to set in vain hope upon anything (for the idea of hoping does not exist in this verb in itself, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 27:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 2:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", nor in this construction of the verb), but: to be befooled, blinded by something vain (Hitzig). Just as they are not to suffer their heart to be befooled by their own unjust acquisition, so also are they not, when the property of others increases (נוּב, root נב, to raise one's self, to mount up; cf. Arabic nabata, to sprout up, grow; nabara, to raise; intransitive, to increase, and many other verbal stems), to turn their heart towards it, as though it were something great and fortunate, that merited special attention and commanded respect. Two great truths are divinely attested to the poet. It is not to be rendered: once hath God spoken, now twice (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 40:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 6:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") have I heard this; but after ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 89:36",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : One thing hath God spoken, two things (it is) that I have heard; or in accordance with the interpunction, which here, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 12:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (cf. on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 9:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), is not to be called in question: these two things have I heard. Two divine utterances actually do follow. The two great truths are: (1) that God has the power over everything earthly, that consequently nothing takes place without Him, and that whatever is opposed to Him must sooner or later succumb; (2) that of this very God, the sovereign Lord (אדני), is mercy also, the energy of which is measured by His omnipotence, and which does not suffer him to succumb upon whom it is bestowed. With כּי the poet establishes these two revealed maxims which God has impressed upon his mind, from His righteous government as displayed in the history of men. He recompenses each one in accordance with his doing, κατὰ τὰ ἔργα αὐτοῦ, as Paul confesses (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 2:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") no less than David, and even (vid., lxx) in the words of David. It shall be recompensed unto every man according to his conduct, which is the issue of his relationship to God. He who rises in opposition to the will and order of God, shall feel God's power (עז) as a power for punishment that dashes in pieces; and he who, anxious for salvation, resigns his own will to the will of God, receives from God's mercy or loving-kindness (חסד), as from an overflowing fulness, the promised reward of faithfulness: his resignation becomes experience, and his hoping attainment. ",
            "children": []
          }
        ]
      }
    ]
  }
]