[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 62:12",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 62:12",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Also unto thee, O Lord, belongeth mercy — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Hebrew, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "חסד",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "chesed, benignity, beneficence, compassion. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "“Significat id boni, quod gratuito fit:” It signifies that good which is done gratuitously. — Buxtorf. He is no less willing than able to defend, preserve, and do good to those that trust in him. For he is as truly the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "best, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "as he is the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "greatest ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "of beings, merciful and gracious, yea, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the Father of mercies, and the God of all consolation and good hope. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "This is a further reason why we should trust in him, and answers the objections of our sinfulness and unworthiness; though we deserve nothing but his wrath, yet we may hope for all good from his mercy, which is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "over all his works. For, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "therefore, thou renderest, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — For the following words seem to be added, either as a proof of, or an inference from, the two foregoing properties of God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "power ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "mercy. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "God is almighty, therefore he can easily destroy all his enemies: he is merciful, and therefore will pardon good men’s failings, and graciously reward their integrity; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "according to his work — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Which, as he is obliged to do, by his own holy nature, so he is able to do it, being omnipotent, and willing to do it to the godly, notwithstanding their manifold infirmities and miscarriages, because he is merciful and gracious. Though God doth not always do this visibly in this world, yet he will do it in the day of final recompense. No service done to him shall go unrewarded; nor any affront given him unpunished, unless repented of. Thus it appears that power and mercy belong to him. If he were not a God of power, there are sinners that would be too high to be punished; and if he were not a God of mercy, there are services too worthless to be rewarded. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "62:8-12 Those who have found the comfort of the ways of God themselves, will invite others into those ways; we shall never have the less for others sharing with us. the good counsel given is, to trust wholly in God. We must so trust in him at all times, as not at any time to put that trust in ourselves, or in any creature, which is to be put in him only. Trust in him to guide us when in doubt, to protect us when in danger, to supply us when in want, to strengthen us for every good word and work. We must lay out wants and our wishes before him, and then patiently submit our wills to his: this is pouring out our hearts. God is a refuge for all, even for as many as will take shelter in him. The psalmist warns against trusting in men. The multitude, those of low degree, are changeable as the wind. The rich and noble seem to have much in their power, and lavish promises; but those that depend on them, are disappointed. Weighed in the balance of Scripture, all that man can do to make us happy is lighter than vanity itself. It is hard to have riches, and not to trust in them if they increase, though by lawful and honest means; but we must take heed, lest we set our affections unduly upon them. A smiling world is the most likely to draw the heart from God, on whom alone it should be set. The consistent believer receives all from God as a trust; and he seeks to use it to his glory, as a steward who must render an account. God hath spoken as it were once for all, that power belongs to him alone. He can punish and destroy. Mercy also belongs to him; and his recompensing the imperfect services of those that believe in him, blotting out their transgressions for the Redeemer's sake, is a proof of abundant mercy, and encourages us to trust in him. Let us trust in his mercy and grace, and abound in his work, expecting mercies from him alone.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Also unto thee, O Lord, belongeth mercy - Power, indeed, belongs to God ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 62:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but this is an attribute to be feared, and while, in one respect, it will inspire confidence, or while it gives us the assurance that God is able to defend us when all else shall fail, yet, unattended by any other attribute, it might produce only apprehension and alarm. What man, weak and sinful man, needs to know is not merely that God has almighty power, but how that power will be wielded, or with what other attributes it is combined; whether it will be put forth to destroy or to save; to kill or to keep alive; to crush or to uphold. Man, therefore, needs the assurance that God is a benevolent Being, as really as that he is a powerful Being; that he is disposed to show mercy; that his power will be put forth in behalf of those who confide in him, and not employed against them. Hence, the attribute of mercy is so essential to a proper conception of God; and hence, the psalm so appropriately closes by a reference to his mercy and compassion.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "For thou renderest to every man according to his work - As this stands in our version, it would seem that the psalmist regarded what is here referred to as a manifestation of mercy. Yet the \"rendering to every man according to his work\" is an act of justice rather than of mercy. It is probable, therefore, that the word rendered \"for\" - כי  kı̂y - does not refer here to either of the attributes mentioned exclusively - either power or mercy - but is to be understood with reference to the general course of argument in the psalm, as adapted to lead to confidence in God. The fact that he is a God who will deal impartially with mankind, or who will regard what is right and proper to be done in view of the characters of mankind, is a reason why they should confide in God - since there could be no just ground of confidence in a Being who is not thus impartial and just. All these combined - power, mercy, equity - constitute a reason why people should confide in God. If either of these were missing in the divine character, man could have no confidence in God. If these things do exist in God, unlimited confidence may be placed in him as having all needful power to save; as being so merciful that sinful people may trust in him; and as being so just and equal in his dealings that all may feel that it is right to repose confidence in a Being by whom all the interests of the universe will be secured. Compare 1 John 1:9. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "For thou renderest to every man according to his work - As this stands in our version, it would seem that the psalmist regarded what is here referred to as a manifestation of mercy. Yet the \"rendering to every man according to his work\" is an act of justice rather than of mercy. It is probable, therefore, that the word rendered \"for\" - כי  kı̂y - does not refer here to either of the attributes mentioned exclusively - either power or mercy - but is to be understood with reference to the general course of argument in the psalm, as adapted to lead to confidence in God. The fact that he is a God who will deal impartially with mankind, or who will regard what is right and proper to be done in view of the characters of mankind, is a reason why they should confide in God - since there could be no just ground of confidence in a Being who is not thus impartial and just. All these combined - power, mercy, equity - constitute a reason why people should confide in God. If either of these were missing in the divine character, man could have no confidence in God. If these things do exist in God, unlimited confidence may be placed in him as having all needful power to save; as being so merciful that sinful people may trust in him; and as being so just and equal in his dealings that all may feel that it is right to repose confidence in a Being by whom all the interests of the universe will be secured. Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 John 1:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12. for thou renderest—literally, \"that Thou renderest,\" &c., connected with \"I heard this,\" as the phrase—\"that power,\" &c. [Ps 62:11]—teaching that by His power He can show both mercy and justice.   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Belongeth mercy, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "benignity",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or readiness to do good. Thou art no less willing than able to defend and preserve all that put their trust in thee. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "For; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "therefore",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; for the following words seem to be either a reason or proof of, or an inference from, the two foregoing properties of God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "power and mercy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". God is almighty, therefore he can easily subdue and destroy all his and mine ungodly enemies, and recompense unto them all their malicious and wicked practices. He is also mild and merciful, and therefore will pardon good men’s failings, and graciously reward me and others of his people according to our integrity. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "According to his work; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " according to the nature and quality, though not according to the proportion, of their works, whether they be good or bad. And this, as he is obliged to do by his holy nature, and by that respect which he oweth to his own glory, so he is able to do it, being omnipotent, and willing to do it to the godly, (which was the only thing that might be doubted, because of their manifold and great corruptions, and imperfections, and miscarriages,) because he is merciful and gracious. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Also unto thee, O Lord, belongeth mercy,.... This is the other thing the psalmist had heard, and was assured of, and which encouraged his hope and trust in the Lord; that mercy belonged to him, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 130:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; as appears, not only from the common bounties of his providence, daily bestowed upon his creatures; but from the special gift of his Son, and of all spiritual mercies and blessings in him; from the regeneration of the Lord's people, the pardon of their sins, and their eternal salvation; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for thou renderest to every man according to his work; and which is a reason proving that both power and mercy belong to God; power in punishing the wicked according to their deserts, and mercy in rewarding the saints, not in a way of merit, or of debt, but of grace. Some interpret the words, as Aben Ezra and Kimchi observe, \"though thou renderest\", &c. that is, God is gracious and merciful, though he is also just and righteous in rendering to every man as his work is, whether it be good or evil. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "for thou renderest to every man according to his work; and which is a reason proving that both power and mercy belong to God; power in punishing the wicked according to their deserts, and mercy in rewarding the saints, not in a way of merit, or of debt, but of grace. Some interpret the words, as Aben Ezra and Kimchi observe, \"though thou renderest\", &c. that is, God is gracious and merciful, though he is also just and righteous in rendering to every man as his work is, whether it be good or evil. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Also unto thee, O Lord, belongeth mercy: for thou {k} renderest to every man according to his work.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Also unto thee, O Lord, ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "belongeth",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " mercy: for thou ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{k}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " renderest to every man according to his work.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(k) So that the wicked will feel your power, and the godly your mercy.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 12.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Also unto thee, O Lord,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "belongeth mercy;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "loving kindness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"Of Divine power all nature speaks; the knowledge of God's mercy rests mainly on revelation\" (Kay). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "For thou renderest to every man according to his work.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " When God rewards well doing, it is Still of his mercy, since no man can claim that he ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "deserves",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " reward. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Psalm 62:12",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Just as all men with everything earthly upon which they rely are perishable, so also the purely earthly form which the new kingship has assumed carries within itself the germ of ruin; and God will decide as Judge, between the dethroned and the usurpers, in accordance with the relationship in which they stand to Him. This is the internal connection of the third group with the two preceding ones. By means of the strophe vv. 10-13, our Psalm is brought into the closest reciprocal relationship with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 39:1-13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Concerning בּני־אדם and בּני־אישׁ vid., on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 49:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 4:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The accentuation divides ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 62:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " quite correctly. The Athnach does not mark בּמאזנים לעלות as an independent clause: they are upon the balance לעלות, for a going up; they must rise, so light are they (Hengstenberg). Certainly this expression of the periphrastic future is possible (vid., on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 25:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 1:1-6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " :17), still we feel the want here of the subject, which cannot be dispensed within the clause as an independent one. Since, however, the combining of the words with what follows is forbidden by the fact that the infinitive with ל in the sense of the ablat. gerund. always comes after the principal clause, not before it (Ew. 280, d), we interpret: upon the balances ad ascendendum  equals  certo ascensuri, and in fact so that this is an attributive that is co-ordinate with כּזב. Is the clause following now meant to affirm that men, one and all, belong to nothingness or vanity (מן partitivum), or that they are less than nothing (מן comparat.)? Umbreit, Stier, and others explain ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 40:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " also in the latter way; but parallels like ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 41:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " do not favour this rendering, and such as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 44:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " are opposed to it. So also here the meaning is not that men stand under the category of that which is worthless or vain, but that they belong to the domain of the worthless or vain.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The warning in Psalm 62:11 does not refer to the Absalomites, but, pointing to these as furnishing a salutary example, to those who, at the sight of the prosperous condition and joyous life on that side, might perhaps be seized with envy and covetousness. Beside בּטח בּ the meaning of הבל בּ is nevertheless not: to set in vain hope upon anything (for the idea of hoping does not exist in this verb in itself, Job 27:12; Jeremiah 2:5, nor in this construction of the verb), but: to be befooled, blinded by something vain (Hitzig). Just as they are not to suffer their heart to be befooled by their own unjust acquisition, so also are they not, when the property of others increases (נוּב, root נב, to raise one's self, to mount up; cf. Arabic nabata, to sprout up, grow; nabara, to raise; intransitive, to increase, and many other verbal stems), to turn their heart towards it, as though it were something great and fortunate, that merited special attention and commanded respect. Two great truths are divinely attested to the poet. It is not to be rendered: once hath God spoken, now twice (Job 40:5; 2 Kings 6:10) have I heard this; but after Psalm 89:36 : One thing hath God spoken, two things (it is) that I have heard; or in accordance with the interpunction, which here, as in Psalm 12:8 (cf. on Psalm 9:16), is not to be called in question: these two things have I heard. Two divine utterances actually do follow. The two great truths are: (1) that God has the power over everything earthly, that consequently nothing takes place without Him, and that whatever is opposed to Him must sooner or later succumb; (2) that of this very God, the sovereign Lord (אדני), is mercy also, the energy of which is measured by His omnipotence, and which does not suffer him to succumb upon whom it is bestowed. With כּי the poet establishes these two revealed maxims which God has impressed upon his mind, from His righteous government as displayed in the history of men. He recompenses each one in accordance with his doing, κατὰ τὰ ἔργα αὐτοῦ, as Paul confesses (Romans 2:6) no less than David, and even (vid., lxx) in the words of David. It shall be recompensed unto every man according to his conduct, which is the issue of his relationship to God. He who rises in opposition to the will and order of God, shall feel God's power (עז) as a power for punishment that dashes in pieces; and he who, anxious for salvation, resigns his own will to the will of God, receives from God's mercy or loving-kindness (חסד), as from an overflowing fulness, the promised reward of faithfulness: his resignation becomes experience, and his hoping attainment. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The warning in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 62:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " does not refer to the Absalomites, but, pointing to these as furnishing a salutary example, to those who, at the sight of the prosperous condition and joyous life on that side, might perhaps be seized with envy and covetousness. Beside בּטח בּ the meaning of הבל בּ is nevertheless not: to set in vain hope upon anything (for the idea of hoping does not exist in this verb in itself, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 27:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 2:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", nor in this construction of the verb), but: to be befooled, blinded by something vain (Hitzig). Just as they are not to suffer their heart to be befooled by their own unjust acquisition, so also are they not, when the property of others increases (נוּב, root נב, to raise one's self, to mount up; cf. Arabic nabata, to sprout up, grow; nabara, to raise; intransitive, to increase, and many other verbal stems), to turn their heart towards it, as though it were something great and fortunate, that merited special attention and commanded respect. Two great truths are divinely attested to the poet. It is not to be rendered: once hath God spoken, now twice (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 40:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 6:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") have I heard this; but after ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 89:36",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : One thing hath God spoken, two things (it is) that I have heard; or in accordance with the interpunction, which here, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 12:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (cf. on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 9:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), is not to be called in question: these two things have I heard. Two divine utterances actually do follow. The two great truths are: (1) that God has the power over everything earthly, that consequently nothing takes place without Him, and that whatever is opposed to Him must sooner or later succumb; (2) that of this very God, the sovereign Lord (אדני), is mercy also, the energy of which is measured by His omnipotence, and which does not suffer him to succumb upon whom it is bestowed. With כּי the poet establishes these two revealed maxims which God has impressed upon his mind, from His righteous government as displayed in the history of men. He recompenses each one in accordance with his doing, κατὰ τὰ ἔργα αὐτοῦ, as Paul confesses (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 2:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") no less than David, and even (vid., lxx) in the words of David. It shall be recompensed unto every man according to his conduct, which is the issue of his relationship to God. He who rises in opposition to the will and order of God, shall feel God's power (עז) as a power for punishment that dashes in pieces; and he who, anxious for salvation, resigns his own will to the will of God, receives from God's mercy or loving-kindness (חסד), as from an overflowing fulness, the promised reward of faithfulness: his resignation becomes experience, and his hoping attainment. ",
            "children": []
          }
        ]
      }
    ]
  }
]