[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(5) As in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 62:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Truly to God, be silence my soul. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The state of resignation is one which can only be preserved by prayer. We may ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "say, I will, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "but can only ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "feel ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "it through prayer.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Psalms",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "SILENCE TO GODPsalm 62:1",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "SILENCE TO GOD",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 62:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 62:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " We have here two corresponding clauses, each beginning a section of the psalm. They resemble each other even more closely than appears from the English version, for the ‘truly’ of the first, and the ‘only’ of the second clause, are the same word; and in each case it stands in the same place, namely, at the beginning. So, word for word, the two answer to each other. The difference is, that the one expresses the Psalmist’s patient stillness of submission, and the other is his self-encouragement to that very attitude and disposition which he has just professed to be his. In the one he speaks of, in the other to, his soul. He stirs himself up to renew and continue the faith and resignation which he has, and so he sets before us both the temper which we should have, and the effort which we should make to prolong and deepen it, if it be ours. Let us look at these two points then-the expression of waiting, and the self-exhortation to waiting.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘Truly my soul waiteth upon God.’ It is difficult to say whether the opening word is better rendered ‘truly,’ as here, or ‘only,’ as in the other clause. Either meaning is allowable and appropriate. If, with our version, we adopt the former, we may compare with this text the opening of another psalm {lxxiii.}, ‘Truly God is good to Israel,’ and there, as here, we may see in that vehement affirmation a trace of the struggle through which it had been won. The Psalmist bursts into song with a word, which tells us plainly enough how much had to be quieted in him before he came to that quiet waiting, just as in the other psalm he pours out first the glad, firm certainty which he had reached, and then recounts the weary seas of doubt and bewilderment through which he had waded to reach it. That one word is the record of conflict and the trophy of victory, the sign of the blessed effect of effort and struggle in a truth more firmly held, and in a submission more perfectly practised. It is as if he had said, ‘Yes! in spite of all its waywardness and fears, and self-willed struggles, my soul waits upon God. I have overcome these, and now there is peace within.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " It is to be further observed that literally the words run, ‘My soul is silence unto God.’ That forcible form of expression describes the completeness of the Psalmist’s unmurmuring submission and quiet faith. His whole being is one great stillness, broken by no clamorous passions, by no loud-voiced desires, by no remonstrating reluctance. There is a similar phrase in another psalm {cix. 4}, which may help to illustrate this: ‘For my love they are my adversaries, but I am prayer’-his soul is all one supplication. The enemies’ wrath awakens no flush of passion on his cheek, or ripple of vengeance in his heart. He meets it all with prayer. Wrapped in devotion and heedless of their rage, he is like Stephen, when he kneeled down among his yelling murderers, and cried with a loud voice, ‘Lord! lay not this sin to their charge.’ So here we have the strongest expression of the perfect consent of the whole inward nature in submission and quietness of confidence before God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " That silence is first a silence of the will. The plain meaning of this phrase is resignation; and resignation is just a silent will. Before the throne of the Great King, His servants are to stand like those long rows of attendants we see on the walls of Eastern temples, silent, with folded arms, straining their ears to hear, and bracing their muscles to execute his whispered commands, or even his gesture and his glance. A man’s will should be an echo, not a voice; the echo of God, not the voice of self. It should be silent, as some sweet instrument is silent till the owner’s hand touches the keys. Like the boy-prophet in the hush of the sanctuary, below the quivering light of the dying lamps, we should wait till the awful voice calls, and then answer, ‘Speak, Lord! for Thy servant heareth.’ Do not let the loud utterances of your own wills anticipate, nor drown, the still, small voice in which God speaks. Bridle impatience till He does. If you cannot hear His whisper, wait till you do. Take care of running before you are sent. Keep your wills in equipoise till God’s hand gives the impulse and direction.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Such a silent will is a strong will. It is no feeble passiveness, no dead indifference, no impossible abnegation that God requires, when He requires us to put our wills in accord with His. They are not slain, but vivified, by such surrender; and the true secret of strength lies in submission. The secret of blessedness is there, too, for our sorrows come because there is discord between our circumstances and our wills, and the measure in which these are in harmony with God is the measure in which we shall feel that all things are blessings to be received with thanksgiving. But if we will take our own way, and let our own wills speak before God speaks, or otherwise than God speaks, nothing can come of that but what always has come of it-blunders, sins, misery, and manifold ruin.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " We must keep our ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "hearts",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " silent too. The sweet voices of pleading affections, the loud cry of desires and instincts that roar for their food like beasts of prey, the querulous complaints of disappointed hopes, the groans and sobs of black-robed sorrows, the loud hubbub and Babel, like the noise of a great city, that every man carries within, must be stifled and coerced into silence. We have to take the animal in us by the throat, and sternly say, ‘Lie down there and be quiet.’ We have to silence tastes and inclinations. We have to stop our ears to the noises around, however sweet the songs, and to close many an avenue through which the world’s music might steal in. He cannot say, ‘My soul is silent unto God,’ whose whole being is buzzing with vanities and noisy with the din of the market-place. Unless we have something, at least, of that great stillness, our hearts will have no peace, and our religion no reality.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " There must be the silence of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "mind",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as well as of the heart and will. We must not have our thoughts ever occupied with other things, but must cultivate the habit of detaching them from earth, and keeping our minds still before God, that He may pour His light into them. Surely if ever any generation needed the preaching-’Be still and let God speak’-we need it. Even religious men are so busy with spreading or defending Christianity, that they have little time, and many of them less inclination, for quiet meditation and still communion with God. Newspapers, and books, and practical philanthropy, and Christian effort, and business, and amusement, so crowd into our lives now, that it needs some resolution and some planning to get a clear space where we can be quiet, and look at God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But the old law for a noble and devout life is not altered by reason of any new circumstances. It still remains true that a mind silently waiting before God is the condition without which such a life is impossible. As the flowers follow the sun, and silently hold up their petals to be tinted and enlarged by his shining, so must we, if we would know the joy of God, hold our souls, wills, hearts, and minds still before Him, whose voice commands, whose love warms, whose truth makes fair, our whole being. God speaks for the most part in such silence only. If the soul be full of tumult and jangling noises, His voice is little likely to be heard. As in some kinds of deafness, a perpetual noise in the head prevents hearing any other sounds, the rush of our own fevered blood, and the throbbing of our own nerves, hinder our catching His tones. It is the calm lake which mirrors the sun, the least catspaw wrinkling the surface wipes out all the reflected glories of the heavens. If we would mirror God our souls must be calm. If we would hear God our souls must be silence.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Alas, how far from this is our daily life! Who among us dare to take these words as the expression of our own experience? Is not the troubled sea which cannot rest, whose waters cast up mire and dirt, a truer emblem of our restless, labouring souls than the calm lake? Put your own selves by the side of this Psalmist, and honestly measure the contrast. It is like the difference between some crowded market-place all full of noisy traffickers, ringing with shouts, blazing in sunshine, and the interior of the quiet cathedral that looks down on it all, where are coolness and subdued light, and silence and solitude. ‘Come, My people! enter thou into thy chambers, and shut thy doors about thee.’ ‘Commune with your own heart and be still.’ ‘In quietness and confidence shall be your strength.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " This man’s profession of utter resignation is perhaps too high for us; but we can make his ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "self-exhortation",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " our own. ‘My soul! wait thou only upon God.’ Perfect as he ventures to declare his silence towards God, he yet feels that he has to stir himself up to the effort which is needed to preserve it in its purity. Just because he can say, ‘My soul waits,’ therefore he bids his soul wait.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " I need not dwell upon that self-stimulating as involving the great mystery of our personality, whereby a man exalts himself above himself, and controls, and guides, and speaks to his soul. But a few words may be given to that thought illustrated here, of the necessity for conscious effort and self-encouragement, in order to the preservation of the highest religious emotion.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " We are sometimes apt to forget that no holy thoughts or feelings are in their own nature permanent, and the illusion that they are so, often tends to accelerate their fading. It is no wonder if we in our selectest hours of ‘high communion with the living God’ should feel as if that lofty experience would last by virtue of its own sweetness, and need no effort of ours to retain it. But it is not so. All emotion tends to exhaustion, as surely as a pendulum to rest, or as an Eastern torrent to dry up. All our flames burn to their extinction. There is but one fire that blazes and is not consumed. Action is the destruction of tissue. Life reaches its term in death. Joy and sorrow, and hope and fear, cannot be continuous. They must needs wear themselves out and fade into a grey uniformity like mountain summits when the sun has left them.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Our religious experience too will have its tides, and even those high and pure emotions and dispositions that bind us to God can only be preserved by continual effort. Their existence is no guarantee of their permanence, rather is it a guarantee of their transitoriness, unless we earnestly stir up ourselves to their renewal. Like the emotions kindled by lower objects, they perish while they glow, and there must be a continual recurrence to the one Source of light and heat if the brilliancy is to be preserved.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Nor is it only from within that their continuance is menaced. Outward forces are sure to tell upon them The constant wash of the sea of life undermines the cliffs and wastes the coasts. The tear and wear of external occupations is ever acting upon our religious life. Travellers tell us that the constant friction of the sand on Egyptian hieroglyphs removes every trace of colour, and even effaces the deep-cut characters from basalt rocks. So the unceasing attrition of multitudinous trifles will take all the bloom off your religion, and efface the name of the King cut on the tables of your hearts, if you do not counteract them by constant earnest effort. Our devotion, our faith, our love are only preserved by being constantly renewed.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " That vigorous effort is expressed here by the very form of the phrase. The same word which began the first clause begins the second also. As in the former it represented for us, with an emphatic ‘Truly,’ the struggle through which the Psalmist had reached the height of his blessed experience, so here it represents in like manner the earnestness of the self-exhortation which he addresses to himself. He calls forth all his powers to the conflict, which is needed even by the man who has attained to that height of communion, if he would remain where he has climbed. And for us, brethren! who shrink from taking these former words upon our lips, how much greater the need to use our most strenuous efforts to quiet our souls. If the summit reached can only be held by earnest endeavour, how much more is needed to struggle up to it from the valleys below!",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The silence of the soul before God is no mere passiveness. It requires the intensest energy of all our being to keep all our being still and waiting upon Him. So put all your strength into the task, and be sure that your soul is never so intensely alive as when in deepest abnegation it waits hushed before God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Trust no past emotions. Do not wonder if they should fade even when they are brightest. Do not let their evanescence tempt you to doubt their reality. But always when our hearts are fullest of His love, and our spirits stilled with the sweetest sense of His solemn presence, stir yourselves up to keep firm hold of the else passing gleam, and in your consciousness let these two words live in perpetual alternation: ‘Truly my soul waiteth upon God. My soul! wait thou only upon God.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "62:1-7 We are in the way both of duty and comfort, when our souls wait upon God; when we cheerfully give up ourselves, and all our affairs, to his will and wisdom; when we leave ourselves to all the ways of his providence, and patiently expect the event, with full satisfaction in his goodness. See the ground and reason of this dependence. By his grace he has supported me, and by his providence delivered me. He only can be my Rock and my salvation; creatures are nothing without him, therefore I will look above them to him. Trusting in God, the heart is fixed. If God be for us, we need not fear what man can do against us. David having put his confidence in God, foresees the overthrow of his enemies. We have found it good to wait upon the Lord, and should charge our souls to have such constant dependence upon him, as may make us always easy. If God will save my soul, I may well leave every thing else to his disposal, knowing all shall turn to my salvation. And as David's faith in God advances to an unshaken stedfastness, so his joy in God improves into a holy triumph. Meditation and prayer are blessed means of strengthening faith and hope.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "My soul, wait thou only upon God - See the notes at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 62:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". There is, in the word used here, and rendered wait, the same idea of rest or repose which occurs in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 62:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The meaning is, that he would commit the whole cause to God, and that his soul would thus be calm and without apprehension.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "For my expectation is from him - In Psalm 62:1, this is salvation. The idea here is, that all that he expected or hoped for must come from God. He did not rely on his fellow men; he did not rely on himself. God alone could deliver him, and he confidently believed that God would do it. Often are we in such circumstances that we feel that our only \"expectation\" - our only hope - is in God. All our strength fails; all our resources are exhausted; our fellow-men cannot or will not aid us; our own efforts seem to be vain; our plans are frustrated, and we are shut up to the conclusion that God alone can help us. How often is this felt by a Christian parent in regard to the conversion of his children. All his own efforts seem to be vain; all that he says is powerless; his hopes, long-cherished, are disappointed; his very prayers seem not to be heard; and he is made to feel that his only hope is in God - a sovereign God - and that the whole case must be left in His hands. This state of mind, when it is fully reached, is often all that is needful in order that our desires may be granted. It is desirable that this state of mind should be produced; and when it is produced, the prayer is answered. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "For my expectation is from him - In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 62:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", this is salvation. The idea here is, that all that he expected or hoped for must come from God. He did not rely on his fellow men; he did not rely on himself. God alone could deliver him, and he confidently believed that God would do it. Often are we in such circumstances that we feel that our only \"expectation\" - our only hope - is in God. All our strength fails; all our resources are exhausted; our fellow-men cannot or will not aid us; our own efforts seem to be vain; our plans are frustrated, and we are shut up to the conclusion that God alone can help us. How often is this felt by a Christian parent in regard to the conversion of his children. All his own efforts seem to be vain; all that he says is powerless; his hopes, long-cherished, are disappointed; his very prayers seem not to be heard; and he is made to feel that his only hope is in God - a sovereign God - and that the whole case must be left in His hands. This state of mind, when it is fully reached, is often all that is needful in order that our desires may be granted. It is desirable that this state of mind should be produced; and when it is produced, the prayer is answered. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5, 6. (Compare Ps 62:1, 2).",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "The Treasury of David",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5 My soul, wait thou only upon God; for my expectation is from him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "6 He only is my rock and my salvation: he is my defence; I shall not be moved.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "7 In God is my salvation and my glory: the rock of my strength, and my refuge, is in God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "8 Trust in him at all times; ye people, pour out your heart before him: God is a refuge for us. Selah.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 62:5",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 62:5",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"My soul, wait thou only upon God.\" When we have already practised a virtue, it is yet needful that we bind ourselves to a continuance in it. The soul is apt to be dragged away from its anchorage, or is readily tempted to add a second confidence to the one sole and sure ground of reliance; we must, therefore, stir ourselves up to maintain the holy position which we were at first able to assume. Be still silent, O my soul! submit thyself completely, trust immovably, wait patiently. Let none of thy enemies' imaginings, consultings, flatteries, or maledictions cause thee to break the King's peace. Be like the sheep before her shearers, and like thy Lord, conquer by the passive resistance of victorious patience: thou canst only achieve this as thou shalt be inwardly persuaded of God's presence, and as thou waitest solely and alone on him. Unmingled faith is undismayed. Faith with a single eye sees herself secure, but if her eye be darkened by two confidences, she is blind and useless. \"For my expectation is from him.\" We expect from God because we believe in him. Expectation is the child of prayer and faith, and is owned of the Lord as an acceptable grace. We should desire nothing but what it would be right for God to give, then our expectation would be all from God; and concerning truly good things we should not look to second causes, but to the Lord alone, and so again our expectation would be all from him. The vain expectations of worldly men come not; they promise, but there is no performance; our expectations are on the way, and in due season will arrive to satisfy our hopes. Happy is the man who feels that all he has, all he wants, and all he expects are to be found in his God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 62:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 62:6",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"He only is my rock and my salvation.\" Alone, and without other help, God is the foundation and completion of my safety. We cannot too often hear the toll of that great bell only; let it ring the death-knell of all carnal reliances, and lead us to cast ourselves on the bare arm of God. \"He is my defence.\" Not my defender only, but my actual protection. I am secure, because he is faithful. \"I shall not be moved\" - not even in the least degree. See how his confidence grows. In the Psalm 62:2 an adverb qualified his quiet; here, however, it is absolute; he altogether defies the rage of his adversaries, he will not stir an inch, nor be made to fear even in the smallest degree. A living faith grows; experience develops the spiritual muscles of the saint, and gives a manly force which our religious childhood has not yet reached.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"He only is my rock and my salvation.\" Alone, and without other help, God is the foundation and completion of my safety. We cannot too often hear the toll of that great bell only; let it ring the death-knell of all carnal reliances, and lead us to cast ourselves on the bare arm of God. \"He is my defence.\" Not my defender only, but my actual protection. I am secure, because he is faithful. \"I shall not be moved\" - not even in the least degree. See how his confidence grows. In the ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 62:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " an adverb qualified his quiet; here, however, it is absolute; he altogether defies the rage of his adversaries, he will not stir an inch, nor be made to fear even in the smallest degree. A living faith grows; experience develops the spiritual muscles of the saint, and gives a manly force which our religious childhood has not yet reached.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 62:7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 62:7",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "In God is my salvation and my glory. Wherein should we glory but in him who saves us? Our honour may well be left with him who secures our souls. To find all in God, and to glory that it is so, is one of the sure, marks of an enlightened soul. \"The rock of my strength, and my refuge is in God.\" He multiplies titles, for he would render much honour to the Lord, whom he had tried, and proved to be a faithful God under so many aspects; Ignorance needs but few words, but when experience brings a wealth of knowledge, we need varied expressions to serve as coffers for our treasure. God who is our rock when we flee for shelter, is also our strong rock when we stand firm and defy the foe; he is to be praised under both characters. Observe how the Psalmist brands his own initials upon every name which he rejoicingly gives to his God - my expectation, my rock, my salvation, my glory, my strength, my refuge; he is not content to know that the Lord is all these things; he acts faith towards him, and lays claim to him under every character. What are the mines of Peru or Golconda to me if I have no inheritance in them? It is the word my which puts the honey into the comb. If our experience has not yet enabled us to realise the Lord under any of these consoling titles, we must seek grace that we may yet be partakers of their sweetness. The bees in some way or other penetrate the flowers and collect their juices; it must be hard for them to enter the closed cups and mouthless bags of some of the favourites of the garden, yet the honey-gatherers find or make a passage; and in this they are our instructors, for into each delightful name, character, and office of our covenant God our persevering faith must find an entrance, and from each it must draw delight.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 62:8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 62:8",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Trust in him at all times.\" Faith is an abiding duty, a perpetual privilege. We should trust when we can see, as well as when we are utterly in the dark. Adversity is a fit season for faith; but prosperity is not less so. God at all times deserves our confidence. We at all times need to place our confidence in him. A day without trust in God is a day of wrath, even if it be a day of mirth. Lean ever, ye saints, on him, on whom the world leans. \"Ye people, pour out flour heart before him.\" Ye to whom his love is revealed, reveal yourselves to him. His heart is set on you, lay bare your hearts to him. Turn the vessel of your soul upside down in his secret presence, and let your inmost thoughts, desires, sorrows, and sins be poured out like water. Hide nothing from him, for you can hide nothing. To the Lord unburden your soul - let him be your only father-confessor, for he only can absolve you when he has heard your confession. To keep our griefs to ourselves is to hoard up wretchedness. The stream will swell and rage if you dam it up: give it a clear course, and it leaps along and creates no alarm. Sympathy we need, and if we unload our hearts at Jesus' feet, we shall obtain a sympathy as practical as it is sincere, as consolatory as it is ennobling. The writer in the Westminster Assembly's Annotations well observes that it is the tendency of our wicked nature to bite on the bridle, and hide our grief in sullenness; but the gracious soul will overcome this propensity, and utter its sorrow before the Lord. \"God is a refuge for us.\" Whatever he may be to others, his own people have a peculiar heritage in him; \"for us\" he is undoubtedly a refuge; here then is the best of reasons for resorting to him whenever sorrows weigh upon our bosoms. Prayer is peculiarly the duty of those to whom the Lord has specially revealed himself as their defence.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Selah.\" Precious pause! Timely silence! Sheep may well lie down when such pasture is before them. ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "My soul, wait thou only upon God,.... Be silent and subject to him, acquiesce in his providences, rest in him patiently and quietly, wait for his salvation; See Gill on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 62:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; perhaps some new temptation might arise, and David's soul began to be uneasy and impatient; for frames are very changeable things; and therefore he encourages it to be still and quiet, and patiently wait on the Lord, and on him only: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for my expectation is from him; or \"my hope\", as the Targum; the grace of hope is from the Lord, and the thing hoped for is from him; he is the author and the object of it; and his word of promise encourages to the exercise of it; or \"my patience\"; as the Septuagint, Vulgate Latin, and Arabic versions. The grace of patience is from the Lord; the means of it is his word; and it is exercised, tried, and increased by afflictions sent and sanctified by him; and \"expectation\" is nothing else than these graces in exercise, a waiting patiently for things hoped for Old Testament saints expected the first coming of Christ; New Testament saints expect his second coming; and all expect good things from him in time and eternity; nor shall their expectation fail and perish; and therefore is a reason why their souls should wait only on the Lord. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "for my expectation is from him; or \"my hope\", as the Targum; the grace of hope is from the Lord, and the thing hoped for is from him; he is the author and the object of it; and his word of promise encourages to the exercise of it; or \"my patience\"; as the Septuagint, Vulgate Latin, and Arabic versions. The grace of patience is from the Lord; the means of it is his word; and it is exercised, tried, and increased by afflictions sent and sanctified by him; and \"expectation\" is nothing else than these graces in exercise, a waiting patiently for things hoped for Old Testament saints expected the first coming of Christ; New Testament saints expect his second coming; and all expect good things from him in time and eternity; nor shall their expectation fail and perish; and therefore is a reason why their souls should wait only on the Lord. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "{e} My soul, wait thou only upon God; for my expectation is from him.",
        "children": [
          {
            "element": "span",
            "class": "cverse3",
            "text": "{e}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " My soul, wait thou only upon God; for my expectation ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " from him.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) David was greatly moved by these troubles, therefore he stirs up himself to trust in God.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Only unto God be thou silent, my soul,",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "For from him cometh my hope.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "It is only by constant self-exhortation that the calmness of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Psalm 62:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 62:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " can be maintained, especially when the recollection of his enemies’ double-faced behaviour stirs his indignation. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 37:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ‘My hope’ = ‘my salvation’ (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Psalm 62:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 62:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "), the deliverance which I look for.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "5–8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The opening verses are repeated, with slight variations, leading up to an exhortation to the Psalmist’s sympathisers to trust in God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 5-8.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - From the thought of his bitter enemies and their wicked machinations against him, the psalmist returns to expressions of his own full confidence in God - first falling back on almost the identical words of his opening stanza (comp. vers. 5, 6 with vers. 1, 2); then slightly varying them (ver. 7); and finally commending trust and confidence to the remnant of the people who continue faithful to God and to his anointed (ver. 8). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 5.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "My soul, wait thou only upon God.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Compare the opening words of the psalm, which are nearly identical. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "For my expectation is from him.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " \"Expectation\"  here takes the place of \"salvation\" in ver. 1. Otherwise there is no difference. The God who has given salvation in the past is the Being from whom it is expected in the future. Psalm 62:5",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The beginning of the second group goes back and seizes upon the beginning of the first. אך is affirmative both in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 62:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 62:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The poet again takes up the emotional affirmations of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 62:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 62:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and, firm and defiant in faith, opposes them to his masked enemies. Here what he says to his soul is very similar to what he said of his soul in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 62:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", inasmuch as he makes his own soul objective and exalts himself above her; and it is just in this that the secret of personality consists. He here admonishes her to that silence which in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 62:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " he has already acknowledged as her own; because all spiritual existence as being living remains itself unchanged only by means of a perpetual \"becoming\" (mittelst steten Werdens), of continuous, self-conscious renovation. The \"hope\" in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 62:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is intended to be understood according to that which forms its substance, which here is nothing more nor less than salvation, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 62:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". That for which he who resigns himself to God hopes, comes from God; it cannot therfore fail him, for God the Almighty One and plenteous in mercy is surety for it. David renounces all help in himself, all personal avenging of his own honour - his salvation and his honour are על־אלהים (vid., on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 7:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The rock of his strength, i.e., his strong defence, his refuge, is בּאלהים; it is where Elohim is, Elohim is it in person (בּ as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 26:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). By עם, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 62:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the king addresses those who have reamined faithful to him, whose feeble faith he has had to chide and sustain in other instances also in the Psalms belonging to this period. The address does not suit the whole people, who had become for the most part drawn into the apostasy. Moreover it would then have been עמּי (my people). עם frequently signifies the people belonging to the retinue of a prince (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 3:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), or in the service of any person of rank (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 19:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), or belonging to any union of society whatever (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 4:42",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".). David thus names those who cleave to him; and the fact that he cannot say \"my people\" just shows that the people as a body had become alienated from him. But those who have remained to him of the people are not therefore to despair; but they are to pour out before God, who will know how to protect both them and their king, whatever may lie heavily upon their heart. ",
        "children": []
      }
    ]
  }
]