[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(1) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "When Samuel was old.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—We are not able with any precision to fix the dates of Samuel’s life. When the great disaster happened which resulted in the capture of the Ark of God and Eli’s death. the young prophet was barely thirty years old. For the next twenty years we have seen how unweariedly he laboured to awaken in the people a sense of their deep degradation and of the real causes of their fallen state. Thus, when the great revolt and the Israelite victory at Eben-ezer took place, Samuel the judge was probably nearly fifty years of age. Another considerable apse of time must be assumed between the day of the uprising of the people and the throwing off the Philistine yoke and the events related at such length in the present chapter—the request of the people for an earthly king; for we must allow a sufficient lapse of time for the Philistines to have recovered the effects of their defeat at Eben-ezer, and again to have established themselves in power, at least in the southern districts of Canaan. A famous Hebrew commentator suggests seventy years of age as the most likely time of life. This supposition is, likely enough, a correct one.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The following little table, showing the events in the life of Samuel, will assist the student of the Bible story:—",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1st period, 12 years 2 period about 15 to 20 years.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The child life in the Tabernacle service, under the guardianship of Eli. The boy is called by the holy Voice to be a prophet; Josephus states that this happened in his twelfth year. The boy-prophet remains in Shiloh The people gradually come to the knowledge that a new prophet had risen up among them. He stays with Eli until his death, after the disastrous battle of Aphek and the capture of the Ark. Shiloh was probably destroyed by the Philistines after the battle of Aphek.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "3rd period, 20 year.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "He works unweariedly up and down among the people, and rouses them to renounce idolatry, and under the Eternal’s protection to win their freedom.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "4th period, probably nearly 20 years. 5th period.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Samuel judges Israel, now a free nation, again. The Eternal God-Friend acknowledged by the people as King. Samuel the seer and judge and Saul the king govern Israel.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(2) They were judges in Beer-sheba.—It was natural that the father, as the infirmities of old age were beginning to make his toilsome life more burden some, should turn to his sons, and endeavour to train them up to share in his high duties, but beyond the natural regret of a father that the honours and dignities he had himself so hardly won should pass from his house for ever, no murmur seems to have escaped Samuel’s lips when the will of the Eternal was made known to him; and the aged prophet, forgetting he had sons and a house which bore his name, was the principal agent in the establishment of the king, in whom all the powers of the judge were to be merged. It is probable that at the time when old age was beginning to enfeeble the strength of Samuel, and many of the duties devolved upon his worthless sons, the Philistines recovered much of their lost power over the southern districts of Israel. The names of these sons are especially significant of the holy atmosphere their father lived in. Joel signifies Jehovah is God; and Abiah, Jehovah a Father. But the glorious traditions of Samuel were quickly forgotten by these unworthy men who called him father. Josephus supplements the Biblical record by stating that while one of these sons remained in Beer-sheba, the other “judged” in the north of the land.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(2) ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "They were judges in Beer-sheba.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—It was natural that the father, as the infirmities of old age were beginning to make his toilsome life more burden some, should turn to his sons, and endeavour to train them up to share in his high duties, but beyond the natural regret of a father that the honours and dignities he had himself so hardly won should pass from his house for ever, no murmur seems to have escaped Samuel’s lips when the will of the Eternal was made known to him; and the aged prophet, forgetting he had sons and a house which bore his name, was the principal agent in the establishment of the king, in whom all the powers of the judge were to be merged. It is probable that at the time when old age was beginning to enfeeble the strength of Samuel, and many of the duties devolved upon his worthless sons, the Philistines recovered much of their lost power over the southern districts of Israel. The names of these sons are especially significant of the holy atmosphere their father lived in. Joel signifies Jehovah is God; and Abiah, Jehovah a Father. But the glorious traditions of Samuel were quickly forgotten by these unworthy men who called him father. Josephus supplements the Biblical record by stating that while one of these sons remained in Beer-sheba, the other “judged” in the north of the land.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1 Samuel 8:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 8:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Samuel was old — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "And so unfit for his former travels and labours. He is not supposed to have been now above sixty years of age; but he had spent his strength and spirits in the fatigue of public business; and now if he thinks to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shake himself as at other times, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "he finds he is mistaken; age has cut his hair. They that are in the prime of their years, ought to be busy in doing the work of life; for as they go into years, they will find themselves less disposed to it, and less capable of it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He made his sons judges — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Not supreme judges, for of such there was to be but one, and that of God’s choosing; and Samuel still kept that office in his own hands, (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 7:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ";) but his deputies, to go about and determine matters, with reservation, however, of a right of appeal to himself. He had doubtless instructed them in a singular manner, and fitted them for the highest employments; and he hoped that the example he had set them, and the authority he still had over them, would oblige them to diligence and faithfulness in their trust.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8:1-3 It does not appear that Samuel's sons were so profane and vicious as Eli's sons; but they were corrupt judges, they turned aside after lucre. Samuel took no bribes, but his sons did, and then they perverted judgment. What added to the grievance of the people was, that they were threatened by an invasion from Nahash, king of the Ammonites.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "This verse implies a long period, probably not less than 20 years, of which we have no account except what is contained in the brief notice in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 7:13-17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The general idea conveyed is of a time of peace and prosperity, analogous to that under other Judges. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "CHAPTER 8",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1Sa 8:1-18. Occasioned by the Ill- Government of Samuel's Sons, the Israelites Ask a King.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1-5. when Samuel was old—He was now about fifty-four years of age, having discharged the office of sole judge for twelve years. Unable, from growing infirmities, to prosecute his circuit journeys through the country, he at length confined his magisterial duties to Ramah and its neighborhood (1Sa 7:15), delegating to his sons as his deputies the administration of justice in the southern districts of Palestine, their provincial court being held at Beer-sheba. The young men, however, did not inherit the high qualities of their father. Having corrupted the fountains of justice for their own private aggrandizement, a deputation of the leading men in the country lodged a complaint against them in headquarters, accompanied with a formal demand for a change in the government. The limited and occasional authority of the judges, the disunion and jealousy of the tribes under the administration of those rulers, had been creating a desire for a united and permanent form of government; while the advanced age of Samuel, together with the risk of his death happening in the then unsettled state of the people, was the occasion of calling forth an expression of this desire now.Samuel makes his sons judges over Israel; their names, and ill government,  1 Samuel 8:1-3. The people ask a king: Samuel is grieved; prays,  1 Samuel 8:4-6. God is displeased with the people; but commands Samuel to hearken to them, and to represent to them the tyrannical government of kings,  1 Samuel 8:7-9; which he doth,  1 Samuel 8:10-18. The people continue in their request: God commands Samuel to yield to them,  1 Samuel 8:19-22.  when Samuel was old,  and so unable for his former travels and labours, he made his sons judges; not supreme judges, for such there was to be but one, and that of God’s choosing, and Samuel still kept that office in his own hands,  1 Samuel 7:15; but his vicegerents or deputies, who might go about and determine matters, but with reservation of a right of appeals to himself. He advanceth his sons to this place, not so much out of paternal indulgence, the sad effects whereof he had seen in Eli; but because he had doubtless instructed them in a singular manner, and fitted them for the highest employments; and he hoped that the example he had set them, and the inspection and authority he still had over them, would have obliged them to diligence and faithfulness in the execution of their trust. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "1-5. when Samuel was old—He was now about fifty-four years of age, having discharged the office of sole judge for twelve years. Unable, from growing infirmities, to prosecute his circuit journeys through the country, he at length confined his magisterial duties to Ramah and its neighborhood (1Sa 7:15), delegating to his sons as his deputies the administration of justice in the southern districts of Palestine, their provincial court being held at Beer-sheba. The young men, however, did not inherit the high qualities of their father. Having corrupted the fountains of justice for their own private aggrandizement, a deputation of the leading men in the country lodged a complaint against them in headquarters, accompanied with a formal demand for a change in the government. The limited and occasional authority of the judges, the disunion and jealousy of the tribes under the administration of those rulers, had been creating a desire for a united and permanent form of government; while the advanced age of Samuel, together with the risk of his death happening in the then unsettled state of the people, was the occasion of calling forth an expression of this desire now.Samuel makes his sons judges over Israel; their names, and ill government, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bldvs",
            "text": " 1 Samuel 8:1-3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The people ask a king: Samuel is grieved; prays, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bldvs",
            "text": " 1 Samuel 8:4-6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". God is displeased with the people; but commands Samuel to hearken to them, and to represent to them the tyrannical government of kings, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bldvs",
            "text": " 1 Samuel 8:7-9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; which he doth, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bldvs",
            "text": " 1 Samuel 8:10-18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The people continue in their request: God commands Samuel to yield to them, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bldvs",
            "text": " 1 Samuel 8:19-22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "when Samuel was old, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and so unable for his former travels and labours, he made his sons judges; not supreme judges, for such there was to be but one, and that of God’s choosing, and Samuel still kept that office in his own hands, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bldvs",
            "text": " 1 Samuel 7:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; but his vicegerents or deputies, who might go about and determine matters, but with reservation of a right of appeals to himself. He advanceth his sons to this place, not so much out of paternal indulgence, the sad effects whereof he had seen in Eli; but because he had doubtless instructed them in a singular manner, and fitted them for the highest employments; and he hoped that the example he had set them, and the inspection and authority he still had over them, would have obliged them to diligence and faithfulness in the execution of their trust. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And it came to pass, when Samuel was old,.... The common notion of the Jews is, that he lived but fifty two years (t); when a man is not usually called an old man, unless the infirmities of old age came upon him sooner than they commonly do, through his indefatigable labours from his childhood, and the cares and burdens of government he had long bore; though some think he was about sixty years of age; and Abarbinel is of opinion that he was more than seventy. It is a rule with the Jews (u), that a man is called an old man at sixty, and a grey headed man at seventy: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that he made his sons judges over Israel; under himself, not being able through old age to go the circuits he used; he sent them, and appointed them to hear and try causes in his stead, or settled them in some particular places in the land, and, as it seems by what follows, at Beersheba; though whether that was under his direction, or was their own choice, is not certain. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(t) Seder Olam Rabba, ut supra. (c. 13. p. 35.) (u) Pirke Abot, c. 5. sect. 21. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(t) Seder Olam Rabba, ut supra. (c. 13. p. 35.) (u) Pirke Abot, c. 5. sect. 21. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And it came to pass, when Samuel was old, that he {a} made his sons judges over Israel.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And it came to pass, when Samuel was old, that he ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{a}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " made his sons judges over Israel.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) Because he was not able to bear the charge.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 8:1-5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Request of the people for a king",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "when Samuel was old",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] A considerable time, probably not much less than 20 years, must have elapsed since the victory of Ebenezer, before Samuel required the help of his sons on the ground of old age, and some years more before their misgovernment became so flagrant as to give occasion for the request of the elders. On the chronology see Introd. p. 22 ff.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 1.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "When Samuel was old.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " As Samuel lived for very many years after this time, till towards the close of Saul's reign, he was probably not more than sixty when this happened. The dates are all very uncertain, but he was probably between twenty and thirty when Shiloh was captured, and no doubt, according to Israelite custom, had married as soon as he arrived at manhood. Then came the most important and active period of his life, during which the ark rested for twenty years in the house of Abinadab, and Samuel was traversing every part of the country, preaching repentance, and preparing the people for a revolt from the tyranny of the Philistines. Upon this followed the victory at Mizpah, and the establishment of Samuel as judge. Now some considerable time would elapse before Samuel so felt the weight of increasing years as to delegate a part of his authority to his sons, and more again before the national discontent at their covetousness became general. The Talmud, however, represents Samuel as being at this time only fifty-two years of age, while Abravanel says seventy, and the latter number is by no means impossible; for as a Nazarite Samuel would lead a life of perfect temperance, and his predecessor Eli lived to be ninety-eight, and died then by an accident. Still, probably, Abravanel's calculation is too high, and we must remember that besides the misconduct of Samuel's sons, there was the growing danger of the re-establishment of the domination of the Philistines to quicken the people's movements. They had garrisons again in Israel when Saul was chosen king, and it was this which made the nation long for a change, but. their choice would probably have fallen upon one of Samuel's sons had either of them been worthy. A king they had long wished for; it is only when they saw that none of Samuel's race would give them internal peace and security that they took public action for the appointment of some one else. 1 Samuel 8:1",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The reason assigned for the appointment of Samuel's sons as judges is his own advanced age. The inference which we might draw from this alone, namely, that they were simply to support their father in the administration of justice, and that Samuel had no intention of laying down his office, and still less of making the supreme office of judge hereditary in his family, is still more apparent from the fact that they were stationed as judges of the nation in Beersheba, which was on the southern border of Canaan (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 20:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.; see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 21:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The sons are also mentioned again in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 6:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", though the name of the elder has either been dropped out of the Masoretic text or has become corrupt.",
        "children": []
      }
    ]
  }
]