[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1 Samuel 8:8-9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 8:8-9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "So do they also unto thee — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Thou farest no worse than myself. This he speaks for Samuel’s comfort and vindication. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Yet protest solemnly unto them — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That, if it be possible, thou mayest yet prevent their sin and misery. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Show them the manner of the king — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That is, of the kings which they desire, like those of other nations. Show them at large into what a state of servitude they are going to throw themselves by casting off the government of judges, set over them by myself, and subjecting themselves to the power of such kings as rule in other nations. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8:4-9 Samuel was displeased; he could patiently bear what reflected on himself, and his own family; but it displeased him when they said, Give us a king to judge us, because that reflected upon God. It drove him to his knees. When any thing disturbs us, it is our interest, as well as our duty, to show our trouble before God. Samuel is to tell them that they shall have a king. Not that God was pleased with their request, but as sometimes he opposes us from loving-kindness, so at other times he gratifies us in wrath; he did so here. God knows how to bring glory to himself, and serves his own wise purposes, even by men's foolish counsels.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "See the margin which implies that the thing spoken of caused anger, indignation, or some revulsion of feeling (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 21:11-12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The answer of the Lord ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 8:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " shows that Samuel's personal feelings had been hurt. They were soothed by being reminded of the continued ingratitude of the people to God Himself, upon whom, in fact, a greater slight was put by this very request for a king \"like all the nations,\" than upon Samuel (compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 10:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 15:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 15:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). For a comment on this transaction, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 13:9-11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 13:21-22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6-10. the thing displeased Samuel when they said, Give us a king to judge us—Personal and family feelings might affect his views of this public movement. But his dissatisfaction arose principally from the proposed change being revolutionary in its character. Though it would not entirely subvert their theocratic government, the appointment of a visible monarch would necessarily tend to throw out of view their unseen King and Head. God intimated, through Samuel, that their request would, in anger, be granted, while at the same time he apprised them of some of the evils that would result from their choice.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Thou farest no worse than myself.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " This he speaks for Samuel’s comfort and vindication. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "According to all the works which they have done since the day that I brought them out of Egypt,.... This was no new thing; all that they had done since they were wonderfully favoured of God, as to be brought out of Egyptian bondage, was all of a piece with this; one continued series of ingratitude, of rebellion against God, and against his servants, that he employed under him, as Moses, Aaron, &c. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "even unto this day, wherewith they have forsaken me, and served other gods; this is what this people were always addicted to, to east off the worship and service of God, and go into idolatry: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "so do they also unto thee; acted the like ungrateful part to him for all the service he had done them, from his childhood to that time; wherefore, as the disciple is not above his master, nor the servant above his lord, if such things as before observed were done to Jehovah himself, Samuel could not expect to meet with better treatment, other than he had, see Matthew 10:24. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "so do they also unto thee; acted the like ungrateful part to him for all the service he had done them, from his childhood to that time; wherefore, as the disciple is not above his master, nor the servant above his lord, if such things as before observed were done to Jehovah himself, Samuel could not expect to meet with better treatment, other than he had, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 10:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "According to all the works which they have done since the day that I brought them up out of Egypt even unto this day, wherewith they have forsaken me, and served other gods, so do they also unto thee.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "so do they also unto thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 15:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 8, 9.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "According to all the works,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " etc. They showed in this the same want of respect and affection for their own institutions and religious privileges which had marked all their history since the day when Jehovah brought them up out of Egypt. And therefore Samuel was to ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "protest solemnly unto them, and show them.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The two verbs do not mean different things, but the same. \"To protest\" is to testify, to bear witness, and warn them of the danger they were incurring. And as they were asking not for the development and perfecting of their own institutions, but for a government modelled upon the institutions of the heathen round them, Samuel shows what are the dangers inherent in the establishment of a despot such as the kings of the heathen were. As a rule the kings of Judaea did not resemble the picture drawn by Samuel, but in spite of many blemishes remained tame to their allegiance to Jehovah as the supreme Ruler of the nation, and confined themselves within the limits marked out for them by the Mosaic law. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Now therefore,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " at the beginning of the verse, is in the Hebrew simply \"And now.\" There is no inference implied in it.  1 Samuel 8:8",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Nevertheless \"the thing displeased Samuel when they said,\" etc. This serves to explain הדּבר, and precludes the supposition that Samuel's displeasure had reference to what they had said concerning his own age and the conduct of his sons. At the same time, the reason why the petition for a king displeased the prophet, was not that he regarded the earthly monarchy as irreconcilable with the sovereignty of God, or even as untimely; for in both these cases he would not have entered into the question at all, but would simply have refused the request as ungodly or unseasonable. But \"Samuel prayed to the Lord,\" i.e., he laid the matter before the Lord in prayer, and the Lord said (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 8:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "): \"Hearken unto the voice of the people in all that they say unto thee.\" This clearly implies, that not only in Samuel's opinion, but also according to the counsel of God, the time had really come for the establishment of the earthly sovereignty in Israel. In this respect the request of the elders for a king to reign over them was perfectly justifiable; and there is no reason to say, with Calvin, \"they ought to have had regard to the times and conditions prescribed by God, and it would no doubt have come to pass that the regal power would have grown up in the nation. Although, therefore, it had not yet been established, they ought to have waited patiently for the time appointed by God, and not to have given way to their own reasons and counsels apart from the will of God.\" For God had not only appointed no particular time for the establishment of the monarchy; but in the introduction to the law for the king, \"When thou shalt say, I will set a king over me,\" He had ceded the right to the representatives of the nation to deliberate upon the matter. Nor did they err in this respect, that while Samuel was still living, it was not the proper time to make use of the permission that they had received; for they assigned as the reason for their application, that Samuel had grown old: consequently they did not petition for a king instead of the prophet who had been appointed and so gloriously accredited by God, but simply that Samuel himself would give them a king in consideration of his own age, in order that when he should become feeble or die, they might have a judge and leader of the nation. Nevertheless the Lord declared, \"They have not rejected thee, but they have rejected me, that I should not reign over them. As they have always done from the day that I brought them up out of Egypt unto this day, that they have forsaken me and served other gods, so do they also unto thee.\" This verdict on the part of God refers not so much to the desire expressed, as to the feelings from which it had sprung. Externally regarded, the elders of Israel had a perfect right to present the request; the wrong was in their hearts.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Calvin has correctly pointed out how much would have been warrantable under the circumstances: \"They might, indeed, have reminded Samuel of his old age, which rendered him less able to attend to the duties of his office, and also of the avarice of his sons and the corruptness of the judges; or they might have complained that his sons did not walk in his footsteps, and have asked that God would choose suitable men to govern them, and thus have left the whole thing to His will. And if they had done this, there can be no doubt that they would have received a gracious and suitable answer. But they did not think of calling upon God; they demanded that a king should be given them, and brought forward the customs and institutions of other nations.\")",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "They not only declared to the prophet their confidence in his administration of his office, but they implicitly declared him incapable of any further superintendence of their civil and political affairs. This mistrust was founded upon mistrust in the Lord and His guidance. In the person of Samuel they rejected the Lord and His rule. They wanted a king, because they imagined that Jehovah their God-king was not able to secure their constant prosperity. Instead of seeking for the cause of the misfortunes which had hitherto befallen them in their own sin and want of fidelity towards Jehovah, they searched for it in the faulty constitution of the nation itself. In such a state of mind as this, their desire for a king was a contempt and rejection of the kingly government of Jehovah, and was nothing more than forsaking Jehovah to serve other gods. (See 1 Samuel 10:18-19, and 1 Samuel 12:7., where Samuel points out to the people still more fully the wrong that they have committed.) ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "They not only declared to the prophet their confidence in his administration of his office, but they implicitly declared him incapable of any further superintendence of their civil and political affairs. This mistrust was founded upon mistrust in the Lord and His guidance. In the person of Samuel they rejected the Lord and His rule. They wanted a king, because they imagined that Jehovah their God-king was not able to secure their constant prosperity. Instead of seeking for the cause of the misfortunes which had hitherto befallen them in their own sin and want of fidelity towards Jehovah, they searched for it in the faulty constitution of the nation itself. In such a state of mind as this, their desire for a king was a contempt and rejection of the kingly government of Jehovah, and was nothing more than forsaking Jehovah to serve other gods. (See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 10:18-19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 12:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "., where Samuel points out to the people still more fully the wrong that they have committed.) ",
            "children": []
          }
        ]
      }
    ]
  }
]