[[],[{"type":"header","content":"Arrangement of the Camps"},{"type":"prose","content":"The LORD spoke to Moses and Aaron, saying, "}],[{"type":"prose","content":"“The sons of Israel shall camp, each by his own standard, with the banners of their fathers’ households; they shall camp around the Tent of Meeting (tabernacle), but at a distance. "}],[{"type":"prose","content":"Those who camp on the east side toward the sunrise  of the standard of the camp of Judah, by their armies; and Nahshon the son of Amminadab shall lead the sons of Judah, "}],[{"type":"prose","content":"and his army as numbered totaled 74,600. "}],[{"type":"prose","content":"Next to Judah [on the east side] the tribe of Issachar shall encamp; and Nethanel the son of Zuar shall lead the sons of Issachar, "}],[{"type":"prose","content":"and his army as numbered totaled 54,400. "}],[{"type":"prose","content":"Then [also on the east side] the tribe of Zebulun; and Eliab the son of Helon shall lead the sons of Zebulun, "}],[{"type":"prose","content":"and his army as numbered totaled 57,400. "}],[{"type":"prose","content":"The total of the numbered men [in the three tribes on the east side] in the camp of Judah was 186,400, by their armies. They shall move out first [on the march]."}],[{"type":"prose","content":"“On the south side shall be the standard of the camp of Reuben, by their armies; and Elizur the son of Shedeur shall lead the sons of Reuben, "}],[{"type":"prose","content":"and his army as numbered totaled 46,500. "}],[{"type":"prose","content":"Those who camp next to Reuben [on the south side] shall be the tribe of Simeon; and Shelumiel the son of Zurishaddai shall lead the sons of Simeon, "}],[{"type":"prose","content":"and his army as numbered totaled 59,300. "}],[{"type":"prose","content":"Then [completing the south side] the tribe of Gad; and Eliasaph the son of Reuel (Deuel) shall lead the sons of Gad, "}],[{"type":"prose","content":"and his army as numbered totaled 45,650. "}],[{"type":"prose","content":"The total of the numbered men [in the three tribes on the south side] in the camp of Reuben was 151,450, by their armies. They shall move out second [on the march]."}],[{"type":"prose","content":"“Then the Tent of Meeting (tabernacle) shall move out with the camp of the Levites in the middle of the [other] camps; just as they camp so shall they move out, every man in his place by their standards."}],[{"type":"prose","content":"“On the west side shall be the standard of the camp of Ephraim, by their armies; and Elishama the son of Ammihud shall lead the sons of Ephraim, "}],[{"type":"prose","content":"and his army as numbered totaled 40,500. "}],[{"type":"prose","content":"Beside Ephraim [on the west side] shall be the tribe of Manasseh; and Gamaliel the son of Pedahzur shall lead the sons of Manasseh, "}],[{"type":"prose","content":"and his army as numbered totaled 32,200. "}],[{"type":"prose","content":"Then [completing the west side shall be] the tribe of Benjamin; and Abidan the son of Gideoni shall lead the sons of Benjamin, "}],[{"type":"prose","content":"and his army as numbered totaled 35,400. "}],[{"type":"prose","content":"The total of the numbered men [of the three tribes on the west side] in the camp of Ephraim was 108,100, by their armies. They shall move out in third place."}],[{"type":"prose","content":"“On the north side shall be the standard of the camp of Dan, by their armies; and Ahiezer the son of Ammishaddai shall lead the sons of Dan, "}],[{"type":"prose","content":"and his army as numbered totaled 62,700. "}],[{"type":"prose","content":"Encamped next to Dan [on the north side] shall be the tribe of Asher; and Pagiel the son of Ochran shall lead the sons of Asher, "}],[{"type":"prose","content":"and his army as numbered totaled 41,500. "}],[{"type":"prose","content":"Then [completing the north side]  the tribe of Naphtali; and Ahira the son of Enan shall lead the sons of Naphtali, "}],[{"type":"prose","content":"and his army as numbered totaled 53,400. "}],[{"type":"prose","content":"The total of the numbered men [of the three tribes on the north side] in the camp of Dan was 157,600. They shall move out last, standard after standard.”"}],[{"type":"prose","content":"These are the men of the Israelites [twenty years old and upward] as numbered by their fathers’ households. The total of the numbered men of the camps by their armies, 603,550. "}],[{"type":"prose","content":"But the Levites were not numbered with the [other] Israelites, just as the LORD had commanded Moses. "}],[{"type":"prose","content":"Thus the Israelites did [as ordered]; according to everything the LORD had commanded Moses, so they camped by their standards, and so they moved out, everyone with his family (clan), according to his fathers’ household."}]]