[{"num":2,"verse":"The Lord said to Moses and Aaron,"},{"num":2,"verse":"The Israelites shall encamp, each by his own [tribal] standard or banner with the ensign of his father’s house, opposite the Tent of Meeting and facing it on every side."},{"num":3,"verse":"On the east side toward the sunrise shall they of the standard of the camp of Judah encamp by their companies; Nahshon son of Amminadab being the leader of the sons of Judah."},{"num":4,"verse":"Judah’s host as numbered totaled 74,600."},{"num":5,"verse":"Next to Judah the tribe of Issachar shall encamp, Nethanel son of Zuar being the leader of the sons of Issachar."},{"num":6,"verse":"Issachar’s host as numbered totaled 54,400."},{"num":7,"verse":"Then the tribe of Zebulun, Eliab son of Helon being the leader of the sons of Zebulun."},{"num":8,"verse":"Zebulun’s host as numbered totaled 57,400."},{"num":9,"verse":"All these [three tribes] numbered in the camp of Judah totaled 186,400. They shall set forth first [on the march]."},{"num":10,"verse":"On the south side shall be the standard of the camp of Reuben by their companies, the leader of the sons of Reuben being Elizur son of Shedeur."},{"num":11,"verse":"Reuben’s host as numbered totaled 46,500."},{"num":12,"verse":"Those who encamp next to Reuben shall be the tribe of Simeon, the leader of the sons of Simeon being Shelumiel son of Zurishaddai."},{"num":13,"verse":"Simeon’s host as numbered totaled 59,300."},{"num":14,"verse":"Then the tribe of Gad, the leader of the sons of Gad being Eliasaph son of Reuel (Deuel)."},{"num":15,"verse":"Gad’s host as numbered totaled 45,650."},{"num":16,"verse":"The whole number in [the three tribes of] the camp of Reuben was 151,450. They shall take second place [on the march]."},{"num":17,"verse":"Then the Tent of Meeting shall set out, with the camp of the Levites in the midst of the camps; as they encamp so shall they set forward, every man in his place, standard after standard."},{"num":18,"verse":"On the west side shall be the standard of the camp of Ephraim by their companies, the leader of the sons of Ephraim being Elishama son of Ammihud."},{"num":19,"verse":"Ephraim’s host as numbered totaled 40,500."},{"num":20,"verse":"Beside Ephraim shall be the tribe of Manasseh, the leader of the sons of Manasseh being Gamaliel son of Pedahzur."},{"num":21,"verse":"Manasseh’s host as numbered totaled 32,200."},{"num":22,"verse":"Then the tribe of Benjamin, the leader of the sons of Benjamin being Abidan son of Gideoni."},{"num":23,"verse":"Benjamin’s host as numbered totaled 35,400."},{"num":24,"verse":"The whole number [of the three tribes] in the camp of Ephraim totaled 108,100. They shall go forward in third place."},{"num":25,"verse":"The standard of the camp of Dan shall be on the north side [of the tabernacle] by their companies, the leader of the sons of Dan being Ahiezer son of Ammishaddai."},{"num":26,"verse":"Dan’s host as numbered totaled 62,700."},{"num":27,"verse":"Encamped next to Dan shall be the tribe of Asher, the leader of the sons of Asher being Pagiel son of Ochran."},{"num":28,"verse":"Asher’s host as numbered totaled 41,500."},{"num":29,"verse":"Then the tribe of Naphtali, the leader of the sons of Naphtali being Ahira son of Enan."},{"num":30,"verse":"Naphtali’s host as numbered totaled 53,400."},{"num":31,"verse":"The whole number [of the three tribes] in the camp of Dan totaled 157,600. They shall set out last, standard after standard."},{"num":32,"verse":"These are the Israelites as numbered by their fathers’ houses. All in the camps who were numbered by their companies were 603,550."},{"num":33,"verse":"But the Levites were not numbered with the Israelites, for so the Lord commanded Moses."},{"num":34,"verse":"Thus the Israelites did according to all the Lord commanded Moses; so they encamped by their standards, and so they set forward, everyone with his [tribal] families, according to his father’s house."}]