[{"header":"Instructions for Setting Up Israel’s Camp"},{"num":2,"verse":"The Lord told Moses and Aaron "},{"num":2,"verse":"how the Israelites should arrange their camp:"},{"num":3,"verse":"Judah and the tribes that march with it must set up camp on the east side of the sacred tent, under their own banner. The 74,600 troops of the tribe of Judah will be arranged by divisions and led by Nahshon son of Amminadab. "},{"num":5,"verse":"On one side of Judah will be the tribe of Issachar, with Nethanel son of Zuar as the leader of its 54,400 troops. "},{"num":7,"verse":"On the other side will be the tribe of Zebulun, with Eliab son of Helon as the leader of its 57,400 troops. "},{"num":9,"verse":"These 186,400 troops will march into battle first."},{"num":10,"verse":"Reuben and the tribes that march with it must set up camp on the south side of the sacred tent, under their own banner. The 46,500 troops of the tribe of Reuben will be arranged by divisions and led by Elizur son of Shedeur. "},{"num":12,"verse":"On one side of Reuben will be the tribe of Simeon, with Shelumiel son of Zurishaddai as the leader of its 59,300 troops. "},{"num":14,"verse":"On the other side will be the tribe of Gad, with Eliasaph son of Deuel as the leader of its 45,650 troops. "},{"num":16,"verse":"These 151,450 troops will march into battle second."},{"num":17,"verse":"Marching behind Reuben will be the Levites, arranged in groups, just as they are camped. They will carry the sacred tent and their own banners."},{"num":18,"verse":"Ephraim and the tribes that march with it must set up camp on the west side of the sacred tent, under their own banner. The 40,500 troops of the tribe of Ephraim will be arranged by divisions and led by Elishama son of Ammihud. "},{"num":20,"verse":"On one side of Ephraim will be the tribe of Manasseh, with Gamaliel son of Pedahzur as the leader of its 32,200 troops. "},{"num":22,"verse":"On the other side will be the tribe of Benjamin, with Abidan son of Gideoni as the leader of its 35,400 troops. "},{"num":24,"verse":"These 108,100 troops will march into battle third."},{"num":25,"verse":"Dan and the tribes that march with it must set up camp on the north side of the sacred tent, under their own banner. The 62,700 troops of the tribe of Dan will be arranged by divisions and led by Ahiezer son of Ammishaddai. "},{"num":27,"verse":"On one side of Dan will be the tribe of Asher, with Pagiel son of Ochran as the leader of its 41,500 troops. "},{"num":29,"verse":"On the other side will be the tribe of Naphtali with Ahira son of Enan as the leader of its 53,400 troops. "},{"num":31,"verse":"These 157,600 troops will march into battle last."},{"num":32,"verse":"So all the Israelites in the camp were counted according to their ancestral families. The troops were arranged by divisions and totaled 603,550. "},{"num":33,"verse":"The only Israelites not included were the Levites, just as the Lord had commanded Moses."},{"num":34,"verse":"Israel did everything the Lord had told Moses. They arranged their camp according to clans and families, with each tribe under its own banner. And that was the order by which they marched into battle."}]