[{"header":"Organization of the Camps"},{"num":2,"verse":"The Lord spoke to Moses and Aaron: "},{"num":2,"verse":"“The Israelites are to camp under their respective banners beside the flags of their ancestral families. They are to camp around the tent of meeting at a distance from it:"},{"num":3,"verse":"Judah’s military divisions will camp on the east side toward the sunrise under their banner. The leader of the descendants of Judah is Nahshon son of Amminadab. "},{"num":4,"verse":"His military division numbers 74,600. "},{"num":5,"verse":"The tribe of Issachar will camp next to it. The leader of the Issacharites is Nethanel son of Zuar. "},{"num":6,"verse":"His military division numbers 54,400. "},{"num":7,"verse":"The tribe of Zebulun will be next. The leader of the Zebulunites is Eliab son of Helon. "},{"num":8,"verse":"His military division numbers 57,400. "},{"num":9,"verse":"The total number in their military divisions who belong to Judah’s encampment is 186,400; they will move out first."},{"num":10,"verse":"Reuben’s military divisions will camp on the south side under their banner. The leader of the Reubenites is Elizur son of Shedeur. "},{"num":11,"verse":"His military division numbers 46,500. "},{"num":12,"verse":"The tribe of Simeon will camp next to it. The leader of the Simeonites is Shelumiel son of Zurishaddai. "},{"num":13,"verse":"His military division numbers 59,300. "},{"num":14,"verse":"The tribe of Gad will be next. The leader of the Gadites is Eliasaph son of Deuel. "},{"num":15,"verse":"His military division numbers 45,650. "},{"num":16,"verse":"The total number in their military divisions who belong to Reuben’s encampment is 151,450; they will move out second."},{"num":17,"verse":"The tent of meeting is to move out with the Levites’ camp, which is in the middle of the camps. They are to move out just as they camp, each in his place, with their banners."},{"num":18,"verse":"Ephraim’s military divisions will camp on the west side under their banner. The leader of the Ephraimites is Elishama son of Ammihud. "},{"num":19,"verse":"His military division numbers 40,500. "},{"num":20,"verse":"The tribe of Manasseh will be next to it. The leader of the Manassites is Gamaliel son of Pedahzur. "},{"num":21,"verse":"His military division numbers 32,200. "},{"num":22,"verse":"The tribe of Benjamin will be next. The leader of the Benjaminites is Abidan son of Gideoni. "},{"num":23,"verse":"His military division numbers 35,400. "},{"num":24,"verse":"The total in their military divisions who belong to Ephraim’s encampment number 108,100; they will move out third."},{"num":25,"verse":"Dan’s military divisions will camp on the north side under their banner. The leader of the Danites is Ahiezer son of Ammishaddai. "},{"num":26,"verse":"His military division numbers 62,700. "},{"num":27,"verse":"The tribe of Asher will camp next to it. The leader of the Asherites is Pagiel son of Ochran. "},{"num":28,"verse":"His military division numbers 41,500. "},{"num":29,"verse":"The tribe of Naphtali will be next. The leader of the Naphtalites is Ahira son of Enan. "},{"num":30,"verse":"His military division numbers 53,400. "},{"num":31,"verse":"The total number who belong to Dan’s encampment is 157,600; they are to move out last, with their banners.”"},{"num":32,"verse":"These are the Israelites registered by their ancestral families. The total number in the camps by their military divisions is 603,550. "},{"num":33,"verse":"But the Levites were not registered among the Israelites, just as the Lord had commanded Moses."},{"num":34,"verse":"The Israelites did everything the Lord commanded Moses; they camped by their banners in this way and moved out the same way, each man by his clan and by his ancestral family."}]