[{"header":"The Order of Darius"},{"num":6,"verse":"So King Darius gave an order to search the writings of the kings before him. The writings were kept in Babylon in the same place the money was kept."},{"num":2,"verse":"A scroll was found in the fortress of Ecbatana. (Ecbatana is in the province of Media.) This is what was written on that scroll:"},{"num":3,"verse":"During the first year that Cyrus was king, he gave an order about the Temple of God in Jerusalem. The order said:"},{"num":4,"verse":"Its wall will be in layers that have three rows of large stones and one row of wooden timbers. The cost of building the Temple must be paid for from the king’s treasury."},{"num":5,"verse":"Also, the gold and silver things from God’s Temple must be put back in their places. Nebuchadnezzar took them from the Temple in Jerusalem and brought them to Babylon. They must be put back in God’s Temple."},{"num":6,"verse":"So King Darius sent this message to his officials:"},{"num":7,"verse":"Don’t bother the workers. Don’t try to stop the work on this Temple of God. Let the Jewish governor and the Jewish leaders rebuild it. Let them rebuild God’s Temple in the same place it was in the past."},{"num":8,"verse":"Now I give this order. You must do this for the Jewish leaders building God’s Temple: The cost of the building must be fully paid from the king’s treasury. The money will come from the taxes collected from the provinces in the area west of the Euphrates River. Do these things quickly, so the work will not stop."},{"num":9,"verse":"Give them anything they need. If they need young bulls, rams, or male lambs for sacrifices to the God of heaven, give these things to them. If the priests of Jerusalem ask for wheat, salt, wine, and oil, give these things to them every day without fail."},{"num":10,"verse":"Give them to the Jewish priests so that they may offer sacrifices that please the God of heaven. Give these things so that the priests may pray for me and my sons."},{"num":11,"verse":"Also, I give this order: If anyone changes this order, a wooden beam must be pulled from their house and pushed through their body. Then their house must be destroyed until it is only a pile of rocks."},{"num":12,"verse":"God put his name there in Jerusalem. May God defeat any king or other person who tries to change this order. If anyone tries to destroy this Temple in Jerusalem, may God destroy that person."},{"header":"The Temple Completed and Dedicated"},{"num":13,"verse":"So Tattenai the governor of the area west of the Euphrates River, Shethar Bozenai, and the men with them obeyed King Darius’ order. They obeyed the order quickly and completely."},{"num":14,"verse":"So the Jewish leaders continued to build. Encouraged by the preaching of Haggai the prophet and Zechariah son of Iddo, they had great success. They finished building the Temple as the God of Israel had commanded and as Cyrus, Darius, and Artaxerxes, the kings of Persia, had ordered."},{"num":15,"verse":"The Temple was finished on the third day of the month of Adar. That was in the sixth year of the rule of King Darius."},{"num":16,"verse":"Then the Israelites celebrated the dedication of God’s Temple with much happiness. The priests, the Levites, and all the other people who came back from captivity joined in the celebration."},{"num":17,"verse":"This is the way they dedicated God’s Temple: They offered 100 bulls, 200 rams, and 400 male lambs. And they offered twelve male goats for all Israel for a sin offering. That is one goat for each of the twelve tribes of Israel."},{"num":18,"verse":"Then they chose the priests in their groups and the Levites in their groups to serve in God’s Temple in Jerusalem. They did these things as it is written in the Book of Moses."},{"header":"The Passover"},{"num":19,"verse":" On the fourteenth day of the first month, the Jews who came back from captivity celebrated the Passover."},{"num":20,"verse":"The priests and Levites made themselves pure. They all made themselves clean and ready to celebrate the Passover. The Levites killed the Passover lamb for all the Jews who came back from captivity. They did that for their brothers the priests, and for themselves."},{"num":21,"verse":"So all the Israelites who came back from captivity ate the Passover meal. Other people washed themselves and made themselves pure from the unclean things of the people living in that country. These pure people also shared in the Passover meal. They did this so that they could go to the Lord, the God of Israel, for help."},{"num":22,"verse":"They celebrated the Festival of Unleavened Bread with much joy for seven days. The Lord made them very happy because he had changed the attitude of the king of Assyria. So the king of Assyria had helped them do the work on God’s Temple."}]