[{"header":"Darius’s Search"},{"num":6,"verse":"King Darius gave the order, and they searched in the library of Babylon in the archives. "},{"num":2,"verse":"But it was in the fortress of Ecbatana in the province of Media that a scroll was found with this record written on it:"},{"header":"Darius’s Decree"},{"num":13,"verse":"Then Tattenai governor of the region west of the Euphrates River, Shethar-bozenai, and their colleagues diligently carried out what King Darius had decreed. "},{"num":14,"verse":"So the Jewish elders continued successfully with the building under the prophesying of Haggai the prophet and Zechariah son of Iddo. They finished the building according to the command of the God of Israel and the decrees of Cyrus, Darius, and King Artaxerxes of Persia. "},{"num":15,"verse":"This house was completed on the third day of the month of Adar in the sixth year of the reign of King Darius."},{"header":"Temple Dedication and the Passover"},{"num":16,"verse":"Then the Israelites, including the priests, the Levites, and the rest of the exiles, celebrated the dedication of the house of God with joy. "},{"num":17,"verse":"For the dedication of God’s house they offered 100 bulls, 200 rams, and 400 lambs, as well as 12 male goats as a sin offering for all Israel—one for each Israelite tribe. "},{"num":18,"verse":"They also appointed the priests by their divisions and the Levites by their groups to the service of God in Jerusalem, according to what is written in the book of Moses."},{"num":19,"verse":"The exiles observed the Passover on the fourteenth day of the first month. "},{"num":20,"verse":"All of the priests and Levites were ceremonially clean, because they had purified themselves. They killed the Passover lamb for themselves, their priestly brothers, and all the exiles. "},{"num":21,"verse":"The Israelites who had returned from exile ate it, together with all who had separated themselves from the uncleanness of the Gentiles of the land in order to worship Yahweh, the God of Israel. "},{"num":22,"verse":"They observed the Festival of Unleavened Bread for seven days with joy, because the Lord had made them joyful, having changed the Assyrian king’s attitude toward them, so that he supported them in the work on the house of the God of Israel."}]