[{"header":"King Darius Verifies the Decree"},{"num":6,"verse":"Then King Darius issued an order to search the Hall of Records where the Babylonian archives were stored. "},{"num":2,"verse":"The following was found written on a scroll in Ecbatana at the summer palace of the province of Media:"},{"header":"King Darius Confirms the Decree"},{"num":13,"verse":"Because of what King Darius had mandated, Tattenai, the Trans-Euphrates Governor, Shethar-bozenai, and their colleagues carried out his orders quickly."},{"header":"Progress and Completion"},{"num":14,"verse":"And so the Jewish leaders continued their building, and prospered because of the prophecies of Haggai the prophet and Iddo’s son Zechariah. They completed the rebuilding in accordance with the commandment from the God of Israel and the edicts of Cyrus, Darius, and Artaxerxes, king of Persia. "},{"num":15,"verse":"The Temple was completed on the third day of the month Adar during the sixth year of the reign of King Darius."},{"num":16,"verse":"The Israelis—the priests, the descendants of Levi, and the other related descendants who had returned from captivity—celebrated with joy at the dedication of the Temple of God. "},{"num":17,"verse":"At the dedication offering of the Temple of God, they presented 100 bulls, 200 rams, and 400 lambs, along with a sin offering of twelve male goats for the entire nation of Israel according to the number of the tribes of Israel."},{"num":18,"verse":"Furthermore, they established the priests in their divisions and the descendants of Levi in their positions for the service of God conducted at Jerusalem, as is proscribed in the Book of Moses."},{"header":"The First Post-Captivity Passover(A)"},{"num":19,"verse":"The former exiles observed the Passover on the fourteenth day of the first month "},{"num":20,"verse":"because the priests and descendants of Levi had purified themselves together—all of them were pure—and they killed the Passover lamb for every former exile, for their relatives the priests, and for themselves."},{"num":21,"verse":"So the Israelis who had returned from captivity ate the Passover with all who had consecrated themselves from the uncleanness of the nations of the land in order to seek the Lord God of Israel. "},{"num":22,"verse":"Then they observed the Festival of Unleavened Bread for seven days with joy, because the Lord had made them glad, turning the heart of the king of Assyria toward them and strengthening them for their work on the Temple of God, the God of Israel."}]