[{"header":"King Darius Finds King Cyrus’ Memorandum"},{"num":6,"verse":"Then King Darius gave the order to search the library where the archives were stored in Babylon. "},{"num":2,"verse":"A scroll was found in the palace of Ecbatana, which is in the province of Media. This was written on it:"},{"num":13,"verse":"Then Governor Tattenai from the province west of the Euphrates River, Shethar Bozenai, and their group did exactly what King Darius had ordered. "},{"num":14,"verse":"So the Jewish leaders continued to make progress because of the message from the prophet Haggai and Zechariah, the grandson of Iddo. They finished building as the Elah of Israel had ordered and as Cyrus, Darius, and Artaxerxes (the kings of Persia) had ordered. "},{"num":15,"verse":"This temple was finished on the third day of the month of Adar in the sixth year of King Darius’ reign."},{"header":"The Temple Is Completed and Dedicated"},{"num":16,"verse":"Then the people of Israel, the priests, the Levites, and the others who had returned from exile celebrated at the dedication of Elah’s temple. "},{"num":17,"verse":"At the dedication of Elah’s temple, they sacrificed 100 bulls, 200 rams, and 400 lambs. They sacrificed 12 male goats as an offering for sin, one goat for each of the tribes of Israel."},{"num":18,"verse":"The priests were assigned to their divisions and the Levites to their groups to lead the worship of Elah in Jerusalem by following the directions written in the Book of Moses."},{"header":"The Passover Is Celebrated"},{"num":19,"verse":"On the fourteenth day of the first month, those who had returned from exile celebrated the Passover. "},{"num":20,"verse":"Since the priests and Levites had cleansed themselves, all of them were now clean. They killed the Passover lambs for all the people who had returned from exile, for the rest of the priests, and for themselves. "},{"num":21,"verse":"The lambs were eaten by the Israelites who had returned from exile and by all who had separated themselves from the unclean practices of the non-Jews in the land to worship Yahweh Elohim of Israel. "},{"num":22,"verse":"So for seven days they celebrated the Festival of Unleavened Bread because Yahweh had made them joyful. Yahweh had made the king of Assyria change his mind so that he supported the people in their work on the temple of Elohim, the Elohim of Israel."}]