[{"num":6,"verse":"So King Darius issued orders that a search be made in the Babylonian archives, where documents were stored."},{"num":2,"verse":"Eventually the record was found in the palace at Ecbatana, in the province of Media. This is what it said:"},{"num":3,"verse":"“In this first year of the reign of King Cyrus, a decree has been sent out concerning the Temple of God at Jerusalem where the Jews offer sacrifices. It is to be rebuilt, and the foundations are to be strongly laid. The height will be ninety feet and the width will be ninety feet. "},{"num":4,"verse":"There will be three layers of huge stones in the foundation, topped with a layer of new timber. All expenses will be paid by the king. "},{"num":5,"verse":"And the gold and silver bowls, which were taken from the Temple of God by Nebuchadnezzar, shall be taken back to Jerusalem and put into the Temple as they were before.”"},{"num":6,"verse":"So King Darius II sent this message to Governor Shethar-bozenai and the other officials west of the Euphrates:"},{"num":7,"verse":"and don’t molest the governor of Judah and the other leaders in their work. "},{"num":8,"verse":"Moreover, I decree that you are to pay the full construction costs without delay from my taxes collected in your territory. "},{"num":9,"verse":"Give the priests in Jerusalem young bulls, rams, and lambs for burnt offerings to the God of heaven; and give them wheat, wine, salt, and olive oil each day without fail. "},{"num":10,"verse":"Then they will be able to offer acceptable sacrifices to the God of heaven and pray for me and my sons. "},{"num":11,"verse":"Anyone who attempts to change this message in any way shall have the beams pulled from his house and built into a gallows on which he will be hanged; and his house shall be reduced to a pile of rubble. "},{"num":12,"verse":"The God who has chosen the city of Jerusalem will destroy any king and any nation that alters this commandment and destroys this Temple. I, Darius, have issued this decree; let it be obeyed with all diligence.”"},{"num":13,"verse":"Governors Tattenai and Shethar-bozenai, and their companions complied at once with the command of King Darius."},{"num":14,"verse":"So the Jewish leaders continued in their work, and they were greatly encouraged by the preaching of the prophets Haggai and Zechariah (son of Iddo)."},{"num":15,"verse":"The completion date was February 18 in the sixth year of the reign of King Darius II."},{"num":16,"verse":"The Temple was then dedicated with great joy by the priests, the Levites, and all the people. "},{"num":17,"verse":"During the dedication celebration 100 young bulls, 200 rams, and 400 lambs were sacrificed; and twelve male goats were presented as a sin offering for the twelve tribes of Israel. "},{"num":18,"verse":"Then the priests and Levites were divided into their various service corps to do the work of God as instructed in the laws of Moses."},{"num":19,"verse":"The Passover was celebrated on the first day of April. "},{"num":20,"verse":"For by that time many of the priests and Levites had consecrated themselves. "},{"num":21,"verse":"And some of the heathen people who had been relocated in Judah turned from their immoral customs and joined the Israelis in worshiping the Lord God. They, with the entire nation, ate the Passover feast and celebrated the Feast of Unleavened Bread for seven days. There was great joy throughout the land because the Lord had caused the king of Assyria to be generous to Israel and to assist in the construction of the Temple."}]