[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(10, 11) “We need not such profitless teaching; we already have sustenance which is ‘meat indeed,’ by which the heart is established.” According to the Law, the priests (they. who “serve the Tabernacle,” see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 8:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") received for themselves a greater or smaller portion of the animals offered as peace-offerings and trespass-offerings; in some cases, also, the flesh of the sin-offerings fell to their lot (Leviticus 4, 5, 7, 23). When the high priest presented a sin-offering on his own behalf (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 4:3-12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), or for the congregation (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 13:13-21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), he sprinkled some of the blood in the Holy Place in front of the veil; on the Day of Atonement alone was the blood taken within the veil into the Most Holy Place. In the case of these three offerings the priest received no part of the animal sacrificed; certain portions were burnt on the altar of burnt-offering, and the rest of the body was carried forth “without the camp,” and wholly consumed by fire. Though the writer here speaks of animals whose blood is brought into ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the Holy Place",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " through the high priest, as an offering for sin, it is probable that (as in Hebrews 5-9) he has in thought the Day of Atonement only, so that here “the Holy Place” bears the sense of the “Holiest of all.” (See Note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 9:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) (It will be noted that throughout he uses the present tense; see the same Note). For us there is but one sacrifice for sin, the efficacy of which endures for ever (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 10:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "): Jesus entering the Holiest Place for us in virtue of His own sacrifice has fulfilled the type contained in the high priest’s sprinkling of the blood. But whereas those priests might not eat of their sin-offering, to us greater privilege is given; we feed on Him who was slain for us, whose flesh war for the life of the world (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 6:51-56",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). We then (who are all “priests unto God”) “have an altar of which,” on the very principles of their Law, “they that serve the Tabernacle (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 8:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") have no right to eat.” The stress is laid on the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sacrifice, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "of which we eat, not upon the altar itself. If separately interpreted, the altar will be the place of sacrifice, the Cross.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Hebrews",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "OUR ALTAR",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 13:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 13:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "‘We have an altar.’ There is a certain militant emphasis on the words in the original, as if they were an assertion of something that had been denied. Who the deniers are is plain enough. They were the adherents of Judaism, who naturally found Christianity a strange contrast to their worship, of which altar and sacrifice were prominent features.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Just as to heathen nations the ritual of Judaism, its empty shrine, and temple without a God, were a puzzle and a scoff, so to heathen and Jew, the bare, starved worship of the Church, without temple, priest, sacrifice, or altar, was a mystery and a puzzle.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The writer of this letter in those words, then, in accordance with the central theme of his whole Epistle, insists that Christianity has more truly than heathenism or Judaism, altar and sacrifice.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "And he is not content with alleging its possession o£ the reality of the altar, but he goes further, insists upon the superiority, even in that respect, of the Christian system.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "He points to the fact that the great sin-offering of the Jewish ritual was not partaken of by the offerers, but consumed by fire without the camp, and he implies, in the earlier words of my text, that the Christian sacrifice differs from, and is superior to, the Jewish in this particular, that on it the worshippers feasted and fed.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Then, in the last words of my text, he touches upon another point of superiority - viz., that all Christian men are priests of this altar, and have to offer upon it sacrifices of thanksgiving.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "And so he exalts the purely spiritual worship of Christianity as not only possessed of all which the gorgeous rituals round about it presented, but as being high above them even in regard to that which seemed their special prerogative. So, then, we have three things here - our Christian altar; our Christian feast on the sacrifice; and our Christian sacrifices on the altar. Let us regard these successively.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. First, then, our Christian altar.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘We have,’ says the writer, with a triumphant emphasis upon the word, ‘We have an altar’; ‘though there seems none visible in our external worship; and some of our converts miss the sensuous presentation to which they were accustomed; and others are puzzled by it, and taunt us with its absence.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Now it is to be noticed, I think, that though in sacrificial religions the altar is the centre-point round which the temple is reared, it is of no moment in itself, and only comes into consideration as being that upon which the sacrifice is offered. So I do not suppose that any specific object was in the mind of the writer as answering to the altar in those sacrificial systems. He was thinking most of the sacrifice that was laid upon the altar, and of the altar only in connection therewith. But if we are not satisfied with such an explanation of the words, there are two interpretations open to us. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "One is that the Cross is the altar. But that seems to me too gross and material, and savouring too much of the very error which this whole Epistle is written to destroy - viz., that the material is of moment, as measured against the spiritual. The other explanation is much to be preferred, according to which, if the altar has any special significance, it means the divine-human personality of Jesus Christ, on and in which the sacrifice is offered.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "But the main thing to be laid hold of here is, I take it, that the central fact of Christianity is an altar, on which lies a sacrifice. If we are to accept the significance that I have suggested as possible for the emblem of my text, then the altar expresses the great mystery and gospel of the Incarnation, and the sacrifice expresses the great mystery and gospel of the passion of Christ’s life and death, which is the atonement for our sins.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "But that possibly is too much of a refinement, and so I confine myself here to the general ideas suggested - that the very living heart of the gospel is an altar and a sacrifice. That idea saturates the whole New Testament, from the page where John the forerunner’s proclamation is, ‘Behold the Lamb of God, which taketh away the sin of the world,’ to the last triumphant vision in which the Apocalyptic seer ‘beheld a Lamb as it had been slain’; the eternal Co-Regnant of the universe, and the mediation through whom the whole surrounding Church for ever worships the Father.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The days are past, as it seems to me, when any man can reasonably contend that the New Testament does not teach - in every page of it, I was going to say - this truth of the sacrifice of Jesus Christ. Time was when violent contortions and effort were resorted to in order to explain its language as not necessarily involving that significance. But we have got beyond that now, and we oftener hear from deniers this: ‘Oh yes! I admit that throughout the New Testament this sacrificial idea is present, but that is only a chip of the old shell of Judaism, and we are above that level of religious thought.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Now, I am not going to enter upon a discussion, for which neither place nor time are suited; but I will just suggest that the relation between the ancient system of revelation, with its sacrifice, altar, priest, temple, and the new system of Christianity is far more profoundly, and, I believe, far more philosophically, set forth in this Epistle to the Hebrews, as being the relation between shadow and substance, between prophecy and fulfilment, than when the old is contemptuously brushed aside as ‘Hebrew old clothes,’ with which the true Christianity has no concern. Judaism teas because Christ was to be, and the ancient ritual {whether modern ideas of the date of its origin be accepted or no} was a God-appointed mirror, in which, the shadow of the coming event was presented. Jesus Christ is all which temple, priest, altar, sacrifice proclaimed should one day be. And just as the relation between Christ’s work and the Judaic system of external ritual sacrifices is that of shadow and substance, prophecy and fulfilment, so, in analogous manner, the relation between the altar and sacrifice of the New Testament and all the systems of heathenism, with their smoking altars, is that these declare a want, and this affords its supply; that these are the confession of humanity that it is conscious of sin, separation, alienation, and that need of a sacrifice, and that Christ is what heathenism in all lands has wailed that it needs, and has desperately hoped that it might find.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "There are many attempts made to explain on other grounds the universality of sacrifice, and to weaken the force of its witness to the deep necessities of humanity as rooted in the consciousness of sin, but I venture to affirm that all these are superficial, and that the study of comparative religions goes on wrong lines unless it recognises in the whole heathen world a longing, the supply of which it recognises in Jesus Christ and His work. I venture to say that that is a truer philosophy of religion than much that nowadays calls itself by the name.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "And what lies in this great thought? I am not going to attempt a theory of the Atonement. I do not believe that any such thing is completely possible for us. But this, at least, I recognise as being fundamental and essential to the thought of my text; ‘we have an altar,’ that Christ in His representative relation, in His true affinity to every man upon earth, has in His life or death taken upon Himself the consequences of human transgression, not merely by sympathy, nor only by reason of the uniqueness-of His representative relation, but by willing submission to that awful separation from the Father, of which the cry out of the thick darkness of the Cross, ‘Why hast Thou forsaken Me?’ is the unfathomable witness. Thus, bearing our sin, He bears it away, and ‘we have an altar.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Now notice that this great truth has a distinct teaching for those who hanker after externalities of ritual The writer of this Epistle uses it for the purpose of declaring that in the Christian Church, because of its possession of the true sacrifice, there is no room for any other; that priest, temple, altar, sacrifice in any material external forms are an anachronism and a contradiction of the very central idea of the gospel And it seems very strange that sections of Christendom should so have been blind to the very meaning of my text, and so missed the lesson which it teaches, and fallen into the error which it opposes, as that these very words, which are a protest against any materialisation of the idea of altar and sacrifice, should have been twisted to mean by the altar the table of the Lord, and by sacrifice the communion of His body and blood. But so it is. So strong are the tendencies in our weak humanity to grasp at some sensuous embodiment of the truth that the Christian Church, as a whole, has not been able to keep on the lofty levels of my text, and has hungered after some external signs to which it may attach notions of efficacy which attach only to the spiritual sacrifice of Jesus Christ. Thus we have got a strange contradiction, as it seems to me, of the spirit and letter of my text, and of the whole Epistle from which it comes, and there, has crept surreptitiously into, and been obstinately maintained in, large sections of the Christian Church the idea o£ a sacrificing priesthood, and of a true sacrifice offered upon a material altar. My text protests against all that, and said to these early Christians what it says to us: ‘Go into your upper rooms and there offer your worship, which to sense seems so bare and starved. Never mind though people say there is nothing in your system for sense to lay hold of. So much the better. Never mind though you can present no ritual with an altar, and a priest, and a sacrifice. All these are swept away for ever, because once Jesus Christ hath put away sin by the sacrifice of Himself. Our temple is His body; our priest is before the throne. We rear no altar; He has died. Our sacrifice was offered on Calvary, and henceforward our worship, cleared from these materialities, rises unto loftier regions, and we worship God in the spirit, and have no confidence in the flesh.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Still further, this truth has a bearing on the opposite pole of error, on those who would fain have a Christianity without an altar. I am not going to say how far genuine discipleship of Jesus Christ is possible with the omission of this article from the creed. It is no business of mine to determine that, but it is my business, as I think, to assert this, that a Christianity without an altar is a Christianity without power; impotent to move the world or to control the individual heart, inadequate to meet the needs and the cravings of men. Where are the decaying Christians? Where are the Christians that have let go the central fact of an incarnate sacrifice for the world’s sin? The answer to the two questions is the same. Wherever you find a feeble grasp of that central truth, or a faltering utterance of it on the part of the preachers, there you find deadness and formality.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Jesus Christ, and Jesus Christ’s servants, I was going to say, obey the same law, and that law is, no cross, no crown. If Christ has not died, the world’s sacrifice, He will never reign, the world’s King. If His Cross be an altar it is a throne. If it be not, it is merely a gallows, on which a religious enthusiast, with many sweet and lovable qualities, died a long time ago, and it is nothing to me. ‘We have an altar,’ or else we have no religion worth keeping.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. Mark here, secondly, our feast on the sacrifice.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "From this altar, says the writer, the adherents of the ancient system have no right to partake. That implies that those who have left the ancient system have the right to partake, and do partake. Now the writer is drawing a contrast, which he proceeds to elaborate, between the great sacrifice on the Day of Atonement and the sacrifice of Christ on the Cross. The former was not, as many other sacrifices were, partaken of by priests and worshippers, but simply the blood was brought within the holy place, and the whole of the rest of the sacrifice consumed in a waste spot without the camp. And this contrast is in the writer’s mind. We have a sacrifice on which we feast.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "That is to say, the Christ who died for my sins is not only my means of reconciliation with God, but His sacrifice and death are the sustenance of my spiritual life. We live upon the Christ that died for us. That this is no mere metaphor, but goes penetratingly and deep down to the very basis of the spiritual life, is attested sufficiently by many a word of Scripture on which I cannot now dwell. The life of the Christian is the indwelling Christ. For he whose heart hath not received that Christ within him is dead whilst he lives, and has no possession of the one true Hie for a human spirit, viz., the fife of union with God. Christ in us is the consequence of Christ for us; and that Christianity is all imperfect which does not grasp with equal emphasis the thought of the sacrifice or the cross, and of the feast or the sacrifice. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "But how is that feeding on the sacrifice accomplished? ‘He that eateth Me, even he shall ‘live by Me.’ He that believeth, eateth. He that with humble faith makes Christ his very own, and appropriates as the nourishment and basis of his own better life the facts of the life and death of sacrifice, he truly lives thereby. To eat is to believe; to believe is to live.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "I need not remind you, I suppose, how, though there be no reference in the words of my text, as I have tried to show, to the external rite of the communion of the Lord’s body and blood, and though the ‘altar’ here has no reference whatever to that table, yet there is a connection between the two representations, inasmuch as the one declares in words what the other sets forth in symbol, and the meaning of the feast on the sacrifice is expressed by this great word. ‘This is My body, broken for you.’ ‘This is the new covenant in My blood’: ‘Drink ye all of it.’ ‘We have an altar,’ and though it be not the table on which the symbols of our Lord’s sacrificial death are spread for us, yet these symbols and the words of my text, like the words of His great discourse in the sixth chapter of John’s Gospel, point to the same fact, that the spiritual participation of Christ by faith is the reality of ‘eating of Him,’ and the condition of living for ever.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. And now, lastly, my text suggests our Christian offerings on the altar.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘By Him, therefore, let us offer the sacrifice of praise to God continually.’ What are these offerings? Christ’s death stands alone, incapable of repetition, meeting no repetition, the eternal, sole, ‘sufficient obligation and satisfaction for the sins of the whole world.’ But there be other kinds of sacrifice. There are sacrifices of thanksgiving as well as for propitiation. And we, on the footing of that great sacrifice to which we can add nothing, and on which alone we must rest, may bring the offerings of our thankful hearts. These offerings are of a two-fold sort, says the writer. There are words of praise. There are works of beneficence. The service of man is sacrifice to God. That is a deep saying and reaches far. Such praise and such beneficence are only possible on the footing of Christ’s sacrifice, for only on that footing is our praise acceptable; and only when moved by that infinite mercy and love shall we yield ourselves, thank offerings to God. And thus, brethren, the whole extent of the Christian life, in its inmost springs, and in its outward manifestations, is covered by these two thoughts - the ‘feast on the sacrifice once offered, and the sacrifices which we in our turn offer on the altar. If we thus, moved by the mercy of God, ‘yield ourselves as living sacrifices, which is our reasonable service,’ then not only will life be one long thank-offering, but as the Apostle puts it in another place, death itself may become, too, a thankful surrender to Him. For He says, ‘I am ready to be offered.’ And so the thankful heart, resting on the sacrificial life and death of Jesus Christ, makes all life a thanksgiving, ‘death God’s endless mercy seals, and makes the sacrifice complete.’ There is one Christ that can thus hallow and make acceptable our living and our dying, and that is the Christ that has died for us, and lives that in Him we may be priests to God. There is only one Christianity that will do for us what we will need, and that is the Christianity whose centre is an altar, on which the Son of God, our Passover, is slain for us.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Hebrews 13:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 13:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "We have an altar ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— That is, a sacrifice upon an altar, namely, Christ, who was sacrificed on the altar of the cross, who also is the only Christian altar, to which we bring all our sacrifices and services. The apostle, having set forth the only way of the establishment of the heart in faith and holiness, and the uselessness of all distinctions of meats for that purpose, here declares the foundation of all this; for whereas the ground of all distinction of meats and other ceremonies among the Jews was the altar in the tabernacle, with its nature, use, and services, he lets them know that Christians have an altar, and services quite of another kind than those which arose from the altar of old, such as he describes ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 13:13-16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This seems to be the direct design of the apostle in this place, and a proper analysis of his words. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Whereof they have no right to eat ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— To partake of the benefits which we receive therefrom; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "who serve the tabernacle ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Who adhere to the Mosaic law, or who maintain the necessity, and continue the observance, of the Jewish ceremonies and worship. For this in effect was to deny Christ to be come in the flesh, and to have offered himself a sacrifice on the cross.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13:7-15 The instructions and examples of ministers, who honourably and comfortably closed their testimony, should be particularly remembered by survivors. And though their ministers were some dead, others dying, yet the great Head and High Priest of the church, the Bishop of their souls, ever lives, and is ever the same. Christ is the same in the Old Testament day. as in the gospel day, and will be so to his people for ever, equally merciful, powerful, and all-sufficient. Still he fills the hungry, encourages the trembling, and welcomes repenting sinners: still he rejects the proud and self-righteous, abhors mere profession, and teaches all whom he saves, to love righteousness, and to hate iniquity. Believers should seek to have their hearts established in simple dependence on free grace, by the Holy Spirit, which would comfort their hearts, and render them proof against delusion. Christ is both our Altar and our Sacrifice; he sanctifies the gift. The Lord's supper is the feast of the gospel passover. Having showed that keeping to the Levitical law would, according to its own rules, keep men from the Christian altar, the apostle adds, Let us go forth therefore unto him without the camp; go forth from the ceremonial law, from sin, from the world, and from ourselves. Living by faith in Christ, set apart to God through his blood, let us willingly separate from this evil world. Sin, sinners, nor death, will not suffer us to continue long here; therefore let us go forth now by faith and seek in Christ the rest and peace which this world cannot afford us. Let us bring our sacrifices to this altar, and to this our High Priest, and offer them up by him. The sacrifice of praise to God, we should offer always. In this are worship and prayer, as well as thanksgiving.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "We have an altar - We who are Christians. The Jews had an altar on which their sacrifices were offered which was regarded as sacred, and of the benefit of which no others might partake. The design of the apostle is to show that the same thing substantially, so far as \"privilege\" and \"sanctifying influence\" were concerned, was enjoyed by Christians. The \"altar\" to which he here refers is evidently the cross on which the great sacrifice was made.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Whereof they have no right to eat which serve the tabernacle - A part of the meat offered in sacrifice among the Jews became the property of the priests and Levites, and they had, by the Law, a right to this as a part of their support; see Leviticus 6:25-26; Numbers 18:9-10. But the apostle says that there is a higher and more valuable sacrifice of which they have no right to partake while they remain in the service of the \"tabernacle\" or temple; that is, while they remain Jews. The participation in the great Christian sacrifice appertained only to those who were the friends of the Redeemer, and however much they might value themselves on the privilege of partaking of the sacrifices offered under the Jewish Law, that of partaking of the great sacrifice made by the Son of God was much greater.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Whereof they have no right to eat which serve the tabernacle - A part of the meat offered in sacrifice among the Jews became the property of the priests and Levites, and they had, by the Law, a right to this as a part of their support; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 6:25-26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 18:9-10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". But the apostle says that there is a higher and more valuable sacrifice of which they have no right to partake while they remain in the service of the \"tabernacle\" or temple; that is, while they remain Jews. The participation in the great Christian sacrifice appertained only to those who were the friends of the Redeemer, and however much they might value themselves on the privilege of partaking of the sacrifices offered under the Jewish Law, that of partaking of the great sacrifice made by the Son of God was much greater.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Which serve the tabernacle - notes, Hebrews 9:2-3. The Jewish priests and Levites. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Which serve the tabernacle - notes, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 9:2-3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The Jewish priests and Levites. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10. Christianity and Judaism are so totally distinct, that \"they who serve the (Jewish) tabernacle,\" have no right to eat our spiritual Gospel meat, namely, the Jewish priests, and those who follow their guidance in serving the ceremonial ordinance. He says, \"serve the tabernacle,\" not \"serve IN the tabernacle.\" Contrast with this servile worship ours.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "an altar—the cross of Christ, whereon His body was offered. The Lord's table represents this altar, the cross; as the bread and wine represent the sacrifice offered on it. Our meat, which we by faith spiritually eat, is the flesh of Christ, in contrast to the typical ceremonial meats. The two cannot be combined (Ga 5:2). That not a literal eating of the sacrifice of Christ is meant in the Lord's Supper, but a spiritual is meant, appears from comparing Heb 13:9 with Heb 13:10, \"with GRACE, NOT with MEATS.\"",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "We have an altar:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " these strange doctrines are not only unprofitable, but perilous to Christians, since they disinterest all that entertain them, as to any participation of Christ; since his subjects, adhering to his simple and immutable doctrine, have a right and just claim to, and an actual use of, Christ, as their altar, in opposition to the Mosaical; and from whom they have altar sustenance for their souls, in opposition to the Jewish meats, while they attend on him; all the quickening benefits issuing from the sacrifice of his human nature on the altar of his Godhead, as reconciliation and adoption to God, justification of our persons, renovation of our nature, growth in grace, and perseverance therein, to the perfecting of it in glory, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "John 6:55-57 1 Corinthians 9:13 10:16-18",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 6:55-57",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 9:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 10:16-18",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". We have altar sanctification of our persons and offerings in our access to God from him, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Hebrews 13:15 Matthew 23:19 Ephesians 5:20 Colossians 3:17",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 13:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 23:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ephesians 5:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Colossians 3:17",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; so as all is accepted with the Father. We have altar protection and salvation, keeping us who attend on him unto the revelation of God in glory, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Exodus 21:14 Revelation 6:9,11",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 21:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 6:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". This is altar individuation to all Christians; God had but one altar under the law, and he prohibited all others, and complained of and threatened the increase of them, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Exodus 20:24-26 27:1,2 2 Chronicles 4:1 Hosea 8:11 10:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 20:24-26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 27:1,2 ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 4:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 8:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 10:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". This one altar did type out that true one of Christ, by which only sinners can come to God, and find acceptance. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Whereof they have no right to eat which serve the tabernacle; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of this altar privilege all Jews or Judaizing Christians, who adhered to the Mosaical administration of the covenant in meats and ceremonies, have no lawful right or title to partake; they cannot have this honour while they cleave to them, because they thereby deny this altar, reject the Son of God, and are in it rejected by him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "We have an altar,.... By which is meant, not the cross of Christ, on which he was crucified; nor the Lord's table, where his flesh and blood are presented to faith, as food, though not offered; but Christ himself, who is altar, sacrifice, and priest; he was typified by the altar of the burnt offering, and the sacrifice that was offered upon it; the altar was made of Shittim wood, and covered with brass, denoting the incorruptibleness, duration, and strength of Christ: the horns of it, at the four corners, were for refuge; whoever fled to it, and laid hold on them, were safe; so Christ is a refuge to his people, that come from the four corners of the earth; and who believe in him, and lay hold on him, are preserved and protected by his power and grace: the use of it was for sacrifice to be offered upon it; which being a male, without blemish, and wholly burnt with fire, was a sweet savour to God; and which was typical of Christ's human nature, offered on the altar of his divine nature; which was pure and holy, suffered the fire of divine wrath, and was for a sweet smelling savour to God: this altar was but one, and most holy, and sanctified what was put upon it; all which is true of Christ: now this altar the saints have, and have a right to eat of it; even all Christ's friends and beloved ones; all that are made priests unto God by him; all that know him, believe in him, have a spiritual discerning of him, and hunger and thirst after him: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "whereof they have no right to eat that serve the tabernacle: there is something of this altar, or that was offered up upon this altar, that is to be eaten, even the flesh and blood of Christ; and to \"eat\" of it is to believe that Christ is come in the flesh, and is become an offering for sin, and for us that eat; it is to receive, embrace, and possess the blessings procured by it; which is done by faith, with spiritual joy and gladness, and with sincerity and singleness of heart: now those, who served the tabernacle, or adhered to the service of the ceremonial law, they had no right to eat of this altar: the allusion is to the priests' eating of the sacrifices, and to some sacrifices, of which they might not eat, Leviticus 2:10 and this is not to be understood of believers, before the coming of Christ, who did attend tabernacle service; for they ate the same spiritual meat, and drank the same spiritual drink, as believers do now; but of such, who obstinately persisted in the ceremonies of the law, when they were abolished; and so cut off themselves from all right to the substance of these shadows. See Galatians 5:2. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "whereof they have no right to eat that serve the tabernacle: there is something of this altar, or that was offered up upon this altar, that is to be eaten, even the flesh and blood of Christ; and to \"eat\" of it is to believe that Christ is come in the flesh, and is become an offering for sin, and for us that eat; it is to receive, embrace, and possess the blessings procured by it; which is done by faith, with spiritual joy and gladness, and with sincerity and singleness of heart: now those, who served the tabernacle, or adhered to the service of the ceremonial law, they had no right to eat of this altar: the allusion is to the priests' eating of the sacrifices, and to some sacrifices, of which they might not eat, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 2:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and this is not to be understood of believers, before the coming of Christ, who did attend tabernacle service; for they ate the same spiritual meat, and drank the same spiritual drink, as believers do now; but of such, who obstinately persisted in the ceremonies of the law, when they were abolished; and so cut off themselves from all right to the substance of these shadows. See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Galatians 5:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "{7} We have an {f} altar, whereof they have no right to eat which {g} serve the tabernacle.",
        "children": [
          {
            "element": "span",
            "class": "cverse3",
            "text": "{7}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " We have an ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{f}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " altar, whereof they have no right to eat which ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{g}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " serve the tabernacle.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(7) He refutes their error by an apt and fit comparison. They who in times past served the Tabernacle, did not eat of the sacrifices whose blood was brought for sin into the holy place by the high priest. Moreover these sacrifices represented Christ our offering. Therefore they cannot be partakers of him if they serve the tabernacle, that is, stand in the service of the law: but let us not be ashamed to follow him out of Jerusalem, from which he was cast out and suffered for in this also Christ, who is the truth, answers that type in that he suffered outside the gate.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(f) By the altar, he means the offerings.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(g) Of which they cannot be partakers, who stubbornly retain the rites of the law.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Meyer's NT Commentary",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 13:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Justification of ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οὐ βρώμασιν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 13:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", by the emphasizing of the incompatibility of the Christian altar with that of Judaism. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "We possess an altar, of which they have no right to eat who serve the tabernacle, i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " he who seeks in the Jewish sacrificial meals, and consequently in the Jewish sacrificial worship, a stay and support for his heart, thereby shuts himself out from Christianity, for he makes himself a servant of the tabernacle; but he who serves the tabernacle has no claim or title to the altar of Christians. That the subject in ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἔχομεν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the Christian",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is acknowledged on all sides. But equally little ought it ever to have been disputed that by ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οἱ τῇ σκηνῇ λατρεύοντες",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " persons must be denoted who are contrasted with the Christians. For, in accordance with the expression chosen, the author can only mean to say that the Christians possess the right to eat of the altar; those ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τῇ σκηνῇ λατρεύοντες",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", on the other hand, forego this right. Quite in a wrong sense, therefore, have Schlichting, Schulz, Heinrichs, Wieseler (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Schriften der Univ. Kiel aus d. J",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". 1861, p. 42), Kurtz, and others, referred ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οἱ τῇ σκηνῇ λατρεύοντες",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " likewise to the Christians,[125] in that they found expressed the thought: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for Christians there exists no other sacrifice than one of which it is not permitted them to eat",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". They then suppose to be intended by ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οἱ τῇ σκηνῇ λατρεύοντες",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " either, as Schlichting, “omnes in universum Christiani,” or, as Schulz, particular officers of the society, who conducted the Christian worship. But in the first case—apart from the fact that then, what would alone be natural, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐξ οὗ φαγεῖν οὐκ ἔχομεν ἐξουσίαν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " would have been written instead of ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐξ οὗ φαγεῖν οὐκ ἔχουσιν ἐξουσίαν οἱ τῇ σκηνῇ λατρεύοντες",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—the Christians would, as Bleek has already justly observed, have been designated by a characteristic which could not possibly be predicated of them; in the second, an anachronistic separation into clerics and laity would be imputed to the author, and the sense arising would be unsuitable, since the proposition, that the warrant for eating of the Christian sacrifice is wanting, could not possibly hold good of the clergy alone, but must have its application to Christians in general. By ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἡ σκηνή",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " can thus be understood nothing other than the earthly, Jewish sanctuary, as opposed to the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀληθινή",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τελειοτέρα σκηνή",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of Christians, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 8:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 9:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τῇ σκηνῇ λατρεύοντες",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", however, are not specially, as Bleek, de Wette, Delitzsch, Riehm (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Lehrbegr. des Hebräerbr",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". p. 161), Alford, and others suppose, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the Jewish priests",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 8:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), but the members of the Jewish covenant people universally (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 9:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 10:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "θυσιαστήριον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " further is the altar, upon which the sacrifice of the New Covenant, namely, the body of Christ (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 13:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), has been presented. Not “ipse Christus” (Piscator, Owen, Wolf; comp. Calvin), or the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "θυσία",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " itself which has been presented (Limborch, Whitby, M‘Lean, Heinrichs, and others), nor yet the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cultus",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Grotius), can be denoted thereby. But likewise the explaining of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "table of the Supper",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τράπεζα κυρίου",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 10:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", with Corn. a Lapide, Chr. Fr. Schmid, Böhme, Bähr (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Stud. u. Krit",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". 1849, H. 4, p. 938), Ebrard, Bisping, Maier, and others (comp. also Rückert, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "das Abendmahl. Sein Wesen und seine Geschichte in der alten Kirche",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Leipz. 1856, pp. 242–246), is inadmissible. For then there would underlie our passage the conception that the body of the Lord is offered in the Supper, Christ’s sacrifice is thus one constantly repeated; but such conception is unbiblical, and in particular is remote from the thought of the Epistle to the Hebrews, in which the presentation of the sacrifice of Christ once for all, and the all-sufficiency of this sacrifice by its one presentation, is frequently urged with emphasis; comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 7:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 9:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 9:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 10:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Exclusively correct is it, accordingly, to understand by the altar, with Thomas Aquinas, Estius, Jac. Cappellus, Bengel, Bleek, de Wette, Stengel, Delitzsch, Riehm, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "l.c.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Alford, Kluge, Moll, Kurtz, Woerner, and others, the spot on which the Saviour offered Himself, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e. the cross of Christ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". But to eat of this altar, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to partake of the sacrifice presented thereon, signifies: to attain to the enjoyment of the spiritual blessings resulting from Christ’s sacrificial death for believers; the same thing as is represented, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 6:51",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff., as the eating of the flesh and drinking of the blood of Christ.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[125] So also Hofmann (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Schriftbew",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". II. 1, 2 Aufl. p. 457 ff.), who will have only the twofold fact to be accentuated at ver. 10 : “that we are priests,” and “that we possess a means of expiation,” and brings out as the sense of the verse: “that we, whose only propitiatory sacrifice, and one for all alike, is Christ, have no other profit from our means of expiation, than that we are reconciled.” (!)",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "On ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 13:11-13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", comp. Bähr in the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Stud. u. Krit",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". 1849, H. 4, p. 936 ff.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "10–16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The One Sacrifice of the Christian, and the sacrifices which he must offer",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "We have an altar",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] These seven verses form a little episode of argument in the midst of moral exhortations. They revert once more to the main subject of the Epistle—the contrast between the two dispensations. The connecting link in the thought of the writer is to be found in the Jewish boasts to which he has just referred in the word “meats.” Besides trying to alarm the Christians by denunciations founded on their indifference to the Levitical Law and the oral traditions based upon it, the Jews would doubtless taunt them with their inability henceforth to share in eating the sacrifices (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 9:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") since they were all under the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Cherem",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—the ban of Jewish excommunication. The writer meets the taunt by pointing out (in an allusive manner) that of the most solemn sacrifices in the whole Jewish year—and of those offered on the Day of Atonement—not even the Priests, not even the High Priest himself, could partake (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 6:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 6:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 6:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 16:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). But of our Sacrifice, which is Christ, and from (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐξ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") our Altar, which is the Cross—on which, as on an Altar, our Lord was offered—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "we",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " may eat. The “Altar” is here understood of the Cross, not only by Bleek and De Wette, but even by St Thomas Aquinas and Estius; but the mere figure implied by the “altar” is so subordinate to that of our participation in spiritual privileges that if it be regarded as an objection that the Cross was looked on by Jews as “the accursed tree,” we may adopt the alternative view suggested by Thomas Aquinas—that the Altar means Christ Himself. To eat from it will then be “to partake of the fruit of Christ’s Passion.” So too Cyril says, “He is Himself the Altar.” We therefore have loftier privileges than they who “serve the tabernacle.” The other incidental expressions will be illustrated as we proceed; but, meanwhile, we may observe that the word “Altar” is altogether subordinate and (so to speak) “out of the Figure.” There is no reference whatever to the material “table of the Lord,” and only a very indirect reference (if any) to the Lord’s Supper. Nothing can prove more strikingly and conclusively the writer’s total freedom from any conceptions resembling those of the “sacrifice of the mass” than the fact that here he speaks of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "our",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " sacrifices as being “the bullocks of our lips.” The Christian Priest is only a Presbyter, not a Sacrificing Priest. He is only a Sacrificing Priest in exactly the same sense as every Christian is metaphorically so called, because ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "alike",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Presbyter and people offer “",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "spiritual",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " sacrifices,” which are alone acceptable to God through Jesus Christ (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Peter 2:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The main point is “we too have one great sacrifice,” and we (unlike the Jews, as regards their chief sacrifice, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 4:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 6:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 16:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") may perpetually partake of it, and live by it (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 6:51-56",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). We live not on anything material, which profiteth nothing, but on the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "words",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of Christ, which are spirit and truth; and we feed on Him—a symbol of the close communion whereby we are one with Him—only in a heavenly and spiritual manner.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "whereof",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Lit. “from which.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "they have no right to eat",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Because they utterly reject Him whose flesh is meat indeed and whose blood is drink indeed (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 6:54-55",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Forbidden to eat of the type (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 13:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") they could not of course, in any sense, partake of the antitype which they rejected.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "which serve the tabernacle",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 8:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It is remarkable that not even here, though the participle is in the present tense, does he use the word “Temple” or “Shrine” anymore than he does throughout the whole Epistle. There may, as Bengel says, be a slight irony in the phrase “who ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "serve the Tabernacle",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",” rather than “",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in the Tabernacle",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 13:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἔχομεν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "we have",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") This verse has two clauses: on the first, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 13:15-16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " depend; on the second, the verses that intervene. Chiasmus.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "θυσιαστήριον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "an altar",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the Cross of Christ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", on which His body was sacrificed.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐξ οὗ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (from) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "which",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". They are partakers also of this altar who eat the sacrifice offered upon it, not on the other: comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 10:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "φαγεῖν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to eat",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") The meat, the flesh of Christ given for us. It is an antithesis to ceremonial meats. It is chiefly ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "eaten",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in the Sacred Supper, where His body is set forth as given up for us, and His blood shed for us, in that single ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sacrifice",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of the cross.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οὐκ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "not",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Galatians 5:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τῇ σκηνῇ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the tabernacle",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") A parabolic Amphibology, such as we find at ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 9:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", note. For the tabernacle, if we consider the Protasis, expressed at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 13:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", denotes the anterior part of the sanctuary; but if we consider the Apodosis, which is found at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 13:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", it implies the whole Levitical worship. There is also a point in the fact, that he says, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τῇ σκηνῇ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", not ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐν τῇ σκηνῇ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “who serve ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the tabernacle",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",” not ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in the tabernacle",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In like manner ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "paul",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 7:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", note.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 10.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "We have an altar, whereof they have no right to eat which serve the tabernacle.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Here there is a plain allusion to the eating of offered sacrifices. If, then, there was no such allusion in the preceding verse, what is the connection of thought? It appears to be this: \"Some would teach you that meats are of religious importance. Nay, but what are meats to us who have Christ himself for our spiritual food? This is our peculiar privilege, not shared by the very priests of the old dispensation.\" Then, in ver. 11, \"That this is so is shown by the very symbolism of the Day of Atonement.\" Then, in ver. 12, \"Let us, then, be well content to leave Judaism entirely, and cleave to Christ alone.\" By \"those that serve (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "λατρεύοντες",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") the tabernacle\" are meant the priests of the Law, whose service is, as in former passages, referred to as still going on. It is evidently implied that we ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "have",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the right which they have not. Hebrews 13:10",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Those who persist in adhering to the Jewish economy can have no part in the blessing of the new covenant. The two are mutually exclusive. The statement is cast in the mould of the Jewish sacrificial ritual, and in the figure of eating a sacrificial meal.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "We have an altar (ἔχομεν θυσιαστήριον)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "It is a mistake to try to find in the Christian economy some specific object answering to altar - either the cross, or the eucharistic table, or Christ himself. Rather the ideas of approach to God, - sacrifice, atonement, pardon and acceptance, salvation, - are gathered up and generally represented in the figure of an altar, even as the Jewish altar was the point at which all these ideas converged. The application in this broader and more general sense is illustrated by Ignatius: \"If one be not within the altar (ἐντὸς τοῦ θυσιαστηρίου the sacred precinct), he lacketh the bread of God.... Whosoever, therefore, cometh not to the congregation (ἐπὶ τὸ αὐτὸ), he doth thereby show his pride, and hath separated himself,\" Eph. v. Ignatius here uses the word, not of a literal altar, but of the church. Comp. Trall. vii. Again: \"Hasten to come together as to one temple, even God; to one altar, even to one Jesus Christ,\" Magn. vii.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Of which - to eat (εξ οὗ - φαγεῖν)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The foundation of the figure is the sacrifice of the peace or thank-offering, in which the worshippers partook of the sacrifice. See Leviticus 7:29-35; Deuteronomy 12:6; Deuteronomy 27:7. The peace-offerings were either public or private. The two lambs offered every year at Pentecost (Leviticus 23:19) were a public offering, and their flesh was eaten only by the officiating priests, and within the holy place. The other public peace-offerings, after the priests had received their share, were eaten by the offerers themselves. Jehovah thus condescended to be the guest of his worshippers. The large scale on which such festivals were sometimes celebrated is illustrated in 1 Kings 8:63. In private peace-offerings, the breast of the victim belonged to the Lord, who gave it to the priests (Leviticus 7:30), and the right shoulder was given directly to the priests by Israel (Leviticus 7:32). After the ritual of waving, the entrails were consumed, and the rest was eaten by the priest or the worshippers and their invited guests, among whom were specially included the poor and the Levites.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The foundation of the figure is the sacrifice of the peace or thank-offering, in which the worshippers partook of the sacrifice. See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 7:29-35",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 12:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 27:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The peace-offerings were either public or private. The two lambs offered every year at Pentecost (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 23:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") were a public offering, and their flesh was eaten only by the officiating priests, and within the holy place. The other public peace-offerings, after the priests had received their share, were eaten by the offerers themselves. Jehovah thus condescended to be the guest of his worshippers. The large scale on which such festivals were sometimes celebrated is illustrated in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 8:63",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". In private peace-offerings, the breast of the victim belonged to the Lord, who gave it to the priests (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 7:30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and the right shoulder was given directly to the priests by Israel (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 7:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). After the ritual of waving, the entrails were consumed, and the rest was eaten by the priest or the worshippers and their invited guests, among whom were specially included the poor and the Levites.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Right (ἐξουσίαν)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "See on John 1:12.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 1:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Which serve the tabernacle (οἱ τῇ σκηνῇ λατρεύοντες)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This does not mean the priests only, but the worshippers also. Σκηνή tabernacle is used figuratively for the whole ceremonial economy. A reference to the priests alone is entirely foreign to the context, and to the whole drift of the discussion which contrasts the privileges of Christians at large (we) with those of Israel at large. The writer is speaking in the present tense, of institutions in operation in his own time, to which tabernacle, in any other than a figurative sense, would be inappropriate. Moreover, λατρεύειν to serve is used throughout the N.T., with the single exception of Hebrews 8:5, of the service of the worshipper and not of the priest. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "This does not mean the priests only, but the worshippers also. Σκηνή tabernacle is used figuratively for the whole ceremonial economy. A reference to the priests alone is entirely foreign to the context, and to the whole drift of the discussion which contrasts the privileges of Christians at large (we) with those of Israel at large. The writer is speaking in the present tense, of institutions in operation in his own time, to which tabernacle, in any other than a figurative sense, would be inappropriate. Moreover, λατρεύειν to serve is used throughout the N.T., with the single exception of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 8:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", of the service of the worshipper and not of the priest. ",
            "children": []
          }
        ]
      }
    ]
  }
]