[{"header":"Chapter 36"},{"num":1,"verse":"Edomite Lists. These are the descendants of Esau (that is, Edom). "},{"num":2,"verse":"Esau took his wives from among the Canaanite women: Adah, daughter of Elon the Hittite; Oholibamah, the daughter of Anah the son of Zibeon the Hivite; "},{"num":3,"verse":"and Basemath, daughter of Ishmael and sister of Nebaioth. "},{"num":4,"verse":"Adah bore Eliphaz to Esau; Basemath bore Reuel; "},{"num":5,"verse":"and Oholibamah bore Jeush, Jalam and Korah. These are the sons of Esau who were born to him in the land of Canaan."},{"num":6,"verse":"Esau took his wives, his sons, his daughters, and all the members of his household, as well as his livestock, all his cattle, and all the property he had acquired in the land of Canaan, and went to the land of Seir, away from his brother Jacob. "},{"num":7,"verse":"Their possessions had become too great for them to dwell together, and the land in which they were residing could not support them because of their livestock. "},{"num":8,"verse":"So Esau settled in the highlands of Seir. (Esau is Edom.) "},{"num":9,"verse":"These are the descendants of Esau, ancestor of the Edomites, in the highlands of Seir."},{"num":10,"verse":"These are the names of the sons of Esau: Eliphaz, son of Adah, wife of Esau, and Reuel, son of Basemath, wife of Esau. "},{"num":11,"verse":"The sons of Eliphaz were Teman, Omar, Zepho, Gatam, and Kenaz. "},{"num":12,"verse":"Timna was a concubine of Eliphaz, the son of Esau, and she bore Amalek to Eliphaz. Those were the sons of Adah, the wife of Esau. "},{"num":13,"verse":"These were the sons of Reuel: Nahath, Zerah, Shammah, and Mizzah. Those were the sons of Basemath, the wife of Esau. "},{"num":14,"verse":"These were the sons of Esau’s wife Oholibamah—the daughter of Anah, son of Zibeon—whom she bore to Esau: Jeush, Jalam, and Korah."},{"num":15,"verse":"These are the clans of the sons of Esau. The sons of Eliphaz, Esau’s firstborn: the clans of Teman, Omar, Zepho, Kenaz, "},{"num":16,"verse":"Korah, Gatam, and Amalek. These are the clans of Eliphaz in the land of Edom; they are the sons of Adah. "},{"num":17,"verse":"These are the sons of Reuel, son of Esau: the clans of Nahath, Zerah, Shammah, and Mizzah. These are the clans of Reuel in the land of Edom; they are the sons of Basemath, wife of Esau. "},{"num":18,"verse":"These were the sons of Oholibamah, wife of Esau: the clans of Jeush, Jalam, and Korah. These are the clans of Esau’s wife Oholibamah, daughter of Anah. "},{"num":19,"verse":"These are the sons of Esau—that is, Edom—according to their clans."},{"num":20,"verse":"These are the sons of Seir the Horite, the inhabitants of the land: Lotan, Shobal, Zibeon, Anah, "},{"num":21,"verse":"Dishon, Ezer, and Dishan; those are the clans of the Horites, sons of Seir in the land of Edom. "},{"num":22,"verse":"The sons of Lotan were Hori and Hemam, and Lotan’s sister was Timna. "},{"num":23,"verse":"These are the sons of Shobal: Alvan, Mahanath, Ebal, Shepho, and Onam. "},{"num":24,"verse":"These are the sons of Zibeon: Aiah and Anah. He is the Anah who found water in the desert while he was pasturing the donkeys of his father Zibeon. "},{"num":25,"verse":"These are the children of Anah: Dishon and Oholibamah, daughter of Anah. "},{"num":26,"verse":"These are the sons of Dishon: Hemdan, Eshban, Ithran, and Cheran. "},{"num":27,"verse":"These are the sons of Ezer: Bilhan, Zaavan, and Akan. "},{"num":28,"verse":"These are the sons of Dishan: Uz and Aran. "},{"num":29,"verse":"These are the clans of the Horites: the clans of Lotan, Shobal, Zibeon, Anah, "},{"num":30,"verse":"Dishon, Ezer, and Dishan; those are the clans of the Horites, clan by clan, in the land of Seir."},{"num":31,"verse":"These are the kings who reigned in the land of Edom before any king reigned over the Israelites. "},{"num":32,"verse":"Bela, son of Beor, became king in Edom; the name of his city was Dinhabah. "},{"num":33,"verse":"When Bela died, Jobab, son of Zerah, from Bozrah, succeeded him as king. "},{"num":34,"verse":"When Jobab died, Husham, from the land of the Temanites, succeeded him as king. "},{"num":35,"verse":"When Husham died, Hadad, son of Bedad, succeeded him as king. He is the one who defeated Midian in the country of Moab; the name of his city was Avith. "},{"num":36,"verse":"When Hadad died, Samlah, from Masrekah, succeeded him as king. "},{"num":37,"verse":"When Samlah died, Shaul, from Rehoboth-on-the-River, succeeded him as king. "},{"num":38,"verse":"When Shaul died, Baal-hanan, son of Achbor, succeeded him as king. "},{"num":39,"verse":"When Baal-hanan, son of Achbor, died, Hadad succeeded him as king; the name of his city was Pau. His wife’s name was Mehetabel, the daughter of Matred, son of Mezahab."},{"num":40,"verse":"These are the names of the clans of Esau identified according to their families and localities: the clans of Timna, Alvah, Jetheth, "},{"num":41,"verse":"Oholibamah, Elah, Pinon, "},{"num":42,"verse":"Kenaz, Teman, Mibzar, "},{"num":43,"verse":"Magdiel, and Iram. Those are the clans of the Edomites, according to their settlements in their territorial holdings—that is, of Esau, the ancestor of the Edomites."}]