[{"header":"Chapter 4"},{"num":1,"verse":"Masters, be just and fair in your treatment of your slaves, knowing that you too have a Master in heaven."},{"num":2,"verse":"Assiduous Prayer. Persevere in prayer, with alert minds and thankful hearts."},{"num":3,"verse":"At the same time, pray for us too, so that God may open a door to us to proclaim the word, the mystery of Christ, for which I am in prison."},{"num":4,"verse":"Pray that I may proclaim it as clearly as I should."},{"num":5,"verse":"Christian Behavior. Conduct yourselves wisely toward outsiders, making the most of your opportunity."},{"num":6,"verse":"Let your speech always be gracious and seasoned with wisdom, so that you will know how to respond properly to all."},{"num":7,"verse":"Tychicus and Onesimus. Tychicus will tell you all the news about me. He is a beloved brother, a faithful minister, and a fellow servant in the Lord."},{"num":8,"verse":"I am sending him to you for this very purpose, so that you will know how we are and that he may cheer your hearts."},{"num":9,"verse":"He will be accompanied by Onesimus, our trustworthy and beloved brother, who is one of you. They will tell you about everything that has happened here."},{"num":10,"verse":"Paul’s Coworkers. Aristarchus, my fellow prisoner, sends you his greetings, as does Mark, the cousin of Barnabas. (You have received instructions about him; if he comes to you, make him welcome.)"},{"num":11,"verse":"And Jesus who is called Justus also greets you. Of all those who are of the circumcision, these are the only ones who are working with me for the kingdom of God, and they have been a great comfort to me."},{"num":12,"verse":"Epaphras sends you greetings. He is one of you, a servant of Christ Jesus, and he is always pleading earnestly in his prayers on your behalf so that you may seek perfection and fulfill the will of God."},{"num":13,"verse":"I can testify for him that he has worked tirelessly for you and those in Laodicea and Hierapolis."},{"num":14,"verse":"Luke, the beloved physician, and Demas send you greetings."},{"num":15,"verse":"Notes for the Laodiceans. Give my greetings to the brethren in Laodicea, and to Nymphas and the Church in her house."},{"num":16,"verse":"Then when this letter has been read to you, see to it that it is also read to the Church at Laodicea; and I ask you in turn to read my letter that is coming from Laodicea."},{"num":17,"verse":"Also tell Archippus: “See that you carry out fully the ministry that you received in the Lord.”"},{"num":18,"verse":"Paul’s Signature. I, Paul, write this farewell in my own hand. Remember my chains. Grace be with you."}]