[{"num":4,"verse":"Masters, give your slaves what is just and fair, knowing that you also have a Master in heaven."},{"header":"Devote Yourselves to Prayer"},{"num":2,"verse":"Devote yourselves to prayer, keeping alert in it with thanksgiving. "},{"num":3,"verse":"At the same time, keep praying for us as well, that God may open up to us a door for the message, to proclaim the mystery of Messiah—for which I am in prison. "},{"num":4,"verse":"Pray that I may make the mystery clear, as I ought to speak. "},{"num":5,"verse":"Conduct yourselves with wisdom toward outsiders, making the most of the opportunity. "},{"num":6,"verse":"Let your speech always be with grace, seasoned with salt, to know how you ought to answer everyone."},{"header":"Further Instructions and Greetings"},{"num":7,"verse":"Tychicus—a dearly loved brother and trustworthy servant and fellow slave to the Lord—will tell you all the news about me. "},{"num":8,"verse":"I sent him to you for this very purpose, so you may know about us and he may encourage your hearts. "},{"num":9,"verse":"With him I sent Onesimus—a faithful and dear brother, who is one of your own. They will tell you about everything here."},{"num":10,"verse":"My fellow prisoner Aristarchus sends you his greetings, as does Mark, the cousin of Barnabas. (You received instructions about him—if he comes your way, welcome him.) "},{"num":11,"verse":"Yeshua who is called Justus also sends his greetings. These are the only fellow workers for the kingdom of God that are from among the circumcision—they have been a comfort to me."},{"num":12,"verse":"Epaphras, who is one of your own, a slave of Messiah Yeshua, greets you. He is always laboring in prayer on your behalf, so you may stand complete and fully assured about everything that is God’s will. "},{"num":13,"verse":"For I testify that he has gone to much trouble for you and for those in Laodicea and Hierapolis. "},{"num":14,"verse":"Luke, the dearly loved physician, sends you greetings, and so does Demas."},{"num":15,"verse":"Greet the brothers and sisters in Laodicea, as well as Nympha and the community that meets in her house. "},{"num":16,"verse":"When this letter has been read among you, make sure that it is also read in Messiah’s community of Laodicea. In turn, you should read my letter coming from Laodicea."},{"num":17,"verse":"Tell Archippus, “See to it that you complete the service you have received in the Lord, that you may fulfill it.”"},{"num":18,"verse":"This greeting is in my own hand—Paul’s. Remember my chains!"}]