[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(5) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The years of their iniquity, according to the number of the days.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 14:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In regard to the number of the years, see Excursus II. at the end of this book.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(6) The iniquity of the house of Judah forty days.—This forty days is clearly subsequent and additional to the 390 days, making in all a period of 430 days. (On these numbers see Excursus II. at the end of this book.) The great disproportion between the two is in accordance with the difference in the two parts of the nation, and the consequent Divine dealings with them. Judah had remained faithful to its appointed rulers of the house of David, several of whose kings had been eminently devout men; through whatever mixture with idolatry it had yet always retained the worship of Jehovah, and had kept up the Aaronic priesthood, and preserved with more or less respect the law of Moses. It was now entering upon the period of the Babylonish captivity, from which, after seventy years, a remnant was to be again restored to keep up the people of the Messiah. Israel, on the other hand, had set up a succession of dynasties, and not one of all their kings had been a God-fearing man; they had made Baal their national god, and had made priests at their pleasure of the lowest of the people, and in consequence of their sins had been carried into a captivity from which they never returned.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(6) ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "The iniquity of the house of Judah forty days.—",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "This forty days is clearly subsequent and additional to the 390 days, making in all a period of 430 days. (On these numbers see Excursus II. at the end of this book.) The great disproportion between the two is in accordance with the difference in the two parts of the nation, and the consequent Divine dealings with them. Judah had remained faithful to its appointed rulers of the house of David, several of whose kings had been eminently devout men; through whatever mixture with idolatry it had yet always retained the worship of Jehovah, and had kept up the Aaronic priesthood, and preserved with more or less respect the law of Moses. It was now entering upon the period of the Babylonish captivity, from which, after seventy years, a remnant was to be again restored to keep up the people of the Messiah. Israel, on the other hand, had set up a succession of dynasties, and not one of all their kings had been a God-fearing man; they had made Baal their national god, and had made priests at their pleasure of the lowest of the people, and in consequence of their sins had been carried into a captivity from which they never returned.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "EXCURSUS B: ON CHAPTER 4:5, 6.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "EXCURSUS B: ON CHAPTER 4:5, 6.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The explanation of the periods of time here mentioned has occasioned great difficulty and difference of opinion among the commentators. The subject may be best approached by first observing what points are clearly determined in the text itself, and then excluding all interpretations which are inconsistent with these.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In the first place, it is expressly stated in each of these verses that these days represent years. No interpretation, therefore, can be admitted which requires them to be literal days. Secondly, it is plain that the period is one of “bearing their iniquity”; not a period in which they are becoming sinful, but one in which they are suffering the punishment of their sin. Thirdly, it is plain from the whole structure of the symbolism that this period is in some way intimately connected with the siege of Jerusalem. Finally, the two periods of 390 and of forty days are distinct. If the symbolism was carried out in act, they must have been consecutive, and it is still the natural inference that they were so, even if it was only in vision. The two periods together, then, constitute 430 days; yet this is not to be emphasised, since no express mention is made of the whole period.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "These points of themselves exclude several of the explanations that have from time to time been put forward. Among these must be mentioned, first, one which has perhaps been more generally adopted than any other of its class, the supposition that the 390 years of Israel’s punishment are to be reckoned from some point in the reign of Jeroboam to the destruction of Jerusalem by Nebuchadnezzar. This, however, was far more a period of accumulation of Israel’s transgression than of suffering its punishment; neither in this case could the period be fairly considered as extending beyond the end of the kingdom of Israel (which lasted in all but 253 years) unless it was also extended indefinitely. Moreover, expositors who adopt this view are quite unable to give any satisfactory account of Judah’s forty years; for the proposal to reckon them from the reformation of Josiah is quite at variance with the character of the period described.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Every attempt to make these periods refer to a future time, stretching on far beyond the date of the prophecy, fails for want of any definite event at the end of either 390, 40, or 430 years.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The periods cannot be understood of events occurring in the course of the siege because, as already said, the numbers are expressly said to stand for years. Moreover, even if they could be taken of literal days, there would be nothing to correspond to them, since from the investment of the city to the flight of Zedekiah was 539 days, and to the destruction of the Temple twenty-eight days more (2Kings 25:1; 2Kings 25:3; 2Kings 25:8).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The periods cannot be understood of events occurring in the course of the siege because, as already said, the numbers are expressly said to stand for years. Moreover, even if they could be taken of literal days, there would be nothing to correspond to them, since from the investment of the city to the flight of Zedekiah was 539 days, and to the destruction of the Temple twenty-eight days more (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2Kings 25:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2Kings 25:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2Kings 25:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Of two other explanations, it is only necessary to say a word: that of Theodoret is based upon the Greek version, which, by a curious mistake, has 190 instead of 390 days, and of course falls to the ground when the true number is considered; the ancient Jews and some early Christians interpreted the passage of a period of 430 years, which they conceived was to be fulfilled from the destruction of Jerusalem and the Temple, in the second year of the Emperor Vespasian, to its expected restoration, which the event has shown to be groundless.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Another ancient interpretation makes of the period of 430 years, the time from the building to the destruction of Solomon’s Temple. This is open to the same objections already urged to others, and besides, it makes the total number the prominent thing, while there is no point of division for the 390 and the 40. St. Jerome reckoned the 390 years from the captivity of the northern kingdom to the deliverance of the Jews from danger in the time of Esther, and the 40 years from the destruction of the Temple by Nebuchadnezzar to the decree of Cyrus for the restoration of the Jews; but his chronology is at fault, and the former part of the explanation takes no notice of the main point of the siege of Jerusalem, while the events in the time of Esther cannot be looked upon as the termination of the punishment of the Israelites.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The later Jews make up the two periods by selecting throughout the period of the Judges and the monarchy the various times in which the sins of Israel and of Judah were especially marked, and adding these together; but this is utterly arbitrary and unsatisfactory.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "So much space has been given to these different interpretations in order to show that there is no definite term of years, either before or after the date of the prophecy, which the ingenuity of the commentators has been able to discover, satisfying the conditions of the prophecy itself. We are, therefore, left free to accept the interpretation now generally given by the best modern expositors.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This takes for its starting-point the evident allusion of Ezekiel to Numbers 14:14, “After the number of the days in which ye searched the land, even forty days, each day for a year shall ye bear your iniquities;” and the earlier prophecies declaring that the people in punishment for their sins should be brought again into Egypt, which yet should not be Egypt (Deuteronomy 28:68; Hosea 8:13; Hosea 9:3; Hosea 11:5), but Assyria or Babylonia, as is expressly defined in some of these prophecies. The meaning is plainly that they should endure sufferings corresponding to the Egyptian bondage, but in another locality. Ezekiel himself elsewhere (Ezekiel 20:35) speaks of God’s dealings with the captives as a pleading with them “in the wilderness.” Now if this be once recognised as the basis of Ezekiel’s language—the representation of the future in terms of the historic past, which is so common in all prophecy—there need be no difficulty in the mention of the precise numbers. They become mere catch-words to carry the mind to the period he would indicate. The wanderings in the wilderness were always reckoned at 40 years, and the sojourn in Egypt (see Exodus 12:40) at 430 years. Ezekiel merely follows here his habit of putting everything into vivid and concrete form. Are his people to suffer for their sins as they suffered of old? Judah is to endure the 40 years of wilderness sufferings, and Israel those of the Egyptian bondage; only, if he spoke of the latter as 430 years, it might seem that Israel was to endure the punishment belonging to both Israel and Judah, and therefore he takes from it the period already assigned to Judah, leaving for Israel 390 years. This accounts for his not mentioning the 430 years at all, and could be done the more easily because the actual bondage in Egypt was far less than either number. No precise period whatever is intended by the mention of these numbers, but only a vivid comparison of the future woes to the past. Again, whatever might be their present sufferings, they still had hope, and even indulged in defiance, while Jerusalem and the Temple stood. This hope was vain. The holy city and the Temple itself should be destroyed, and then they would know that the hand of the Lord was heavy upon them indeed for the punishment of their sins. The siege of Jerusalem is, therefore, the prominent feature of the prophecy; and there is foretold, as the consequence of this, the eating of “defiled bread among the Gentiles” (Ezekiel 4:13) as in Egypt of old, together with the various forms of want and suffering set forth in the striking symbolism of this chapter.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "This takes for its starting-point the evident allusion of Ezekiel to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 14:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", “After the number of the days in which ye searched the land, even forty days, each day for a year shall ye bear your iniquities;” and the earlier prophecies declaring that the people in punishment for their sins should be brought again into Egypt, which yet should not be Egypt (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 28:68",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 8:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 9:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 11:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), but Assyria or Babylonia, as is expressly defined in some of these prophecies. The meaning is plainly that they should endure sufferings corresponding to the Egyptian bondage, but in another locality. Ezekiel himself elsewhere (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 20:35",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") speaks of God’s dealings with the captives as a pleading with them “in the wilderness.” Now if this be once recognised as the basis of Ezekiel’s language—the representation of the future in terms of the historic past, which is so common in all prophecy—there need be no difficulty in the mention of the precise numbers. They become mere catch-words to carry the mind to the period he would indicate. The wanderings in the wilderness were always reckoned at 40 years, and the sojourn in Egypt (see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 12:40",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") at 430 years. Ezekiel merely follows here his habit of putting everything into vivid and concrete form. Are his people to suffer for their sins as they suffered of old? Judah is to endure the 40 years of wilderness sufferings, and Israel those of the Egyptian bondage; only, if he spoke of the latter as 430 years, it might seem that Israel was to endure the punishment belonging to both Israel and Judah, and therefore he takes from it the period already assigned to Judah, leaving for Israel 390 years. This accounts for his not mentioning the 430 years at all, and could be done the more easily because the actual ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "bondage",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " in Egypt was far less than either number. No precise period whatever is intended by the mention of these numbers, but only a vivid comparison of the future woes to the past. Again, whatever might be their present sufferings, they still had hope, and even indulged in defiance, while Jerusalem and the Temple stood. This hope was vain. The holy city and the Temple itself should be destroyed, and then they would know that the hand of the Lord was heavy upon them indeed for the punishment of their sins. The siege of Jerusalem is, therefore, the prominent feature of the prophecy; and there is foretold, as the consequence of this, the eating of “defiled bread among the Gentiles” (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 4:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") as in Egypt of old, together with the various forms of want and suffering set forth in the striking symbolism of this chapter.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "4:1-8 The prophet was to represent the siege of Jerusalem by signs. He was to lie on his left side for a number of days, supposed to be equal to the years from the establishment of idolatry. All that the prophet sets before the children of his people, about the destruction of Jerusalem, is to show that sin is the provoking cause of the ruin of that once flourishing city.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "According to the number of the days - Or, \"to be to thee as a number of days (even as)\" etc. Compare the margin reference. Some conceive that these \"days\" were the years during which Israel and Judah sinned, and date in the case of Israel from Jeroboam's rebellion to the time at which Ezekiel wrote (circa 390 years); and in the case of Judah from Josiah's reformation. But it seems more in accordance with the other \"signs,\" to suppose that they represent not that which had been, but that which shall be. The whole number of years is 430 ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 4:5-6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the number assigned of old for the affliction of the descendants of Abraham ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 15:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 12:40",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The \"forty years\" apportioned to Judah ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 4:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", bring to mind the 40 years passed in the wilderness; and these were years not only of punishment, but also of discipline and preparatory to restoration, so Ezekiel would intimate the difference between the punishments of Israel and of Judah to be this, that the one would be of much longer duration with no definite hope of recovery, but the other would be imposed with the express purpose of the renewal of mercy. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5. three hundred and ninety days—The three hundred ninety years of punishment appointed for Israel, and forty for Judah, cannot refer to the siege of Jerusalem. That siege is referred to in Eze 4:1-3, and in a sense restricted to the literal siege, but comprehending the whole train of punishment to be inflicted for their sin; therefore we read here merely of its sore pressure, not of its result. The sum of three hundred ninety and forty years is four hundred thirty, a period famous in the history of the covenant-people, being that of their sojourn in Egypt (Ex 12:40, 41; Ga 3:17). The forty alludes to the forty years in the wilderness. Elsewhere (De 28:68; Ho 9:3), God threatened to bring them back to Egypt, which must mean, not Egypt literally, but a bondage as bad as that one in Egypt. So now God will reduce them to a kind of new Egyptian bondage to the world: Israel, the greater transgressor, for a longer period than Judah (compare Eze 20:35-38). Not the whole of the four hundred thirty years of the Egypt state is appointed to Israel; but this shortened by the forty years of the wilderness sojourn, to imply, that a way is open to their return to life by their having the Egypt state merged into that of the wilderness; that is, by ceasing from idolatry and seeking in their sifting and sore troubles, through God's covenant, a restoration to righteousness and peace [Fairbairn]. The three hundred ninety, in reference to the sin of Israel, was also literally true, being the years from the setting up of the calves by Jeroboam (1Ki 12:20-33), that is, from 975 to 583 B.C.: about the year of the Babylonians captivity; and perhaps the forty of Judah refers to that part of Manasseh's fifty-five years' reign in which he had not repented, and which, we are expressly told, was the cause of God's removal of Judah, notwithstanding Josiah's reformation (1Ki 21:10-16; 2Ki 23:26, 27).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " This verse explains the former. I have pointed out the number of years wherein apostate Israel sinned against me, and I did bear with them according to the number of days, wherein thou must lie on thy left side. Three hundred and ninety days. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ezekiel 4:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 4:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". There is some difference, though of no great moment, in fixing the periods of beginning and ending these prophetic days. These years some begin at Solomon’s falling to idolatry, in the twenty-seventh year of his reign, and end them in the fifth of Zedekiah’s captivity. Others begin at the fourth year of Rehoboam, and end them in the twenty-first year of the captivity. Others begin them in the first of Rehoboam and Jeroboam, when the kingdom was divided, and then they must end about the seventeenth year of the captivity. The first supputation to me is much the likeliest, and agrees nearest with the year wherein this prophet begins his prophecy. It is not altogether unlikely that the prophet may intimate, though obscurely, the continuance of the siege of Jerusalem, which the Chaldeans began on the tenth day of the tenth month of the ninth year of Zedekiah, and lasted the remaining two months of the ninth year, and the whole tenth year except some five months, wherein the Babylonians retired to fight the Egyptians, beat them, spoiled them, and returned to the siege of Jerusalem, which lasted to the ninth day of the fourth month of Zedekiah’s eleventh year. So that one whole year, and three weeks, and four days, or thirteen months, at thirty days in each month, taking up three hundred and ninety days, and discounting the five months and odd days in the Egyptian expedition, you come to the continuance of three hundred and ninety days in the threatened siege, and possibly this may be the intent of the prophecy. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "For I have laid upon thee the years of their iniquity,.... Or the iniquity which for so many years they have been guilty of; that is, the punishment of it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "according to the number of the days; a day for a year; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "three hundred and ninety days; which signify three hundred and ninety years; and so many years there were from the revolt of the ten tribes from Rehoboam, and the setting up the calves at Dan and Bethel, to the destruction of Jerusalem; which may be reckoned thus: the apostasy was in the fourth year of Rehoboam, so that there remained thirteen years of his reign, for he reigned seventeen years; Abijah his successor reigned three years; Asa, forty one; Jehoshaphat, twenty five; Joram, eight; Ahaziah, one; Athaliah, seven; Joash, forty; Amaziah, twenty nine: Uzziah, fifty two; Jotham, sixteen; Ahaz, sixteen; Hezekiah, twenty nine; Manasseh, fifty five; Amos, two; Josiah, thirty one; Jehoahaz, three months; Jehoiakim, eleven years; Jeconiah, three months and ten days; and Zedekiah, eleven years; in all three hundred and ninety years. Though Grotius reckons them from the fall of Solomon to the carrying captive of the ten tribes by Shalmaneser. According to Jerom, both the three hundred and ninety days, and the forty days, were figurative of the captivities of Israel and Judah. The captivity of Israel, or the ten tribes, began under Pekah king of Israel, 1 Kings 15:29; when many places in the kingdom were wasted; from whence, to the fortieth year of Ahasuerus, when the Jews were entirely set at liberty, were three hundred and ninety years (e); and the captivity of Judah began in the first year of Jeconiah, which, to the first of Cyrus, were forty years. The Jewish writers make these years to be the time of the idolatry of these people in their chronicle (f) they say, from hence we learn that Israel provoked the Lord to anger, from the time they entered into the land until they went out of it, three hundred and ninety years. Which, according to Jarchi and Kimchi, are, to be reckoned partly in the times of the judges, and partly in the times of the kings of Israel; in the times of the former, a hundred and eleven years: from Micah, till the ark was carried captive in the days of Eli, forty years; and from the time of Jeroboam to Hoshea, two hundred and forty; which make three hundred and ninety one: but the last of Hoshea is not of the number, since it was in the ninth year of his reign the city of Samaria was taken. So Jarchi. Kimchi's reckoning is different. Abarbinel is of opinion that these years describe the four hundred and thirty years of Israel's bondage in Egypt; though, he says, they may be understood of the time of the division of the kingdom under Rehoboam, from whence, to the destruction of Jerusalem, were three hundred and ninety years; which sense is best, and is what is first given; ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "three hundred and ninety days; which signify three hundred and ninety years; and so many years there were from the revolt of the ten tribes from Rehoboam, and the setting up the calves at Dan and Bethel, to the destruction of Jerusalem; which may be reckoned thus: the apostasy was in the fourth year of Rehoboam, so that there remained thirteen years of his reign, for he reigned seventeen years; Abijah his successor reigned three years; Asa, forty one; Jehoshaphat, twenty five; Joram, eight; Ahaziah, one; Athaliah, seven; Joash, forty; Amaziah, twenty nine: Uzziah, fifty two; Jotham, sixteen; Ahaz, sixteen; Hezekiah, twenty nine; Manasseh, fifty five; Amos, two; Josiah, thirty one; Jehoahaz, three months; Jehoiakim, eleven years; Jeconiah, three months and ten days; and Zedekiah, eleven years; in all three hundred and ninety years. Though Grotius reckons them from the fall of Solomon to the carrying captive of the ten tribes by Shalmaneser. According to Jerom, both the three hundred and ninety days, and the forty days, were figurative of the captivities of Israel and Judah. The captivity of Israel, or the ten tribes, began under Pekah king of Israel, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 15:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; when many places in the kingdom were wasted; from whence, to the fortieth year of Ahasuerus, when the Jews were entirely set at liberty, were three hundred and ninety years (e); and the captivity of Judah began in the first year of Jeconiah, which, to the first of Cyrus, were forty years. The Jewish writers make these years to be the time of the idolatry of these people in their chronicle (f) they say, from hence we learn that Israel provoked the Lord to anger, from the time they entered into the land until they went out of it, three hundred and ninety years. Which, according to Jarchi and Kimchi, are, to be reckoned partly in the times of the judges, and partly in the times of the kings of Israel; in the times of the former, a hundred and eleven years: from Micah, till the ark was carried captive in the days of Eli, forty years; and from the time of Jeroboam to Hoshea, two hundred and forty; which make three hundred and ninety one: but the last of Hoshea is not of the number, since it was in the ninth year of his reign the city of Samaria was taken. So Jarchi. Kimchi's reckoning is different. Abarbinel is of opinion that these years describe the four hundred and thirty years of Israel's bondage in Egypt; though, he says, they may be understood of the time of the division of the kingdom under Rehoboam, from whence, to the destruction of Jerusalem, were three hundred and ninety years; which sense is best, and is what is first given; ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "so shalt thou bear the iniquity of the house of Israel; as many days as answer to these years; by the house of Israel is meant not merely the ten tribes, who had been carried captive long before this time, but such of them also as were mixed with the tribes of Judah and Benjamin. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) Vid. Lyra in loc. (f) Seder Olam Rabba, c. 26. p. 73. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(e) Vid. Lyra in loc. (f) Seder Olam Rabba, c. 26. p. 73. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "For I have laid upon thee the years of their iniquity, according to the number of the days, three hundred and ninety days: so shalt thou bear the iniquity of the house of Israel.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Read with R.V., ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "for I have appointed the years of their iniquity to be unto thee a number of days",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", even 390 days. The number of years during which the people shall bear their iniquity is symbolized by the number of days during which Ezekiel lies on his side, as is said explicitly in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ezekiel 4:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 4:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " “a day for a year.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 5.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Three hundred and ninety days,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " etc. The days, as stated in ver. 6, stand for years according to the symbolism (with which Ezekiel was probably acquainted) of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 14:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". How we are to explain the precise number chosen is a problem winch has much exercised the minds of interpreters. I will begin by stating what seems to me the most tenable solution. In doing this I follow Smend and Cornill in taking the LXX. as giving the original reading, and the Hebrew as a later correction, made with a purpose. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(1)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Jerome and Origen bear witness to the fact that most copies of the former gave 190 years, some 150 and others, agreeing with the Hebrew, 390. The first of these numbers fits in with the thought that Ezekiel's act was to represent the period of the punishment of the northern kingdom. That punishment starts from the first captivity under Pekah about  ",
        "children": []
      },
      {
        "element": "span",
        "class": "date",
        "text": "B.C. 734",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Reckoning from that date, the 190 years bring us to about  ",
        "children": []
      },
      {
        "element": "span",
        "class": "date",
        "text": "B.C. 544",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The  punishment of Judah, in like manner, dates from the destruction of Jerusalem in  ",
        "children": []
      },
      {
        "element": "span",
        "class": "date",
        "text": "B.C. 586",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and the forty years bring us to  ",
        "children": []
      },
      {
        "element": "span",
        "class": "date",
        "text": "B.C. 546",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", a date so near the other, that, in the round numbers which Ezekiel uses, they may be taken as practically coinciding. It was to that date that the prophet, perhaps, unacquainted with Jeremiah's seventy years (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 25:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), with a different starting point ( ",
        "children": []
      },
      {
        "element": "span",
        "class": "date",
        "text": "B.C. 600",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") and ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "terminus",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ( ",
        "children": []
      },
      {
        "element": "span",
        "class": "date",
        "text": "B.C. 536",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), looked forward as the starting point of the restoration of Israel. It is obvious that Ezekiel contemplated the contemporaneous restoration of Israel and Judah (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 16:53-55",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 37:19-22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 47:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), as indeed Isaiah also seems to do (Isaiah 11:13, 14), and Jeremiah (Jeremiah 31:6, 12, 27). The teaching of Ezekiel's acts, then, had two distinct purposes. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(a)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " It taught the certainty of the punishment. No plots, or rebellions, or alliances with Egypt, could avert the doom of exile from these who should survive the siege of Jerusalem. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(b)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " It taught the exiles to accept their punishment with patience, but with hope. There was a limit, and that not very far off, which some of them might live to see, and beyond which there lay the hope of a restoration for both Israel and Judah. If that hope was not realized to the extent which Ezekiel's language impiles, the same may be, said of the language of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 40-66",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", whether we refer those chapters to Isaiah himself or to the \"great unknown\" who followed Ezekiel, and may have listened to his teaching. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(2)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Still keeping to the idea of the years of punishment, but taking the Hebrew text, the combination of 390 and 40 gives 430, and this, it is urged, was the number assigned in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 12:40",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for the years of the sojourning in Egypt. Then the nation had been one, now it is divided. And the punishment of its two divisions is apportioned according to their respective guilt. For Israel, whose sins had been of a deeper dye, there was to be, as it were, another Egyptian bondage (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 8:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and Hosea 9:3 seem to predict a literal return to Egypt, but ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 11:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " shows it to have been figurative only). For Judah there was to be another quasi-wandering in the wilderness for forty years a period of punishment, but also of preparation lot a re-entry into the land of promise (Currey, Gardiner). ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(3)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " A somewhat fanciful variation on the preceding view connects the 390 days with the forty stripes of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 25:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", reduced by Jewish preachers to \"forty stripes save one\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Corinthians 11:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Thus thirty-nine were assigned to each of the ten tribes, leaving forty for Judah standing by itself. With this addition ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(3)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " merges into ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(2).",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(4)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The traditional Jewish interpretation, on the other hand (Kimchi), sees in the number of the years the measure, not of the punishment, but of the guilt of Israel and Judah respectively. That of the former is measured (as in the margin of the Authorized Version) from the revolt of the ten tribes ( ",
        "children": []
      },
      {
        "element": "span",
        "class": "date",
        "text": "B.C. 975",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") to the time at which Ezekiel received the commands with which we are now dealing ( ",
        "children": []
      },
      {
        "element": "span",
        "class": "date",
        "text": "B.C. 595",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). This computation gives, it is true, only 380 years; but the prophet may be thought of as dealing with round numbers, the 390 being, perhaps, chosen for the reason indicated in (3), or as reckoning with a different chronology. The forty years of the guilt of Judah are, on this view, reckoned from Josiah's reformation ( ",
        "children": []
      },
      {
        "element": "span",
        "class": "date",
        "text": "B.C. 624",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), which would bring us to  ",
        "children": []
      },
      {
        "element": "span",
        "class": "date",
        "text": "B.C. 585-4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And the sin of Judah is thought of as consisting specially in its resistance to that reformation and its rapid relapse into an apostasy like that of Ahaz or Manasseh. It can hardly be said that this is a satisfactory explanation. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(5)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Yet another view has been suggested, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "sc.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that the siege of Jerusalem lasted, in round numbers, for 430 days - a day for each year of the national guilt as measured in the last hypothesis. Against this there is the fact that, according to the statements in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 25:1-3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the siege lasted for much more than the 430 days, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "sc.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for nearly a year and a half. The conclusion to which I am led, after examining the several hypotheses, is, as I have sail, in favour of (1). The text of the Hebrew, as we find it, may have risen out of the tinct that the ten tribes had not returned as a body, and that there was no sign of their return, when Judah returned in  ",
        "children": []
      },
      {
        "element": "span",
        "class": "date",
        "text": "B.C. 536",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and therefore a larger number was inserted to allow time for a more adequate interval. Ezekiel 4:5",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The second symbolical act. - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 4:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And do thou lay thyself upon thy left side, and lay upon it the evil deeds of the house of Israel; for the number of the days during which thou liest thereon shalt thou bear their evil deeds. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 4:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And I reckon to thee the years of their evil deeds as a number of days; three hundred and ninety days shalt thou bear the evil deeds of the house of Israel. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 4:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And (when) thou hast completed these, thou shalt then lay thyself a second time upon thy right side, and bear the evil deeds of the house of Judah forty days; each day I reckon to thee as a year. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 4:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And upon the siege of Jerusalem shalt thou stedfastly direct thy countenance, and thy naked arm, and shalt prophesy against it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 4:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And, lo, I lay cords upon thee, that thou stir not from one side to the other until thou hast ended the days of thy siege. - Whilst Ezekiel, as God's representative, carries out in a symbolical manner the siege of Jerusalem, he is in this situation to portray at the same time the destiny of the people of Israel beleaguered in their metropolis. Lying upon his left side for 390 days without turning, he is to bear the guilt of Israel's sin; then, lying 40 days more upon his right side, he is to bear the guilt of Judah's sin. In so doing, the number of the days during which he reclines upon his sides shall be accounted as exactly equal to the same number of years of their sinning. נשׂא עון, \"to bear the evil deeds,\" i.e., to take upon himself the consequence of sin, and to stone for them, to suffer the punishment of sin; cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 14:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc. Sin, which produces guilt and punishment, is regarded as a burden or weight, which Ezekiel is to lay upon the side upon which he reclines, and in this way bear it. This bearing, however, of the guilt of sin is not to be viewed as vicarious and mediatorial, as in the sacrifice of atonement, but is intended as purely epideictic and symbolical; that is to say, Ezekiel, by his lying so long bound under the burden of Israel and Judah which was laid upon his side, is to show to the people how they are to be cast down by the siege of Jerusalem, and how, while lying on the ground, without the possibility of turning or rising, they are to bear the punishment of their sins. The full understanding of this symbolical act, however, depends upon the explanation of the specified periods of time, with regard to which the various views exhibit great discrepancy.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In the first place, the separation of the guilt into that of the house of Israel and that of the house of Judah is closely connected with the division of the covenant people into the two kingdoms of Israel and Judah. That Ezekiel now is to bear the sin of Israel upon the left, that of Judah on the right side, is not fully explained by the circumstance that the kingdom of the ten tribes lay to the left, i.e., to the north, the kingdom of Judah to the right, i.e., to the south of Jerusalem, but must undoubtedly point at the same time to the pre-eminence of Judah over Israel; cf. Ecclesiastes 10:2. This pre-eminence of Judah is manifestly exhibited in its period of punishment extending only to 40 days  equals  40 years; that of Israel, on the contrary, 390 days  equals  390 years. These numbers, however, cannot be satisfactorily explained from a chronological point of view, whether they be referred to the time during which Israel and Judah sinned, and heaped upon themselves guilt which was to be punished, or to the time during which they were to atone, or suffer punishment for their sins. Of themselves, both references are possible; the first, viz., in so far as the days in which Ezekiel is to bear the guilt of Israel, might be proportioned to the number of the years of their guilt, as many Rabbins, Vatablus, Calvin, Lightfoot, Vitringa, J. D. Michaelis, and others suppose, while in so doing the years are calculated very differently; cf. des Vignoles, Chronol. I. p. 479ff., and Rosenmller, Scholia, Excurs. to ch. iv. All these hypotheses, however, are shattered by the impossibility of pointing out the specified periods of time, so as to harmonize with the chronology. If the days, reckoned as years, correspond to the duration of their sinning, then, in the case of the house of Israel, only the duration of this kingdom could come into consideration, as the period of punishment began with the captivity of the ten tribes. But this kingdom lasted only 253 years. The remaining 137 years the Rabbins have attempted to supply from the period of the Judges; others, from the time of the destruction of the ten tribes down to that of Ezekiel, or even to that of the destruction of Jerusalem. Both are altogether arbitrary. Still less can the 40 years of Judah be calculated, as all the determinations of the beginning and the end are mere phantoms of the air. The fortieth year before our prophecy would nearly coincide with the eighteenth year of Josiah's reign, and therefore with the year in which this pious king effected the reformation of religion. Ezekiel, however, could not represent this year as marking the commencement of Judah's sin. We must therefore, as the literal meaning of the words primarily indicates, regard the specified periods of time as periods of punishment for Israel and Judah. Since Ezekiel, then, had to maintain during the symbolical siege of Jerusalem this attitude of reclining for Israel and Judah, and after the completion of the 390 days for Israel must lie a second time (שׁנית, Ezekiel 4:6) 40 days for Judah, he had to recline in all 430 (390 + 40) days. To include the forty days in the three hundred and ninety is contrary to the statements in the text. But to reckon the two periods together has not only no argument against it, but is even suggested by the circumstance that the prophet, while reclining on his left and right sides, is to represent the siege of Jerusalem. Regarded, however, as periods of punishment, both the numbers cannot be explained consistently with the chronology, but must be understood as having a symbolical signification. The space of 430 years, which is announced to both kingdoms together as the duration of this chastisement, recalls the 430 years which in the far past Israel had spent in Egypt in bondage (Exodus 12:40). It had been already intimated to Abraham (Genesis 15:13) that the sojourn in Egypt would be a period of servitude and humiliation for his seed; and at a later time, in consequence of the oppression which the Israelites then experienced on account of the rapid increase of their number, it was - upon the basis of the threat in Deuteronomy 28:68, that God would punish Israel for their persistent declension, by bringing them back into ignominious bondage in Egypt - taken by the prophet as a type of the banishment of rebellious Israel among the heathen. In this sense Hosea already threatens (Hosea 8:13; Hosea 9:3, Hosea 9:6) the ten tribes with being carried back to Egypt; see on Hosea 9:3. Still more frequently, upon the basis of this conception, is the redemption from Assyrian and Babylonian exile announced as a new and miraculous exodus of Israel from the bondage of Egypt, e.g., Hosea 2:2; Isaiah 11:15-16. - This typical meaning lies also at the foundation of the passage before us, as, in accordance with the statement of Jerome,",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In the first place, the separation of the guilt into that of the house of Israel and that of the house of Judah is closely connected with the division of the covenant people into the two kingdoms of Israel and Judah. That Ezekiel now is to bear the sin of Israel upon the left, that of Judah on the right side, is not fully explained by the circumstance that the kingdom of the ten tribes lay to the left, i.e., to the north, the kingdom of Judah to the right, i.e., to the south of Jerusalem, but must undoubtedly point at the same time to the pre-eminence of Judah over Israel; cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ecclesiastes 10:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". This pre-eminence of Judah is manifestly exhibited in its period of punishment extending only to 40 days  equals  40 years; that of Israel, on the contrary, 390 days  equals  390 years. These numbers, however, cannot be satisfactorily explained from a chronological point of view, whether they be referred to the time during which Israel and Judah sinned, and heaped upon themselves guilt which was to be punished, or to the time during which they were to atone, or suffer punishment for their sins. Of themselves, both references are possible; the first, viz., in so far as the days in which Ezekiel is to bear the guilt of Israel, might be proportioned to the number of the years of their guilt, as many Rabbins, Vatablus, Calvin, Lightfoot, Vitringa, J. D. Michaelis, and others suppose, while in so doing the years are calculated very differently; cf. des Vignoles, Chronol. I. p. 479ff., and Rosenmller, Scholia, Excurs. to ch. iv. All these hypotheses, however, are shattered by the impossibility of pointing out the specified periods of time, so as to harmonize with the chronology. If the days, reckoned as years, correspond to the duration of their sinning, then, in the case of the house of Israel, only the duration of this kingdom could come into consideration, as the period of punishment began with the captivity of the ten tribes. But this kingdom lasted only 253 years. The remaining 137 years the Rabbins have attempted to supply from the period of the Judges; others, from the time of the destruction of the ten tribes down to that of Ezekiel, or even to that of the destruction of Jerusalem. Both are altogether arbitrary. Still less can the 40 years of Judah be calculated, as all the determinations of the beginning and the end are mere phantoms of the air. The fortieth year before our prophecy would nearly coincide with the eighteenth year of Josiah's reign, and therefore with the year in which this pious king effected the reformation of religion. Ezekiel, however, could not represent this year as marking the commencement of Judah's sin. We must therefore, as the literal meaning of the words primarily indicates, regard the specified periods of time as periods of punishment for Israel and Judah. Since Ezekiel, then, had to maintain during the symbolical siege of Jerusalem this attitude of reclining for Israel and Judah, and after the completion of the 390 days for Israel must lie a second time (שׁנית, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 4:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") 40 days for Judah, he had to recline in all 430 (390 + 40) days. To include the forty days in the three hundred and ninety is contrary to the statements in the text. But to reckon the two periods together has not only no argument against it, but is even suggested by the circumstance that the prophet, while reclining on his left and right sides, is to represent the siege of Jerusalem. Regarded, however, as periods of punishment, both the numbers cannot be explained consistently with the chronology, but must be understood as having a symbolical signification. The space of 430 years, which is announced to both kingdoms together as the duration of this chastisement, recalls the 430 years which in the far past Israel had spent in Egypt in bondage (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 12:40",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). It had been already intimated to Abraham (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 15:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") that the sojourn in Egypt would be a period of servitude and humiliation for his seed; and at a later time, in consequence of the oppression which the Israelites then experienced on account of the rapid increase of their number, it was - upon the basis of the threat in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 28:68",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", that God would punish Israel for their persistent declension, by bringing them back into ignominious bondage in Egypt - taken by the prophet as a type of the banishment of rebellious Israel among the heathen. In this sense Hosea already threatens (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 8:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 9:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 9:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") the ten tribes with being carried back to Egypt; see on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 9:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Still more frequently, upon the basis of this conception, is the redemption from Assyrian and Babylonian exile announced as a new and miraculous exodus of Israel from the bondage of Egypt, e.g., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 2:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 11:15-16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". - This typical meaning lies also at the foundation of the passage before us, as, in accordance with the statement of Jerome,",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Alii vero et maxime Judaei a secundo anno Vespasiani, quando Hierusalem a Romanis capta templumque subversum est, supputari volunt in tribulatione et angustia et captivitatis jugo populi constitui annos quadringentos triginta, et sic redire populum ad pristinum statum ut quomodo filii Israel 430 annis fuerunt in Aegypto, sic in eodem numero finiatur: scriptumque esse in Exodus 12:40. - Hieronymus.)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: Alii vero et maxime Judaei a secundo anno Vespasiani, quando Hierusalem a Romanis capta templumque subversum est, supputari volunt in tribulatione et angustia et captivitatis jugo populi constitui annos quadringentos triginta, et sic redire populum ad pristinum statum ut quomodo filii Israel 430 annis fuerunt in Aegypto, sic in eodem numero finiatur: scriptumque esse in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 12:40",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". - Hieronymus.)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "it was already accepted by the Jews of his time, and has been again recognised in modern times by Hvernick and Hitzig. That Ezekiel looked upon the period during which Israel had been subject to the heathen in the past as \"typical of the future, is to be assumed, because only then does the number of 430 cease to be arbitrary and meaningless, and at the same time its division into 390 + 40 become explicable.\" - Hitzig.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This latter view is not, of course, to be understood as Hitzig and Hvernick take it, i.e., as if the 40 years of Judah's chastisement were to be viewed apart from the 40 years' sojourn of the Israelites in the wilderness, upon which the look of the prophet would have been turned by the sojourn in Egypt. For the 40 years in the wilderness are not included in the 430 years of the Egyptian sojourn, so that Ezekiel could have reduced these 430 years to 390, and yet have added to them the 40 years of the desert wanderings. For the coming period of punishment, which is to commence for Israel with the siege of Jerusalem, is fixed at 430 years with reference to the Egyptian bondage of the Israelites, and this period is divided into 390 and 40; and this division therefore must also have, if not its point of commencement, at least a point of connection, in the 430 years of the Egyptian sojourn. The division of the period of chastisement into two parts is to be explained probably from the sending of the covenant people into the kingdom of Israel and Judah, and the appointment of a longer period of chastisement for Israel than for Judah, from the greater guilt of the ten tribes in comparison with Judah, but not the incommensurable relation of the divisions into 390 and 40 years. The foundation of this division can, first of all, only lie in this, that the number forty already possessed the symbolical significance of a measured period of divine visitation. This significance it had already received, not through the 40 years of the desert wandering, but through the 40 days of rain at the time of the deluge (Genesis 7:17), so that, in conformity with this, the punishment of dying in the wilderness, suspended over the rebellious race of Israel at Kadesh, is already stated at 40 years, although it included in reality only 38 years; see on Numbers 14:32. If now, however, it should be supposed that this penal sentence had contributed to the fixing of the number 40 as a symbolical number to denote a longer period of punishment, the 40 years of punishment for Judah could not yet have been viewed apart from this event. The fixing of the chastisement for Israel and Judah at 390 + 40 years could only in that case be measured by the sojourn of the Israelites in Egypt, if the relations of this sojourn presented a point of connection for a division of the 430 years into 390 and 40, i.e., if the 40 last years of the Egyptian servitude could somehow be distinguished from the preceding 390. A point of contact for this is offered by an event in the life of Moses which falls within that period, and was fertile in results for him as well as for the whole of Israel, viz., his flight from Egypt in consequence of the slaughter of an Egyptian who had ill-treated an Israelite. As the Israelites, his brethren, did not recognise the meaning of this act, and did not perceive that God would save them by his hand, Moses was necessitated to flee into the land of Midian, and to tarry there 40 years as a stranger, until the Lord called him to be the saviour of his nation, and sent him as His messenger to Pharaoh (Exodus 2:11-3:10; Acts 7:23-30). These 40 years were for Moses not only a time of trial and purification for his future vocation, but undoubtedly also the period of severest Egyptian oppression for the Israelites, and in this respect quite fitted to be a type of the coming time of punishment for Judah, in which was to be repeated what Israel had experienced in Egypt, that, as Israel had lost their helper and protector with the flight of Moses, so now Judah was to lose her king, and be given over to the tyranny of the heathen world-power.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "This latter view is not, of course, to be understood as Hitzig and Hvernick take it, i.e., as if the 40 years of Judah's chastisement were to be viewed apart from the 40 years' sojourn of the Israelites in the wilderness, upon which the look of the prophet would have been turned by the sojourn in Egypt. For the 40 years in the wilderness are not included in the 430 years of the Egyptian sojourn, so that Ezekiel could have reduced these 430 years to 390, and yet have added to them the 40 years of the desert wanderings. For the coming period of punishment, which is to commence for Israel with the siege of Jerusalem, is fixed at 430 years with reference to the Egyptian bondage of the Israelites, and this period is divided into 390 and 40; and this division therefore must also have, if not its point of commencement, at least a point of connection, in the 430 years of the Egyptian sojourn. The division of the period of chastisement into two parts is to be explained probably from the sending of the covenant people into the kingdom of Israel and Judah, and the appointment of a longer period of chastisement for Israel than for Judah, from the greater guilt of the ten tribes in comparison with Judah, but not the incommensurable relation of the divisions into 390 and 40 years. The foundation of this division can, first of all, only lie in this, that the number forty already possessed the symbolical significance of a measured period of divine visitation. This significance it had already received, not through the 40 years of the desert wandering, but through the 40 days of rain at the time of the deluge (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 7:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), so that, in conformity with this, the punishment of dying in the wilderness, suspended over the rebellious race of Israel at Kadesh, is already stated at 40 years, although it included in reality only 38 years; see on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 14:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". If now, however, it should be supposed that this penal sentence had contributed to the fixing of the number 40 as a symbolical number to denote a longer period of punishment, the 40 years of punishment for Judah could not yet have been viewed apart from this event. The fixing of the chastisement for Israel and Judah at 390 + 40 years could only in that case be measured by the sojourn of the Israelites in Egypt, if the relations of this sojourn presented a point of connection for a division of the 430 years into 390 and 40, i.e., if the 40 last years of the Egyptian servitude could somehow be distinguished from the preceding 390. A point of contact for this is offered by an event in the life of Moses which falls within that period, and was fertile in results for him as well as for the whole of Israel, viz., his flight from Egypt in consequence of the slaughter of an Egyptian who had ill-treated an Israelite. As the Israelites, his brethren, did not recognise the meaning of this act, and did not perceive that God would save them by his hand, Moses was necessitated to flee into the land of Midian, and to tarry there 40 years as a stranger, until the Lord called him to be the saviour of his nation, and sent him as His messenger to Pharaoh (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 2:11-3:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 7:23-30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). These 40 years were for Moses not only a time of trial and purification for his future vocation, but undoubtedly also the period of severest Egyptian oppression for the Israelites, and in this respect quite fitted to be a type of the coming time of punishment for Judah, in which was to be repeated what Israel had experienced in Egypt, that, as Israel had lost their helper and protector with the flight of Moses, so now Judah was to lose her king, and be given over to the tyranny of the heathen world-power.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Another ingenious explanation of the numbers in question has been attempted by Kliefoth, Comment. p. 123. Proceeding from the symbolical signification of the number 40 as a measure of time for divine visitation and trial, he supposes that the prescription in Deuteronomy 25:3 - that if an Israelite were to be subject to corporal punishment, he was not to receive more than 40 stripes - is founded upon this symbolical signification - a prescription which, according to 2 Corinthians 11:24, was in practice so carried out that only 39 were actually inflicted. From the application and bearing thus given to the number 40, the symbolical numbers in the passage before us are to be explained. Every year of punishment is equivalent to a stripe of chastisement. To the house of Israel 10 x 39 years  equals  stripes, were adjudged, i.e., to each of the ten tribes 39 years  equals  stripes; the individual tribes are treated as so many single individuals, and each receives the amount of chastisement usual in the case of one individual. Judah, on the contrary, is regarded as the one complete historical national tribe, cause in the two faithful tribes of Judah and Benjamin the people collectively were represented. Judah, then, may receive, not the number of stripes falling to individuals, but that only which fell upon one, although, as a fair compensation, not the usual number of 40, but the higher number - compatible with the Torah - of 40 stripes  equals  years. To this explanation we would give our assent, if only the transformation into stripes or blows of the days of the prophet's reclining, or of the years of Israel's punishment, could be shown to be probable through any analogous Biblical example, and were not merely a deduction from the modern law of punishment, in which corporal punishment and imprisonment hold the same importance. The assumption, then, is altogether arbitrary irrespective of this, that in the case of the house of Israel the measure of punishment is fixed differently from that of Judah; in the former case, according to the number of the tribes; in the latter, according to the unity of the kingdom: in the former at 39, in the latter at 40 stripes. Finally, the presupposition that the later Jewish practice of inflicting only 30 instead of 40 stripes - in order not to transgress the letter of the law in the enumeration which probably was made at the infliction of the punishment - goes back to the time of the exile, is extremely improbable, as it altogether breathes the spirit of Pharisaic micrology.)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: Another ingenious explanation of the numbers in question has been attempted by Kliefoth, Comment. p. 123. Proceeding from the symbolical signification of the number 40 as a measure of time for divine visitation and trial, he supposes that the prescription in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 25:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " - that if an Israelite were to be subject to corporal punishment, he was not to receive more than 40 stripes - is founded upon this symbolical signification - a prescription which, according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Corinthians 11:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", was in practice so carried out that only 39 were actually inflicted. From the application and bearing thus given to the number 40, the symbolical numbers in the passage before us are to be explained. Every year of punishment is equivalent to a stripe of chastisement. To the house of Israel 10 x 39 years  equals  stripes, were adjudged, i.e., to each of the ten tribes 39 years  equals  stripes; the individual tribes are treated as so many single individuals, and each receives the amount of chastisement usual in the case of one individual. Judah, on the contrary, is regarded as the one complete historical national tribe, cause in the two faithful tribes of Judah and Benjamin the people collectively were represented. Judah, then, may receive, not the number of stripes falling to individuals, but that only which fell upon one, although, as a fair compensation, not the usual number of 40, but the higher number - compatible with the Torah - of 40 stripes  equals  years. To this explanation we would give our assent, if only the transformation into stripes or blows of the days of the prophet's reclining, or of the years of Israel's punishment, could be shown to be probable through any analogous Biblical example, and were not merely a deduction from the modern law of punishment, in which corporal punishment and imprisonment hold the same importance. The assumption, then, is altogether arbitrary irrespective of this, that in the case of the house of Israel the measure of punishment is fixed differently from that of Judah; in the former case, according to the number of the tribes; in the latter, according to the unity of the kingdom: in the former at 39, in the latter at 40 stripes. Finally, the presupposition that the later Jewish practice of inflicting only 30 instead of 40 stripes - in order not to transgress the letter of the law in the enumeration which probably was made at the infliction of the punishment - goes back to the time of the exile, is extremely improbable, as it altogether breathes the spirit of Pharisaic micrology.)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "While Ezekiel thus reclines upon one side, he is to direct his look unchangingly upon the siege of Jerusalem, i.e., upon the picture of the besieged city, and keep his arm bare, i.e., ready for action (Isaiah 52:10), and outstretched, and prophesy against the city, especially through the menacing attitude which he had taken up against it. To be able to carry this out, God will bind him with cords, i.e., fetter him to his couch (see on Ezekiel 3:25), so that he cannot stir from one side to another until he has completed the time enjoined upon him for the siege. In this is contained the thought that the siege of Jerusalem is to be mentally carried on until its capture; but no new symbol of the state of prostration of the besieged Jerusalem is implied. For such a purpose the food of the prophet (Ezekiel 4:9.) during this time is employed. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "While Ezekiel thus reclines upon one side, he is to direct his look unchangingly upon the siege of Jerusalem, i.e., upon the picture of the besieged city, and keep his arm bare, i.e., ready for action (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 52:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and outstretched, and prophesy against the city, especially through the menacing attitude which he had taken up against it. To be able to carry this out, God will bind him with cords, i.e., fetter him to his couch (see on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 3:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), so that he cannot stir from one side to another until he has completed the time enjoined upon him for the siege. In this is contained the thought that the siege of Jerusalem is to be mentally carried on until its capture; but no new symbol of the state of prostration of the besieged Jerusalem is implied. For such a purpose the food of the prophet (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 4:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".) during this time is employed. ",
            "children": []
          }
        ]
      }
    ]
  }
]