[[],[{"type":"header","content":"The Macedonian Vision"},{"type":"prose","content":"Now Paul traveled to Derbe and also to Lystra. A disciple named Timothy was there, the son of a Jewish woman who was a believer [in Christ], however, his father was a Greek. "}],[{"type":"prose","content":"Timothy was well spoken of by the brothers and sisters who were in Lystra and Iconium. "}],[{"type":"prose","content":"Paul wanted Timothy to go with him [as a missionary]; and he took him and circumcised him because of the Jews who were in those places, since they all knew that his father was a Greek. "}],[{"type":"prose","content":"As they traveled from town to town, they delivered the decrees decided on by the apostles and elders who were in Jerusalem, for the churches to observe. "}],[{"type":"prose","content":"So the churches were strengthened in the faith, and they  increased in number day after day."}],[{"type":"prose","content":"Now they passed through the territory of Phrygia and Galatia, after being forbidden by the Holy Spirit to speak the word in [the west coast province of] Asia [Minor]; "}],[{"type":"prose","content":"and after they came to Mysia, they tried to go into Bithynia, but the Spirit of Jesus did not permit them; "}],[{"type":"prose","content":"so passing by Mysia, they went down to Troas. "}],[{"type":"prose","content":"Then a vision appeared to Paul in the night: a man from [the Roman province of] Macedonia was standing and pleading with him, saying, “Come over to Macedonia and help us!” "}],[{"type":"prose","content":"And when he had seen the vision, we (including Luke) tried to go on into Macedonia at once, concluding that God had called us to preach the gospel to them."}],[{"type":"prose","content":"So setting sail from Troas, we ran a direct course to Samothrace, and the next day [went on] to Neapolis; "}],[{"type":"prose","content":"and from there [we came] to Philippi, which is a leading city of the district of Macedonia, a  colony. We stayed on in this city for several days; "}],[{"type":"prose","content":"and on the Sabbath day we went outside the city gate to the bank of the [Gangites] river, where we thought there would be a place of prayer, and we sat down and began speaking to the women who had come there."}],[{"type":"header","content":"First Convert in Europe"},{"type":"prose","content":"A woman named Lydia, from the city of Thyatira, a dealer in purple fabrics who was [already] a worshiper of God, listened to us; and the Lord opened her heart to pay attention  to respond to the things said by Paul. "}],[{"type":"prose","content":"And when she was baptized, along with her household, she pleaded with us, saying, “If you have judged me  decided that I am faithful to the Lord [a true believer], come to my house and stay.” And she persuaded us."}],[{"type":"prose","content":"It happened that as we were on our way to the place of prayer, we were met by a slave-girl who had a spirit of divination [that is, a demonic spirit claiming to foretell the future and discover hidden knowledge], and she brought her owners a good profit by fortune-telling. "}],[{"type":"prose","content":"She followed after Paul and us and kept screaming  shouting, “These men are servants of the Most High God! They are proclaiming to you the way of salvation!” "}],[{"type":"prose","content":"She continued doing this for several days. Then Paul, being greatly annoyed  worn out, turned and said to the spirit [inside her], “I command you in the name of Jesus Christ [as His representative] to come out of her!” And it came out at that very moment."}],[{"type":"prose","content":"But when her owners saw that their hope of profit was gone, they seized Paul and Silas and dragged them before the authorities in the market place [where trials were held], "}],[{"type":"prose","content":"and when they had brought them before the chief magistrates, they said, “These men, who are Jews, are throwing our city into confusion  causing trouble. "}],[{"type":"prose","content":"They are publicly teaching customs which are unlawful for us, as Romans, to accept or observe.”"}],[{"type":"header","content":"Paul and Silas Imprisoned"},{"type":"prose","content":"The crowd also joined in the attack against them, and the chief magistrates tore their robes off them and ordered that Paul and Silas be beaten with rods. "}],[{"type":"prose","content":"After striking them many times [with the rods], they threw them into prison, commanding the jailer to guard them securely. "}],[{"type":"prose","content":"He, having received such a [strict] command, threw them into the inner prison (dungeon) and fastened their feet in the stocks [in an agonizing position]."}],[{"type":"prose","content":"But about midnight when Paul and Silas were praying and singing hymns of praise to God, and the prisoners were listening to them; "}],[{"type":"prose","content":"suddenly there was a great earthquake, so [powerful] that the very foundations of the prison were shaken and at once all the doors were opened and everyone’s chains were unfastened. "}],[{"type":"prose","content":"When the jailer, shaken out of sleep, saw the prison doors open, he drew his sword and was about to kill himself, thinking that the prisoners had escaped. "}],[{"type":"prose","content":"But Paul shouted, saying, “Do not hurt yourself, we are all here!” "}],[{"type":"prose","content":"Then the jailer called for torches and rushed in, and trembling with fear he fell down before Paul and Silas, "}],[{"type":"prose","content":"and after he brought them out [of the inner prison], he said, “Sirs, what must I do to be saved?”"}],[{"type":"header","content":"The Jailer Converted"},{"type":"prose","content":"And they answered, “Believe in the Lord Jesus [as your personal Savior and entrust yourself to Him] and you will be saved, you and your household [if they also believe].” "}],[{"type":"prose","content":"And they spoke the word of the Lord [concerning eternal salvation through faith in Christ] to him and to all who were in his house. "}],[{"type":"prose","content":"And he took them that  hour of the night and washed their  wounds, and immediately he was baptized, he and all his . "}],[{"type":"prose","content":"Then he brought them into his house and set food before them, and rejoiced greatly, since he had believed in God with his entire family [accepting with joy what had been made known to them about the Christ]."}],[{"type":"prose","content":"Now when day came, the chief magistrates sent their officers, saying, “Release those men.” "}],[{"type":"prose","content":"And the jailer repeated the words to Paul, , “The chief magistrates have sent  to release you; so come out now and go in peace.” "}],[{"type":"prose","content":"But Paul said to them, “They have beaten us in public without a trial, men who are Romans, and have thrown us into prison; and now they are sending us out secretly? No! Let them come here themselves and bring us out!” "}],[{"type":"prose","content":"The officers reported this message to the chief magistrates, and when they heard that the prisoners were Romans, they were frightened; "}],[{"type":"prose","content":"so they came [to the prison] and appealed to them [with apologies], and when they brought them out, they kept begging them to leave the city. "}],[{"type":"prose","content":"So they left the prison and went to Lydia’s ; and when they had seen the brothers and sisters, they encouraged  comforted them, and left."}]]