[{"header":"Timothy Joins Paul and Silas"},{"num":16,"verse":"Paul arrived in Derbe and in Lystra, where there was a disciple named Timothy, who was the son of a believing Jewish woman, but his father was a Greek. "},{"num":2,"verse":"The brothers in Lystra and Iconium spoke well of him. "},{"num":3,"verse":"Paul wanted Timothy to accompany him, so he took him and circumcised him on account of the Jews who lived in those places, because they all knew that his father was a Greek. "},{"num":4,"verse":"As they traveled through the towns, they delivered the resolutions decided by the apostles and elders in Jerusalem for the people to keep. "},{"num":5,"verse":"So the churches were strengthened in the faith and increased in number day by day."},{"header":"The Call to Go to Macedonia (Europe)"},{"num":6,"verse":"They went through the region of Phrygia and Galatia, because they were prevented by the Holy Spirit from speaking the word in the province of Asia. "},{"num":7,"verse":"When they went as far as Mysia, they tried to go into Bithynia, but the Spirit of Jesus did not allow them. "},{"num":8,"verse":"So they passed by Mysia and went down to Troas. "},{"num":9,"verse":"A vision appeared to Paul during the night. A Macedonian man was standing there, urging him, “Come over to Macedonia and help us!” "},{"num":10,"verse":"As soon as he had seen the vision, we immediately made plans to proceed to Macedonia, because we concluded that God had called us to preach the good news to them."},{"header":"At Philippi"},{"num":11,"verse":"After we put out to sea from Troas, we sailed straight to Samothrace, and the next day to Neapolis. "},{"num":12,"verse":"From there we went to Philippi, which is a leading city in that part of Macedonia and a Roman colony. We stayed in this city for a number of days."},{"num":13,"verse":"On the Sabbath day we went outside the city gate alongside the river, where we thought there was a place of prayer. We sat down and began to talk to the women who had gathered there. "},{"num":14,"verse":"A woman named Lydia, who worshipped God, was listening. She was a dealer in purple cloth from the city of Thyatira. The Lord opened her heart to pay close attention to what Paul was saying. "},{"num":15,"verse":"When she and her household were baptized, she urged us, “If you consider me a believer in the Lord, come and stay at my house.” And she persuaded us."},{"header":"Paul and Silas Put in Prison"},{"num":16,"verse":"Once when we were going to the place of prayer, a slave girl met us. She had a spirit that foretold the future, and she made a large profit for her owners by fortune-telling. "},{"num":17,"verse":"As she followed Paul and us, she kept crying out, “These men are servants of the Most High God, who are proclaiming to you the way to be saved.” "},{"num":18,"verse":"When she kept doing this for many days, Paul became so annoyed that he turned to the spirit and said, “I command you in the name of Jesus Christ to come out of her!” And it came out at that very moment."},{"num":19,"verse":"When her owners saw that their hope of making money was gone, they seized Paul and Silas and dragged them into the marketplace before the authorities. "},{"num":20,"verse":"They had brought them to the magistrates and said, “These men are throwing our city into a state of confusion. They are Jews, "},{"num":21,"verse":"and they are teaching customs that are not lawful for us to accept or practice, since we are Romans.”"},{"num":22,"verse":"When the crowd also joined in the attack against them, the magistrates tore off their clothes and ordered them to be beaten with rods. "},{"num":23,"verse":"After they had beaten them severely, they threw them into prison and ordered the jailer to guard them securely. "},{"num":24,"verse":"Because he received such a command, the jailer threw them into the inner prison and fastened their feet in the stocks."},{"header":"The Earthquake and the Jailer’s Conversion"},{"num":25,"verse":"About midnight Paul and Silas were praying and singing hymns to God, and the prisoners were listening to them. "},{"num":26,"verse":"Suddenly there was such a violent earthquake that the foundations of the prison were shaken. Instantly all the doors were opened, and everyone’s chains came loose. "},{"num":27,"verse":"When the jailer woke up and saw that the prison doors were opened, he drew his sword and was about to kill himself, because he thought that the prisoners had escaped. "},{"num":28,"verse":"But Paul shouted with a loud voice, “Don’t harm yourself, because we are all here!”"},{"num":29,"verse":"The jailer called for lights, rushed in, and fell down trembling in front of Paul and Silas. "},{"num":30,"verse":"Then he brought them outside and asked, “Sirs, what must I do to be saved?”"},{"num":31,"verse":"They said, “Believe in the Lord Jesus and you will be saved, you and your household.” "},{"num":32,"verse":"They spoke the word of the Lord to him and to everyone in his home. "},{"num":33,"verse":"At the same hour of the night, he took them and washed their wounds. Without delay, he and all his family were baptized. "},{"num":34,"verse":"Then he brought Paul and Silas into his house and set food before them. He rejoiced, because he and his whole household had come to believe in God."},{"header":"Released From Prison"},{"num":35,"verse":"At daybreak the magistrates sent officers, saying, “Release those men!” "},{"num":36,"verse":"The jailer reported these words to Paul: “The magistrates have sent orders that you should be released. So come out now and go in peace.”"},{"num":37,"verse":"But Paul said to them, “They beat us publicly without a trial, even though we are Roman citizens, and threw us into prison. And now they are releasing us secretly? Absolutely not! Let them come themselves and escort us out!”"},{"num":38,"verse":"The officers reported these words to the magistrates, and they were afraid when they heard that Paul and Silas were Roman citizens. "},{"num":39,"verse":"So they came and apologized to them. As they escorted them out, they requested that they leave the city. "},{"num":40,"verse":"After Paul and Silas came out of the prison, they went to Lydia’s house. They saw the brothers, encouraged them, and then left."}]