[{"header":"The 1000 Years"},{"num":20,"verse":"I saw an angel coming down out of heaven. The angel had the key to the bottomless pit. The angel also held a large chain in his hand."},{"num":2,"verse":"The angel grabbed the dragon, that old snake, also known as the devil or Satan. The angel tied the dragon with the chain for 1000 years."},{"num":3,"verse":"Then the angel threw the dragon into the bottomless pit and closed it. The angel locked it over the dragon. The angel did this so that the dragon could not trick the people of the earth until the 1000 years were ended. After 1000 years the dragon must be made free for a short time."},{"num":4,"verse":"Then I saw some thrones and people sitting on them. These were the ones who had been given the power to judge. And I saw the souls of those who had been killed because they were faithful to the truth of Jesus and the message from God. They did not worship the beast or its idol. They did not receive the mark of the beast on their foreheads or on their hands. They came back to life and ruled with Christ for 1000 years."},{"num":5,"verse":"(The rest of the dead did not live again until the 1000 years were ended.)"},{"num":6,"verse":"Great blessings belong to those who share in this first resurrection. They are God’s holy people. The second death has no power over them. They will be priests for God and for Christ. They will rule with him for 1000 years."},{"header":"The Defeat of Satan"},{"num":7,"verse":"When the 1000 years are ended, Satan will be made free from his prison."},{"num":8,"verse":"He will go out to trick the nations in all the earth, the nations known as Gog and Magog. Satan will gather the people for battle. There will be more people than anyone can count, like sand on the seashore."},{"num":9,"verse":"I saw Satan’s army march across the earth and gather around the camp of God’s people and the city that God loves. But fire came down from heaven and destroyed Satan’s army."},{"num":10,"verse":"And he (the one who tricked these people) was thrown into the lake of burning sulfur with the beast and the false prophet. There they would be tortured day and night forever and ever."},{"header":"People of the World Are Judged"},{"num":11,"verse":"Then I saw a large white throne. I saw the one who was sitting on the throne. Earth and sky ran away from him and disappeared."},{"num":12,"verse":"And I saw those who had died, great and small, standing before the throne. Some books were opened. And another book was opened—the book of life. The people were judged by what they had done, which is written in the books."},{"num":13,"verse":"The sea gave up the dead who were in it. Death and Hades gave up the dead who were in them. All these people were judged by what they had done."},{"num":14,"verse":"And Death and Hades were thrown into the lake of fire. This lake of fire is the second death."},{"num":15,"verse":"And anyone whose name was not found written in the book of life was thrown into the lake of fire."}]