[{"num":20,"verse":"Then I saw a messenger coming from heaven. In his hand was a key to the abyss and a great chain that had been forged in heaven. "},{"num":2,"verse":"He seized the dragon, that ancient serpent who is the devil and Satan, and bound him for 1,000 years with the great chain. "},{"num":3,"verse":"The messenger cast him into the abyss and locked it and sealed him in it so that he could not go about deceiving the nations until the 1,000 years had come to completion. Afterward he must be released for a short time."},{"num":4,"verse":"Then I saw some thrones, and those seated in judgment were given the right to judge. Standing there were the souls of those who were beheaded because of their testimony of Jesus and the word of God. They had refused to worship the beast or its detestable image and had not received the mark upon their foreheads or upon their hands. They had come back to life and reigned with the Anointed One, our Liberating King, for 1,000 years. "},{"num":5,"verse":"Now as for the rest of the dead, they were not given life until the 1,000 years were completed. This is the first resurrection."},{"num":6,"verse":"Blessed and holy are the ones who take part in the first resurrection. Over these, the second death has no power; they will serve as priests of God and His Anointed, and they will reign with Him for 1,000 years."},{"num":7,"verse":"When the 1,000 years are completed, Satan will be released from his prison. "},{"num":8,"verse":"And he will crawl out of the abyss in order to deceive the nations located at the four corners of the earth, Gog and Magog as Ezekiel described them, in order to rally them together for one final battle. They are in number as the grains of sand on the shore. "},{"num":9,"verse":"They marched in unholy array over the expanse of the earth and surrounded the camp of the saints and the beloved city. As they laid siege to the city, fire rained down from heaven and incinerated them. "},{"num":10,"verse":"And the devil who had deceived them was cast into the lake of fire and sulfur, where the beast and the false prophet had already been thrown; and the unholy trio will be tortured day and night throughout the ages."},{"num":11,"verse":"The scene changed. I saw a great white throne, and One was seated upon it. The earth and heaven receded from His presence; there was no place for them. "},{"num":12,"verse":"And I saw the dead, great and small, standing in front of the throne. Some books were opened. Then another book was opened; it was called the book of life. And the dead were judged according to what had been recorded in the first books; these were the records of everything they had done. "},{"num":13,"verse":"And the sea surrendered its dead. Death and Hades gave up their dead as well. And all were judged according to their works. "},{"num":14,"verse":"Then Death and Hades were cast into the lake of fire. This is the second death, the lake of fire. "},{"num":15,"verse":"And everyone whose name could not be found among the names written in the book of life was thrown into the lake of fire."}]