[{"num":29,"verse":"4 The princes of the Philistines cause David to be sent back from the battle against Israel, because they distrusted him."},{"num":1,"verse":"So the Philistines were gathered together with all their armies in Aphek: and the Israelites pitched by the fountain, which is in Jezreel."},{"num":2,"verse":"And the princes of the Philistines went forth by hundreds and thousands, but David and his men came behind with Achish."},{"num":3,"verse":"Then said the Princes of the Philistines, What do these Hebrews here? And Achish said unto the princes of the Philistines, Is not this David the servant of Saul the King of Israel, who hath been with me these days, or these years, and I have found nothing in him, since he dwelt with me unto this day?"},{"num":4,"verse":"But the princes of the Philistines were wroth with him, and the princes of the Philistines said unto him, Send this fellow back, that he may go again to his place which thou hast appointed him, and let him not go down with us to battle, lest that in the battle he be an adversary to us: for wherewith should he obtain the favor of his master? should it not be with the heads of these men?"},{"num":5,"verse":"Is not this David, of whom they sang in dances, saying, Saul slew his thousand, and David his ten thousand?"},{"num":6,"verse":"¶ Then Achish called David, and said unto him, As the Lord liveth, thou hast been upright and good in my sight, when thou wentest out and in with me in the host, neither have I found evil with thee, since thou camest to me unto this day, but the princes do not favor thee."},{"num":7,"verse":"Wherefore now return, and go in peace, that thou displease not the princes of the Philistines."},{"num":8,"verse":"¶ And David said unto Achish, But what have I done? and what hast thou found in thy servant as long as I have been with thee unto this day, that I may not go and fight against the enemies of my Lord the King?"},{"num":9,"verse":"Achish then answered and said to David, I know thou pleasest me as an Angel of God: but the princes of the Philistines have said, Let him not go up with us to battle."},{"num":10,"verse":"Wherefore now rise up early in the morning with thy master’s servants that are come with thee: and when ye be up early, as soon as ye have light, depart."},{"num":11,"verse":"So David and his men rose up early to depart in the morning, and to return into the land of the Philistines: and the Philistines went up to Jezreel."}]