[[],[{"type":"header","content":"The Philistines Mistrust David"},{"type":"prose","content":"Now the Philistines gathered together all their armies to Aphek, while the Israelites were camping by the spring which is in Jezreel."}],[{"type":"prose","content":"And the governors of the Philistines were proceeding on,  hundreds and thousands, and David and his men were proceeding in the back with Achish."}],[{"type":"prose","content":"Then the commanders of the Philistines said, “What  these Hebrews ?” And Achish said to the commanders of the Philistines, “Is this not David, the servant of Saul the king of Israel, who has been with me these days, or  these years, and I have found nothing at all  in him since the day he deserted  to this day?”"}],[{"type":"prose","content":"But the commanders of the Philistines were angry with him, and the commanders of the Philistines said to him, “Make the man go back, so that he will return to his place where you have assigned him, and do not let him go down to battle with us, or in the battle he may become an adversary to us. For how could this  find favor with his lord?  not  with the heads of these men?"}],[{"type":"prose","content":"Is this not David, of whom they sing in the dances, saying,"},{"type":"poetry","content":"‘Saul has slain his thousands,"},{"type":"poetry","content":"And David his ten thousands’?”"}],[{"type":"prose","content":"Then Achish called David and said to him, “ the LORD lives, you  indeed  honest, and your going out and your coming in with me in the army are pleasing in my sight; for I have not found evil in you since the day of your coming to me to this day. Nevertheless, you are not pleasing in the sight of the governors."}],[{"type":"prose","content":"Now then, return and go in peace, so that you will not do  wrong in the sight of the governors of the Philistines.”"}],[{"type":"prose","content":"However, David said to Achish, “But what have I done? And what have you found in your servant since the day that I came before you, to this day, that I cannot go and fight against the enemies of my lord the king?”"}],[{"type":"prose","content":"But Achish replied to David, “I know that you are pleasing in my sight, like an angel of God; nevertheless the commanders of the Philistines have said, ‘He must not go up with us into the battle.’"}],[{"type":"prose","content":"Now then, rise early in the morning with the servants of your lord who have come with you, and  you have risen early in the morning and have light, leave.”"}],[{"type":"prose","content":"So David got up early, he and his men, to leave in the morning to return to the land of the Philistines. And the Philistines went up to Jezreel."}]]