[{"header":"The Wedding at Cana"},{"num":2,"verse":"Two days later there was a wedding in the town of Cana in Galilee, and Jesus’ mother was there."},{"num":2,"verse":"Jesus and his followers were also invited."},{"num":3,"verse":"At the wedding there was not enough wine, so Jesus’ mother said to him, “They have no more wine.”"},{"num":4,"verse":"Jesus answered, “Dear woman, why are you telling me this? It is not yet time for me to begin my work.”"},{"num":5,"verse":"His mother said to the servants, “Do what he tells you.”"},{"num":6,"verse":"There were six large stone waterpots there that were used by the Jews in their washing ceremonies. Each one held about 20 or 30 gallons."},{"num":7,"verse":"Jesus said to the servants, “Fill the waterpots with water.” So they filled them to the top."},{"num":8,"verse":"Then he said to them, “Now dip out some water and take it to the man in charge of the feast.”"},{"num":9,"verse":"Then the man in charge tasted it, but the water had become wine. He did not know where the wine had come from, but the servants who brought the water knew. He called the bridegroom"},{"num":10,"verse":"and said to him, “People always serve the best wine first. Later, when the guests are drunk, they serve the cheaper wine. But you have saved the best wine until now.”"},{"num":11,"verse":"This was the first of all the miraculous signs Jesus did. He did it in the town of Cana in Galilee. By this he showed his divine greatness, and his followers believed in him."},{"num":12,"verse":"Then Jesus went to the town of Capernaum. His mother and brothers and his followers went with him. They all stayed there a few days."},{"header":"Jesus at the Temple(A)"},{"num":13,"verse":"It was almost time for the Jewish Passover, so Jesus went to Jerusalem."},{"num":14,"verse":"There in the Temple area he saw men selling cattle, sheep, and doves. He saw others sitting at tables, exchanging and trading people’s money."},{"num":15,"verse":"Jesus made a whip with some pieces of rope. Then he forced all these men and the sheep and cattle to leave the Temple area. He turned over the tables of the money traders and scattered their money."},{"num":16,"verse":"Then he said to those who were selling pigeons, “Take these things out of here! Don’t make my Father’s house a place for buying and selling!”"},{"num":17,"verse":"When this happened, his followers remembered what was written in the Scriptures:"},{"num":18,"verse":"Some Jews said to Jesus, “Show us a miracle as a sign from God. Prove that you have the right to do these things.”"},{"num":19,"verse":"Jesus answered, “Destroy this temple and I will build it again in three days.”"},{"num":20,"verse":"They answered, “People worked 46 years to build this Temple! Do you really believe you can build it again in three days?”"},{"num":21,"verse":"But the temple Jesus meant was his own body."},{"num":22,"verse":"After he was raised from death, his followers remembered that he had said this. So they believed the Scriptures, and they believed the words Jesus said."},{"num":23,"verse":"Jesus was in Jerusalem for the Passover festival. Many people believed in him because they saw the miraculous signs he did."},{"num":24,"verse":"But Jesus did not trust them, because he knew how all people think."},{"num":25,"verse":"He did not need anyone to tell him what a person was like. He already knew."}]