[[],[{"type":"prose","content":"And the third day a marriage happened in Cana of Galilee, and the mother of Jesus was there,"}],[{"type":"prose","content":"and also Jesus was called, and his disciples, to the marriage;"}],[{"type":"prose","content":"and wine having failed, the mother of Jesus saith unto him, `Wine they have not;'"}],[{"type":"prose","content":"Jesus saith to her, `What -- to me and to thee, woman? not yet is mine hour come.'"}],[{"type":"prose","content":"His mother saith to the ministrants, `Whatever he may say to you -- do.'"}],[{"type":"prose","content":"And there were there six water-jugs of stone, placed according to the purifying of the Jews, holding each two or three measures."}],[{"type":"prose","content":"Jesus saith to them, `Fill the water-jugs with water;' and they filled them -- unto the brim;"}],[{"type":"prose","content":"and he saith to them, `Draw out, now, and bear to the director of the apartment;' and they bare."}],[{"type":"prose","content":"And as the director of the apartment tasted the water become wine, and knew not whence it is, (but the ministrants knew, who have drawn the water,) the director of the feast doth call the bridegroom,"}],[{"type":"prose","content":"and saith to him, `Every man, at first, the good wine doth set forth; and when they may have drunk freely, then the inferior; thou didst keep the good wine till now.'"}],[{"type":"prose","content":"This beginning of the signs did Jesus in Cana of Galilee, and manifested his glory, and his disciples believed in him;"}],[{"type":"prose","content":"after this he went down to Capernaum, he, and his mother, and his brethren, and his disciples; and there they remained not many days."}],[{"type":"prose","content":"And the passover of the Jews was nigh, and Jesus went up to Jerusalem,"}],[{"type":"prose","content":"and he found in the temple those selling oxen, and sheep, and doves, and the money-changers sitting,"}],[{"type":"prose","content":"and having made a whip of small cords, he put all forth out of the temple, also the sheep, and the oxen; and of the money-changers he poured out the coins, and the tables he overthrew,"}],[{"type":"prose","content":"and to those selling the doves he said, `Take these things hence; make not the house of my Father a house of merchandise.'"}],[{"type":"prose","content":"And his disciples remembered that it is written, `The zeal of Thy house did eat me up;'"}],[{"type":"prose","content":"the Jews then answered and said to him, `What sign dost thou shew to us -- that thou dost these things?'"}],[{"type":"prose","content":"Jesus answered and said to them, `Destroy this sanctuary, and in three days I will raise it up.'"}],[{"type":"prose","content":"The Jews, therefore, said, `Forty and six years was this sanctuary building, and wilt thou in three days raise it up?'"}],[{"type":"prose","content":"but he spake concerning the sanctuary of his body;"}],[{"type":"prose","content":"when, then, he was raised out of the dead, his disciples remembered that he said this to them, and they believed the Writing, and the word that Jesus said."}],[{"type":"prose","content":"And as he was in Jerusalem, in the passover, in the feast, many believed in his name, beholding his signs that he was doing;"}],[{"type":"prose","content":"and Jesus himself was not trusting himself to them, because of his knowing all [men],"}],[{"type":"prose","content":"and because he had no need that any should testify concerning man, for he himself was knowing what was in man."}]]