[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(23) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Moreover, as for me.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—“In this he sets a glorious example to all rulers, showing them that they should not be led astray by the ingratitude of their subordinates or subjects; and give up on that account all interest in their welfare, but should rather persevere all the more in their anxiety for them.”—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Berleb. Bible",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", quoted in Lange. Moses and Samuel, wrote S. Gregory, are especially brought forward by the Prophet Jeremiah (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 15:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") as having extraordinary power with Him, and why? because they prayed for their enemies. Samuel’s impassioned answer when the Elders asked his prayers, “Pray for you!” God forbid that I should sin against the Lord in ceasing to pray for you.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I will teach you.—The old man felt that in the future, although his powers as Judge were not abrogated yet, there would be, comparatively speaking, save on special occasions, but little opportunity for their exercise. In the presence of the regular authority of a king surrounded by armed men, such authority as he had wielded as Judge over the hearts of Israel must fall into abeyance.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "I will teach you.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The old man felt that in the future, although his powers as Judge were not abrogated yet, there would be, comparatively speaking, save on special occasions, but little opportunity for their exercise. In the presence of the regular authority of a king surrounded by armed men, such authority as he had wielded as Judge over the hearts of Israel must fall into abeyance.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "But one, and that a still higher office, still remained to him untouched by the great constitutional change that had passed over Israel—that of prophet. In this sphere, while he lived, he said he would work ceaselessly on; and the words he used on this solemn occasion tell out to all ages that the true function of the prophet or the preacher of the Eternal is to teach the people the good and the right way; and Samuel’s own life of brave self-denial and noble self-effacement showed men that this teaching must be pressed home by something more than mere words. “Only a Samuel could thus quit office, proudly challenging all to convict him of one single injustice in his past career; and by the act of resignation gaining, not losing, greatness. No longer judge and ruler, but simple prophet, he is able now to discourse with greater freedom of the monarchy about to be introduced, and he seizes the moment to cast a more distant glance into all the past and future of the community.”—Ewald: History of Israel, Book III., 1-3.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "But one, and that a still higher office, still remained to him untouched by the great constitutional change that had passed over Israel—",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "that of prophet. ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "In this sphere, while he lived, he said he would work ceaselessly on; and the words he used on this solemn occasion tell out to all ages that the true function of the prophet or the preacher of the Eternal is to teach the people the good and the right way; and Samuel’s own life of brave self-denial and noble self-effacement showed men that this teaching must be pressed home by something more than mere words. “Only a Samuel could thus quit office, proudly challenging all to convict him of one single injustice in his past career; and by the act of resignation gaining, not losing, greatness. No longer judge and ruler, but simple prophet, he is able now to discourse with greater freedom of the monarchy about to be introduced, and he seizes the moment to cast a more distant glance into all the past and future of the community.”—Ewald: ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "History of Israel, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Book III., 1-3.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12:16-25 At Samuel's word, God sent thunder and rain, at a season of the year when, in that country, the like was not seen. This was to convince them they had done wickedly in asking a king; not only by its coming at an unusual time, in wheat harvest, and on a clear day, but by the prophet's giving notice of it before. He showed their folly in desiring a king to save them, rather than God, or Samuel; promising themselves more from an arm of flesh, than from the arm of God, or from the power of prayer. Could their prince command such forces as the prophet could do by his prayers? It startled them very much. Some will not be brought to see their sins by any gentler methods than storms and thunders. They entreat Samuel to pray for them. Now they see their need of him whom shortly before they slighted. Thus many who will not have Christ to reign over them, would yet be glad to have him intercede for them, to turn away the wrath of God. Samuel aims to confirm the people in their religion. Whatever we make a god of, we shall find it deceive us. Creatures in their own places are good; but when put in God's place, they are vain things. We sin if we restrain prayer, and in particular if we cease praying for the church. They only asked him to pray for them; but he promises to do more, to teach them. He urges that they were bound in gratitude to serve God, considering what great things he had done for them; and that they were bound in interest to serve him, considering what he would do against them, if they should still do wickedly. Thus, as a faithful watchman, he gave them warning, and so delivered his own soul. If we consider what great things the Lord hath done for us, especially in the great work of redemption, we can neither want motive, encouragement, nor assistance in serving him.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Wheat harvest - Between May 15 and June 15. Jerome's testimony (that of an eye-witness) \"I have never seen rain in the end of June, or in July, in Judaea\" is borne out by modern travelers. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1Sa 12:17-25. He Terrifies Them with Thunder in Harvest-time.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "17-25. Is it not wheat harvest to-day?—That season in Palestine occurs at the end of June or beginning of July, when it seldom or never rains, and the sky is serene and cloudless. There could not, therefore, have been a stronger or more appropriate proof of a divine mission than the phenomenon of rain and thunder happening, without any prognostics of its approach, upon the prediction of a person professing himself to be a prophet of the Lord, and giving it as an attestation of his words being true. The people regarded it as a miraculous display of divine power, and, panic-struck, implored the prophet to pray for them. Promising to do so, he dispelled their fears. The conduct of Samuel, in this whole affair of the king's appointment, shows him to have been a great and good man who sank all private and personal considerations in disinterested zeal for his country's good and whose last words in public were to warn the people, and their king, of the danger of apostasy and disobedience to God.   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Think not that because you have so highly disobliged and rejected me, that I will revenge myself by neglecting to pray for you, or by praying against you, as I have now done for your conviction and humiliation, and so for your preservation; I am sensible it is my duty, as I am a man, a Israelite, a minister, a prophet, to pray for you. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "But I will teach you, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and I will",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c., i.e. I will not only pray for you, which is one branch of my duty; but will also teach and instruct you, which is the other branch of it. And though you have cast me off from being your judge and ruler, yet I will not cease to be your instructer and monitor, to keep you from sin and destruction. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Moreover, as for me,.... As he had given them reason to believe that God would forgive their sin, by which they had offended him, rejecting him as their King, so he likewise forgave their offence against him in rejecting him as their governor under him, and so neither need fear the Lord nor him with a servile fear; and as God would still be gracious to them, if they abode by his service, so he, Samuel, would do all the good offices for them that lay in his power: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "God forbid that I should sin against the Lord, in ceasing to pray for you; for since they had returned to the Lord, and acknowledged their sin, it would have been an evil in him not to pray for them, that they might share in the pardoning grace and mercy of God, and have all good things bestowed upon them they stood in need of; this he judged to be his duty to do, and therefore abhorred the thought of being indifferent to it, negligent of it, or of dropping it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "but I will teach you the good and the right way; would not only pray for them, but instruct them in the way of their duty; a way that was a good one, agreeable to the will and word of God, and in walking in which good things were enjoyed, and which being a good way, must needs be a right way; though Samuel ceased to be a judge and chief magistrate among them, he should not cease to act the part of a prophet to them, both by his prayers and by his instructions. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "but I will teach you the good and the right way; would not only pray for them, but instruct them in the way of their duty; a way that was a good one, agreeable to the will and word of God, and in walking in which good things were enjoyed, and which being a good way, must needs be a right way; though Samuel ceased to be a judge and chief magistrate among them, he should not cease to act the part of a prophet to them, both by his prayers and by his instructions. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Moreover as for me, God forbid that I should sin against the LORD in ceasing to pray for you: but I will teach you the good and the right way:",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 23.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "God forbid,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Hebrew, \"Far be it from me.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "That I should sin... in ceasing to pray for you.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " In no character of the Old Testament does this duty of intercessory prayer stand forward so prominently as in Samuel (see ver. 19); nor does he rest content with this, but adds, ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "I will teach you the good and the right way.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " This was a far higher office than that of ruler; and not only was Samuel earnest in discharging this prophetic office of teaching, but he made provision for a supply of teachers and preachers for all future time by founding the schools of the prophets. 1 Samuel 12:23",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Samuel then promised the people his constant intercession: \"Far be it from me to sin against the Lord, that I should cease to pray for you, and to instruct you in the good and right way,\" i.e., to work as prophet for your good. \"In this he sets a glorious example to all rulers, showing them that they should not be led astray by the ingratitude of their subordinates or subjects, and give up on that account all interest in their welfare, but should rather persevere all the more in their anxiety for them\" (Berleb. Bible). ",
        "children": []
      }
    ]
  }
]