[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12:16-25 At Samuel's word, God sent thunder and rain, at a season of the year when, in that country, the like was not seen. This was to convince them they had done wickedly in asking a king; not only by its coming at an unusual time, in wheat harvest, and on a clear day, but by the prophet's giving notice of it before. He showed their folly in desiring a king to save them, rather than God, or Samuel; promising themselves more from an arm of flesh, than from the arm of God, or from the power of prayer. Could their prince command such forces as the prophet could do by his prayers? It startled them very much. Some will not be brought to see their sins by any gentler methods than storms and thunders. They entreat Samuel to pray for them. Now they see their need of him whom shortly before they slighted. Thus many who will not have Christ to reign over them, would yet be glad to have him intercede for them, to turn away the wrath of God. Samuel aims to confirm the people in their religion. Whatever we make a god of, we shall find it deceive us. Creatures in their own places are good; but when put in God's place, they are vain things. We sin if we restrain prayer, and in particular if we cease praying for the church. They only asked him to pray for them; but he promises to do more, to teach them. He urges that they were bound in gratitude to serve God, considering what great things he had done for them; and that they were bound in interest to serve him, considering what he would do against them, if they should still do wickedly. Thus, as a faithful watchman, he gave them warning, and so delivered his own soul. If we consider what great things the Lord hath done for us, especially in the great work of redemption, we can neither want motive, encouragement, nor assistance in serving him.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Wheat harvest - Between May 15 and June 15. Jerome's testimony (that of an eye-witness) \"I have never seen rain in the end of June, or in July, in Judaea\" is borne out by modern travelers. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1Sa 12:17-25. He Terrifies Them with Thunder in Harvest-time.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "17-25. Is it not wheat harvest to-day?—That season in Palestine occurs at the end of June or beginning of July, when it seldom or never rains, and the sky is serene and cloudless. There could not, therefore, have been a stronger or more appropriate proof of a divine mission than the phenomenon of rain and thunder happening, without any prognostics of its approach, upon the prediction of a person professing himself to be a prophet of the Lord, and giving it as an attestation of his words being true. The people regarded it as a miraculous display of divine power, and, panic-struck, implored the prophet to pray for them. Promising to do so, he dispelled their fears. The conduct of Samuel, in this whole affair of the king's appointment, shows him to have been a great and good man who sank all private and personal considerations in disinterested zeal for his country's good and whose last words in public were to warn the people, and their king, of the danger of apostasy and disobedience to God.   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But if ye shall still do wickedly,.... Continue to rebel against God, revolt from him, and depart from his worship, and despise his prophets, and serve idols: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "ye shall be consumed, both ye and your king; their king would be so far from protecting, that he should perish with them, be killed by the sword, as Saul their first king was, or go into captivity, as others of their kings did. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "ye shall be consumed, both ye and your king; their king would be so far from protecting, that he should perish with them, be killed by the sword, as Saul their first king was, or go into captivity, as others of their kings did. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "But if ye shall still do wickedly, ye shall be consumed, both ye and your king.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Lastly, he repeats once more his admonition, that they would continue stedfast in the fear of God, threatening at the same time the destruction of both king and people if they should do wrong (on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 12:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 7:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 24:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where the form יראוּ is also found). \"For see what great things He has done for you\" (shown to you), not by causing it to thunder and rain at Samuel's prayer, but by giving them a king. עם הגדּיל, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 19:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      }
    ]
  }
]