[{"header":"Israel Will Be Smashed Like a Clay Jar"},{"num":19,"verse":"This is what the Lord says: Go and buy a clay jar from a potter. Take along some of the leaders of the people and some of the leaders of the priests. "},{"num":2,"verse":"Go to the valley of Ben Hinnom at the entrance to Potsherd Gate. Announce there the things I plan to do. "},{"num":3,"verse":"Say, “Listen to the Lord’s word, you kings of Judah and those who live in Jerusalem. This is what the Lord of Armies, the God of Israel, says: I’m going to bring such a disaster on this place that the ears of everyone who hears about it will ring."},{"num":4,"verse":"“The people, their ancestors, and the kings of Judah have abandoned me. They have made this place unrecognizable by burning incense as an offering to other gods that they hadn’t heard of. They have filled this place with the blood of innocent people. "},{"num":5,"verse":"They have built worship sites to burn their children as sacrifices to Baal. I didn’t ask them or command them to do this. It never entered my mind."},{"num":6,"verse":"“That is why the days are coming, declares the Lord, when this place will no longer be called Topheth or the valley of Ben Hinnom. Instead, it will be called Slaughter Valley. "},{"num":7,"verse":"I will smash the plans of Judah and Jerusalem in this place. I will cut them down with swords in front of their enemies and with the hands of those who want to kill them. I will give their bodies as food to birds and to animals. "},{"num":8,"verse":"I will devastate this city. It will become something to hiss at. Everyone who goes by it will be stunned and hiss with contempt at all the disasters that happen to it. "},{"num":9,"verse":"I will make the people eat the flesh of their sons and daughters. They will eat each other’s flesh during blockades and hardships that their enemies impose on them when they want to kill them.”"},{"num":10,"verse":"⌞The Lord says,⌟ “Then smash the jar in front of the men who went with you. "},{"num":11,"verse":"Say to them, ‘This is what the Lord of Armies says: I will smash these people and this city as this potter’s jar was smashed beyond repair. They will bury ⌞the dead⌟ in Topheth until there’s no other place to bury them. "},{"num":12,"verse":"That’s what I will do to this place and to those who live in it, declares the Lord. I will make this city like Topheth. "},{"num":13,"verse":"The houses in Jerusalem, the houses of the kings of Judah, and all the rooftops of the houses will be unclean  like this city Topheth. This is because people burned incense to the entire army of heaven and poured out wine offerings to other gods.’ ”"},{"num":14,"verse":"Then Jeremiah left Topheth, where the Lord had sent him to prophesy. He stood in the courtyard of the Lord’s temple and said to all the people, "},{"num":15,"verse":"“This is what the Lord of Armies, the God of Israel, says: I’m going to bring on this city and on all its towns the disasters that I threatened. They’ve become impossible to deal with, and they refuse to obey me.”"}]