[{"header":"The Clay Jar"},{"num":19,"verse":"This is what the Lord says: “Go, buy a potter’s clay jar. Take some of the elders of the people and some of the leading priests "},{"num":2,"verse":"and go out to the Valley of Hinnom near the entrance of the Potsherd Gate. Proclaim there the words I speak to you. "},{"num":3,"verse":"Say: Hear the word of the Lord, kings of Judah and residents of Jerusalem. This is what the Lord of Hosts, the God of Israel, says: I am going to bring such disaster on this place that everyone who hears about it will shudder "},{"num":4,"verse":"because they have abandoned Me and made this a foreign place. They have burned incense in it to other gods that they, their fathers, and the kings of Judah have never known. They have filled this place with the blood of the innocent. "},{"num":5,"verse":"They have built high places to Baal on which to burn their children in the fire as burnt offerings to Baal, something I have never commanded or mentioned; I never entertained the thought."},{"num":6,"verse":"“Therefore, take note! The days are coming”—this is the Lord’s declaration—“when this place will no longer be called Topheth and the Valley of Hinnom, but the Valley of Slaughter. "},{"num":7,"verse":"I will spoil the plans of Judah and Jerusalem in this place. I will make them fall by the sword before their enemies, by the hand of those who want to take their life. I will provide their corpses as food for the birds of the sky and for the wild animals of the land. "},{"num":8,"verse":"I will make this city desolate, an object of scorn. Everyone who passes by it will be horrified and scoff because of all its wounds. "},{"num":9,"verse":"I will make them eat the flesh of their sons and their daughters, and they will eat each other’s flesh in the siege and distress that their enemies, those who want to take their life, inflict on them."},{"num":10,"verse":"“Then you are to shatter the jar in the presence of the people traveling with you, "},{"num":11,"verse":"and you are to proclaim to them: This is what the Lord of Hosts says: I will shatter these people and this city, like one shatters a potter’s jar that can never again be mended. They will bury the dead in Topheth because there is no other place for burials. "},{"num":12,"verse":"I will do so to this place”—this is the declaration of the Lord—“and to its residents, making this city like Topheth. "},{"num":13,"verse":"The houses of Jerusalem and the houses of the kings of Judah will become impure like that place Topheth—all the houses on whose rooftops they have burned incense to the whole heavenly host and poured out drink offerings to other gods.”"},{"num":14,"verse":"Jeremiah came back from Topheth, where the Lord had sent him to prophesy, stood in the courtyard of the Lord’s temple, and proclaimed to all the people, "},{"num":15,"verse":"“This is what the Lord of Hosts, the God of Israel, says: ‘I am about to bring on this city—and on all its dependent villages—all the disaster that I spoke against it, for they have become obstinate, not obeying My words.’”"}]