[{"header":"The Broken Jar"},{"num":19,"verse":"This is what the Lord said to me: “Go and buy a clay jar from a potter. "},{"num":2,"verse":"Go out to the Valley of Ben Hinnom. Go near the front of the Potsherd Gate. Take some of the elders of the people and priests with you. There speak the words I tell you. "},{"num":3,"verse":"Say, ‘King of Judah and people of Jerusalem, listen to this message from the Lord. This is what the Lord of heaven’s armies, the God of Israel, says: I will soon bring a disaster on this place! Everyone who hears about it will be amazed and full of fear. "},{"num":4,"verse":"I will do this because the people of Judah have quit following me. They have made this a place for foreign gods. They have burned sacrifices to other gods. They did not worship these gods long ago! Their ancestors didn’t worship these gods. The kings of Judah filled this place with the blood of the innocent people. "},{"num":5,"verse":"The kings of Judah have built places to worship Baal. There they burn their sons in the fire to Baal. I did not speak about it or tell them to do that. I never even thought of such a thing. "},{"num":6,"verse":"Now people call this place the Valley of Ben Hinnom or Topheth. But watch out! The days are coming, says the Lord, when people will call this place the Valley of Killing."},{"num":7,"verse":"“‘At this place I will ruin the plans of the people of Judah and Jerusalem. The enemy will chase them. And I will let the people of Judah be killed with swords. I will make their dead bodies food for the birds and wild animals. "},{"num":8,"verse":"I will completely destroy this city. People will make fun of it and hiss at it. And they will shake their heads when they pass by Jerusalem. They will be shocked when they see how the city was destroyed. "},{"num":9,"verse":"An enemy army will surround the city. They will not let anyone go out to get food. The people will become so hungry they will eat the bodies of their own sons and daughters. And then they will begin to eat each other.’”"},{"num":10,"verse":"The Lord said, “While the people with you are watching, break that jar. "},{"num":11,"verse":"Then say this: ‘The Lord of heaven’s armies says: I will break this nation and this city just as someone breaks a clay jar. It cannot be put back together again. The dead people will be buried here in Topheth. We will bury bodies until there is no more room. "},{"num":12,"verse":"This is what I will do to these people and to this place, says the Lord. I will make this city like Topheth. "},{"num":13,"verse":"The houses in Jerusalem and the king’s palaces will become as unclean as this place, Topheth. This is because the people worshiped false gods on the roofs of their houses. They worshiped the stars and burned incense to honor them. They gave drink offerings to false gods.’”"},{"num":14,"verse":"Then Jeremiah left Topheth where the Lord had told him to prophesy. He went to the Lord’s Temple, stood in the courtyard and said to all the people: "},{"num":15,"verse":"“This is what the Lord of heaven’s armies, the God of Israel, says: ‘I said I would bring disaster to Jerusalem and the villages around it. I will make it happen soon! This is because the people are very stubborn. They do not listen at all to what I say.’”"}]