[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(15) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Do no unrighteousness in judgment.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—That is, the judges are not to abuse the authority vested in them by virtue of their office, by administering what ought to be justice in an arbitrary manner.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Thou shalt not respect the person of the poor.—The general statement in the preceding clause is here more minutely defined. The consideration for the infirm enjoined in Leviticus 19:14 is not to influence the decision of the judge, who is to administer justice, even if the poor is thereby reduced to greater poverty, and though the rich party to the suit may benevolently desire a verdict against himself to save the needy (Exodus 23:3). The authorities during the second Temple illustrate it as follows:—“If the rich man should say I am by law obliged to provide for the poor, I will therefore let him win the suit, and he will thus have his wants supplied without being subjected to the humiliation of receiving alms; for this reason it is said thou shalt not respect the person of the poor.”",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Thou shalt not respect the person of the poor.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The general statement in the preceding clause is here more minutely defined. The consideration for the infirm enjoined in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 19:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is not to influence the decision of the judge, who is to administer justice, even if the poor is thereby reduced to greater poverty, and though the rich party to the suit may benevolently desire a verdict against himself to save the needy (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 23:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The authorities during the second Temple illustrate it as follows:—“If the rich man should say I am by law obliged to provide for the poor, I will therefore let him win the suit, and he will thus have his wants supplied without being subjected to the humiliation of receiving alms; for this reason it is said thou shalt not respect the person of the poor.”",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Nor honour the person of the mighty.—Jewish juries, in their extreme desire to be impartial, have gone so far as to urge, that whilst the case between a rich man and a poor is being tried, they should both be dressed alike, both alike should either stand or sit, both should have the same right of speech, and both should be addressed by the judge in the same courteous manner. “If ye have respect to persons,” says the Apostle, in allusion to this passage, “ye commit sin, and are convinced of the law as transgressors” (James 2:9, with Leviticus 19:2-4).",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Nor honour the person of the mighty.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Jewish juries, in their extreme desire to be impartial, have gone so far as to urge, that whilst the case between ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "a ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "rich man and a poor is being tried, they should both be dressed alike, both alike should either stand or sit, both should have the same right of speech, and both should be addressed by the judge in the same courteous manner. “If ye have respect to persons,” says the Apostle, in allusion to this passage, “ye commit sin, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "and ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "are convinced of the law as transgressors” (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "James 2:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 19:2-4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ")",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Leviticus 19:15",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 19:15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The poor — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "So as, through pity to him, to give an unrighteous sentence.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "19:1-37 laws. - There are some ceremonial precepts in this chapter, but most of these precepts are binding on us, for they are explanations of the ten commandments. It is required that Israel be a holy people, because the God of Israel is a holy God, ver. 2. To teach real separation from the world and the flesh, and entire devotedness to God. This is now the law of Christ; may the Lord bring every thought within us into obedience to it! Children are to be obedient to their parents, ver. 3. The fear here required includes inward reverence and esteem, outward respect and obedience, care to please them and to make them easy. God only is to be worshipped, ver. 4. Turn not from the true God to false ones, from the God who will make you holy and happy, to those that will deceive you, and make you for ever miserable. Turn not your eyes to them, much less your heart. They should leave the gleanings of their harvest and vintage for the poor, ver. 9. Works of piety must be always attended with works of charity, according to our ability. We must not be covetous, griping, and greedy of every thing we can lay claim to, nor insist upon our right in all things. We are to be honest and true in all our dealings, ver. 11. Whatever we have in the world, we must see that we get it honestly, for we cannot be truly rich, or long rich, with that which is not so. Reverence to the sacred name of God must be shown, ver. 12. We must not detain what belongs to another, particularly the wages of the hireling, ver. 13. We must be tender of the credit and safety of those that cannot help themselves, ver. 14. Do no hurt to any, because they are unwilling or unable to avenge themselves. We ought to take heed of doing any thing which may occasion our weak brother to fall. The fear of God should keep us from doing wrong things, though they will not expose us to men's anger. Judges, and all in authority, are commanded to give judgment without partiality, ver. 15. To be a tale-bearer, and to sow discord among neighbours, is as bad an office as a man can put himself into. We are to rebuke our neighbour in love, ver. 17. Rather rebuke him than hate him, for an injury done to thyself. We incur guilt by not reproving; it is hating our brother. We should say, I will do him the kindness to tell him of his faults. We are to put off all malice, and to put on brotherly love, ver. 18. We often wrong ourselves, but we soon forgive ourselves those wrongs, and they do not at all lessen our love to ourselves; in like manner we should love our neighbour. We must in many cases deny ourselves for the good of our neighbour. Ver. 31: For Christians to have their fortunes told, to use spells and charms, or the like, is a sad affront to God. They must be grossly ignorant who ask, What harm is there in these things? Here is a charge to young people to show respect to the aged, ver. 32. Religion teaches good manners, and obliges us to honour those to whom honour is due. A charge was given to the Israelites to be very tender of strangers, ver. 33. Strangers, and the widows and fatherless, are God's particular care. It is at our peril, if we do them any wrong. Strangers shall be welcome to God's grace; we should do what we can to recommend religion to them. Justice in weights and measures is commanded, ver. 35. We must make conscience of obeying God's precepts. We are not to pick and choose our duty, but must aim at standing complete in all the will of God. And the nearer our lives and tempers are to the precepts of God's law, the happier shall we be, and the happier shall we make all around us, and the better shall we adorn the gospel.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The meaning appears to be, \"Thou shalt not utter curses to the deaf because he cannot hear thee, neither shalt thou put a stumbling-block in the way of the blind because he cannot see thee (compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 27:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), but thou shalt remember that though the weak and poor cannot resist, nor the deaf hear, nor the blind see, God is strong, and sees and hears all that thou doest.\" Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 29:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11-16. Ye shall not steal—A variety of social duties are inculcated in this passage, chiefly in reference to common and little-thought-of vices to which mankind are exceedingly prone; such as committing petty frauds, or not scrupling to violate truth in transactions of business, ridiculing bodily infirmities, or circulating stories to the prejudice of others. In opposition to these bad habits, a spirit of humanity and brotherly kindness is strongly enforced.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Thou shalt not respect the person of the poor, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " so as through pity to him to give an unrighteous sentence. Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Deu 1:17 10:17 Proverbs 24:23",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deu 1:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 10:17 ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 24:23",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ye shall do no unrighteousness in judgment,.... This is said with respect to judges and witnesses, as Aben Ezra notes; that the one should not bear false witness in a court of judicature to the perversion of justice, and the other should not pronounce an unrighteous sentence, justifying the wicked and condemning the righteous: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "thou shalt not respect the person of the poor; that is, in judgment, or in a court of judicature, when a cause of his is brought before it; though privately his person may be respected, and he relieved in his distress as a poor man; but in a court of justice his person and character as a poor man are not to be regarded; the cause is not to be given either for him or against him on that account, without regard to the justice and equity of it; he may be pitied in other respects but in a cause between him and another, even a rich man, not pity, but justice, must take place; see Gill on Exodus 23:3, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "thou shalt not respect the person of the poor; that is, in judgment, or in a court of judicature, when a cause of his is brought before it; though privately his person may be respected, and he relieved in his distress as a poor man; but in a court of justice his person and character as a poor man are not to be regarded; the cause is not to be given either for him or against him on that account, without regard to the justice and equity of it; he may be pitied in other respects but in a cause between him and another, even a rich man, not pity, but justice, must take place; see Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 23:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "nor honour the person of the mighty; not fear to put him to shame and blushing, by giving the cause against him, if he is in the wrong; his riches, his grandeur, his honour, must not came into any account, or have any weight or influence on the court to pervert justice: the Jewish writers, particularly Maimonides (z) suggest that there was to be no difference between a rich man and a poor man while their cause was trying; that they were to be clothed either both in a rich habit, or both in a mean one; and that their posture was to be alike, whether sitting or standing; as well as that no favour should be shown to one more than to another; as that one might have liberty to speak as much and as long as he pleased, and the other bid to be short; or the one be spoken tenderly to, and the other harshly: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "but in righteousness shall thou judge thy neighbour; be he rich or poor, doing justice to both, and showing no partiality to either; see Proverbs 18:5. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "but in righteousness shall thou judge thy neighbour; be he rich or poor, doing justice to both, and showing no partiality to either; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 18:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(z) Hilchot Sanhedrin, c. 21. sect. 1, 2, 3.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(z) Hilchot Sanhedrin, c. 21. sect. 1, 2, 3.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Ye shall do no unrighteousness in judgment: thou shalt not respect the person of the poor, nor honor the person of the mighty: but in righteousness shalt thou judge thy neighbor.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ye shall do no unrighteousness in judgement",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Leviticus 19:35",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 19:35",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "15, 16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Against unrighteousness in judgement, and slander. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 23:1-3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 23:6-7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 1:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 16:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 27:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 82:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 24:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 15.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - Justice is to be done to all. The less danger of ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "respecting the person of the poor",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " has to be guarded against, as well as the greater and more obvious peril of ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "honouring the person of the mighty.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The scales of Justice must be held even and her eyes bandaged, that she may not prefer one appellant to another on any ground except that of merit and demerit. \"If ye have respect to persons, ye commit sin, and are convinced of the law as transgressors\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "James 2:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Leviticus 19:15",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In judgment, i.e., in the administration of justice, they were to do no unrighteousness: neither to respect the person of the poor (πρόσωπον λαμβάνειν, to do anything out of regard to a person, used in a good sense in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 19:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in a bad sense here, namely, to act partially from unmanly pity); nor to adorn the person of the great (i.e., powerful, distinguished, exalted), i.e., to favour him in a judicial decision (see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 23:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      }
    ]
  }
]