[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(24) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "But in the fourth year.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Like the second tithes the fruits of the fourth year were taken up to Jerusalem, and there eaten by the owner, in company with the poor and needy whom he invited to the repast. The owner, however, was also allowed to redeem them. In this case he had to add the fifth part of their value, take up the money to the holy city, and there spend it in a repast to which he invited the poor. The grapes of the vineyards within a distance of a day’s journey of Jerusalem had, however, to be taken up to decorate the streets of the holy city. Vineyards of the fourth year were exempt from the law laid down in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 19:9-10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as well as from the law of first-fruits, tithes, and second tithes.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Shall be holy to praise the Lord withal.—Better, shall be holy, a praise to the Lord, that is, either the fruits themselves, or their equivalent in money, shall be spent in the holy city, thus offering them at this sacrificial repast in praise to the Lord. (Comp. Judges 9:27.)",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Shall be holy to praise the Lord withal.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Better, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "shall be holy, a praise to the Lord, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "that is, either the fruits themselves, or their equivalent in money, shall be spent in the holy city, thus offering them at this sacrificial repast in praise to the Lord. (Comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 9:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Leviticus 19:24",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 19:24",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Holy — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Consecrated to the Lord, as the first-fruits and tithes were, and therefore given to the priests and Levites, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 18:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "13; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 18:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; yet so that part of them were communicated to the poor widows, and fatherless, and strangers, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 14:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; to bless the Lord, by whose power and goodness the trees bring forth fruit to perfection.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "19:1-37 laws. - There are some ceremonial precepts in this chapter, but most of these precepts are binding on us, for they are explanations of the ten commandments. It is required that Israel be a holy people, because the God of Israel is a holy God, ver. 2. To teach real separation from the world and the flesh, and entire devotedness to God. This is now the law of Christ; may the Lord bring every thought within us into obedience to it! Children are to be obedient to their parents, ver. 3. The fear here required includes inward reverence and esteem, outward respect and obedience, care to please them and to make them easy. God only is to be worshipped, ver. 4. Turn not from the true God to false ones, from the God who will make you holy and happy, to those that will deceive you, and make you for ever miserable. Turn not your eyes to them, much less your heart. They should leave the gleanings of their harvest and vintage for the poor, ver. 9. Works of piety must be always attended with works of charity, according to our ability. We must not be covetous, griping, and greedy of every thing we can lay claim to, nor insist upon our right in all things. We are to be honest and true in all our dealings, ver. 11. Whatever we have in the world, we must see that we get it honestly, for we cannot be truly rich, or long rich, with that which is not so. Reverence to the sacred name of God must be shown, ver. 12. We must not detain what belongs to another, particularly the wages of the hireling, ver. 13. We must be tender of the credit and safety of those that cannot help themselves, ver. 14. Do no hurt to any, because they are unwilling or unable to avenge themselves. We ought to take heed of doing any thing which may occasion our weak brother to fall. The fear of God should keep us from doing wrong things, though they will not expose us to men's anger. Judges, and all in authority, are commanded to give judgment without partiality, ver. 15. To be a tale-bearer, and to sow discord among neighbours, is as bad an office as a man can put himself into. We are to rebuke our neighbour in love, ver. 17. Rather rebuke him than hate him, for an injury done to thyself. We incur guilt by not reproving; it is hating our brother. We should say, I will do him the kindness to tell him of his faults. We are to put off all malice, and to put on brotherly love, ver. 18. We often wrong ourselves, but we soon forgive ourselves those wrongs, and they do not at all lessen our love to ourselves; in like manner we should love our neighbour. We must in many cases deny ourselves for the good of our neighbour. Ver. 31: For Christians to have their fortunes told, to use spells and charms, or the like, is a sad affront to God. They must be grossly ignorant who ask, What harm is there in these things? Here is a charge to young people to show respect to the aged, ver. 32. Religion teaches good manners, and obliges us to honour those to whom honour is due. A charge was given to the Israelites to be very tender of strangers, ver. 33. Strangers, and the widows and fatherless, are God's particular care. It is at our peril, if we do them any wrong. Strangers shall be welcome to God's grace; we should do what we can to recommend religion to them. Justice in weights and measures is commanded, ver. 35. We must make conscience of obeying God's precepts. We are not to pick and choose our duty, but must aim at standing complete in all the will of God. And the nearer our lives and tempers are to the precepts of God's law, the happier shall we be, and the happier shall we make all around us, and the better shall we adorn the gospel.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Fruit ... uncircumcised - i. e. unfit for presentation to Yahweh. In regard to its spiritual lesson, this law may be compared with the dedication of the first-born of beasts to Yahweh ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 13:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 34:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Its meaning in a moral point of view was plain, and tended to illustrate the spirit of the whole Law. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "23-25. ye shall count the fruit thereof as uncircumcised; three years … it shall not be eaten of—\"The wisdom of this law is very striking. Every gardener will teach us not to let fruit trees bear in their earliest years, but to pluck off the blossoms: and for this reason, that they will thus thrive the better, and bear more abundantly afterwards. The very expression, 'to regard them as uncircumcised,' suggests the propriety of pinching them off; I do not say cutting them off, because it is generally the hand, and not a knife, that is employed in this operation\" [Michaelis].",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Consecrated to the Lord, as the first-fruits and tithes were, and therefore given to the priests and Levites, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Numbers 18:12,13 Deu 18:4",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 18:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",13 Deu 18:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; yet so that part of them were communicated to the poor widows, and fatherless, and strangers. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Deu 14:28,29",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deu 14:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",29",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "To praise the Lord withal; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to bless the Lord, by whose power and goodness the trees bring forth fruit to perfection. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But in the fourth year all the fruit thereof shall be holy,.... Separated and devoted to the service of God, to be given to the priest, or to be bought again of him; wherefore the Targum of Jonathan adds, at the end of the verse, \"redeemed from the priest\", a redemption price being given to the priest; and, as Jarchi observes, as the tithe was not eaten without the walls of Jerusalem, but by redemption, even so likewise this: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "to praise the Lord withal; for his abundant goodness in blessing and making the trees fruitful, and bringing their fruit unto perfection; and by devoting the first fruits to God, his name was praised and glorified, as well as by eating them with joy and gladness before the Lord in Jerusalem. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "to praise the Lord withal; for his abundant goodness in blessing and making the trees fruitful, and bringing their fruit unto perfection; and by devoting the first fruits to God, his name was praised and glorified, as well as by eating them with joy and gladness before the Lord in Jerusalem. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "But in the fourth year all the fruit thereof shall be holy to praise the LORD withal.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The garden-fruit was also to be sanctified to the Lord. When the Israelites had planted all kinds of fruit-trees in the land of Canaan, they were to treat the fruit of every tree as uncircumcised for the first three years, i.e., not to eat it, as being uncircumcised. The singular suffix in ערלתו refers to כּל, and the verb ערל is a denom. from ערלה, to make into a foreskin, to treat as uncircumcised, i.e., to throw away as unclean or uneatable. The reason for this command is not to be sought for in the fact, that in the first three years fruit-trees bear only a little fruit, and that somewhat insipid, and that if the blossom or fruit is broken off the first year, the trees will bear all the more plentifully afterwards (Aben Esra, Clericus, J. D. Mich.), though this end would no doubt be thereby attained; but it rests rather upon ethical grounds. Israel was to treat the fruits of horticulture with the most careful regard as a gift of God, and sanctify the enjoyment of them by a thank-offering. In the fourth year the whole of the fruit was to be a holiness of praise for Jehovah, i.e., to be offered to the Lord as a holy sacrificial gift, in praise and thanksgiving for the blessing which He had bestowed upon the fruit-trees. This offering falls into the category of first-fruits, and was no doubt given up entirely to the Lord for the servants of the altar; although the expression הלּוּלים עשׂה (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 9:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") seems to point to sacrificial meals of the first-fruits, that had already been reaped: and this is the way in which Josephus has explained the command (Ant. iv. 8, 19). For (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 19:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") they were not to eat the fruits till the fifth year, \"to add (increase) its produce to you,\" viz., by the blessing of God, not by breaking off the fruits that might set in the first years.",
        "children": []
      }
    ]
  }
]