[{"num":1,"verse":"From James, a servant of God and of our Lord Jesus Christ."},{"header":"Faith and Wisdom"},{"num":2,"verse":"My friends, be glad, even if you have a lot of trouble. "},{"num":3,"verse":"You know that you learn to endure by having your faith tested. "},{"num":4,"verse":"But you must learn to endure everything, so that you will be completely mature and not lacking in anything."},{"num":5,"verse":"If any of you need wisdom, you should ask God, and it will be given to you. God is generous and won’t correct you for asking. "},{"num":6,"verse":"But when you ask for something, you must have faith and not doubt. Anyone who doubts is like an ocean wave tossed around in a storm. "},{"num":7,"verse":"If you are that kind of person, you can’t make up your mind, and you surely can’t be trusted. So don’t expect the Lord to give you anything at all."},{"header":"Poor People and Rich People"},{"num":9,"verse":"Any of God’s people who are poor should be glad that he thinks so highly of them. "},{"num":10,"verse":"But any who are rich should be glad when God makes them humble. Rich people will disappear like wild flowers "},{"num":11,"verse":"scorched by the burning heat of the sun. The flowers lose their blossoms, and their beauty is destroyed. That is how the rich will disappear, as they go about their business."},{"header":"Trials and Temptations"},{"num":12,"verse":"God will bless you, if you don’t give up when your faith is being tested. He will reward you with a glorious life, just as he rewards everyone who loves him."},{"num":13,"verse":"Don’t blame God when you are tempted! God cannot be tempted by evil, and he doesn’t use evil to tempt others. "},{"num":14,"verse":"We are tempted by our own desires that drag us off and trap us. "},{"num":15,"verse":"Our desires make us sin, and when sin is finished with us, it leaves us dead."},{"num":16,"verse":"Don’t be fooled, my dear friends. "},{"num":17,"verse":"Every good and perfect gift comes down from the Father who created all the lights in the heavens. He is always the same and never makes dark shadows by changing. "},{"num":18,"verse":"He wanted us to be his own special people, and so he sent the true message to give us new birth."},{"header":"Hearing and Obeying"},{"num":19,"verse":"My dear friends, you should be quick to listen and slow to speak or to get angry. "},{"num":20,"verse":"If you are angry, you cannot do any of the good things that God wants done. "},{"num":21,"verse":"You must stop doing anything immoral or evil. Instead be humble and accept the message that is planted in you to save you."},{"num":22,"verse":"Obey God’s message! Don’t fool yourselves by just listening to it. "},{"num":23,"verse":"If you hear the message and don’t obey it, you are like people who stare at themselves in a mirror "},{"num":24,"verse":"and forget what they look like as soon as they leave. "},{"num":25,"verse":"But you must never stop looking at the perfect law that sets you free. God will bless you in everything you do, if you listen and obey, and don’t just hear and forget."},{"num":26,"verse":"If you think you are being religious, but can’t control your tongue, you are fooling yourself, and everything you do is useless. "},{"num":27,"verse":"Religion that pleases God the Father must be pure and spotless. You must help needy orphans and widows and not let this world make you evil."}]