[[],[{"type":"header","content":"Greeting"},{"type":"prose","content":"James, a servant of God and of the Lord Jesus Christ,To the twelve tribes in the Dispersion:Greetings."},{"type":"header","content":"Testing of Your Faith"}],[{"type":"prose","content":"Count it all joy, my brothers, when you meet trials of various kinds,"}],[{"type":"prose","content":"for you know that the testing of your faith produces steadfastness."}],[{"type":"prose","content":"And let steadfastness have its full effect, that you may be perfect and complete, lacking in nothing."}],[{"type":"prose","content":"If any of you lacks wisdom, let him ask God, who gives generously to all without reproach, and it will be given him."}],[{"type":"prose","content":"But let him ask in faith, with no doubting, for the one who doubts is like a wave of the sea that is driven and tossed by the wind."}],[{"type":"prose","content":"For that person must not suppose that he will receive anything from the Lord;"}],[{"type":"prose","content":"he is a double-minded man, unstable in all his ways."}],[{"type":"prose","content":"Let the lowly brother boast in his exaltation,"}],[{"type":"prose","content":"and the rich in his humiliation, because like a flower of the grass he will pass away."}],[{"type":"prose","content":"For the sun rises with its scorching heat and withers the grass; its flower falls, and its beauty perishes. So also will the rich man fade away in the midst of his pursuits."}],[{"type":"prose","content":"Blessed is the man who remains steadfast under trial, for when he has stood the test he will receive the crown of life, which God has promised to those who love him."}],[{"type":"prose","content":"Let no one say when he is tempted, “I am being tempted by God,” for God cannot be tempted with evil, and he himself tempts no one."}],[{"type":"prose","content":"But each person is tempted when he is lured and enticed by his own desire."}],[{"type":"prose","content":"Then desire when it has conceived gives birth to sin, and sin when it is fully grown brings forth death."}],[{"type":"prose","content":"Do not be deceived, my beloved brothers."}],[{"type":"prose","content":"Every good gift and every perfect gift is from above, coming down from the Father of lights, with whom there is no variation or shadow due to change."}],[{"type":"prose","content":"Of his own will he brought us forth by the word of truth, that we should be a kind of firstfruits of his creatures."},{"type":"header","content":"Hearing and Doing the Word"}],[{"type":"prose","content":"Know this, my beloved brothers: let every person be quick to hear, slow to speak, slow to anger;"}],[{"type":"prose","content":"for the anger of man does not produce the righteousness of God."}],[{"type":"prose","content":"Therefore put away all filthiness and rampant wickedness and receive with meekness the implanted word, which is able to save your souls."}],[{"type":"prose","content":"But be doers of the word, and not hearers only, deceiving yourselves."}],[{"type":"prose","content":"For if anyone is a hearer of the word and not a doer, he is like a man who looks intently at his natural face in a mirror."}],[{"type":"prose","content":"For he looks at himself and goes away and at once forgets what he was like."}],[{"type":"prose","content":"But the one who looks into the perfect law, the law of liberty, and perseveres, being no hearer who forgets but a doer who acts, he will be blessed in his doing."}],[{"type":"prose","content":"If anyone thinks he is religious and does not bridle his tongue but deceives his heart, this person's religion is worthless."}],[{"type":"prose","content":"Religion that is pure and undefiled before God the Father is this: to visit orphans and widows in their affliction, and to keep oneself unstained from the world."}]]