[{"header":"Greeting"},{"num":1,"verse":"James, a slave of God and of the Lord Jesus Christ:"},{"header":"Trials and Maturity"},{"num":2,"verse":"Consider it a great joy, my brothers, whenever you experience various trials, "},{"num":3,"verse":"knowing that the testing of your faith produces endurance. "},{"num":4,"verse":"But endurance must do its complete work, so that you may be mature and complete, lacking nothing."},{"num":5,"verse":"Now if any of you lacks wisdom, he should ask God, who gives to all generously and without criticizing, and it will be given to him. "},{"num":6,"verse":"But let him ask in faith without doubting. For the doubter is like the surging sea, driven and tossed by the wind. "},{"num":7,"verse":"That person should not expect to receive anything from the Lord. "},{"num":8,"verse":"An indecisive man is unstable in all his ways."},{"num":9,"verse":"The brother of humble circumstances should boast in his exaltation, "},{"num":10,"verse":"but the one who is rich should boast in his humiliation because he will pass away like a flower of the field. "},{"num":11,"verse":"For the sun rises with its scorching heat and dries up the grass; its flower falls off, and its beautiful appearance is destroyed. In the same way, the rich man will wither away while pursuing his activities."},{"num":12,"verse":"A man who endures trials is blessed, because when he passes the test he will receive the crown of life that God has promised to those who love Him."},{"num":13,"verse":"No one undergoing a trial should say, “I am being tempted by God.” For God is not tempted by evil, and He Himself doesn’t tempt anyone. "},{"num":14,"verse":"But each person is tempted when he is drawn away and enticed by his own evil desires. "},{"num":15,"verse":"Then after desire has conceived, it gives birth to sin, and when sin is fully grown, it gives birth to death."},{"num":16,"verse":"Don’t be deceived, my dearly loved brothers. "},{"num":17,"verse":"Every generous act and every perfect gift is from above, coming down from the Father of lights; with Him there is no variation or shadow cast by turning. "},{"num":18,"verse":"By His own choice, He gave us a new birth by the message of truth so that we would be the firstfruits of His creatures."},{"header":"Hearing and Doing the Word"},{"num":19,"verse":"My dearly loved brothers, understand this: Everyone must be quick to hear, slow to speak, and slow to anger, "},{"num":20,"verse":"for man’s anger does not accomplish God’s righteousness. "},{"num":21,"verse":"Therefore, ridding yourselves of all moral filth and evil, humbly receive the implanted word, which is able to save you."},{"num":22,"verse":"But be doers of the word and not hearers only, deceiving yourselves. "},{"num":23,"verse":"Because if anyone is a hearer of the word and not a doer, he is like a man looking at his own face in a mirror. "},{"num":24,"verse":"For he looks at himself, goes away, and immediately forgets what kind of man he was. "},{"num":25,"verse":"But the one who looks intently into the perfect law of freedom and perseveres in it, and is not a forgetful hearer but one who does good works—this person will be blessed in what he does."},{"num":26,"verse":"If anyone thinks he is religious without controlling his tongue, then his religion is useless and he deceives himself. "},{"num":27,"verse":"Pure and undefiled religion before our God and Father is this: to look after orphans and widows in their distress and to keep oneself unstained by the world."}]