[{"num":1,"verse":"I am James. I am a servant of God and of the Lord Jesus Christ. I send greetings to all of God's people wherever they live."},{"num":2,"verse":"My brothers, be very happy when you are tested by having troubles of many kinds."},{"num":3,"verse":"You know this, that when you prove you believe, you become stronger to take troubles."},{"num":4,"verse":"But you must keep on being strong to take trouble. Then you will be all right in every way. You will not need anything more."},{"num":5,"verse":"If any of you need to be wise, ask God to make you wise. He gives plenty of wisdom to all people. He is not angry because you ask him. He will make you wise."},{"num":6,"verse":"But when you ask, you must believe that God will do it. You must not doubt and think, `Perhaps God will not do it.' A person who doubts is like a wave on the sea. The wind drives it this way and that way."},{"num":7,"verse":"That person must not think that he will get anything from the Lord."},{"num":8,"verse":"A person like that has two minds. He cannot go straight in any of his ways."},{"num":9,"verse":"A Christian brother who is poor should be glad: he is in a high place now he is a Christian."},{"num":10,"verse":"A Christian brother who is rich should be glad: he is in a low place now he is a Christian. A rich man will pass away like a flower on the grass."},{"num":11,"verse":"The sun shines and is very hot. Then the grass dries and its flower falls off. It was nice at first, but now it is not nice any more. In the same way, the rich man will die while he is going around trying to make money."},{"num":12,"verse":"God will bless any man who is strong to take his trouble, when he is being tested. When he has proved he is strong, he will live for ever. That is what the Lord has promised to those who love him."},{"num":13,"verse":"No one who wants to do something wrong should say, `God is trying to make me do this wrong thing.' God cannot do anything wrong."},{"num":14,"verse":"It is their own heart which is wrong. That is why he wants to do something wrong. It fools him."},{"num":15,"verse":"Then the wrong in his heart makes him do the wrong thing. And the wrong thing he has done leads to death."},{"num":16,"verse":"My dear brothers, do not fool yourselves."},{"num":17,"verse":"Every good thing and every fine gift comes from heaven. It comes from the Father of all light. He does not change and he makes no shadow by turning."},{"num":18,"verse":"He made us his children because he wanted us. He made us his children by giving us his true word. He made us his children so that we would be the first and best of all he made."},{"num":19,"verse":"My dear brothers, do not forget this. Every man should be quick to listen, slow to speak, and slow to be angry."},{"num":20,"verse":"When a man is angry, he does not do what God says is right."},{"num":21,"verse":"So stop all your dirty living. Stop doing so many wrong things. Listen quietly to the word that has been put in your hearts. It is able to save you."},{"num":22,"verse":"But obey God's word. Do not just listen to it. If you just listen to it, you fool yourselves."},{"num":23,"verse":"Anyone who just listens to the word, and does not obey it, is like a man who looks at his face in a looking glass."},{"num":24,"verse":"He looks at himself and goes away, and right away he forgets what he looked like."},{"num":25,"verse":"But there is a law that is all right. It sets people free from their old ways. Anyone who looks into that law and remembers it, is happy because he obeys the law. He does not just listen to the law and forget it, but he obeys what the law says."},{"num":26,"verse":"Some of you think that you are doing what God wants. But you are not careful what you say. If you are like that, you are fooling yourself. And you are not doing what God wants."},{"num":27,"verse":"This is what God the Father wants. It is clean and right. Go and help those who have no father and mother. Go and help widow women whose husbands are dead. These people have troubles. And keep yourself clean from the wrong things in the world."}]