[[],[{"type":"header","content":"Fate of Ananias and Sapphira"},{"type":"prose","content":"Now a man named Ananias, with his wife Sapphira, sold a piece of property, "}],[{"type":"prose","content":"and with his wife’s full knowledge [and complicity] he kept back some of the proceeds, bringing only a portion of it, and set it at the apostles’ feet. "}],[{"type":"prose","content":"But Peter said, “Ananias, why has Satan filled your heart to lie to the Holy Spirit and [secretly] keep back for yourself some of the proceeds [from the sale] of the land? "}],[{"type":"prose","content":"As long as it remained [unsold], did it not remain your own [to do with as you pleased]? And after it was sold, was the money not under your control? Why is it that you have conceived this act [of hypocrisy and deceit] in your heart? You have not [simply] lied to people, but to God.” "}],[{"type":"prose","content":"And hearing these words, Ananias fell down suddenly and died; and great fear  awe gripped those who heard of it. "}],[{"type":"prose","content":"And the young men [in the congregation] got up and wrapped up the body, and carried it out and buried it."}],[{"type":"prose","content":"Now after an interval of about three hours his wife came in, not knowing what had happened. "}],[{"type":"prose","content":"Peter asked her, “Tell me whether you sold your land for so much?” And she said, “Yes, for so much.” "}],[{"type":"prose","content":"Then Peter said to her, “How could you two have agreed together to put the Spirit of the Lord to the test? Look! The feet of those who have buried your husband are at the door, and they will carry you out also.” "}],[{"type":"prose","content":"And at once she fell down at his feet and died; and the young men came in and found her dead, and they carried her out and buried her beside her husband. "}],[{"type":"prose","content":"And great fear  awe gripped the whole church, and all who heard about these things."}],[{"type":"prose","content":"At the hands of the apostles many signs and wonders (attesting miracles) were  taking place among the people. And by common consent they all met together [at the temple] in [the covered porch called] Solomon’s portico. "}],[{"type":"prose","content":"But none of the rest [of the people, the non-believers] dared to associate with them; however, the people were holding them in high esteem  were speaking highly of them. "}],[{"type":"prose","content":"More  more believers in the Lord, crowds of men and women, were constantly being added to , "}],[{"type":"prose","content":"to such an extent that they even carried their sick out into the streets and put them on cots and sleeping pads, so that when Peter came by at least his shadow might fall on one of them [with healing power]. "}],[{"type":"prose","content":"And the people from the towns in the vicinity of Jerusalem were coming together, bringing the sick and those who were tormented by unclean spirits, and they were all being healed."}],[{"type":"header","content":"Imprisonment and Release"},{"type":"prose","content":"But the high priest stood up, along with all his associates that is, the sect of the Sadducees, and they were filled with jealousy  resentment. "}],[{"type":"prose","content":"They arrested the apostles and put them in a public jail. "}],[{"type":"prose","content":"But during the night an angel of the Lord opened the prison doors, and leading them out, he said, "}],[{"type":"prose","content":"“Go, stand and  to tell the people in the temple [courtyards] the whole message of this Life [the eternal life revealed by Christ and found through faith in Him].” "}],[{"type":"prose","content":"When they heard this, they went into the temple [courtyards] about daybreak and  teaching.Now when the high priest and his associates arrived, they called together the Council (Sanhedrin, Jewish High Court), even all the council of elders of the sons of Israel, and sent word to the prison for the apostles to be brought [before them]. "}],[{"type":"prose","content":"But when the officers arrived, they did not find them in the prison; and they came back and reported, "}],[{"type":"prose","content":"“We found the prison securely locked and the guards standing at the doors, but when we opened [the doors], we found no one inside.” "}],[{"type":"prose","content":"Now when the captain of the temple  and the chief priests heard these things, they were greatly perplexed, wondering what would come of this. "}],[{"type":"prose","content":"But someone came and told them, “The men whom you put in prison are standing [right here] in the temple [area], teaching the people!” "}],[{"type":"prose","content":"Then the captain went with the officers and brought them back, without hurting them because they were afraid of the people, worried that they might be stoned."}],[{"type":"prose","content":"So they brought them and presented them before the Council (Sanhedrin, Jewish High Court). The high priest questioned them, "}],[{"type":"prose","content":"saying, “We gave you strict orders not to continue teaching in this name, and yet you have filled Jerusalem with your teaching and you intend to bring this Man’s blood on us [by accusing us as His murderers].” "}],[{"type":"prose","content":"Then Peter and the apostles replied, “We must obey God rather than men [we have no other choice]. "}],[{"type":"prose","content":"The God of our fathers raised up Jesus, whom you had put to death by hanging Him on a cross [and you are responsible]. "}],[{"type":"prose","content":"God exalted Him to His right hand as Prince and Savior  Deliverer, in order to grant repentance to Israel, and [to grant] forgiveness of sins. "}],[{"type":"prose","content":"And we are witnesses of these things; and so is the Holy Spirit, whom God has bestowed on those who obey Him.”"}],[{"type":"header","content":"Gamaliel’s Counsel"},{"type":"prose","content":"Now when they heard this, they were infuriated and they intended to kill the apostles. "}],[{"type":"prose","content":"But a Pharisee named Gamaliel, a teacher of the Law [of Moses], highly esteemed by all the people, stood up in the Council (Sanhedrin, Jewish High Court) and ordered that the men be taken outside for a little while. "}],[{"type":"prose","content":"Then he said to the Council, “Men of Israel, be careful in regard to what you propose to do to these men. "}],[{"type":"prose","content":"For some time ago Theudas rose up, claiming to be somebody [of importance], and a group of about four hundred men allied themselves with him. But he was killed, and all who followed him were scattered and came to nothing. "}],[{"type":"prose","content":"After this man, Judas the Galilean rose up, [and led an uprising] during the time of the census, and drew people after him; he was also killed, and all his followers were scattered. "}],[{"type":"prose","content":"So in the present case, I say to you, stay away from these men and let them alone, for if this plan or action is of men [merely human in origin], it will fail  be destroyed; "}],[{"type":"prose","content":"but if it is of God [and it appears that it is], you will not be able to stop them; or else you may even be found fighting against God!”"}],[{"type":"prose","content":"The Council (Sanhedrin, Jewish High Court) took his advice; and after summoning the apostles, they flogged them and ordered them not to speak in the name of Jesus, and released them. "}],[{"type":"prose","content":"So they left the Council, rejoicing that they had been considered worthy [dignified by indignity] to suffer shame for [the sake of] His name. "}],[{"type":"prose","content":"And every single day, in the temple [area] and in homes, they did not stop teaching and telling the good news of Jesus as the Christ (the Messiah, the Anointed)."}]]