[{"num":6,"verse":"And Job answered and said,"},{"num":2,"verse":"Oh that my grief were thoroughly weighed, and all my calamity laid in the balances!"},{"num":3,"verse":"For now it would be heavier than the sand of the seas; therefore my words are vehement."},{"num":4,"verse":"For the arrows of the Almighty are within me, their poison drinketh up my spirit: the terrors of +God are arrayed against me."},{"num":5,"verse":"Doth the wild ass bray by the grass? loweth an ox over his fodder?"},{"num":6,"verse":"Shall that which is insipid be eaten without salt? Is there any taste in the white of an egg?"},{"num":7,"verse":"What my soul refuseth to touch, that is as my loathsome food."},{"num":8,"verse":"Oh that I might have my request, and that +God would grant my desire!"},{"num":9,"verse":"And that it would please +God to crush me, that he would let loose his hand and cut me off!"},{"num":10,"verse":"Then should I yet have comfort; and in the pain which spareth not I would rejoice that I have not denied the words of the Holy One."},{"num":11,"verse":"What is my strength, that I should hope? and what is mine end, that I should have patience?"},{"num":12,"verse":"Is my strength the strength of stones? is my flesh of brass?"},{"num":13,"verse":"Is it not that there is no help in me, and soundness is driven away from me?"},{"num":14,"verse":"For him that is fainting kindness [is meet] from his friend; or he forsaketh the fear of the Almighty."},{"num":15,"verse":"My brethren have dealt deceitfully as a stream, as the channel of streams which pass away,"},{"num":16,"verse":"Which are turbid by reason of the ice, in which the snow hideth itself:"},{"num":17,"verse":"At the time they diminish, they are dried up; when heat affecteth them, they vanish from their place:"},{"num":18,"verse":"They wind about in the paths of their course, they go off into the waste and perish."},{"num":19,"verse":"The caravans of Tema looked, the companies of Sheba counted on them:"},{"num":20,"verse":"They are ashamed at their hope; they come thither, and are confounded."},{"num":21,"verse":"So now ye are nothing; ye see a terrible object and are afraid."},{"num":22,"verse":"Did I say, Bring unto me, and make me a present from your substance?"},{"num":23,"verse":"Or, rescue me from the hand of the oppressor, and redeem me from the hand of the violent?"},{"num":24,"verse":"Teach me, and I will hold my tongue; and cause me to understand wherein I have erred."},{"num":25,"verse":"How forcible are right words! but what doth your upbraiding reprove?"},{"num":26,"verse":"Do ye imagine to reprove words? The speeches of one that is desperate are indeed for the wind."},{"num":27,"verse":"Yea, ye overwhelm the fatherless, and dig [a pit] for your friend."},{"num":28,"verse":"Now therefore if ye will, look upon me; and it shall be to your face if I lie."},{"num":29,"verse":"Return, I pray you, let there be no wrong; yea, return again, my righteousness shall be in it."},{"num":30,"verse":"Is there wrong in my tongue? cannot my taste discern mischievous things?"}]