[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "42:29-38 Here is the report Jacob's sons made to their father. It troubled the good man. Even the bundles of money Joseph returned, in kindness, to his father, frightened him. He laid the fault upon his sons; knowing them, he feared they had provoked the Egyptians, and wrongfully brought home their money. Jacob plainly distrusted his sons, remembering that he never saw Joseph since he had been with them. It is bad with a family, when children behave so ill that their parents know not how to trust them. Jacob gives up Joseph for gone, and Simeon and Benjamin as in danger; and concludes, All these things are against me. It proved otherwise, that all these things were for him, were working together for his good, and the good of his family. We often think that to be against us, which is really for us. We are afflicted in body, estate, name, and in our relations; and think all these things are against us, whereas they are really working for us a weight of glory. Thus does the Lord Jesus conceal himself and his favour, thus he rebukes and chastens those for whom he has purposes of love. By sharp corrections and humbling convictions he will break the stoutness and mar the pride of the heart, and bring to true repentance. Yet before sinners fully know him, or taste that he is gracious, he consults their good, and sustains their souls, to wait for him. May we do thus, never yielding to discouragement, determining to seek no other refuge, and humbling ourselves more and more under his mighty hand. In due time he will answer our petitions, and do for us more than we can expect.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The nine brothers return home and record their wonderful adventure. \"In the inn;\" the lodge or place where they stopped for the night. This place was not yet perhaps provided with even the shelter of a roof. It was merely the usual place of halting. They would probably occupy six or seven days on the journey. Apparently at the first stage one opened his sack to give provender to his ass. The discovery of the silver in its mouth strikes them with terror. In a strange land and with an uneasy conscience they are easily alarmed. It was not convenient or necessary to open all the bags on the way, and so they make no further discovery.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "27. inn—a mere station for baiting beasts of burden.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "he espied his money—The discovery threw them into greater perplexity than ever. If they had been congratulating themselves on escaping from the ruthless governor, they perceived that now he would have a handle against them; and it is observable that they looked upon this as a judgment of heaven. Thus one leading design of Joseph was gained in their consciences being roused to a sense of guilt.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "We be twelve brethren, sons of our father,.... All brethren by the father's side, though not by the mother's, and by one father; they had been twelve, and were so now, though they knew it not, supposing that one was dead, as is next observed: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "one is not; is not alive, but dead; the Targum of Jonathan is,\"what is become of one we know not\" ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the youngest is this day with our father in the land of Canaan; see Genesis 42:13. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and the youngest is this day with our father in the land of Canaan; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 42:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "We be twelve brethren, sons of our father; one is not, and the youngest is this day with our father in the land of Canaan.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "On their arrival at home, they told their father all that had occurred. ",
        "children": []
      }
    ]
  }
]