[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(8) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Joseph knew.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—As this is twice repeated, some suppose that Joseph (in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 42:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") had only a suspicion, from their dress and appearance, that these Canaanites were his brethren; but that when they spake the Hebrew tongue (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 42:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), every doubt was removed. They would not recognize him, as he used the Egyptian language, was clad in a white linen dress, and being but seventeen when sold, had during the twenty years of separation changed in appearance much more than they had.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "42:7-20 Joseph was hard upon his brethren, not from a spirit of revenge, but to bring them to repentance. Not seeing his brother Benjamin, he suspected that they had made away with him, and he gave them occasion to speak of their father and brother. God, in his providence, sometimes seems harsh with those he loves, and speaks roughly to those for whom yet he has great mercy in store. Joseph settled at last, that one of them should be left, and the rest go home and fetch Benjamin. It was a very encouraging word he said to them, I fear God; as if he had said, You may be assured I will do you no wrong; I dare not, for I know there is one higher than I. With those that fear God, we may expect fair dealing.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The ten brothers meet with a rough reception from the lord of the land. \"The governor\" - the sultan. This, we see, is a title of great antiquity in Egypt or Arabia. Joseph presided over the cornmarket of the kingdom. \"Bowed down to him with their faces to the earth.\" Well might Joseph think of those never-to-be-forgotten dreams in which the sheaves and stars bowed down to him. \"And knew them.\" How could he fail to remember the ten full-grown men of his early days, when they came before him with all their peculiarities of feature, attitude, and mother tongue. \"And he made himself strange unto them.\" All that we know of Joseph's character heretofore, and throughout this whole affair, goes to prove that his object in all his seemingly harsh treatment was to get at their hearts, to test their affection toward Benjamin, and to bring them to repent of their unkindness to himself.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"They knew not him.\" Twenty years make a great change in a youth of seventeen. And besides, with his beard and head shaven, his Egyptian attire, his foreign tongue, and his exalted position, who could have recognized the stripling whom, twenty years ago, they had sold as a slave? \"Spies are ye.\" This was to put a color of justice on their detention. To see the nakedness of the land, not its unfortified frontier, which is a more recent idea, but its present impoverishment from the famine. \"Sons of one man are we.\" It was not likely that ten sons of one man would be sent on the hazardous duty of spies. \"And behold the youngest is with our father this day.\" It is intensely interesting to Joseph to hear that his father and full brother are still living. \"And one is not.\" Time has assuaged all their bitter feelings, both of exasperation against Joseph and of remorse for their unbrotherly conduct. This little sentence, however, cannot be uttered by them, or heard by Joseph, without emotion. \"By the life of Pharaoh.\" Joseph speaks in character, and uses an Egyptian asseveration. \"Send one of you.\" This proposal is enough to strike terror into their hearts. The return of one would be a heavy, perhaps a fatal blow to their father. And how can one brave the perils of the way? They cannot bring themselves to concur in this plan. Sooner will they all go to prison, as accordingly they do. Joseph is not without a strong conviction of incumbent duty in all this. He knows he has been put in the position of lord over his brethren in the foreordination of God, and he feels bound to make this authority a reality for their moral good.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"They knew not him.\" Twenty years make a great change in a youth of seventeen. And besides, with his beard and head shaven, his Egyptian attire, his foreign tongue, and his exalted position, who could have recognized the stripling whom, twenty years ago, they had sold as a slave? \"Spies are ye.\" This was to put a color of justice on their detention. To see the nakedness of the land, not its unfortified frontier, which is a more recent idea, but its present impoverishment from the famine. \"Sons of one man are we.\" It was not likely that ten sons of one man would be sent on the hazardous duty of spies. \"And behold the youngest is with our father this day.\" It is intensely interesting to Joseph to hear that his father and full brother are still living. \"And one is not.\" Time has assuaged all their bitter feelings, both of exasperation against Joseph and of remorse for their unbrotherly conduct. This little sentence, however, cannot be uttered by them, or heard by Joseph, without emotion. \"By the life of Pharaoh.\" Joseph speaks in character, and uses an Egyptian asseveration. \"Send one of you.\" This proposal is enough to strike terror into their hearts. The return of one would be a heavy, perhaps a fatal blow to their father. And how can one brave the perils of the way? They cannot bring themselves to concur in this plan. Sooner will they all go to prison, as accordingly they do. Joseph is not without a strong conviction of incumbent duty in all this. He knows he has been put in the position of lord over his brethren in the foreordination of God, and he feels bound to make this authority a reality for their moral good.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "7, 8. Joseph saw his brethren, and he knew them, … but they knew not him—This is not strange. They were full-grown men—he was but a lad at parting. They were in their usual garb—he was in his official robes. They never dreamt of him as governor of Egypt, while he had been expecting them. They had but one face; he had ten persons to judge by.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "made himself strange unto them, and spake roughly—It would be an injustice to Joseph's character to suppose that this stern manner was prompted by any vindictive feelings—he never indulged any resentment against others who had injured him. But he spoke in the authoritative tone of the governor in order to elicit some much-longed-for information respecting the state of his father's family, as well as to bring his brethren, by their own humiliation and distress, to a sense of the evils they had done to him.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Because his visage was much altered by his beard, and by other things, it being about twenty years since they saw him; and his Egyptian language, and habit, and carriage, together with the great dignity of his place, prevented all suspicions concerninging their brother. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Joseph knew his brethren, but they knew not him. It being about twenty two years since they saw him, and then he was young, and his beard not grown, as now it was; and besides, he was clothed as a prince, and spoke the Egyptian language; and being in such great grandeur and splendour, and in such power and authority, and having such a retinue attending him, they never once thought of him, whom they supposed might be dead, having never heard of him all this time; or, however, it could not come into their minds, that he whom they sold for a slave could ever be governor of the land of Egypt. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Joseph knew his brethren, but they knew not him.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 8.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And Joseph knew his brethren, but they knew not him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The lapse of time since the tragedy of Dothan, twenty years before, the high position occupied by Joseph, the Egyptian manners he had by this time assumed, and the strange tongue m which he conversed with them, all conspired to prevent Jacob's sons from recognizing their younger brother; while the facts that Joseph's brethren were all grown men when he had last looked upon them, that he was quite familiar with their appearances, and that he perfectly understood their speech, would account for his almost instantaneous detection of them. Genesis 42:8",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Joseph recognised his brothers at once; but they could not recognise a brother who had not been seen for 20 years, and who, moreover, had not only become thoroughly Egyptianized, but had risen to be a great lord. And he acted as a foreigner (יתנכּר) towards them, speaking harshly, and asking them whence they had come. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 42:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", according to a truly Semitic style of narrative, we have a condensation of what is more circumstantially related in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 42:8-17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      }
    ]
  }
]