[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(23) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "But all other flying creeping things.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Better, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "but all other winged creeping things. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Besides the above-named four species and their kindreds, all other locusts, as well as insects of any kind, are to be abhorred as food.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Leviticus 11:23-25",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 11:23-25",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "All other — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That is, which have not those legs above and beside their feet, mentioned ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 11:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For these ye shall be unclean — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "If they did either eat, or so much as touch the carcasses of them, they were not, for that day, to come into the tabernacle, to eat of any holy thing, or to converse freely with their neighbours. And as a sign of this legal uncleanness, (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 11:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) they were to bathe in water, which was the usual rite of purification in such cases. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Until the even — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "They were to keep apart by themselves all that day: for their day began in the evening. “The uncleanness continued only till the evening,” says Henry, “to signify that all ceremonial pollutions were to come to an end by the death of Christ in the evening of this world.” And we must learn by daily renewing our repentance every night for the failings of the day, and by a fresh application to the blood of sprinkling, to cleanse ourselves from the pollutions which we contract by them, that we may not lie down in our uncleanness.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11:1-47 What animals were clean and unclean. - These laws seem to have been intended, 1. As a test of the people's obedience, as Adam was forbidden to eat of the tree of knowledge; and to teach them self-denial, and the government of their appetites. 2. To keep the Israelites distinct from other nations. Many also of these forbidden animals were objects of superstition and idolatry to the heathen. 3. The people were taught to make distinctions between the holy and unholy in their companions and intimate connexions. 4. The law forbad, not only the eating of the unclean beasts, but the touching of them. Those who would be kept from any sin, must be careful to avoid all temptations to it, or coming near it. The exceptions are very minute, and all were designed to call forth constant care and exactness in their obedience; and to teach us to obey. Whilst we enjoy our Christian liberty, and are free from such burdensome observances, we must be careful not to abuse our liberty. For the Lord hath redeemed and called his people, that they may be holy, even as he is holy. We must come out, and be separate from the world; we must leave the company of the ungodly, and all needless connexions with those who are dead in sin; we must be zealous of good works devoted followers of God, and companions of his people.",
        "children": []
      },
      {
        "element": "br",
        "class": "",
        "text": "",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "]",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In the uncertainty of identifying these four creatures, it has been suggested that some of the names may belong to locusts in an imperfect state of development. Most modern versions have taken a safer course than our translators, by retaining the Hebrew names. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "21, 22. Yet these may ye eat of every flying creeping thing that goeth upon all four, which have legs above their feet—Nothing short of a scientific description could convey more accurately the nature \"of the locust after its kind.\" They were allowed as lawful food to the Israelites, and they are eaten by the Arabs, who fry them in olive oil. When sprinkled with salt, dried, smoked, and fried, they are said to taste not unlike red herrings.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " i.e. All such except those now mentioned; the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "other",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " being here understood out of the former verse, without which there might seem to be a contradiction between this and that verse. But the words may be, and by the vulgar Latin are, thus rendered, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "But all flying creeping things which have only four feet",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; which word ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "only",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is to be gathered out of ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Leviticus 11:20,21",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 11:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",21",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; i.e. which have not those legs above and besides their feet mentioned ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Leviticus 11:21",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 11:21",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". And so all the verses agree well together. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But all other flying creeping things,.... Excepting the four sorts before mentioned, wherefore we rightly supply the word \"other\": ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "which have four feet; or more; the Vulgate Latin version adds, \"only\", but wrongly; for those that have more are unclean, and forbidden to be eaten, excepting those in the preceding verse; and most creeping things that fly have six feet, as the locusts themselves, reckoning their leaping legs into the number; though it may be observed, that those creatures that have six feet have but four equal ones, on which they walk or creep; and the two foremost, which are longer, are as hands to them to wipe their eyes with, and protect them from anything that may fall into them and hurt them; they not being able to see clearly because of the hardness of their eyes, as Aristotle (a) observes, and particularly it may be remarked of the fly, as it is by Lucian (b), that though it has six feet it only goes on four, using the other two foremost as hands; and therefore you may see it walking on four feet, with something eatable in its hands, lifting them up on high, just after the manner of men: now all such creatures that have four feet or more, excepting the above: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "shall be an abomination unto you; abhorred as food, and abstained from. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) Ut supra. (Hist. Animal. l. 9. c. 6.) (b) De Musca. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(a) Ut supra. (Hist. Animal. l. 9. c. 6.) (b) De Musca. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "But all other flying creeping things, which have four feet, shall be an abomination unto you.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 14:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). To the birds there are appended flying animals of other kinds: \"all swarms of fowl that go upon fours,\" i.e., the smaller winged animals with four feet, which are called sherez, \"swarms,\" on account of their multitude. These were not to be eaten, as they were all abominations, with the exception of those \"which have two shank-feet above their feet (i.e., springing feet) to leap with\" (לא for לו as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 21:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Locusts are the animals referred to, four varieties being mentioned with their different species (\"after his kind\"); but these cannot be identified with exactness, as there is still a dearth of information as to the natural history of the oriental locust. It is well known that locusts were eaten by many of the nations of antiquity both in Asia and Africa, and even the ancient Greeks thought the Cicades very agreeable in flavour (Arist. h. an. 5, 30). In Arabia they are sold in the market, sometimes strung upon cords, sometimes by measure; and they are also dried, and kept in bags for winter use. For the most part, however, it is only by the poorer classes that they are eaten, and many of the tribes of Arabia abhor them (Robinson, ii. p. 628); and those who use them as food do not eat all the species indiscriminately. They are generally cooked over hot coals, or on a plate, or in an oven, or stewed in butter, and eaten either with salt or with spice and vinegar, the head, wings, and feet being thrown away. They are also boiled in salt and water, and eaten with salt or butter. Another process is to dry them thoroughly, and then grind them into meal and make cakes of them. The Israelites were allowed to eat the arbeh, i.e., according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 10:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 10:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nahum 3:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc., the flying migratory locust, gryllus migratorius, which still bears this name, according to Niebuhr, in Maskat and Bagdad, and is poetically designated in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 78:46",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 105:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as חסיל, the devourer, and ילק, the eater-up; but Knobel is mistaken in supposing that these names are applied to certain species of the arbeh. סלעם, according to the Chaldee, deglutivit, absorpsit, is unquestionably a larger and peculiarly voracious species of locust. This is all that can be inferred from the rashon of the Targums and Talmud, whilst the ἀττάκης and attacus of the lxx and Vulg. are altogether unexplained. חרגּל: according to the Arabic, a galloping, i.e., a hopping, not a flying species of locust. This is supported by the Samaritan, also by the lxx and Vulg., ὀφιομάχης, ophiomachus. According to Hesychius and Suidas, it was a species of locust without wings, probably a very large kind; as it is stated in Mishnah, Shabb. vi. 10, that an egg of the chargol was sometimes suspended in the ear, as a remedy for earache. Among the different species of locusts in Mesopotamia, Niebuhr (Arab. p. 170) saw two of a very large size with springing feet, but without wings. חגב, a word of uncertain etymology, occurs in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 13:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where the spies are described as being like chagabim by the side of the inhabitants of the country, and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 7:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where the chagab devours the land. From these passages we may infer that it was a species of locust without wings, small but very numerous, probably the ἀττέλαβος, which is often mentioned along with the ἀκρίς, but as a distinct species, locustarum minima sine pennis (Plin. h. n. 29, c. 4, s. 29), or parva locusta modicis pennis reptans potius quam volitans semperque subsiliens (Jerome (on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nahum 3:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: In Deuteronomy 14:19 the edible kinds of locusts are passed over, because it was not the intention of Moses to repeat every particular of the earlier laws in these addresses. But when Knobel (on Lev. pp. 455 and 461) gives this explanation of the omission, that the eating of locusts is prohibited in Deuteronomy, and the Deuteronomist passes them over because in his more advanced age there was apparently no longer any necessity for the prohibition, this arbitrary interpretation is proved to be at variance with historical truth by the fact that locusts were eaten by John the Baptist, inasmuch as this proves at all events that a more advanced age had not given up the custom of eating locusts.) ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 14:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the edible kinds of locusts are passed over, because it was not the intention of Moses to repeat every particular of the earlier laws in these addresses. But when Knobel (on Lev. pp. 455 and 461) gives this explanation of the omission, that the eating of locusts is prohibited in Deuteronomy, and the Deuteronomist passes them over because in his more advanced age there was apparently no longer any necessity for the prohibition, this arbitrary interpretation is proved to be at variance with historical truth by the fact that locusts were eaten by John the Baptist, inasmuch as this proves at all events that a more advanced age had not given up the custom of eating locusts.) ",
            "children": []
          }
        ]
      }
    ]
  }
]