[{"num":27,"verse":"And make the altar of acacia wood, five cubits square and three cubits high [within reach of all]."},{"num":2,"verse":"Make horns for it on its four corners; they shall be of one piece with it, and you shall overlay it with bronze."},{"num":3,"verse":"You shall make pots to take away its ashes, and shovels, basins, forks, and firepans; make all its utensils of bronze."},{"num":4,"verse":"Also make for it a grate, a network of bronze; and on the net you shall make four bronze rings at its four corners."},{"num":5,"verse":"And you shall put it under the ledge of the altar, so that the net will extend halfway down the altar."},{"num":6,"verse":"And make poles for the altar, poles of acacia wood overlaid with bronze."},{"num":7,"verse":"The poles shall be put through the rings on the two sides of the altar, with which to carry it."},{"num":8,"verse":"You shall make [the altar] hollow with slabs or planks; as shown you on the mountain, so shall it be made."},{"num":9,"verse":"And you shall make the court of the tabernacle. On the south side the court shall have hangings of fine twined linen, a hundred cubits long for one side;"},{"num":10,"verse":"Their pillars shall be twenty and their sockets twenty, of bronze, but the hooks of the pillars and their joinings shall be of silver;"},{"num":11,"verse":"Likewise for the north side hangings, a hundred cubits long, and their twenty pillars and their twenty sockets of bronze, but the hooks of the pillars and their joinings shall be of silver."},{"num":12,"verse":"And for the breadth of the court on the west side there shall be hangings of fifty cubits, with ten pillars and ten sockets."},{"num":13,"verse":"The breadth of the court to the front, the east side, shall be fifty cubits."},{"num":14,"verse":"The hangings for one side of the gate shall be fifteen cubits, with three pillars and three sockets."},{"num":15,"verse":"On the other side the hangings shall be fifteen cubits, with three pillars and three sockets."},{"num":16,"verse":"And for the gate of the court there shall be a hanging [for a screen] twenty cubits long, of blue, purple, and scarlet [stuff] and fine twined linen, embroidered. It shall have four pillars and four sockets for them."},{"num":17,"verse":"All the pillars round about the court shall be joined together with silver rods; their hooks shall be of silver and their sockets of bronze."},{"num":18,"verse":"The length of the court shall be a hundred cubits and the breadth fifty and the height five cubits, [with hangings of] fine twined linen and sockets of bronze."},{"num":19,"verse":"All the tabernacle’s utensils and instruments used in all its service, and all its pegs and all the pegs for the court, shall be of bronze."},{"num":20,"verse":"You shall command the Israelites to provide you with pure oil of crushed olives for the light, to cause it to burn continually [every night]."},{"num":21,"verse":"In the Tent of Meeting [of God with His people], outside the veil which sets apart the Testimony, Aaron and his sons shall keep it burning from evening to morning before the Lord. It shall be a statute to be observed on behalf of the Israelites throughout their generations."}]