[{"header":"The Altar of Burnt Offering(A)"},{"num":27,"verse":"You shall make an altar of acacia wood, five cubits long and five cubits wide. The altar shall be square, and its height shall be three cubits. "},{"num":2,"verse":"You shall make its horns on its four corners. Its horns shall be part of it, and you shall overlay it with bronze. "},{"num":3,"verse":"You shall make its pots for its ashes, and its shovels, and its basins, and its meat hooks, and its fire pans. You shall make all of its vessels out of bronze. "},{"num":4,"verse":"You shall make a grating for it, a network of bronze, and on the net you shall make four bronze rings at its four corners. "},{"num":5,"verse":"You shall put it under the ledge of the altar beneath, so that the net will reach halfway up the altar. "},{"num":6,"verse":"You shall make poles for the altar, poles of acacia wood, and overlay them with bronze. "},{"num":7,"verse":"The poles shall be put into the rings, so that the poles shall be on the two sides of the altar when carrying it. "},{"num":8,"verse":"You shall make it hollow with boards. Just as it was shown you on the mountain, so shall they make it."},{"header":"The Court of the Tabernacle(B)"},{"num":9,"verse":"You shall make the court of the tabernacle. On the south side there shall be curtains for the court of fine twined linen one hundred cubits long for one side; "},{"num":10,"verse":"and it shall have twenty pillars with twenty bronze sockets. The hooks of the pillars and their bands shall be of silver. "},{"num":11,"verse":"Likewise for the north side in length there shall be curtains one hundred cubits long, and its twenty pillars and their twenty sockets of bronze. The hooks of the pillars and their bands shall be of silver."},{"num":12,"verse":"For the width of the court on the west side shall be curtains of fifty cubits with their ten pillars and their ten sockets. "},{"num":13,"verse":"The width of the court on the east side shall be fifty cubits. "},{"num":14,"verse":"The curtains on one side of the gate shall be fifteen cubits with their three pillars and their three sockets. "},{"num":15,"verse":"On the other side shall be curtains fifteen cubits with their three pillars and their three sockets."},{"num":16,"verse":"For the gate of the court there shall be a curtain of twenty cubits, of blue, and purple, and scarlet, and fine twined linen, the work of an embroiderer, with their four pillars and their four sockets. "},{"num":17,"verse":"All the pillars around about the court shall be furnished with silver bands. Their hooks shall be of silver, and their sockets of bronze. "},{"num":18,"verse":"The length of the court shall be one hundred cubits, and the width fifty throughout, and the height five cubits of fine twisted linen, and their sockets of bronze. "},{"num":19,"verse":"All the utensils of the tabernacle used in all its service, and all its tent pegs, and all the tent pegs of the court shall be of bronze."},{"header":"The Oil for the Lamp(C)"},{"num":20,"verse":"You shall command the children of Israel that they bring you pure oil of olive pressed for the light, to cause the lamp to burn continually. "},{"num":21,"verse":"In the tent of meeting, outside the veil which is before the testimony, Aaron and his sons shall arrange it from evening to morning before the Lord. It shall be a perpetual statute for the children of Israel for generations to come."}]