[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "30:18-24 We have here further intimations of the favour of God for them after the days of their calamity have expired. The proper work and office of Christ, as Mediator, is to draw near unto God, for us, as the High Priest of our profession. His own undertaking, in compliance with his Father's will, and in compassion to fallen man, engaged him. Jesus Christ was, in all this, truly wonderful. They shall be taken again into covenant with the Lord, according to the covenant made with their fathers. I will be your God: it is his good-will to us, which is the summary of that part of the covenant. The wrath of God against the wicked is very terrible, like a whirlwind. The purposes of his wrath, as well as the purposes of his love, will all be fulfilled. God will comfort all that turn to him; but those who approach him must have their hearts engaged to do it with reverence, devotion, and faith. How will they escape who neglect so great salvation?",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Them - i. e., the city and palace. Render the last words, become few become mean, i. e., despised, lightly esteemed.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "20. as aforetime—as flourishing as in the time of David.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Their posterity also shall be as happy, and in as much repute, as they were before this carrying into Babylon. Their church, or the body of the people of the Jews, shall from generation to generation be established. And though in those times there will be some that will oppress them, yet they shall not escape my vengeance that do it, for I will protect and defend them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Their children also shall be as aforetime,.... In the streets of Jerusalem, numerous and free; no more in a strange land, or subject to others, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 8:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and educated in a religious manner. Some think it refers to the times of the patriarchs before the law was given; and that the meaning is, that the law being abrogated, and they now sensible of it, shall live without it, as their forefathers did. It may be understood of the church's children in a spiritual sense; that great numbers should be born again in her as formerly, who shall profess the Christian religion, and behave according to it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and their congregation shall be established before me; the church, consisting of them; or their church state shall be settled and confirmed, and no more be destroyed, as it formerly was: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and I will punish all that oppress them; or rather, have oppressed them; all the antichristian nations, who will now suffer the wrath of God; and after this there will be no more oppressors and persecutors of the church of God. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and I will punish all that oppress them; or rather, have oppressed them; all the antichristian nations, who will now suffer the wrath of God; and after this there will be no more oppressors and persecutors of the church of God. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Their children also shall be as aforetime, and their congregation shall be established before me, and I will punish all that oppress them.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "as aforetime",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] as in the times of David and Solomon, the golden age of the Jewish kingdom.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "congregation",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] the people collectively, but considered from the ecclesiastical point of view, and thus an expression suggestive of a post-exilic date.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "before me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] under my care. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 17:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 102:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 6:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 20.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Their children;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "his children",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the \"children of Israel.\" Jeremiah 30:20",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Further explanation of the deliverance promised to Zion. - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 30:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"Thus saith Jahveh: Behold, I will turn the captivity of the tents of Jacob, and will take pity on his dwellings; and the city shall be built again upon its own hill, and the palace shall be inhabited after its own fashion. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 30:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And there shall come forth from them praise and the voice of those who laugh; and I will multiply them, so that they shall not be few, and I will honour them, so that they shall not be mean. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 30:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And his sons shall be as in former times, and his congregation shall be established before me, and I will punish all that oppress him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 30:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And his leader shall spring from himself, and his ruler shall proceed from his midst; and I will bring him near, so that he shall approach to me; for who is he that became surety for his life in drawing near to me? saith Jahveh. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 30:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And ye shall become my people, and I will be your God.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The dwellings of Israel that have been laid waste, and the cities that have been destroyed, shall be restored and inhabited as formerly, so that songs of praise and tones of joy shall resound from them (Jeremiah 30:18.). \"The captivity of the tents of Jacob\" means the miserable condition of the dwellings of Jacob, i.e., of all Israel; for \"to turn the captivity\" has everywhere a figurative sense, and signifies the turning of adversity and misery into prosperity and comfort; see on Jeremiah 29:14. Hitzig is quite wrong in his rendering: \"I bring back the captives of the tents of Jacob, i.e., those who have been carried away out of the tents.\" That \"tents\" does not stand for those who dwell in tents, but is a poetic expression for \"habitations,\" is perfectly clear from the parallel \"his dwellings.\" To \"take pity on the dwellings\" means to \"restore the dwellings that have been destroyed\" (cf. Jeremiah 9:18). The anarthrous עיר must not be restricted to the capital, but means every city that has been destroyed; here, the capital naturally claims the first consideration. \"Upon its hills\" is equivalent to saying on its former site, cf. Joshua 11:13; it does not mean \"on the mound made by its ruins,\" in support of which Ngelsbach erroneously adduces Deuteronomy 13:17. ארמון in like manner stands, in the most general way, for every palace. על־משׁפּטו does not mean \"on the proper place,\" i.e., on an open, elevated spot on the hill (Hitzig), neither does it mean \"on its right position\" (Ewald); both of these renderings are against the usage of the words: but it signifies \"according to its right\" (cf. Deuteronomy 17:11), i.e., in accordance with what a palace requires, after its own fashion. ישׁב, to be inhabited, as in Jeremiah 17:6, etc. \"Out of them\" refers to the cities and palaces. Thence proceeds, resounds praise or thanksgiving for the divine grace shown them (cf. Jeremiah 33:11), and the voice, i.e., the tones or sounds, of those who laugh (cf. Jeremiah 15:17), i.e., of the people living in the cities and palaces, rejoicing over their good fortune. \"I will increase them, so that they shall not become fewer,\" cf. Jeremiah 29:6; \"I will bring them to honour (cf. Isaiah 8:22), so that they shall not be lightly esteemed.\" - In Jeremiah 30:20. the singular suffixes refer to Jacob as a nation (Jeremiah 30:18). \"His sons\" are the members of the nation; they become as they were previously, in former times - sicut olim sub Davide et Salmonoe, florentissimo rerum statu. \"The congregation will be established before me,\" i.e., under my survey (תּכּון as in Psalm 102:29), i.e., they shall no more be shaken or moved from their position.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The dwellings of Israel that have been laid waste, and the cities that have been destroyed, shall be restored and inhabited as formerly, so that songs of praise and tones of joy shall resound from them (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 30:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".). \"The captivity of the tents of Jacob\" means the miserable condition of the dwellings of Jacob, i.e., of all Israel; for \"to turn the captivity\" has everywhere a figurative sense, and signifies the turning of adversity and misery into prosperity and comfort; see on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 29:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Hitzig is quite wrong in his rendering: \"I bring back the captives of the tents of Jacob, i.e., those who have been carried away out of the tents.\" That \"tents\" does not stand for those who dwell in tents, but is a poetic expression for \"habitations,\" is perfectly clear from the parallel \"his dwellings.\" To \"take pity on the dwellings\" means to \"restore the dwellings that have been destroyed\" (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 9:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The anarthrous עיר must not be restricted to the capital, but means every city that has been destroyed; here, the capital naturally claims the first consideration. \"Upon its hills\" is equivalent to saying on its former site, cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 11:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; it does not mean \"on the mound made by its ruins,\" in support of which Ngelsbach erroneously adduces ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 13:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ארמון in like manner stands, in the most general way, for every palace. על־משׁפּטו does not mean \"on the proper place,\" i.e., on an open, elevated spot on the hill (Hitzig), neither does it mean \"on its right position\" (Ewald); both of these renderings are against the usage of the words: but it signifies \"according to its right\" (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 17:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), i.e., in accordance with what a palace requires, after its own fashion. ישׁב, to be inhabited, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 17:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", etc. \"Out of them\" refers to the cities and palaces. Thence proceeds, resounds praise or thanksgiving for the divine grace shown them (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 33:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and the voice, i.e., the tones or sounds, of those who laugh (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 15:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), i.e., of the people living in the cities and palaces, rejoicing over their good fortune. \"I will increase them, so that they shall not become fewer,\" cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 29:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; \"I will bring them to honour (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 8:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), so that they shall not be lightly esteemed.\" - In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 30:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". the singular suffixes refer to Jacob as a nation (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 30:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). \"His sons\" are the members of the nation; they become as they were previously, in former times - sicut olim sub Davide et Salmonoe, florentissimo rerum statu. \"The congregation will be established before me,\" i.e., under my survey (תּכּון as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 102:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), i.e., they shall no more be shaken or moved from their position.",
            "children": []
          }
        ]
      }
    ]
  }
]