[{"num":29,"verse":"And these be the words of the book, which Jeremy, the prophet, sent from Jerusalem to the residues of [the] elder men of [the] passing over (And these be the words of the letter, which the prophet Jeremiah sent from Jerusalem, to the remaining elders among those carried away captive), and to the priests, and to the prophets, and to all the people, whom Nebuchadnezzar had led over from Jerusalem into Babylon,"},{"num":2,"verse":"after that Jeconiah, the king, went out, and the lady, and the honest servants and chaste, and the princes of Judah went out of Jerusalem, and a subtle craftsman, and a goldsmith of Jerusalem, (after that King Jeconiah, and the queen mother, and the honest and chaste servants, or the eunuchs, and the princes, or the leaders, of Judah and of Jerusalem, and the craftsmen, and the goldsmiths, had left Jerusalem,)"},{"num":3,"verse":"in the hand of Elasah, (the) son of Shaphan, and of Gemariah, the son of Hilkiah, which Zedekiah, king of Judah, sent to Nebuchadnezzar, the king of Babylon, into Babylon. And Jeremy said, (by the hand of Elasah, the son of Shaphan, and of Gemariah, the son of Hilkiah, whom Zedekiah, the king of Judah, sent to Nebuchadnezzar, the king of Babylon, in Babylon. And Jeremiah said,)"},{"num":4,"verse":"The Lord of hosts, God of Israel, saith these things to all the passing over, which I translated from Jerusalem into Babylon, (The Lord of hosts, the God of Israel, saith these things to all those, whom I carried away captive from Jerusalem to Babylon,)"},{"num":5,"verse":"Build ye houses, and inhabit (them), and plant ye orchards, and eat ye [the] fruit of them;"},{"num":6,"verse":"take ye wives, and engender ye sons and daughters, and give ye wives to your sons, and give ye your daughters to husbands, and bear they sons and daughters; and be ye multiplied there, and do not ye be few in number."},{"num":7,"verse":"And seek ye [the] peace of the cities, to which I made you to pass over; and pray ye the Lord for it, for in the peace thereof shall be peace to you. (And seek ye the peace of any city, to which I made you to be carried away captive; yea, pray ye to the Lord for it, for in its peace shall be peace for you.)"},{"num":8,"verse":"The Lord of hosts, God of Israel, saith these things, Your prophets, that be in the midst of you, and your diviners, deceive you not (Let not your prophets, and your diviners, who be in the midst of you, deceive you); and take ye none heed to your dreams, which ye dream;"},{"num":9,"verse":"for they prophesy falsely to you in my name, and I sent not them, saith the Lord. (for they prophesy falsely to you in my name, and I did not send them, saith the Lord.)"},{"num":10,"verse":"For the Lord saith these things, When seventy years begin to be [ful]filled in Babylon, I shall visit you, and I shall raise on you my good word, and I shall bring you again to this place."},{"num":11,"verse":"For I know the thoughts which I think on you, saith the Lord, the thoughts of peace, and not of torment, that I give to you an end and patience. (For I know the thoughts which I think about you, saith the Lord, the thoughts of peace, and not of torment, so that I shall give you a good ending.)"},{"num":12,"verse":"And ye shall call me to help (And ye shall call on me for help), and ye shall go, and shall worship me, and I shall hear you;"},{"num":13,"verse":"ye shall seek me, and ye shall find, when ye seek me in all your heart. (ye shall seek me, and ye shall find me, when ye seek me with all your heart.)"},{"num":14,"verse":"And I shall be found of you, saith the Lord, and I shall bring (you back) again (from) your captivity, and I shall gather you from all folks, and from all places, to which I casted out you, saith the Lord; and I shall make you to turn again from the place, to which I made you to pass over. (And I shall be found by you, saith the Lord, and I shall restore your fortunes, and I shall gather you from all the nations, and from all the places, to which I cast you out, saith the Lord; and I shall bring you back from the place, to which I made you to be carried away captive.)"},{"num":15,"verse":"For ye said, The Lord shall raise (up) prophets to us in Babylon. (For ye said, The Lord hath raised up prophets for us in Babylon.)"},{"num":16,"verse":"For the Lord saith these things to the king, that sitteth on the seat of David, and to all the people, dweller(s) of this city, (and) to your brethren, that went not out with you into the passing over, (For the Lord saith these things to the king, who sitteth on David’s throne, and to all the people, the inhabitants of this city, and to your kinsmen, who did not go out with you into captivity,)"},{"num":17,"verse":"The Lord of hosts saith these things, Lo! I shall send among them sword, and hunger, and pestilence; and I shall set them as evil figs, that may not be eaten, for those be full evil (for they be too rotten to eat)."},{"num":18,"verse":"And I shall pursue them in sword, and in hunger, and in pestilence; and I shall give them into travailing in all realms of earth, into cursing, and into wondering, and into scorning, and into shame to all folks, to which I casted them out. (And I shall pursue them with the sword, and with hunger, and with pestilence; and I shall give them into despising in all the kingdoms of the earth, and into cursing, and into wondering, and into mocking, and into shame to all the nations, to which I cast them out.)"},{"num":19,"verse":"For they heard not my words, saith the Lord, which I sent to them by my servants, (the) prophets, and rose (up) by night, and sent, and ye heard not, saith the Lord (but ye did not listen, or obey, saith the Lord)."},{"num":20,"verse":"Therefore all the passing over, which I sent out from Jerusalem into Babylon, hear ye the word of the Lord. (And so all the captives, whom I sent out from Jerusalem to Babylon, hear ye the word of the Lord.)"},{"num":21,"verse":"The Lord of hosts, God of Israel, saith these things to Ahab, the son of Kolaiah, and to Zedekiah, the son of Maaseiah, that prophesy to you leasing in my name, Lo! I shall betake them into the hand of Nebuchadnezzar, king of Babylon, and he shall smite them before your eyes. (The Lord of hosts, the God of Israel, saith these things about Ahab, the son of Kolaiah, and about Zedekiah, the son of Maaseiah, who prophesy lies to you in my name, Lo! I shall deliver them into the hands of Nebuchadnezzar, the king of Babylon, and he shall strike them down before your eyes.)"},{"num":22,"verse":"And cursing shall be taken of them to all the passing over of Judah, which is in Babylon, of men saying, The Lord set thee as Zedekiah, and as Ahab, which the king of Babylon fried in fire, (And their names shall be used as curses by all the captives from Judah who be in Babylon, yea, by people saying, The Lord make thee like Zedekiah, and like Ahab, whom the king of Babylon fried in the fire,)"},{"num":23,"verse":"for they did folly in Israel, and did adultery on the wives of their friends (for they did foolishness in Israel, and did adultery with the wives of their friends); and they spake a word falsely in my name, which I commanded not to them; I am judge and witness, saith the Lord."},{"num":24,"verse":"And thou shalt say to Shemaiah (the) Nehelamite,"},{"num":25,"verse":"The Lord of hosts, God of Israel, saith these things, For that that thou sentest books in my name to all the people, which is in Jerusalem (who be in Jerusalem), and to Zephaniah, the son of Maaseiah, the priest, and to all the priests, and saidest,"},{"num":26,"verse":"The Lord gave thee priest for Jehoiada, the priest, that thou be duke in the house of the Lord on each man that is travailed of the fiend, and prophesying, that thou send him into stocks, and into prison. (The Lord made thee to be priest in place of the priest Jehoiada, so that thou be the leader, or the chief official, in the House of the Lord, over each person who is troubled by a fiend, and prophesying falsely, and that thou send such people into the stocks, and into prison.)"},{"num":27,"verse":"And now why blamest thou not Jeremy of Anathoth, that prophesieth to you? (And so now why hast thou not rebuked Jeremiah of Anathoth, who prophesieth to you?)"},{"num":28,"verse":"For on this thing he sent to us into Babylon, and said, It is long; build ye houses, and inhabit, and plant ye orchards, and eat ye the fruit of them. (For about this thing he sent to us in Babylon, and said, Ye shall be there a long time; so build ye houses, and inhabit them, and plant ye orchards, and eat ye their fruit.)"},{"num":29,"verse":"Therefore Zephaniah, the priest, read this book in the ears of Jeremy, the prophet. (And so Zephaniah, the priest, read this letter to the prophet Jeremiah.)"},{"num":30,"verse":"And the word of the Lord was made to Jeremy, and said,"},{"num":31,"verse":"Send thou to all the passing over, and say, The Lord saith these things to Shemaiah (the) Nehelamite, For that that Shemaiah prophesied to you, and I sent not him, and he made you to trust in a leasing; (Send thou to all the captives, and say, The Lord saith these things to Shemaiah the Nehelamite, Because of what Shemaiah prophesied to you, and I did not send him, and he made you to trust in a lie;)"},{"num":32,"verse":"therefore the Lord saith these things, Lo! I shall visit on Shemaiah (the) Nehelamite, and on his seed; and no man sitting in the midst of this people shall be to him; and he shall not see the good, which I shall do to my people, saith the Lord, for he spake trespassing against the Lord. (and so the Lord saith these things, Lo! I shall punish Shemaiah the Nehelamite, and his children; and none of his descendants shall sit in the midst of this people; and he shall not see the good which I shall do for my people, saith the Lord, for he spoke trespassing against the Lord.)"}]