[{"header":"A King-Priest like Melchizedek"},{"num":5,"verse":"For every High Priest was chosen from among the people and appointed to represent them before God by presenting their gifts to God and offering sacrifices on their behalf. "},{"num":2,"verse":"Since the High Priest is also one who is clothed in weakness, he humbles himself by showing compassion to those who are ignorant of God’s ways and stray from them. "},{"num":3,"verse":"And for this reason, he has to not only present the sin offerings of others, but also to bring a sin offering for himself. "},{"num":4,"verse":"And no one takes this honor upon himself by being self-appointed, but God is the one who calls each one, just as Aaron was called."},{"num":5,"verse":"So also, Christ was not self-appointed and did not glorify himself by becoming a high priest, but God called and glorified him! For the Father said to him,"},{"num":6,"verse":"And in another Scripture he says about this new priestly order,"},{"num":7,"verse":"During Christ’s days on earth he pleaded with God, praying with passion and with tearful agony that God would spare him from death. And because of his perfect devotion his prayer was answered and he was delivered. "},{"num":8,"verse":"But even though he was a wonderful Son, he learned to listen and obey through all his sufferings. "},{"num":9,"verse":"And after being proven perfect in this way he has now become the source of eternal salvation to all those who listen to him and obey. "},{"num":10,"verse":"For God has designated him as the King-Priest who is over the priestly order of Melchizedek."},{"header":"Moving On into Full Maturity"},{"num":11,"verse":"We have much to say about this topic although it is difficult to explain, because you have become too dull and sluggish to understand. "},{"num":12,"verse":"For you should already be professors instructing others by now; but instead, you need to be taught from the beginning the basics of God’s prophetic oracles! You’re like children still needing milk and not yet ready to digest solid food. "},{"num":13,"verse":"For every spiritual infant who lives on milk is not yet pierced by the revelation of righteousness. "},{"num":14,"verse":"But solid food is for the mature, whose spiritual senses perceive heavenly matters. And they have been adequately trained by what they’ve experienced to emerge with understanding of the difference between what is truly excellent and what is evil and harmful."}]