[{"header":"Josiah Son of Amon, King of Judah"},{"num":22,"verse":"Josiah was eight years old when he became king, and he ruled for thirty-one years in Jerusalem. His mother’s name was Jedidah daughter of Adaiah from Bozkath. "},{"num":2,"verse":"He did what was right in the eyes of the Lord. He walked in all the ways of his father David. He did not turn aside to the right or to the left."},{"header":"Josiah Repairs the Temple"},{"num":3,"verse":"In King Josiah’s eighteenth year, the king sent the secretary, Shaphan son of Azaliah son of Meshullam, to the House of the Lord, saying, "},{"num":4,"verse":"“Go up to Hilkiah the high priest and have him weigh out the entire amount of silver which has been brought to the House of the Lord, which the gatekeepers have received from the people. "},{"num":5,"verse":"It is to be given to those who are appointed to supervise the work on the House of the Lord. They are to give it to those who are working in the House of the Lord to repair the damage to the temple. "},{"num":6,"verse":"Give it to the craftsmen, builders, and stonemasons so they can buy wood and quarried stone to repair the damage. "},{"num":7,"verse":"But no accounting is to be demanded for the silver which is given to them, because they are acting honestly.”"},{"header":"The Book of the Law Found"},{"num":8,"verse":"Then Hilkiah the high priest said to Shaphan the secretary, “I have found the Book of the Law in the House of the Lord.” Hilkiah gave the scroll to Shaphan, and he read it. "},{"num":9,"verse":"Then Shaphan the secretary went to the king and reported: “Your servants have paid out the silver which was found in the temple, and they have given it to those who are appointed to supervise the work on the Lord’s house.”"},{"num":10,"verse":"Shaphan the secretary told the king, “Hilkiah the priest has given me a scroll.” Then Shaphan read it in the presence of the king."},{"num":11,"verse":"When the king heard the words of the Book of the Law, he tore his clothes. "},{"num":12,"verse":"Then the king commanded Hilkiah the priest, Ahikam son of Shaphan, Akbor son of Micaiah, Shaphan the secretary, and Asaiah the servant of the king: "},{"num":13,"verse":"“Go and inquire of the Lord for me and for the people and for all of Judah concerning the words of this book, which has been found. For the Lord’s wrath which is burning against us is great, because our fathers did not listen to the words of this book and do everything which was recorded for us.”"},{"num":14,"verse":"Then Hilkiah the priest, with Ahikam, Akbor, Shaphan, and Asaiah, went and spoke to Huldah the prophetess, the wife of Shallum, who was the son of Tikvah, who was the son of Harhas, the keeper of the vestments. She was living in Jerusalem in the Second District."},{"num":15,"verse":"She gave them this message:"}]