[{"header":"King Josiah of Judah(A)"},{"num":22,"verse":"Josiah was eight years old when he became king of Judah, and he ruled in Jerusalem for thirty-one years. His mother was Jedidah, the daughter of Adaiah from the town of Bozkath. "},{"num":2,"verse":"Josiah did what was pleasing to the Lord; he followed the example of his ancestor King David, strictly obeying all the laws of God."},{"header":"The Book of the Law Is Discovered(C)"},{"num":3,"verse":"In the eighteenth year of his reign, King Josiah sent the court secretary Shaphan, the son of Azaliah and grandson of Meshullam, to the Temple with the order: "},{"num":4,"verse":"“Go to the High Priest Hilkiah and get a report on the amount of money that the priests on duty at the entrance to the Temple have collected from the people. "},{"num":5,"verse":"Tell him to give the money to the men who are in charge of the repairs in the Temple. They are to pay "},{"num":6,"verse":"the carpenters, the builders, and the masons, and buy the timber and the stones used in the repairs. "},{"num":7,"verse":"The men in charge of the work are thoroughly honest, so there is no need to require them to account for the funds.”"},{"num":8,"verse":"Shaphan delivered the king's order to Hilkiah, and Hilkiah told him that he had found the book of the Law in the Temple. Hilkiah gave him the book, and Shaphan read it. "},{"num":9,"verse":"Then he went back to the king and reported: “Your servants have taken the money that was in the Temple and have handed it over to the men in charge of the repairs.” "},{"num":10,"verse":"And then he said, “I have here a book that Hilkiah gave me.” And he read it aloud to the king."},{"num":11,"verse":"When the king heard the book being read, he tore his clothes in dismay, "},{"num":12,"verse":"and gave the following order to Hilkiah the priest, to Ahikam son of Shaphan, to Achbor son of Micaiah, to Shaphan, the court secretary, and to Asaiah, the king's attendant: "},{"num":13,"verse":"“Go and consult the Lord for me and for all the people of Judah about the teachings of this book. The Lord is angry with us because our ancestors have not done what this book says must be done.”"},{"num":14,"verse":"Hilkiah, Ahikam, Achbor, Shaphan, and Asaiah went to consult a woman named Huldah, a prophet who lived in the newer part of Jerusalem. (Her husband Shallum, the son of Tikvah and grandson of Harhas, was in charge of the Temple robes.) They described to her what had happened, "},{"num":15,"verse":"and she told them to go back to the king and give him "},{"num":16,"verse":"the following message from the Lord: “I am going to punish Jerusalem and all its people, as written in the book that the king has read. "},{"num":17,"verse":"They have rejected me and have offered sacrifices to other gods, and so have stirred up my anger by all they have done. My anger is aroused against Jerusalem, and it will not die down. "},{"num":18,"verse":"As for the king himself, this is what I, the Lord God of Israel, say: You listened to what is written in the book, "},{"num":19,"verse":"and you repented and humbled yourself before me, tearing your clothes and weeping, when you heard how I threatened to punish Jerusalem and its people. I will make it a terrifying sight, a place whose name people will use as a curse. But I have heard your prayer, "},{"num":20,"verse":"and the punishment which I am going to bring on Jerusalem will not come until after your death. I will let you die in peace.”"}]