[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(23",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": ")",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "For thou shalt be in league.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for with the stones of the field shall thy covenant be, and the beasts of the field shall be made to be at peace with thee.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Job",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "THE PEACEABLE FRUITS OF SORROWS RIGHTLY BORNE",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "‘ALL THINGS ARE YOURS’Jdg 5:20",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "‘ALL THINGS ARE YOURS’",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jdg 5:20",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 5:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " These two poetical fragments present the same truth on opposite sides. The first of them comes from Deborah’s triumphant chant. The singer identifies God with the cause of Israel, and declares that heaven itself fought against those who fought against God’s people. There may be an allusion to the tempest which Jewish tradition tells us burst over the ranks of the enemy, or there may be some trace of ancient astrological notions, or the words may simply be an elevated way of saying that Heaven fought for Israel. The silent stars, as they swept on their paths through the sky, advanced like an avenging host embattled against the foes of Israel and of God. All things fight against the man who fights against God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The other text gives the other side of the same truth. One of Job’s friends is rubbing salt into his wounds by insisting on the commonplace, which needs a great many explanations and limitations before it can be accepted as true, that sin is the cause of sorrow, and that righteousness brings happiness; and in the course of trying to establish this heartless thesis to a heavy heart he breaks into a strain of the loftiest poetry in describing the blessedness of the righteous. All things, animate and inanimate, are upon his side. The ground, which Genesis tells us is ‘cursed for his sake,’ becomes his ally, and the very creatures whom man’s sin set at enmity against him are at peace with him. All things are the friends and servants of him who is the friend and servant of God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "So, putting these two texts together, we have first the great conviction to which religion clings, that God being on our side all things are for us, and not against us.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Now, that is the standing faith of the Old Testament, which no doubt was more easily held in those days, because, if we accept its teaching, we shall recognise that Israel lived under a system in so far supernatural as that moral goodness and material prosperity were a great deal more closely and indissolubly connected than they are to-day. So, many a psalmist and many a prophet breaks out into apostrophes, warranted by the whole history of Israel, and declaring how blessed are the men who, apart from all other defences and sources of prosperity, have God for their help and Him for their hope.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But we are not to dismiss this conviction as belonging only to a system where the supernatural comes in, as it does in the Old Testament history, and as antiquated under a dispensation such as that in which we live. For the New Testament is not a whit behind the Old in insisting upon this truth. ‘All things work together for good to them that love God.’ ‘All things are yours, and ye are Christ’s, and Christ is God’s.’ ‘Who is he that will harm you if ye be followers of that which is good?’ The New Testament is committed to the same conviction as that to which the faith of Old Testament saints clung as the sheet anchor of their lives.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " That conviction cannot be struck out of the creed of any man, who believes in the God to whom the Old and the New Testament alike bear witness. For it rests upon this plain principle, that all this great universe is not a chaos, but a cosmos, that all these forces and creatures are not a rabble, but an ordered host.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " What is the meaning of that great Name by which, from of old, God in His relations to the whole universe has been described-the ‘Lord of Hosts’? Who are the ‘hosts’ of which He is ‘the Lord,’ and to whom, as the centurion said, He says to this one, ‘Go!’ and he goeth; and to another, ‘Come!’ and he cometh; and to another, ‘Do this!’ and he doeth it? Who are ‘the hosts’? Not only these beings who are dimly revealed to us as rational and intelligent, who ‘excel in strength,’ because they ‘hearken to the voice of His word’, but in the ranks of that great army are also embattled all the forces of the universe, and all things living or dead. ‘All are Thy servants; they continue this day’-angels, stars, creatures of earth-’ according to Thine ordinances.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And if it be true that the All is an ordered whole, which is obedient to the touch and to the will of that divine Commander, then all His servants must be on the same side, and cannot turn their arms against each other. As an old hymn says with another reference-",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘All the servants of our KingIn heaven and earth are one,’ ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "‘All the servants of our King",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "In heaven and earth are one,’",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "and none of them can injure, wound, or slay a fellow-servant. If all are travelling in the same direction there can be no collision. If all are enlisted under the same standard they can never turn their weapons against each other. If God sways all things, then all things which God sways must be on the side of the men that are on the side of God. ‘Thou shalt make a league with the stones of the field: and the beasts of the field shall be at peace with thee.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Note the difficulties arising from experience, in the way of holding fast by this conviction of faith.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The grim facts of the world, seen from their lowest level, seem to shatter it to atoms. Talk about ‘the stars in their courses fighting’ for or against anybody! In one aspect it is superstition, in another aspect it is a dream and an illusion. The prose truth is that they shine down silent, pitiless, cold, indifferent, on battlefields or on peaceful homes; and the moonlight is as pure when it falls upon broken hearts as when it falls upon glad ones. Nature is utterly indifferent to the moral or the religious character of its victims. It goes on its way unswerving and pitiless; and whether the man who stands in its path is good or bad matters not. If he gets into a typhoon he will be wrecked; if he tumbles over Niagara he will be drowned. And what becomes of all the talk about an embattled universe on the side of goodness, in the face of the plain facts of life-of nature’s indifference, nature’s cruelty which has led some men to believe in two sovereign powers, one beneficent and one malicious, and has led others to say, ‘God is a superfluous hypothesis, and to believe in Him brings more enigmas than it solves,’ and has led still others to say, ‘Why, if there ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "is",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a God, does it look as if either He was not all-powerful, or was not all-merciful?’ Nature has but ambiguous evidence to give in support of this conviction.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Then, if we turn to what we call Providence and its mysteries, the very book of Job, from which my second text is taken, is one of the earliest attempts to grapple with the difficulty and to untie the knot; and I suppose everybody will admit that, whatever may be the solution which is suggested by that enigmatical book, the solution is by no means a complete one, though it is as complete as the state of religious knowledge at the time at which the book was written made possible to be attained. The seventy-third psalm shows that even in that old time when, as I have said, supernatural sanctions were introduced into the ordinary dealings of life, the difficulties that cropped up were great enough to bring a devout heart to a stand, and to make the Psalmist say, ‘My feet were almost gone; my steps had well-nigh slipped.’ Providence, with all its depths and mysteries, often to our aching hearts seems in our own lives to contradict the conviction, and when we look out over the sadness of humanity, still more does it seem impossible for us to hold fast by the faith ‘that all which we behold is full of blessings.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " I doubt not that there are many of ourselves whose lives, shadowed, darkened, hemmed in, perplexed, or made solitary for ever, seem to them to be hard to reconcile with this cheerful faith upon which I am trying to insist. Brethren, cling to it even in the darkness. Be sure of this, that amongst all our mercies there are none more truly merciful than those which come to us shrouded in dark garments, and in questionable shapes. Let nothing rob us of the confidence that ‘all things work together for good.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "I come, lastly, to consider the higher form in which this conviction is true for ever.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " I have said that the facts of life seem often to us, and are felt often by some of us, to shatter it to atoms; to riddle it through and through with shot. But, if we bring the Pattern-life to bear upon the illumination of all life, and if we learn the lessons of the Cradle and the Cross, and rise to the view of human life which emerges from the example of Jesus Christ, then we get back the old conviction, transfigured indeed, but firmer than ever. We have to alter the point of view. Everything always depends on the point of view. We have to alter one or two definitions. Definitions come first in geometry and in everything else. Get ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "them",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " right, and you will get your theorems and problems right.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So, looking at life in the light of Christ, we have to give new contents to the two words ‘good’ and ‘evil,’ and a new meaning to the two words ‘for’ and ‘against.’ And when we do that, then the difficulties straighten themselves out, and there are not any more knots, but all is plain; and the old faith of the Old Testament, which reposed very largely upon abnormal and extraordinary conditions of life, comes back in a still nobler form, as possible to be held by us amidst the commonplace of our daily existence.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " For everything is my friend, is for me and not against me, that helps me nearer to God. To live for Him, to live with Him, to be conscious ever of communion with Himself, to feel the touch of His hand on my hand, and the pressure of His breast against mine, at all moments of my life, is my true and the highest good. And if it is true that the ‘river of the water of life’ which ‘flows from the Throne of God’ is the only draught that can ever satisfy the immortal thirst of a soul, then whatever drives me away from the cisterns and to the fountain, is on my side. Better to dwell in a ‘dry and thirsty land, where no water is,’ if it makes me long for the water that rises at the gate of the true Bethlehem-the house of bread-than to dwell in a land flowing with milk and honey, and well watered in every part! If the cup that I would fain lift to my lips has poison in it, or if its sweetness is making me lose my relish for the pure and tasteless river that flows from the Throne of God, there can be no truer friend than that calamity, as men call it, which strikes the cup from my hands, and shivers the glass before I have raised it to my lips. Everything is my friend that helps me towards God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Everything is my friend that leads me to submission and obedience. The joy of life, and the perfection of human nature, is an absolutely submitted will, identified with the divine, both in regard to doing and to enduring. And whatever tends to make my will flexible, so that it corresponds to all the sinuosities, so to speak, of the divine will, and fits into all its bends and turns, is a blessing to me. Raw hides, stiff with dirt and blood, are put into a bath of bitter infusion of oak-bark. What for? For the same end as, when they are taken out, they are scraped with sharp steels,-that they may become flexible. When that is done the useless hide is worth something.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘Our wills are ours, we know not how;Our wills are ours, to make them Thine.’",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "‘Our wills are ours, we know not how;",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Our wills are ours, to make them Thine.’",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "And whatever helps me to that is my friend.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Everything is a friend to the man that loves God, in a far sweeter and deeper sense than it can ever be to any other. Like a sudden burst of sunshine upon a gloomy landscape, the light of union with God and friendship with Him flooding my daily life flashes it all up into brightness. The dark ribbon of the river that went creeping through the black copses, when the sun glints upon it, gleams up into links of silver, and the trees by its bank blaze out into green and gold. Brethren! ‘Who follows pleasure follows pain’; who follows God finds pleasure following him. There can be no surer way to set the world against me than to try to make it for me, and to make it my all They tell us that if you want to count those stars that ‘like a swarm of fire-flies tangled in a silver braid’ make up the Pleiades, the surest way to see the greatest number of them is to look a little on one side of them. Look away from the joys and friendships of creatural things right up to God, and you will see these sparkling and dancing in the skies, as you never see them when you gaze at them only. Make them second and they are good and on your side. Make them first, and they will turn to be your enemies and fight against you.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " This conviction will be established still more irrefragably and wonderfully in that future. Nothing lasts but goodness. ‘He that doeth the will of God abideth for ever.’ To oppose it is like stretching a piece of pack-thread across the rails before the express comes; or putting up some thin wooden partition on the beach on one of the Western Hebrides, exposed to the whole roll of the Atlantic, which will be battered into ruin by the first winter’s storm. Such is the end of all those who set themselves against God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But there comes a future in which, as dim hints tell us, these texts of ours shall receive a fulfilment beyond that realised in the present condition of things. ‘Then comes the statelier Eden back to man,’ and in a renewed and redeemed earth ‘they shall not hurt nor destroy in all My holy mountain’; and the ancient story will be repeated in higher form. The servants shall be like the Lord who, when He had conquered temptation, ‘was with the wild beasts’ that forgot their enmity, and ‘angels ministered unto Him.’ That scene in the desert may serve as a prophecy of the future when, under conditions of which we know nothing, all God’s servants shall, even more markedly and manifestly than here, help each other; and every man that loves God will find a friend in every creature.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " If we take Him for our Commander, and enlist ourselves in that embattled host, then all weathers will be good; ‘stormy winds, fulfilling His word,’ will blow us to our port; ‘the wilderness will rejoice and blossom as the rose’; and the whole universe will be radiant with the light of His presence, and ringing with the music of His voice. But if we elect to join the other army-for there is another army, and men have wills that enable them to lift themselves up against God, the Ruler of all things-then the old story, from which my first text is taken, will fulfil itself again in regard to us-’the stars in their courses will fight against’ us; and Sisera, lying stiff and stark, with Jael’s tent-peg through his temples, and the swollen corpses being swirled down to the stormy sea by ‘that ancient river, the river Kishon,’ will be a grim parable of the end of the men that set themselves against God, and so have the universe against them. ‘Choose ye this day whom ye will serve.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Job 5:23",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 5:23",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Thou shalt be in league with the stones of the field — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Thou shalt be free from any annoyance thereby, as if they had made an inviolable league with thee. It is a bold metaphor, but such are frequent in the Scriptures, as also in other authors. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And the beasts of the field shall be at peace with thee — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "This is an addition to the former privilege; they shall not hurt thee, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 5:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Nay, they shall befriend thee, as being at peace with thee. Our covenant with God is a covenant with all the creatures, that they shall do us no hurt, but serve and be ready to do us good.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5:17-27 Eliphaz gives to Job a word of caution and exhortation: Despise not thou the chastening of the Almighty. Call it a chastening, which comes from the Father's love, and is for the child's good; and notice it as a messenger from Heaven. Eliphaz also encourages Job to submit to his condition. A good man is happy though he be afflicted, for he has not lost his enjoyment of God, nor his title to heaven; nay, he is happy because he is afflicted. Correction mortifies his corruptions, weans his heart from the world, draws him nearer to God, brings him to his Bible, brings him to his knees. Though God wounds, yet he supports his people under afflictions, and in due time delivers them. Making a wound is sometimes part of a cure. Eliphaz gives Job precious promises of what God would do for him, if he humbled himself. Whatever troubles good men may be in, they shall do them no real harm. Being kept from sin, they are kept from the evil of trouble. And if the servants of Christ are not delivered from outward troubles, they are delivered by them, and while overcome by one trouble, they conquer all. Whatever is maliciously said against them shall not hurt them. They shall have wisdom and grace to manage their concerns. The greatest blessing, both in our employments and in our enjoyments, is to be kept from sin. They shall finish their course with joy and honour. That man lives long enough who has done his work, and is fit for another world. It is a mercy to die seasonably, as the corn is cut and housed when fully ripe; not till then, but then not suffered to stand any longer. Our times are in God's hands; it is well they are so. Believers are not to expect great wealth, long life, or to be free from trials. But all will be ordered for the best. And remark from Job's history, that steadiness of mind and heart under trial, is one of the highest attainments of faith. There is little exercise for faith when all things go well. But if God raises a storm, permits the enemy to send wave after wave, and seemingly stands aloof from our prayers, then, still to hang on and trust God, when we cannot trace him, this is the patience of the saints. Blessed Saviour! how sweet it is to look unto thee, the Author and Finisher of faith, in such moments!",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "For thou shalt be in league with the stones of the field - In the Hebrew, \"There shall be a covenant between thee and the stones of the field.\" The sense is, they shall not harm thee. They are here spoken of as enemies that were made to be at peace, and that would not annoy or injure. It is to be remembered that this was spoken in Arabia, where rocks and stones abounded, and where traveling, from that cause, was difficult and dangerous. The sense here is, as I understand it, that he would be permitted to make his way in ease and safety. Tindal renders it:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "But the castels in the land shall be confederate with thee;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The beastes of the fealde shall give thee peace.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Some have supposed that the meaning is, that the land would be free from stones that rendered it barren, and would be rendered fertile if the favor of God was sought. Shaw, in his Travels, supposes that it refers to the custom of walking over stones, in which the feet are liable to be injured every moment, and that the meaning is, that that danger would be averted by the divine interposition. By others it has been conjectured that the allusion is to a custom which is known as skopelism, of which Egmont and Heyman (Reisen, II. Th. S. 156), give the following account: \"that in Arabia, if anyone is living at variance with another he places on his land stones as a warning that no one should dare to plow it, as by doing it he would expose himself to the danger of being punished by him who had placed the stones there.\" This custom is also referred to by Ulpian (L. ix. de officio Proconsulis), and in the Greek Pandects, Lib. lx. Titus 22.Leg. 9. It may be doubted, however, whether this custom was as early as the time of Job, or was so common then as to make it probable that the allusion is to it. Rosenmuller supposes the meaning to be, \"Thy field shall be free from stones, which would render it unfruitful.\" Alte u. neue Morgenland, in loc. Other explanations may be seen in Rosenmuller (Commentary), but it seems to me that the view presented above, that traveling would be rendered safe and pleasant, is the true one. Such a promise would be among the rich blessings in a country like Arabia. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Some have supposed that the meaning is, that the land would be free from stones that rendered it barren, and would be rendered fertile if the favor of God was sought. Shaw, in his Travels, supposes that it refers to the custom of walking over stones, in which the feet are liable to be injured every moment, and that the meaning is, that that danger would be averted by the divine interposition. By others it has been conjectured that the allusion is to a custom which is known as skopelism, of which Egmont and Heyman (Reisen, II. Th. S. 156), give the following account: \"that in Arabia, if anyone is living at variance with another he places on his land stones as a warning that no one should dare to plow it, as by doing it he would expose himself to the danger of being punished by him who had placed the stones there.\" This custom is also referred to by Ulpian (L. ix. de officio Proconsulis), and in the Greek Pandects, Lib. lx. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Titus 22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".Leg. 9. It may be doubted, however, whether this custom was as early as the time of Job, or was so common then as to make it probable that the allusion is to it. Rosenmuller supposes the meaning to be, \"Thy field shall be free from stones, which would render it unfruitful.\" Alte u. neue Morgenland, in loc. Other explanations may be seen in Rosenmuller (Commentary), but it seems to me that the view presented above, that traveling would be rendered safe and pleasant, is the true one. Such a promise would be among the rich blessings in a country like Arabia. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "23. in league with the stones of the field—They shall not hurt the fertility of thy soil; nor the wild beasts thy fruits; spoken in Arabia-Deserta, where stones abounded. Arabia, derived from Arabah—a desert plain. The first clause of this verse answers to the first clause of Job 5:22; and the last of this verse to the last of that verse. The full realization of this is yet future (Isa 65:23, 25; Ho 2:18).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Thou shalt be free from any annoyance by stones, either in thy walking or other postures, or in thy ploughing, as if they had made an inviolable league with thee. Stones may be, and in these stony countries were, hurtful to men many ways; either by bruising or hurting their feet when they walked barefoot, as the manner then was; or by giving them occasion of stumbling, or slipping, and falling; or by falling upon a man from a rock, or higher ground, as sometimes it hath happened; or filling his grounds, so as to hinder his ploughing, and make his lands unfruitful. Nay, the stones shall not only cease to be hurtful, but they shall be useful and beneficial to thee; they shall, as it were, present themselves to thee when thou hast occasion, either to sling them at thine enemies, as then was usual, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Judges 20:16 2 Chronicles 26:14",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 20:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 26:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", or to make fences to thy ground, or to build a house. This is a bold metaphor, but such are frequent, as in other authors, so also in Scripture, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 28:15 Hosea 2:18",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 28:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 2:18",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The beasts of the field; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " either, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. The wild beasts; and then this is an addition to the former privilege; they shall not hurt thee, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Job 5:22",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 5:22",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; nay, they shall befriend thee, as being at peace with thee, here, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Job 5:23",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 5:23",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. The tame beasts, who otherwise may be refractory and hurtful to a man, many having been killed by them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "For thou shalt be in league with the stones of the field,.... So as to receive no hurt from them, by walking among them, and even barefoot, which was usual in the eastern countries, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 91:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; or by their being in the field, so as to hinder the increase of them; but on the contrary, even from such fields as were stony ground, a large crop has been produced, and so rather receive benefit by them, as men do from those with whom they are in league; and may therefore likewise signify, that these stones should be useful in being boundaries or fences about their fields, and landmarks in them, which should not be removed: many interpreters take notice of a sense that Pineda gives of these words, and which Cocceius calls an ingenious one, that it refers to a custom in Arabia, which may be called Scopelism, and was this; a man's enemies would lay stones in his field, and these signified, that if any attempted to till and manure those grounds where they were laid, some evil would befall him by the means of those persons who laid the stones there; and which stones were thought to be ominous and formidable; something like it is in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 3:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and so the sense is, that a good man had nothing to fear from such stones, he being in league with them; and this malicious practice is thought to have had its origin in Arabia Petraea (i); but the first sense seems best: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the beasts of the field shall be at peace with thee; a covenant being made with them, as in Hosea 2:18; meaning either literally, the beasts of the field; and these either the same as before, wild beasts, or beasts of prey; or rather, in distinction from them, tame beasts, as cows and horses, which should be so far from doing any harm, as sometimes is done by these tame creatures, that they should be very serviceable in tilling fields and drawing carriages, and the like: or else figuratively, men comparable to such creatures; and so the sense may be, that when a man's ways please the Lord, and he behaves according to his mind and will, particularly under afflictions, even his enemies are made to be at peace with him; Proverbs 16:7; the Targum interprets this of the Canaanites, comparable to the beasts of the field. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and the beasts of the field shall be at peace with thee; a covenant being made with them, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 2:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; meaning either literally, the beasts of the field; and these either the same as before, wild beasts, or beasts of prey; or rather, in distinction from them, tame beasts, as cows and horses, which should be so far from doing any harm, as sometimes is done by these tame creatures, that they should be very serviceable in tilling fields and drawing carriages, and the like: or else figuratively, men comparable to such creatures; and so the sense may be, that when a man's ways please the Lord, and he behaves according to his mind and will, particularly under afflictions, even his enemies are made to be at peace with him; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 16:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; the Targum interprets this of the Canaanites, comparable to the beasts of the field. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(i) See Egmont and Heyman's Travels, vol. 2. p. 156. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(i) See Egmont and Heyman's Travels, vol. 2. p. 156. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "For thou shalt be in league with the stones of the field: and the beasts of the field shall be at peace with thee.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". When man is at peace with God he is at peace with all God’s creation, he has a league with all nature and every creature: “We know that all things work together for good to them that love God,” ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 8:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 23.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "For thou shalt be in league with the stones of the field",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " there shall be peace between thee and all the rest of God's creation, even \"the stones of the field,\" against which thou shalt not dash thy foot (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 91:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); and if the senseless stones am thus in league with thee, and refrain from doing thee hurt, much more mayest thou be sure that ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "the beasts of the field shall be at peace with thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". For they are not altogether senseless, and will in some sort understand that thou art under God's protection, and not to be molested by them (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 2:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where God promises to make a covenant between his people and \"the beasts of the field, the fowls of heaven, and the creeping things of the ground,\" that so they may \"lie down safely \"). A misplaced ingenuity seeks to find either six or seven forms of calamity in the enumeration of vers. 20-23; but there appear to be really only five: ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(1)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " famine; ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(2)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " war; ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(3)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " calumny; ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(4)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " devastation; and ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(5)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " noisome beasts. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The expression used in ver. 19 - \"six, yea, seven\" - means, as already explained, an ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "indefinite",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " number. Job 5:23",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "22  At destruction and famine thou shalt laugh,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And from the beasts of the earth thou hast nothing to fear.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "23  For thou art in league with the stones of the field,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And the beasts of the field are at peace with thee.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "24  And thou knowest that peace is thy pavilion;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And thou searchest thy household, and findest nothing wanting.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "25  Thou knowest also that thy seed shall be numerous,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And thy offspring as the herb of the ground.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "26  Thou shalt come to thy grave in a ripe age,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "As shocks of corn are brought in in their season.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "27  Lo! this we have searched out, so it is:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Hear it, and give thou heed to it.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The verb שׂחק is construed (Job 5:22) with ל of that which is despised, as Job 39:7, Job 39:18; Job 41:21 [Hebr.]. על־תּירא is the form of subjective negation [vid. Ges. 152, 1: Tr.]: only fear thou not  equals  thou hast no occasion. In Job 5:23, בּריתך is the shortest substantive form for לך בּרית. The whole of nature will be at peace with thee: the stones of the field, that they do not injure the fertility of thy fields; the wild beasts of the field, that they do not hurt thee and thy herds. The same promise that Hosea (Hosea 2:20) utters in reference to the last days is here used individually. From this we see how deeply the Chokma had searched into the history of Paradise and the Fall. Since man, the appointed lord of the earth, has been tempted by a reptile, and has fallen by a tree, his relation to nature, and its relation to him, has been reversed: it is an incongruity, which is again as a whole put right (שׁלום), as the false relation of man to God is put right. In Job 5:24, שׁלום (which might also be adj.) is predicate: thou wilt learn (וידעתּ, praet. consec. with accented ultima, as e.g., Deuteronomy 4:39, here with Tiphcha initiale s. anterius, which does not indicate the grammatical tone-syllable) that thy tent is peace, i.e., in a condition of contentment and peace on all sides. Job 5:24 is to be arranged: And when thou examinest thy household, then thou lackest nothing, goest not astray, i.e., thou findest everything, without missing anything, in the place where thou seekest it.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The verb שׂחק is construed (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 5:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") with ל of that which is despised, as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 39:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 39:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 41:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " [Hebr.]. על־תּירא is the form of subjective negation [vid. Ges. 152, 1: Tr.]: only fear thou not  equals  thou hast no occasion. In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 5:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", בּריתך is the shortest substantive form for לך בּרית. The whole of nature will be at peace with thee: the stones of the field, that they do not injure the fertility of thy fields; the wild beasts of the field, that they do not hurt thee and thy herds. The same promise that Hosea (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 2:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") utters in reference to the last days is here used individually. From this we see how deeply the Chokma had searched into the history of Paradise and the Fall. Since man, the appointed lord of the earth, has been tempted by a reptile, and has fallen by a tree, his relation to nature, and its relation to him, has been reversed: it is an incongruity, which is again as a whole put right (שׁלום), as the false relation of man to God is put right. In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 5:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", שׁלום (which might also be adj.) is predicate: thou wilt learn (וידעתּ, praet. consec. with accented ultima, as e.g., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 4:39",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", here with Tiphcha initiale s. anterius, which does not indicate the grammatical tone-syllable) that thy tent is peace, i.e., in a condition of contentment and peace on all sides. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 5:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is to be arranged: And when thou examinest thy household, then thou lackest nothing, goest not astray, i.e., thou findest everything, without missing anything, in the place where thou seekest it.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Job 5:25 reminds one of the Salomonic Psalm 72:16. צאצאים in the Old Testament is found only in Isaiah and the book of Job. The meaning of the noun כּלח, which occurs only here and Job 30:2, is clear. Referring to the verb כּלח, Arabic qahila (qalhama), to be shrivelled up, very aged, it signifies the maturity of old age, - an idea which may be gained more easily if we connect כּלח with כּלה (to be completed), like קשׁח with קשׁה (to be hard).",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 5:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " reminds one of the Salomonic ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 72:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". צאצאים in the Old Testament is found only in Isaiah and the book of Job. The meaning of the noun כּלח, which occurs only here and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 30:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", is clear. Referring to the verb כּלח, Arabic qahila (qalhama), to be shrivelled up, very aged, it signifies the maturity of old age, - an idea which may be gained more easily if we connect כּלח with כּלה (to be completed), like קשׁח with קשׁה (to be hard).",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...",
        "children": []
      }
    ]
  }
]