[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Job 5:7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 5:7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Yet man is born to trouble, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — He is so commonly exposed to various troubles, as if he were born to no other end: affliction is become natural to man, and is transmitted from parents to children, as their constant inheritance; God having allotted this portion to mankind for their sins. And therefore thou takest a wrong course in complaining so bitterly of that which thou shouldst patiently bear, as the common lot of mankind. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "As — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "As naturally, and as generally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "as the sparks ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "of fire ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "fly upward — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Why then should we be surprised at our afflictions, as strange, or quarrel with them, as hard? This last clause, literally translated from the Hebrew, is, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "As the sons of the burning coal raise themselves up to fly. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Instead, however, of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sparks, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the sons of the coal, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "the author of the Vulgate writes, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Homo nascitur ad laborem, et avis ad volatum, man is born for labour, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "trouble,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and the bird for flying; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "reading, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "עו",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Š, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "gnoph, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "a bird, for ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "gnuph, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "to fly. To the same purpose is the interpretation of the LXX., Syr. and Arab.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5:6-16 Eliphaz reminds Job, that no affliction comes by chance, nor is to be placed to second causes. The difference between prosperity and adversity is not so exactly observed, as that between day and night, summer and winter; but it is according to the will and counsel of God. We must not attribute our afflictions to fortune, for they are from God; nor our sins to fate, for they are from ourselves. Man is born in sin, and therefore born to trouble. There is nothing in this world we are born to, and can truly call our own, but sin and trouble. Actual transgressions are sparks that fly out of the furnace of original corruption. Such is the frailty of our bodies, and the vanity of all our enjoyments, that our troubles arise thence as the sparks fly upward; so many are they, and so fast does one follow another. Eliphaz reproves Job for not seeking God, instead of quarrelling with him. Is any afflicted? let him pray. It is heart's ease, a salve for every sore. Eliphaz speaks of rain, which we are apt to look upon as a little thing; but if we consider how it is produced, and what is produced by it, we shall see it to be a great work of power and goodness. Too often the great Author of all our comforts, and the manner in which they are conveyed to us, are not noticed, because they are received as things of course. In the ways of Providence, the experiences of some are encouragements to others, to hope the best in the worst of times; for it is the glory of God to send help to the helpless, and hope to the hopeless. And daring sinners are confounded, and forced to acknowledge the justice of God's proceedings.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Yet man is born unto trouble - All this is connected with the sentiment in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 5:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff. The meaning is, that \"since afflictions are ordered by an intelligent Being, and since man is born unto trouble as the sparks fly upward, therefore it is wise to commit our cause to God, and not to complain against him.\" Margin, or labor. The word here (עמל  ‛âmâl) rather means trouble, or affliction, than labor. The sense is, that as certainly as man is born, so sure is it that he will have trouble. It follows from the condition of our being, as certainly as that unconscious objects will follow the laws of their nature - that sparks will ascend. This seems to have a proverbial cast, and was doubtless regarded as a sentiment universally true. It is as true now as it was then; for it is still the great law of our being, that trouble as certainly comes sooner or later, as that material objects obey the laws of nature which God has impressed on them.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "As the sparks fly upward - The Hebrew expression here is very beautiful - \"as רשׁף בני  benēy reshep - the sons of flame fly.\" The word used (רשׁף reshep) means flame, lightning; the sons, or children of the flame, are that which it produces; that is, sparks. Gesenius strangely renders it, \"sons of the lightning; that is, birds of prey which fly as swift as the lightning.\" So Dr. Good, \"As the bird-tribes are made to fly upwards.\" So Umbreit renders it, Gleichwie die Brut des Raubgeflugels sich hoch in Fluge hebt - \"as a flock of birds of prey elevate themselves on the wing.\" Noyes adopts the construction of Gesenius; partly on the principle that man would be more likely to be compared to birds, living creatures, than to sparks. There is considerable variety in the interpretation of the passage. The Septuagint renders it, νεοσσοι δε γυπος  neossoi de gupos - the young of the vulture. The Chaldee, מזיקי בני  benēy mezēyqēy - \"the sons of demons.\" Syriac \"Sons of birds.\" Jerome, \"Man is born to labor, and the bird to flight\" - et avis ad volatum. Schultens renders it, \"glittering javelins,\" and Arius Montanus, \"sons of the live coal.\" It seems to me that our common version has expressed the true meaning. But the idea is not essentially varied whichever interpretation is adopted. It is, that as sparks ascend, or as birds fly upward - following the laws of their being - so is trouble the lot of man. It certainly comes; and comes under the direction of a Being who has fixed the laws of the inferior creation. It would be wise for man, therefore, to resign himself to God in the times when those troubles come. He should not sit down and complain at this condition of things, but should submit to it as the law of his being, and should have sufficient confidence in God to believe that he orders it aright. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "As the sparks fly upward - The Hebrew expression here is very beautiful - \"as רשׁף בני  benēy reshep - the sons of flame fly.\" The word used (רשׁף reshep) means flame, lightning; the sons, or children of the flame, are that which it produces; that is, sparks. Gesenius strangely renders it, \"sons of the lightning; that is, birds of prey which fly as swift as the lightning.\" So Dr. Good, \"As the bird-tribes are made to fly upwards.\" So Umbreit renders it, Gleichwie die Brut des Raubgeflugels sich hoch in Fluge hebt - \"as a flock of birds of prey elevate themselves on the wing.\" Noyes adopts the construction of Gesenius; partly on the principle that man would be more likely to be compared to birds, living creatures, than to sparks. There is considerable variety in the interpretation of the passage. The Septuagint renders it, νεοσσοι δε γυπος  neossoi de gupos - the young of the vulture. The Chaldee, מזיקי בני  benēy mezēyqēy - \"the sons of demons.\" Syriac \"Sons of birds.\" Jerome, \"Man is born to labor, and the bird to flight\" - et avis ad volatum. Schultens renders it, \"glittering javelins,\" and Arius Montanus, \"sons of the live coal.\" It seems to me that our common version has expressed the true meaning. But the idea is not essentially varied whichever interpretation is adopted. It is, that as sparks ascend, or as birds fly upward - following the laws of their being - so is trouble the lot of man. It certainly comes; and comes under the direction of a Being who has fixed the laws of the inferior creation. It would be wise for man, therefore, to resign himself to God in the times when those troubles come. He should not sit down and complain at this condition of things, but should submit to it as the law of his being, and should have sufficient confidence in God to believe that he orders it aright. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "7. Yet—rather, \"Truly,\" or, But affliction does not come from chance, but is the appointment of God for sin; that is, the original birth-sin of man. Eliphaz passes from the particular sin and consequent suffering of Job to the universal sin and suffering of mankind. Troubles spring from man's common sin by as necessary a law of natural consequences as sparks (Hebrew, \"sons of coal\") fly upward. Troubles are many and fiery, as sparks (1Pe 4:12; Isa 43:2). Umbreit for \"sparks\" has \"birds of prey;\" literally, \"sons of lightning,\" not so well.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " i.e. He is so commonly exposed to many and various troubles, as if he were born to no other end. Affliction is become in some sort natural and proper to man, and it is, together with sin, transmitted from parents to children, as their most certain and constant inheritance; God having allotted this portion to mankind for their sins. And therefore thou takest a wrong course in complaining so bitterly of that which thou shouldst patiently bear, as the common lot of mankind; and thy right method is to seek unto God, who inflicts it, and who only can remove it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "As the sparks fly upward, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. as naturally and as generally ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "as the sparks of fire fly upward",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which do so universally and constantly. Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and the sparks",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c. But the particle ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is oft used comparatively for ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "as",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Job 12:11 14:11 34:3 Proverbs 25:21 Mark 9:49",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 12:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 14:11 34:3 ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 25:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 9:49",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Yet man is born unto trouble,.... Or but (b), after the negative follows the positive part of the assertion; before we have what is denied as the cause of affliction, here what it is affirmed to be, or what it is to be ascribed unto, even to the appointment of God for sin: to be born to it is to be appointed to it, as all men are appointed to death, and to everything previous and that leads on to it; and it signifies that affliction or trouble springs from the birth sin of man, from original sin, the sin of the first parent, and of his nature; as all sins arise from hence, and are streams from this fountain of pollution, so all disorders and diseases of body, all distresses and anguish of mind, and death in every sense, corporeal, spiritual, and eternal; and these are the lot and portion, the estate and inheritance, of the sons of men by nature, what they are born unto, and are full of, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 14:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; the same word is here used as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 5:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and signifies labour, mischief, the mischief of sin, improbity, wickedness, moral evil; and man may be said to be born to sin, inasmuch as he is conceived, shapen, and born in it; and as he is born at once into a sinful state, and sins as soon as born, goes astray from the womb, is a transgressor from thence, and the imagination of his heart evil from his infancy and youth upwards, he becomes a slave to sin, and is a homeborn one; not that he is laid under a necessity of force to sin, or his will compelled to it; for he sins most freely, is a voluntary slave to it; he serves various lusts as pleasures, and gives himself up to work all iniquity with greediness; but there is such a connection between his birth, the circumstances of it, and sin, that sin is the certain consequence of it, and immediately, naturally, and necessarily follows upon it; that is, by a necessity of consequence, though not of coaction or force; it is as natural for man to sin as it is for a thirsty man to covet and drink water; or as for an Ethiopian to be born black, and a leopard with spots; or, as it follows: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "as the sparks fly upward; which they do naturally and necessarily when coals are blown, and which are here called \"the sons of coals\" (c); and to these, troubles and afflictions, the fruits and effects of sin, may be aptly compared; not only for the necessity of them, it is if needs be they are, but for the nature of them, being fiery and troublesome, hence called fiery trials, and signified by fires and flames of fire, 1 Peter 4:12; and also for the number of them, being many, and very grievous: some interpret this of flying fowls, of young vultures, as the Septuagint; of young eagles, as others; Aben Ezra makes mention of this sense, as if it was, as a fowl is born to fly, so man is born to labour; to labour in the law, according to the Targum; or to labour for his bread; or rather, to labour and sorrow; that is, to affliction and trouble: a learned man (d) thinks the phrase, according to the use of it in the Arabic language, designs the more rapid cast of a dart, of the vibration of it, which is very quick. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "as the sparks fly upward; which they do naturally and necessarily when coals are blown, and which are here called \"the sons of coals\" (c); and to these, troubles and afflictions, the fruits and effects of sin, may be aptly compared; not only for the necessity of them, it is if needs be they are, but for the nature of them, being fiery and troublesome, hence called fiery trials, and signified by fires and flames of fire, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Peter 4:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and also for the number of them, being many, and very grievous: some interpret this of flying fowls, of young vultures, as the Septuagint; of young eagles, as others; Aben Ezra makes mention of this sense, as if it was, as a fowl is born to fly, so man is born to labour; to labour in the law, according to the Targum; or to labour for his bread; or rather, to labour and sorrow; that is, to affliction and trouble: a learned man (d) thinks the phrase, according to the use of it in the Arabic language, designs the more rapid cast of a dart, of the vibration of it, which is very quick. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) \"sed\", Junius & Tremellius, Piscator, Cocceius Schmidt, so Broughton. (c) , \"tilii prunae\", Montanus, Vatablus, Piscator, Cocceius, Bolducius, Schmidt. (d) Hinckelman. Praefat. ad Alcoran. p. 29. So Schultens renders it, \"tela corusea\". ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(b) \"sed\", Junius & Tremellius, Piscator, Cocceius Schmidt, so Broughton. (c) , \"tilii prunae\", Montanus, Vatablus, Piscator, Cocceius, Bolducius, Schmidt. (d) Hinckelman. Praefat. ad Alcoran. p. 29. So Schultens renders it, \"tela corusea\". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Yet man is born unto {i} trouble, as the sparks fly upward.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Yet man is born unto ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{i}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " trouble, as the sparks fly upward.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(i) Which declares that sin is always in our corrupt nature: for before sin it was not subject to pain and affliction.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Yet man is born unto trouble",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "but man",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The true explanation of affliction is now given, as the false explanation was denied in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Job 5:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 5:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". The words “man is born unto trouble” mean, it is his nature through his sin to bring trouble upon himself; evil rises up out of his heart as naturally as the sparks fly up out of the flame. Cf. the words of Christ, “Out of the heart proceed evil thoughts,” and the appalling list which follows. Eliphaz is severe on human nature, but the broad generality of his doctrine is fitted to enable Job to find himself in his history and let himself be led back to a more devout demeanour. See the concluding remark to ch. 4.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 7.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Yet man is born unto trouble",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Yet still, in point of fact, man is born to trouble. He has a corrupt nature, and always sins more or less. Each sin brings him into trouble, since it entails on him a punishment. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "As the sparks fly upward",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "the sons of flame.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Some suppose \"meteoric flashes\" to be meant: others suggest, \"ignited arrows.\" But many good Hebraists maintain the rendering of the Authorized Version (see Buxtorf, 'Lexicon,' p. 757; Rosenmuller, 'Scholia,' vol. 5. p. 165; Canon Cook, 'Speaker's Commentary,' vol. 4. p. 34). Job 5:7",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "  6  For evil cometh not forth from the dust,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And sorrow sprouteth not from the earth;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "  7  For man is born to sorrow,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "As the sparks fly upward.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "  8  On the contrary, I would earnestly approach unto God,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And commit my cause to the Godhead;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "  9  To Him who doeth great things and unsearchable;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Marvellous things till there is no number:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "10  Who giveth rain over the earth,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And causeth water to flow over the fields:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "11  To set the low in high places;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And those that mourn are exalted to prosperity.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "As the oracle above, so Eliphaz says here, that a sorrowful life is allotted to man, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Fries explains יוּלּד as part., and refers to Geiger's Lehrb. zur Sprache der Mischna, S. 41f., according to which מקטּל signifies killed, and קטּל ( equals  Rabb. מתקטּל) being killed (which, however, rests purely on imagination): not the matter from which mankind originates brings evil with it, but it is man who inclines towards the evil. Bttch. would read יולד: man is the parent of misery, though he may rise high in anger.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...",
        "children": []
      }
    ]
  }
]