[[],[{"type":"header","content":"Birth of Isaac Promised"},{"type":"prose","content":"Now the  appeared to Abraham by the terebinth  of Mamre [in Hebron], while he was sitting at the tent door in the heat of the day. "}],[{"type":"prose","content":"When he raised his eyes and looked up, behold, three men were standing [a little distance] from him. When he saw them, he ran from the tent door to meet them and bowed down [with his face] to the ground, "}],[{"type":"prose","content":"and Abraham said, “My lord, if now I have found favor in your sight, please do not pass by your servant [without stopping to visit]. "}],[{"type":"prose","content":"Please let a little water be brought [by one of my servants] and [you may] wash your feet, and recline  rest comfortably under the tree. "}],[{"type":"prose","content":"And I will bring a piece of bread to refresh  sustain you; after that you may go on, since you have come to your servant.” And they replied, “Do as you have said.” "}],[{"type":"prose","content":"So Abraham hurried into the tent to Sarah, and said, “Quickly, get ready three measures of fine meal, knead it and bake cakes.” "}],[{"type":"prose","content":"Abraham also ran to the herd and brought a calf, tender and choice, and he gave it to the servant [to butcher], and he hurried to prepare it. "}],[{"type":"prose","content":"Then he took curds and milk and the calf which he had prepared, and set it before the men; and he stood beside them under the tree while they ate."}],[{"type":"prose","content":"Then they said to him, “Where is Sarah your wife?” And he said, “There, in the tent.” "}],[{"type":"prose","content":"He said, “I will surely return to you at this time next year; and behold, Sarah your wife will have a son.” And Sarah was listening at the tent door, which was behind him. "}],[{"type":"prose","content":"Now Abraham and Sarah were old, well advanced in years; she was past [the age of] childbearing. "}],[{"type":"prose","content":"So Sarah laughed to herself [when she heard the  words], saying, “After I have become old, shall I have pleasure  delight, my lord (husband) being also old?” "}],[{"type":"prose","content":"And the  asked Abraham, “Why did Sarah laugh [to herself], saying, ‘Shall I really give birth [to a child] when I am so old?’ "}],[{"type":"prose","content":"Is anything too difficult  too wonderful for the ? At the appointed time, when the season [for her delivery] comes, I will return to you and Sarah will have a son.” "}],[{"type":"prose","content":"Then Sarah denied it, saying, “I did not laugh”; because she was afraid. And He (the ) said, “No, but you did laugh.”"}],[{"type":"prose","content":"Then the men got up from there, and looked toward Sodom; and Abraham walked with them to send them on the way. "}],[{"type":"prose","content":"The  said, “Shall I keep secret from Abraham [My friend and servant] what I am going to do, "}],[{"type":"prose","content":"since Abraham is destined to become a great and mighty nation, and all the nations of the earth will be blessed through him? "}],[{"type":"prose","content":"For I have known (chosen, acknowledged) him [as My own], so that he may teach  command his children and [the sons of] his household after him to keep the way of the  by doing what is righteous and just, so that the  may bring upon Abraham what He has promised him.” "}],[{"type":"prose","content":"And the  said, “The outcry [of the sin] of Sodom and Gomorrah is indeed great, and their sin is exceedingly grave. "}],[{"type":"prose","content":"I will go down now, and see whether they have acted [as vilely and wickedly] as the outcry which has come to Me [indicates]; and if not, I will know.”"}],[{"type":"prose","content":"Now the [two] men (angelic beings) turned away from there and went toward Sodom, but Abraham remained standing before the . "}],[{"type":"prose","content":"Abraham approached [the ] and said, “Will You really sweep away the righteous (those who do right) with the wicked (those who do evil)? "}],[{"type":"prose","content":"Suppose there are fifty righteous [people] within the city; will You really sweep it away and not spare it for the sake of the fifty righteous who are in it? "}],[{"type":"prose","content":"Far be it from You to do such a thing—to strike the righteous with the wicked, so that the righteous and the wicked are  alike. Far be it from You! Shall not the Judge of all the earth do right [by executing just and righteous judgment]?” "}],[{"type":"prose","content":"So the  said, “If I find within the city of Sodom fifty righteous [people], then I will spare the entire place for their sake.” "}],[{"type":"prose","content":"Abraham answered, “Now behold, I who am but dust [in origin] and ashes have decided to speak to the Lord. "}],[{"type":"prose","content":"If five of the fifty righteous are lacking, will You destroy the entire city for lack of five?” And He said, “If I find [at least] forty-five [righteous people] there, I will not destroy it.” "}],[{"type":"prose","content":"Abraham spoke to Him yet again and said, “Suppose [only] forty are found there.” And He said, “I will not do it for the sake of the forty [who are righteous].” "}],[{"type":"prose","content":"Then Abraham said [to Him], “Oh, may the Lord not be angry, and I will speak; suppose thirty [righteous people] are found there?” And He said, “I will not do it if I find thirty there.” "}],[{"type":"prose","content":"And he said, “Now behold, I have decided to speak to the Lord [again]. Suppose [only] twenty [righteous people] are found there?” And the Lord said, “I will not destroy it for the sake of the twenty.” "}],[{"type":"prose","content":"Then Abraham said, “Oh may the Lord not be angry [with me], and I will speak only this once; suppose ten [righteous people] are found there?” And He said, “I will not destroy it for the sake of the ten.” "}],[{"type":"prose","content":"As soon as He had finished speaking with Abraham the  departed, and Abraham returned to his own place."}]]