[{"num":18,"verse":"And Hashem appeared unto him in the terebinth trees of Mamre; and he sat in the entrance of the ohel (tent) in the heat of the day;"},{"num":2,"verse":"And he lifted up his eyes and looked, and, hinei, Shloshah Anashim (Three Men, [Yeshayah 6:3]) stood by him; and when he saw them, he ran to meet them from the entrance of the ohel, and prostrated himself on the ground,"},{"num":3,"verse":"And said, Adonoi [Hashem, see v.13], if now I have found chen (favor) in Thy sight, pass not on by, please, from Thy servant;"},{"num":4,"verse":"Let a little water, please, be brought, and wash Thy feet, and rest under haetz (the tree);"},{"num":5,"verse":"And I will bring a morsel of bread, and refresh Ye Your hearts; after that Ye shall pass on; because for this purpose are Ye come to Your servant. And they said, So do, as thou hast said."},{"num":6,"verse":"And Avraham hastened into the ohel unto Sarah, and said, Make ready quickly shlosh measures of fine meal, knead it, and make cakes."},{"num":7,"verse":"And Avraham ran unto the herd, and brought a calf tender and tov, and gave it unto a servant; and he hasted to prepare it."},{"num":8,"verse":"And he took curds, and cholov (milk), and the calf which he had prepared, and set it before them; and he stood by them under haetz, and they did eat."},{"num":9,"verse":"And they said unto him, Where is Sarah thy wife? And he said, Hinei, in the ohel."},{"num":10,"verse":"And He said, I will certainly return unto thee at this time next year; and, hinei, Sarah thy wife shall have ben (son). And Sarah heard it in the entrance of the ohel, which was behind him."},{"num":11,"verse":"Now Avraham and Sarah were zekenim (old ones) and well stricken in age; and [in childbearing] it ceased to be with Sarah after the manner of women."},{"num":12,"verse":"Therefore Sarah laughed [titzchak, sounds like Yitzchak] within herself, saying, After I am grown old shall I have pleasure, adoni being old also?"},{"num":13,"verse":"And Hashem said unto Avraham, Why did Sarah laugh, saying, Shall I which am old of a surety bear a child?"},{"num":14,"verse":"Is any thing too hard for Hashem? At the time appointed I will return unto thee, in due season, and Sarah shall have ben (son)."},{"num":15,"verse":"Then Sarah denied, saying, I laughed not; for she was afraid. And He said, Oh yes but thou didst laugh."},{"num":16,"verse":"And the Anashim rose up from thence, and peered toward S’dom; and Avraham went with them to send them on the way."},{"num":17,"verse":"And Hashem said, Shall I hide from Avraham that thing which I do;"},{"num":18,"verse":"Seeing that Avraham shall surely become a great and mighty nation, and kol goyei ha’aretz (all the nations of the earth) shall be blessed in him?"},{"num":19,"verse":"For I know him, that he will command his children and his household after him, and they shall be shomer over the Derech Hashem, to do tzedakah and mishpat; that Hashem may bring upon Avraham that which He hath spoken [promised] of him."},{"num":20,"verse":"And Hashem said, Because the outcry of S’dom and Amora is great, and because their sin is very grievous;"},{"num":21,"verse":"I will go down now, and see whether they have done altogether according to the crying out [for punishment] of it, which is come unto Me; and if not, I will have da’as."},{"num":22,"verse":"And the Men turned their faces from thence, and went toward S’dom; but Avraham stood yet before Hashem."},{"num":23,"verse":"And Avraham drew near, and said, Wilt Thou also destroy the tzaddik with the rasha?"},{"num":24,"verse":"Suppose there be fifty tzaddikim within the city; wilt Thou also destroy and not nasa (spare [take away and bear the guilt of, Yeshayah 53:12]) the place lema’an (for the sake of) the fifty tzaddikim that are therein? [IK 3:18]"},{"num":25,"verse":"That be far from Thee to do after this manner, to slay the tzaddik with the rasha; and that the tzaddik should be as the rasha, that be far from Thee: Shall not HaShofet Kol Ha’Aretz (the Judge of All the Earth) do mishpat (right)?"},{"num":26,"verse":"And Hashem said, If I find in S’dom fifty tzaddikim within the city, then I will spare all the place for their sakes."},{"num":27,"verse":"And Avraham answered and said, Hinei now, I, which am but aphar and ashes, have taken upon me to speak unto Hashem;"},{"num":28,"verse":"Suppose there shall lack five of the fifty tzaddikim; wilt Thou destroy all the city for lack of five? And He said, If I find there forty and five, I will not destroy it."},{"num":29,"verse":"And he spoke unto Him yet again, and said, Suppose there shall be forty found there. And He said, I will not do it for forty’s sake."},{"num":30,"verse":"And he said unto Him, Oh let not Hashem be angry, and I will speak; suppose there shall thirty be found there. And He said, I will not do it, if I find thirty there."},{"num":31,"verse":"And he said, Hinei now, I have taken upon me to speak unto Hashem: suppose there shall be twenty found there. And He said, I will not destroy it for twenty’s sake."},{"num":32,"verse":"And he said, Oh let not Hashem be angry, and I will speak yet but this once: suppose asarah (ten, i.e., a minyan) shall be found there. And He said, I will not destroy it for the sake of haasarah (the ten)."},{"num":33,"verse":"And Hashem went His way, as soon as He had left communing with Avraham; and Avraham returned unto his makom."}]