[{"num":12,"verse":"The men of Efrayim assembled, crossed into Tzafon and said to Yiftach, “Why didn’t you call us to go with you when you went over to fight the people of ‘Amon? We’re ready to burn down your house with you in it!” "},{"num":2,"verse":"Yiftach answered, “When my people and I were in a serious dispute with the people of ‘Amon, I called you; and you didn’t rescue me from their power. "},{"num":3,"verse":"When I saw that you weren’t rescuing me, I put my life in my own hands and went over to attack the people of ‘Amon; and Adonai gave them over into my power. So why have you come up today to fight me?” "},{"num":4,"verse":"Then Yiftach gathered together all the men of Gil‘ad and fought with Efrayim, and the men of Gil‘ad defeated Efrayim; because they were saying, “You Gil‘ad men who live in Efrayim and M’nasheh have deserted Efrayim!” "},{"num":5,"verse":"The men of Gil‘ad cut off Efrayim from the crossings over the Yarden, and whenever anyone from Efrayim tried to escape and said, “Let me go across,” the men of Gil‘ad would ask him, “Are you from Efrayim?” and if he said, “No,” "},{"num":6,"verse":"they would tell him to say “Shibbolet.” If he said, “Sibbolet,” because he could not make his mouth pronounce it right, they took hold of him and killed him on the spot at the Yarden crossing; at that time 42,000 men of Efrayim died."},{"num":7,"verse":"Yiftach judged Isra’el for six years. Then Yiftach from Gil‘ad died, and he was buried in one of the cities of Gil‘ad."},{"num":8,"verse":"After him Ibtzan of Beit-Lechem judged Isra’el. "},{"num":9,"verse":"He had thirty sons, and he had thirty daughters whom he sent abroad; he brought thirty women from abroad in to marry his sons. He judged Isra’el for seven years. "},{"num":10,"verse":"Then Ibtzan died and was buried at Beit-Lechem."},{"num":11,"verse":"After him Elon from Z’vulun judged Isra’el; he judged Isra’el for ten years. "},{"num":12,"verse":"Then Elon from Z’vulun died and was buried at Ayalon, in the territory of Z’vulun."},{"num":13,"verse":"After him Avdon the son of Hillel from Pir‘aton judged Isra’el. "},{"num":14,"verse":"He had forty sons and thirty grandsons who rode on seventy young donkeys. He judged Isra’el for eight years. "},{"num":15,"verse":"Then Avdon the son of Hillel from Pir‘aton died and was buried at Pir‘aton in the territory of Efrayim, in the ‘Amalek hills."}]