[{"header":"Jephthah’s Battle With Ephraim"},{"num":12,"verse":"At that time the men of Ephraim were called to arms. They crossed over to Zaphon and said to Jephthah, “Why did you cross over to wage war against the Ammonites, but you did not invite us to go with you? We will burn your house down with you in it.”"},{"num":2,"verse":"Jephthah said to them, “I was a man involved in a bitter dispute—I and my people against the Ammonites. I called you out to arms, but you did not rescue me from their hand. "},{"num":3,"verse":"When I saw that you were not coming to rescue me, I took my life into my hands. I crossed over against the Ammonites, and the Lord gave them into my hand. So why have you come up against me this day to wage war against me?”"},{"num":4,"verse":"So Jephthah summoned all the men of Gilead and waged war against Ephraim. The men of Gilead struck down Ephraim, because the Ephraimites had said, “You Gileadites are nothing but renegades from Ephraim and Manasseh.”"},{"num":5,"verse":"The men of Gilead captured the fords across the Jordan that led to Ephraim. Whenever an Ephraimite fleeing from the battle said, “Let me cross over,” the men of Gilead asked him, “Are you an Ephraimite?” If he said, “No,” "},{"num":6,"verse":"they said to him, “Please say, ‘Shibboleth.’” But if he instead said, “Sibboleth,” because he could not pronounce the word correctly, they seized him and slaughtered him at the fords of the Jordan. At that time, forty-two thousand from Ephraim fell."},{"num":7,"verse":"Jephthah judged Israel for six years. Then Jephthah the Gileadite died and was buried among the cities of Gilead."},{"header":"The Ninth Judge: Ibzan"},{"num":8,"verse":"After him Ibzan from Bethlehem judged Israel. "},{"num":9,"verse":"He had thirty sons and thirty daughters. He sent the thirty daughters outside his clan for marriage, and for his sons he brought in thirty wives from outside his clan. He judged Israel for seven years. "},{"num":10,"verse":"Then Ibzan died, and he was buried at Bethlehem."},{"header":"The Tenth Judge: Elon"},{"num":11,"verse":"After him Elon from Zebulun judged Israel. He judged Israel for ten years. "},{"num":12,"verse":"Then Elon the Zebulunite died and was buried at Aijalon in the land of Zebulun."},{"header":"The Eleventh Judge: Abdon"},{"num":13,"verse":"After him Abdon son of Hillel from Pirathon judged Israel. "},{"num":14,"verse":"He had forty sons and thirty grandsons, who rode on seventy donkeys. He judged Israel for eight years. "},{"num":15,"verse":"Then Abdon son of Hillel from Pirathon died, and he was buried at Pirathon in the land of Ephraim, in the hill country of the Amalekites."}]