[{"header":"Ephraim’s Jealousy"},{"num":12,"verse":"The men of Ephraim were summoned to fight. They crossed ⌞the Jordan River⌟ to Zaphon. They said to Jephthah, “Why did you fight against Ammon without inviting us to go with you? Now we’re going to burn your house down with you in it.”"},{"num":2,"verse":"Jephthah answered, “My people and I were involved in a legal dispute with Ammon. I asked you for help, but you didn’t rescue me from them. "},{"num":3,"verse":"When I saw that you would not rescue me, I risked my life and went to fight the people of Ammon. The Lord handed them over to me. So why did you come to fight against me today?”"},{"num":4,"verse":"Then Jephthah gathered all the men of Gilead and fought Ephraim. The men of Gilead defeated Ephraim. ⌞They did this because⌟ Ephraim had said, “You people from Gilead are nothing but fugitives from Ephraim and Manasseh.”"},{"num":5,"verse":"The men of Gilead captured the shallow crossings of the Jordan River leading back to Ephraim. Whenever a fugitive from Ephraim said, “Let me cross,” the men of Gilead would ask, “Are you from Ephraim?” If he answered, “No,” "},{"num":6,"verse":"they would tell him, “Say the word shibboleth.” If the fugitive would say sibboleth, because he couldn’t pronounce the word correctly, they would grab him and kill him at the shallow crossings of the Jordan River. At that time 42,000 men from Ephraim died."},{"num":7,"verse":"Jephthah judged Israel for six years. Then Jephthah of Gilead died and was buried in one of the cities of Gilead."},{"header":"Ibzan Serves as Judge"},{"num":8,"verse":"After Jephthah, Ibzan from Bethlehem judged Israel. "},{"num":9,"verse":"He had 30 sons and 30 daughters. His sons and daughters married people from outside their own families. He judged Israel for seven years. "},{"num":10,"verse":"When Ibzan died, he was buried in Bethlehem."},{"header":"Elon Serves as Judge"},{"num":11,"verse":"After Ibzan, Elon from the tribe of Zebulun judged Israel. He judged Israel for ten years. "},{"num":12,"verse":"When Elon died, he was buried in Aijalon in the territory of Zebulun."},{"header":"Abdon Serves as Judge"},{"num":13,"verse":"After Elon, Abdon, son of Hillel, from Pirathon judged Israel. "},{"num":14,"verse":"He had 40 sons and 30 grandsons who rode on 70 donkeys. He judged Israel for eight years. "},{"num":15,"verse":"When Abdon died, he was buried in Pirathon, in the territory of Ephraim, in the mountains of Amalek."}]