[{"header":"Jephthah Wins the Battle Over Ephraim"},{"num":12,"verse":"The troops of Ephraim were called out. The troops went across the Jordan River to Zaphon. When they arrived, they said to Jephthah, “You went to fight against the Ammonites. Why didn’t you ask us to go with you? We’re going to burn down your house over your head.”"},{"num":2,"verse":"Jephthah answered, “I and my people were taking part in a great struggle. We were at war with the Ammonites. I asked you for help. But you didn’t come to save me from their power. "},{"num":3,"verse":"I saw that you wouldn’t help. So I put my own life in danger. I went across the Jordan to fight against the Ammonites. The Lord helped me win the battle over them. So why have you come up today to fight against me?”"},{"num":4,"verse":"Then Jephthah called the men of Gilead together. They fought against Ephraim. The men of Gilead struck them down. The people of Ephraim had said, “You people of Gilead are nothing but deserters from Ephraim and Manasseh.” "},{"num":5,"verse":"The men of Gilead captured the places where people go across the Jordan River to get to Ephraim. Some men of Ephraim weren’t killed in the battle. When they arrived at the river, they would say, “Let us go across.” Then the men of Gilead would ask each one, “Are you from Ephraim?” Suppose he replied, “No.” "},{"num":6,"verse":"Then they would say, “All right. Say ‘Shibboleth.’ ” If he said “Sibboleth,” the way he said the word would give him away. He couldn’t say it correctly. So they would grab him. Then they would kill him at one of the places where people go across the Jordan. At that time, 42,000 men of Ephraim were killed."},{"num":7,"verse":"Jephthah led Israel for six years. Then he died. He was buried in a town in Gilead. Jephthah was from the land of Gilead."},{"header":"Ibzan, Elon and Abdon"},{"num":8,"verse":"After Jephthah, Ibzan from Bethlehem led Israel. "},{"num":9,"verse":"He had 30 sons and 30 daughters. He gave his daughters to be married to men who were outside his family group. He brought in 30 young women to be married to his sons. Those women also came from outside his family group. Ibzan led Israel for seven years. "},{"num":10,"verse":"Then he died. He was buried in Bethlehem."},{"num":11,"verse":"After Ibzan, Elon led Israel. He was from the tribe of Zebulun. Elon led Israel for ten years. "},{"num":12,"verse":"Then he died. He was buried in Aijalon. It was in the land of Zebulun."},{"num":13,"verse":"After Elon, Abdon led Israel. Abdon was the son of Hillel. Abdon was from Pirathon. "},{"num":14,"verse":"He had 40 sons and 30 grandsons. They rode on 70 donkeys. Abdon led Israel for eight years. "},{"num":15,"verse":"Then he died. He was buried at Pirathon in Ephraim. Pirathon was in the hill country of the Amalekites. Abdon was the son of Hillel."}]