[{"num":12,"verse":"And the ish Ephrayim gathered themselves together, and went into Tzafon, and said unto Yiftach, Wherefore passedst thou over to fight against the Bnei Ammon, and didst not call us to go with thee? We will burn thine bais upon thee with eish."},{"num":2,"verse":"And Yiftach said unto them, I and my people were at great strife with the Bnei Ammon; and when I called you, ye saved me not out of their hands."},{"num":3,"verse":"And when I saw that you were not my moshi’a, I put my nefesh in my hands, and passed over against the Bnei Ammon, and Hashem delivered them into my yad; why then are ye come up unto me this day, to fight against me?"},{"num":4,"verse":"Then Yiftach gathered together all the Anshei Gil‘ad, and fought with Ephrayim; and the anshei Gil‘ad struck down Ephrayim, because they said, Ye Gilead are fugitives of Ephrayim among the Ephrayim, and among the Menasheh."},{"num":5,"verse":"And the Gilead took the fords of the Yarden before the Ephrayim; and it was so, that when those Ephrayim which were escaped said, Let me cross over; that the anshei Gil‘ad said unto him, Art thou an Ephrati? If he said, No,"},{"num":6,"verse":"Then said they unto him, Say now Shibbolet; and he said Sibbolet, for he could not pronounce it right. Then they took him, and slaughtered him at the fords of the Yarden; and there fell at that time of the Ephrayim forty and two thousand."},{"num":7,"verse":"And Yiftach judged Yisroel shesh shanim. Then died Yiftach the Gileadi, and was buried in one of the towns of Gil‘ad."},{"num":8,"verse":"And after him Ibtzan of Beit-Lechem judged Yisroel."},{"num":9,"verse":"And he had shloshim banim, and shloshim banot, whom he gave away in marriage outside [his eleph], and took in sloshim banot from outside for his banim. And he judged Yisroel shevat shanim."},{"num":10,"verse":"Then died Ibtzan, and was buried at Beit-Lechem."},{"num":11,"verse":"And after him Elon, a Zevuloni, judged Yisroel; and he judged Yisroel eser shanim."},{"num":12,"verse":"And Elon the Zevuloni died, and was buried in Ayalon in Eretz Zevulun."},{"num":13,"verse":"And after him Avdon ben Hillel, a Piratoni, judged Yisroel."},{"num":14,"verse":"And he had arba’im banim and thirty grandsons, that rode on threescore and ten donkeys; and he judged Yisroel shmoneh shanim."},{"num":15,"verse":"And Avdon ben Hillel the Piratoni died, and was buried in Piraton in Eretz Ephrayim, in the har HaAmaleki."}]