[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(4) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The scorning.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The Hebrew offers a rare use of the article—probably it should be reproduced by our demonstrative, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "this scorning. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The LXX., however, have, “The scorn for those at ease, and the contempt for the proud,” which requires only the substitution of a letter, removes an anomaly in construction, and gives a better sense: “Let our desire be satisfied to the full with the scorn for those at ease, and the same contempt for the proud.” Notice how the figure is retained. The oppressors are the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "masters and mistresses, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "living in luxury, while the slaves wait. Gesenius quotes Sallust (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "secundis rebus ferox",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") in illustration of the wantonness of secure and luxurious power. As we read the verse, we seem to feel",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "“The whips and scorns of time,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The oppressor’s wrong, the proud man’s contumely.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "123:1-4 Confidence in God under contempt. - Our Lord Jesus has taught us to look unto God in prayer as our Father in heaven. In every prayer a good man lifts up his soul to God; especially when in trouble. We desire mercy from him; we hope he will show us mercy, and we will continue waiting on him till it come. The eyes of a servant are to his master's directing hand, expecting that he will appoint him his work. And also to his supplying hand. Servants look to their master or their mistress for their portion of meat in due season. And to God we must look for daily bread, for grace sufficient; from him we must receive it thankfully. Where can we look for help but to our Master? And, further, to his protecting hand. If the servant is wronged and injured in his work, who should right him, but his master? And to his correcting hand. Whither should sinners turn but to him that smote them? They humble themselves under God's mighty hand. And lastly, to his rewarding hand. Hypocrites look to the world's hand, thence they have their reward; but true Christians look to God as their Master and their Rewarder. God's people find little mercy with men; but this is their comfort, that with the Lord there is mercy. Scorning and contempt have been, are, and are likely to be, the lot of God's people in this world. It is hard to bear; but the servants of God should not complain if they are treated as his beloved Son was. Let us then, when ready to faint under trials, look unto Jesus, and by faith and prayer cast ourselves upon the mercy of God.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Our soul is exceedingly filled - Thoroughly sated. This verse states the nature and the source of the contempt which they were called to bear.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "With the scorning of those that are at ease - According to one view of these \"Psalms of Degrees\" (see the Introduction to Psalm 120:1-7) this would be an instance of an \"ascent\" in the sense, or of the going up of the thought, where in Psalm 123:3 there was mention made in general of \"contempt,\" and in this verse the thought is carried onward and upward, or there is an additional idea which gives intensity to it. It is the scorn proceeding from those who are at ease; that is, the frivolous, the affluent, the proud. The word scorning means derision, mockery. The idea in the Hebrew is derived from stammering, which the word properly means; and then, mockery, as repeating over the words of another, or imitating the voice of one in derision. Compare Psalm 2:4; Job 22:19. The phrase \"those that are at ease\" properly refers to those who are tranquil or quiet, Job 12:5; Isaiah 32:18; Isaiah 33:20; and then it is used of those who are living at ease; those who are living in self-indulgence and luxury, Amos 6:1; Isaiah 32:9, Isaiah 32:11. Here it would seem to refer to those who, in our language, are \"in easy circumstances;\" the affluent; those who are not compelled to toil: then, the frivolous, the fashionable, those in the upper walks of life. The contempt was aggravated by the fact that it came from that quarter; not from the low, the ignorant, the common, but from those who claimed to be refined, and who were distinguished in the world of gaiety, of rank, and of fashion. This, even for good people (such is human nature), is much more hard to bear than contempt is when it comes from those who are in the lower walks of life. In the latter case, perhaps, we feel that we can meet contempt with contempt; in the former we cannot. We disregard the opinions of those who are beneath us; there are few who are not affected by the opinions entertained of them by those who are above them.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "With the scorning of those that are at ease - According to one view of these \"Psalms of Degrees\" (see the Introduction to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 120:1-7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") this would be an instance of an \"ascent\" in the sense, or of the going up of the thought, where in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 123:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " there was mention made in general of \"contempt,\" and in this verse the thought is carried onward and upward, or there is an additional idea which gives intensity to it. It is the scorn proceeding from those who are at ease; that is, the frivolous, the affluent, the proud. The word scorning means derision, mockery. The idea in the Hebrew is derived from stammering, which the word properly means; and then, mockery, as repeating over the words of another, or imitating the voice of one in derision. Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 2:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 22:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The phrase \"those that are at ease\" properly refers to those who are tranquil or quiet, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 12:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 32:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 33:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and then it is used of those who are living at ease; those who are living in self-indulgence and luxury, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 6:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 32:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 32:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Here it would seem to refer to those who, in our language, are \"in easy circumstances;\" the affluent; those who are not compelled to toil: then, the frivolous, the fashionable, those in the upper walks of life. The contempt was aggravated by the fact that it came from that quarter; not from the low, the ignorant, the common, but from those who claimed to be refined, and who were distinguished in the world of gaiety, of rank, and of fashion. This, even for good people (such is human nature), is much more hard to bear than contempt is when it comes from those who are in the lower walks of life. In the latter case, perhaps, we feel that we can meet contempt with contempt; in the former we cannot. We disregard the opinions of those who are beneath us; there are few who are not affected by the opinions entertained of them by those who are above them.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And with the contempt of the proud - Those who are lifted up; either in rank, in condition, or in feeling. The essential idea is, that it was the contempt of those to whom mankind look up. Religious people have always had much of this to encounter, and often it is in fact a more severe test of the reality and power of religion than the loss of goods, or than bodily pains and penalties. We can bear much if we have the respect - the praise - of those above us; it is a very certain test of the reality and the power of our religion when we can bear the scorn of the great, the noble, the scientific, the frivolous, and the fashionable. Piety is more frequently checked and obscured by this than it is by persecution. It is more rare that piety shines brightly when the frivolous and the fashionable flown upon it than when princes attempt to crush it by power. The church has performed its duty better in the furnace of persecution than it has in the \"happy\" scenes of the world. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And with the contempt of the proud - Those who are lifted up; either in rank, in condition, or in feeling. The essential idea is, that it was the contempt of those to whom mankind look up. Religious people have always had much of this to encounter, and often it is in fact a more severe test of the reality and power of religion than the loss of goods, or than bodily pains and penalties. We can bear much if we have the respect - the praise - of those above us; it is a very certain test of the reality and the power of our religion when we can bear the scorn of the great, the noble, the scientific, the frivolous, and the fashionable. Piety is more frequently checked and obscured by this than it is by persecution. It is more rare that piety shines brightly when the frivolous and the fashionable flown upon it than when princes attempt to crush it by power. The church has performed its duty better in the furnace of persecution than it has in the \"happy\" scenes of the world. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "4. of those that are at ease—self-complacently, disregarding God's law, and despising His people.   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " With the scornful and contemptuous carriage of thine and our enemies, who live in great ease and glory, whilst we, thy people, are overwhelmed with manifold calamities. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Our soul is exceedingly filled with the scorning of those that are at ease,.... That are in easy and affluent circumstances; abound in the things of this world, and have more than heart can wish; have no outward trouble, as other men, or as the saints have; nor any uneasiness of mind, on account of sin and their eternal state: they have been at ease from their youth; Satan, that has the possession of them, keeps the goods in peace; and their consciences are seared as with a red hot iron, and they are past feeling; though they are far from having any true solid peace of mind: and such persons are generally scorners of the saints, and load them with their gibes and jeers in a most insolent manner; which makes it very irksome and grievous to bear; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and with the contempt of the proud: who are proud of their natural abilities; of their wealth and riches, and of their honours and high places: and such are generally scorners, and deal in proud wrath; and, through their pride, persecute the poor saints with their reproaches, and by other ways; see Proverbs 21:24. Some understand by these characters, \"that are at ease\", or \"quiet\" (f), and are \"proud\", or \"excellent\" (g), as the phrases may be rendered, such described by them as are the objects, and not the authors, of scorn and contempt; even the saints, who are the quiet in the land, and the excellent in the earth; those precious sons of Zion, who are disesteemed by the men of the world, Psalm 35:20. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and with the contempt of the proud: who are proud of their natural abilities; of their wealth and riches, and of their honours and high places: and such are generally scorners, and deal in proud wrath; and, through their pride, persecute the poor saints with their reproaches, and by other ways; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 21:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Some understand by these characters, \"that are at ease\", or \"quiet\" (f), and are \"proud\", or \"excellent\" (g), as the phrases may be rendered, such described by them as are the objects, and not the authors, of scorn and contempt; even the saints, who are the quiet in the land, and the excellent in the earth; those precious sons of Zion, who are disesteemed by the men of the world, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 35:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(f) \"pacatorum\", Montanus; \"tranquillorum\", Piscator, Cocceius, Gejerus, Michaelis. (g) \"excellentium\", Hammond; a rad. \"eminuit\", Gejerus; so an eminent Rabbi with the Jews is called \"Gaon\", as R. Saadiah Gaon, &c. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(f) \"pacatorum\", Montanus; \"tranquillorum\", Piscator, Cocceius, Gejerus, Michaelis. (g) \"excellentium\", Hammond; a rad. \"eminuit\", Gejerus; so an eminent Rabbi with the Jews is called \"Gaon\", as R. Saadiah Gaon, &c. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Our soul is exceedingly filled with the scorning of those that are at ease, and with the contempt of the proud.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Our soul is exceedingly filled",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The close resemblance of this clause to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 120:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in the use of a rare form of the adverb (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "rabbath",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and of the reflexive pronoun (lit. ‘filled ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for itself",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "’), may indicate that both Psalms were written by the same author.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "scorning",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "jeers",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The cognate verb is used in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nehemiah 2:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nehemiah 4:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “they jeered at us” … “they jeered at the Jews.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "those that are at ease",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Those who live in careless confident security, regardless alike of the judgements of God and the sufferings of men. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 12:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 6:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 1:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the proud",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] So the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "K’thîbh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": according to the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Q’rç",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the consonants are to be read as two words, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the proudest oppressors",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 4.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Our soul is exceedingly filled with the scorning of those that are at ease",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "e",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". the careless and irreligious (camp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 32:9, 11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 6:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "with the contempt of the proud",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This clause is exegetical of the last, not additional. Translate, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "the seining of those that are at ease - the contempt of the proud",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Psalm 123:4",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The second strophe takes up the \"be gracious unto us\" as it were in echo. It begins with a Kyrie eleison, which is confirmed in a crescendo manner after the form of steps. The church is already abundantly satiated with ignominy. רב is an abstract \"much,\" and רבּה, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 62:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", something great (vid., Bצttcher, Lehrbuch, ֗624). The subjectivizing, intensive להּ accords with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 120:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - probably an indication of one and the same author. בּוּז is strengthened by לעג, like בּז in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 36:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The article of הלּעג is restrospectively demonstrative: full of such scorn of the haughty (Ew. ֗290, d). הבּוּז is also retrospectively demonstrative; but since a repetition of the article for the fourth time would have been inelegant, the poet here says לגאיונים with the Lamed, which serves as a circumlocution of the genitive. The Masora reckons this word among the fifteen \"words that are written as one and are to be read as two.\" The Kerמ runs viz., לגאי יונים, superbis oppressorum (יונים, part. Kal, like היּונה ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zephaniah 3:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and frequently). But apart from the consideration that instead of גּאי, from the unknown גּאה, it might more readily be pointed גּאי, from גּאה (a form of nouns indicating defects, contracted גּא), this genitival construction appears to be far-fetched, and, inasmuch as it makes a distinction among the oppressors, inappropriate. The poet surely meant לגאיונים or לגּאיונים. This word גּאיון (after the form רעיון, אביון, עליון) is perhaps an intentional new formation of the poet. Saadia interprets it after the Talmudic לגיון, legio; but how could one expect to find such a Grecized Latin word (λεγεών) in the Psalter! dunash ben-Labrat (about 960) regards גאיונים as a compound word in the signification of הגּאים היונים. In fact the poet may have chosen the otherwise unused adjectival form גּאיונים because it reminds one of יונים, although it is not a compound word like דּביונים. If the Psalm is a Maccabaean Psalm, it is natural to find in לגאיונים an allusion to the despotic domination of the יונים. ",
        "children": []
      }
    ]
  }
]