[[],[{"type":"header","content":"Elisha Promises Food"},{"type":"prose","content":"Then Elisha said, “Hear the word of the LORD. Thus says the LORD, ‘Tomorrow about this time a measure of finely-milled flour will sell for a shekel, and two measures of barley for a shekel, at the gate of Samaria.’” "}],[{"type":"prose","content":"Then the royal officer on whose arm the king leaned answered the man of God and said, “If the LORD should make windows in heaven [for the rain], could this thing take place?” Elisha said, “Behold, you will see it with your own eyes, but [because you doubt] you will not eat of it.”"}],[{"type":"header","content":"Four Lepers Relate Arameans’ Flight"},{"type":"prose","content":"Now four men who were lepers were at the entrance of the [city’s] gate; and they said to one another, “Why should we sit here until we die? "}],[{"type":"prose","content":"If we say, ‘We will enter the city’—then the famine is in the city and we will die there; and if we sit still here, we will also die. So now come, let us go over to the camp of the Arameans (Syrians). If they let us live, we will live; and if they kill us, we will only die.” "}],[{"type":"prose","content":"So they got up at twilight to go to the Aramean camp. But when they came to the edge of the camp, there was no one there. "}],[{"type":"prose","content":"For the LORD had caused the Aramean army to hear the sound of chariots, and the sound of horses, the sound of a great army. They had said to one another, “The king of Israel has hired against us the kings of the Hittites, and the kings of the Egyptians, to come [and fight] against us.” "}],[{"type":"prose","content":"So the Arameans set out and fled during the twilight, and left their tents, horses, and donkeys,  the camp just as it was, and fled for their lives. "}],[{"type":"prose","content":"When these lepers came to the edge of the camp, they went into one tent and ate and drank, and carried away from there silver, gold, and clothing, and went and hid them. Then they went back and entered another tent and carried [some valuable things] from there , and went and hid them."}],[{"type":"prose","content":"Then they said one to another, “We are not doing the right thing. This is a day of good news, yet we are keeping silent. If we wait until the morning light, some punishment [for not reporting this now] will come on us. So now come, let us go and tell the king’s household.” "}],[{"type":"prose","content":"So they came and called to the gatekeepers of the city. They told them, “We went to the camp of the Arameans (Syrians), and behold, there was no one there, nor the sound of man there—only the horses and donkeys tied up, and the tents [had been left] just as they were.” "}],[{"type":"prose","content":"Then the gatekeepers called out and it was reported to the king’s household inside [the city]. "}],[{"type":"prose","content":"Then the king got up in the night and said to his servants, “I will tell you what the Arameans have done to us. They know that we are hungry; so they have left the camp to hide themselves in the open country, thinking, ‘When they come out of the city, we shall take them alive and get into the city.’” "}],[{"type":"prose","content":"One of his servants replied, “Please let some  take five of the horses which remain inside the city. Consider this: [if they are caught then at worst] they will be like all the people of Israel who are left in the city; [even if they are killed then] they will be like all the people of Israel who have already died. So let us send [them] and see [what happens].” "}],[{"type":"prose","content":"So they took two chariots with horses, and the king sent them after the Aramean army, saying, “Go and see.”"}],[{"type":"header","content":"The Promise Fulfilled"},{"type":"prose","content":"They went after them to the Jordan, and all the road was entirely littered with clothing and equipment which the Arameans (Syrians) had thrown away when they hurriedly fled. And the messengers returned and told the king."}],[{"type":"prose","content":"Then the people [of Israel] went out and plundered the camp of the Arameans. So [goods were so plentiful that] a measure of finely-milled flour [was sold] for a shekel, and two measures of barley for a shekel, in accordance with the word of the LORD [as spoken through Elisha]. "}],[{"type":"prose","content":"Now the king had appointed the royal officer on whose arm he leaned to be in charge of the [city] gate; and the [starving] people trampled him at the gate [as they struggled to get through for food], and he died, just as the man of God had foretold when the king came down to him. "}],[{"type":"prose","content":"It happened just as [Elisha] the man of God had spoken to the king, saying, “Two measures of barley will be sold for a shekel and a measure of finely-milled flour for a shekel tomorrow about this time at the gate of Samaria.” "}],[{"type":"prose","content":"The royal officer had answered the man of God and said, “Now behold, [even] if the LORD should make windows in heaven, could such a thing happen?” And Elisha had answered, “You will see it with your own eyes, but [because of your doubt] you will not eat it.” "}],[{"type":"prose","content":"And so it happened to him; for the people trampled him at the gate, and he died."}]]