[{"num":1,"verse":"King David grew old, the years took their toll, and he couldn’t get warm even when they covered him with bedclothes. "},{"num":2,"verse":"His servants said to him, “Let us try to find a young virgin for my lord the king. She can wait on the king and be a companion for him, and she can lie next to you, so that my lord the king will get some heat.” "},{"num":3,"verse":"After looking through all of Isra’el’s territory for a beautiful girl, they found Avishag the Shunamit and brought her to the king. "},{"num":4,"verse":"The girl was very beautiful and became a companion for the king. She took care of him, but the king did not have sexual relations with her."},{"num":5,"verse":"Adoniyah the son of Haggit was beginning to claim that he would be king; to this end he organized chariots and horsemen, with fifty men to run ahead of him. "},{"num":6,"verse":"(His father had never in his life confronted him by asking, “Why are you behaving this way?” Moreover, he was a very handsome man; he was born next after Avshalom.) "},{"num":7,"verse":"He conferred with Yo’av the son of Tz’ruyah and Evyatar the cohen; and they both supported Adoniyah. "},{"num":8,"verse":"But Tzadok the cohen, B’nayah the son of Y’hoyada, Natan the prophet, Shim‘i, Re‘i and David’s elite guard were not on Adoniyah’s side."},{"num":9,"verse":"One day Adoniyah killed sheep, oxen and fattened calves at the Stone of Zochelet, by ‘Ein-Rogel. He summoned all his brothers the king’s sons, and all the men of Y’hudah the king’s servants; "},{"num":10,"verse":"but he did not summon Natan the prophet, B’nayah, the elite guard or Shlomo his brother."},{"num":11,"verse":"Natan went to Bat-Sheva the mother of Shlomo and said, “Haven’t you heard that Adoniyah the son of Haggit has become king without the knowledge of David our lord? "},{"num":12,"verse":"Now, come, please let me give you advice, so that you can save both your own life and that of your son Shlomo. "},{"num":13,"verse":"Go, get in to see King David, and say to him, ‘My lord, king, didn’t you swear to your servant, “Your son Shlomo will be king after me; he will sit on my throne”? So why is Adoniyah king?’ "},{"num":14,"verse":"Right then, while you are still talking with the king, I will also come in after you and confirm what you are saying.”"},{"num":15,"verse":"Bat-Sheva went in to the king in his room. (The king was very old; Avishag the Shunamit was in attendance on the king.) "},{"num":16,"verse":"Bat-Sheva bowed, prostrating herself to the king. The king asked, “What do you want?” "},{"num":17,"verse":"She answered him, “My lord, you swore by Adonai your God to your servant, ‘Your son Shlomo will be king after me; he will sit on my throne.’ "},{"num":18,"verse":"But now, here is Adoniyah ruling as king; and you, my lord the king, don’t know anything about it. "},{"num":19,"verse":"He has killed oxen, fattened calves and sheep in great numbers; and he has summoned all the sons of the king, Evyatar the cohen and Yo’av the commander of the army; but he didn’t summon Shlomo your servant. "},{"num":20,"verse":"As for you, my lord the king, all Isra’el is watching you; they are waiting for you to tell them who is to sit on the throne of my lord the king after him. "},{"num":21,"verse":"If you don’t, then, when my lord the king sleeps with his ancestors, I and my son Shlomo will be considered criminals.”"},{"num":22,"verse":"Right then, while she was still talking with the king, Natan the prophet entered. "},{"num":23,"verse":"They told the king, “Natan the prophet is here.” After coming into the king’s presence, he prostrated himself before the king with his face to the ground. "},{"num":24,"verse":"Natan said, “My lord king, did you say, ‘Adoniyah is to be king after me; he will sit on my throne’? "},{"num":25,"verse":"For he has gone down today and killed oxen, fattened calves and sheep in great numbers; and he has summoned all the king’s sons, the commanders of the army and Evyatar the cohen; right now they are eating and drinking in his presence and proclaiming, ‘Long live King Adoniyah!’ "},{"num":26,"verse":"But he didn’t summon me your servant, or Tzadok the cohen, or B’nayah the son of Y’hoyada or your servant Shlomo. "},{"num":27,"verse":"Is this authorized by my lord the king without your having told your servant who would sit on the throne of my lord the king after him?”"},{"num":28,"verse":"King David answered by saying, “Summon Bat-Sheva to me.” She entered the king’s presence and stood before the king. "},{"num":29,"verse":"Then the king swore an oath: “As Adonai lives, who has delivered me from all adversity, "},{"num":30,"verse":"as I swore to you by Adonai the God of Isra’el, ‘Your son Shlomo will be king after me; he will sit on my throne in my place,’ so will I do today.” "},{"num":31,"verse":"Bat-Sheva bowed with her face to the ground, prostrating herself to the king, and said, “Let my lord King David live forever.”"},{"num":32,"verse":"King David said, “Summon Tzadok the cohen, Natan the prophet and B’nayah the son of Y’hoyada.” They came before the king. "},{"num":33,"verse":"The king said to them, “Take with you the servants of your lord, have Shlomo my son ride on my own mule and bring him down to Gichon. "},{"num":34,"verse":"There Tzadok the cohen and Natan the prophet are to anoint him king over Isra’el. Sound the shofar and say, “Long live King Shlomo!” "},{"num":35,"verse":"Then escort him back; he is to come and sit on my throne; for he is to take my place as king. I have appointed him to rule over Isra’el and Y’hudah.” "},{"num":36,"verse":"B’nayah responded to the king by saying, “Amen! May Adonai, the God of my lord the king, confirm it! "},{"num":37,"verse":"Just as Adonai has been with my lord the king, so may he be with Shlomo and make his throne even greater than the throne of my lord King David!”"},{"num":38,"verse":"So Tzadok the cohen, Natan the prophet, B’nayah the son of Y’hoyada and the K’reti and P’leti went down, had Shlomo ride on King David’s mule and brought him to Gichon. "},{"num":39,"verse":"Tzadok the cohen took the horn of olive oil out of the tent and anointed Shlomo. They sounded the shofar, and all the people shouted, “Long live King Shlomo!” "},{"num":40,"verse":"All the people escorted him back, playing flutes and rejoicing greatly, so that the earth shook with the sound."},{"num":41,"verse":"Adoniyah and all his guests heard it while they were finishing their meal; but it was Yo’av who, when he heard the blast on the shofar, asked, “That noise — what’s the meaning of this uproar in the city?” "},{"num":42,"verse":"While he was still speaking, there came Yonatan the son of Evyatar the cohen. Adoniyah said, “Come in! You’re a worthy man, so you must be bringing good news!” "},{"num":43,"verse":"Yonatan answered Adoniyah, “The truth is, our lord King David has made Shlomo king. "},{"num":44,"verse":"Moreover, the king sent with him Tzadok the cohen, Natan the prophet, B’nayah the son of Y’hoyada and the K’reti and P’leti; they had him ride on the king’s mule; "},{"num":45,"verse":"and Tzadok the cohen and Natan the prophet anointed him king in Gichon. Then they escorted him back from there rejoicing, so that the city is in an uproar; this is the noise you’ve been hearing. "},{"num":46,"verse":"Moreover, Shlomo is now sitting on the throne of the kingdom. "},{"num":47,"verse":"More than that, the king’s servants came and blessed our lord King David with these words: ‘May God make the name of Shlomo better than your name and his throne greater than your throne,’ after which the king bowed down on the bed. "},{"num":48,"verse":"Finally, the king said, ‘Blessed be Adonai the God of Isra’el, who has given someone to sit on my throne today, when my own eyes can see it.’”"},{"num":49,"verse":"At this all Adoniyah’s guests grew frightened; they got up, everyone going his own way. "},{"num":50,"verse":"Adoniyah too was afraid because of Shlomo; he got up, went and took hold of the horns of the altar. "},{"num":51,"verse":"Shlomo was told, “Here, Adoniyah is terrified of King Shlomo; he has grabbed hold of the horns of the altar and is saying, ‘First let King Shlomo swear to me that he will not have his servant executed.’” "},{"num":52,"verse":"Shlomo said, “If he will demonstrate that he is a worthy man, not a hair of his will fall to the earth. But if he is found making trouble, he will die.” "},{"num":53,"verse":"So King Shlomo sent, and they brought him down from the altar. He came and prostrated himself before King Shlomo; and Shlomo said to him, ‘Go on home.’”"}]