[{"header":"Chapter 1"},{"num":1,"verse":"Help for King David. Now King David was old, well on in years. They would cover him up, but he could not get warm."},{"num":2,"verse":"So his servants said to him, “My lord, the king, let a young virgin be found for you to attend to you and to care for you. She can lie alongside of you so that my lord, the king, can keep warm.”"},{"num":3,"verse":"And so they searched for a beautiful young woman all throughout the territory of Israel, and they found Abishag the Shunamite, and they brought her to the king."},{"num":4,"verse":"The young woman was very beautiful, and she cared for the king. She served the king, but he did not have intimate relations with her."},{"num":5,"verse":"Adonijah’s Plan. Adonijah, the son of Haggith, exulted himself saying, “I will be king.” He had his own chariots and horsemen, and he had fifty men to run in front of him."},{"num":6,"verse":"His father never rebuked him by saying, “Why have you done this?” He was very handsome, and he had been born after Absalom."},{"num":7,"verse":"Adonijah conferred with Joab, the son of Zeruiah, and with Abiathar the priest, and they helped Adonijah and followed after him."},{"num":8,"verse":"But Zadok the priest, Benaiah, the son of Jehoiada, Nathan the prophet, and Shimei and Rei, David’s brave warriors, did not side with Adonijah."},{"num":9,"verse":"Adonijah sacrificed some sheep, oxen, and fatted calves at the stone of Zoheleth in En-rogel. He invited all of his brethren, the king’s sons, and all of the men of Judah, the king’s servants,"},{"num":10,"verse":"but he did not invite Nathan the prophet, Benaiah, the king’s brave men, or Solomon, his brother."},{"num":11,"verse":"Solomon Becomes King. Nathan, therefore, spoke to Bathsheba, Solomon’s mother, saying, “Have you not heard that Adonijah, the son of Haggith, is reigning, and our lord David does not know about it."},{"num":12,"verse":"Come and let me give you counsel, so that I may save my own life and the life of your son Solomon."},{"num":13,"verse":"“Go at once to King David and say to him, ‘Did not my lord, the king, make an oath to your handmaid, saying, “Solomon, your son, will reign after me and will sit upon my throne? Why, then, is Adonijah reigning?”"},{"num":14,"verse":"While you are still speaking with the king, I will arrive and confirm your words.’ ”"},{"num":15,"verse":"So Bathsheba went into the king’s chamber. Now the king was very old, and Abishag the Shunamite served the king."},{"num":16,"verse":"Bathsheba bowed down, paying obeisance to the king, and the king said, “What do you want?”"},{"num":17,"verse":"She said to him, “My lord, you made an oath to your handmaid by the Lord, your God, saying, ‘Solomon, your son, will reign after me, and he will sit upon my throne.’"},{"num":18,"verse":"But now Adonijah is reigning, and my king does not know about it."},{"num":19,"verse":"He has sacrificed many oxen, fatted calves, and sheep, and he has invited all of the king’s sons, Abiathar the priest, and Joab the commander of the army, but he did not invite your servant Solomon."},{"num":20,"verse":"“Now, my lord, the king, the eyes of all of Israel are upon you. They want you to tell them who will sit upon your throne, my lord, the king."},{"num":21,"verse":"Otherwise when my lord, the king, sleeps with his fathers, I and Solomon, my son, will be condemned.”"},{"num":22,"verse":"While she was still speaking with the king, Nathan the prophet entered."},{"num":23,"verse":"They announced to the king, “Nathan the prophet.” He came before the king and bowed down with his face to the ground before the king."},{"num":24,"verse":"Nathan said, “Has my lord, the king, said, ‘Adonijah will rule after me and he will sit upon my throne?’"},{"num":25,"verse":"Today he went down and sacrificed many oxen, fatted calves, and sheep, and he invited all of the king’s sons, the captains of the army, and Abiathar the priest. They are eating and drinking with him, and they are saying, ‘Long live King Adonijah!’"},{"num":26,"verse":"But he did not invite myself, your servant, Zadok the priest, Benaiah, the son of Jehoiada, nor Solomon, your servant."},{"num":27,"verse":"Has my lord, the king, done this thing without informing your servant about who is to sit upon your throne after you, O lord, my king?”"},{"num":28,"verse":"Then King David said, “Summon Bathsheba.” She came into the king’s presence and stood before the king."},{"num":29,"verse":"The king then swore an oath, saying, “As the Lord lives who has delivered me from all of my adversities,"},{"num":30,"verse":"and as I swore to you by the Lord, the God of Israel saying, ‘Solomon, your son, will reign after me, and he will sit upon my throne in my place,’ I will fulfill it today.”"},{"num":31,"verse":"Bathsheba bowed down with her face to the ground and did obeisance saying, “May my lord, King David, live forever.”"},{"num":32,"verse":"King David said, “Summon Zadok the priest, Nathan the prophet, and Benaiah, the son of Jehoiada, to me.” They came before the king."},{"num":33,"verse":"The king said to them, “Take your lord’s servants and put Solomon, my son, on my own donkey and bring him to Gihon."},{"num":34,"verse":"There, have Zadok the priest and Nathan the prophet anoint him as king over Israel. Sound your trumpet and proclaim, ‘Long live, King Solomon.’"},{"num":35,"verse":"Then follow him back up so that he might come and sit upon my throne, for he will take my place as king. I have chosen him to be the king over Israel and Judah.”"},{"num":36,"verse":"Benaiah, the son of Jehoiada, answered the king saying, “Amen! May the Lord, the God of my lord, the king, confirm it."},{"num":37,"verse":"May the Lord be with Solomon just as he has been with my lord, the king. May he make his throne greater than the throne of my lord, king David.”"},{"num":38,"verse":"So Zadok the priest, Nathan the prophet, Benaiah, the son of Jehoiada, the Cherethites, and the Pelethites went down. They had Solomon ride upon King David’s donkey, and they brought him to Gihon."},{"num":39,"verse":"Zadok the priest took a horn of oil out from the tabernacle and he anointed Solomon. They sounded the trumpet and all of the people proclaimed, “Long live, King Solomon.”"},{"num":40,"verse":"All of the people went up and joined his following, and they played upon flutes and so greatly rejoiced that the ground shook from the noise."},{"num":41,"verse":"Adonijah Acknowledges Solomon. Adonijah and all of those whom he had invited to be with him finished eating and heard it. When Joab heard the sound of the trumpet, he asked, “What is this uproar coming from the city?”"},{"num":42,"verse":"While he was still speaking, Jonathan, the son of Abiathar the priest arrived. Adonijah said, “Come in, for a brave man like you must bring good news.”"},{"num":43,"verse":"Jonathan answered Adonijah saying, “It is not so! Our Lord, king David, has made Solomon king."},{"num":44,"verse":"The king sent him with Zadok the priest, Nathan the prophet, Benaiah, the son of Jehoiada, the Cherethites, and the Pelethites,"},{"num":45,"verse":"and Zadok, the priest, and Nathan the prophet anointed him in Gihon. They are coming up from there rejoicing so that the city resounds with it. This is the noise that you heard."},{"num":46,"verse":"Moreover, Solomon is sitting upon the royal throne."},{"num":47,"verse":"“The king’s servants have come to bless our lord, King David, saying, ‘May God make the name of Solomon greater than your name, and his throne than your throne.’ The king then worshiped in his bed"},{"num":48,"verse":"and the king said, ‘Blessed be the Lord, the God of Israel, who has allowed me to see with my own eyes the one who will sit upon my throne.’ ”"},{"num":49,"verse":"All of those whom Adonijah had invited became frightened, and they rose up and they each went his own way."},{"num":50,"verse":"But Adonijah, because he feared Solomon, got up and went and took hold of the horns of the altar."},{"num":51,"verse":"Solomon was told, “Adonijah is afraid of King Solomon, for he has taken hold of the horns of the altar saying, ‘Let King Solomon swear an oath to me today that he will not harm his servant.’ ”"},{"num":52,"verse":"Solomon replied, “If he shows himself to be a man of virtue, then not one of his hairs will fall to the ground. But if he proves to be wicked, he will die!”"},{"num":53,"verse":"So King Solomon sent and had him brought down from the altar. He came and bowed down to King Solomon, and Solomon said to him, “Go home.”"}]