[{"header":"Chapter 34"},{"num":1,"verse":"The Incident at Shechem. Dinah, the daughter whom Leah had borne for Jacob, went out to see the young women of the country."},{"num":2,"verse":"When Shechem, the son of Hamor the Hivite, the prince of the land, saw her, he seized her and laid with her and defiled her."},{"num":3,"verse":"He was deeply attracted to Dinah, the daughter of Jacob. He loved the young woman and spoke comforting words to her."},{"num":4,"verse":"Then he said to Hamor, his father, “Arrange for me to take this woman as a wife.”"},{"num":5,"verse":"When Jacob learned that Dinah, his daughter, had been defiled, his sons were in the countryside with the animals. So he remained silent until they returned."},{"num":6,"verse":"Hamor, the father of Shechem, came to Jacob to speak to him."},{"num":7,"verse":"When the sons of Jacob returned from the countryside, they heard what had happened. They were furious and very indignant because he had done this outrage in Israel, sleeping with a daughter of Jacob. One did not do these things!"},{"num":8,"verse":"Hamor said to them, “Shechem, my son, is in love with your daughter. Please give her to him in marriage."},{"num":9,"verse":"Why not intermarry with us? You give us your daughters, and you can take our daughters for yourselves."},{"num":10,"verse":"You can live with us, and the land will be at your disposal. Reside here, move about freely, and buy property.”"},{"num":11,"verse":"Shechem said to Dinah’s father and her brothers, “Tell me what I can give you in order to find favor in your sight."},{"num":12,"verse":"You can even raise my bridal price greatly and the value of the due gifts. I will give you whatever you ask. Only give me the young woman as my wife.”"},{"num":13,"verse":"The sons of Jacob answered Shechem and his father Hamor deceitfully, for they had dishonored their sister Dinah."},{"num":14,"verse":"They told them, “We cannot do this; we cannot give our sister to a man who is not circumcised. This would dishonor us."},{"num":15,"verse":"We will only grant your request if you become like us, if all of you circumcise your male members."},{"num":16,"verse":"Then we will give you our daughters, and you can give us yours. We will live with you, and we can become a single people."},{"num":17,"verse":"But if you will not listen to our proposal concerning circumcising yourselves, then we will take our daughter and go away.”"},{"num":18,"verse":"Their words pleased Hamor and Shechem, the son of Hamor."},{"num":19,"verse":"The young man did not waste any time in doing this thing, for he loved the daughter of Jacob. He was also the most honored member of the household of his father."},{"num":20,"verse":"Hamor and his son Shechem therefore went to the gate of the city and spoke to the men of the city, saying,"},{"num":21,"verse":"“These men are peaceful. Let them live with us in the land and move about freely. There is ample space in every direction. We can take their daughters for wives and we can give them ours."},{"num":22,"verse":"But there is one condition before these men will agree to live with us to become a single people: that we circumcise each of our males as they themselves are circumcised."},{"num":23,"verse":"Would not their herds, their riches, and all their animals then be ours? Let us agree to their proposal, and they will then live with us.”"},{"num":24,"verse":"All those who were near the gate of the city listened to Hamor and his son Shechem. All the men, everyone who had access to the gate of the city, had themselves circumcised."},{"num":25,"verse":"On the third day, when they were still sore, two of the sons of Jacob, Simeon and Levi, the brothers of Dinah, took swords, entered the city boldly, and killed all the men."},{"num":26,"verse":"They put Hamor and his son Shechem to the sword, took Dinah out of the house of Shechem, and left."},{"num":27,"verse":"The other sons of Jacob came upon the bodies and sacked the city because their sister had been dishonored."},{"num":28,"verse":"They took their flocks and their herds, their donkeys and whatever they had in the city and in the countryside."},{"num":29,"verse":"They carried off all their possessions as booty, sacking whatever was in their houses."},{"num":30,"verse":"Jacob said to Simeon and Levi, “You have placed me in a very difficult situation, making me hateful to the inhabitants of this land, to the Canaanites and the Perizzites, and I only have a few men with me. They will unite against me, and defeat me, and annihilate me and my household.”"},{"num":31,"verse":"But they answered, “Should our sister be treated as a harlot?”"}]