[{"header":"Dinah Is Raped"},{"num":34,"verse":"Dinah, daughter of Leah and Jacob, went out to visit some of the Canaanite women. "},{"num":2,"verse":"When Shechem, son of the local ruler Hamor the Hivite, saw her, he took her and raped her. "},{"num":3,"verse":"He became very fond of Jacob’s daughter Dinah. He loved the girl and spoke tenderly to her."},{"num":4,"verse":"So Shechem said to his father Hamor, “Get me this girl for my wife.”"},{"num":5,"verse":"Jacob heard that Shechem had dishonored his daughter Dinah. His sons were with his livestock out in the open country, so Jacob kept quiet until they came home."},{"num":6,"verse":"So Shechem’s father Hamor came to Jacob to speak with him. "},{"num":7,"verse":"Jacob’s sons came in from the open country as soon as they heard the news. The men felt outraged and very angry because Shechem had committed such a godless act against Israel’s family by raping Jacob’s daughter. This shouldn’t have happened."},{"num":8,"verse":"Hamor told them. “My son Shechem has his heart set on your daughter. Please let her marry him. "},{"num":9,"verse":"Intermarry with us; give your daughters to us, and take ours for yourselves. "},{"num":10,"verse":"You can live with us, and the land will be yours. Live here, move about freely in this area, and acquire property here.”"},{"num":11,"verse":"Then Shechem said to Dinah’s father and her brothers, “Do me this favor. I’ll give you whatever you ask. "},{"num":12,"verse":"Set the price I must pay for the bride and the gift I must give her as high as you want. I’ll pay exactly what you tell me. Give me the girl as my wife.”"},{"num":13,"verse":"Then Jacob’s sons gave Shechem and his father Hamor a misleading answer because he had dishonored their sister Dinah. "},{"num":14,"verse":"They said, “We can’t do this. We can’t give our sister to a man who is uncircumcised. That would be a disgrace to us! "},{"num":15,"verse":"We will give our consent to you only on one condition: Every male must be circumcised as we are. "},{"num":16,"verse":"Then we’ll give our daughters to you and take yours for ourselves, and we’ll live with you and become one people. "},{"num":17,"verse":"If you won’t agree to be circumcised, we’ll take our daughter and go.”"},{"num":18,"verse":"Their proposal seemed good to Hamor and his son Shechem. "},{"num":19,"verse":"The young man didn’t waste any time in doing what they said because he took such pleasure in Jacob’s daughter. He was the most honored person in all his father’s family."},{"num":20,"verse":"So Hamor and his son Shechem went to their city gate to speak to the men of their city. They said, "},{"num":21,"verse":"“These people are friendly toward us, so let them live in our land and move about freely in the area. Look, there’s plenty of room in this land for them. We can marry their daughters and let them marry ours. "},{"num":22,"verse":"These people will consent to live with us and become one nation on one condition: Every male must be circumcised as they are. "},{"num":23,"verse":"Won’t their livestock, their personal property, and all their animals be ours? We only need to agree to do this for them. Then they’ll live with us.”"},{"num":24,"verse":"All the men who had come out to the city gate agreed with Hamor and his son Shechem. So they were all circumcised at the city gate."},{"num":25,"verse":"Two days later, while the men were still in pain, two of Jacob’s sons, Simeon and Levi, Dinah’s brothers, took their swords and boldly attacked the city. They killed every man "},{"num":26,"verse":"including Hamor and his son Shechem. They took Dinah from Shechem’s home and left. "},{"num":27,"verse":"Then Jacob’s sons stripped the corpses and looted the city where their sister had been dishonored. "},{"num":28,"verse":"They took the sheep and goats, cattle, donkeys, and whatever else was in the city or out in the fields. "},{"num":29,"verse":"They carried off all the wealth and all the women and children and looted everything in the houses."},{"num":30,"verse":"Then Jacob said to Simeon and Levi, “You have caused me a lot of trouble! You’ve made the people living in the area, the Canaanites and the Perizzites, hate me. There are only a few of us. If they join forces against me and attack me, my family and I will be wiped out.”"},{"num":31,"verse":"Simeon and Levi asked, “Should Shechem have been allowed to treat our sister like a prostitute?”"}]