[{"num":12,"verse":"He that loveth correction, loveth knowledge: but he that hateth reproof is foolish."},{"num":2,"verse":"He that is good, shall draw grace from the Lord: but he that trusteth in his own devices doth wickedly."},{"num":3,"verse":"Men shall not be strengthened by wickedness: and the root of the just shall not be moved."},{"num":4,"verse":"A diligent woman is a crown to her husband: and she that doth things worthy of confusion, is a rottenness in his bones."},{"num":5,"verse":"The thoughts of the just are judgments: and the counsels of the wicked are deceitful."},{"num":6,"verse":"The words of the wicked lie in wait for blood: the mouth of the just shall deliver them."},{"num":7,"verse":"Turn the wicked, and they shall not be: but the house of the just shall stand firm."},{"num":8,"verse":"A man shall be known by his learning: but he that is vain and foolish, shall be exposed to contempt."},{"num":9,"verse":"Better is the poor man that provideth for himself, than he that is glorious and wanteth bread."},{"num":10,"verse":"The just regardeth the lives of his beasts: but the bowels of the wicked are cruel."},{"num":11,"verse":"He that tilleth his land shall be satisfied with bread: but he that pursueth idleness is very foolish. He that is delighted in passing his time over wine, leaveth a reproach in his strong holds."},{"num":12,"verse":"The desire of the wicked is the fortification of evil men: but the root of the just shall prosper."},{"num":13,"verse":"For the sins of the lips ruin draweth nigh to the evil man: but the just shall escape out of distress."},{"num":14,"verse":"By the fruit of his own mouth shall a man be filled with good things, and according to the works of his hands it shall be repaid him."},{"num":15,"verse":"The way of a fool is right in his own eyes: but he that is wise hearkeneth unto counsels."},{"num":16,"verse":"A fool immediately sheweth his anger: but he that dissembleth injuries is wise."},{"num":17,"verse":"He that speaketh that which he knoweth, sheweth forth justice: but he that lieth, is a deceitful witness."},{"num":18,"verse":"There is that promiseth, and is pricked as it were with a sword of conscience: but the tongue of the wise is health."},{"num":19,"verse":"The lip of truth shall be steadfast for ever: but he that is a hasty witness, frameth a lying tongue."},{"num":20,"verse":"Deceit is in the heart of them that think evil things: but joy followeth them that take counsels of peace."},{"num":21,"verse":"Whatsoever shall befall the just man. it shall not make him sad: but the wicked shall be filled with mischief."},{"num":22,"verse":"Lying lips are an abomination to the Lord: but they that deal faithfully please him."},{"num":23,"verse":"A cautious man concealeth knowledge: and the heart of fools publisheth folly."},{"num":24,"verse":"The hand of the valiant shall bear rule: but that which is slothful, shall be under tribute."},{"num":25,"verse":"Grief in the heart of a man shall bring him low, but with a good word he shall be made glad."},{"num":26,"verse":"He that neglecteth a loss for the sake of a friend, is just: but the way of the wicked shall deceive them."},{"num":27,"verse":"The deceitful man shall not find gain: but the substance of a just man shall be precious gold."},{"num":28,"verse":"In the path of justice is life: but the by-way leadeth to death."}]