[{"num":12,"verse":"Whoso loveth instruction loveth knowledge, but he that hateth reproof is brutish."},{"num":2,"verse":"A good man obtaineth favor of the Lord, but a man of wicked devices will He condemn."},{"num":3,"verse":"A man shall not be established by wickedness, but the root of the righteous shall not be moved."},{"num":4,"verse":"A virtuous woman is a crown to her husband, but she that causeth shame is rottenness in his bones."},{"num":5,"verse":"The thoughts of the righteous are right, but the counsels of the wicked are deceit."},{"num":6,"verse":"The counsels of the wicked are to lie in wait for blood, but the mouths of the upright shall deliver them."},{"num":7,"verse":"The wicked are overthrown and are no more, but the house of the righteous shall stand."},{"num":8,"verse":"A man shall be commended according to his wisdom, but he that is of a perverse heart shall be despised."},{"num":9,"verse":"He that is lowly and hath a servant is better off than he that honoreth himself and lacketh bread."},{"num":10,"verse":"A righteous man hath regard for the life of his beast, but the tender mercies of the wicked are cruel."},{"num":11,"verse":"He that tilleth his land shall be satisfied with bread, but he that followeth vain persons is void of understanding."},{"num":12,"verse":"The wicked desireth the net of evil men, but the root of the righteous yieldeth fruit."},{"num":13,"verse":"The wicked is snared by the transgression of his lips, but the just shall come out of trouble."},{"num":14,"verse":"A man shall be satisfied with good by the fruit of his mouth, and the recompense of a man’s hands shall be rendered unto him."},{"num":15,"verse":"The way of a fool is right in his own eyes, but he that hearkeneth unto counsel is wise."},{"num":16,"verse":"A fool’s wrath is known at once, but a prudent man covereth shame."},{"num":17,"verse":"He that speaketh truth showeth forth righteousness, but a false witness, deceit."},{"num":18,"verse":"There is he that speaketh like the piercings of a sword, but the tongue of the wise is healing."},{"num":19,"verse":"The lips of truth shall be established for ever, but a lying tongue is but for a moment."},{"num":20,"verse":"Deceit is in the heart of them that imagine evil, but to the counselors of peace there is joy."},{"num":21,"verse":"There shall no evil happen to the just, but the wicked shall be filled with troubles."},{"num":22,"verse":"Lying lips are an abomination to the Lord, but they that deal truly are His delight."},{"num":23,"verse":"A prudent man concealeth knowledge, but the heart of fools proclaimeth foolishness."},{"num":24,"verse":"The hand of the diligent shall exercise rule, but the slothful shall be under tribute."},{"num":25,"verse":"Heaviness in the heart of man maketh it stoop, but a good word maketh it glad."},{"num":26,"verse":"The righteous is more excellent than his neighbor, but the way of the wicked seduceth them."},{"num":27,"verse":"The slothful man roasteth not that which he took in hunting, but the substance of a diligent man is precious."},{"num":28,"verse":"In the way of righteousness is life, and in the pathway thereof there is no death."}]