[{"num":12,"verse":"Whoever loves strong teaching loves much learning, but he who hates strong words is foolish."},{"num":2,"verse":"A good man will get favor from the Lord, but He will punish a man who makes sinful plans."},{"num":3,"verse":"A man will not stand by doing what is wrong, but the root of those who are right with God will not be moved."},{"num":4,"verse":"A good wife is the pride and joy of her husband, but she who brings shame is like cancer to his bones."},{"num":5,"verse":"The thoughts of those who are right with God can be trusted, but the words of the sinful are false."},{"num":6,"verse":"The words of the sinful lie in wait for blood, but the mouth of the faithful will take them away from trouble."},{"num":7,"verse":"The sinful are destroyed and are no more, but the house of those who are right with God will stand."},{"num":8,"verse":"A man will be praised for his wisdom, but a man with a sinful mind will be hated."},{"num":9,"verse":"A man who has only a little honor and has a servant is better than one who honors himself and does not have bread."},{"num":10,"verse":"A man who is right with God cares for his animal, but the sinful man is hard and has no pity."},{"num":11,"verse":"He who works his land will have all the bread he needs, but he who follows what is of no worth has no wisdom."},{"num":12,"verse":"The sinful man wants what sinful men have, but the root of those who are right with God gives fruit."},{"num":13,"verse":"A sinful man is trapped by the sin of his lips, but those who are right with God will get away from trouble."},{"num":14,"verse":"A man will be filled with good from the fruit of his words, and the work of a man’s hands will return to him."},{"num":15,"verse":"The way of a fool is right in his own eyes, but a wise man listens to good teaching."},{"num":16,"verse":"The anger of a fool is known at once, but a wise man does not speak when he is spoken against."},{"num":17,"verse":"He who speaks the truth tells what is right, but a liar tells lies."},{"num":18,"verse":"There is one whose foolish words cut like a sword, but the tongue of the wise brings healing."},{"num":19,"verse":"Lips that tell the truth will last forever, but a lying tongue lasts only for a little while."},{"num":20,"verse":"Lying is in the heart of those who plan what is bad, but those who plan peace have joy."},{"num":21,"verse":"No trouble comes upon those who are right with God, but the sinful are filled with trouble."},{"num":22,"verse":"The Lord hates lying lips, but those who speak the truth are His joy."},{"num":23,"verse":"A wise man hides how much learning he has, but the heart of fools makes known their foolish way."},{"num":24,"verse":"The hand of those who do their best will rule, but the lazy hand will be made to work."},{"num":25,"verse":"Worry in the heart of a man weighs it down, but a good word makes it glad."},{"num":26,"verse":"The man who is right with God is a teacher to his neighbor, but the way of the sinful leads them the wrong way."},{"num":27,"verse":"The lazy man will not cook the food he has caught, but the man who does his best has what is of great worth."},{"num":28,"verse":"Life is in the way of those who are right with God, and in its path there is no death."}]