[{"header":"Lord of the Sabbath"},{"num":12,"verse":"At that time Jesus passed through the grainfields on the Sabbath. His disciples were hungry and began to pick and eat some heads of grain. "},{"num":2,"verse":"When the Pharisees saw this, they said to him, “See, your disciples are doing what is not lawful to do on the Sabbath.”"},{"num":3,"verse":"He said to them, “Haven’t you read what David did when he and those who were with him were hungry: "},{"num":4,"verse":"how he entered the house of God, and they ate the bread of the Presence—which is not lawful for him or for those with him to eat, but only for the priests? "},{"num":5,"verse":"Or haven’t you read in the law that on Sabbath days the priests in the temple violate the Sabbath and are innocent? "},{"num":6,"verse":"I tell you that something greater than the temple is here. "},{"num":7,"verse":"If you had known what this means, I desire mercy and not sacrifice, you would not have condemned the innocent. "},{"num":8,"verse":"For the Son of Man is Lord of the Sabbath.”"},{"header":"The Man with the Shriveled Hand"},{"num":9,"verse":"Moving on from there, he entered their synagogue. "},{"num":10,"verse":"There he saw a man who had a shriveled hand, and in order to accuse him they asked him, “Is it lawful to heal on the Sabbath?” "},{"num":11,"verse":"He replied to them, “Who among you, if he had a sheep that fell into a pit on the Sabbath, wouldn’t take hold of it and lift it out? "},{"num":12,"verse":"A person is worth far more than a sheep;  so it is lawful to do what is good on the Sabbath.”"},{"num":13,"verse":"Then he told the man, “Stretch out your hand.” So he stretched it out, and it was restored, as good as the other. "},{"num":14,"verse":"But the Pharisees went out and plotted against him, how they might kill him."},{"header":"The Servant of the Lord"},{"num":15,"verse":"Jesus was aware of this and withdrew. Large crowds followed him, and he healed them all. "},{"num":16,"verse":"He warned them not to make him known, "},{"num":17,"verse":"so that what was spoken through the prophet Isaiah might be fulfilled:"},{"header":"A House Divided"},{"num":22,"verse":"Then a demon-possessed man who was blind and unable to speak was brought to him. He healed him, so that the man could both speak and see. "},{"num":23,"verse":"All the crowds were astounded and said, “Could this be the Son of David?” "},{"num":24,"verse":"When the Pharisees heard this, they said, “This man drives out demons only by Beelzebul, the ruler of the demons.”"},{"num":25,"verse":"Knowing their thoughts, he told them, “Every kingdom divided against itself is headed for destruction, and no city or house divided against itself will stand. "},{"num":26,"verse":"If Satan drives out Satan, he is divided against himself. How then will his kingdom stand? "},{"num":27,"verse":"And if I drive out demons by Beelzebul, by whom do your sons drive them out? For this reason they will be your judges. "},{"num":28,"verse":"If I drive out demons by the Spirit of God, then the kingdom of God has come upon you. "},{"num":29,"verse":"How can someone enter a strong man’s house and steal his possessions unless he first ties up the strong man? Then he can plunder his house. "},{"num":30,"verse":"Anyone who is not with me is against me, and anyone who does not gather with me scatters. "},{"num":31,"verse":"Therefore, I tell you, people will be forgiven every sin and blasphemy, but the blasphemy against the Spirit will not be forgiven. "},{"num":32,"verse":"Whoever speaks a word against the Son of Man, it will be forgiven him; but whoever speaks against the Holy Spirit, it will not be forgiven him, either in this age or in the one to come."},{"header":"A Tree and Its Fruit"},{"num":33,"verse":"“Either make the tree good and its fruit will be good, or make the tree bad and its fruit will be bad; for a tree is known by its fruit. "},{"num":34,"verse":"Brood of vipers! How can you speak good things when you are evil? For the mouth speaks from the overflow of the heart. "},{"num":35,"verse":"A good person produces good things from his storeroom of good, and an evil person produces evil things from his storeroom of evil. "},{"num":36,"verse":"I tell you that on the day of judgment people will have to account for every careless word they speak. "},{"num":37,"verse":"For by your words you will be acquitted, and by your words you will be condemned.”"},{"header":"The Sign of Jonah"},{"num":38,"verse":"Then some of the scribes and Pharisees said to him, “Teacher, we want to see a sign from you.”"},{"num":39,"verse":"He answered them, “An evil and adulterous generation demands a sign, but no sign will be given to it except the sign of the prophet Jonah. "},{"num":40,"verse":"For as Jonah was in the belly of the huge fish three days and three nights, so the Son of Man will be in the heart of the earth three days and three nights. "},{"num":41,"verse":"The men of Nineveh will stand up at the judgment with this generation and condemn it, because they repented at Jonah’s preaching; and look—something greater than Jonah is here. "},{"num":42,"verse":"The queen of the south will rise up at the judgment with this generation and condemn it, because she came from the ends of the earth to hear the wisdom of Solomon; and look—something greater than Solomon is here."},{"header":"An Unclean Spirit’s Return"},{"num":43,"verse":"“When an unclean spirit comes out of a person, it roams through waterless places looking for rest but doesn’t find any. "},{"num":44,"verse":"Then it says, ‘I’ll go back to my house that I came from.’ Returning, it finds the house vacant, swept, and put in order. "},{"num":45,"verse":"Then it goes and brings with it seven other spirits more evil than itself, and they enter and settle down there. As a result, that person’s last condition is worse than the first. That’s how it will also be with this evil generation.”"},{"header":"True Relationships"},{"num":46,"verse":"While he was still speaking with the crowds, his mother and brothers were standing outside wanting to speak to him. "},{"num":47,"verse":"Someone told him, “Look, your mother and your brothers are standing outside, wanting to speak to you.”"},{"num":48,"verse":"He replied to the one who was speaking to him, “Who is my mother and who are my brothers?” "},{"num":49,"verse":"Stretching out his hand toward his disciples, he said, “Here are my mother and my brothers! "},{"num":50,"verse":"For whoever does the will of my Father in heaven is my brother and sister and mother.”"}]