[{"header":"Lord of the Sabbath"},{"num":12,"verse":"At that time, Jesus went through the grain fields on the Sabbath. His disciples were hungry and began to pick heads of grain and eat them. "},{"num":2,"verse":"But when the Pharisees saw it, they said to him, “Look, what your disciples are doing is unlawful on the Sabbath.”"},{"num":3,"verse":"But he said to them, “Have you not read what David did when he and his companions were hungry? "},{"num":4,"verse":"He entered God’s house and ate the Bread of the Presence, which was lawful only for the priests to eat, not for him or his companions. "},{"num":5,"verse":"Or have you not read in the law that on the Sabbath days, the priests in the temple violate the Sabbath and yet are innocent? "},{"num":6,"verse":"But I tell you that one greater than the temple is here. "},{"num":7,"verse":"Yet if you had known what this means, ‘I desire mercy, and not sacrifice,’ you would not have condemned the innocent. "},{"num":8,"verse":"For the Son of Man is Lord of the Sabbath.”"},{"header":"Jesus Heals a Man With a Withered Hand"},{"num":9,"verse":"Going on from there, he went into their synagogue. "},{"num":10,"verse":"A man was there who had a withered hand. Looking for a way to accuse Jesus, they asked him, “Is it lawful to heal on Sabbath days?”"},{"num":11,"verse":"He said to them, “Who among you, if you have one sheep that falls into a pit on the Sabbath, will not take hold of it and lift it out? "},{"num":12,"verse":"How much more valuable is a man than a sheep! So it is lawful to do good on the Sabbath.” "},{"num":13,"verse":"Then he told the man, “Stretch out your hand.” He stretched it out, and it was restored, as healthy as the other one. "},{"num":14,"verse":"But the Pharisees went out and plotted against him, considering how they might put him to death."},{"header":"“Here Is My Servant”"},{"num":15,"verse":"Since Jesus was aware of this, he withdrew from that place. Large crowds followed him and he healed them all. "},{"num":16,"verse":"He ordered them not to tell others about him. "},{"num":17,"verse":"This happened to fulfill what was spoken through Isaiah the prophet:"},{"header":"Jesus Has Power to Drive Out Demons"},{"num":22,"verse":"Then a demon-possessed man who was blind and unable to speak was brought to him. Jesus healed him so that he was able to speak and to see. "},{"num":23,"verse":"All the people were amazed and said, “Can this be the Son of David?” "},{"num":24,"verse":"But when the Pharisees heard it, they said, “It is only by Beelzebul, the ruler of the demons, that this fellow drives out demons.”"},{"num":25,"verse":"Knowing their thoughts, Jesus said to them, “Every kingdom divided against itself is destroyed, and every town or household divided against itself will not stand. "},{"num":26,"verse":"If Satan drives out Satan, he is divided against himself. How then can his kingdom stand? "},{"num":27,"verse":"Now if I drive out demons by Beelzebul, by whom do your sons drive them out? Therefore they will be your judges. "},{"num":28,"verse":"But if I drive out demons by the Spirit of God, then the kingdom of God has come upon you. "},{"num":29,"verse":"Or how can someone enter a strong man’s house and take his goods, unless he first ties up the strong man? Only then can he plunder his house."},{"num":30,"verse":"“Whoever is not with me is against me. And whoever does not gather with me scatters. "},{"num":31,"verse":"Therefore I tell you, people will be forgiven every sin and blasphemy, but the blasphemy against the Spirit will not be forgiven. "},{"num":32,"verse":"Whoever speaks a word against the Son of Man will be forgiven, but whoever speaks against the Holy Spirit will not be forgiven—either in this age or in the one to come."},{"num":33,"verse":"“Either make a tree good and its fruit will be good, or make a tree bad and its fruit will be bad. Indeed, a tree is known by its fruit. "},{"num":34,"verse":"You offspring of vipers! How can you say anything good, since you are evil? For what the mouth speaks flows from the heart. "},{"num":35,"verse":"The good man brings good out of his good treasure, and the evil man brings evil out of his evil treasure. "},{"num":36,"verse":"I tell you that on the day of judgment people will give account of every careless word they have spoken. "},{"num":37,"verse":"In fact by your words you will be justified, and by your words you will be condemned.”"},{"header":"The Sign of Jonah"},{"num":38,"verse":"Then some of the experts in the law and Pharisees replied, “Teacher, we want to see a sign from you.”"},{"num":39,"verse":"But he answered them, “An evil and adulterous generation wishes for a sign, but no sign will be given it except the sign of Jonah the prophet. "},{"num":40,"verse":"For just as Jonah was in the belly of the huge fish for three days and three nights, so the Son of Man will be three days and three nights in the heart of the earth. "},{"num":41,"verse":"The men of Nineveh will stand up in the judgment with this generation and condemn it, because they repented at the preaching of Jonah. But one even greater than Jonah is here. "},{"num":42,"verse":"The Queen of the South will be raised up in the judgment with this generation and will condemn it, because she came from the ends of the earth to hear the wisdom of Solomon. But one even greater than Solomon is here."},{"num":43,"verse":"“When an unclean spirit has gone out of someone, it passes through dry places looking for rest, but it does not find it. "},{"num":44,"verse":"Then it says, ‘I will return to the home I came from.’ And when it has returned, it finds the place empty, swept, and put in order. "},{"num":45,"verse":"Then it takes along with it seven other spirits more evil than itself, and they enter in and live there. So the last condition of that person becomes worse than the first. That is how it will be for this evil generation too.”"},{"header":"Jesus’ Mother and Brothers"},{"num":46,"verse":"While he was still speaking to the crowd, his mother and his brothers happened to be standing outside, wanting to talk to him. "},{"num":47,"verse":"Someone said to him, “Look, your mother and your brothers are standing outside, wanting to talk to you.”"},{"num":48,"verse":"But he replied to the one who told him, “Who is my mother? And who are my brothers?” "},{"num":49,"verse":"He reached out his hand toward his disciples and said, “See, my mother and my brothers! "},{"num":50,"verse":"For whoever does the will of my Father in heaven is my brother and sister and mother.”"}]