[{"num":12,"verse":"At that time Rebbe, Melech HaMoshiach went on Shabbos through the grainfields. And his talmidim were hungry and began to pick the heads of wheat and to eat them."},{"num":2,"verse":"But the Perushim, seeing this, said to Moshiach: Hinei! Your talmidim are doing what is asur on Shabbos!"},{"num":3,"verse":"But Moshiach said to them, Have you not read what Dovid HaMelech did when he and those with him were hungry,"},{"num":4,"verse":"how he entered into the Beis Hashem and ate the Lechem HaPanim (the Bread of the Presence), which was not mutar (permissible) for him to eat nor the ones with him, but only the kohanim?"},{"num":5,"verse":"Or have you not read in the Torah that on Shabbos the kohanim in the Beis Hamikdash commit Chillul HaYom HaShabbos (desecration of the Sabbath Day) and yet are blameless? [BAMIDBAR 28:9-10]"},{"num":6,"verse":"But I say to you that something greater than the Beis Hamikdash is here."},{"num":7,"verse":"But if you’d had daas what this means, CHESED CHAFATZTI VLO ZEVACH (I desire mercy and not sacrifice HOSHEA 6:6), you would not have condemned the innocent."},{"num":8,"verse":"For the Ben HaAdam (Moshiach) is Adon HaShabbos."},{"num":9,"verse":"And having gone from there, he went into their shul."},{"num":10,"verse":"And hinei! There was a man with a withered hand. And they questioned Rebbe, Melech HaMoshiach, asking, Is it mutar (permissible) to bring refuah (healing) on Shabbos? They did this in order to bring accusation against him."},{"num":11,"verse":"But Rebbe, Melech HaMoshiach said to them, What man will there be among you, who owns a keves (lamb), and if it falls into a pit on Shabbos, will not take hold of it and lift it out?"},{"num":12,"verse":"Therefore, how much more valuable is a man than a keves. For this reason, it is mutar (permissible) on Shabbos to do HaTov."},{"num":13,"verse":"Then Rebbe, Melech HaMoshiach says to the man, Stretch out your hand. And the man stretched out his hand. And it was restored to health, as sound as the other hand."},{"num":14,"verse":"But the Perushim went out and took counsel against Rebbe, Melech HaMoshiach so that they might destroy him."},{"num":15,"verse":"But Rebbe, Melech HaMoshiach, having da’as of this, departed from there. And many multitudes followed Rebbe, Melech HaMoshiach, and he brought refuah to them all."},{"num":16,"verse":"And Rebbe, Melech HaMoshiach warned them that they should not make him manifest."},{"num":17,"verse":"This was to fulfill what was spoken through Yeshayah HaNavi, saying,"},{"num":18,"verse":"HEN AVDI ETMACH BO, BECHIRI RATZTAH NAFSHI, NATATI RUCHI ALAV, MISHPAT LAGOYIM YOTZI (Here is my Servant, whom I uphold, my Chosen One in whom my Soul delights, I will put my Spirit on him, he will bring Justice to the Nations, YESHAYAH 42:1)"},{"num":19,"verse":"LO YITZAK VLO YISSAH VLO YASHMIA BACHUTZ KOLO (He will not shout nor cry out nor raise the sound of his voice in the street.)"},{"num":20,"verse":"KANEH RATZUTZ LO YISHBOR UFISHTAH CHEHAH LO YECHABENAH LE-EMET YOTZI MISHPAT (A bruised reed he will not break nor a smoldering wick will he snuff out) until Rebbe, Melech HaMoshiach leads mishpat (justice) to victory."},{"num":21,"verse":"And in his Name, HAGOYIM will put their tikvah (hope) [YESHAYAH 42:1-4; YESHAYAH 11:10 TARGUM HA-SHIVIM]"},{"num":22,"verse":"Then a man, blind and mute, who was possessed by shedim, was brought to Rebbe, Melech HaMoshiach, and he brought refuah to him, so that the mute man was able to speak and to see."},{"num":23,"verse":"And all the multitudes were amazed and they were saying, Surely this is not the Ben Dovid [Moshiach], is he?"},{"num":24,"verse":"But, having heard this, the Perushim said, This one does not cast out shedim except by Baal-zibbul, the Sar HaShedim (the Prince of Demons)."},{"num":25,"verse":"But having daas of their thoughts, Rebbe, Melech HaMoshiach said to them, Every malchut that is divided against itself is made desolate, and every ir (city) and bais (house) that is divided against itself will not stand."},{"num":26,"verse":"And if Hasatan casts out Hasatan, he is divided against himself. How, therefore, will the Malchut Hasatan stand?"},{"num":27,"verse":"And if by Baal-zibbul I cast out the shedim, by whom do your banim (sons) cast them out? Therefore, they will be your shofetim (judges)."},{"num":28,"verse":"But if by the Ruach Hakodesh I [Moshiach] cast out the shedim, then upon you the Malchut Hashem has arrived."},{"num":29,"verse":"Or how is someone able to enter the Bayit HaGibbor and confiscate his furnishings unless he binds the Gibbor first. Then he will plunder the Bayit HaGibbor."},{"num":30,"verse":"The one not with me [Moshiach] is against me [anti-Moshiach]. And the one not gathering with me scatters."},{"num":31,"verse":"Therefore, I say to you, every chet (sin) and gidduf (blasphemy) will be forgiven men, but whoever commits Chillul Hashem against the Ruach Hakodesh will not be forgiven."},{"num":32,"verse":"And whoever speaks a word against the Ben HaAdam [Moshiach] will be granted selicha (forgiveness), but whoever speaks against the Ruach Hakodesh, selicha will not be granted him either in the Olam Hazeh or in the Olam Habah."},{"num":33,"verse":"Either make the etz (tree) tov (good) and its pri (fruit) will be tov, or make the etz nishchat (corrupt) and its pri will be rah; for by its pri the etz is known."},{"num":34,"verse":"You banim of nechashim (sons of snakes), how are you able to speak tovot (good things), for out of the abundance of the lev (heart) the mouth speaks."},{"num":35,"verse":"The ish tov (good man) out of the good otzar (treasure) brings forth good; and the ish rah out of the evil otzar brings forth evil."},{"num":36,"verse":"But I say to you, that for every careless lashon horah (evil speech) that men speak, they will be called to account on the Yom HaDin (the Day of Judgment)."},{"num":37,"verse":"For by your dvarim you will be pronounced tzodek (righteous), and by your dvarim you will be charged with guilt."},{"num":38,"verse":"Then some of the Sofrim and Perushim answered Rebbe, Melech HaMoshiach, saying, Rabbi, we desire to see an ot (miraculous sign) from you."},{"num":39,"verse":"But Rebbe, Melech HaMoshiach answered them, Dor rah umnaef (an evil and adulterous generation) seeks for an ot (miraculous sign), but no ot will be given it except the ot of Yonah HaNavi."},{"num":40,"verse":"For just as Yonah was in the belly of the great fish SHLOSHAH YAMIM USHLOSHAH LAILAH (three days and three nights, YONAH 1:17), so will be the Ben HaAdam (Moshiach) in the heart of the earth SHLOSHAH YAMIM USHLOSHAH LAILOT (three days and three nights)."},{"num":41,"verse":"The men of Nineveh will stand up at the Yom HaDin with this generation and they will condemn it, for the men of Nineveh made teshuva at the hatafah (preaching) of Yonah, and, hinei, something much greater than Yonah is here."},{"num":42,"verse":"The Queen of the South will be made to stand up alive at the Yom HaDin with this generation and will condemn it, for she came from the ends of the earth to listen to the chochmah of Shlomo and, hinei, something much greater than Shlomo is here."},{"num":43,"verse":"Now when the ruach hatameh (unclean spirit) goes out from the man, it goes through dry places seeking a manoach (resting place) and it does not find one."},{"num":44,"verse":"Then it says, Into my haunt I will return from where I came out. And having come out, it finds the bais standing empty, having been swept and having been put beseder (in order)."},{"num":45,"verse":"Then it goes and takes along with itself seven other ruchot more evil than itself and, having entered the residence, it sets up house there, and the last state of that man has become worse than the first. Thus it will be with this evil generation also."},{"num":46,"verse":"While he was still speaking to the multitudes, hinei, Moshiach’s Em and achim stood outside, seeking to speak with him."},{"num":47,"verse":"And someone said to Rebbe, Melech HaMoshiach, Hinei! Your Em and your achim have stood outside seeking to speak with you."},{"num":48,"verse":"And Rebbe, Melech HaMoshiach said in reply to the one speaking with him, Who is my Em and who are my achim?"},{"num":49,"verse":"And stretching out his hand upon his talmidim, Rebbe, Melech HaMoshiach said, Hinei, my Em and my achim."},{"num":50,"verse":"For whoever does the ratzon (will) of Avi shbaShomayim(see Mt6:10; 26:39) he is my ach (brother) and achot (sister)and Em (Mother)."}]