[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(2) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Because he justified himself rather than God.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 19:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Job maintained his innocence, and could not understand how his affliction could be reconciled with the justice of God. Yet, at the same time, he declared that God was his salvation (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 13:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and that it was impossible for man to be absolutely just with God (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 9:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 9:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), though at the same time he might hope in His righteousness (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 23:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "seqq.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": ".Benson CommentaryJob 32:2-4. Then was kindled the wrath of Elihu — Elihu, a new personage, here makes his appearance. Attentive, all the while, to the debate between Job and his friends, he utters not a word till both sides have done speaking; and then shows, that a stander-by may sometimes see further into a dispute than they who are eagerly engaged therein, and who, by having their passions raised to an undue height, are very apt to carry things to an extreme. The son of Barachel the Buzite — Of the posterity of Buz, Nahor’s son, Genesis 22:21; of the kindred of Ram — Or, Aram; for the names Ram and Aram are used promiscuously in the Hebrew, as the learned reader may see, by comparing 2 Kings 8:28, and 2 Chronicles 22:5. The land of Buz was doubtless somewhere in the neighbourhood of Job, as the posterity of Nahor settled in this country. His pedigree is thus particularly described, partly for his honour, as being both a wise and a good man, and principally to evidence the truth of this history. Because he (Job) justified himself rather than God — He justified himself not without reflection upon God, as dealing severely with him. He took more care to maintain his own innocence than God’s glory. The word Elihu signifies, My God is he. They had all tried in vain to convince Job, but My God is he, who both can and will convince him. Elihu was not a little provoked at the behaviour of Job for attempting so to vindicate himself as to leave an imputation of injustice on God’s providence. Also against his three friends was his wrath kindled — For charging Job with such atrocious crimes, and falling so miserably short, when they should have come to the proof, as not to be able to convict him of one of them. Now Elihu had waited — With patience and expectation, as the word חכה, chiccha, here used, means; till Job had spoken — And his three friends; because they were elder than he — Old age in those days was so highly honoured, that a young man scarcely dared to open his mouth before his elders. Elihu therefore begins with a very modest apology for his engaging in the dispute at all, drawn from his youth. He tells them he had waited a long while to hear what they would offer; but, finding they did not design to reply, he desired their leave to speak his opinion; a liberty, however, which he would not indulge himself in, if they were willing to make an answer, or could any way convict Job of what they had laid to his charge. He intimates that his intention was to attack him in a quite different manner from what they had done, for which reason he should not think himself at all obliged to answer the same arguments he had urged against them. But, at the same time, he declares it was not his intention to speak partially in his favour, since the acceptance of persons was a crime which he was sensible would be severely punished by the Almighty.Matthew Henry's Concise Commentary32:1-5 Job's friends were silenced, but not convinced. Others had been present. Elihu was justly displeased with Job, as more anxious to clear his own character than the justice and goodness of God. Elihu was displeased with Job's friends because they had not been candid to Job. Seldom is a quarrel begun, more seldom is a quarrel carried on, in which there are not faults on both sides. Those that seek for truth, must not reject what is true and good on either side, nor approve or defend what is wrong.Barnes' Notes on the BibleThen was kindled the wrath - Wrath or anger is commonly represented as kindled, or as burning.Of Elihu - The name Elihu (אליהוא  'ĕlı̂yhû') means, \"God is he;\" or, since the word He (הוא  hû') is often used by way of eminence to denote the true God or Yahweh, the name is equivalent to saying, \"God is my God,\" or \"my God is Yahweh.\" On what account this name was given to him, is now unknown. The names which were anciently given, however, were commonly significant, and it was not unusual to incorporate the name of God in those given to human beings. See the notes at Isaiah 1:1. This name was probably given as an expression of piety on the part of his parents.The son of Barachel - The name Barachel ברכאל  bârak'êl means \"God blesses,\" and was also probably given as expressive of the piety of his parents, and as furnishing in the name itself a valuable motto which the child would remember. Nothing more is known of him than the name; and the only propriety of remarking on the philology of the names arises from the fact that they seem to indicate the existence of piety, or of the knowledge of God, on the part of the ancestors of Elihu.The Buzite - Buz was the second son of Nahor, the brother of Abraham, Genesis 22:20-21. A city of the name Buz is mentioned in Jeremiah 25:23, in connection with Dedan and Tema, cities of Arabia, and it is probable that Barachel, the father of Elihu, was of that city. If this name was given to the place after the son of Nahor, it will follow that Elihu, and consequently Job, must have lived after the time of Abraham.Of the kindred of Ram - Of Ram nothing is certainly known. The Chaldee renders this גניסת מן אברחם, of the race of Abraham. Some have supposed that the Ram mentioned here is the same as the ancestor of David mentioned in Ruth 4:19, and in the genealogical table in Matthew 1:3-4, under the name of Aram. Others suppose that he was of the family of Nahor, and that the name is the same as ארם  'ărâm mentioned in Genesis 22:21. Thus, by aphaeresis the Syrians are called רמים  rammı̂ym, 2 Chronicles 22:5, instead of ארמים  'ărammı̂ym, as they are usually denominated; compare 2 Kings 8:29. But nothing certain is known of him who is mentioned here. It is worthy of observation that the author of the book of Job has given the genealogy of Elihu with much greater particularity than he has that of either Job or his three friends. Indeed, he has not attempted to trace their genealogy at all. Of Job he does not even mention the name of his father; of his three friends he mentions merely the place where they dwelt. Rosenmuller infers, from this circumstance, that Elihu is himself the author of the book, since, says he, it is the custom of the Turks and Persians, in their poems, to weave in, near the end of the poem, the name of the author in an artificial manner. The same view is taken by Lightfoot, Chronica temporum et ord. Text. V. T. A circumstance of this kind, however, is too slight an argument to determine the question of the authorship of the book. It may have been that Elihu was less known than either of the other speakers, and hence, there was a propriety in mentioning more particularly his family. Indeed, this fact is morally certain, for he is not mentioned, as the others are, as the \"friend\" of Job.Because he justified himself - Margin, his soul. So the Hebrew; the word נפשׁ  nephesh, soul, being often used to denote oneself.Rather than God - Prof. Lee renders this, \"justified himself with God;\" and so also Umbreit, Good, and some others. And so the Vulgate renders it: - coram Deo. The Septuagint renders it, ἐναντίον κυρίου  enantion kuriou - against the Lord; that is, rather than the Lord. The proper translation of the Hebrew (מאלהים  mē'ĕlôhı̂ym) is undoubtedly more than God: and this was doubtless the idea which Elihu intended to convey. He understood Job as vindicating himself rather than God; as being more willing that aspersions should be cast on the character and government of God, than to confess his own sin. Jamieson-Fausset-Brown Bible Commentary2. Elihu—meaning \"God is Jehovah.\" In his name and character as messenger between God and Job, he foreshadows Jesus Christ (Job 33:23-26).Barachel—meaning \"God blesses.\" Both names indicate the piety of the family and their separation from idolaters.Buzite—Buz was son of Nahor, brother of Abraham. Hence was named a region in Arabia-Deserta (Jer 25:23).Ram—Aram, nephew of Buz. Job was probably of an older generation than Elihu. However, the identity of names does not necessarily prove the identity of persons. The particularity with which Elihu's descent is given, as contrasted with the others, led Lightfoot to infer Elihu was the author of the book. But the reason for particularity was, probably, that Elihu was less known than the three called \"friends\" of Job; and that it was right for the poet to mark especially him who was mainly to solve the problem of the book.rather than God—that is, was more eager to vindicate himself than God. In Job 4:17, Job denies that man can be more just than God. Umbreit translates, \"Before (in the presence of) God.\"Matthew Poole's Commentary The Buzite;  of the posterity of Buz, Nahor’s son, Genesis 22:21. Of the kindred of Ram,  or of Aram; for Ram and Aram are used promiscuously: compare 2 Kings 8:28, with 2 Chronicles 22:5 Ruth 4:19 Matthew 1:3. Others, of Abraham, who as he was called Abram, possibly was at first called only Ram. His pedigree is thus particularly described, partly for his honour, because his speech declares him to be both a wise and a good man; and principally to evidence the truth of this history, which otherwise might seem to be but a poetical fiction. He justified himself rather than God;  he justified himself, not without reflection upon God, as dealing too severely with him, and denying him that hearing which he so passionately desired. He took more care to maintain his own innocency than God’s glory. Gill's Exposition of the Entire BibleThen was kindled the wrath of Elihu the son of Barachel the Buzite,.... Both against Job and his three friends, for reasons after given; who this person was is not easy to say; they debase him too much, who make him to be Balaam the soothsayer, according to the tradition of the Jews (g); for neither the time he lived in, nor his character, will agree with him; this man living before the times of Balaam; and being also a holy good man, which all his discourses show: and they too much exalt him who make him to be Christ; for though some phrases, being strained, may seem to agree with him, and some things in the signification of his name, and the names of his ancestors, may be thought to answer to him; Elihu signifying, \"my God is he\"; the son of Barachel, \"the son of the blessed God\"; of the kindred of Ram, of the high and holy line; the Buzite, one \"despised\" and reproached; yet there are other things that cannot be said of him, as particularly in Job 32:22; besides, the Messiah seems to be spoken of by him as another person, Job 33:23; it is very probable that he was one of Job's relations that was come to visit him in his melancholy circumstances, had been a bystander, and an hearer of the whole dispute between Job and his friends, with the management of which he was not a little displeased; he is described by his descent, when Job's other three friends are not, because he was a young man, and not known as they were: and this serves to show the truth of this history, that it is not a mere apologue, or moral fable, but a real fact; though who his father Barachel the Buzite was cannot easily be determined; it is probable he was a descendant of Buz, the son of Nahor, Abraham's brother, Genesis 22:20; of this opinion are Aben Ezra and Ben Gersom; unless it can be thought he was so called from the city Buz, of which he might be an inhabitant, mentioned along with Dedan and Tema, Jeremiah 25:23, places in Edom or Idumea, where or near to which Job 54ed: of the kindred of Ram; according to the Targum, of the kindred of Abraham, in which it is followed by other Jewish writers (h); and some even take him to be Isaac, the son of Abraham (i); Aben Ezra thinks he is the same with Ram the father of Amminadab, Ruth 4:19; but he is abundantly too late for this man to be of his kindred; others take him to be the same with Aram, the son of Kemuel, a brother of Buz, Genesis 22:21; these names being used for one another, either by adding or removing a letter; see Matthew 1:3; compared with Ruth 4:19; against Job was his wrath kindled, because he justified himself rather than God; not that he made himself more just than God, he could never think or say so, see Job 4:17; nor that he was just before him or by him; for he was so in an evangelic, though not in a legal sense; and Elihu would not have been displeased with him for asserting that; he did not deny that Job was a righteous man in the sight of God; nor that he was righteous, and in the right in the sight of God, with respect to the controversy between him and his friends; nor did he blame him for justifying himself from their charges; but that he justified himself \"more\" than God; so the Jewish writers (k) generally render it: he spent more time, and insisted longer on his own justification than upon the justification of God in the dealings of his providence with him; he was more careful of his own character and reputation than he was of the honour of God, and the glory of his justice; he said more for himself than he did for God; and this displeased Elihu; it gave this good man some concern, that, though Job did not directly charge God with unrighteousness in his dealings with him, yet by consequence; and he expressed himself in such language that would bear such a construction, whether it was his real sense or not; and to hear him complain so heavily of God, and at the same time enlarge so much on his own innocence, and to importune in so bold and daring a manner to have a hearing of his cause; these things being observed by Elihu, raised his choler and indignation. (g) T. Hieros. Sotah, fol. 20. 4. Hieron. Quaest. seu Traditiones in Gen. fol. 69. D. so Bolducius. (h) Jarchi, Bar Tzemach, &c. (i) T. Hieros. Sotah, fol. 20. 4. (k) Jarchi, Aben Ezra. Ben Gersom. Geneva Study BibleThen was kindled the wrath of Elihu the son of Barachel the {a} Buzite, of the kindred of {b} Ram: against Job was his wrath kindled, because he justified himself {c} rather than God.(a) Which came from Buz, the son of Nahor, Abraham's brother.(b) Or, as the Chaldee translation reads, Abram.(c) By making himself innocent, and by charging God of rigour.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Benson Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Job 32:2-4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Then was kindled the wrath of Elihu — ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Elihu, a new personage, here makes his appearance. Attentive, all the while, to the debate between Job and his friends, he utters not a word till both sides have done speaking; and then shows, that a stander-by may sometimes see further into a dispute than they who are eagerly engaged therein, and who, by having their passions raised to an undue height, are very apt to carry things to an extreme. ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "The son of Barachel the Buzite — ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Of the posterity of Buz, Nahor’s son, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 22:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "of the kindred of Ram — ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Or, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Aram; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "for the names ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Ram ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "and ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Aram ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "are used promiscuously in the Hebrew, as the learned reader may see, by comparing ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 8:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 22:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The land of Buz was doubtless somewhere in the neighbourhood of Job, as the posterity of Nahor settled in this country. His pedigree is thus particularly described, partly for his honour, as being both a wise and a good man, and principally to evidence the truth of this history. ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Because he ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "(Job) ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "justified himself rather than God — ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "He justified himself not without reflection upon God, as dealing severely with him. He took more care to maintain his own innocence than God’s glory. The word ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Elihu ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "signifies, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "My God is he. ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "They had all tried in vain to convince Job, but ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "My God is he, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "who both can and will convince him. Elihu was not a little provoked at the behaviour of Job for attempting so to vindicate himself as to leave an imputation of injustice on God’s providence. ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Also against his three friends was his wrath kindled — ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "For charging Job with such atrocious crimes, and falling so miserably short, when they should have come to the proof, as not to be able to convict him of one of them. ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Now Elihu had waited — ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "With patience and expectation, as the word ",
            "children": []
          },
          {
            "element": "span",
            "class": "greekheb",
            "text": "חכה",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "chiccha, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "here used, means; ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "till Job had spoken — ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "And his three friends; ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "because they were elder than he — ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Old age in those days was so highly honoured, that a young man scarcely dared to open his mouth before his elders. Elihu therefore begins with a very modest apology for his engaging in the dispute at all, drawn from his youth. He tells them he had waited a long while to hear what they would offer; but, finding they did not design to reply, he desired their leave to speak his opinion; a liberty, however, which he would not indulge himself in, if they were willing to make an answer, or could any way convict Job of what they had laid to his charge. He intimates that his intention was to attack him in a quite different manner from what they had done, for which reason he should not think himself at all obliged to answer the same arguments he had urged against them. But, at the same time, he declares it was not his intention to speak partially in his favour, since the acceptance of persons was a crime which he was sensible would be severely punished by the Almighty.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Matthew Henry's Concise Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "32:1-5 Job's friends were silenced, but not convinced. Others had been present. Elihu was justly displeased with Job, as more anxious to clear his own character than the justice and goodness of God. Elihu was displeased with Job's friends because they had not been candid to Job. Seldom is a quarrel begun, more seldom is a quarrel carried on, in which there are not faults on both sides. Those that seek for truth, must not reject what is true and good on either side, nor approve or defend what is wrong.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Barnes' Notes on the Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Then was kindled the wrath - Wrath or anger is commonly represented as kindled, or as burning.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "Of Elihu - The name Elihu (אליהוא  'ĕlı̂yhû') means, \"God is he;\" or, since the word He (הוא  hû') is often used by way of eminence to denote the true God or Yahweh, the name is equivalent to saying, \"God is my God,\" or \"my God is Yahweh.\" On what account this name was given to him, is now unknown. The names which were anciently given, however, were commonly significant, and it was not unusual to incorporate the name of God in those given to human beings. See the notes at Isaiah 1:1. This name was probably given as an expression of piety on the part of his parents.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "The son of Barachel - The name Barachel ברכאל  bârak'êl means \"God blesses,\" and was also probably given as expressive of the piety of his parents, and as furnishing in the name itself a valuable motto which the child would remember. Nothing more is known of him than the name; and the only propriety of remarking on the philology of the names arises from the fact that they seem to indicate the existence of piety, or of the knowledge of God, on the part of the ancestors of Elihu.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "The Buzite - Buz was the second son of Nahor, the brother of Abraham, Genesis 22:20-21. A city of the name Buz is mentioned in Jeremiah 25:23, in connection with Dedan and Tema, cities of Arabia, and it is probable that Barachel, the father of Elihu, was of that city. If this name was given to the place after the son of Nahor, it will follow that Elihu, and consequently Job, must have lived after the time of Abraham.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "Of the kindred of Ram - Of Ram nothing is certainly known. The Chaldee renders this גניסת מן אברחם, of the race of Abraham. Some have supposed that the Ram mentioned here is the same as the ancestor of David mentioned in Ruth 4:19, and in the genealogical table in Matthew 1:3-4, under the name of Aram. Others suppose that he was of the family of Nahor, and that the name is the same as ארם  'ărâm mentioned in Genesis 22:21. Thus, by aphaeresis the Syrians are called רמים  rammı̂ym, 2 Chronicles 22:5, instead of ארמים  'ărammı̂ym, as they are usually denominated; compare 2 Kings 8:29. But nothing certain is known of him who is mentioned here. It is worthy of observation that the author of the book of Job has given the genealogy of Elihu with much greater particularity than he has that of either Job or his three friends. Indeed, he has not attempted to trace their genealogy at all. Of Job he does not even mention the name of his father; of his three friends he mentions merely the place where they dwelt. Rosenmuller infers, from this circumstance, that Elihu is himself the author of the book, since, says he, it is the custom of the Turks and Persians, in their poems, to weave in, near the end of the poem, the name of the author in an artificial manner. The same view is taken by Lightfoot, Chronica temporum et ord. Text. V. T. A circumstance of this kind, however, is too slight an argument to determine the question of the authorship of the book. It may have been that Elihu was less known than either of the other speakers, and hence, there was a propriety in mentioning more particularly his family. Indeed, this fact is morally certain, for he is not mentioned, as the others are, as the \"friend\" of Job.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "Because he justified himself - Margin, his soul. So the Hebrew; the word נפשׁ  nephesh, soul, being often used to denote oneself.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "Rather than God - Prof. Lee renders this, \"justified himself with God;\" and so also Umbreit, Good, and some others. And so the Vulgate renders it: - coram Deo. The Septuagint renders it, ἐναντίον κυρίου  enantion kuriou - against the Lord; that is, rather than the Lord. The proper translation of the Hebrew (מאלהים  mē'ĕlôhı̂ym) is undoubtedly more than God: and this was doubtless the idea which Elihu intended to convey. He understood Job as vindicating himself rather than God; as being more willing that aspersions should be cast on the character and government of God, than to confess his own sin. ",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Jamieson-Fausset-Brown Bible Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "2. Elihu—meaning \"God is Jehovah.\" In his name and character as messenger between God and Job, he foreshadows Jesus Christ (Job 33:23-26).",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "Barachel—meaning \"God blesses.\" Both names indicate the piety of the family and their separation from idolaters.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "Buzite—Buz was son of Nahor, brother of Abraham. Hence was named a region in Arabia-Deserta (Jer 25:23).",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "Ram—Aram, nephew of Buz. Job was probably of an older generation than Elihu. However, the identity of names does not necessarily prove the identity of persons. The particularity with which Elihu's descent is given, as contrasted with the others, led Lightfoot to infer Elihu was the author of the book. But the reason for particularity was, probably, that Elihu was less known than the three called \"friends\" of Job; and that it was right for the poet to mark especially him who was mainly to solve the problem of the book.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "rather than God—that is, was more eager to vindicate himself than God. In Job 4:17, Job denies that man can be more just than God. Umbreit translates, \"Before (in the presence of) God.\"",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Matthew Poole's Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "The Buzite; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " of the posterity of Buz, Nahor’s son, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Genesis 22:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Of the kindred of Ram, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " or ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "of Aram",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; for ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Ram",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Aram",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " are used promiscuously: compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "2 Kings 8:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", with ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "2 Chronicles 22:5 Ruth 4:19 Matthew 1:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Others, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "of Abraham",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", who as he was called ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Abram",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", possibly was at first called only ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Ram",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". His pedigree is thus particularly described, partly for his honour, because his speech declares him to be both a wise and a good man; and principally to evidence the truth of this history, which otherwise might seem to be but a poetical fiction. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "He justified himself rather than God; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " he justified himself, not without reflection upon God, as dealing too severely with him, and denying him that hearing which he so passionately desired. He took more care to maintain his own innocency than God’s glory. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Gill's Exposition of the Entire Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Then was kindled the wrath of Elihu the son of Barachel the Buzite,.... Both against Job and his three friends, for reasons after given; who this person was is not easy to say; they debase him too much, who make him to be Balaam the soothsayer, according to the tradition of the Jews (g); for neither the time he lived in, nor his character, will agree with him; this man living before the times of Balaam; and being also a holy good man, which all his discourses show: and they too much exalt him who make him to be Christ; for though some phrases, being strained, may seem to agree with him, and some things in the signification of his name, and the names of his ancestors, may be thought to answer to him; Elihu signifying, \"my God is he\"; the son of Barachel, \"the son of the blessed God\"; of the kindred of Ram, of the high and holy line; the Buzite, one \"despised\" and reproached; yet there are other things that cannot be said of him, as particularly in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 32:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; besides, the Messiah seems to be spoken of by him as another person, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 33:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; it is very probable that he was one of Job's relations that was come to visit him in his melancholy circumstances, had been a bystander, and an hearer of the whole dispute between Job and his friends, with the management of which he was not a little displeased; he is described by his descent, when Job's other three friends are not, because he was a young man, and not known as they were: and this serves to show the truth of this history, that it is not a mere apologue, or moral fable, but a real fact; though who his father Barachel the Buzite was cannot easily be determined; it is probable he was a descendant of Buz, the son of Nahor, Abraham's brother, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 22:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; of this opinion are Aben Ezra and Ben Gersom; unless it can be thought he was so called from the city Buz, of which he might be an inhabitant, mentioned along with Dedan and Tema, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 25:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", places in Edom or Idumea, where or near to which ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 54",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "ed: ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "of the kindred of Ram; according to the Targum, of the kindred of Abraham, in which it is followed by other Jewish writers (h); and some even take him to be Isaac, the son of Abraham (i); Aben Ezra thinks he is the same with Ram the father of Amminadab, Ruth 4:19; but he is abundantly too late for this man to be of his kindred; others take him to be the same with Aram, the son of Kemuel, a brother of Buz, Genesis 22:21; these names being used for one another, either by adding or removing a letter; see Matthew 1:3; compared with Ruth 4:19; ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "against Job was his wrath kindled, because he justified himself rather than God; not that he made himself more just than God, he could never think or say so, see Job 4:17; nor that he was just before him or by him; for he was so in an evangelic, though not in a legal sense; and Elihu would not have been displeased with him for asserting that; he did not deny that Job was a righteous man in the sight of God; nor that he was righteous, and in the right in the sight of God, with respect to the controversy between him and his friends; nor did he blame him for justifying himself from their charges; but that he justified himself \"more\" than God; so the Jewish writers (k) generally render it: he spent more time, and insisted longer on his own justification than upon the justification of God in the dealings of his providence with him; he was more careful of his own character and reputation than he was of the honour of God, and the glory of his justice; he said more for himself than he did for God; and this displeased Elihu; it gave this good man some concern, that, though Job did not directly charge God with unrighteousness in his dealings with him, yet by consequence; and he expressed himself in such language that would bear such a construction, whether it was his real sense or not; and to hear him complain so heavily of God, and at the same time enlarge so much on his own innocence, and to importune in so bold and daring a manner to have a hearing of his cause; these things being observed by Elihu, raised his choler and indignation. ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "(g) T. Hieros. Sotah, fol. 20. 4. Hieron. Quaest. seu Traditiones in Gen. fol. 69. D. so Bolducius. (h) Jarchi, Bar Tzemach, &c. (i) T. Hieros. Sotah, fol. 20. 4. (k) Jarchi, Aben Ezra. Ben Gersom. ",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Geneva Study Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse2",
            "text": "Then was kindled the wrath of Elihu the son of Barachel the {a} Buzite, of the kindred of {b} Ram: against Job was his wrath kindled, because he justified himself {c} rather than God.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "(a) Which came from Buz, the son of Nahor, Abraham's brother.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "(b) Or, as the Chaldee translation reads, Abram.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "(c) By making himself innocent, and by charging God of rigour.",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "2–5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Introduction of Elihu, a new speaker, who appears to have been a listener during the progress of the former debate. The descent of Elihu is given with fuller details than in the case of the other speakers. The name Elihu, meaning probably ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "my God is he",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", occurs elsewhere, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 1:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 12:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". He is named the Buzite. Buz was brother of Uz, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 22:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and son of Nahor. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 25:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Buz is mentioned along with Tema (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 6:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and reckoned among the Arab tribes. The name Ram, therefore, which does not occur elsewhere, is scarcely to be taken as a contraction for Aram or Syria (though comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 22:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where Ramites = Aramites).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "justified himself rather than God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The meaning appears to be, justified himself as against God, in his plea with God and at the expense of God’s justice. The sense is given in ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 40:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where the Lord says to Job, “Wilt thou condemn me that thou mayest be righteous”? There are two points to be attended to in these passages when the question of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "right",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is raised, the one a formal point and the other a material one. God had afflicted Job and thus, in Job’s view and the view of his time, passed a verdict of wickedness on him. Against this verdict Job reclaims, God does him wrong in this. This is the formal question of right between Job and God. But this naturally goes back into the material question of Job’s past life. Elihu, defending the righteousness of God, keeps before him chiefly the formal question. He touches little upon Job’s life and history, differing in this entirely from the three friends. He makes a general, abstract question out of Job’s complaints against God, which he argues on general lines with almost no reference to Job’s particular case. Job’s complaints do little more than suggest to him the question, Can God be justly complained of?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 2.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Then was kindled the wrath of Elihu",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The name \"Elihu\" was not uncommon among the Israelites. It is found among the ancestors of Samuel (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 1:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), among the Korhite Levites of the time of David (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 26:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and as a variant for Eliab, one of David's brothers (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 27:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") The meaning of the word was, \"He is my God\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "אליהוא",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The son of Barachal",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Barachel is also a significant name. It means, \"Bless, O God,\" or \"God blesses\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "בר אל",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Both names imply that the new interlocutor belonged to a family of monotheists. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The Buzite",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"Huz\" and \"Buz\" were brothers, the sons of Nahor, Abraham's brother, by Maleah, the daughter of Haran (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 11:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 22:20, 21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Of the kindred of Ram.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " By \"Ram\" we are probably to understand \"Aram,\" who was the son of Kemuel, a brother of Huz and Buz. (On the connection of Huz and Buz with the Arabian tribes of Khazu and Bazu, see the comment on Job 1:1.) ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Against Job was his wrath kindled, because he justified himself rather than God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Elihu was well-intentional; and it is perhaps not surprising that he had been shocked by some of Job's expressions. Job had himself apologized for them (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 6:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); and certainly they went perilously near taxing God with injustice (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 40:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). But it is to be remembered that finally God justifies Job's sayings, while condemning those of his \"comforters.\" \"My wrath is kindled,\" he says to Eliphaz, \"against thee, and against thy two friends: for ye have not spoken of me ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "the thing that is right",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "as my servant Job",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " hath\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 42:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Job 32:2",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1-3  So these three men ceased to answer Job, because he was righteous in his own eyes. And the wrath of Elihu, the son of Barachel the Buzite, of the family of Ram, was kindled: against Job was his wrath kindled, because he justified himself at the expense of God. And against his three friends was his wrath kindled, because they found no answer, and condemned Job.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The name of the speaker is אליהוּא (with Mahpach), son of בּרכאל (with Munach) the buwziy (with Zarka). The name Elihu signifies \"my God is He,\" and occurs also as an Israelitish name, although it is not specifically Israelitish, like Elijah (my God is Jehovah). Brach'el (for which the mode of writing בּרכאל with Dag. implic. is also found) signifies \"may God bless!\" (Olsh. 277, S. 618); for proper names, as the Arabian grammarians observe, can be formed both into the form of assertory clauses (ichbâr), and also into the form of modal (inshâ); the name ברכאל is in this respect distinguished from the specifically Israelitish name בּרכיה (Jehovah blesseth). The accompanying national name defines the scene; for on the one side בּוּז and עוּץ, according to Genesis 22:21, are the sons of Nahor, Abraham's brother, who removed with him (though not at the same time) from Ur Casdim to Haran, therefore by family Aramaeans; on the other side, בּוּז, Jeremiah 25:23, appears as an Arab race, belonging to the קצוּצי פאה (comp. Jeremiah 9:25; Jeremiah 49:32), i.e., to the Arabs proper, who cut the hair of their heads short all round (περιτρόχαλα, Herodotus iii. 8), because wearing it long was accounted as disgraceful (vid., Tebrzi in the Hamsa, p. 459, l. 10ff.). Within the Buzite race, Elihu sprang from the family of רם. Since רם is the name of the family, not the race, it cannot be equivalent to ארם (like רמּים,   2 Chronicles 22:5,  equals  ארמים), and it is therefore useless to derive the Aramaic colouring of Elihu's speeches from design on the part of the poet. But by making him a Buzite, he certainly appears to make him an Aramaean Arab, as Aristeas in Euseb. praep. ix. 25 calls him Ἐλιοῦν τὸν Βαραξηιὴλ τὸν Ζωβίτην (from ארם צובה). It is remarkable that Elihu's origin is given so exactly, while the three are described only according to their country, without any statement of father or family. It would indeed be possible, as Lightfoot and Rosenm. suppose, for the poet to conceal his own name in that of Elihu, or to make allusion to it; but an instance of this later custom of Oriental poets is found nowhere else in Old Testament literature.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The name of the speaker is אליהוּא (with Mahpach), son of בּרכאל (with Munach) the buwziy (with Zarka). The name Elihu signifies \"my God is He,\" and occurs also as an Israelitish name, although it is not specifically Israelitish, like Elijah (my God is Jehovah). Brach'el (for which the mode of writing בּרכאל with Dag. implic. is also found) signifies \"may God bless!\" (Olsh. 277, S. 618); for proper names, as the Arabian grammarians observe, can be formed both into the form of assertory clauses (ichbâr), and also into the form of modal (inshâ); the name ברכאל is in this respect distinguished from the specifically Israelitish name בּרכיה (Jehovah blesseth). The accompanying national name defines the scene; for on the one side בּוּז and עוּץ, according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 22:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", are the sons of Nahor, Abraham's brother, who removed with him (though not at the same time) from Ur Casdim to Haran, therefore by family Aramaeans; on the other side, בּוּז, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 25:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", appears as an Arab race, belonging to the קצוּצי פאה (comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 9:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 49:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), i.e., to the Arabs proper, who cut the hair of their heads short all round (περιτρόχαλα, Herodotus iii. 8), because wearing it long was accounted as disgraceful (vid., Tebrzi in the Hamsa, p. 459, l. 10ff.). Within the Buzite race, Elihu sprang from the family of רם. Since רם is the name of the family, not the race, it cannot be equivalent to ארם (like רמּים,   ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 22:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",  equals  ארמים), and it is therefore useless to derive the Aramaic colouring of Elihu's speeches from design on the part of the poet. But by making him a Buzite, he certainly appears to make him an Aramaean Arab, as Aristeas in Euseb. praep. ix. 25 calls him Ἐλιοῦν τὸν Βαραξηιὴλ τὸν Ζωβίτην (from ארם צובה). It is remarkable that Elihu's origin is given so exactly, while the three are described only according to their country, without any statement of father or family. It would indeed be possible, as Lightfoot and Rosenm. suppose, for the poet to conceal his own name in that of Elihu, or to make allusion to it; but an instance of this later custom of Oriental poets is found nowhere else in Old Testament literature.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The three friends are silenced, because all their attempts to move Job to a penitent confession that his affliction is the punishment of his sins, have rebounded against this fact, that he was righteous in his own eyes, i.e., that he imagined himself righteous; and because they now (שׁבת of persons, in distinction from חדל, has the secondary notion of involuntariness) know of nothing more to say. Then Elihu's indignation breaks forth in two directions. First, concerning Job, that he justified himself מאלהים, i.e., not a Deo (so that He would be obliged to account him righteous, as Job 4:17), but prae Deo. Elihu rightly does not find it censurable in Job, that as a more commonly self-righteous man he in general does not consider himself a sinner, which the three insinuate of him (Job 15:14; Job 25:4), but that, declaring himself to be righteous, he brings upon God the appearance of injustice, or, as Jehovah also says further on, Job 40:8, that he condemns God in order that he may be able to maintain his own righteousness. Secondly, concerning the three, that they have found no answer by which they might have been able to disarm Job in his maintenance of his own righteousness at the expense of the divine justice, and that in consequence of this they have condemned Job. Hahn translates: so that they should have represented Job as guilty; but that they have not succeeded in stamping the servant of God as a רשׁע, would wrongly excite Elihu's displeasure. And Ewald translates: and that they had nevertheless condemned him (345, a); but even this was not the real main defect of their opposition. The fut. consec. describes the condemnation as the result of their inability to hit upon the right answer; it was a miserable expedient to which they had recourse. According to the Jewish view, ויּרשׁיעוּ את־איּוב is one of the eighteen תקוני סופרים (correctiones scribarum), since it should be וירשׁיעו את־האלהים. But it is not the friends who have been guilty of this sin of הרשׁיע against God, but Job, Job 40:8, to whom Elihu opposes the sentence אל לא־ירשׁיע, Job 34:12. Our judgment of another such tiqqûn, Job 7:20, was more favourable. That Elihu, notwithstanding the inward conviction to the contrary by which he is followed during the course of the controversial dialogue, now speaks for the first time, is explained by what follows. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The three friends are silenced, because all their attempts to move Job to a penitent confession that his affliction is the punishment of his sins, have rebounded against this fact, that he was righteous in his own eyes, i.e., that he imagined himself righteous; and because they now (שׁבת of persons, in distinction from חדל, has the secondary notion of involuntariness) know of nothing more to say. Then Elihu's indignation breaks forth in two directions. First, concerning Job, that he justified himself מאלהים, i.e., not a Deo (so that He would be obliged to account him righteous, as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 4:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), but prae Deo. Elihu rightly does not find it censurable in Job, that as a more commonly self-righteous man he in general does not consider himself a sinner, which the three insinuate of him (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 15:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 25:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), but that, declaring himself to be righteous, he brings upon God the appearance of injustice, or, as Jehovah also says further on, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 40:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", that he condemns God in order that he may be able to maintain his own righteousness. Secondly, concerning the three, that they have found no answer by which they might have been able to disarm Job in his maintenance of his own righteousness at the expense of the divine justice, and that in consequence of this they have condemned Job. Hahn translates: so that they should have represented Job as guilty; but that they have not succeeded in stamping the servant of God as a רשׁע, would wrongly excite Elihu's displeasure. And Ewald translates: and that they had nevertheless condemned him (345, a); but even this was not the real main defect of their opposition. The fut. consec. describes the condemnation as the result of their inability to hit upon the right answer; it was a miserable expedient to which they had recourse. According to the Jewish view, ויּרשׁיעוּ את־איּוב is one of the eighteen תקוני סופרים (correctiones scribarum), since it should be וירשׁיעו את־האלהים. But it is not the friends who have been guilty of this sin of הרשׁיע against God, but Job, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 40:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", to whom Elihu opposes the sentence אל לא־ירשׁיע, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 34:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Our judgment of another such tiqqûn, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 7:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", was more favourable. That Elihu, notwithstanding the inward conviction to the contrary by which he is followed during the course of the controversial dialogue, now speaks for the first time, is explained by what follows. ",
            "children": []
          }
        ]
      }
    ]
  }
]