[{"header":"Chapter 3"},{"num":1,"verse":"See what love the Father has bestowed on us that we may be called the children of God. Yet so we are. The reason the world does not know us is that it did not know him. "},{"num":2,"verse":"Beloved, we are God’s children now; what we shall be has not yet been revealed. We do know that when it is revealed we shall be like him, for we shall see him as he is. "},{"num":3,"verse":"Everyone who has this hope based on him makes himself pure, as he is pure."},{"num":4,"verse":"Avoiding Sin. Everyone who commits sin commits lawlessness, for sin is lawlessness. "},{"num":5,"verse":"You know that he was revealed to take away sins, and in him there is no sin. "},{"num":6,"verse":"No one who remains in him sins; no one who sins has seen him or known him. "},{"num":7,"verse":"Children, let no one deceive you. The person who acts in righteousness is righteous, just as he is righteous. "},{"num":8,"verse":"Whoever sins belongs to the devil, because the devil has sinned from the beginning. Indeed, the Son of God was revealed to destroy the works of the devil. "},{"num":9,"verse":"No one who is begotten by God commits sin, because God’s seed remains in him; he cannot sin because he is begotten by God. "},{"num":10,"verse":"In this way, the children of God and the children of the devil are made plain; no one who fails to act in righteousness belongs to God, nor anyone who does not love his brother."},{"num":11,"verse":"For this is the message you have heard from the beginning: we should love one another, "},{"num":12,"verse":"unlike Cain who belonged to the evil one and slaughtered his brother. Why did he slaughter him? Because his own works were evil, and those of his brother righteous. "},{"num":13,"verse":"Do not be amazed, [then,] brothers, if the world hates you. "},{"num":14,"verse":"We know that we have passed from death to life because we love our brothers. Whoever does not love remains in death. "},{"num":15,"verse":"Everyone who hates his brother is a murderer, and you know that no murderer has eternal life remaining in him. "},{"num":16,"verse":"The way we came to know love was that he laid down his life for us; so we ought to lay down our lives for our brothers. "},{"num":17,"verse":"If someone who has worldly means sees a brother in need and refuses him compassion, how can the love of God remain in him? "},{"num":18,"verse":"Children, let us love not in word or speech but in deed and truth."},{"num":19,"verse":"[Now] this is how we shall know that we belong to the truth and reassure our hearts before him "},{"num":20,"verse":"in whatever our hearts condemn, for God is greater than our hearts and knows everything. "},{"num":21,"verse":"Beloved, if [our] hearts do not condemn us, we have confidence in God "},{"num":22,"verse":"and receive from him whatever we ask, because we keep his commandments and do what pleases him. "},{"num":23,"verse":"And his commandment is this: we should believe in the name of his Son, Jesus Christ, and love one another just as he commanded us. "},{"num":24,"verse":"Those who keep his commandments remain in him, and he in them, and the way we know that he remains in us is from the Spirit that he gave us."}]