[{"num":3,"verse":"See what amazing love the Father has given us! Because of it, we are called children of God. And that’s what we really are! The world doesn’t know us because it didn’t know him. "},{"num":2,"verse":"Dear friends, now we are children of God. He still hasn’t let us know what we will be. But we know that when Christ appears, we will be like him. That’s because we will see him as he really is. "},{"num":3,"verse":"Christ is pure. All who hope to be like him make themselves pure."},{"num":4,"verse":"Everyone who sins breaks the law. In fact, breaking the law is sin. "},{"num":5,"verse":"But you know that Christ came to take our sins away. And there is no sin in him. "},{"num":6,"verse":"No one who remains joined to him keeps on sinning. No one who keeps on sinning has seen him or known him."},{"num":7,"verse":"Dear children, don’t let anyone lead you astray. The person who does what is right is holy, just as Christ is holy. "},{"num":8,"verse":"The person who does what is sinful belongs to the devil. That’s because the devil has been sinning from the beginning. But the Son of God came to destroy the devil’s work. "},{"num":9,"verse":"Those who are God’s children will not keep on sinning. God’s very nature remains in them. They can’t go on sinning. That’s because they are God’s children. "},{"num":10,"verse":"Here is how you can tell the difference between God’s children and the devil’s children. Anyone who doesn’t do what is right isn’t God’s child. And anyone who doesn’t love their brother or sister isn’t God’s child either."},{"header":"More Instructions About Loving and Hating One Another"},{"num":11,"verse":"From the beginning we have heard that we should love one another. "},{"num":12,"verse":"Don’t be like Cain. He belonged to the evil one. He murdered his brother. And why did he murder him? Because the things Cain had done were wrong. But the things his brother had done were right. "},{"num":13,"verse":"My brothers and sisters, don’t be surprised if the world hates you. "},{"num":14,"verse":"We know that we have left our old dead way of life. And we have entered into new life. We know this because we love one another. Anyone who doesn’t love still lives in their old condition. "},{"num":15,"verse":"Anyone who hates their brother or sister is a murderer. And you know that no murderer has eternal life."},{"num":16,"verse":"We know what love is because Jesus Christ gave his life for us. So we should give our lives for our brothers and sisters. "},{"num":17,"verse":"Suppose someone sees a brother or sister in need and is able to help them. And suppose that person doesn’t take pity on these needy people. Then how can the love of God be in that person? "},{"num":18,"verse":"Dear children, don’t just talk about love. Put your love into action. Then it will truly be love."},{"num":19,"verse":"Here’s how we know that we hold to the truth. And here’s how we put our hearts at rest, knowing that God is watching. "},{"num":20,"verse":"If our hearts judge us, we know that God is greater than our hearts. And he knows everything. "},{"num":21,"verse":"Dear friends, if our hearts do not judge us, we can be bold with God. "},{"num":22,"verse":"And he will give us anything we ask. That’s because we obey his commands. We do what pleases him. "},{"num":23,"verse":"God has commanded us to believe in the name of his Son, Jesus Christ. He has also commanded us to love one another. "},{"num":24,"verse":"The one who obeys God’s commands remains joined to him. And he remains joined to them. Here is how we know that God lives in us. We know it because of the Holy Spirit he gave us."}]