[{"num":3,"verse":"Consider the incredible love that the Father has shown us in allowing us to be called “children of God”—and that is not just what we are called, but what we are. Our heredity on the Godward side is no mere figure of speech—which explains why the world will no more recognise us than it recognised Christ."},{"num":2,"verse":"Oh, dear children of mine (forgive the affection of an old man!), have you realised it? Here and now we are God’s children. We don’t know what we shall become in the future. We only know that, if reality were to break through, we should reflect his likeness, for we should see him as he really is!"},{"num":3,"verse":"Everyone who has at heart a hope like that keeps himself pure, for he knows how pure Christ is."},{"header":"Conduct will show who is a man’s spiritual father"},{"num":4,"verse":"Everyone who commits sin breaks God’s law, for that is what sin is, by definition—a breaking of God’s law. You know, moreover, that Christ became man for the purpose of removing sin, and he himself was quite free from sin. The man who lives “in Christ” does not habitually sin. The regular sinner has never seen or known him."},{"num":7,"verse":"You, my children, are younger than I am, and I don’t want you to be taken in by any clever talk just here. The man who lives a consistently good life is a good man, as surely as God is good. But the man whose life is habitually sinful is spiritually a son of the devil, for the devil is behind all sin, as he always has been. Now the Son of God came to earth with the express purpose of liquidating the devil’s activities. The man who is really God’s son does not practise sin, for God’s nature is in him, for good, and such a heredity is incapable of sin."},{"num":10,"verse":"Here we have a clear indication as to who are the children of God and who are the children of the devil. The man who does not lead a good life is no son of God, nor is the man who fails to love his brother."},{"num":11,"verse":"For the original command, as you know, is that we should love one another. We are none of us to have the spirit of Cain, who was a son of the devil and murdered his brother. Have you realised his motive? It was just because he realised the goodness of his brother’s life and the rottenness of his own. Don’t be surprised, therefore, if the world hates you."},{"header":"Love and life are inter-connected"},{"num":14,"verse":"We know that we have crossed the frontier from death to life because we do love our brothers. The man without love for his brothers is living in death already. The man who actively hates his brother is a potential murderer, and you will readily see that the eternal life of God cannot live in the heart of a murderer."},{"num":16,"verse":"We know and, to some extent realise, the love of God for us because Christ expressed it in laying down his life for us. We must in turn express our love by laying down our lives for those who are our brothers. But as for the well-to-do man who sees his brothers in want but shuts his eyes—and his heart—how could anyone believe that the love of God lives in him? My children, let us not love merely in theory or in words—let us love in sincerity and in practice!"},{"header":"Living in love means confidence in God"},{"num":19,"verse":"If we live like this, we shall know that we are children of the truth and can reassure ourselves in the sight of God, even if our own hearts make us feel guilty. For God is infinitely greater than our hearts, and he knows everything."},{"num":21,"verse":"And if, dear friends of mine, when we realise this our hearts no longer accuse us, we may have the utmost confidence in God’s presence. We receive whatever we ask for, because we are obeying his orders and following his plans. His orders are that we should put our trust in the name of his Son, Jesus Christ, and love one another—as we used to hear him say in person."},{"num":24,"verse":"The man who does obey God’s commands lives in God and God lives in him, and the guarantee of his presence within us is the Spirit he has given us."}]