[{"num":3,"verse":"See how glorious a love the Father has given us, that we should be called God’s children—and so we are! The reason the world does not know us is that it did not know Him. "},{"num":2,"verse":"Loved ones, now we are God’s children; and it has not yet been revealed what we will be. But we do know that when it’s revealed, we shall be like Him, because we will see Him just as He is. "},{"num":3,"verse":"Everyone who has this hope in Him purifies himself, just as He is pure."},{"num":4,"verse":"Everyone practicing sin also practices lawlessness—indeed, sin is lawlessness. "},{"num":5,"verse":"You know that Yeshua appeared in order to take away sins, and in Him there is no sin. "},{"num":6,"verse":"No one who abides in Him keeps on sinning; no one who sins has seen Him or known Him. "},{"num":7,"verse":"Children, let no one mislead you! The one who practices righteousness is righteous, just as Yeshua is righteous. "},{"num":8,"verse":"The one who practices sin is of the devil, for the devil has been sinning from the beginning. Ben-Elohim appeared for this purpose—to destroy the works of the devil. "},{"num":9,"verse":"No one born of God practices sin, because God’s seed remains in him. He cannot sin, because he is born of God."},{"header":"Loving Children Emulate His Actions"},{"num":10,"verse":"It is clear who are the children of God and who are the children of the devil by this—anyone who does not act righteously or love his brother is not of God. "},{"num":11,"verse":"For this is the message you have heard from the beginning—we should love one another. "},{"num":12,"verse":"Do not be like Cain, who was from the evil one and murdered his brother. And why did he murder him? Because his deeds were evil, while his brother’s were righteous."},{"num":13,"verse":" Do not be surprised, brothers and sisters, if the world hates you."},{"num":14,"verse":"We know that we have passed from death to life, because we love our brothers and sisters. The one who does not love remains in death. "},{"num":15,"verse":"Everyone who hates his brother is a murderer—and you know that no murderer has eternal life abiding in him. "},{"num":16,"verse":"We have come to know love by this—Yeshua laid down His life for us, and we also ought to lay down our lives for our brothers and sisters. "},{"num":17,"verse":"But if someone has material possessions and sees his brother in need and closes his heart against him, how does the love of God abide in him? "},{"num":18,"verse":"Children, let us not love with word or talk, but in deed and truth!"},{"num":19,"verse":"By this we shall know that we are of the truth, and set our heart at rest before Him "},{"num":20,"verse":"whenever our heart condemns us. For God is greater than our heart, and knows all things. "},{"num":21,"verse":"Loved ones, if our heart does not condemn us, we have confidence before God; "},{"num":22,"verse":"and whatever we ask, we receive from Him, because we keep His commandments and do what is pleasing in His sight. "},{"num":23,"verse":"Now this is His commandment—that we should believe in the name of His Son, Yeshua the Messiah, and love one another, just as He commanded us. "},{"num":24,"verse":"The one who keeps His commandments abides in God, and God in him. We know that He abides in us by this—by the Spirit He has given us."}]