[{"num":18,"verse":"¶ And the LORD said unto Aaron, Thou and thy sons and thy father’s house with thee shall bear the iniquity of the sanctuary; and thou and thy sons with thee shall bear the iniquity of your priesthood."},{"num":2,"verse":"And thy brethren also of the tribe of Levi, the tribe of thy father, bring thou with thee, that they may be joined unto thee and serve thee; but thou and thy sons with thee shall serve before the tabernacle of the testimony."},{"num":3,"verse":"And they shall keep thy charge, and the charge of all the tabernacle; only they shall not come near the holy vessels or the altar, that neither they, nor ye also, die."},{"num":4,"verse":"And they shall join themselves unto thee and keep the charge of the tabernacle of the testimony in all the service of the tabernacle; and no stranger shall come near unto you."},{"num":5,"verse":"And ye shall have the charge of the sanctuary and the charge of the altar, that there be no more wrath upon the sons of Israel."},{"num":6,"verse":"For behold, I have taken your brethren the Levites from among the sons of Israel, given unto you as a gift of the LORD, to serve in the ministry of the tabernacle of the testimony."},{"num":7,"verse":"Therefore thou and thy sons with thee shall keep your priesthood for every thing of the altar and within the veil, and ye shall minister; for I have given the service of your priesthood as a gift, and the stranger that comes near shall die."},{"num":8,"verse":"¶ The LORD spoke further unto Aaron, Behold, I also have given thee the charge of my offerings; all the dedicated things of the sons of Israel I have given unto thee by reason of the anointing, and to thy sons, by a perpetual statute."},{"num":9,"verse":"This shall be thine of the holy things, reserved from the fire: every offering of theirs, every present of theirs, and every offering that represents their sin, and every offering that represents their guilt, which they shall render unto me, shall be most holy for thee and for thy sons."},{"num":10,"verse":"In the sanctuary shalt thou eat it; every male shall eat it; it shall be holy unto thee."},{"num":11,"verse":"This also shall be thine: the heave offering of their gifts. All the wave offerings of the sons of Israel, I have given them unto thee and to thy sons and to thy daughters with thee, by a statute for ever; everyone that is clean in thy house shall eat of it."},{"num":12,"verse":"All the best of the oil and all the best of the wine and of the wheat, the firstfruits of this, which they shall present unto the LORD, this have I given thee."},{"num":13,"verse":"The firstfruits of theirs of all the things of the land, which they shall bring unto the LORD, shall be thine; everyone that is clean in thy house shall eat of it."},{"num":14,"verse":"Every anathema in Israel shall be thine."},{"num":15,"verse":"Every thing that opens the womb in all flesh, which they shall offer unto the LORD, whether it is of men or animals, shall be thine; nevertheless the firstborn of man shalt thou surely ransom, and the firstborn of unclean animals shalt thou ransom."},{"num":16,"verse":"And from a month old shalt thou effect their ransom, a ransom according to thine estimation, for the price of five shekels, after the shekel of the sanctuary, which is twenty gerahs."},{"num":17,"verse":"But the firstborn of a cow, or the firstborn of a sheep, or the firstborn of a goat, thou shalt not ransom; they are sanctified; thou shalt sprinkle their blood upon the altar and shalt burn their fat for an offering on fire, for an acceptable savour unto the LORD."},{"num":18,"verse":"And the flesh shall be thine, as the wave breast and as the right shoulder shall be thine."},{"num":19,"verse":"All the heave offerings of the holy things, which the sons of Israel offer unto the LORD, I have given for thee and for thy sons and for thy daughters with thee, by a perpetual statute; it is a covenant of salt for ever before the LORD for thee and for thy seed with thee."},{"num":20,"verse":"¶ And the LORD spoke unto Aaron, Thou shalt have no inheritance in their land, neither shalt thou have any part among them. I am thy part and thine inheritance among the sons of Israel."},{"num":21,"verse":"And, behold, I have given the sons of Levi all the tithes in Israel for an inheritance, for their ministry because they serve in the ministry of the tabernacle of the testimony."},{"num":22,"verse":"Neither must the sons of Israel from now on come near the tabernacle of the testimony lest they bear sin and die because of it."},{"num":23,"verse":"But the Levites shall do the service of the tabernacle of the testimony, and they shall bear their iniquity by a perpetual statute throughout your ages, and they shall not possess an inheritance among the sons of Israel."},{"num":24,"verse":"For unto the Levites I have given the tithes of the sons of Israel as inheritance, which they shall offer unto the LORD as offerings; therefore, I have said unto them, Among the sons of Israel they shall possess no inheritance."},{"num":25,"verse":"And the LORD spoke unto Moses, saying,"},{"num":26,"verse":"Thus shalt thou speak unto the Levites and say unto them, When ye take the tithes from the sons of Israel which I have given you from them for your inheritance, then ye shall present a tithe of the tithes as an offering unto the LORD."},{"num":27,"verse":"And ye shall count your offering as though it were the grain of the threshingfloor and as the fullness of the winepress."},{"num":28,"verse":"Thus ye also shall offer an offering unto the LORD of all your tithes, which ye shall have received of the sons of Israel; and ye shall give of them an offering unto the LORD, to Aaron the priest."},{"num":29,"verse":"Out of all your gifts ye shall offer every offering unto the LORD, of all the best thereof ye shall offer the portion that is to be dedicated."},{"num":30,"verse":"Therefore thou shalt say unto them, When ye offer the best thereof from it, then it shall be counted unto the Levites as the fruit of the threshingfloor and as the fruit of the winepress."},{"num":31,"verse":"And ye shall eat it in any place, ye and your family; for it is your reward for your ministry in the tabernacle of the testimony."},{"num":32,"verse":"And ye shall bear no sin by reason of it, when ye have offered from it the best of it; and ye shall not pollute the holy things of the sons of Israel, and ye shall not die."}]