[{"header":"The Palace Built in 13 Years"},{"num":7,"verse":"Solomon took 13 years to finish building his palace. "},{"num":2,"verse":"He built a hall named the Forest of Lebanon. It was 150 feet long, 75 feet wide, and 45 feet high. It had four rows of cedar pillars supporting cedar beams. "},{"num":3,"verse":"The hall was covered with cedar above the side rooms, which were supported by 45 pillars (15 per row). "},{"num":4,"verse":"The windows were in three rows facing each other on opposite sides of the palace. "},{"num":5,"verse":"All the doors and doorframes were square. There were three doors facing each other on opposite sides of the palace."},{"num":6,"verse":"Solomon made the Hall of Pillars 75 feet long and 45 feet wide. In front of the hall was an entrance hall with pillars."},{"num":7,"verse":"He made the Hall of Justice, where he sat on his throne and served as judge. The hall was covered with cedar from floor to ceiling."},{"num":8,"verse":"His own private quarters were in a different location than the Hall of Justice, but they were similar in design. Solomon also built private quarters like this for his wife, Pharaoh’s daughter."},{"num":9,"verse":"From the foundation to the roof, all these buildings, including the large courtyard, were built with high-grade stone blocks. The stone blocks were cut to size and trimmed with saws on their inner and outer faces. "},{"num":10,"verse":"The foundation was made with large, high-grade stones (some 12 feet long, others 15 feet long). "},{"num":11,"verse":"Above the foundation were cedar beams and high-grade stone blocks, which had been cut to size. "},{"num":12,"verse":"The large courtyard had three layers of cut stone blocks and a layer of cedar beams, like the inner courtyard of Yahweh’s temple and the entrance hall."},{"header":"The Temple Furnishings(A)"},{"num":13,"verse":"King Solomon had Hiram brought from Tyre. "},{"num":14,"verse":"Hiram was the son of a widow from the tribe of Naphtali. His father, a native of Tyre, was a skilled bronze craftsman. Hiram was highly skilled, resourceful, and knowledgeable about all kinds of bronze craftsmanship. He came to King Solomon and did all his bronze work."},{"num":15,"verse":"He made two bronze pillars. Each was 27 feet high and 18 feet in circumference. "},{"num":16,"verse":"He made two capitals of cast bronze to put on top of the pillars. Each capital was 7½ feet high. "},{"num":17,"verse":"He also made seven rows of filigree and chains for each capital. "},{"num":18,"verse":"After he made the pillars, he made two rows of decorations around the filigree to cover the capitals which were above the pillars. He made the capitals identical to each other. "},{"num":19,"verse":"The capitals on top of the pillars in the entrance hall were lily-shaped. Each was six feet high. "},{"num":20,"verse":"Two hundred pomegranates in rows were directly above the bowl-shaped parts around the filigree on the capitals on both pillars."},{"num":21,"verse":"Hiram set up the pillars in the temple’s entrance hall. He set up the pillar on the right and named it Jachin [He Establishes]. Then he set up the pillar on the left and named it Boaz [In Him Is Strength]. "},{"num":22,"verse":"There were lily-shaped capitals at the top of the pillars. He finished the work on the pillars."},{"num":23,"verse":"Hiram made a pool from cast metal. It was 15 feet in diameter. It was round, 7½ feet high, and had a circumference of 45 feet. "},{"num":24,"verse":"Under the rim were two rows of gourds all around the 45-foot circumference of the pool. They were cast in metal when the pool was cast. "},{"num":25,"verse":"The pool was set on 12 metal bulls. Three bulls faced north, three faced west, three faced south, and three faced east. The pool was set on them, and their hindquarters were toward the center of the pool. "},{"num":26,"verse":"The pool was three inches thick. Its rim was like the rim of a cup, shaped like a lily’s bud. It held 12,000 gallons."},{"num":27,"verse":"He made ten bronze stands. Each stand was 6 feet square and 4½ feet high. "},{"num":28,"verse":"The stands were made this way: They had side panels set in frames. "},{"num":29,"verse":"On the panels set in frames were lions, oxen, and angels. These were also on the frames. Above and below the lions and the cattle were engraved designs. "},{"num":30,"verse":"Each stand had four bronze wheels on bronze axles and four supports beneath the basin. The supports were made of cast metal with designs on the sides. "},{"num":31,"verse":"Each had a 1½-foot-deep opening in the center to the circular frame on top. The opening was round, formed like a pedestal, and was two feet wide. Around the opening there were engravings. But the panels were square, not round. "},{"num":32,"verse":"The four wheels were under the panels, and the axles were attached to the stand. Each wheel was two feet high. "},{"num":33,"verse":"The wheels were made like chariot wheels. The axles, rims, spokes, and hubs were all cast metal. "},{"num":34,"verse":"The four supports at the four corners of each stand were part of the stand. "},{"num":35,"verse":"The top of each stand had a round, nine-inch-high band. Above the stand were supports which were part of the panels. "},{"num":36,"verse":"Hiram engraved angels, lions, palm trees, and designs in every available space on the supports and panels. "},{"num":37,"verse":"This is the way he made the ten stands. All of them were cast in the same mold, identical in size and shape."},{"num":38,"verse":"Hiram also made ten bronze basins. Each basin held 240 gallons. Every basin was six feet wide. There was one basin on each of the ten stands. "},{"num":39,"verse":"He put five stands on the south side of the temple and five on the north side of the temple. He set the pool on the south side of the temple in the southeast corner. "},{"num":40,"verse":"Hiram also made pots, shovels, and bowls."},{"num":41,"verse":"2 pillars, the bowl-shaped capitals on top of the 2 pillars, and 2 sets of filigree to cover the 2 bowl-shaped capitals on top of the pillars, "},{"num":42,"verse":"400 pomegranates for the 2 sets of filigree (2 rows of pomegranates for each filigree to cover the 2 bowl-shaped capitals on the pillars), "},{"num":43,"verse":"10 stands and 10 basins on the stands, "},{"num":44,"verse":"1 pool, 12 bulls under the pool, "},{"num":45,"verse":"pots, shovels, and bowls. Hiram made all these utensils out of polished bronze for Yahweh’s temple at King Solomon’s request. "},{"num":46,"verse":"The king cast them in foundries in the Jordan Valley between Succoth and Zarethan. "},{"num":47,"verse":"Solomon left all the products unweighed because so much bronze was used. No one tried to determine how much the bronze weighed."},{"num":48,"verse":"Solomon made all the furnishings for Yahweh’s temple: the gold altar, the gold table on which the bread of the presence was placed, "},{"num":49,"verse":"lamp stands of pure gold (five on the south side and five on the north in front of the inner room), flowers, lamps, gold tongs, "},{"num":50,"verse":"dishes, snuffers, bowls, saucers, incense burners of pure gold, the gold sockets for the doors of the inner room (the most holy place), and the doors of the temple."},{"num":51,"verse":"All the work King Solomon did on Yahweh’s temple was finished. He brought the holy things that had belonged to his father David—the silver, gold, and utensils—and put them in the storerooms of Yahweh’s temple."}]