[{"header":"Solomon’s Palace Complex"},{"num":7,"verse":"But it took Solomon 13 years to build and complete his own palace. "},{"num":2,"verse":"He also built the Forest House of Lebanon: its length was 100 cubits, its width 50 cubits and its height 30 cubits, built on four rows of cedar pillars, with cedar beams upon the pillars. "},{"num":3,"verse":"It was paneled with cedar above the side chambers, which were on 45 pillars—15 in a row. "},{"num":4,"verse":"And there were window frames in three rows, with window opposite window in three ranks. "},{"num":5,"verse":"And all the doorways had rectangular frame, and with window opposite to window in three tiers."},{"num":6,"verse":"He also made a portico of columns, 50 cubits long and 30 cubits wide, with a porch in front, and in front of that were pillars and an overhanging roof. "},{"num":7,"verse":"He also made the Hall of the Throne where he would judge—the Hall of Justice. It was paneled with cedar from the floor to the ceiling."},{"num":8,"verse":"His house where he would dwell, set farther back of the hall, was of the same construction. He also made a house like this hall for Pharaoh’s daughter, whom Solomon had taken to wife."},{"num":9,"verse":"All these were made of expensive stones—stone cut to size and sawed with saws inside and outside—from the foundation to the top and from the outside to the great court. "},{"num":10,"verse":"The foundation was also made of expensive stones—huge stones, stones eight cubits and stones ten cubits. "},{"num":11,"verse":"Above were expensive stones, cut to measure, and cedar wood. "},{"num":12,"verse":"The surrounding great courtyard had three rows of cut stone and a row of cedar beams, the same as the inner court of the House of Adonai and the portico of the House."},{"header":"Hiram the Bronze Craftsman"},{"num":13,"verse":"King Solomon sent for and had Hiram brought from Tyre. "},{"num":14,"verse":"He was a widow’s son from the tribe of Naphtali, while his father was a man of Tyre, a coppersmith, and he was filled with wisdom, understanding and skill to do any work in bronze. So he came to King Solomon and executed all his work. "},{"num":15,"verse":"He fashioned the two bronze pillars, 18 cubits high and 12 cubits in circumference each. "},{"num":16,"verse":"He also made two capitals of molten bronze to set upon the tops of the pillars (the height of each capital was five cubits), "},{"num":17,"verse":"nettings of latticework and twisted threads of chain work for the capitals were on top of the pillars—seven for the one capital and seven for the other capital. "},{"num":18,"verse":"So he made the pillars with two rows of pomegranates all around on the netting covering the capitals on top of each capital. "},{"num":19,"verse":"The capitals that were on the top of the pillars in the portico were of lily design, four cubits high. "},{"num":20,"verse":"So also the capitals on the two pillars—close to the belly next to the netting were the pomegranates in rows of 200 around both capitals."},{"num":21,"verse":"Thus he set up the pillars at the porticos of the Temple. He set up the right pillar and named it Jachin, and he set up the left pillar and named it Boaz."},{"num":22,"verse":" On the top of the pillars was lily design. So the work of the pillars was finished."},{"num":23,"verse":"Next he made the sea of cast metal, ten cubits across from brim to brim, circular in form, five cubits in its height and 30 cubits in circumference. "},{"num":24,"verse":"Under its brim there were gourds encircling it, ten per cubit, completely surrounding the sea. The gourds were cast in two rows in one piece with it. "},{"num":25,"verse":"It stood on twelve oxen, three facing north, three facing west, three facing south, and three facing east; and the sea was set on top of them, and all their rear parts were inward. "},{"num":26,"verse":"It was a handbreadth thick, and its brim was made like the brim of a cup, like the petals of a lily; it held 11,000 gallons."},{"num":27,"verse":"Then he made ten bases of bronze—the length of each base was four cubits, the width four cubits and the height three cubits. "},{"num":28,"verse":"The structure of the bases was as follows: they had borders, and borders between the frames, "},{"num":29,"verse":"and on the borders that were below the frames were lions, oxen and cheruvim. On the frames there was a pedestal manner above, and beneath the lions and oxen were wreaths of hanging work. "},{"num":30,"verse":"Each base had four bronze wheels with bronze axles. Its four legs had brackets; the brackets were beneath the laver, cast with wreaths at each side. "},{"num":31,"verse":"Its opening inside the crown at the top was a cubit high, and its opening was round like the design of a pedestal, a cubit and a half, and also on its opening were engravings, and their borders were square, not round. "},{"num":32,"verse":"The four wheels were underneath the borders, and the axles of the wheels were in the base. The height of a wheel was a cubit and half. "},{"num":33,"verse":"And the structure of the wheels was like the structure of a chariot wheel; their axletrees, their rims, their spokes, and their hubs were all cast metal. "},{"num":34,"verse":"There were four brackets at the four corners of each base; each bracket was of one piece with the base itself. "},{"num":35,"verse":"On top of the base there was a band half a cubit high encircling it—its braces and its borders were part of it. "},{"num":36,"verse":"On the plates of the braces and on its borders, he engraved cheruvim, lions and palm trees, wherever there was clear space around each, with encircling wreaths. "},{"num":37,"verse":"He made the ten bases like this—all of them cast from the same mold, the same size and same shape."},{"num":38,"verse":"Then he made ten basins of bronze: one basin held 220 gallons. Each basin was four cubits, and on each of the ten bases was one basin. "},{"num":39,"verse":"Then he set up the laver stands, five on the right side of the House and five on the left side of the House, and set up the sea of cast metal on the right side of the House eastward, toward the south. "},{"num":40,"verse":"Then Hiram made the basins, the shovels, and the sprinkling bowls."},{"num":41,"verse":"the two pillars, the two bowls of the capitals that were on the top of the pillars, the two nettings to cover the two bowls of the capitals that were on the top of the pillars, "},{"num":42,"verse":"the 400 pomegranates for the two nettings, two rows of pomegranates for each to cover the two bowls of the capitals on top of the pillars, "},{"num":43,"verse":"the ten bases and the ten basins on the bases, "},{"num":44,"verse":"the one sea and the 12 oxen under the sea, "},{"num":45,"verse":"the pots, the shovels and the basins. All these vessels Hiram made for King Solomon in the House of Adonai were made of polished bronze. "},{"num":46,"verse":"The king had them cast in the plain of the Jordan, with clay of the ground between Sukkot and Zarethan. "},{"num":47,"verse":"Solomon left all the vessels unweighed, because they were too many—the weight of the bronze could not be determined."},{"num":48,"verse":"So Solomon made all the equipment that was to be in the House of Adonai: the golden altar, the table on which was the bread of the presence, of gold; "},{"num":49,"verse":"the menorahs—five on the right side and five on the left in front of the inner Sanctuary—of pure gold; the flowers, the lamps and the tongs, of gold; "},{"num":50,"verse":"the cups, the snuffers, the bowls, the wick trimmers and the fire pans, of pure gold; the hinges for the doors of the inner House, the Holy of Holies, and for the doors of the House, that is, of the Temple, of gold."},{"num":51,"verse":"When all the work that King Solomon did in Adonai’s House was finished, Solomon brought in the things that his father David had dedicated—the silver, the gold and the vessels—and put them in the treasuries of the House of Adonai."}]