[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(18) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Because there is wrath.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—“For there is wrath: now, therefore, beware lest He take thee away with one stroke, so that great ransom cannot deliver thee.” Literally it is, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "let not a great ransom deliver thee, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "but the sense is probably like the Authorised Version.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Job 36:18-19",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 36:18-19",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Because there is wrath — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Conceived by God against thee; because, by thy pleading the cause of the wicked, thou hast provoked God’s wrath against thee; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "beware lest he take thee away by his stroke — ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "בשׂפק",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "besaphek, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "properly, with the stroke of his hand or foot, an allusion to men’s expressing their anger by striking with their hand or stamping with their foot. Look to thyself, and reconcile thyself to God by true repentance, while thou hast an opportunity. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "A great ransom cannot deliver thee — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "If once God’s wrath take hold on thee, and sentence be executed upon thee before thou repentest and humblest thyself before thy judge, neither riches nor friends, nor any person or thing in heaven or earth can redeem thee: no ransom or price will be accepted for thee. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Will he esteem thy riches? — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "If thou hadst as much of them as ever; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "no, nor all the forces of strength — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The strongest forces; not if thou hadst all the treasure and all the force which all the powers of earth could muster up. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "36:15-23 Elihu shows that Job caused the continuance of his own trouble. He cautions him not to persist in frowardness. Even good men need to be kept to their duty by the fear of God's wrath; the wisest and best have enough in them to deserve his stroke. Let not Job continue his unjust quarrel with God and his providence. And let us never dare to think favourably of sin, never indulge it, nor allow ourselves in it. Elihu thinks Job needed this caution, he having chosen rather to gratify his pride and humour by contending with God, than to mortify them by submitting, and accepting the punishment. It is absurd for us to think to teach Him who is himself the Fountain of light, truth, knowledge, and instruction. He teaches by the Bible, and that is the best book; teaches by his Son, and he is the best Master. He is just in all proceedings.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Because there is wrath - That is, the wrath of God is to be dreaded. The meaning is, that if Job persevered in the spirit which he had manifested, he had every reason to expect that God would suddenly cut him off. He might now repent and find mercy, but he had shown the spirit of those who were rebellions in affliction, and if he persevered in that, he had nothing to expect but the wrath of God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "With his stroke - With his smiting or chastisement; compare Job 34:26.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "With his stroke - With his smiting or chastisement; compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 34:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Then a great ransom cannot deliver thee - Margin, \"turn thee aside.\" The meaning is, that a great ransom could not prevent him from being cut off. On the meaning of the word ransom, see the notes at Job 33:24. The idea here is, not that a great ransom could not deliver him \"after\" he was cut off and consigned to hell - which would be true; but that when he had manifested a spirit of insubmission a little longer, nothing could save him from being cut off from the land of the living. God would not spare him on account; of wealth, or rank, or age, or wisdom. None of these things would be a \"ransom\" in virtue of which his forfeited life would be preserved. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Then a great ransom cannot deliver thee - Margin, \"turn thee aside.\" The meaning is, that a great ransom could not prevent him from being cut off. On the meaning of the word ransom, see the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 33:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The idea here is, not that a great ransom could not deliver him \"after\" he was cut off and consigned to hell - which would be true; but that when he had manifested a spirit of insubmission a little longer, nothing could save him from being cut off from the land of the living. God would not spare him on account; of wealth, or rank, or age, or wisdom. None of these things would be a \"ransom\" in virtue of which his forfeited life would be preserved. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "18. (Nu 16:45; Ps 49:6, 7; Mt 16:26). Even the \"ransom\" by Jesus Christ (Job 33:24) will be of no avail to wilful despisers (Heb 10:26-29).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "with his stroke—(Job 34:26). Umbreit translates, \"Beware lest the wrath of God (thy severe calamity) lead thee to scorn\" (Job 34:7; 27:23). This accords better with the verb in the parallel clause, which ought to be translated, \"Let not the great ransom (of money, which thou canst give) seduce thee (Margin, turn thee aside, as if thou couldst deliver thyself from \"wrath\" by it). As the \"scorn\" in the first clause answers to the \"judgment of the wicked\" (Job 36:17), so \"ransom\" (\"seduce\") to \"will he esteem riches\" (Job 36:19). Thus, Job 36:18 is the transition between Job 36:17 and Job 36:19.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Because there is wrath, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to wit, conceived by God against thee. Because by thy pleading the cause of the wicked, thou hast deserved that God should give sentence against thee, as was now said, and hast provoked God’s wrath against thee; therefore look to thyself, and reconcile thyself to God by true repentance whilst thou mayst, and before sentence be executed upon thee. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Beware:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " this is not in the Hebrew, but is necessarily to be understood to make up the sense, and is oft understood in the like cases, and that before this Hebrew particle ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "pen",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 3:22 11:4 42:4 Isaiah 36:8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 3:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 11:4 42:4 ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 36:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". See the like also ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Matthew 25:9 Acts 5:39",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 25:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 5:39",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "With his stroke; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " properly, with the stroke of his hand or foot. It is an allusion to men, who oft express their anger by clapping their hands, or stamping with their feet. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Then a great ransom cannot deliver thee; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for if once God’s wrath take hold of thee, and sentence be executed upon thee before thou dost repent and humble thyself to thy judge, neither riches, nor friends, no, nor any person or thing in heaven and earth, can redeem thee; no ransom or price will be accepted for thee. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Because there is wrath,.... Either wrath in Job, so some; indignation and impatience under the afflicting hand of God, expressed by cursing the day of his birth, and by his angry pleadings with God: and therefore Elihu advises him to beware of it, and check this impetuous spirit; cease from his anger and forsake wrath, and fret not himself to do evil, and provoke the Lord to take him away at once, and then his case would be irretrievable. Or rather wrath in God, which is revealed from heaven against all ungodliness and unrighteousness of men. His vindictive and punitive justice, to revenge and punish wickedness, the effects of which are sometimes awful judgments on men in this life; and eternal vengeance hereafter, called wrath to come: this is laid up in store with him, and sealed up in his treasures, prepared in his purposes and decrees, is revealed in his law, and breaks forth in various instances; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 16:46",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And there is an appearance of wrath, a little wrath, which is no other than love displeased, in the afflictions and chastisements of God's people, and might be perceived by Job: and this being the case, Elihu advises him to ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "beware; which, though not expressed in the original, is well supplied; and his meaning is, that he would be cautious of what he said, and not go on to multiply words against God; speak unbecomingly of him, arraign his justice, and find fault with his dealings with him; as well as beware of his actions, conduct, and behaviour, that his tongue and his doings be not against the Lord, to provoke the eyes of his glory; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "lest he take thee away with his stroke; out of the world by death, which is the stroke of his hand; and is sometimes given suddenly, and in an awful manner, in wrath and vengeance. Some render the last word, \"with clapping of hands\" (y); either the hands of men, Job 27:23; or of God; expressing his exultation and pleasure at the death of such a person, laughing at his calamity, and mocking when fear cometh; which is dreadful and tremendous; ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "lest he take thee away with his stroke; out of the world by death, which is the stroke of his hand; and is sometimes given suddenly, and in an awful manner, in wrath and vengeance. Some render the last word, \"with clapping of hands\" (y); either the hands of men, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 27:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; or of God; expressing his exultation and pleasure at the death of such a person, laughing at his calamity, and mocking when fear cometh; which is dreadful and tremendous; ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "then a great ransom cannot deliver thee: there is no ransom on earth equal to the life or soul of man; \"what shall a man give in exchange for his soul?\" Matthew 16:26; see Psalm 49:6. The great ransom of all is the ransom of Christ, which Elihu had made mention of before, Job 33:24; and what else could he have in his mind now? This is the ransom found by infinite wisdom, which Christ came to give, and has given; and by which he has ransomed his people from him that is stronger than they, from the bondage of sin, of Satan, of the world, of hell and death, and everlasting destruction: and this is a great one, plenteous redemption, a great salvation; the ransomer is the great God and our Saviour; the ransom price is not corruptible things, as silver and gold, but the precious blood of Christ, his life, yea, he himself. How great must this ransom be! and it is given for great sinners, the chief of them; and is sufficient for all the elect of God, both Jews and Gentiles: and yet, as great as it is, it is of no avail to one that God has taken away by a stroke out of this world, and sent to everlasting destruction; not through want of sufficiency in this ransom, but by reason of the final and unalterable state of such persons; as, even in the present life, it is of no avail to the deniers and despisers of it, Hebrews 10:26. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "then a great ransom cannot deliver thee: there is no ransom on earth equal to the life or soul of man; \"what shall a man give in exchange for his soul?\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 16:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 49:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The great ransom of all is the ransom of Christ, which Elihu had made mention of before, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 33:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and what else could he have in his mind now? This is the ransom found by infinite wisdom, which Christ came to give, and has given; and by which he has ransomed his people from him that is stronger than they, from the bondage of sin, of Satan, of the world, of hell and death, and everlasting destruction: and this is a great one, plenteous redemption, a great salvation; the ransomer is the great God and our Saviour; the ransom price is not corruptible things, as silver and gold, but the precious blood of Christ, his life, yea, he himself. How great must this ransom be! and it is given for great sinners, the chief of them; and is sufficient for all the elect of God, both Jews and Gentiles: and yet, as great as it is, it is of no avail to one that God has taken away by a stroke out of this world, and sent to everlasting destruction; not through want of sufficiency in this ransom, but by reason of the final and unalterable state of such persons; as, even in the present life, it is of no avail to the deniers and despisers of it, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 10:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(y) \"complosione manuum\", Tigurine version; so some in Munster. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(y) \"complosione manuum\", Tigurine version; so some in Munster. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "{n} Because there is wrath, beware lest he take thee away with his stroke: then a great ransom cannot deliver thee.",
        "children": [
          {
            "element": "span",
            "class": "cverse3",
            "text": "{n}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Because ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "there is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " wrath, ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "beware",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " lest he take thee away with ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "his",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " stroke: then a great ransom cannot deliver thee.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(n) God punishes you, lest you forget God in your wealth and so perish.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In this verse ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "wrath",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " appears to be that of Job, as “anger,” ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Job 36:13",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 36:13",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". Elihu warns him against allowing it to entice him into rebellion against God, comp. ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 34:37",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The A. V. takes “wrath” as that of God, visible in Job’s afflictions. This gives a good parallel to the “greatness of the ransom” in the next clause. Elihu’s doctrine, however, is that afflictions are not the expression of God’s wrath but of His disciplinary mercy; and his great object is to warn Job against putting this false construction on God’s dealing with him; cf. ch. 33 throughout, ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 36:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "In the second clause he warns Job against being led astray by the greatness of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ransom",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", by which he means Job’s severe afflictions; cf. ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 33:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 18.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Because there is wrath, beware lest he take thee away with his stroke",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The original is exceedingly obscure, and three or four quite distinct renderings have been proposed; but one of the latest critics (Professor Stanley Loathes) prefers to all the other translations that of the Authorized Version. Job is threatened by Elihu with a coming judgment which shall remove him from the earth altogether. Then a great ransom cannot deliver thee. Once let destruction fall, and there is no longer any place for ransom. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Nothing",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " can then deliver thee from thy just punishment. Job 36:18",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "16  And He even bringeth thee out of the jaws of distress",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "To a broad place, whose ground hath no straitness,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And the adorning of thy table shall be full of fatness.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "17  Yet thou art become full of the judging of the evil-doer:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Judging and judgment lay hold on one another!",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "18  For let not anger indeed entice thee to scorning,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And let not the greatness of the ransom mislead thee.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "With Job 36:16 Elihu passes over to the application to Job of what he said in the preceding strophe. Since it is usual to place אף (like גּם and אך) at the beginning of the sentence, although not belonging to the member of the sentence which immediately follows, ואף הסיתך for והסית אף אתך cannot be remarkable. The praet. הסיתך is not promissory, but Elihu says with what design God has decreed the present suffering for Job. הסית מן is like 2 Chronicles 18:31 : out of distress (צר for צר by Rebia magnum), which has him in its jaws, and threatens to swallow him, God brings him away to great prosperity; a thought which Elihu expresses in the imagery of the Psalms of a broad place and a bountiful table (comp. e.g., Psalm 4:2; Psalm 23:5). רחב is locative, and לא־מוּצק תּחתּיה is either a relative clause: whose beneath (ground) is not straitened, no-straitness (in which case מוּצק would not be constr. from the n. hophal. מוּצק, Isa.Isa 9:1, but absol. after the form מחנק, Job 7:15, Ew. 160, c, Anm. 4), Saad. Arab. lâ ḍı̂q fı̂ mûḍ‛hâ (cujus in loco non angustiae); or it is virtually an adj.: without (לא  equals  בּלא, as Job 34:24), comp. on Job 12:24) straitness of what is beneath them, eorum quae sub se habet (comp. on Job 28:5). רחב is fem., like רחוב, Daniel 9:25. A special clause takes the place of the locative, Job 36:16 : and the settling or spreading, i.e., the provision (from נוּח, to come down gradually, to seat one's self) of thy table shall be full of fatness. מלא (whether it be adj. or verb) is treated by attraction, according to the gender of the governed noun; and it is unnecessary, with Rosenm. and others, to derive נחת from נחת (Aram. for ירד).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "With ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 36:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Elihu passes over to the application to Job of what he said in the preceding strophe. Since it is usual to place אף (like גּם and אך) at the beginning of the sentence, although not belonging to the member of the sentence which immediately follows, ואף הסיתך for והסית אף אתך cannot be remarkable. The praet. הסיתך is not promissory, but Elihu says with what design God has decreed the present suffering for Job. הסית מן is like ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 18:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : out of distress (צר for צר by Rebia magnum), which has him in its jaws, and threatens to swallow him, God brings him away to great prosperity; a thought which Elihu expresses in the imagery of the Psalms of a broad place and a bountiful table (comp. e.g., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 4:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 23:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). רחב is locative, and לא־מוּצק תּחתּיה is either a relative clause: whose beneath (ground) is not straitened, no-straitness (in which case מוּצק would not be constr. from the n. hophal. מוּצק, Isa.Isa 9:1, but absol. after the form מחנק, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 7:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", Ew. 160, c, Anm. 4), Saad. Arab. lâ ḍı̂q fı̂ mûḍ‛hâ (cujus in loco non angustiae); or it is virtually an adj.: without (לא  equals  בּלא, as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 34:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), comp. on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 12:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") straitness of what is beneath them, eorum quae sub se habet (comp. on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 28:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). רחב is fem., like רחוב, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 9:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". A special clause takes the place of the locative, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 36:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : and the settling or spreading, i.e., the provision (from נוּח, to come down gradually, to seat one's self) of thy table shall be full of fatness. מלא (whether it be adj. or verb) is treated by attraction, according to the gender of the governed noun; and it is unnecessary, with Rosenm. and others, to derive נחת from נחת (Aram. for ירד).",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "In Job 36:17, דּין is intended of Job's negative judgment concerning God and His dealings (comp. Psalm 76:9, where it signifies a judicial decision, and Proverbs 22:10, where it signifies a wrangling refusal of a fair decision). Job 36:17 is not a conditional clause (Hahn), in which case the praet. hypothet. would have a prominent position, but an adversative predicative clause: but (nevertheless) thou art full of the judging of the evil-doer (evil judging); after which, just as ἀσυνδέτως as Job 36:14, the sad issue in which this judging after the manner of evil-doers results is expressed: such judging and judgment border closely upon one another. Rd., Dietr., and Schlottm. have wrongly reproduced this idea, discerned by Ges., when they translate: judgment and sentence (guilt and punishment) shall seize thee. יתמכוּ, prehendunt scil. se (Ebr.: put forth the hand), is used like the Aram. סמך, to draw nearer, fasten together (Rabb. סמוּך, near at hand), Arab. tamâsaka (from Arab. msk  equals  סמך, as e.g., hanash  equals  נחשׁ). In Job 36:18 we leave the signification thick milk or cream (חמה  equals  חמאה, as Job 29:6) to those who persuade themselves that cream can be metaphorically equivalent to superfluity (Ew., Hirz., Vaih., Hlgst.). Renan's translation: N'espre pas dtourner la colre de Dieu par une amende, we also leave as a simple puzzle to its discoverer, who, with this one exception, is destitute of thoughts proper to the book of Job. In general, the thought, \"do not imagine by riches, by a great ransom, to be able to satisfy the claims of God,\" is altogether out of place here. Moreover, חמה, which, as e.g., דּאגה, Proverbs 12:25 (Ew. 174, g), is construed as masc., cannot be understood of God's wrath, since the poet by הסית will not at one time have ascribed to God a well-meant incitation, at another an enticement in malam partem. That which allures is Job's own חמה, and that not the excitement of his affliction (Hahn), but of his passion; comp. אף, Job 36:13. שׂפק is, however, to be explained according to Job 34:37, comp. Job 27:23 (clapping of hands  equals  derision); and כּפר signifies reconciliation or expiation, as Job 33:24. Elihu admonishes Job not to allow himself to be drawn by the heat of passion into derision, or to deride; nor to be allured from the right way by the ransom which is required of him as the price of restoration to happiness, viz., humble submission to the divine chastisement, as though this ransom were exceeding great. The connection is clear: an adverse verdict (דּין) and condemnation (משׁפּט) are closely connected; for (כּי) hastiness of temper, let it not (פּן( ton ti ) lead thee astray ... thou wouldst not escape the judgment of God! ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 36:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", דּין is intended of Job's negative judgment concerning God and His dealings (comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 76:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where it signifies a judicial decision, and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 22:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where it signifies a wrangling refusal of a fair decision). ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 36:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is not a conditional clause (Hahn), in which case the praet. hypothet. would have a prominent position, but an adversative predicative clause: but (nevertheless) thou art full of the judging of the evil-doer (evil judging); after which, just as ἀσυνδέτως as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 36:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the sad issue in which this judging after the manner of evil-doers results is expressed: such judging and judgment border closely upon one another. Rd., Dietr., and Schlottm. have wrongly reproduced this idea, discerned by Ges., when they translate: judgment and sentence (guilt and punishment) shall seize thee. יתמכוּ, prehendunt scil. se (Ebr.: put forth the hand), is used like the Aram. סמך, to draw nearer, fasten together (Rabb. סמוּך, near at hand), Arab. tamâsaka (from Arab. msk  equals  סמך, as e.g., hanash  equals  נחשׁ). In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 36:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " we leave the signification thick milk or cream (חמה  equals  חמאה, as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 29:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") to those who persuade themselves that cream can be metaphorically equivalent to superfluity (Ew., Hirz., Vaih., Hlgst.). Renan's translation: N'espre pas dtourner la colre de Dieu par une amende, we also leave as a simple puzzle to its discoverer, who, with this one exception, is destitute of thoughts proper to the book of Job. In general, the thought, \"do not imagine by riches, by a great ransom, to be able to satisfy the claims of God,\" is altogether out of place here. Moreover, חמה, which, as e.g., דּאגה, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 12:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (Ew. 174, g), is construed as masc., cannot be understood of God's wrath, since the poet by הסית will not at one time have ascribed to God a well-meant incitation, at another an enticement in malam partem. That which allures is Job's own חמה, and that not the excitement of his affliction (Hahn), but of his passion; comp. אף, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 36:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". שׂפק is, however, to be explained according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 34:37",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 27:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (clapping of hands  equals  derision); and כּפר signifies reconciliation or expiation, as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 33:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Elihu admonishes Job not to allow himself to be drawn by the heat of passion into derision, or to deride; nor to be allured from the right way by the ransom which is required of him as the price of restoration to happiness, viz., humble submission to the divine chastisement, as though this ransom were exceeding great. The connection is clear: an adverse verdict (דּין) and condemnation (משׁפּט) are closely connected; for (כּי) hastiness of temper, let it not (פּן( ton ti ) lead thee astray ... thou wouldst not escape the judgment of God! ",
            "children": []
          }
        ]
      }
    ]
  }
]