[{"header":"Demand for genuine change"},{"num":13,"verse":"Some who were present on that occasion told Jesus about the Galileans whom Pilate had killed while they were offering sacrifices."},{"num":2,"verse":"He replied, “Do you think the suffering of these Galileans proves that they were more sinful than all the other Galileans?"},{"num":3,"verse":"No, I tell you, but unless you change your hearts and lives, you will die just as they did."},{"num":4,"verse":"What about those eighteen people who were killed when the tower of Siloam fell on them? Do you think that they were more guilty of wrongdoing than everyone else who lives in Jerusalem?"},{"num":5,"verse":"No, I tell you, but unless you change your hearts and lives, you will die just as they did.”"},{"num":6,"verse":"Jesus told this parable: “A man owned a fig tree planted in his vineyard. He came looking for fruit on it and found none."},{"num":7,"verse":"He said to his gardener, ‘Look, I’ve come looking for fruit on this fig tree for the past three years, and I’ve never found any. Cut it down! Why should it continue depleting the soil’s nutrients?’"},{"num":8,"verse":"The gardener responded, ‘Lord, give it one more year, and I will dig around it and give it fertilizer."},{"num":9,"verse":"Maybe it will produce fruit next year; if not, then you can cut it down.’”"},{"header":"Healing on a Sabbath"},{"num":10,"verse":"Jesus was teaching in one of the synagogues on the Sabbath."},{"num":11,"verse":"A woman was there who had been disabled by a spirit for eighteen years. She was bent over and couldn’t stand up straight."},{"num":12,"verse":"When he saw her, Jesus called her to him and said, “Woman, you are set free from your sickness.”"},{"num":13,"verse":"He placed his hands on her and she straightened up at once and praised God."},{"num":14,"verse":"The synagogue leader, incensed that Jesus had healed on the Sabbath, responded, “There are six days during which work is permitted. Come and be healed on those days, not on the Sabbath day.”"},{"num":15,"verse":"The Lord replied, “Hypocrites! Don’t each of you on the Sabbath untie your ox or donkey from its stall and lead it out to get a drink?"},{"num":16,"verse":"Then isn’t it necessary that this woman, a daughter of Abraham, bound by Satan for eighteen long years, be set free from her bondage on the Sabbath day?”"},{"num":17,"verse":"When he said these things, all his opponents were put to shame, but all those in the crowd rejoiced at all the extraordinary things he was doing."},{"header":"Growth of God’s kingdom"},{"num":18,"verse":"Jesus asked, “What is God’s kingdom like? To what can I compare it?"},{"num":19,"verse":"It’s like a mustard seed that someone took and planted in a garden. It grew and developed into a tree and the birds in the sky nested in its branches.”"},{"num":20,"verse":"Again he said, “To what can I compare God’s kingdom?"},{"num":21,"verse":"It’s like yeast, which a woman took and hid in a bushel of wheat flour until the yeast had worked its way through the whole.”"},{"header":"Who will be saved?"},{"num":22,"verse":"Jesus traveled through cities and villages, teaching and making his way to Jerusalem."},{"num":23,"verse":"Someone said to him, “Lord, will only a few be saved?”"},{"num":24,"verse":"“Make every effort to enter through the narrow gate. Many, I tell you, will try to enter and won’t be able to."},{"num":25,"verse":"Once the owner of the house gets up and shuts the door, then you will stand outside and knock on the door, saying, ‘Lord, open the door for us.’ He will reply, ‘I don’t know you or where you are from.’"},{"num":26,"verse":"Then you will begin to say, ‘We ate and drank in your presence, and you taught in our streets.’"},{"num":27,"verse":"He will respond, ‘I don’t know you or where you are from. Go away from me, all you evildoers!’"},{"num":28,"verse":"There will be weeping and grinding of teeth when you see Abraham, Isaac, Jacob, and all the prophets in God’s kingdom, but you yourselves will be thrown out."},{"num":29,"verse":"People will come from east and west, north and south, and sit down to eat in God’s kingdom."},{"num":30,"verse":"Look! Those who are last will be first and those who are first will be last.”"},{"header":"Sorrow for Jerusalem"},{"num":31,"verse":"At that time, some Pharisees approached Jesus and said, “Go! Get away from here, because Herod wants to kill you.”"},{"num":32,"verse":"Jesus said to them, “Go, tell that fox, ‘Look, I’m throwing out demons and healing people today and tomorrow, and on the third day I will complete my work."},{"num":33,"verse":"However, it’s necessary for me to travel today, tomorrow, and the next day because it’s impossible for a prophet to be killed outside of Jerusalem.’"},{"num":34,"verse":"“Jerusalem, Jerusalem, you who kill the prophets and stone those who were sent to you! How often I have wanted to gather your people just as a hen gathers her chicks under her wings. But you didn’t want that."},{"num":35,"verse":"Look, your house is abandoned. I tell you, you won’t see me until the time comes when you say, Blessings on the one who comes in the Lord’s name.”"}]