[{"header":"Repent or Perish"},{"num":13,"verse":"At that time, some people came and reported to Him about the Galileans whose blood Pilate had mixed with their sacrifices. "},{"num":2,"verse":"And He responded to them, “Do you think that these Galileans were more sinful than all Galileans because they suffered these things? "},{"header":"The Parable of the Barren Fig Tree"},{"num":6,"verse":"And He told this parable: “A man had a fig tree that was planted in his vineyard. He came looking for fruit on it and found none. "},{"header":"Healing a Daughter of Abraham"},{"num":10,"verse":"As He was teaching in one of the synagogues on the Sabbath, "},{"num":11,"verse":"a woman was there who had been disabled by a spirit for over 18 years. She was bent over and could not straighten up at all. "},{"num":12,"verse":"When Jesus saw her, He called out to her, “Woman, you are free of your disability.” "},{"num":13,"verse":"Then He laid His hands on her, and instantly she was restored and began to glorify God."},{"num":14,"verse":"But the leader of the synagogue, indignant because Jesus had healed on the Sabbath, responded by telling the crowd, “There are six days when work should be done; therefore come on those days and be healed and not on the Sabbath day.”"},{"num":15,"verse":"But the Lord answered him and said, “Hypocrites! Doesn’t each one of you untie his ox or donkey from the feeding trough on the Sabbath and lead it to water? "},{"num":17,"verse":"When He had said these things, all His adversaries were humiliated, but the whole crowd was rejoicing over all the glorious things He was doing."},{"header":"The Parables of the Mustard Seed and of the Yeast"},{"num":18,"verse":"He said, therefore, “What is the kingdom of God like, and what can I compare it to? "},{"num":20,"verse":"Again He said, “What can I compare the kingdom of God to? "},{"header":"The Narrow Way"},{"num":22,"verse":"He went through one town and village after another, teaching and making His way to Jerusalem. "},{"num":23,"verse":"“Lord,” someone asked Him, “are there few being saved?”"},{"header":"Jesus and Herod Antipas"},{"num":31,"verse":"At that time some Pharisees came and told Him, “Go, get out of here! Herod wants to kill You!”"},{"num":32,"verse":"He said to them, “Go tell that fox, ‘Look! I’m driving out demons and performing healings today and tomorrow, and on the third day I will complete My work.’ "},{"header":"Jesus’ Lamentation over Jerusalem"}]