[{"num":13,"verse":"About this time he was informed that Pilate had butchered some Jews from Galilee as they were sacrificing at the Temple in Jerusalem."},{"num":2,"verse":"“Do you think they were worse sinners than other men from Galilee?” he asked. “Is that why they suffered? "},{"num":3,"verse":"Not at all! And don’t you realize that you also will perish unless you leave your evil ways and turn to God?"},{"num":4,"verse":"“And what about the eighteen men who died when the Tower of Siloam fell on them? Were they the worst sinners in Jerusalem? "},{"num":5,"verse":"Not at all! And you, too, will perish unless you repent.”"},{"num":6,"verse":"Then he used this illustration: “A man planted a fig tree in his garden and came again and again to see if he could find any fruit on it, but he was always disappointed. "},{"num":7,"verse":"Finally he told his gardener to cut it down. ‘I’ve waited three years and there hasn’t been a single fig!’ he said. ‘Why bother with it any longer? It’s taking up space we can use for something else.’"},{"num":8,"verse":"“‘Give it one more chance,’ the gardener answered. ‘Leave it another year, and I’ll give it special attention and plenty of fertilizer. "},{"num":9,"verse":"If we get figs next year, fine; if not, I’ll cut it down.’”"},{"num":10,"verse":"One Sabbath as he was teaching in a synagogue, "},{"num":11,"verse":"he saw a seriously handicapped woman who had been bent double for eighteen years and was unable to straighten herself."},{"num":12,"verse":"Calling her over to him Jesus said, “Woman, you are healed of your sickness!” "},{"num":13,"verse":"He touched her, and instantly she could stand straight. How she praised and thanked God!"},{"num":14,"verse":"But the local Jewish leader in charge of the synagogue was very angry about it because Jesus had healed her on the Sabbath day. “There are six days of the week to work,” he shouted to the crowd. “Those are the days to come for healing, not on the Sabbath!”"},{"num":15,"verse":"But the Lord replied, “You hypocrite! You work on the Sabbath! Don’t you untie your cattle from their stalls on the Sabbath and lead them out for water? "},{"num":16,"verse":"And is it wrong for me, just because it is the Sabbath day, to free this Jewish woman from the bondage in which Satan has held her for eighteen years?”"},{"num":17,"verse":"This shamed his enemies. And all the people rejoiced at the wonderful things he did."},{"num":18,"verse":"Now he began teaching them again about the Kingdom of God: “What is the Kingdom like?” he asked. “How can I illustrate it? "},{"num":19,"verse":"It is like a tiny mustard seed planted in a garden; soon it grows into a tall bush and the birds live among its branches."},{"num":20,"verse":"“It is like yeast kneaded into dough, which works unseen until it has risen high and light.”"},{"num":22,"verse":"He went from city to city and village to village, teaching as he went, always pressing onward toward Jerusalem."},{"num":23,"verse":"Someone asked him, “Will only a few be saved?”"},{"num":24,"verse":"“The door to heaven is narrow. Work hard to get in, for the truth is that many will try to enter but when the head of the house has locked the door, it will be too late. Then if you stand outside knocking, and pleading, ‘Lord, open the door for us,’ he will reply, ‘I do not know you.’"},{"num":26,"verse":"“‘But we ate with you, and you taught in our streets,’ you will say."},{"num":27,"verse":"“And he will reply, ‘I tell you, I don’t know you. You can’t come in here, guilty as you are. Go away.’"},{"num":28,"verse":"“And there will be great weeping and gnashing of teeth as you stand outside and see Abraham, Isaac, Jacob, and all the prophets within the Kingdom of God—"},{"num":29,"verse":"for people will come from all over the world to take their places there. "},{"num":30,"verse":"And note this: some who are despised now will be greatly honored then; and some who are highly thought of now will be least important then.”"},{"num":31,"verse":"A few minutes later some Pharisees said to him, “Get out of here if you want to live, for King Herod is after you!”"},{"num":32,"verse":"Jesus replied, “Go tell that fox that I will keep on casting out demons and doing miracles of healing today and tomorrow; and the third day I will reach my destination. "},{"num":33,"verse":"Yes, today, tomorrow, and the next day! For it wouldn’t do for a prophet of God to be killed except in Jerusalem!"},{"num":34,"verse":"“O Jerusalem, Jerusalem! The city that murders the prophets. The city that stones those sent to help her. How often I have wanted to gather your children together even as a hen protects her brood under her wings, but you wouldn’t let me. "},{"num":35,"verse":"And now—now your house is left desolate. And you will never again see me until you say, ‘Welcome to him who comes in the name of the Lord.’”"}]