[{"num":13,"verse":"Now there were some present at the same time who told Yeshua about the Galileans whose blood Pilate had mixed with their sacrifices. "},{"num":2,"verse":"He answered and said to them, “Do you suppose that these Galileans are worse sinners than the rest of the Galileans because they have suffered these things? "},{"num":3,"verse":"No, I tell you! But unless you repent, you all will perish the same way."},{"num":4,"verse":"“Or those eighteen upon whom the tower in Siloam fell and were killed, do you suppose that they are worse sinners than all the people living in Jerusalem? "},{"num":5,"verse":"No, I tell you! But unless you repent, you all will perish the same way."},{"num":6,"verse":"Then Yeshua began telling this parable: “A man had a fig tree he had planted in his vineyard, and he came looking for fruit on it and found none. "},{"num":7,"verse":"So he said to the gardener, ‘Indeed, for three years I‘ve come searching for fruit on this fig tree and found none. Remove it! Why does it use up the ground?’"},{"num":8,"verse":"“But answering, the gardener said to him, ‘Master, leave it alone for this year also, until I dig around it and apply fertilizer. "},{"num":9,"verse":"And if it bears fruit, good. But if not, cut it down.’”"},{"header":"Teaching by Example at the Synagogue"},{"num":10,"verse":"Now Yeshua was teaching in one of the synagogues on Shabbat. "},{"num":11,"verse":"And behold, there was a woman with a disabling spirit for eighteen years, bent over and completely unable to stand up straight. "},{"num":12,"verse":"When Yeshua saw her, He called out to her and said, “Woman, you are set free from your disability.” "},{"num":13,"verse":"Then He laid hands on her, and instantly she stood up straight and began praising God."},{"num":14,"verse":"But the synagogue leader, indignant that Yeshua had healed on Shabbat, started telling the crowd, “There are six days in which work should be done—so come to be healed on those days and not on Yom Shabbat!”"},{"num":15,"verse":"But the Lord answered him and said, “Hypocrites! On Shabbat doesn’t each of you untie his ox or donkey from the stall and lead it away to give it drink? "},{"num":16,"verse":"So this one, a daughter of Abraham incapacitated by satan for eighteen years, shouldn’t she be set free from this imprisonment on Yom Shabbat?” "},{"num":17,"verse":"When Yeshua said these things, all His opponents were put to shame; but the whole crowd was rejoicing at all the glorious things done by Him."},{"header":"Teaching throughout the Towns and Villages"},{"num":18,"verse":"So Yeshua was saying, “What is the kingdom of God like? To what shall I compare it? "},{"num":19,"verse":"It is like a mustard seed, which a man took and dropped into his own garden. It grew and became a tree, and the birds of the air nested in its branches.”"},{"num":20,"verse":" Again He said, “To what shall I compare the kingdom of God? "},{"num":21,"verse":"It is like hametz, which a woman took and hid in three measures of flour, until it was all leavened."},{"num":22,"verse":"And He continued on His journey through the towns and villages, teaching and making His way to Jerusalem. "},{"num":23,"verse":"And someone said to Him, “Master, are only a few being saved?”"},{"num":24,"verse":"“Make every effort to enter through the narrow door; for many, I tell you, will try to enter and will not be able. "},{"num":25,"verse":"Once the Master of the household gets up and shuts the door, and you’re standing outside and begin knocking on the door, saying, ‘Master, open up for us,’ then He will say to you, ‘I don’t know where you come from.’ "},{"num":26,"verse":"Then you will start to say, ‘We ate and drank in Your company, and You taught in our streets.’ "},{"num":27,"verse":"But He will say, ‘I tell you, I don’t know where you come from. Get away from Me, all of you evildoers!’”"},{"num":28,"verse":"“There will be weeping and the gnashing of teeth when you see Abraham and Isaac and Jacob and all the prophets in the kingdom of God, but you yourselves thrown out. "},{"num":29,"verse":"And they will come from the east and west and from the north and south, and they will recline at table in the kingdom of God. "},{"num":30,"verse":"And indeed, some are last who shall be first, and some are first who shall be last.”"},{"header":"A Warning to Move On"},{"num":31,"verse":"In that hour, some Pharisees came up and said to Yeshua, “Get out and leave from here, because Herod wants to kill You!”"},{"num":32,"verse":"But Yeshua said to them, “Go and tell that fox, ‘Indeed, I’m driving out demons and performing healings today and tomorrow, and on the third day I will reach My goal.’ "},{"num":33,"verse":"But I must keep going today and tomorrow because it just can’t be that a prophet would perish outside Jerusalem."},{"num":34,"verse":"“O Jerusalem, Jerusalem who kills the prophets and stones those sent to her! How often I longed to gather your children together, as a hen gathers her chicks under her wings, but you were not willing. "},{"num":35,"verse":"Look, your house is left to you desolate! For I tell you, you will never see Me until you say, ‘Baruch ha-ba b’shem Adonai. Blessed is He who comes in the name of the Lord!’”"}]