[{"header":"Chapter 3"},{"num":1,"verse":"Concluding Admonitions. Finally, my brothers, rejoice in the Lord. Writing the same things to you is no burden for me but is a safeguard for you."},{"num":2,"verse":"Against Legalistic Teachers. Beware of the dogs! Beware of the evil-workers! Beware of the mutilation! "},{"num":3,"verse":"For we are the circumcision, we who worship through the Spirit of God, who boast in Christ Jesus and do not put our confidence in flesh, "},{"num":4,"verse":"although I myself have grounds for confidence even in the flesh."},{"num":5,"verse":"Circumcised on the eighth day, of the race of Israel, of the tribe of Benjamin, a Hebrew of Hebrew parentage, in observance of the law a Pharisee, "},{"num":6,"verse":"in zeal I persecuted the church, in righteousness based on the law I was blameless."},{"num":7,"verse":"Righteousness from God. [But] whatever gains I had, these I have come to consider a loss because of Christ. "},{"num":8,"verse":"More than that, I even consider everything as a loss because of the supreme good of knowing Christ Jesus my Lord. For his sake I have accepted the loss of all things and I consider them so much rubbish, that I may gain Christ "},{"num":9,"verse":"and be found in him, not having any righteousness of my own based on the law but that which comes through faith in Christ, the righteousness from God, depending on faith "},{"num":10,"verse":"to know him and the power of his resurrection and [the] sharing of his sufferings by being conformed to his death, "},{"num":11,"verse":"if somehow I may attain the resurrection from the dead."},{"num":12,"verse":"It is not that I have already taken hold of it or have already attained perfect maturity, but I continue my pursuit in hope that I may possess it, since I have indeed been taken possession of by Christ [Jesus]. "},{"num":13,"verse":"Brothers, I for my part do not consider myself to have taken possession. Just one thing: forgetting what lies behind but straining forward to what lies ahead, "},{"num":14,"verse":"I continue my pursuit toward the goal, the prize of God’s upward calling, in Christ Jesus. "},{"num":15,"verse":"Let us, then, who are “perfectly mature” adopt this attitude. And if you have a different attitude, this too God will reveal to you. "},{"num":16,"verse":"Only, with regard to what we have attained, continue on the same course."},{"num":17,"verse":"Join with others in being imitators of me, brothers, and observe those who thus conduct themselves according to the model you have in us. "},{"num":18,"verse":"For many, as I have often told you and now tell you even in tears, conduct themselves as enemies of the cross of Christ. "},{"num":19,"verse":"Their end is destruction. Their God is their stomach; their glory is in their “shame.” Their minds are occupied with earthly things. "},{"num":20,"verse":"But our citizenship is in heaven, and from it we also await a savior, the Lord Jesus Christ. "},{"num":21,"verse":"He will change our lowly body to conform with his glorified body by the power that enables him also to bring all things into subjection to himself."}]