[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(10) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Will he delight himself?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—It is only the godly who can say, “Whom have I in heaven but Thee, and there is none upon earth that I desire in comparison with Thee;” and again, “I will praise Thy name, because it is so ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "comfortable;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "” but this man hath no promise that he can plead, and therefore no assurance of access at all times to the presence of God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Job 27:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 27:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Will he delight himself in the Almighty? — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "When he has nothing else to delight in? No: his delight is in the things of the world, which now sink under him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Will he always call upon God? — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Will he have the confidence to pray to God, and expect any comfort from him? Nay, will he not rather despond in such a case, and cease to call upon him? Certainly those who do not delight in God will not long call upon him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "27:7-10 Job looked upon the condition of a hypocrite and a wicked man, to be most miserable. If they gained through life by their profession, and kept up their presumptuous hope till death, what would that avail when God required their souls? The more comfort we find in our religion, the more closely we shall cleave to it. Those who have no delight in God, are easily drawn away by the pleasures, and easily overcome by the crosses of this life.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Will he delight himself in the Almighty? - A truly pious man will delight himself in the Almighty. His supreme happiness will be found in God. He has pleasure in the contemplation of his existence, his perfections, his law, and his government. Coverdale renders this, \"Hath he such pleasure and delight in the Almighty that he dare alway call upon God?\" The idea of Job is that a hypocrite has not his delight in the Almighty; and, therefore, his condition is not such as he would defend or choose. Job bad been charged with defending the character of the wicked and with maintaining that they were the objects of the divine favor. He now says that he maintained no such opinion. He was aware that the only real and solid happiness was to be found in God, and he knew that a hypocrite would not find delight there. This is true to the letter. A hypocrite has no real happiness in God. He sees nothing in the divine perfections to love; nothing in the divine plan affections. The hypocrite, therefore, is a miserable man. He professes to love what he does not love; tries to find pleasure in what his heart hates; mingles with a people with whom he has no sympathy, and joins in services of prayer and praise which are disgusting and irksome to his soul. The pious man rejoices that there is just such a God as Yahweh is. He sees nothing in him which he desires to be changed, and he has supreme delight in the contemplation of his perfections.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Will he always call upon God? - That is, he will not always call upon God. This is literally true. The hypocrite pray:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) when he makes a profession of religion;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(2) on some extraordinary occasion - as when a friend is sick, or when he feels that he himself is about to die, but he does not always maintain habits of prayer.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "He suffers his business to break in upon his times for prayer; neglects secret devotion on the slightest pretence, and soon abandons it altogether. One of the best tests of character is the feeling with which we pray, and the habit which we have of calling on God. The man who loves secret prayer has one of the most certain evidences that he is a pious man; compare the notes at Job 20:5. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "He suffers his business to break in upon his times for prayer; neglects secret devotion on the slightest pretence, and soon abandons it altogether. One of the best tests of character is the feeling with which we pray, and the habit which we have of calling on God. The man who loves secret prayer has one of the most certain evidences that he is a pious man; compare the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 20:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10. Alluding to Job 22:26.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "always call—He may do so in times of prosperity in order to be thought religious. But he will not, as I do, call on God in calamities verging on death. Therefore I cannot be a \"hypocrite\" (Job 19:25; 20:5; Ps 62:8).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Will he be able to delight and satisfy himself with God alone, and with his love and favour, when he hath no other matter of delight? This I now do, and this a hypocrite cannot do, because his heart is chiefly set upon the world; and when that fails him, his heart sinks, and the thoughts of God are unsavoury and troublesome to him. He may by his afflictions be driven to prayer: but if God doth not speedily answer him, he falls into despair, and neglect of God and of prayer; whereas I constantly continue in prayer, notwithstanding the grievousness and the long continuance of my calamities. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Will he delight himself in the Almighty?.... That is, the hypocrite; no, he will not; he may seem to delight in, him, but he does not truly and sincerely; not in him as the Almighty, or in his omnipotence, into whose hands it is a fearful thing to fall, and who is able to destroy soul and body in hell; nor his omniscience, who, searches and knows the hearts of all men, and the insincerity of the hypocrite, covert to men soever he is; nor in his holiness, which at heart he loves not; nor in his ways and worship, word, ordinances, and people, though he makes a show of it, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 58:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "will he always call upon God? God only is to be called upon, and it becomes all men to call upon him for all blessings, temporal and spiritual; and this should be done in faith, with fervency, in sincerity and uprightness of soul, and with constancy, always, at all times both of prosperity and adversity; but an hypocrite does not, and cannot call upon God in a sincere and spiritual manner; nor is he constant in this work, only by fits and starts, when it is for his worldly interest and external honour so to do. Now Job was one that delighted in God, was uneasy at his absence, longed for communion with him, sought earnestly after him, frequently and constantly called upon him, though he was wrongly charged with casting off the fear of God, and restraining prayer before him, and therefore no hypocrite. Some understand (f) all this as affirmed of the hypocrite, setting forth his present seeming state of happiness; as that he has a hope of divine favour, and of eternal felicity; has much peace and tranquillity of mind in life, and at death; is heard of God when trouble comes, and so gets out of it, and enjoys great prosperity; professes much delight and pleasure in God, and his ways, and is a constant caller upon him, and keeps close to the external duties of religion; and yet, notwithstanding all this, is in the issue, when death comes, exceeding miserable, as the following part of the chapter shows. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(f) Schultens. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(f) Schultens. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Will he delight himself in the Almighty? will he always call upon God?",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "will he delight himself",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "?] Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "doth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " he delight himself? The wicked man has no consolation, no resource, in the manifold conditions of life when men need higher help than their own; he has no pleasure in God nor fellowship with Him, and cannot appeal to Him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "It is manifest that in these verses the speaker means to contrast his own condition of mind with that of the godless man. He has hope in God, in death and in trouble, for he delighteth himself in God at all times. Such words as those in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Job 27:8; Job 27:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 27:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 27:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", are not out of place in the mouth of Job, comp. ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 16:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "seq",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 19:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "seq",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 23:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "seq",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 31:2-6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It is less easy, however, to combine what is implied in the words of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Job 27:9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 27:9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", “Will God hear his cry when trouble cometh upon him?” with Job’s repeated complaints that God refused to hear him, e. g. ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 13:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 19:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and many other passages. The only solution would be to consider that he had fought his way through to an assured trust in God, such as he had cherished during his past life (ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 12:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "seq",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".), or rather, that such a trust here suddenly broke upon him and filled his mind, and enabled him to look now for release from his calamities and restoration—in a word to anticipate that issue of his afflictions which actually ensued. And such is the construction which some of the ablest commentators (e.g. Ewald) put upon the language. Such a change of view in regard to the issue of his afflictions implies a complete revolution in Job’s mind, for he had hitherto consistently and even pertinaciously (ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 17:1-2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 17:10-16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") contended that his malady was mortal, and continued to do this even so late as ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 23:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “For he will perform the thing appointed for me.” Such a revolution, however, may be conceived and admitted, provided Job’s subsequent utterances are in harmony with it. Unfortunately, however, they are not; for in ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 30:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " he exclaims, “I cry unto thee and thou dost not hear me, I stand up and thou gazest at me”; and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 27:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of the same chapter he says, “For I know that thou wilt bring me unto death” (i. e. through his present afflictions). Here he is found again occupying the same position in regard to his malady under the hand of God as he had consistently maintained throughout. It is very hard to reconcile such expressions with ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 27:7-10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", on the assumption that the last-named passage really belongs to Job.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 10.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Will he delight himself in the Almighty?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " A further ill result of hypocrisy is noted. Not only does it alienate God from us, but it nile,ares us from God. The hypocrite cannot \"delight in the Almighty.\" He must shriek from him, tear him, dislike to dwell on the thought of his presence and realize it. His natural inclination must be to withdraw his thoughts from God, and give himself up to the worldliness which has been his attraction to assume the hypocrite's part. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Will he always call upon God?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Can be even be depended on not to renounce the service of God altogether? The mutual alienation above spoken of must tend to check communion, to disincline to prayer and calling upon God, to erect a barrier between the hypocrite and the Almighty, which, though for a while it may be insufficient to withstand the force of use and wont, will yet, in the long run, be sure to tell, and will either put an end to prayer altogether, or reduce it to a formality. Job 27:10",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "  8  For what is the hope of the godless, when He cutteth off,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "When Eloah taketh away his soul?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "  9  Will God hear his cry",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "When distress cometh upon him?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "10  Or can he delight himself in the Almighty,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Can he call upon Eloah at all times?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "11  I will teach you concerning the hand of God,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I will not conceal the dealings of the Almighty.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "12  Behold, ye have all seen it,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Why then do ye cherish foolish notions?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In comparing himself with the רשׁע, Job is conscious that he has a God who does not leave him unheard, in whom he delights himself, and to whom he can at all times draw near; as, in fact, Job's fellowship with God rests upon the freedom of the most intimate confidence. He is not one of the godless; for what is the hope of one who is estranged from God, when he comes to die? He has no God on whom his hope might establish itself, to whom it could cling. The old expositors err in many ways respecting Job 27:8, by taking בצע, abscindere (root בץ), in the sense of (opes) corradere (thus also more recently Rosenm. after the Targ., Syr., and Jer.), and referring ישׁל to שׁלה in the signification tranquillum esse (thus even Blumenfeld after Ralbag and others). נפשׁו is the object to both verbs, and בצע נפשׁ, abscindere animam, to cut off the thread of life, is to be explained according to Job 6:9; Isaiah 38:12. שׁלח נפשׁ, extrahere animam (from שׁלה, whence שׁליח Arab. salan, the after-birth, cogn. שׁלל . Arab. sll, נשׁל Arab. nsl, nṯl, nšl), is of similar signification, according to another figure, wince the body is conceived of as the sheath (נדנה, Daniel 7:15) of the soul ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In comparing himself with the רשׁע, Job is conscious that he has a God who does not leave him unheard, in whom he delights himself, and to whom he can at all times draw near; as, in fact, Job's fellowship with God rests upon the freedom of the most intimate confidence. He is not one of the godless; for what is the hope of one who is estranged from God, when he comes to die? He has no God on whom his hope might establish itself, to whom it could cling. The old expositors err in many ways respecting ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 27:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", by taking בצע, abscindere (root בץ), in the sense of (opes) corradere (thus also more recently Rosenm. after the Targ., Syr., and Jer.), and referring ישׁל to שׁלה in the signification tranquillum esse (thus even Blumenfeld after Ralbag and others). נפשׁו is the object to both verbs, and בצע נפשׁ, abscindere animam, to cut off the thread of life, is to be explained according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 6:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 38:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". שׁלח נפשׁ, extrahere animam (from שׁלה, whence שׁליח Arab. salan, the after-birth, cogn. שׁלל . Arab. sll, נשׁל Arab. nsl, nṯl, nšl), is of similar signification, according to another figure, wince the body is conceived of as the sheath (נדנה, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 7:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") of the soul ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: On the similar idea of the body, as the kosha (sheath) of the soul, among the Hindus, vid., Psychol. S. 227.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(comp. Arab. sll in the universal signification evaginare ensem). The fut. apoc. Kal ישׁל ( equals  ישׁל) is therefore in meaning equivalent to the intrans. ישּׁל, Deuteronomy 28:40 (according to Ew. 235, c, obtained from this by change of vowel), decidere; and Schnurrer's supposition that ישׁל, like the Arab. ysl, is equivalent to ישׁאל (when God demands it), or such a violent correction as De Lagarde's",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(comp. Arab. sll in the universal signification evaginare ensem). The fut. apoc. Kal ישׁל ( equals  ישׁל) is therefore in meaning equivalent to the intrans. ישּׁל, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 28:40",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (according to Ew. 235, c, obtained from this by change of vowel), decidere; and Schnurrer's supposition that ישׁל, like the Arab. ysl, is equivalent to ישׁאל (when God demands it), or such a violent correction as De Lagarde's",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Anm. zur griech. Uebers. der Proverbien (1863), S. VI.f., where the first reason given for this improvement of the text is this, that the usual explanation, according to which ישׁל and יבצע have the same subj. and obj. standing after the verb, is altogether contrary to Semitic usage. But this assertion is groundless, as might be supposed from the very beginning. Thus, e.g., the same obj. is found after two verbs in Job 20:19, and the same subj. and obj. in Nehemiah 3:20.)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: Anm. zur griech. Uebers. der Proverbien (1863), S. VI.f., where the first reason given for this improvement of the text is this, that the usual explanation, according to which ישׁל and יבצע have the same subj. and obj. standing after the verb, is altogether contrary to Semitic usage. But this assertion is groundless, as might be supposed from the very beginning. Thus, e.g., the same obj. is found after two verbs in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 20:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and the same subj. and obj. in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nehemiah 3:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...",
        "children": []
      }
    ]
  }
]