[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(13) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "This is the portion of a wicked man.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Some have thought that the remainder of this chapter, if not Job 28 also, constitutes the missing third speech of Zophar, and that the usual words, “Then answered Zophar the Naamathite, and said,” have dropped out; but whatever may so be gained in symmetry seems to be lost in dramatic effect. We have seen that Bildad had but little to say, and that was only a few truisms; it is not surprising, therefore, that when it came to the turn of Zophar he had nothing more to say, and Job was left virtually master of the field. It is, however, a little remarkable that, supposing these words to be rightly ascribed to Job, he should precisely adopt those with which Zophar had concluded (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 20:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Perhaps Job is willing to show how completely he is prepared to accept the facts of his friends, although he will not admit their inferences. He, like them, is quite ready to allow that the prosperity of the wicked must be seeming rather than real, and that it must eventually come to nought.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Job 27:13",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 27:13",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "This is the portion of a wicked man — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Namely, that which is mentioned in the following verses; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "with God — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Either laid up with God, namely, in his counsel and appointment; or, which he shall have from God, as the next words explain it; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and the heritage of oppressors — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Who are mighty, fierce, terrible, and mischievous, as the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "עריצים",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "gnaritzim, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "implies; whom, therefore, men cannot destroy, but God will.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "27:11-23 Job's friends, on the same subject, spoke of the misery of wicked men before death as proportioned to their crimes; Job considered that if it were not so, still the consequences of their death would be dreadful. Job undertook to set this matter in a true light. Death to a godly man, is like a fair gale of wind to convey him to the heavenly country; but, to a wicked man, it is like a storm, that hurries him away to destruction. While he lived, he had the benefit of sparing mercy; but now the day of God's patience is over, and he will pour out upon him his wrath. When God casts down a man, there is no flying from, nor bearing up under his anger. Those who will not now flee to the arms of Divine grace, which are stretched out to receive them, will not be able to flee from the arms of Divine wrath, which will shortly be stretched out to destroy them. And what is a man profited if he gain the whole world, and thus lose his own soul?",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "This is the portion of a wicked man with God - There has been much diversity of view in regard to the remainder of this chapter. The difficulty is, that Job seems here to state the same things which had been maintained by his friends, and against which he had all along contended. This difficulty has been felt to be very great, and is very great. It cannot be denied, that there is a great resemblance between the sentiments here expressed and those which had been maintained by his friends, and that this speech, if offered by them, would have accorded entirely with their main position. Job seems to abandon all which he had defended, and to concede all which he had so warmly condemned. One mode of explaining the difficulty has been suggested in the \"Analysis\" of the chapter. It was proposed by Noyes, and is plausible, but, perhaps, will not be regarded as satisfactory to all. Dr. Kennicott supposes that the text is imperfect, and that these verses constituted the third speech of Zophar. His arguments for this opinion are:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) That Eliphaz and Bildad had each spoken three times, and that we are naturally led to expect a third speech from Zophar; but, according to the present arrangement, there is none.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(2) That the sentiments accord exactly with what Zophar might be expected to advance, and are exactly in his style; that they are expressed in \"his fierce manner of accusation,\" and are \"in the very place where Zophar's speech is naturally expected.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "But the objections to this view are insuperable. They are:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) The entire lack of any authority in the manuscripts, or ancient versions, for such an arrangement or supposition. All the ancient versions and manuscripts make this a part of the speech of Job.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(2) If this had been a speech of Zophar, we should have expected a reply to it, or an allusion to it, in the speech of Job which follows. But no such reply or allusion occurs.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(3) If the form which is usual on the opening of a speech, \"And Zophar answered and said,\" had ever existed here, it is incredible that it should have been removed. But it occurs in no manuscript or version; and it is not allowable to make such an alteration in the Scripture by conjecture.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Wemyss, in his translation of Job, accords with the view of Kennicott, and makes these verses Job 27:13-23 to be the third speech of Zophar. For this, however, he alleges no authority, and no reasons except such as had been suggested by Kennicott. Coverdale, in his translation of the Bible (1553 a.d.), has inserted the word \"saying\" at the close of Job 27:12, and regards what follows to the end of the chapter as an enumeration or recapitulation of the false sentiments which they had maintained, and which Job regards as the \"vain\" things Job 27:12 which they had maintained. In support of this view the following reasons may be alleged:",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Wemyss, in his translation of Job, accords with the view of Kennicott, and makes these verses ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 27:13-23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " to be the third speech of Zophar. For this, however, he alleges no authority, and no reasons except such as had been suggested by Kennicott. Coverdale, in his translation of the Bible (1553 a.d.), has inserted the word \"saying\" at the close of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 27:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and regards what follows to the end of the chapter as an enumeration or recapitulation of the false sentiments which they had maintained, and which Job regards as the \"vain\" things ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 27:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " which they had maintained. In support of this view the following reasons may be alleged:",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) It avoids all the difficulty of transposition, and the necessity of inserting an introduction, as we must do, if we suppose it to be a speech of Zophar.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(2) It avoids the difficulty of supposing that Job had here contradicted the sentiments which he had before advanced, or of conceding all that his friends had maintained.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(3) It is in accordance with the practice of the speakers in this book, and the usual practice of debaters, who enumerate at considerable length the sentiments which they regard as erroneous and which they design to oppose.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(4) It is the most simple and natural supposition, and, therefore, most likely to be the true one. Still, it must be admitted, that the passage is attended with difficulty; but the above solution is, it seems to me, the most plausible.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This is the portion - This is what he receives; to wit, what he states in the following verses, that his children would be cut off.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And the heritage of oppressors - What tyrants and cruel people must expect to receive at the hand of God. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And the heritage of oppressors - What tyrants and cruel people must expect to receive at the hand of God. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13. (See on [522]Job 27:11).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "This is the portion of a wicked man; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that which is mentioned in the following verses; in which Job delivers either, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. The opinion of his friends, in whose person he utters them, and afterwards declares his dissent from them. Or rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. His own opinion, and how far he agreeth with them; for his sense differs but little from what Zophar said, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Job 20:29",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 20:29",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "With God; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " either laid up with God, or in his counsel and appointment; or which he shall have from God, as the next words explain it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Of oppressors; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " who are mighty, and fierce, and terrible, and mischievous to mankind, as this word implies, whom therefore men cannot destroy, but God will. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "This is the portion of a wicked man with God,.... Not to be punished in this life, but after death. This is what Job undertook to teach his friends, and is the purport of what follows in this chapter. A wicked man is not only one that has been so from the womb, and is openly and notoriously a wicked man, but one also that is so secretly, under a mask of sobriety, religion, and godliness, and is an hypocrite, for of such Job speaks in the context; and the portion of such a man is not what he has in this life, which is oftentimes a very affluent one as to the things of this world, but what he has after death, which is banishment from the presence of God, the everlasting portion of his people, a part in the lake which burns with fire and brimstone, the wrath of God to the uttermost, the second death, and a dwelling with devils and wicked men, such as himself, even a portion with hypocrites, which of all is the most dreadful and miserable, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 24:51",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and this is \"with God\", is appointed by him; for God has appointed the wicked, the vessels of wrath, fitted by their sins for destruction to the day of evil, to everlasting ruin and destruction; and it is prepared by him for them, as for the devil and his angels, and for them it is reserved among his treasures, even blackness of darkness, damnation, wrath, and vengeance: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the heritage of oppressors, which they shall receive of the Almighty; these are such who are either oppressors of the poor in their natural and civil rights, taking from or denying to them what of right is their due; or oppressors of the saints in their religious rights and privileges, furious persecutors of them; and who, being powerful, are terrible, as the word signifies: there is an \"heritage\", or an inheritance for those, which is entailed upon them, and will descend unto them, as the firstborn of their father the devil, as children of disobedience, and so of wrath, and like an inheritance will endure: and this they \"shall receive\"; it is future, it is wrath to come, and it is certain there is no escaping it; it is their due desert, and they shall receive it; it is in the hands of the almighty God, and he will render it to them, and they shall most assuredly inherit it. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and the heritage of oppressors, which they shall receive of the Almighty; these are such who are either oppressors of the poor in their natural and civil rights, taking from or denying to them what of right is their due; or oppressors of the saints in their religious rights and privileges, furious persecutors of them; and who, being powerful, are terrible, as the word signifies: there is an \"heritage\", or an inheritance for those, which is entailed upon them, and will descend unto them, as the firstborn of their father the devil, as children of disobedience, and so of wrath, and like an inheritance will endure: and this they \"shall receive\"; it is future, it is wrath to come, and it is certain there is no escaping it; it is their due desert, and they shall receive it; it is in the hands of the almighty God, and he will render it to them, and they shall most assuredly inherit it. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "This is the {k} portion of a wicked man with God, and the heritage of oppressors, which they shall receive of the Almighty.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "This ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{k}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " portion of a wicked man with God, and the heritage of oppressors, ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "which",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " they shall receive of the Almighty.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(k) Thus will God order the wicked, and punish him even to his posterity.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "13–23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The utter destruction of the wicked man is exhibited in three turns: his children and descendants are destined for the sword, and become the prey of famine and pestilence (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Job 27:13-15",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 27:13-15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "); his wealth and possessions pass into the hands of the righteous, and his home perishes (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Job 27:16-18",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 27:16-18",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "); and he himself is cut off suddenly by awful calamities at the hand of God, and amidst the execrations of men (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Job 27:19-23",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 27:19-23",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 13.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "This is the portion of a wicked men with God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In \"this\" Job includes all that follows from ver. 14 to ver. 23 - \"this, which I am going to lay down.\" He pointedly takes up the words of Zophar in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 20:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", admitting their general truth. And the heritage of oppressors, which they shall receive of the Almighty. Retribution is \"their ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "portion",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "\" \"their ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "heritage",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the natural result and consequence of their precedent sin. Job 27:13",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13  This is the lot of the wicked man with God,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And the heritage of the violent which they receive from the Almighty:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "14  If his children multiply, it is for the sword,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And his offspring have not bread enough.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "15  His survivors shall be buried by the pestilence,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And his widows shall not weep.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "16  If he heapeth silver together as dust,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And prepareth garments for himself as mire:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "17  He prepareth it, and the righteous clothe themselves,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And the innocent divide the silver among themselves.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "18  He hath built as a moth his house,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And as a hut that a watchman setteth up.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "We have already had the combination אדם רשׁע for אישׁ רשׁע in Job 20:29; it is a favourite expression in Proverbs, and reminds one of ἄνθρωπος ὁδίτης in Homer, and ἄνθρωπος σπείρωϚ, ἐχθρός, ἔμπορος, in the parables Matthew 13. Psik (Pasek) stands under רשׁע, to separate the wicked man and God, as in Proverbs 15:29 (Norzi). למו, exclusively peculiar to the book of Job in the Old Testament (here and Job 29:21; Job 38:40; Job 40:4), is ל rendered capable of an independent position by means of מו  equals  מה, Arab. mâ. The sword, famine, and pestilence are the three punishing powers by which the evil-doer's posterity, however numerous it may be, is blotted out; these three, חרב, רעב, and מות, appear also side by side in Jeremiah 15:2; מות, instead of ממותי, diris mortibus, is (as also Jeremiah 18:21) equivalent to דּבר in the same trio, Jeremiah 14:12; the plague is personified (as when it is called by an Arabian poet umm el-farit, the mother of death), and Vavassor correctly observes: Mors illos sua sepeliet, nihil praeterea honoris supremi consecuturos. Bttcher (de inferis, 72) asserts that במות can only signify pestilentiae tempore, or better, ipso mortis momento; but since בּ occurs by the passive elsewhere in the sense of ab or per, e.g., Numbers 36:2; Hosea 14:4, it can also by נקבר denote the efficient cause. Olshausen's correction במות לא יקברו, they will not be buried when dead (Jeremiah 16:4), is still less required; \"to be buried by the pestilence\" is equivalent to, not to be interred with the usual solemnities, but to be buried as hastily as possible.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "We have already had the combination אדם רשׁע for אישׁ רשׁע in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 20:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; it is a favourite expression in Proverbs, and reminds one of ἄνθρωπος ὁδίτης in Homer, and ἄνθρωπος σπείρωϚ, ἐχθρός, ἔμπορος, in the parables ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Psik (Pasek) stands under רשׁע, to separate the wicked man and God, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 15:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (Norzi). למו, exclusively peculiar to the book of Job in the Old Testament (here and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 29:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 38:40",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 40:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), is ל rendered capable of an independent position by means of מו  equals  מה, Arab. mâ. The sword, famine, and pestilence are the three punishing powers by which the evil-doer's posterity, however numerous it may be, is blotted out; these three, חרב, רעב, and מות, appear also side by side in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 15:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; מות, instead of ממותי, diris mortibus, is (as also ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 18:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") equivalent to דּבר in the same trio, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 14:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; the plague is personified (as when it is called by an Arabian poet umm el-farit, the mother of death), and Vavassor correctly observes: Mors illos sua sepeliet, nihil praeterea honoris supremi consecuturos. Bttcher (de inferis, 72) asserts that במות can only signify pestilentiae tempore, or better, ipso mortis momento; but since בּ occurs by the passive elsewhere in the sense of ab or per, e.g., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 36:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 14:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", it can also by נקבר denote the efficient cause. Olshausen's correction במות לא יקברו, they will not be buried when dead (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 16:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), is still less required; \"to be buried by the pestilence\" is equivalent to, not to be interred with the usual solemnities, but to be buried as hastily as possible.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Job 27:15 (common to our poet and the psalm of Asaph, 78:64, which likewise belongs to the Salomonic age) is also to be correspondingly interpreted: the women that he leaves behind do not celebrate the usual mourning rites (comp. Genesis 23:2), because the decreed punishment which, stroke after stroke, deprives them of husbands and children, prevents all observance of the customs of mourning, and because the shock stifles the feeling of pity. The treasure in gold which his avarice has heaped up, and in garments which his love of display has gathered together, come into the possession of the righteous and the innocent, who are spared when these three powers of judgment sweep away the evil-doer and his family. Dust and dirt (i.e., of the streets, חוצות) are, as in Zechariah 9:3, the emblem of a great abundance that depreciates even that which is valuable. The house of the ungodly man, though a palace, is, as the fate of the fabric shows, as brittle and perishable a thing, and can be as easily destroyed, as the fine spinning of a moth, עשׁ (according to the Jewish proverb, the brother of the סס), or even the small case which it makes from remnants of gnawed articles, and drags about with it; it is like a light hut, perhaps for the watchman of a vineyard (Isaiah 1:8), which is put together only for the season during which the grapes are ripening.",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 27:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (common to our poet and the psalm of Asaph, 78:64, which likewise belongs to the Salomonic age) is also to be correspondingly interpreted: the women that he leaves behind do not celebrate the usual mourning rites (comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 23:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), because the decreed punishment which, stroke after stroke, deprives them of husbands and children, prevents all observance of the customs of mourning, and because the shock stifles the feeling of pity. The treasure in gold which his avarice has heaped up, and in garments which his love of display has gathered together, come into the possession of the righteous and the innocent, who are spared when these three powers of judgment sweep away the evil-doer and his family. Dust and dirt (i.e., of the streets, חוצות) are, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 9:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the emblem of a great abundance that depreciates even that which is valuable. The house of the ungodly man, though a palace, is, as the fate of the fabric shows, as brittle and perishable a thing, and can be as easily destroyed, as the fine spinning of a moth, עשׁ (according to the Jewish proverb, the brother of the סס), or even the small case which it makes from remnants of gnawed articles, and drags about with it; it is like a light hut, perhaps for the watchman of a vineyard (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 1:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), which is put together only for the season during which the grapes are ripening.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...",
        "children": []
      }
    ]
  }
]