[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "27:11-23 Job's friends, on the same subject, spoke of the misery of wicked men before death as proportioned to their crimes; Job considered that if it were not so, still the consequences of their death would be dreadful. Job undertook to set this matter in a true light. Death to a godly man, is like a fair gale of wind to convey him to the heavenly country; but, to a wicked man, it is like a storm, that hurries him away to destruction. While he lived, he had the benefit of sparing mercy; but now the day of God's patience is over, and he will pour out upon him his wrath. When God casts down a man, there is no flying from, nor bearing up under his anger. Those who will not now flee to the arms of Divine grace, which are stretched out to receive them, will not be able to flee from the arms of Divine wrath, which will shortly be stretched out to destroy them. And what is a man profited if he gain the whole world, and thus lose his own soul?",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "He buildeth his house as a moth - The house which the moth builds is the slight fabric which it makes for its own dwelling in the garment which it consumes. On this verse compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 8:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The dwelling of the moth is composed of the materials of the garment on which it feeds, and there may be an allusion here not only to the fact that the house which the wicked reared for themselves would be temporary, and that it would soon pass away like the dwelling of the moth, but that it was obtained - like the dwelling of the moth - at the expense of others. The idea of frailty, however, and of its being only a very temporary habitation, is probably the main thought in the passage. The allusion here is to the moth-worm as it proceeds from the egg, before it is changed into the chrysalis, aurelia, or nymph. \"The young moth, upon leaving the egg which a papilio has lodged upon a piece of stuff, or a skin well dressed, and commodious for her purpose, immediately finds a habitation and food in the nap of the stuff, or hair of the skin. It gnaws and lives upon the nap, and likewise builds with it its apartment, accommodated both with a front door and a back one: the whole is well fastened to the ground of the stuff, with several cords and a little glue. The moth sometimes thrusts her head out of one opening, and sometimes out of the other, and perpetually demolishes all about her; and when she has cleared the place about her, she draws out all the stakes of the tent, after which she carries it to some little distance, and then fixes it with her slender cords in a new situation.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Burder. It is to the insect in its larvae or caterpillar state that Job refers here, and the slightness of the habitation will be easily understood by anyone who has watched the operations of the silkworm, or of the moths that appear in this country. The idea is, that the habitation which the wicked constructed was temporary and frail, and would soon be left. The Chaldee and Syriac render this \"the spider;\" and so does Luther - Spinne. The slight gossamer dwelling of the spider would well correspond with the idea here expressed by Job.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And as a booth - A tent, or cottage.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "That the keeper maketh - That one who watches vineyards or gardens makes as a temporary shelter from the storm or the cold at night. Such edifices were very frail in their structure, and were designed to be only temporary habitations; see the subject explained in the notes at Isaiah 1:8. Niebuhr, in his description of Arabia, p. 158, says, \"In the mountains of Yemen they have a sort of nest on the trees, where the Arabs sit to watch the fields after they have been planted. But in the Kehama, where they have but few trees, they build a light kind of scaffolding for this purpose.\" Mr. Southey opens the fifth part of his Curse of Kehama with a similar allusion:",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "That the keeper maketh - That one who watches vineyards or gardens makes as a temporary shelter from the storm or the cold at night. Such edifices were very frail in their structure, and were designed to be only temporary habitations; see the subject explained in the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 1:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Niebuhr, in his description of Arabia, p. 158, says, \"In the mountains of Yemen they have a sort of nest on the trees, where the Arabs sit to watch the fields after they have been planted. But in the Kehama, where they have but few trees, they build a light kind of scaffolding for this purpose.\" Mr. Southey opens the fifth part of his Curse of Kehama with a similar allusion:",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Evening comes on: - arising from the stream",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Homeward the tall flamingo wings his flight;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And when hc sails athwart the setting beam,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "His scarlet plumage glows with deeper light.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The watchman, at the wish'd approach of night",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Gladly forsakes the field, where he all day,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "To scare the winged plunderers from their prey,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "With shout and sling, on yonder clay-built height,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Hath borne the sultry ray. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Hath borne the sultry ray. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "18. (Job 8:14; 4:19). The transition is natural from \"raiment\" (Job 27:16) to the \"house\" of the \"moth\" in it, and of it, when in its larva state. The moth worm's house is broken whenever the \"raiment\" is shaken out, so frail is it.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "booth—a bough-formed hut which the guard of a vineyard raises for temporary shelter (Isa 1:8).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "As a moth; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which settleth itself in a garment, but is quickly and unexpectedly brushed off, and dispossessed of its dwelling, and crushed to death. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "That the keeper maketh; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which the keeper of a garden or vineyard suddenly rears up in fruit time, and as quickly and easily pulls it down again. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 1:8 Lamentations 2:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 1:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Lamentations 2:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "He buildeth his house as a moth,.... Which builds its house in a garment by eating into it, and so destroying it, and in time eats itself out of house and home, and however does not continue long in it, but is soon and easily shook out, or brushed off; so a wicked man builds himself an house, a stately palace, like Arcturus (l); so some render the words from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 9:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", a palace among the stars, an heavenly palace and paradise, and expects it will continue for ever; but as he builds it with the mammon of unrighteousness, and to the prejudice and injury of others, and with their money, or what was due to them, so by his sins and iniquities he brings ruin and destruction upon himself and his family, so that his house soon falls to decay, and at least he and his posterity have but a short lived enjoyment of it. This may be applied in a figurative sense to the hypocrite's hope and confidence, which is like a spider's web, a moth eaten garment, and a house built upon the sand; the Septuagint version here adds, \"as a spider\", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 8:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and as a booth that the keeper maketh; either a keeper of sheep, who sets up his tent in a certain place for a while, for the sake of pasturage, and then removes it, to which the allusion is, Isaiah 38:12; or a keeper of fruit, as the Targum, of gardens and orchards, that the fruit is not stolen; or of fig trees and vineyards, as Jarchi and Bar Tzemach, which is only a lodge or hut pitched for a season, until the fruit is gathered in, and then is taken down, see Isaiah 1:8; and it signifies here the short continuance of the house of the wicked man, which he imagined would continue for ever, Psalm 49:11. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and as a booth that the keeper maketh; either a keeper of sheep, who sets up his tent in a certain place for a while, for the sake of pasturage, and then removes it, to which the allusion is, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 38:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; or a keeper of fruit, as the Targum, of gardens and orchards, that the fruit is not stolen; or of fig trees and vineyards, as Jarchi and Bar Tzemach, which is only a lodge or hut pitched for a season, until the fruit is gathered in, and then is taken down, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 1:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and it signifies here the short continuance of the house of the wicked man, which he imagined would continue for ever, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 49:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(l) \"quasi Arcturi\", Junius & Tremellius; so Aben Ezra. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(l) \"quasi Arcturi\", Junius & Tremellius; so Aben Ezra. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "He buildeth his house as a {m} moth, and as a booth that the keeper maketh.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "He buildeth his house as a ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{m}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " moth, and as a booth ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "that",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the keeper maketh.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(m) Which breeds in another man's possessions or garment, but is soon shaken out.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The “booth” of the “keeper” referred to is the flimsy hut erected in the vineyard or other gardens as a post for the watchman, who protects the fruit from theft or destruction by wild beasts. As described by Wetzstein (Del. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Comm. on Job",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Trans, ii. p. 74, 2nd ed. p. 348), it is built of four poles struck into the ground in the form of a square. About eight feet from the ground cross sticks are tied to these poles, over which boards are laid, and thus a couch is formed for the keeper. Some feet higher up other cross pieces of wood are fixed, and over these boughs or matting is thrown to form a roof. Such a booth is called a “lodge” ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and its unsubstantial character is indicated when it is said to “swing to and fro,” ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 24:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 18.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "He buildeth his house as a moth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The moth is the symbol of fragility, decay, and weakness. The wicked man's attempt to build himself up a house, and establish a powerful family, is no better than a moth's attempt to make itself a permanent habitation. As moths do not construct dwellings for themselves, it has been proposed (Merx) to read ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "כעכבישׁ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"as a spider,\" for ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "מעשׁ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"as a moth;\" but the change is too great to be at all probable. May not the cocoon, from which the moth issues as. from a house, have been in Job's mind? The hawk-moth buries itself in a neat cave for the pupa stage; and there may have been even better examples in Uz. But we ourselves have not known these facts long, and therefore we need not be surprised to find Job making a mistake in natural history. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And as a booth that the keeper maketh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Huts or lodges of boughs were set up in vineyards and orchards by those who had to watch them (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Lamentations 2:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). They were habitations of the weakest and frailest kind. Job 27:18",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13  This is the lot of the wicked man with God,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And the heritage of the violent which they receive from the Almighty:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "14  If his children multiply, it is for the sword,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And his offspring have not bread enough.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "15  His survivors shall be buried by the pestilence,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And his widows shall not weep.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "16  If he heapeth silver together as dust,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And prepareth garments for himself as mire:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "17  He prepareth it, and the righteous clothe themselves,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And the innocent divide the silver among themselves.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "18  He hath built as a moth his house,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And as a hut that a watchman setteth up.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "We have already had the combination אדם רשׁע for אישׁ רשׁע in Job 20:29; it is a favourite expression in Proverbs, and reminds one of ἄνθρωπος ὁδίτης in Homer, and ἄνθρωπος σπείρωϚ, ἐχθρός, ἔμπορος, in the parables Matthew 13. Psik (Pasek) stands under רשׁע, to separate the wicked man and God, as in Proverbs 15:29 (Norzi). למו, exclusively peculiar to the book of Job in the Old Testament (here and Job 29:21; Job 38:40; Job 40:4), is ל rendered capable of an independent position by means of מו  equals  מה, Arab. mâ. The sword, famine, and pestilence are the three punishing powers by which the evil-doer's posterity, however numerous it may be, is blotted out; these three, חרב, רעב, and מות, appear also side by side in Jeremiah 15:2; מות, instead of ממותי, diris mortibus, is (as also Jeremiah 18:21) equivalent to דּבר in the same trio, Jeremiah 14:12; the plague is personified (as when it is called by an Arabian poet umm el-farit, the mother of death), and Vavassor correctly observes: Mors illos sua sepeliet, nihil praeterea honoris supremi consecuturos. Bttcher (de inferis, 72) asserts that במות can only signify pestilentiae tempore, or better, ipso mortis momento; but since בּ occurs by the passive elsewhere in the sense of ab or per, e.g., Numbers 36:2; Hosea 14:4, it can also by נקבר denote the efficient cause. Olshausen's correction במות לא יקברו, they will not be buried when dead (Jeremiah 16:4), is still less required; \"to be buried by the pestilence\" is equivalent to, not to be interred with the usual solemnities, but to be buried as hastily as possible.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "We have already had the combination אדם רשׁע for אישׁ רשׁע in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 20:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; it is a favourite expression in Proverbs, and reminds one of ἄνθρωπος ὁδίτης in Homer, and ἄνθρωπος σπείρωϚ, ἐχθρός, ἔμπορος, in the parables ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Psik (Pasek) stands under רשׁע, to separate the wicked man and God, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 15:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (Norzi). למו, exclusively peculiar to the book of Job in the Old Testament (here and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 29:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 38:40",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 40:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), is ל rendered capable of an independent position by means of מו  equals  מה, Arab. mâ. The sword, famine, and pestilence are the three punishing powers by which the evil-doer's posterity, however numerous it may be, is blotted out; these three, חרב, רעב, and מות, appear also side by side in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 15:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; מות, instead of ממותי, diris mortibus, is (as also ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 18:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") equivalent to דּבר in the same trio, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 14:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; the plague is personified (as when it is called by an Arabian poet umm el-farit, the mother of death), and Vavassor correctly observes: Mors illos sua sepeliet, nihil praeterea honoris supremi consecuturos. Bttcher (de inferis, 72) asserts that במות can only signify pestilentiae tempore, or better, ipso mortis momento; but since בּ occurs by the passive elsewhere in the sense of ab or per, e.g., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 36:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 14:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", it can also by נקבר denote the efficient cause. Olshausen's correction במות לא יקברו, they will not be buried when dead (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 16:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), is still less required; \"to be buried by the pestilence\" is equivalent to, not to be interred with the usual solemnities, but to be buried as hastily as possible.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Job 27:15 (common to our poet and the psalm of Asaph, 78:64, which likewise belongs to the Salomonic age) is also to be correspondingly interpreted: the women that he leaves behind do not celebrate the usual mourning rites (comp. Genesis 23:2), because the decreed punishment which, stroke after stroke, deprives them of husbands and children, prevents all observance of the customs of mourning, and because the shock stifles the feeling of pity. The treasure in gold which his avarice has heaped up, and in garments which his love of display has gathered together, come into the possession of the righteous and the innocent, who are spared when these three powers of judgment sweep away the evil-doer and his family. Dust and dirt (i.e., of the streets, חוצות) are, as in Zechariah 9:3, the emblem of a great abundance that depreciates even that which is valuable. The house of the ungodly man, though a palace, is, as the fate of the fabric shows, as brittle and perishable a thing, and can be as easily destroyed, as the fine spinning of a moth, עשׁ (according to the Jewish proverb, the brother of the סס), or even the small case which it makes from remnants of gnawed articles, and drags about with it; it is like a light hut, perhaps for the watchman of a vineyard (Isaiah 1:8), which is put together only for the season during which the grapes are ripening.",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 27:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (common to our poet and the psalm of Asaph, 78:64, which likewise belongs to the Salomonic age) is also to be correspondingly interpreted: the women that he leaves behind do not celebrate the usual mourning rites (comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 23:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), because the decreed punishment which, stroke after stroke, deprives them of husbands and children, prevents all observance of the customs of mourning, and because the shock stifles the feeling of pity. The treasure in gold which his avarice has heaped up, and in garments which his love of display has gathered together, come into the possession of the righteous and the innocent, who are spared when these three powers of judgment sweep away the evil-doer and his family. Dust and dirt (i.e., of the streets, חוצות) are, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 9:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the emblem of a great abundance that depreciates even that which is valuable. The house of the ungodly man, though a palace, is, as the fate of the fabric shows, as brittle and perishable a thing, and can be as easily destroyed, as the fine spinning of a moth, עשׁ (according to the Jewish proverb, the brother of the סס), or even the small case which it makes from remnants of gnawed articles, and drags about with it; it is like a light hut, perhaps for the watchman of a vineyard (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 1:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), which is put together only for the season during which the grapes are ripening.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...",
        "children": []
      }
    ]
  }
]