[{"num":2,"verse":"2 Ruth gathered corn in the fields of Boaz.  8 The gentleness of Boaz toward her."},{"num":1,"verse":"Then Naomi’s husband had a kinsman, one of great power of the family of Elimelech, and his name was Boaz."},{"num":2,"verse":"And Ruth the Moabitess said unto Naomi, I pray thee, let me go to the field, and gather ears of corn after him, in whose sight I find favor. And she said unto her, Go my daughter."},{"num":3,"verse":"¶ And she went, and came and gleaned in the field after the reapers, and it came to pass, that she met with the portion of the field of Boaz, who was of the family of Elimelech."},{"num":4,"verse":"And behold, Boaz came from Bethlehem, and said unto the reapers, The Lord be with you: and they answered him, The Lord bless thee."},{"num":5,"verse":"Then said Boaz unto his servant that was appointed over the reapers, Whose maid is this?"},{"num":6,"verse":"And the servant that was appointed over the reapers, answered, and said, It is the Moabitish maid, that came with Naomi out of the country of Moab:"},{"num":7,"verse":"And she said unto us, I pray you, let me glean and gather after the reapers among the sheaves: so she came, and hath continued from that time in the morning unto now, save that she tarried a little in the house."},{"num":8,"verse":"¶ Then said Boaz unto Ruth, Hearest thou, my daughter? go to none other field to gather, neither go from hence: but abide here by my maidens."},{"num":9,"verse":"Let thine eyes be on the field that they do reap, and go thou after the maidens. Have I not charged the servants, that they touch thee not? Moreover when thou art athirst, go unto the vessels, and drink of that which the servants hath drawn."},{"num":10,"verse":"Then she fell on her face, and bowed herself to the ground, and said unto him, How have I found favor in thine eyes, that thou shouldest know me, seeing I am a stranger?"},{"num":11,"verse":"And Boaz answered and said unto her, All is told and showed me that thou hast done unto thy mother-in-law, since the death of thine husband, and how thou hast left thy father and thy mother, and the land where thou wast born, and art come unto a people which thou knewest not in time past."},{"num":12,"verse":"The Lord recompense thy work, and a full reward be given thee of the Lord God of Israel, under whose wings thou art come to trust."},{"num":13,"verse":"Then she said, Let me find favor in thy sight, my lord: for thou hast comforted me, and spoken comfortably unto thy maid, though I be not like to one of thy maids."},{"num":14,"verse":"And Boaz said unto her, At the meal time come thou hither, and eat of the bread, and dip thy morsel in the vinegar. And she sat beside the reapers, and he reached her parched corn: and she did eat, and was sufficed, and left thereof."},{"num":15,"verse":"¶ And when she arose to glean, Boaz commanded his servants, saying, Let her gather among the sheaves, and do not rebuke her."},{"num":16,"verse":"Also let fall some of the sheaves for her, and let it lie, that she may gather it up, and rebuke her not."},{"num":17,"verse":"So she gleaned in the field until evening, and she threshed that she had gathered, and it was about an Ephah of barley."},{"num":18,"verse":"¶ And she took it up, and went into the city, and her mother-in-law saw what she had gathered: Also she took forth, and gave to her that which she had reserved, when she was sufficed."},{"num":19,"verse":"Then her mother-in-law said unto her, Where hast thou gleaned today? and where wroughtest thou? blessed be he, that knew thee. And she showed her mother-in-law, with whom she had wrought, and said, The man’s name with whom I wrought today, is Boaz."},{"num":20,"verse":"And Naomi said unto her daughter-in-law, Blessed be he of the Lord: for he ceaseth not to do good to the living and to the dead. Again Naomi said unto her, The man is near unto us, and of our affinity."},{"num":21,"verse":"And Ruth the Moabitess said, He said also certainly unto me, Thou shalt be with my servants, until they have ended all mine harvest."},{"num":22,"verse":"And Naomi answered unto Ruth her daughter-in-law, It is best, my daughter, that thou go out with his maids, that they meet thee not in another field."},{"num":23,"verse":"Then she kept her by the maids of Boaz, to gather unto the end of barley harvest, and of wheat harvest, and dwelt with her mother-in-law."}]