[{"num":2,"verse":"So the heavens and the earth and everything in them were completed."},{"num":2,"verse":"By the seventh day God had finished the work he had been doing. So on that day he rested from all his work. "},{"num":3,"verse":"God blessed the seventh day and made it holy. He blessed it because on that day he rested from all the work he had done."},{"header":"Adam and Eve"},{"num":4,"verse":"Here is the story of the heavens and the earth when they were created. The Lord God made the earth and the heavens."},{"num":5,"verse":"At that time, bushes had not yet appeared on the earth. Plants had not started to grow. The Lord God had not sent rain on the earth. And there was no one to farm the land. "},{"num":6,"verse":"But streams came from the earth. They watered the entire surface of the ground. "},{"num":7,"verse":"Then the Lord God formed a man. He made him out of the dust of the ground. God breathed the breath of life into him. And the man became a living person."},{"num":8,"verse":"The Lord God had planted a garden in the east in Eden. He put in the garden the man he had formed. "},{"num":9,"verse":"The Lord God made every kind of tree grow out of the ground. The trees were pleasing to look at. Their fruit was good to eat. There were two trees in the middle of the garden. One of them had fruit that let people live forever. The other had fruit that let people tell the difference between good and evil."},{"num":10,"verse":"A river watered the garden. It flowed out of Eden. From there the river separated into four other rivers. "},{"num":11,"verse":"The name of the first river is the Pishon. It winds through the whole land of Havilah. Gold is found there. "},{"num":12,"verse":"The gold of that land is good. Onyx and sweet-smelling resin are also found there. "},{"num":13,"verse":"The name of the second river is the Gihon. It winds through the whole land of Cush. "},{"num":14,"verse":"The name of the third river is the Tigris. It runs along the east side of Ashur. And the fourth river is called the Euphrates."},{"num":15,"verse":"The Lord God put the man in the Garden of Eden. He put him there to farm its land and take care of it. "},{"num":16,"verse":"The Lord God gave the man a command. He said, “You may eat fruit from any tree in the garden. "},{"num":17,"verse":"But you must not eat the fruit from the tree of the knowledge of good and evil. If you do, you will certainly die.”"},{"num":18,"verse":"The Lord God said, “It is not good for the man to be alone. I will make a helper who is just right for him.”"},{"num":19,"verse":"The Lord God had formed all the wild animals and all the birds in the sky. He had made all of them out of the ground. He brought them to the man to see what names he would give them. And the name the man gave each living creature became its name. "},{"num":20,"verse":"So the man gave names to all the livestock, all the birds in the sky, and all the wild animals."},{"num":21,"verse":"So the Lord God caused him to fall into a deep sleep. While the man was sleeping, the Lord God took out one of the man’s ribs. Then the Lord God closed the opening in the man’s side. "},{"num":22,"verse":"Then the Lord God made a woman. He made her from the rib he had taken out of the man. And the Lord God brought her to the man."},{"num":23,"verse":"The man said,"},{"num":24,"verse":"That’s why a man leaves his father and mother and is joined to his wife. The two of them become one."},{"num":25,"verse":"Adam and his wife were both naked. They didn’t feel any shame."}]