[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 9:28",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 9:28",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Noah lived after the flood three hundred and fifty years — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Which period, as the Jews observe, reaches to the fifty-eighth year of Abraham’s age. So that we need be under no difficulty in accounting for the transmission of the original revelation made to Adam, and of other branches of divine truth, from the beginning of the world to the time of Abraham. Noah received these from his parents, who had the account from Adam’s own mouth, and transmitted it to Abraham. And its communication and descent from him to the Jews, and from the Jews to us, is sufficiently known. Within this time also Noah saw the building of the tower of Babel, the horrid wickedness and idolatry of his children, and the bloody wars which even then began to arise between some of them.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9:24-29 Noah declares a curse on Canaan, the son of Ham; perhaps this grandson of his was more guilty than the rest.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The history of Noah is now closed, in the customary form of the fifth chapter. This marks a connection between the third and fourth documents, and points to one hand as the composer, or at least compiler, of both. The document now closed could not have had the last paragraph appended to it until after the death of Noah. But, with the exception of these two verses, it might have been composed hundreds of years before. This strongly favors the notion of a constant continuator, or, at all events, continuation of the sacred history. Every new prophet and inspired writer whom God raised up added the necessary portion and made the necessary insertions in the sacred record. And hence, the Word of God had a progressive growth and adaptation to the successive ages of the church.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The present document stands between the old world and the new world. Hence, it has a double character, being the close of the antediluvian history, and the introduction to that of the postdiluvian race. It records a great event, pregnant with warning to all future generations of men. And it notes the delegation, by God to man, of authority to punish the murderer by death, and therefore to enforce all the minor sanctions of law for breaches of the civil compact. It therefore points out the institution of civil government as coming from God, and clearly exhibits the accountability of all governments to God for all the powers they hold, and for the mode in which they are exercised. This also is a great historical lesson for all ages. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The present document stands between the old world and the new world. Hence, it has a double character, being the close of the antediluvian history, and the introduction to that of the postdiluvian race. It records a great event, pregnant with warning to all future generations of men. And it notes the delegation, by God to man, of authority to punish the murderer by death, and therefore to enforce all the minor sanctions of law for breaches of the civil compact. It therefore points out the institution of civil government as coming from God, and clearly exhibits the accountability of all governments to God for all the powers they hold, and for the mode in which they are exercised. This also is a great historical lesson for all ages. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "27. God shall enlarge Japheth—pointing to a vast increase in posterity and possessions. Accordingly his descendants have been the most active and enterprising, spread over the best and largest portion of the world, all Europe and a considerable part of Asia.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "he shall dwell in the tents of Shem—a prophecy being fulfilled at the present day, as in India British Government is established and the Anglo-Saxons being in the ascendancy from Europe to India, from India over the American continent. What a wonderful prophecy in a few verses (Isa 46:10; 1Pe 1:25)!   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Which reacheth to the fifty-eighth year of Abraham’s age, as the Jews note. And so we have a manifest account of the propagation of religion, from the beginning of the world to this day. Noah received it from his parents, who had the account of it from their first father Adam’s own mouth, and transmitted it to Abraham; and its descent from him to the Jews, and by the Jews to others, is sufficiently known. Within this time also Noah saw the building of Babel’s tower, the horrid wickedness and idolatry of his children, and the bloody wars which even then arose between some of them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Noah lived after the flood three hundred and fifty years. So that he not only saw the old world, and the wickedness of that, and the destruction of it for it, but an increase of wickedness again, the building of the tower of Babel, the confusion of languages, the dispersion of his offspring, and the wars among them in the times of Nimrod, and others: however, it was a blessing to mankind that he lived so long after the flood in the new world, to transmit to posterity, by tradition, the affairs of the old world; and to give a particular account of the destruction of it, and to instruct them in the doctrines and duties of religion. By this it appears, that he lived within thirty two years of the birth of Abraham. The Jews conclude from hence, that he lived to the fifty eighth year of Abraham's life: it may be remarked, that it is not added here as usual to the account of the years of the patriarchs, \"and he begat sons and daughters\"; from whence it may be concluded, that he had no more children than the three before mentioned, as well as from the silence of the Scriptures elsewhere, and from the old age of himself and his wife, and especially from what is said; see Gill on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 9:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Noah lived after the flood three hundred and fifty years.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 28, 29.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And Noah lived after the flood three hundred and fifty years",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "I.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to the fifty-eighth year of the life of Abram, and was thus in all probability a witness of the building of the tower of Babel, and of the consequent dispersion of mankind. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And all the days of Noah were nine hundred and fifty years: and he died",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Tuch, Bleek, and Colenso connect these verses with ver. 17, as the proper continuation of the Elohist's work. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Genesis 9:28",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "\"Wide let God make it to Japhet, and let him dwell in the tents of Shem.\" Starting from the meaning of the name, Noah sums up his blessing in the word יפתּ (japht), from פּתה to be wide (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 20:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), in the Hiphil with ל, to procure a wide space for any one, used either of extension over a wide territory, or of removal to a free, unfettered position; analogous to ל הרחיב, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 26:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 4:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc. Both must be retained here, so that the promise to the family of Japhet embraced not only a wide extension, but also prosperity on every hand. This blessing was desired by Noah, not from Jehovah, the God of Shem, who bestows saving spiritual good upon man, but from Elohim, God as Creator and Governor of the world; for it had respect primarily to the blessings of the earth, not to spiritual blessings; although Japhet would participate in these as well, for he should come and dwell in the tents of Shem. The disputed question, whether God or Japhet is to be regarded as the subject of the verb \"shall dwell,\" is already decided by the use of the word Elohim. If it were God whom Noah described as dwelling in the tents of Shem, so that the expression denoted the gracious presence of God in Israel, we should expect to find the name Jehovah, since it was as Jehovah that God took up His abode among Shem in Israel. It is much more natural to regard the expression as applying to Japhet, (a) because the refrain, \"Canaan shall be his servant,\" requires that we should understand ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 9:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as applying to Japhet, like ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 9:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to Shem; (b) because the plural, tents, is not applicable to the abode of Jehovah in Israel, inasmuch as in the parallel passages \"we read of God dwelling in His tent, on His holy hill, in Zion, in the midst of the children of Israel, and also of the faithful dwelling in the tabernacle or temple of God, but never of God dwelling in the tents of Israel\" (Hengstenberg); and (c) because we should expect that act of affection, which the two sons so delicately performed in concert, to have its corresponding blessing in the relation established between the two (Delitzsch). Japhet's dwelling in the tents of Shem is supposed by Bochart and others to refer to the fact, that Japhet's descendants would one day take the land of the Shemites, and subjugate the inhabitants; but even the fathers almost unanimously understand the words in a spiritual sense, as denoting the participation of the Japhetites in the saving blessings of the Shemites. There is truth in both views. Dwelling presupposes possession; but the idea of taking by force is precluded by the fact, that it would be altogether at variance with the blessing pronounced upon Shem. If history shows that the tents of Shem were conquered and taken by the Japhetites, the dwelling predicted here still relates not to the forcible conquest, but to the fact that the conquerors entered into the possessions of the conquered; that along with them they were admitted to the blessings of salvation; and that, yielding to the spiritual power of the vanquished, they lived henceforth in their tents as brethren (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 133:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). And if the dwelling of Japhet in the tents of Shem presupposes the conquest of the land of Shem by Japhet, it is a blessing not only to Japhet, but to Shem also, since, whilst Japhet enters into the spiritual inheritance of Shem, he brings to Shem all the good of this world (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 60",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). \"The fulfilment,\" as Delitzsch says, \"is plain enough, for we are all Japhetites dwelling in the tents of Shem; and the language of the New Testament is the language of Javan entered into the tents of Shem.\" To this we may add, that by the Gospel preached in this language, Israel, though subdued by the imperial power of Rome, became the spiritual conqueror of the orbis terrarum Romanus, and received it into his tents. Moreover it is true of the blessing and curse of Noah, as of all prophetic utterances, that they are fulfilled with regard to the nations and families in question as a whole, but do not predict, like an irresistible fate, the unalterable destiny of every individual; on the contrary, they leave room for freedom of personal decision, and no more cut off the individuals in the accursed race from the possibility of conversion, or close the way of salvation against the penitent, than they secure the individuals of the family blessed against the possibility of falling from a state of grace, and actually losing the blessing. Hence, whilst a Rahab and an Araunah were received into the fellowship of Jehovah, and the Canaanitish woman was relieved by the Lord because of her faith, the hardened Pharisees and scribes had woes pronounced upon them, and Israel was rejected because of its unbelief.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In Genesis 9:28, Genesis 9:29, the history of Noah is brought to a close, with the account of his age, and of his death. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 9:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 9:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the history of Noah is brought to a close, with the account of his age, and of his death. ",
            "children": []
          }
        ]
      }
    ]
  }
]