[{"num":71,"verse":"He prayeth in faith, established by the word of promise, 5 And confirmed by the work of God from his youth. 10 He complaineth of the cruelty of his enemies, 17 And desireth God to continue his graces toward him, 22 Promising to be mindful and thankful for the same."},{"num":1,"verse":"In thee, O Lord, I trust: let me never be ashamed."},{"num":2,"verse":"Rescue me and deliver me in thy righteousness: incline thine ear unto me and save me."},{"num":3,"verse":"Be thou my strong rock, whereunto I may always resort: thou hast given commandment to save me: for thou art my rock, and my fortress."},{"num":4,"verse":"Deliver me, O my God, out of the hand of the wicked: out of the hand of the evil and cruel man."},{"num":5,"verse":"For thou art mine hope, O Lord God, even my trust from my youth."},{"num":6,"verse":"Upon thee have I been stayed from the womb: thou art he that took me out of my mother’s bowels: my praise shall be always of thee."},{"num":7,"verse":"I am become as it were a monster unto many: but thou art my sure trust."},{"num":8,"verse":"Let my mouth be filled with thy praise, and with thy glory every day."},{"num":9,"verse":"Cast me not off in the time of age: forsake me not when my strength faileth."},{"num":10,"verse":"For mine enemies speak of me, and they that lay wait for my soul, take their counsel together,"},{"num":11,"verse":"Saying, God hath forsaken him: pursue and take him, for there is none to deliver him."},{"num":12,"verse":"Go not far from me, O God: my God haste thee to help me."},{"num":13,"verse":"Let them be confounded and consumed that are against my soul: let them be covered with reproof and confusion, that seek mine hurt."},{"num":14,"verse":"But I will wait continually, and will praise thee more and more."},{"num":15,"verse":"My mouth shall daily rehearse thy righteousness, and thy salvation: for I know not the number."},{"num":16,"verse":"I will go forward in the strength of the Lord God, and will make mention of thy righteousness, even of thine only."},{"num":17,"verse":"O God, thou hast taught me from my youth even until now: therefore will I tell of thy wondrous works,"},{"num":18,"verse":"Yea even unto mine old age and gray head, O God: forsake me not, until I have declared thine arm unto this generation, and thy power to all them that shall come."},{"num":19,"verse":"And thy righteousness, O God, I will exalt on high: for thou hast done great things: O God, who is like unto thee!"},{"num":20,"verse":"Which hast showed me great troubles and adversities, but thou wilt return and revive me, and wilt come again, and take me up from the depth of the earth."},{"num":21,"verse":"Thou wilt increase mine honor, and return and comfort me."},{"num":22,"verse":"Therefore will I praise thee for thy faithfulness, O God, upon instrument and viol: unto thee will I sing upon the harp, O Holy one of Israel."},{"num":23,"verse":"My lips will rejoice when I sing unto thee, and my soul which thou hast delivered."},{"num":24,"verse":"My tongue also shall talk of thy righteousness daily: for they are confounded and brought unto shame, that seek mine hurt."}]