[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3:1-11 Ezekiel was to receive the truths of God as the food for his soul, and to feed upon them by faith, and he would be strengthened. Gracious souls can receive those truths of God with delight, which speak terror to the wicked. He must speak all that, and that only, which God spake to him. How can we better speak God's mind than with his words? If disappointed as to his people, he must not be offended. The Ninevites were wrought upon by Jonah's preaching, when Israel was unhumbled and unreformed. We must leave this unto the Divine sovereignty, and say, Lord, thy judgments are a great deep. They will not regard the word of the prophet, for they will not regard the rod of God. Christ promises to strengthen him. He must continue earnest in preaching, whatever the success might be.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Before, there was a direct commission, now there is a symbolic action. John has the same vision (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 10:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff), but there that is expressed, which is here left to be inferred, namely, that \"as soon as he had eaten it his belly was bitter.\" The sweetness in the mouth denoted that it was good to be a messenger of the Lord (compare the margin reference), but the bitterness which accompanied it, denoted that the commission brought with it much sorrow. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "CHAPTER 3",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Eze 3:1-27. Ezekiel Eats the Roll. Is Commissioned to Go to Them of the Captivity and Goes to Tel-abib by the Chebar: Again Beholds the Shekinah Glory: Is Told to Retire to His House, and Only Speak when God Opens His Mouth.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. eat … and … speak—God's messenger must first inwardly appropriate God's truth himself, before he \"speaks\" it to others (see on [1020]Eze 2:8). Symbolic actions were, when possible and proper, performed outwardly; otherwise, internally and in spiritual vision, the action so narrated making the naked statement more intuitive and impressive by presenting the subject in a concentrated, embodied form.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "So, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; so soon as he had heard he must eat it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I opened my mouth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; not to discuss points, but to obey, to show my readiness indeed, and to do what lay on me to do. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He caused me to eat that roll; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " not by a force compelling me, but by a concurrent help in what the prophet was ready to do. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "So I opened my mouth,.... To take in the roll, and eat it; he was not disobedient to the heavenly vision; he did all that he could towards eating it, but was not sufficient of himself; and therefore it follows: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and he caused me to eat that roll; he, the Lord, put it into his mouth, caused him to eat it, and tilled him with it, according to his promise, Psalm 81:10. The efficacy and sufficiency to think of good things, to meditate upon them, receive and digest them, are of God; it is he that makes men prophets, and able ministers. The Targum is, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and he caused me to eat that roll; he, the Lord, put it into his mouth, caused him to eat it, and tilled him with it, according to his promise, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 81:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The efficacy and sufficiency to think of good things, to meditate upon them, receive and digest them, are of God; it is he that makes men prophets, and able ministers. The Targum is, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"and I inclined my soul, and he taught me (or made me wise \"with\") what was written in this roll.'' ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"and I inclined my soul, and he taught me (or made me wise \"with\") what was written in this roll.'' ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "So I opened my mouth, and he caused me to eat that roll.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "After the Lord had pointed out to the prophet the difficulties of the call laid upon him, He prepared him for the performance of his office, by inspiring him with the divine word which he is to announce. - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 2:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And thou, son of man, hear what I say to thee, Be not stiff-necked like the stiff-necked race; open thy mouth, and eat what I give unto thee. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 2:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Then I saw, and, lo, a hand outstretched towards me; and, lo, in the same a roll of a book. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 2:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And He spread it out before me; the same was written upon the front and back: and there were written upon it lamentations, and sighing, and woe. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 3:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And He said to me: Son of man, what thou findest eat; eat the roll, and go and speak to the house of Israel. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 3:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Then opened I my mouth, and He gave me this roll to eat. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 3:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And said to me: Son of man, feed thy belly, and fill thy body with this roll which I give thee. And I ate it, and it was in my mouth as honey and sweetness. - The prophet is to announce to the people of Israel only that which the Lord inspires him to announce. This thought is embodied in symbol, in such a way that an outstretched hand reaches to him a book, which he is to swallow, and which also, at God's command, he does swallow; cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 10:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This roll was inscribed on both sides with lamentations, sighing, and woe (הי is either abbreviated from נהי, not  equals  אי, or as Ewald, 101c, thinks, is only a more distinct form of הוי or הו). The meaning is not, that upon the roll was inscribed a multitude of mournful expressions of every kind, but that there was written upon it all that the prophet was to announce, and what we now read in his book. These contents were of a mournful nature, for they related to the destruction of the kingdom, the destruction of Jerusalem and of the temple. That Ezekiel may look over the contents, the roll is spread out before his eyes, and then handed to him to be eaten, with the words, \"Go and speak to the children of Israel,\" i.e., announce to the children of Israel what you have received into yourself, or as it is termed in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 3:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", דּברי, \"my words.\" The words in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 3:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " were spoken by God while handing to the prophet the roll to be eaten. He is not merely to eat, i.e., take it into his mouth, but he is to fill his body and belly therewith, i.e., he is to receive into his innermost being the word of God presented to him, to change it, as it were, into sap and blood. Whilst eating it, it was sweet in his mouth. The sweet taste must not, with Kliefoth, be explained away into a sweet \"after-taste,\" and made to bear this reference, that the destruction of Jerusalem would be followed by a more glorious restoration. The roll, inscribed with lamentation, sorrow, and woe, tasted to him sweetly, because its contents was God's word, which sufficed for the joy and gladness of his heart (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 15:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); for it is \"infinitely sweet and lovely to be the organ and spokesman of the Omnipotent,\" and even the most painful of divine truths possess to a spiritually-minded man a joyful and quickening side (Hengstenberg on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 10:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). To this it is added, that the divine penal judgments reveal not only the holiness and righteousness of God, but also prepare the way for the revelation of salvation, and minister to the saving of the soul.",
        "children": []
      }
    ]
  }
]