[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(3) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "It was in my mouth as honey for sweetness.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—That is, the first impression made upon him by his prophetic call was one of delight. Such it must always be to those whose high privilege it is to bear God’s message to their fellows. He does not expressly add, as St. John does (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 10:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") after a similar first sensation, “as soon as I had eaten it my belly was “bitter;” but it may easily be inferred from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 3:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that such was his experience also, when he went with his heavy message to a people indisposed to give ear. (Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 15:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 20:7-18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3:1-11 Ezekiel was to receive the truths of God as the food for his soul, and to feed upon them by faith, and he would be strengthened. Gracious souls can receive those truths of God with delight, which speak terror to the wicked. He must speak all that, and that only, which God spake to him. How can we better speak God's mind than with his words? If disappointed as to his people, he must not be offended. The Ninevites were wrought upon by Jonah's preaching, when Israel was unhumbled and unreformed. We must leave this unto the Divine sovereignty, and say, Lord, thy judgments are a great deep. They will not regard the word of the prophet, for they will not regard the rod of God. Christ promises to strengthen him. He must continue earnest in preaching, whatever the success might be.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Before, there was a direct commission, now there is a symbolic action. John has the same vision (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 10:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff), but there that is expressed, which is here left to be inferred, namely, that \"as soon as he had eaten it his belly was bitter.\" The sweetness in the mouth denoted that it was good to be a messenger of the Lord (compare the margin reference), but the bitterness which accompanied it, denoted that the commission brought with it much sorrow. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3. honey for sweetness—Compare Ps 19:10; 119:103; Re 10:9, where, as here in Eze 3:14, the \"sweetness\" is followed by \"bitterness.\" The former being due to the painful nature of the message; the latter because it was the Lord's service which he was engaged in; and his eating the roll and finding it sweet, implied that, divesting himself of carnal feeling, he made God's will his will, however painful the message that God might require him to announce. The fact that God would be glorified was his greatest pleasure.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " In this verse is confirmed and explained what was spoken ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ezekiel 3:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 3:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", which see. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Cause thy belly to eat; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the mouth is the proper instrument of eating, but when meat is eaten and digested, the belly is said to eat; the prophet must not just taste, but he must chew, swallow down, retain, and fill his belly with God’s word. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And fill thy bowels:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " this is the same repeated, unless it add to the other the measure, the fulness of the measure wherewith we should read, meditate, and digest the word of God and his works. And since bowels are the seat of compassion, it is likely the Lord would have his prophet be affected with pity toward that captive people, whose miseries he must foretell, and he foresees they must suffer. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "This roll that I give thee:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the roll and all that was in it came from God, and Ezekiel must remember this. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Then did I eat it, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And I did eat it.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "It was in my mouth as honey for sweetness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; upon the palate it was sweet (this done in vision still) as honey. If you wonder that such bitter tidings could be sweet to the prophet, if it be doubted how this could be, since, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ezekiel 2:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 2:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", it was full of lamentation, &c.. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Answ.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " It was sweet to receive such things by revelation from God, and so to converse with God; it is sweet to foresee future events, and to foretell God’s just judgments against sinners, and to have prospect of a vindication of the honour of God and credit of the prophet, who seeing all, these things with a well-composed mind, and just zeal for God, could not but approve and be pleased therewith. Or, it was sweet, as usually the first part of the ministerial work is pleasant, but at last wicked men’s opposition and persecution make it bitter, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ezekiel 3:14 Jeremiah 15:16-18 Revelation 10:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 3:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 15:16-18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 10:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And he said unto me, son of man, cause thy belly to eat,.... Or \"devour\" (f), and consume; that is, concoct and digest; do not cast it out of thy mouth, as soon as thou hast tasted of it; but let it go down into the stomach, and there digest it; and from thence into the belly, that so, upon the whole, virtue may be received, and nourishment come by it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and fill thy bowels with this roll that I give thee; eat to satiety; so the Targum, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"son of man, thou shalt satiate thy soul, and fill thy belly, if thou receivest what is written in this roll, which I give thee:'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "this was sufficient to qualify the prophet for prophesying, and furnish him with materials enough; and these fit and proper for the discharge of his office; and so such who study the word of God with application become scribes well instructed in the kingdom of heaven; and being filled themselves, are able to bring forth things to the comfort and satisfaction of others: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "then did I eat it, and it was in my mouth, as honey for sweetness; that is, as the roll was spread before him, he looked into it, and read it, and meditated upon it, and laid it up in his memory, in order to deliver it out when commanded; and though it contained things very distressing, and which would occasion lamentation, and mourning, and woe; yet, considering that these were the will of God, and in righteous judgment to men, he could not but acquiesce in and approve of them. All the words that come out of the mouth of God are as sweet as, honey, yea, sweeter than that, Psalm 19:10; and so the Targum interprets it of the words of the Lord, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "then did I eat it, and it was in my mouth, as honey for sweetness; that is, as the roll was spread before him, he looked into it, and read it, and meditated upon it, and laid it up in his memory, in order to deliver it out when commanded; and though it contained things very distressing, and which would occasion lamentation, and mourning, and woe; yet, considering that these were the will of God, and in righteous judgment to men, he could not but acquiesce in and approve of them. All the words that come out of the mouth of God are as sweet as, honey, yea, sweeter than that, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 19:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and so the Targum interprets it of the words of the Lord, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"and I took it, and his words were in my mouth as sweet honey;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and especially the Gospel, and the truths of it, are like honey; they are gathered by laborious ministers, as honey by the industrious bee, out of the various flowers of the Scriptures, with which being laden, they bring into the hive of the church, and dispose of for general usefulness; these are like honey for healthfulness, for nourishment, and for sweetness to the taste; that which makes the Gospel so are the exceeding great and precious promises in it: its doctrines of grace, and those of peace and reconciliation, of pardon, righteousness, eternal life and salvation, by Jesus Christ; and, above all, Christ himself, who is the sum and substance of it; and all its truths being quickening; comforting, and refreshing: but thou the Gospel is, only sweet when it is eaten; not merely heard, assented to, and superficially tasted of, but eaten and fed upon by faith; and so, it is sweet, not to unregenerate persons, whose taste is not changed; nor to nominal and notional professors, who have only a superficial taste of it; but to true believers in Christ, spiritual men, who judge and discern all things; see Revelation 10:9. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and especially the Gospel, and the truths of it, are like honey; they are gathered by laborious ministers, as honey by the industrious bee, out of the various flowers of the Scriptures, with which being laden, they bring into the hive of the church, and dispose of for general usefulness; these are like honey for healthfulness, for nourishment, and for sweetness to the taste; that which makes the Gospel so are the exceeding great and precious promises in it: its doctrines of grace, and those of peace and reconciliation, of pardon, righteousness, eternal life and salvation, by Jesus Christ; and, above all, Christ himself, who is the sum and substance of it; and all its truths being quickening; comforting, and refreshing: but thou the Gospel is, only sweet when it is eaten; not merely heard, assented to, and superficially tasted of, but eaten and fed upon by faith; and so, it is sweet, not to unregenerate persons, whose taste is not changed; nor to nominal and notional professors, who have only a superficial taste of it; but to true believers in Christ, spiritual men, who judge and discern all things; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 10:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(f) \"devoret, consumat\", Vatablus. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(f) \"devoret, consumat\", Vatablus. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And he said unto me, Son of man, cause thy belly to eat, and fill thy bowels with this roll that I give thee. Then did I eat it; and it was in my mouth as honey for sweetness.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 3.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "It was in my mouth as honey,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " etc. The words remind us of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 19:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 24:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and again of those of Jeremiah in  the darkest hour of his ministry (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 15:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). They are reproduced yet more closely by St. John (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 10:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). There is, after the first terror is over, an infinite sweetness in the thought of being a fellow worker with God, of speaking his words and not our own. In the case of St. John, the first sweetness was changed to bitterness as soon as he had eaten it; and this is, perhaps, implied here also in ver. 14. The first ecstatic joy passed away, and the former sense of the awfulness of the work returned. Ezekiel 3:3",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "After the Lord had pointed out to the prophet the difficulties of the call laid upon him, He prepared him for the performance of his office, by inspiring him with the divine word which he is to announce. - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 2:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And thou, son of man, hear what I say to thee, Be not stiff-necked like the stiff-necked race; open thy mouth, and eat what I give unto thee. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 2:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Then I saw, and, lo, a hand outstretched towards me; and, lo, in the same a roll of a book. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 2:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And He spread it out before me; the same was written upon the front and back: and there were written upon it lamentations, and sighing, and woe. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 3:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And He said to me: Son of man, what thou findest eat; eat the roll, and go and speak to the house of Israel. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 3:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Then opened I my mouth, and He gave me this roll to eat. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 3:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And said to me: Son of man, feed thy belly, and fill thy body with this roll which I give thee. And I ate it, and it was in my mouth as honey and sweetness. - The prophet is to announce to the people of Israel only that which the Lord inspires him to announce. This thought is embodied in symbol, in such a way that an outstretched hand reaches to him a book, which he is to swallow, and which also, at God's command, he does swallow; cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 10:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This roll was inscribed on both sides with lamentations, sighing, and woe (הי is either abbreviated from נהי, not  equals  אי, or as Ewald, 101c, thinks, is only a more distinct form of הוי or הו). The meaning is not, that upon the roll was inscribed a multitude of mournful expressions of every kind, but that there was written upon it all that the prophet was to announce, and what we now read in his book. These contents were of a mournful nature, for they related to the destruction of the kingdom, the destruction of Jerusalem and of the temple. That Ezekiel may look over the contents, the roll is spread out before his eyes, and then handed to him to be eaten, with the words, \"Go and speak to the children of Israel,\" i.e., announce to the children of Israel what you have received into yourself, or as it is termed in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 3:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", דּברי, \"my words.\" The words in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 3:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " were spoken by God while handing to the prophet the roll to be eaten. He is not merely to eat, i.e., take it into his mouth, but he is to fill his body and belly therewith, i.e., he is to receive into his innermost being the word of God presented to him, to change it, as it were, into sap and blood. Whilst eating it, it was sweet in his mouth. The sweet taste must not, with Kliefoth, be explained away into a sweet \"after-taste,\" and made to bear this reference, that the destruction of Jerusalem would be followed by a more glorious restoration. The roll, inscribed with lamentation, sorrow, and woe, tasted to him sweetly, because its contents was God's word, which sufficed for the joy and gladness of his heart (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 15:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); for it is \"infinitely sweet and lovely to be the organ and spokesman of the Omnipotent,\" and even the most painful of divine truths possess to a spiritually-minded man a joyful and quickening side (Hengstenberg on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 10:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). To this it is added, that the divine penal judgments reveal not only the holiness and righteousness of God, but also prepare the way for the revelation of salvation, and minister to the saving of the soul.",
        "children": []
      }
    ]
  }
]