[{"num":16,"verse":"In the seventeenth year of Pekah son of Remaliah, Ahaz son of Jotham king of Judah became king."},{"num":2,"verse":"Ahaz was twenty years old when he began his sixteen-year reign in Jerusalem. He did not do right in the sight of the Lord his God, like David his [forefather]."},{"num":3,"verse":"But he walked in the ways of Israel’s kings, yes, and made his son pass through the fire [and offered him as a sacrifice], in accord with the abominable [idolatrous] practices of the [heathen] nations whom the Lord drove out before the Israelites."},{"num":4,"verse":"He sacrificed and burned incense in the high places, on the hills, and under every green tree."},{"num":5,"verse":"Then Rezin king of Syria and Pekah son of Remaliah king of Israel came up to Jerusalem to wage war; they besieged Ahaz, but could not conquer him."},{"num":6,"verse":"At that time, Rezin king of Syria got back Elath [in Edom] for Syria and drove the Jews from [it]. The Syrians came to Elath and dwell there to this day."},{"num":7,"verse":"So Ahaz sent messengers to Tiglath-pileser king of Assyria, saying, I am your servant and son. Come up and save me out of the hands of the kings of Syria and of Israel, who are attacking me."},{"num":8,"verse":"And Ahaz took the silver and gold in the house of the Lord and in the treasuries of the king’s house and sent a present to the king of Assyria."},{"num":9,"verse":"Assyria’s king hearkened to him; he went up against Damascus, took it, carried its people captive to Kir, and slew Rezin."},{"num":10,"verse":"King Ahaz went to Damascus to meet Tiglath-pileser king of Assyria, and saw there their [heathen] altar. King Ahaz sent to Urijah the priest a model of the altar and an exact pattern for its construction."},{"num":11,"verse":"So Urijah the priest built an altar according to all that King Ahaz had sent from Damascus, finishing it before King Ahaz returned."},{"num":12,"verse":"When the king came from Damascus, he looked at the altar and offered on it."},{"num":13,"verse":"King Ahaz burned his burnt offering and his cereal offering, poured his drink offering, and dashed the blood of his peace offerings upon that altar."},{"num":14,"verse":"The bronze altar which was before the Lord he removed from the front of the house, from between his [new] altar and the house of the Lord, and put it on the north side of his altar."},{"num":15,"verse":"And King Ahaz commanded Urijah the priest: Upon the principal (the new) altar, burn the morning burnt offering, the evening cereal offering, the king’s burnt sacrifice and his cereal offering, with the burnt offering and cereal offering and drink offering of all the people of the land; and dash upon the [new] altar all the blood of the burnt offerings and the sacrifices. But the [old] bronze altar shall be kept for me to use to inquire by [of the Lord]."},{"num":16,"verse":"Urijah the priest did all this as King Ahaz commanded."},{"num":17,"verse":"[To keep Assyria’s king from getting them] King Ahaz cut off the panels of the bases [of the ten lavers] and removed the laver from each of them; and he took down the Sea from off the bronze oxen that were under it and put it upon stone supports."},{"num":18,"verse":"And the covered way for the Sabbath that they had built in the temple court, and the king’s outer entrance, he removed from the house of the Lord, because of the king of Assyria [who if he heard of them might seize them]."},{"num":19,"verse":"The rest of the acts of Ahaz, are they not written in the Book of the Chronicles of the Kings of Judah?"},{"num":20,"verse":"Ahaz slept with his fathers and was buried [with them] in the City of David. Hezekiah his son reigned in his stead."}]