[{"header":"The lookout"},{"num":33,"verse":"The Lord’s word came to me:"},{"num":2,"verse":"Human one, speak to your people and say to them: Suppose I bring a sword against a country, and the people of the land take a certain person from their assembly and make him their lookout."},{"num":3,"verse":"When he sees the sword coming against the land, he blows the trumpet and warns the people."},{"num":4,"verse":"If they hear the sound of the trumpet but don’t heed the warning, when the sword comes and they are taken away, they are responsible for their blood."},{"num":5,"verse":"They heard the sound of the trumpet but didn’t heed the warning, so their blood is on them. If they had paid attention to the warning, they would have saved their lives."},{"num":6,"verse":"If the lookout sees the sword coming but doesn’t blow the trumpet to warn the people, when the sword comes and takes away any of them, they are taken away in their sin, but I’ll hold the lookout responsible for their blood."},{"num":7,"verse":"You, human one, I’ve made you a lookout for the house of Israel. Whenever you hear me speaking, you must give them warning from me."},{"num":8,"verse":"If I pronounce a death sentence on wicked people, and you don’t warn them to turn from their way, they will die in their guilt, but I will hold you responsible for their blood."},{"num":9,"verse":"But suppose you do warn the wicked of their ways so that they might turn from them. If they don’t turn from their ways, they will die in their guilt, but you will save your life."},{"num":10,"verse":"You, human one, say to the house of Israel: This is what all of you are saying: “How our transgressions and our sins weigh on us! We waste away because of them. How can we live?”"},{"num":11,"verse":"Say to them, This is what the Lord God says: As surely as I live, do I take pleasure in the death of the wicked? If the wicked turn from their ways, they will live. Turn, completely turn from your wicked ways! Why should you die, house of Israel?"},{"num":12,"verse":"You, human one, say to your people: The righteousness of the righteous doesn’t rescue them when they begin to sin. Nor does the wickedness of the wicked make them stumble if they turn from their wickedness. If the righteous sin, their righteousness won’t protect them."},{"num":13,"verse":"Even if I’ve told the righteous they will live, none of their righteous deeds will be remembered if they trust in their righteousness and do wrong. They will die because of their evil deeds."},{"num":14,"verse":"And even if I have pronounced a death sentence on the wicked, if they turn from sin and do what is just and right—"},{"num":15,"verse":"if they return pledges, make restitution for robbery, and walk in life-giving regulations in order not to sin—they will live and not die."},{"num":16,"verse":"None of the sins they’ve committed will be remembered against them. They’ve done what is just and right, and they will live."},{"num":17,"verse":"Yet your people say, “My Lord’s way doesn’t measure up.” Isn’t it their ways that don’t measure up?"},{"num":18,"verse":"When the righteous turn from their righteousness to do wrong, they will die because of it."},{"num":19,"verse":"And when the wicked turn from their wickedness to do what is just and right, it is for that reason they will live."},{"num":20,"verse":"Yet you say, “My Lord’s way doesn’t measure up.” I judge each one of you according to your ways, house of Israel!"},{"header":"News from Jerusalem"},{"num":21,"verse":"In the twelfth year, on the fifth day of the tenth month of our exile, a survivor from Jerusalem came to me and reported, “The city has fallen!”"},{"num":22,"verse":"The Lord’s power was with me in the evening before the survivor arrived, and just before he arrived in the morning, God opened my mouth. So my mouth was opened, and I was no longer speechless."},{"num":23,"verse":"The Lord’s word came to me:"},{"num":24,"verse":"Human one, those who live among those ruins in Israel’s fertile land are saying, “Abraham was just one man, and he inherited the land. We are many, so certainly the land has been given to us as an inheritance.”"},{"num":25,"verse":"So say to them, The Lord God proclaims: You eat with the blood, you lift your eyes to the idols, and you shed blood. Should you inherit the land?"},{"num":26,"verse":"You live by the sword, you observe detestable practices, and every one of you commits adultery. Should you inherit the land?"},{"num":27,"verse":"Say to them, The Lord God proclaims: As surely as I live, those in the ruins will fall by the sword, those in the countryside I will give to the wild beasts to consume, and those in the strongholds and caves will die of plague."},{"num":28,"verse":"I will make the land an uninhabitable waste. Its proud strength will come to an end, and Israel’s highlands will become so deserted that no one will cross through them."},{"num":29,"verse":"They will know that I am the Lord when I make the land an uninhabitable waste because of all their detestable practices."},{"header":"A fickle audience"},{"num":30,"verse":"As for you, human one, your people talk about you beside the walls and in their doorways. One by one, they say to each other, “Let’s go hear what sort of message has come from the Lord.”"},{"num":31,"verse":"So they come to you as people do, and they sit before you as my people. They listen to your words, but they refuse to do them. Though they speak of their longing for me, they act out of their own interests and opinions."},{"num":32,"verse":"To them you are like a singer of love songs with a lovely voice and skilled technique. They listen to your words, but no one does them."},{"num":33,"verse":"When this comes—and it is certainly coming—they will know that a prophet has been among them."}]