[{"header":"Watchman, Blow the Shofar"},{"num":33,"verse":"The word of Adonai came to me saying: "},{"num":2,"verse":"“Son of man, speak to the children of your people and say to them: ‘When I bring the sword upon a land, suppose the people of the land take a man from among them, and set him as their watchman. "},{"num":3,"verse":"If, when he sees the sword coming upon the land, he blows the shofar and warns the people, "},{"num":4,"verse":"then whoever hears the sound of the shofar but ignores the warning, if the sword comes and takes him away, his blood will be on his own head. "},{"num":5,"verse":"He heard the sound of the shofar and ignored the warning; his blood will be on himself. However, if he had taken warning, he would have saved his soul. "},{"num":6,"verse":"But if the watchman sees the sword come and does not blow the shofar, the people are not warned. Then the sword does come and takes a person from among them—he is taken away in his iniquity, but his blood I will require at the watchman’s hand.’"},{"num":7,"verse":"“You, son of man, I have set you as a watchman for the house of Israel. When you hear the word from My mouth, warn them from Me. "},{"num":8,"verse":"When I say to the wicked: ‘Wicked one, you will surely die!’ and you do not speak to warn the wicked about his way—that wicked one will die in his iniquity, but his blood I will require at your hand. "},{"num":9,"verse":"If you warn the wicked of his way to turn from it and he does not turn from his way, then he will die in his iniquity—but you have saved your soul."},{"num":10,"verse":"“You, son of man, say to the house of Israel: ‘You have said, “Surely our transgressions and our sins are upon us and we are pining away in them. So how can we live.” "},{"num":11,"verse":"Say to them: ‘As I live’—it is a declaration of Adonai—‘I have no pleasure in the death of the wicked, but that the wicked turn from his way and live. Return, return from your evil ways. Why will you die, O house of Israel?’"},{"num":12,"verse":"“You, son of man, say to the children of your people: ‘The righteousness of the righteous person will not deliver him in the day of his transgression. Nor will the wickedness of the wicked person make him stumble in it on the day he turns away from his wickedness. Nor will the righteous person be able to live by it on the day he sins. "},{"num":13,"verse":"When I tell the righteous that he will surely live, but he trusts in his own righteousness and commits iniquity, none of his righteous deeds will be remembered. But in his iniquity that he has committed, he will die. "},{"num":14,"verse":"When I say to the wicked, “You will surely die,” yet he turns from his sin and does what is just and right—"},{"num":15,"verse":"if the wicked restores a pledge, gives back what he had taken by robbery, walks in the laws of life, committing no iniquity—he will surely live, he will not die. "},{"num":16,"verse":"None of his sins that he has committed will be remembered against him. He has done what is just and right; he will surely live.’"},{"num":17,"verse":"“Yet the children of your people say, ‘The way of Adonai isn’t fair!’ but it is their way, theirs that is unfair."},{"num":18,"verse":"When a righteous person turns from his righteousness and commits iniquity, he will die in it. "},{"num":19,"verse":"When a wicked person turns from his wickedness and does what is just and right, he will live by it. "},{"num":20,"verse":"Yet you say, ‘The way of Adonai is not fair!’ House of Israel, I will judge every one of you according to his ways.”"},{"header":"Jerusalem Falls"},{"num":21,"verse":"In the twelfth year of our exile, on the fifth day of the tenth month, a survivor from Jerusalem came to me saying, “The city has been struck down.” "},{"num":22,"verse":"The hand of Adonai had been upon me in the evening, before the survivor came. He had opened my mouth by the time of his coming to me in the morning. So my mouth was opened and I was no longer mute."},{"num":23,"verse":"Then the word of Adonai came to me saying: "},{"num":24,"verse":"“Son of man, the inhabitants of these ruins in the land of Israel keep saying, ‘Abraham was only one, yet he inherited the land. Since we are many, the land is given to us as a possession.’"},{"num":25,"verse":"“Therefore say to them, thus says Adonai Elohim: ‘You eat with the blood, lift up your eyes to your idols and shed blood. Should you possess the land? "},{"num":26,"verse":"You rely on your sword, commit abominations and each of you defiles his neighbor’s wife. Should you possess the land?’ "},{"num":27,"verse":"Say this to them, thus says Adonai Elohim: ‘As I live, surely those who are in the ruins will fall by the sword. Whoever is in the open field I will give to the beasts to be devoured, and whoever is in the strongholds and in the caves will die of the plague. "},{"num":28,"verse":"I will make the land a desolation and a horror. The pride of her power will cease. The mountains of Israel will be desolate, so that no one will pass through.’ "},{"num":29,"verse":"They will know that I am Adonai, when I have made the land a desolate waste, because of all their abominations that they have committed.”"},{"num":30,"verse":"“Now as for you, son of man, the children of your people are talking about you by the walls and in the doorways of the houses. Each one speaks to one another, each saying to his brother: ‘Come now, hear what message is coming forth from Adonai!’ "},{"num":31,"verse":"So they come to you, as people come, and sit before you as My people and hear your words—but they do not do them—for with their mouth they express doting love, but their heart goes after their own dishonest gain. "},{"num":32,"verse":"Look, you are like a love song to them, one who has a beautiful voice and can play well on an instrument. They hear your words, but do not practice them. "},{"num":33,"verse":"When this comes to pass—behold, it is coming—they will know that a prophet has been among them.”"}]