[{"header":"If You Believe You Will Be Saved"},{"num":10,"verse":"Brothers and sisters, my heart’s desire and prayer to God on behalf of the Jewish people is that they would be saved. "},{"num":2,"verse":"I can assure you that they are deeply devoted to God, but they are misguided. "},{"num":3,"verse":"They don’t understand ⌞how to receive⌟ God’s approval. So they try to set up their own way to get it, and they have not accepted God’s way for receiving his approval. "},{"num":4,"verse":"Christ is the fulfillment of Moses’ Teachings so that everyone who has faith may receive God’s approval."},{"num":5,"verse":"Moses writes about receiving God’s approval by following his laws. He says, “The person who obeys these laws will live because he obeys them.” "},{"num":6,"verse":"However, Scripture says about God’s approval which is based on faith, “Don’t ask yourself who will go up to heaven,” (that is, to bring Christ down). "},{"num":7,"verse":"“Don’t ask who will go down into the depths,” (that is, to bring Christ back from the dead). "},{"num":8,"verse":"However, what else does it say? “This message is near you. It’s in your mouth and in your heart.” This is the message of faith that we spread. "},{"num":9,"verse":"If you declare that Jesus is Lord, and believe that God brought him back to life, you will be saved. "},{"num":10,"verse":"By believing you receive God’s approval, and by declaring your faith you are saved. "},{"num":11,"verse":"Scripture says, “Whoever believes in him will not be ashamed.”"},{"num":12,"verse":"There is no difference between Jews and Greeks. They all have the same Lord, who gives his riches to everyone who calls on him. "},{"num":13,"verse":"So then, “Whoever calls on the name of the Lord will be saved.”"},{"num":14,"verse":"But how can people call on him if they have not believed in him? How can they believe in him if they have not heard his message? How can they hear if no one tells ⌞the Good News⌟? "},{"num":15,"verse":"How can people tell the Good News if no one sends them? As Scripture says, “How beautiful are the feet of the messengers who announce the Good News.” "},{"num":16,"verse":"But not everyone has believed the Good News."},{"num":17,"verse":"So faith comes from hearing the message, and the message that is heard is what Christ spoke."},{"num":18,"verse":"But I ask, “Didn’t they hear that message?” Certainly they did! “The voice of the messengers has gone out into the whole world and their words to the ends of the earth.”"},{"num":19,"verse":"Again I ask, “Didn’t Israel understand ⌞that message⌟?” Moses was the first to say, “I will make you jealous of people who are not a nation. I will make you angry about a nation that doesn’t understand.” "},{"num":20,"verse":"Isaiah said very boldly, “I was found by those who weren’t looking for me. I was revealed to those who weren’t asking for me.” "},{"num":21,"verse":"Then Isaiah said about Israel, “All day long I have stretched out my hands to disobedient and rebellious people.”"}]