[{"num":10,"verse":"Brothers, the thing I want most is for all the Jews to be saved. That is my prayer to God. "},{"num":2,"verse":"I can say this about them: They really try to follow God. But they do not know the right way. "},{"num":3,"verse":"They did not know the way that God makes people right with him. And they tried to make themselves right in their own way. So they did not accept God’s way of making people right. "},{"num":4,"verse":"Christ ended the law, so that everyone who believes in him may be right with God."},{"num":5,"verse":"Moses writes about being made right by following the law. He says, “A person who does these things will have life forever because of them.” "},{"num":6,"verse":"But this is what the Scripture says about being made right through faith: “Don’t say to yourself, ‘Who will go up into heaven?’” (That means, “Who will go up to heaven to get Christ and bring him down to earth?”) "},{"num":7,"verse":"“And do not say, ‘Who will go down into the world below?’” (That means, “Who will go down to get Christ and bring him up from death?”) "},{"num":8,"verse":"This is what the Scripture says: “God’s teaching is near you; it is in your mouth and in your heart.” That is the teaching of faith that we tell. "},{"num":9,"verse":"If you declare with your mouth, “Jesus is Lord,” and if you believe in your heart that God raised Jesus from death, then you will be saved. "},{"num":10,"verse":"We believe with our hearts, and so we are made right with God. And we declare with our mouths to say that we believe, and so we are saved. "},{"num":11,"verse":"As the Scripture says, “Anyone who trusts in him will never be disappointed.” "},{"num":12,"verse":"That Scripture says “anyone” because there is no difference between Jew and non-Jew. The same Lord is the Lord of all and gives many blessings to all who trust in him. "},{"num":13,"verse":"The Scripture says, “Anyone who asks the Lord for help will be saved.”"},{"num":14,"verse":"But before people can trust in the Lord for help, they must believe in him. And before they can believe in the Lord, they must hear about him. And for them to hear about the Lord, someone must tell them. "},{"num":15,"verse":"And before someone can go and tell them, he must be sent. It is written, “How beautiful is the person who comes to bring good news.”"},{"num":16,"verse":"But not all the Jews accepted the good news. Isaiah said, “Lord, who believed what we told them?” "},{"num":17,"verse":"So faith comes from hearing the Good News. And people hear the Good News when someone tells them about Christ."},{"num":18,"verse":"But I ask: Didn’t people hear the Good News? Yes, they heard—as the Scripture says:"},{"num":19,"verse":"Again I ask: Didn’t the people of Israel understand? Yes, they did understand. First, Moses says:"},{"num":20,"verse":"Then Isaiah is bold enough to say:"},{"num":21,"verse":"But about Israel God says,"}]