[{"num":10,"verse":"¶ Brethren, certainly the desire of my heart and my prayer to God regarding Israel, is for saving health."},{"num":2,"verse":"For I give testimony that they have a zeal of God, but not according to knowledge."},{"num":3,"verse":"For they, being ignorant of God’s righteousness and going about to establish their own righteousness, have not submitted themselves unto the righteousness of God."},{"num":4,"verse":"For Christ is the end of the law, to give righteousness to every one that believes."},{"num":5,"verse":"For Moses describes the righteousness which is by the law, That the man who does those things shall live by them."},{"num":6,"verse":"But thus saith the righteousness which is by faith, Say not in thine heart, Who shall ascend into heaven (that is, to bring the Christ down from above)?"},{"num":7,"verse":"Or, Who shall descend into the deep (that is, to bring up the Christ again from the dead)?"},{"num":8,"verse":"But what does it say? The word is near thee, even in thy mouth and in thy heart: that is, the word of faith, which we preach,"},{"num":9,"verse":"that if thou shalt confess with thy mouth the Lord Jesus and shalt believe in thine heart that God has raised him from the dead, thou shalt be saved."},{"num":10,"verse":"For with the heart one believes unto righteousness, and with the mouth confession is made unto saving health."},{"num":11,"verse":"For the scripture says, Whosoever believes on him shall not be ashamed."},{"num":12,"verse":"¶ For there is no difference between the Jew and the Greek, for the same Lord over all is rich unto all that call upon him."},{"num":13,"verse":"For whosoever shall call upon the name of the Lord shall be saved."},{"num":14,"verse":"How then shall they call on him in whom they have not believed? and how shall they believe him of whom they have not heard? and how shall they hear without a preacher?"},{"num":15,"verse":"And how shall they preach if they have not been sent? as it is written, How beautiful are the feet of those that announce the gospel of peace, of those that announce the gospel of that which is good!"},{"num":16,"verse":"But not everyone hearkens unto the gospel. For Isaiah says, Lord, who has believed our report?"},{"num":17,"verse":"So then faith comes by hearing, and the ear to hear by the word of God."},{"num":18,"verse":"But I say, Have they not heard? Yes verily, their fame went into all the earth, and their words unto the ends of the world."},{"num":19,"verse":"But I say, Did not Israel know? First Moses says, I will provoke you unto jealousy with people that are not mine, and with ignorant people I will provoke you to anger."},{"num":20,"verse":"But Isaiah is very bold and says, I was found by those that did not seek me; I manifested myself unto those that did not ask after me."},{"num":21,"verse":"And against Israel he says, All day long I have stretched forth my hands unto a disobedient and gainsaying people."}]