[[],[{"type":"prose","content":"Brothers and sisters, my heart’s desire and prayer to God on behalf of my fellow Israelites is for their salvation. "}],[{"type":"prose","content":"For I can testify that they are zealous for God, but their zeal is not in line with the truth. "}],[{"type":"prose","content":"For ignoring the righteousness that comes from God, and seeking instead to establish their own righteousness, they did not submit to God’s righteousness. "}],[{"type":"prose","content":"For Christ is the end of the law, with the result that there is righteousness for everyone who believes."}],[{"type":"prose","content":"For Moses writes about the righteousness that is by the law: “.” "}],[{"type":"prose","content":"But the righteousness that is by faith says: “, ‘’” (that is, to bring Christ down) "}],[{"type":"prose","content":"or “” (that is, to bring Christ up from the dead). "}],[{"type":"prose","content":"But what does it say? “” (that is, the word of faith that we preach), "}],[{"type":"prose","content":"because if you confess with your mouth that Jesus is Lord and believe in your heart that God raised him from the dead, you will be saved. "}],[{"type":"prose","content":"For with the heart one believes and thus has righteousness and with the mouth one confesses and thus has salvation. "}],[{"type":"prose","content":"For the scripture says, “.” "}],[{"type":"prose","content":"For there is no distinction between the Jew and the Greek, for the same Lord is Lord of all, who richly blesses all who call on him. "}],[{"type":"prose","content":"For ."}],[{"type":"prose","content":"How are they to call on one they have not believed in? And how are they to believe in one they have not heard of? And how are they to hear without someone preaching to them? "}],[{"type":"prose","content":"And how are they to preach unless they are sent? As it is written, “  .” "}],[{"type":"prose","content":"But not all have obeyed the good news, for Isaiah says, “?” "}],[{"type":"prose","content":"Consequently faith comes from what is heard, and what is heard comes through the preached word of Christ."}],[{"type":"prose","content":"But I ask, have they not heard? Yes, they have: . "}],[{"type":"prose","content":"But again I ask, didn’t Israel understand? First Moses says, “.” "}],[{"type":"prose","content":"And Isaiah is even bold enough to say, “.” "}],[{"type":"prose","content":"But about Israel he says, “”"}]]