[[],[{"type":"header","content":"Israel Needs the Gospel"},{"type":"prose","content":"Brethren, my heart’s desire and prayer to God for Israel is that they may be saved. "}],[{"type":"prose","content":"For I bear them witness that they have a zeal for God, but not according to knowledge. "}],[{"type":"prose","content":"For they being ignorant of God’s righteousness, and seeking to establish their own righteousness, have not submitted to the righteousness of God. "}],[{"type":"prose","content":"For Christ  the end of the law for righteousness to everyone who believes."}],[{"type":"prose","content":"For Moses writes about the righteousness which is of the law,  "}],[{"type":"prose","content":"But the righteousness of faith speaks in this way,  (that is, to bring Christ down ) "}],[{"type":"prose","content":"or,  (that is, to bring Christ up from the dead). "}],[{"type":"prose","content":"But what does it say?  (that is, the word of faith which we preach): "}],[{"type":"prose","content":"that if you confess with your mouth the Lord Jesus and believe in your heart that God has raised Him from the dead, you will be saved. "}],[{"type":"prose","content":"For with the heart one believes unto righteousness, and with the mouth confession is made unto salvation. "}],[{"type":"prose","content":"For the Scripture says,  "}],[{"type":"prose","content":"For there is no distinction between Jew and Greek, for the same Lord over all is rich to all who call upon Him. "}],[{"type":"prose","content":"For    "}],[{"type":"header","content":"Israel Rejects the Gospel"},{"type":"prose","content":"How then shall they call on Him in whom they have not believed? And how shall they believe in Him of whom they have not heard? And how shall they hear without a preacher? "}],[{"type":"prose","content":"And how shall they preach unless they are sent? As it is written:"}],[{"type":"prose","content":"But they have not all obeyed the gospel. For Isaiah says,  "}],[{"type":"prose","content":"So then faith  by hearing, and hearing by the word of God."}],[{"type":"prose","content":"But I say, have they not heard? Yes indeed:"}],[{"type":"prose","content":"But I say, did Israel not know? First Moses says:"}],[{"type":"prose","content":"But Isaiah is very bold and says:"}],[{"type":"prose","content":"But to Israel he says:"}]]