[{"num":23,"verse":"When you sit down to eat with a ruler, think about what is in front of you. "},{"num":2,"verse":"Put a knife to your neck if you are a man who is given to much eating. "},{"num":3,"verse":"Do not desire his special foods, for they are put there for no good reason."},{"num":4,"verse":"Do not work hard to be rich. Stop trying to get things for yourself. "},{"num":5,"verse":"When you set your eyes upon it, it is gone. For sure, riches make themselves wings like an eagle that flies toward the heavens."},{"num":6,"verse":"Do not eat the bread of a man who thinks only about himself. Do not have a desire for his fine food. "},{"num":7,"verse":"For as he thinks in his heart, so is he. He says to you, “Eat and drink!” But his heart is not with you. "},{"num":8,"verse":"You will spit up the piece of food you have eaten, and waste your good words."},{"num":9,"verse":"Do not speak in the hearing of a fool, for he will hate the wisdom of your words."},{"num":10,"verse":"Do not take away the old land-mark, or go into the fields of those without a father. "},{"num":11,"verse":"For the One Who saves them is strong. He will stand by them and give them help against you. "},{"num":12,"verse":"Open your heart to teaching, and your ears to words of much learning."},{"num":13,"verse":"Do not keep from punishing the child if he needs it. If you beat him with the stick, he will not die. "},{"num":14,"verse":"Beat him with the stick, and save his soul from hell."},{"num":15,"verse":"My son, if your heart is wise, my own heart will be glad also. "},{"num":16,"verse":"My heart will be full of joy when your lips speak what is right."},{"num":17,"verse":"Do not let your heart be jealous of sinners, but live in the fear of the Lord always. "},{"num":18,"verse":"For sure there is a future and your hope will not be cut off. "},{"num":19,"verse":"Listen, my son, and be wise. Lead your heart in the way. "},{"num":20,"verse":"Do not be with those who drink too much wine or eat too much meat. "},{"num":21,"verse":"For the man who drinks too much or eats too much will become poor, and much sleep will dress a man in torn clothes."},{"num":22,"verse":"Listen to your father who gave you life, and do not hate your mother when she is old. "},{"num":23,"verse":"Buy truth, and do not sell it. Get wisdom and teaching and understanding."},{"num":24,"verse":"The father of one who is right with God will have much joy. He who has a wise son will be glad in him. "},{"num":25,"verse":"Let your father and mother be glad, and let her who gave birth to you be full of joy."},{"num":26,"verse":"Give me your heart, my son. Let your eyes find joy in my ways. "},{"num":27,"verse":"For a woman who sells the use of her body is like a deep hole. A sinful woman is a narrow well. "},{"num":28,"verse":"She lies in wait as a robber, and makes many more men not faithful."},{"num":29,"verse":"Who has trouble? Who has sorrow? Who is fighting? Who is complaining? Who is hurt without a reason? Who has eyes that have become red? "},{"num":30,"verse":"Those who stay a long time over wine. Those who go to taste mixed wine. "},{"num":31,"verse":"Do not look at wine when it is red, when it shines in the cup, when it is smooth in going down. "},{"num":32,"verse":"In the end it bites like a snake. It stings like the bite of a snake with poison. "},{"num":33,"verse":"Your eyes will see strange things. Your mind will say the wrong things. "},{"num":34,"verse":"And you will be like one who lies down in the center of the sea, or like one who lies above a ship’s sail. "},{"num":35,"verse":"“They hit me, but I was not hurt. They beat me, but I did not know it. When will I wake up? I will look for another drink.”"}]