[{"num":23,"verse":"When thou sittest to eat with a ruler, Thou considerest diligently that which [is] before thee,"},{"num":2,"verse":"And thou hast put a knife to thy throat, If thou [art] a man of appetite."},{"num":3,"verse":"Have no desire to his dainties, seeing it [is] lying food."},{"num":4,"verse":"Labour not to make wealth, From thine own understanding cease, Dost thou cause thine eyes to fly upon it? Then it is not."},{"num":5,"verse":"For wealth maketh to itself wings, As an eagle it flieth to the heavens."},{"num":6,"verse":"Eat not the bread of an evil eye, And have no desire to his dainties,"},{"num":7,"verse":"For as he hath thought in his soul, so [is] he, `Eat and drink,' saith he to thee, And his heart [is] not with thee."},{"num":8,"verse":"Thy morsel thou hast eaten thou dost vomit up, And hast marred thy words that [are] sweet."},{"num":9,"verse":"In the ears of a fool speak not, For he treadeth on the wisdom of thy words."},{"num":10,"verse":"Remove not a border of olden times, And into fields of the fatherless enter not,"},{"num":11,"verse":"For their Redeemer [is] strong, He doth plead their cause with thee."},{"num":12,"verse":"Bring in to instruction thy heart, And thine ear to sayings of knowledge."},{"num":13,"verse":"Withhold not from a youth chastisement, When thou smitest him with a rod he dieth not."},{"num":14,"verse":"Thou with a rod smitest him, And his soul from Sheol thou deliverest."},{"num":15,"verse":"My son, if thy heart hath been wise, My heart rejoiceth, even mine,"},{"num":16,"verse":"And my reins exult when thy lips speak uprightly."},{"num":17,"verse":"Let not thy heart be envious at sinners, But -- in the fear of Jehovah all the day."},{"num":18,"verse":"For, is there a posterity? Then thy hope is not cut off."},{"num":19,"verse":"Hear thou, my son, and be wise, And make happy in the way thy heart,"},{"num":20,"verse":"Be not thou among quaffers of wine, Among gluttonous ones of flesh,"},{"num":21,"verse":"For the quaffer and glutton become poor, And drowsiness clotheth with rags."},{"num":22,"verse":"Hearken to thy father, who begat thee, And despise not thy mother when she hath become old."},{"num":23,"verse":"Truth buy, and sell not, Wisdom, and instruction, and understanding,"},{"num":24,"verse":"The father of the righteous rejoiceth greatly, The begetter of the wise rejoiceth in him."},{"num":25,"verse":"Rejoice doth thy father and thy mother, Yea, she that bare thee is joyful."},{"num":26,"verse":"Give, my son, thy heart to me, And let thine eyes watch my ways."},{"num":27,"verse":"For a harlot [is] a deep ditch, And a strange woman [is] a strait pit."},{"num":28,"verse":"She also, as catching prey, lieth in wait, And the treacherous among men she increaseth."},{"num":29,"verse":"Who hath wo? who hath sorrow? Who hath contentions? who hath plaint? Who hath wounds without cause? Who hath redness of eyes?"},{"num":30,"verse":"Those tarrying by the wine, Those going in to search out mixed wine."},{"num":31,"verse":"See not wine when it showeth itself red, When it giveth in the cup its colour, It goeth up and down through the upright."},{"num":32,"verse":"Its latter end -- as a serpent it biteth, And as a basilisk it stingeth."},{"num":33,"verse":"Thine eyes see strange women, And thy heart speaketh perverse things."},{"num":34,"verse":"And thou hast been as one lying down in the heart of the sea, And as one lying down on the top of a mast."},{"num":35,"verse":"`They smote me, I have not been sick, They beat me, I have not known. When I awake -- I seek it yet again!'"}]