[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(14) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Camphire.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Marg",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "., cypress: Heb., côpher. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "There is no doubt of the identity of this plant with the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Henna ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "of the Arabs, the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Lawsonia aïba ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "inermis ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "of botanists. Robinson found it growing in abundance at En-gedi (where ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "alone ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "it is found), and suggested the identification (see his Note, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Researches, ii.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " 211). Tristram describes it thus: “It is a small shrub, eight or ten feet high, with dark back, pale green foliage, and clusters of white and yellow blossoms of a powerful fragrance. Not only is the perfume of the flower highly prized, but a paste is made of the dried and pounded leaves, which is used by the women of all ranks and the men of the wealthier classes to dye the palms of the hands, the soles of the feet, and the nails” (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Nat. Hist. of the Bible, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "p. 339). (Comp. also Thomson, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The Land and the Book, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "p. 602, who, however, prefers to identify ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "côpher ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "with some specially favourite kind of grapes, but without giving any sufficient reason.) For En-gedi, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 15:62",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It is the only place in Southern. Palestine mentioned in this poem, the other allusions (except Heshbon, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Song of Solomon 7:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which is in Moab) being to northern localities.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1:9-17 The Bridegroom gives high praises of his spouse. In the sight of Christ believers are the excellent of the earth, fitted to be instruments for promoting his glory. The spiritual gifts and graces which Christ bestows on every true believer, are described by the ornaments then in use, ver. 10,11. The graces of the saints are many, but there is dependence upon each other. He who is the Author, will be the Finisher of the good work. The grace received from Christ's fulness, springs forth into lively exercises of faith, affection, and gratitude. Yet Christ, not his gifts, is most precious to them. The word translated camphire, signifies atonement or propitiation. Christ is dear to all believers, because he is the propitiation for their sins. No pretender must have his place in the soul. They resolved to lodge him in their hearts all the night; during the continuance of the troubles of life. Christ takes delight in the good work which his grace has wrought on the souls of believers. This should engage all who are made holy, to be very thankful for that grace which has made those fair, who by nature were deformed. The spouse (the believer) has a humble, modest eye, discovering simplicity and godly sincerity; eyes enlightened and guided by the Holy Spirit, that blessed Dove. The church expresses her value for Christ. Thou art the great Original, but I am but a faint and imperfect copy. Many are fair to look at, yet their temper renders them unpleasant: but Christ is fair, yet pleasant. The believer, ver. 16, speaks with praise of those holy ordinances in which true believers have fellowship with Christ. Whether the believer is in the courts of the Lord, or in retirement; whether following his daily labours, or confined on the bed of sickness, or even in a dungeon, a sense of the Divine presence will turn the place into a paradise. Thus the soul, daily having fellowship with the Father, the Son, and the Holy Spirit, enjoys a lively hope of an incorruptible, undefiled, and unfading inheritance above.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Camphire - Rather, כפר  kôpher,\" from which \"cyprus\" is probably derived (in the margin misspelled \"cypress \"),the name by which the plant called by the Arabs \"henna\" was known to the Greeks and Romans. It is still much esteemed throughout the East for the fragrance of its flowers and the dye extracted from its leaves. Engedi was famous for its vines, and the henna may have been cultivated with the vines in the same enclosures. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "14. cluster—Jesus Christ is one, yet manifold in His graces.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "camphire—or, \"cypress.\" The \"hennah\" is meant, whose odorous flowers grow in clusters, of a color white and yellow softly blended; its bark is dark, the foliage light green. Women deck their persons with them. The loveliness of Jesus Christ.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "vineyards—appropriate in respect to Him who is \"the vine.\" The spikenard was for the banquet (So 1:12); the myrrh was in her bosom continually (So 1:13); the camphire is in the midst of natural beauties, which, though lovely, are eclipsed by the one cluster, Jesus Christ, pre-eminent above them all.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "En-gedi—in South Palestine, near the Dead Sea (Jos 15:62; Eze 47:10), famed for aromatic shrubs.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Camphire; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cypress",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as others render it. It was an odoriferous plant growing in vineyards, and some think that it was a most pleasant kind of vine, like that which bears muscatel grapes; yea, some very learned men understand it of that plant which dropped balm, which grew in or near the place here specified, as is affirmed not only by the Jews, but also by pagan writers, as Diodorus and Trogus. Nor are we concerned to know which or what it was; it being confessed and evident, that it was some pleasant and grateful plant, and that it sets forth that great delight which the church hath in the enjoyment of Christ. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "En-gedi; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a pleasant and well-watered place in the tribe of Judah, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Joshua 15:62 Ezekiel 47:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 15:62",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 47:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", where there were many pleasant plants, whence it was called Hazazontamar, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "2 Chronicles 20:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 20:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "My beloved is unto me as a cluster of camphire in the vineyards of Engedi. Engedi was a place near Jericho, and famous for palm trees, as that was, hence called Hazazontamar, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 20:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Pliny (o) sneaking of this place, which he calls Engadda, says, it is second to Jerusalem for fertility and groves of palm trees; and Josephus (p) observes, that there grew the best palm trees and opobalsam; wherefore Aben Ezra, and other Jewish writers, think that dates, the fruit of the palm trees, which grow in clusters, are here meant: and because the balsam tree also, grew in this place, as observed before from Josephus, and grew in the manner of vines, as others (q) assert; and this being said to, be in vineyards, some have thought that that might be in, tended; but what is valuable in it is a gum or tear, that drops from it, and not fruit in clusters, which it bears not: nor can it be supposed that what we call \"camphire\" should be meant, which grows not in clusters, and was unknown to the ancients; nor the \"cyperus\", or \"cypirus\", as Cocceius and others. The Septuagint version readers it \"cyprus\": and there was a tree of this name which grew in Askelon in Judea, which, according to Pliny (r), bore a white flower of a sweet smell; and which, in Italy, was called \"ligustrum\", the privet tree, commended by the poets (s) for its peculiar whiteness; and the cypress tree is reckoned by Josephus (t) among the odoriferous trees which grew about Jericho, near to which Engedi was. The word here used is to be found in the Misnah (u); and the commentators (w) on it say, it is the same which, in Arabic, is called \"alhena\", the cypress tree, and refer to this place; of which Dr. Shaw (x) says, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"this beautiful and odoriferous plant, \"alhenna\", if it is not annually cut, and kept low, grows ten or twelve feet high, putting out its little flowers in clusters, which yield a most grateful smell, like camphire.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "But, after all, perhaps the Cyprus vine is here meant, which, according to Pliny (y), was the best and largest of vines; and which, though it grew in Cyprus, from whence it had its name, yet some plants of it might be obtained by Solomon, and planted in the vineyards of Engedi; or there were such there like them, and were called by the same name: Jarchi, from an ancient exposition of theirs, relates, that the vineyards of this place brought forth fruit four or five times a year; Alshech says seven. Now as Christ compares himself to a vine, John 15:1; the church may compare him to a cluster of the grapes of the Cyprus vine, reckoned the best; there being a cluster of all perfections, divine and human, in him; and of all the spiritual blessings of the everlasting covenant, and of all the precious promises in it; and of all the grace of the Spirit, and the fulness of it, which is in him. The Jews calls a man, eminent for virtue, and a large share of knowledge, \"clusters\" (z); and they interpret \"eschol\", a cluster, by  , \"a man that has all things in him\" (a): such an one is Christ, in the highest sense, having all perfections, excellencies, and virtues, in him. Some leave the word untranslated, \"copher\" (b), and which has the signification of atonement and propitiation; and so well agrees with Christ, who is the propitiation for sin, and has made atonement for it. Bishop Patrick observes, that the ancient Hebrew doctors, by dividing the first word \"eschol\", found out the mystery of the Messiah; considering it as if thus read,  , \"my beloved is unto me the man that propitiates\" or \"expiates all things\"; that is, all sins and transgressions: in the Talmud (c) it is explained, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "But, after all, perhaps the Cyprus vine is here meant, which, according to Pliny (y), was the best and largest of vines; and which, though it grew in Cyprus, from whence it had its name, yet some plants of it might be obtained by Solomon, and planted in the vineyards of Engedi; or there were such there like them, and were called by the same name: Jarchi, from an ancient exposition of theirs, relates, that the vineyards of this place brought forth fruit four or five times a year; Alshech says seven. Now as Christ compares himself to a vine, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 15:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; the church may compare him to a cluster of the grapes of the Cyprus vine, reckoned the best; there being a cluster of all perfections, divine and human, in him; and of all the spiritual blessings of the everlasting covenant, and of all the precious promises in it; and of all the grace of the Spirit, and the fulness of it, which is in him. The Jews calls a man, eminent for virtue, and a large share of knowledge, \"clusters\" (z); and they interpret \"eschol\", a cluster, by  , \"a man that has all things in him\" (a): such an one is Christ, in the highest sense, having all perfections, excellencies, and virtues, in him. Some leave the word untranslated, \"copher\" (b), and which has the signification of atonement and propitiation; and so well agrees with Christ, who is the propitiation for sin, and has made atonement for it. Bishop Patrick observes, that the ancient Hebrew doctors, by dividing the first word \"eschol\", found out the mystery of the Messiah; considering it as if thus read,  , \"my beloved is unto me the man that propitiates\" or \"expiates all things\"; that is, all sins and transgressions: in the Talmud (c) it is explained, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"he, whose all things are, has atoned for my iniquity;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "which Christ has done for his church and people; and which makes him precious, and is matter of joy and gladness to them, Romans 5:11, 1 John 2:2. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "which Christ has done for his church and people; and which makes him precious, and is matter of joy and gladness to them, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 5:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 John 2:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(o) Nat. Hist. l. 5. c. 17. (p) Antiqu. l. 9. c. 1. s. 2.((q) Justin. e Trogo, l. 36. c. 3. Plin. Nat. Hist. l. 12. c. 25. Vid. Foliot in loc. (r) Plin. Nat. Hist. l. 12. c. 29. (s) Virgil. Eclog. 2. v. 18. Ovid. Metamorph. l. 13. Fab. 8. (t) De Bello Jud. l. 4. c. 8. s. 3.((u) Sheviith, c. 7. s. 6. (w) Maimon. & Bartenora in ibid. (x) Travels, p. 113, 114. edit. 2.((y) Nat. Hist. l. 14. c. 1.((z) Misnah Sotah, c. 9. s. 9. (a) T. Bab. Temurah, fol. 15. 2. Jarchi, & Ez Chaysim in Sotah ibid. (b) \"copher\", Pagninus, Montanus, Cocceius, Marckius. (c) T. Bab. Sabbat, fol. 88. 2.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(o) Nat. Hist. l. 5. c. 17. (p) Antiqu. l. 9. c. 1. s. 2.((q) Justin. e Trogo, l. 36. c. 3. Plin. Nat. Hist. l. 12. c. 25. Vid. Foliot in loc. (r) Plin. Nat. Hist. l. 12. c. 29. (s) Virgil. Eclog. 2. v. 18. Ovid. Metamorph. l. 13. Fab. 8. (t) De Bello Jud. l. 4. c. 8. s. 3.((u) Sheviith, c. 7. s. 6. (w) Maimon. & Bartenora in ibid. (x) Travels, p. 113, 114. edit. 2.((y) Nat. Hist. l. 14. c. 1.((z) Misnah Sotah, c. 9. s. 9. (a) T. Bab. Temurah, fol. 15. 2. Jarchi, & Ez Chaysim in Sotah ibid. (b) \"copher\", Pagninus, Montanus, Cocceius, Marckius. (c) T. Bab. Sabbat, fol. 88. 2.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "My beloved is unto me as a cluster of camphire in the vineyards of Engedi.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "camphire",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] R.V. ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "henna-flowers",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Lawsonia inermis",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or henna plant, from which Eastern women get the reddish yellow colour with which they stain their hands and feet (Tristram, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "op. cit",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". p. 340). It has a strongly perfumed flower which takes the form of yellowish white clusters. It is found to-day in Palestine ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "only",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " at En-gedi.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the vineyards of En-gedi",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Martineau seems to take these words as an indication that the lover had his vineyards there, but this is highly improbable. En-gedi means ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the fountain of the kid",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and the place still retains the name Ain Jidy. To this day the rocks and precipices above and about the well are frequented by wild goats. “The plain of En-gedi,” says Dr Porter in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Murray’s Guide",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “is a rich plain about half a mile square, sloping very gently from the declivity of the mountains to the shore of the Dead Sea, and is shut in on the North by the cliffs of Wady Sudeir, which are the highest along the whole Western coast. About one mile up the mountain side, and at an elevation of some 400 feet above the plain, is the fountain from which the place gets its name. The water is pure and sweet though the temperature is as high as 81 degrees Fahr. The plain is very fertile, and anciently its vineyards, and palm groves, and balsam plants were celebrated, but now none of these are to be seen there.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Song of Solomon 1:14",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13 A bundle of myrrh is my beloved to me,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "     Which lieth between by breasts.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "14 A bunch of cypress-flowers is my beloved to me,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "     From the vine-gardens of Engedi.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Most interpreters, ignoring the lessons of botany, explain Sol 1:13 of a little bunch of myrrh; but whence could Shulamith obtain this? Myrrh, מר (מרר, to move oneself in a horizontal direction hither and thither, or gradually to advance; of a fluid, to flow over the plain), ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Vid., Schlotmann in the Stud. u. Krit. (1867), p. 217.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "belongs, like the frankincense, to the amyrids, which are also exotics ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: They came from Arabia and India; the better Arabian was adulterated with Indian myrrh.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "in Palestine; and that which is aromatic in the Balsamodendron myrrha are the leaves and flowers, but the resin (Gummi myrrhae, or merely myrrha) cannot be tied in a bunch. Thus the myrrh here can be understood in no other way than as at Sol 5:5; in general צרור, according to Hitzig's correct remark, properly denotes not what one binds up together, but what one ties up - thus sacculus, a little bag. It is not supposed that she carried such a little bag with her (cf. Isaiah 3:20), or a box of frankincense (Luth. musk-apple); but she compares her beloved to a myrrh-repository, which day and night departs not from her bosom, and penetrates her inwardly with its heart-strengthening aroma. So constantly does she think of him, and so delightful is it for her to dare to think of him as her beloved.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "in Palestine; and that which is aromatic in the Balsamodendron myrrha are the leaves and flowers, but the resin (Gummi myrrhae, or merely myrrha) cannot be tied in a bunch. Thus the myrrh here can be understood in no other way than as at Sol 5:5; in general צרור, according to Hitzig's correct remark, properly denotes not what one binds up together, but what one ties up - thus sacculus, a little bag. It is not supposed that she carried such a little bag with her (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 3:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), or a box of frankincense (Luth. musk-apple); but she compares her beloved to a myrrh-repository, which day and night departs not from her bosom, and penetrates her inwardly with its heart-strengthening aroma. So constantly does she think of him, and so delightful is it for her to dare to think of him as her beloved.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The 14th verse presents the same thought. כּפר is the cypress-cluster or the cypress-flowers, κύπρος (according to Frst, from כפר  equals  עפר, to be whitish, from the colour of the yellow-white flowers), which botanists call Lawsonia, and in the East Alḥennā; its leaves yield the orange colour with which the Moslem women stain ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Vid., the literature of this subject in Defrmery's notice of Dozy-Engelmann's work in the Revue Critique, III 2 (1868), p. 408.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "their hands and feet. אשׁכּל (from שׁכל, to interweave) denotes that which is woven, tresses, or a cluster or garland of their flowers. Here also we have not to suppose that Shulamith carried a bunch of flowers; in her imagination she places herself in the vine-gardens which Solomon had planted on the hill-terraces of Engedi lying on the west of the Dead Sea (Ecclesiastes 2:4), and chooses a cluster of flowers of the cypress growing in that tropical climate, and says that her beloved is to her internally what such a cluster of cypress-flowers would be to her externally. To be able to call him her beloved is her ornament; and to think of him refreshes her like the most fragrant flowers. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "their hands and feet. אשׁכּל (from שׁכל, to interweave) denotes that which is woven, tresses, or a cluster or garland of their flowers. Here also we have not to suppose that Shulamith carried a bunch of flowers; in her imagination she places herself in the vine-gardens which Solomon had planted on the hill-terraces of Engedi lying on the west of the Dead Sea (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ecclesiastes 2:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and chooses a cluster of flowers of the cypress growing in that tropical climate, and says that her beloved is to her internally what such a cluster of cypress-flowers would be to her externally. To be able to call him her beloved is her ornament; and to think of him refreshes her like the most fragrant flowers. ",
            "children": []
          }
        ]
      }
    ]
  }
]