[{"num":16,"verse":"¶ Again the word of the LORD came unto me, saying,"},{"num":2,"verse":"Son of man, notify Jerusalem of her abominations"},{"num":3,"verse":"and say, Thus hath the Lord GOD said concerning Jerusalem: Thy habitation and thy race was of the land of Canaan; thy father was an Amorite and thy mother a Hittite."},{"num":4,"verse":"And as for thy nativity, in the day thou wast born thy navel was not cut, neither wast thou washed in water to supple thee; thou wast not salted at all, nor swaddled at all."},{"num":5,"verse":"No eye pitied thee, to do any of these unto thee, to have mercy upon thee; but thou wast cast out in the open field with little value given to thy life, in the day that thou wast born."},{"num":6,"verse":"¶ I passed by thee and saw thee polluted in thine own blood, and I said unto thee, In thy blood thou shalt live; yea, I said unto thee, In thy blood thou shalt live."},{"num":7,"verse":"In ten thousands, as the grass of the field, have I placed thee, and thou wast increased and made great, and thou art come to be adorned with excellent ornaments; thy breasts were fashioned, and thy hair is grown; but thou wast naked and bare."},{"num":8,"verse":"And I passed by thee and looked upon thee; behold, thy time was the time of love; and I spread my mantle over thee and covered thy shame; and I gave thee an oath and entered into a covenant with thee, said the Lord GOD, and thou becamest mine;"},{"num":9,"verse":"and I washed thee with water and washed away thy blood from upon thee, and I anointed thee with oil."},{"num":10,"verse":"I clothed thee also with broidered work and shod thee with badgers’ skin, and I girded thee about with fine linen, and I clothed thee with silk."},{"num":11,"verse":"I decked thee also with ornaments, and I put bracelets upon thy arms and a chain on thy neck."},{"num":12,"verse":"And I put nose rings upon thy nostrils and earrings in thine ears and a diadem of beauty upon thine head."},{"num":13,"verse":"Thus wast thou decked with gold and silver; and thy raiment was of fine linen and silk and broidered work; thou didst eat fine flour of wheat and honey and oil: and thou wast made exceeding beautiful, and thou hast prospered even until thou hast reigned."},{"num":14,"verse":"And thy renown went forth among the Gentiles for thy beauty; for it was perfect because of my beauty which I placed upon thee, said the Lord GOD."},{"num":15,"verse":"¶ But thou didst trust in thine own beauty and didst play the harlot because of thy renown and didst pour out thy fornications on every one that passed by; thou wert his."},{"num":16,"verse":"And of thy garments thou didst take and make altars of divers colours and play the harlot thereupon; the like shall not come again, neither shall it be so."},{"num":17,"verse":"Thou hast taken likewise the vessels of thy beauty of my gold and of my silver, which I had given thee and made to thyself images of men and didst commit whoredom with them"},{"num":18,"verse":"And thou didst take thy garments of many colours and cover them; and thou hast set my oil and my incense before them."},{"num":19,"verse":"My bread also which I had given thee; the fine flour and the oil and the honey with which I fed thee, thou hast even set it before them for a sweet savour; and thus it was, said the Lord GOD."},{"num":20,"verse":"Moreover thou hast taken thy sons and thy daughters, whom thou hast borne unto me, and these thou hast sacrificed unto them to be devoured. Is this of thy whoredoms a small matter,"},{"num":21,"verse":"that thou hast sacrificed my children and given them over to them that they might cause them to pass through the fire unto them?"},{"num":22,"verse":"And in all thine abominations and thy whoredoms hast thou not remembered the days of thy youth when thou wast naked and bare? Thou wast polluted in thy blood."},{"num":23,"verse":"And it came to pass after all thy wickedness (woe, woe unto thee! said the Lord GOD)"},{"num":24,"verse":"that thou hast also built unto thee a high place and hast made thee an altar in every street."},{"num":25,"verse":"Thou hast built thy altar at every head of every way and hast made thy beauty abominable and hast opened thy thighs to every one that passed by and multiplied thy whoredoms."},{"num":26,"verse":"Thou hast also committed fornication with the sons of Egypt, thy neighbours, great of flesh, and hast increased thy whoredoms, to provoke me to anger."},{"num":27,"verse":"Behold, therefore I have stretched out my hand over thee and have diminished thy liberty and delivered thee unto the will of those that hate thee, the daughters of the Philistines, who are ashamed of thy lewd way."},{"num":28,"verse":"Thou hast played the whore also with the sons of Assyria because thou wast insatiable; thou hast played the harlot with them and yet could not be satisfied."},{"num":29,"verse":"Thou hast likewise multiplied thy fornication in the land of Canaan and of the Chaldeans, and yet thou wast not satisfied with this."},{"num":30,"verse":"How inconsistent is thy heart, said the Lord GOD, having done all these things, the work of a powerful harlot:"},{"num":31,"verse":"building thine altars at the head of every way and making thine altars in every street! And thou hast not been as a harlot in that thou scornest hire,"},{"num":32,"verse":"but as a wife that commits adultery, who takes strangers instead of her husband!"},{"num":33,"verse":"They give gifts to all whores, but thou givest thy gifts to all thy lovers and givest them offerings that they may come unto thee on every side for thy whoredom."},{"num":34,"verse":"And in thee it is to the contrary from other women in thy whoredoms; and after thee, there shall never be whoredom like unto thine because in giving thy gifts when gifts are not given unto thee, it has been backwards."},{"num":35,"verse":"¶ Therefore, O harlot, hear the word of the LORD:"},{"num":36,"verse":"Thus hath the Lord GOD said: Because thy nakedness has been uncovered, and thy confusion has been manifested to thy lovers in thy whoredoms and to the idols of thy abominations and in the blood of thy children which thou didst give unto them;"},{"num":37,"verse":"therefore, behold that I will gather all thy lovers, with whom thou hast taken pleasure and all those that thou hast loved, with all those that thou hast hated; I will even gather them round about against thee and will uncover thy nakedness unto them, that they may see all thy nakedness."},{"num":38,"verse":"And I will judge thee by the laws regarding women who commit adultery and those that shed blood; and I will give thee away in blood of fury and of jealousy."},{"num":39,"verse":"And I will deliver thee into their hand, and they shall destroy thy high place and shall break down thy altars; they shall strip thee also of thy clothes and shall take the vessels of thy glory and shall leave thee naked and bare."},{"num":40,"verse":"They shall also bring up a company against thee, and they shall stone thee with stones and thrust thee through with their swords."},{"num":41,"verse":"And they shall burn thine houses with fire and execute judgments upon thee in the sight of many women; and I will cause thee to cease from playing the harlot, and thou also shalt give no hire any more."},{"num":42,"verse":"So will I make my fury toward thee to rest, and my jealousy shall depart from thee, and I will be quiet and will no longer be angry."},{"num":43,"verse":"Because thou hast not remembered the days of thy youth but hast provoked me to anger in all this; therefore, behold I also have recompensed thy way upon thine head, said the Lord GOD; for thou hast not even thought regarding all thine abominations."},{"num":44,"verse":"¶ Behold, every one that makes proverbs shall make this proverb regarding thee, saying: As is the mother so is her daughter."},{"num":45,"verse":"Thou art thy mother’s daughter that discarded her husband and her children; and thou art the sister of thy sisters who discarded their husbands and their children: your mother was a Hittite, and your father an Amorite."},{"num":46,"verse":"And thine elder sister is Samaria with her daughters that dwell at thy left hand; and thy younger sister that dwells at thy right hand is Sodom with her daughters."},{"num":47,"verse":"Yet thou hast not walked after their ways, nor done after their abominations; but, as if that were a very little thing, thou wast corrupted more than they in all thy ways."},{"num":48,"verse":"As I live, said the Lord GOD, Sodom thy sister has never done, she nor her daughters, as thou hast done, thou and thy daughters."},{"num":49,"verse":"Behold, this was the iniquity of thy sister Sodom: pride, fullness of bread, and abundance of idleness was in her and in her daughters, neither did she strengthen the hand of the afflicted and needy."},{"num":50,"verse":"And they filled themselves with arrogance and committed abomination before me, and when I saw it, I took them away."},{"num":51,"verse":"Neither has Samaria committed half of thy sins, but thou hast multiplied thy abominations more than they and hast justified thy sisters with all thy abominations which thou hast done."},{"num":52,"verse":"Thou also, who hast judged thy sisters, bear thine own shame for thy sins that thou hast committed more abominable than they; they are more righteous than thou; be thou confounded also and bear thy shame in that thou hast justified thy sisters."},{"num":53,"verse":"When I shall turn their captivity, the captivity of Sodom and her daughters and the captivity of Samaria and her daughters, then I will release the captivity of thy captives in the midst of them:"},{"num":54,"verse":"that thou may bear thine own shame and may be confounded in all that thou hast done, in that thou art a comfort unto them."},{"num":55,"verse":"When thy sisters, Sodom and her daughters shall return to their first state, and Samaria and her daughters shall return to their first state, thou and thy daughters shall return to your first state."},{"num":56,"verse":"Sodom, thy sister was not mentioned by thy mouth in the time of thy pride,"},{"num":57,"verse":"before thy wickedness discovered itself, as at the time of the reproach of the daughters of Syria and of all the daughters of the Philistines round about, who despise thee in everything."},{"num":58,"verse":"Thou hast borne thy lewdness and thine abominations, said the LORD."},{"num":59,"verse":"For thus hath the Lord GOD said: Will I deal with thee even as thou hast done, despising the oath to invalidate the covenant?"},{"num":60,"verse":"¶ Nevertheless I will remember my covenant that I made with thee in the days of thy youth, and I will confirm unto thee an everlasting covenant."},{"num":61,"verse":"Then thou shalt remember thy ways, and be ashamed, when thou shalt receive thy sisters, thine elder and thy younger: and I will give them unto thee for daughters, but not by thy covenant."},{"num":62,"verse":"And I will confirm my covenant with thee; and thou shalt know that I am the LORD:"},{"num":63,"verse":"that thou may remember, and be confounded, and never open thy mouth any more because of thy shame, when I am pacified toward thee for all that thou hast done, said the Lord GOD."}]