[{"header":"Chapter 16"},{"num":1,"verse":"A Parable of Infidelity. The word of the Lord came to me: "},{"num":2,"verse":"Son of man, make known to Jerusalem her abominations. "},{"num":3,"verse":"You shall say, Thus says the Lord God to Jerusalem: By origin and birth you belong to the land of the Canaanites; your father was an Amorite, your mother a Hittite. "},{"num":4,"verse":"As for your birth, on the day you were born your navel cord was not cut; you were not washed with water or anointed; you were not rubbed with salt or wrapped in swaddling clothes. "},{"num":5,"verse":"No eye looked on you with pity or compassion to do any of these things for you. Rather, on the day you were born you were left out in the field, rejected."},{"num":6,"verse":"Then I passed by and saw you struggling in your blood, and I said to you in your blood, “Live!” "},{"num":7,"verse":"I helped you grow up like a field plant, so that you grew, maturing into a woman with breasts developed and hair grown; but still you were stark naked. "},{"num":8,"verse":"I passed by you again and saw that you were now old enough for love. So I spread the corner of my cloak over you to cover your nakedness; I swore an oath to you and entered into covenant with you—oracle of the Lord God—and you became mine. "},{"num":9,"verse":"Then I bathed you with water, washed away your blood, and anointed you with oil. "},{"num":10,"verse":"I clothed you with an embroidered gown, put leather sandals on your feet; I gave you a fine linen sash and silk robes to wear. "},{"num":11,"verse":"I adorned you with jewelry, putting bracelets on your arms, a necklace about your neck, "},{"num":12,"verse":"a ring in your nose, earrings in your ears, and a beautiful crown on your head. "},{"num":13,"verse":"Thus you were adorned with gold and silver; your garments made of fine linen, silk, and embroidered cloth. Fine flour, honey, and olive oil were your food. You were very, very beautiful, fit for royalty. "},{"num":14,"verse":"You were renowned among the nations for your beauty, perfected by the splendor I showered on you—oracle of the Lord God."},{"num":15,"verse":"But you trusted in your own beauty and used your renown to serve as a prostitute. You poured out your prostitution on every passerby—let it be his. "},{"num":16,"verse":"You took some of your garments and made for yourself gaudy high places, where you served as a prostitute. It has never happened before, nor will it happen again! "},{"num":17,"verse":"You took the splendid gold and silver ornaments that I had given you and made for yourself male images and served as a prostitute with them. "},{"num":18,"verse":"You took your embroidered garments to cover them; my oil and my incense you set before them; "},{"num":19,"verse":"the food I had given you, the fine flour, the oil, and the honey with which I fed you, you set before them as a pleasant odor, says the Lord God. "},{"num":20,"verse":"The sons and daughters you bore for me you took and offered as sacrifices for them to devour! Was it not enough that you had become a prostitute? "},{"num":21,"verse":"You slaughtered and immolated my children to them, making them pass through fire. "},{"num":22,"verse":"In all your abominations and prostitutions you did not remember the days of your youth when you were stark naked, struggling in your blood."},{"num":23,"verse":"Then after all your evildoing—woe, woe to you! oracle of the Lord God— "},{"num":24,"verse":"you built yourself a platform and raised up a dais in every public place. "},{"num":25,"verse":"At every intersection you built yourself a dais so that you could degrade your beauty by spreading your legs for every passerby, multiplying your prostitutions. "},{"num":26,"verse":"You served as a prostitute with the Egyptians, your big-membered neighbors, and multiplied your prostitutions to provoke me. "},{"num":27,"verse":"Therefore I stretched out my hand against you and reduced your allotment, and delivered you over to the whim of your enemies, the Philistines, who were revolted by your depraved conduct. "},{"num":28,"verse":"You also served as a prostitute for the Assyrians, because you were not satisfied. Even after serving as a prostitute for them, you were still not satisfied. "},{"num":29,"verse":"You increased your prostitutions again, now going to Chaldea, the land of traders; but despite this, you were still not satisfied."},{"num":30,"verse":"How wild your lust!—oracle of the Lord God—that you did all these works of a shameless prostitute, "},{"num":31,"verse":"when you built your platform at every intersection and set up your high place in every public square. But unlike a prostitute, you disdained payment. "},{"num":32,"verse":"Adulterous wife, taking strangers in place of her husband! "},{"num":33,"verse":"Prostitutes usually receive gifts. But you bestowed gifts on all your lovers, bribing them to come to you for prostitution from every side. "},{"num":34,"verse":"Thus in your prostitution you were different from any other woman. No one solicited you for prostitution. Instead, you yourself offered payment; what a reversal!"},{"num":35,"verse":"Therefore, prostitute, hear the word of the Lord! "},{"num":36,"verse":"Thus says the Lord God: Because you poured out your lust and exposed your nakedness in your prostitution with your lovers and your abominable idols, because you gave the life-blood of your children to them, "},{"num":37,"verse":"therefore, I will now gather together all your lovers with whom you found pleasure, both those you loved and those you hated; I will gather them against you from all sides and expose you naked for them to see. "},{"num":38,"verse":"I will inflict on you the sentence of adultery and murder; I will bring on you bloody wrath and jealous anger. "},{"num":39,"verse":"I will hand you over to them to tear down your platform and demolish your high place, to strip you of your garments and take away your splendid ornaments, leaving you stark naked. "},{"num":40,"verse":"They shall lead an assembly against you to stone you and hack you to pieces with their swords. "},{"num":41,"verse":"They shall set fire to your homes and inflict punishments on you while many women watch. Thus I will put an end to your prostitution, and you shall never again offer payment. "},{"num":42,"verse":"When I have spent my fury upon you I will stop being jealous about you, and calm down, no longer angry. "},{"num":43,"verse":"Because you did not remember the days of your youth but enraged me with all these things, see, I am bringing down your ways upon your head—oracle of the Lord God. Have you not added depravity to your other abominations?"},{"num":44,"verse":"See, everyone who makes proverbs will make this proverb about you, “Like mother, like daughter.” "},{"num":45,"verse":"Yes, you are truly the daughter of your mother who rejected her husband and children: you are truly a sister to your sisters who rejected their husbands and children—your mother was a Hittite and your father an Amorite. "},{"num":46,"verse":"Your elder sister was Samaria with her daughters to the north of you; and your younger sister was Sodom and her daughters, south of you. "},{"num":47,"verse":"Not only did you walk in their ways and act as abominably as they did, but in a very short time you became more corrupt in all your ways than they were. "},{"num":48,"verse":"As I live—oracle of the Lord God—I swear that your sister Sodom with her daughters have not done the things you and your daughters have done! "},{"num":49,"verse":"Now look at the guilt of your sister Sodom: she and her daughters were proud, sated with food, complacent in prosperity. They did not give any help to the poor and needy. "},{"num":50,"verse":"Instead, they became arrogant and committed abominations before me; then, as you have seen, I removed them. "},{"num":51,"verse":"Samaria did not commit half the sins you did. You have done more abominable things than they did. You even made your sisters look righteous, with all the abominations you have done. "},{"num":52,"verse":"You, then, must bear your disgrace, for you have made a case for your sisters! Because your sins are more abominable than theirs, they seem righteous compared to you. Blush for shame, and bear the disgrace of having made your sisters appear righteous."},{"num":53,"verse":"I will restore their fortunes, the fortunes of Sodom and her daughters, the fortunes of Samaria and her daughters—and your fortunes along with them. "},{"num":54,"verse":"Thus you must bear your disgrace and be ashamed of all you have done to bring them comfort. "},{"num":55,"verse":"Yes, your sisters, Sodom and her daughters, Samaria and her daughters, shall return to the way they were, and you and your daughters shall return to the way you were. "},{"num":56,"verse":"Did you not hold your sister Sodom in bad repute while you felt proud of yourself, "},{"num":57,"verse":"before your evil was exposed? Now you are like her, reproached by the Arameans and all their neighbors, despised on all sides by the Philistines. "},{"num":58,"verse":"The penalty of your depravity and your abominations—you must bear it all—oracle of the Lord."},{"num":59,"verse":"For thus says the Lord God: I will deal with you for what you did; you despised an oath by breaking a covenant. "},{"num":60,"verse":"But I will remember the covenant I made with you when you were young; I will set up an everlasting covenant with you. "},{"num":61,"verse":"Then you shall remember your ways and be ashamed when you receive your sisters, those older and younger than you; I give them to you as daughters, but not by reason of your covenant. "},{"num":62,"verse":"For I will re-establish my covenant with you, that you may know that I am the Lord, "},{"num":63,"verse":"that you may remember and be ashamed, and never again open your mouth because of your disgrace, when I pardon you for all you have done—oracle of the Lord God."}]