[{"header":"Jerusalem—Not Faithful"},{"num":16,"verse":"The Word of the Lord came to me, saying, "},{"num":2,"verse":"“Son of man, make known to Jerusalem her hated sins. "},{"num":3,"verse":"Tell them, ‘This is what the Lord God says to Jerusalem: “Your beginning and your birth are from the land of the Canaanite. Your father was an Amorite and your mother was a Hittite. "},{"num":4,"verse":"On the day you were born the cord between you and your mother was not cut. You were not washed with water to make you clean. You were not rubbed with salt or even covered with cloth. "},{"num":5,"verse":"No one looked with pity on you or did any of these things for you out of loving-kindness. Instead you were thrown out into the open field, for you were hated on the day you were born."},{"num":6,"verse":"“When I passed by you and saw you rolling about in your blood, I said to you in your blood, ‘Live!’ Yes, I said to you while you were in your blood, ‘Live!’ "},{"num":7,"verse":"I made you become many, like plants of the field. Then you grew up and became tall. You grew into a beautiful woman. You had breasts and your hair had grown. Yet you were not covered and your body could be seen. "},{"num":8,"verse":"Then I passed by you and saw that you were old enough for love. So I spread my clothing over you and covered your body. I gave you my promise and made an agreement with you so that you became Mine,” says the Lord God. "},{"num":9,"verse":"“Then I washed you with water, washed the blood from you, and poured oil on you. "},{"num":10,"verse":"I dressed you with beautiful cloth, and put leather shoes on your feet. I dressed you with fine linen and covered you with silk. "},{"num":11,"verse":"I put on you objects of beauty. I put beautiful objects on your arms and around your neck. "},{"num":12,"verse":"I put rings in your nose and in your ears, and a beautiful crown on your head. "},{"num":13,"verse":"So you were dressed with gold and silver. Your clothing was of fine linen, silk, and beautiful cloth. You ate fine flour, honey, and oil. So you were very beautiful, and you became a queen. "},{"num":14,"verse":"Your name became known among the nations because of your beauty. For it was perfect because of My shining-greatness which I had given to you,” says the Lord God."},{"num":15,"verse":"“But you trusted in your beauty. Because your name was well-known, you acted like a woman who sells the use of her body. And you did sex sins with anyone who passed by. "},{"num":16,"verse":"You took some of your clothes of many colors and made for yourself places of worship. There you acted like a woman who sells the use of her body. Such things should never happen or come to pass. "},{"num":17,"verse":"You also took your objects of beauty made of My gold and silver, which I had given you. And you used them to make things that looked like men, that you might play with them as a woman who sells the use of her body. "},{"num":18,"verse":"Then you took your beautiful cloth and covered them, and set My oil and My special perfume in front of them. "},{"num":19,"verse":"You also set in front of them My bread which I gave you, the fine flour, oil and honey I gave you to eat. You gave it all to them as a special perfume. So it was,” says the Lord God. "},{"num":20,"verse":"“You even took your sons and daughters whom you had given birth for Me, and gave them to the false gods to be destroyed. Were your sex sins too little? "},{"num":21,"verse":"You killed My children and gave them as burnt gifts to false gods. "},{"num":22,"verse":"And in all your hated acts and sex sins you did not remember the days when you were young. You did not remember when you were without clothing or covering, and when you rolled about in your blood."},{"num":23,"verse":"“It is bad for you!” says the Lord God. “After all your sinful acts, "},{"num":24,"verse":"you built a place of worship for yourself, and a high place in every street. "},{"num":25,"verse":"You built yourself a high place at the beginning of every street and made your beauty a hated thing. You gave yourself to anyone who passed by, to make your sex sins many. "},{"num":26,"verse":"You also gave the use of your body to the Egyptians, your neighbors who have much desire for sex sins. And you sinned many times to make Me angry. "},{"num":27,"verse":"So I have raised My hand to punish you and have made your share smaller. I have given you over to the desire of those who hate you, the daughters of the Philistines, who were ashamed of your sinful actions. "},{"num":28,"verse":"You also gave the use of your body to the Assyrians because you had not had enough. Yes, you even gave the use of your body to them and still thought you had not had enough. "},{"num":29,"verse":"You did many sex sins with Babylon, the land of those who trade. Yet even this was not enough for you."},{"num":30,"verse":"“How sinful your heart is,” says the Lord God, “that you do all these things, the actions of a sinful woman, and show no shame. "},{"num":31,"verse":"You built your places of worship at the beginning of every street and made your high place at every crossing. But you were not like a woman who sells the use of her body, because you did not want pay. "},{"num":32,"verse":"You are like a wife who is not faithful and has strangers instead of her husband! "},{"num":33,"verse":"Men give gifts to all women who sell the use of their body. But you give your gifts to all your lovers. You pay them to come to you from everywhere for your sex sins. "},{"num":34,"verse":"You are different from other women in your sex sins. You go after men; they do not come to you. You pay men instead of them giving pay to you. Yes, you are different.”"},{"header":"God Judges Jerusalem"},{"num":35,"verse":"So, sinful woman, hear the Word of the Lord. "},{"num":36,"verse":"The Lord God says, “Your shame was poured out and your clothing was taken off because of your sex sins with your lovers and with all your hated false gods. And you killed your children and gave them to false gods. Because of these things, "},{"num":37,"verse":"I will gather all your lovers who pleased you. I will gather all those whom you loved and all those whom you hated. I will gather them against you from every side, and take off your covering so that they may see all your shame. "},{"num":38,"verse":"I will punish you as I punish women who are not faithful in marriage, or women who kill. I will do it in My anger and jealousy. "},{"num":39,"verse":"And I will give you over to your lovers. They will tear down your places of worship and destroy your high places. They will take all of your clothes and your beautiful objects, and will leave you without any covering. "},{"num":40,"verse":"They will bring up a group of people against you, and they will kill you with stones and cut you to pieces with their swords. "},{"num":41,"verse":"They will burn your houses with fire and punish you as many women watch. Then I will stop you from acting like a woman who sells the use of her body, and you will no longer pay your lovers. "},{"num":42,"verse":"Then I will take away My anger from you, and My jealousy will leave you. I will be at peace, and will not be angry any more. "},{"num":43,"verse":"You have not remembered the days when you were young, but have made Me angry with all these things. So I will punish you for what you have done,” says the Lord God. “Did you not add these sex sins to all your other hated sins?"},{"header":"More Sinful Than Samaria and Sodom"},{"num":44,"verse":"“Every one who uses sayings will use this saying about you: ‘Like mother, like daughter.’ "},{"num":45,"verse":"You are the daughter of your mother, who hated her husband and her children. You are also a sister of your sisters who hated their husbands and children. Your mother was a Hittite and your father was an Amorite. "},{"num":46,"verse":"Your older sister is Samaria, who lives north of you with her daughters. And your younger sister is Sodom, who lives south of you with her daughters. "},{"num":47,"verse":"Yet you have walked in their ways and done their hated acts. As if that were too little, you acted worse in all your ways than they. "},{"num":48,"verse":"As I live,” says the Lord God, “your sister Sodom and her daughters have not done as you and your daughters have done. "},{"num":49,"verse":"Now this was the sin of your sister Sodom: She and her daughters had pride, much food, and too much rest, but she did not help those who were poor and in need. "},{"num":50,"verse":"They were proud and did hated sins in front of Me. So I took them away when I saw it. "},{"num":51,"verse":"Samaria has not done half of your sins. You have done more sins than they. So you have made your sisters look right and good by all the hated sins which you have done. "},{"num":52,"verse":"Take your shame upon you, for you have made Me show favor to them in their punishment. Because of your sins in which you acted worse than they, they are more in the right than you. So then be ashamed and take your shame upon you, for you have made your sisters look right and good."},{"num":53,"verse":"“I will return them to their land, both Sodom and her daughters, and Samaria and her daughters. With them I will return you to your land. "},{"num":54,"verse":"This is so you will take your shame upon you, and feel ashamed for all that you have done in becoming a comfort to them. "},{"num":55,"verse":"Your sisters, Sodom with her daughters and Samaria with her daughters, will return to the land they had before. And you with your daughters will return to your land also. "},{"num":56,"verse":"You did not speak against your sister Sodom in the days of your pride, "},{"num":57,"verse":"before your sinful acts were seen. Now you have become like her, an object of shame for the daughters of Edom and all her neighbors, and for the daughters of the Philistines. All those around you who hate you now look on you with shame. "},{"num":58,"verse":"The penalty of your sex sins and other hated sins has come upon you,” says the Lord. "},{"num":59,"verse":"For the Lord God says, “I will do with you as you have done, because you have hated your promise by breaking the agreement."},{"header":"An Agreement That Lasts Forever"},{"num":60,"verse":"“But I will remember My agreement which I made with you when you were young. And I will make an agreement with you that lasts forever. "},{"num":61,"verse":"Then you will remember your ways and be ashamed when you receive your sisters, both your older one and younger one. I will give them to you as daughters, but not because of your agreement with Me. "},{"num":62,"verse":"So I will make My agreement with you, and you will know that I am the Lord. "},{"num":63,"verse":"Then you will remember and be ashamed. You will never open your mouth again because of your shame, when I have forgiven you for all that you have done,” says the Lord God."}]