[{"num":103,"verse":"1 He provoketh all to praise the Lord, which hath pardoned his sins, delivered him from destruction and given him sufficient of all good things. 10 Then he addeth the tender mercies of God, which he showeth like a most tender Father toward his children. 14 The frailty of man’s life. 20 An exhortation to man and Angels to praise the Lord."},{"num":1,"verse":"My soul, praise thou the Lord, and all that is within me, praise his holy Name."},{"num":2,"verse":"My soul, praise thou the Lord, and forget not all his benefits."},{"num":3,"verse":"Which forgiveth all thine iniquity, and healeth all thine infirmities."},{"num":4,"verse":"Which redeemeth thy life from the grave; and crowneth thee with mercy and compassions."},{"num":5,"verse":"Which satisfieth thy mouth with good things: and thy youth is renewed like the eagle’s."},{"num":6,"verse":"The Lord executeth righteousness and judgment to all that are oppressed."},{"num":7,"verse":"He made his ways known unto Moses, and his works unto the children of Israel."},{"num":8,"verse":"The Lord is full of compassion and mercy, slow to anger and of great kindness."},{"num":9,"verse":"He will not always chide, neither keep his anger forever."},{"num":10,"verse":"He hath not dealt with us after our sins, nor rewarded us according to our iniquities."},{"num":11,"verse":"For as high as the heaven is above the earth, so great is his mercy toward them that fear him."},{"num":12,"verse":"As far as the East is from the West: so far hath he removed our sins from us."},{"num":13,"verse":"As a father hath compassion on his children, so hath the Lord compassion on them that fear him."},{"num":14,"verse":"For he knoweth whereof we be made: he remembereth that we are but dust."},{"num":15,"verse":"The days of man are as grass: as a flower of the field, so flourisheth he."},{"num":16,"verse":"For the wind goeth over it, and it is gone, and the place thereof shall know it no more."},{"num":17,"verse":"But the loving kindness of the Lord endureth forever and ever upon them that fear him, and his righteousness upon children’s children,"},{"num":18,"verse":"Unto them that keep his covenant, and think upon his commandments to do them."},{"num":19,"verse":"The Lord hath prepared his throne in heaven, and his kingdom ruleth over all."},{"num":20,"verse":"Praise the Lord, ye his Angels, that excel in strength, that do his commandment in obeying the voice of his word."},{"num":21,"verse":"Praise the Lord all ye his hosts, ye his servants that do his pleasure."},{"num":22,"verse":"Praise the Lord all ye his works, in all places of his dominion: my soul, praise thou the Lord."}]