[{"header":"Solomon meets God a third time"},{"num":11,"verse":"In addition to Pharaoh’s daughter, King Solomon loved many foreign women, including Moabites, Ammonites, Edomites, Sidonians, and Hittites."},{"num":2,"verse":"These came from the nations that the Lord had commanded the Israelites about: “Don’t intermarry with them. They will definitely turn your heart toward their gods.” Solomon clung to these women in love."},{"num":3,"verse":"He had seven hundred royal wives and three hundred secondary wives. They turned his heart."},{"num":4,"verse":"As Solomon grew old, his wives turned his heart after other gods. He wasn’t committed to the Lord his God with all his heart as was his father David."},{"num":5,"verse":"Solomon followed Astarte the goddess of the Sidonians, and Milcom the detestable god of the Ammonites."},{"num":6,"verse":"Solomon did what was evil in the Lord’s eyes and wasn’t completely devoted to the Lord like his father David."},{"num":7,"verse":"On the hill east of Jerusalem, Solomon built a shrine to Chemosh the detestable god of Moab, and to Molech the detestable god of the Ammonites."},{"num":8,"verse":"He did the same for all his foreign wives, who burned incense and sacrificed to their gods."},{"num":9,"verse":"The Lord grew angry with Solomon, because his heart had turned away from being with the Lord, the God of Israel, who had appeared to him twice."},{"num":10,"verse":"The Lord had commanded Solomon about this very thing, that he shouldn’t follow other gods. But Solomon didn’t do what the Lord commanded."},{"num":11,"verse":"The Lord said to Solomon, “Because you have done all this instead of keeping my covenant and my laws that I commanded you, I will most certainly tear the kingdom from you and give it to your servant."},{"num":12,"verse":"Even so, on account of your father David, I won’t do it during your lifetime. I will tear the kingdom out of your son’s hands."},{"num":13,"verse":"Moreover, I won’t tear away the entire kingdom. I will give one tribe to your son on account of my servant David and on account of Jerusalem, which I have chosen.”"},{"header":"Solomon and Hadad"},{"num":14,"verse":"So the Lord raised up an opponent for Solomon: Hadad the Edomite from the royal line of Edom."},{"num":15,"verse":"When David was fighting against Edom, Joab the general had gone up to bury the Israelite dead, and he had killed every male in Edom."},{"num":16,"verse":"Joab and all the Israelites stayed there six months, until he had finished off every male in Edom."},{"num":17,"verse":"While still a youth, Hadad escaped to Egypt along with his father’s Edomite officials."},{"num":18,"verse":"They set out from Midian and went to Paran. They took men with them from Paran and came to Egypt and to Pharaoh its king. Pharaoh assigned him a home, food, and land."},{"num":19,"verse":"Pharaoh was so delighted with Hadad that he gave him one of his wife’s sisters for marriage, a sister of Queen Tahpenes."},{"num":20,"verse":"This sister of Tahpenes bore Hadad a son, Genubath. Tahpenes weaned him in Pharaoh’s house. So it was that Genubath was raised in Pharaoh’s house, among Pharaoh’s children."},{"num":21,"verse":"While in Egypt, Hadad heard that David had lain down with his ancestors and that Joab the general was also dead. Hadad said to Pharaoh, “Let me go to my homeland.”"},{"num":22,"verse":"Pharaoh said to him, “What do you lack here with me that would make you want to go back to your homeland?”"},{"header":"Solomon and Rezon"},{"num":23,"verse":"God raised up another opponent for Solomon: Rezon, Eliada’s son, who had escaped from Zobah’s King Hadadezer."},{"num":24,"verse":"Rezon recruited men and became leader of a band when David was killing them. They went to Damascus, stayed there, and ruled it."},{"num":25,"verse":"Throughout Solomon’s lifetime, Rezon was Israel’s opponent and added to the problems caused by Hadad. Rezon hated Israel while he ruled as king of Aram."},{"header":"Solomon and Jeroboam"},{"num":26,"verse":"Now Nebat’s son Jeroboam was an Ephraimite from Zeredah. His mother’s name was Zeruah; she was a widow. Although he was one of Solomon’s own officials, Jeroboam fought against the king."},{"num":27,"verse":"This is the story of why Jeroboam fought against the king:"},{"num":28,"verse":"Now Jeroboam was a strong and honorable man. Solomon saw how well this youth did his work. So he appointed him over all the work gang of Joseph’s house."},{"num":29,"verse":"At that time, when Jeroboam left Jerusalem, Ahijah the prophet of Shiloh met him along the way. Ahijah was wearing a new garment. The two of them were alone in the country."},{"num":30,"verse":"Ahijah tore his new garment into twelve pieces."},{"num":31,"verse":"He said to Jeroboam, “Take ten pieces, because Israel’s God, the Lord, has said, ‘Look, I am about to tear the kingdom from Solomon’s hand. I will give you ten tribes."},{"num":32,"verse":"But I will leave him one tribe on account of my servant David and on account of Jerusalem, the city I have chosen from all the tribes of Israel."},{"num":33,"verse":"I am doing this because they have abandoned me and worshipped the Sidonian goddess Astarte, the Moabite god Chemosh, and the Ammonite god Milcom. They haven’t walked in my ways by doing what is right in my eyes—keeping my laws and judgments—as Solomon’s father David did."},{"num":34,"verse":"But I won’t take the whole kingdom from his hand. I will keep him as ruler throughout his lifetime on account of my servant David, who did keep my commands and my laws."},{"num":35,"verse":"I will take the kingdom from the hand of Solomon’s son, and I will give you ten tribes."},{"num":36,"verse":"I will give his son a single tribe so that my servant David will always have a lamp before me in Jerusalem, the city that I chose for myself to place my name."},{"num":37,"verse":"But I will accept you, and you will rule over all that you could desire. You will be king of Israel."},{"num":38,"verse":"If you listen to all that I command and walk in my ways, if you do what is right in my eyes, keeping my laws and my commands just as my servant David did, then I will be with you and I will build you a lasting dynasty just as I did for David. I will give you Israel."},{"num":39,"verse":"I will humble David’s descendants by means of all this, though not forever.’”"},{"num":40,"verse":"Then Solomon tried to kill Jeroboam. But Jeroboam fled to Egypt and its king Shishak. Jeroboam remained in Egypt until Solomon died."},{"header":"Solomon’s remaining days"},{"num":41,"verse":"The rest of Solomon’s deeds, including all that he did and all his wisdom, aren’t they written in the official records of Solomon?"},{"num":42,"verse":"The amount of time Solomon ruled over all Israel in Jerusalem was forty years."},{"num":43,"verse":"Then Solomon lay down with his ancestors. He was buried in his father David’s City, and Rehoboam his son succeeded him as king."}]