[{"num":11,"verse":"And king Solomon loved many strange women besides the daughter of Pharao, and women of Moab, and of Ammon, and of Edom, and of Sidon, and of the Hethites:"},{"num":2,"verse":"Of the nations concerning which the Lord said to the children of Israel: You shall not go in unto them, neither shall any of them come in to yours: for they will most certainly turn away your heart to follow their gods. And to these was Solomon joined with a most ardent love."},{"num":3,"verse":"And he had seven hundred wives as queens, and three hundred concubines: and the women turned away his heart."},{"num":4,"verse":"And when he was now old, his heart was turned away by women to follow strange gods: and his heart was not perfect with the Lord his God, as was the heart of David his father."},{"num":5,"verse":"But Solomon worshipped Astarthe the goddess of the Sidonians, and Moloch the idol of the ammonites."},{"num":6,"verse":"And Solomon did that which was net pleasing before the Lord, and did not fully follow the Lord, as David his father."},{"num":7,"verse":"Then Solomon built a temple for Chamos the idol of Moab, on the hill that is over against Jerusalem, and for Moloch the idol of the children of Ammon."},{"num":8,"verse":"And he did in this manner for all his wives that were strangers, who burnt incense, and offered sacrifice to their gods."},{"num":9,"verse":"And the Lord was angry with Solomon, because his mind was turned away from the Lord the God of Israel, who had appeared to him twice,"},{"num":10,"verse":"And had commanded him concerning this thing, that he should not follow strange gods: but he kept not the things which the Lord commanded him."},{"num":11,"verse":"The Lord therefore said to Solomon: Because thou hast done this, and hast not kept my covenant, and my precepts, which I have commanded thee, I will divide and rend thy kingdom, and will give it to thy servant."},{"num":12,"verse":"Nevertheless in thy days I will not do it, for David thy father's sake: but I will rend it out of the hand of thy son."},{"num":13,"verse":"Neither will I take away the whole kingdom, but I will give one tribe to thy son for the sake of David my servant, and Jerusalem which I have chosen."},{"num":14,"verse":"And the Lord raised up an adversary to Solomon, Adad the Edomite of the king's seed, in Edom."},{"num":15,"verse":"For when David was in Edom, and Joab the general of the army was gone up to bury them that were slain, and had killed every male in Edom,"},{"num":16,"verse":"(For Joab remained there six months with all Israel, till he had slain every male in Edom,)"},{"num":17,"verse":"Then Adad fled, he and certain Edomites, of his father's servants with him, to go into Egypt: and Adad was then a little boy."},{"num":18,"verse":"And they arose out of Madian, and came into Pharan, and they took men with them from Pharan, and went into Egypt to Pharao the king of Egypt: who gave him a house, and appointed him victuals, and assigned him land."},{"num":19,"verse":"And Adad found great favour before Pharao, insomuch that he gave him to wife, the own sister of his wife Taphnes the queen."},{"num":20,"verse":"And the sister of Taphnes bore him his son Genubath, and Taphnes brought him up in the house of Pharao: and Genubath dwelt with Pharao among his children."},{"num":21,"verse":"And when Adad heard in Egypt that David slept with his fathers, and that Joab the general of the army was dead, he said to Pharao: Let me depart, that I may go to my own country."},{"num":22,"verse":"And Pharao said to him: Why, what is wanting to thee with me, that thou seekest to go to thy own country? But he answered: Nothing: yet I beseech thee to let me go."},{"num":23,"verse":"God also raised up against him an adversary, Razon the son of Eliada, who had fled from his master Adarezer the king of Soba:"},{"num":24,"verse":"And he gathered men against him, and he became a captain of robbers, when David slew them of Soba: and they went to Damascus, and dwelt there, and they made him king in Damascus."},{"num":25,"verse":"And he was an adversary to Israel, all the days of Solomon: and this is the evil of Adad, and his hatred against Israel, and he reigned in Syria."},{"num":26,"verse":"Jeroboam also the son of Nabat an Ephrathite of Sareda, a servant of Solomon, whose mother was named Sarua, a widow woman, lifted up his hand against the king."},{"num":27,"verse":"And this is the cause of his rebellion against him, for Solomon built Mello, and filled up the breach of the city of David his father."},{"num":28,"verse":"And Jeroboam was a valiant and mighty man: and Solomon seeing him a young man ingenious and industrious, made him chief over the tributes of all the house of Joseph."},{"num":29,"verse":"So it came to paste at that time, that Jeroboam went out of Jerusalem, and the prophet Ahias the Silonite, clad with a new garment, found him in the way: and they two were alone in the held."},{"num":30,"verse":"And Ahias taking his new garment, wherewith he was clad, divided it into twelve parts:"},{"num":31,"verse":"And he said to Jeroboam: Take to thee ten pieces: for thus saith the Lord the God of Israel: Behold I will rend the kingdom out of the hand of Solomon, and will give thee ten tribes."},{"num":32,"verse":"But one tribe shall remain to him for the sake of my servant David, and Jerusalem the city, which I have chosen out of all the tribes of Israel:"},{"num":33,"verse":"Because he hath forsaken me, and hath adored Astarthe the goddess of the Sidonians, and Chamos the god of Moab, and Moloch the god of the children of Ammon: and hath not walked in my ways, to do justice before me, and to keep my precepts, and judgments as did David his father."},{"num":34,"verse":"Yet I will not take away all the kingdom out of his hand, but I will make him prince all the days of his life, for David my servant's sake, whom I chose, who kept my commandments and my precepts."},{"num":35,"verse":"But I will take away the kingdom out of his son's hand and will give thee ten tribes:"},{"num":36,"verse":"And to his son I will give one tribe, that there may remain a lamp for my servant David before me always in Jerusalem the city which I have chosen, that my name might be there."},{"num":37,"verse":"And I will take thee, and thou shalt reign over all that thy soul desireth, and thou shalt be king over Israel."},{"num":38,"verse":"If then thou wilt hearken to all that I shall command thee, and wilt walk in my ways, and do what is right before me, keeping my commandments and my precepts, as David my servant did: I will be with thee, and will build thee up a faithful house, as I built a house for David, and I will deliver Israel to thee:"},{"num":39,"verse":"And I will for this afflict the seed of David, but yet not for ever."},{"num":40,"verse":"Solomon therefore sought to kill Jeroboam: but he arose, and fled into Egypt to Sesac the king of Egypt, and was in Egypt till the death of Solomon."},{"num":41,"verse":"And the rest of the words of Solomon, and all that he did, and his wisdom: behold they are all written in the book of the words of the days of Solomon."},{"num":42,"verse":"And the days that Solomon reigned in Jerusalem over all Israel, were forty years."},{"num":43,"verse":"And Solomon slept with his fathers, and was buried in the city of David his father, and Roboam his son reigned in his stead."}]