[{"header":"Solomon Turns from God"},{"num":11,"verse":"Now King Solomon loved many foreign women along with the daughter of Pharaoh: Moabite, Ammonite, Edomite, Sidonian, and Hittite women,"},{"num":2,"verse":"from the nations of which the Lord had said to the sons of Israel, “You shall not associate with them, nor shall they associate with you; they will certainly turn your heart away to follow their gods.” Solomon clung to these in love."},{"num":3,"verse":"He had seven hundred wives, who were princesses, and three hundred concubines; and his wives turned his heart away."},{"num":4,"verse":"For when Solomon was old, his wives turned his heart away to follow other gods; and his heart was not wholly devoted to the Lord his God, as the heart of his father David had been."},{"num":5,"verse":"For Solomon became a follower of Ashtoreth the goddess of the Sidonians, and of Milcom the abhorrent idol of the Ammonites."},{"num":6,"verse":"So Solomon did what was evil in the sight of the Lord, and did not follow the Lord fully, as his father David had done."},{"num":7,"verse":"Then Solomon built a high place for Chemosh, the abhorrent idol of Moab, on the mountain that is east of Jerusalem, and for Molech, the abhorrent idol of the sons of Ammon."},{"num":8,"verse":"He also did the same for all his foreign wives, who burned incense and sacrificed to their gods."},{"num":9,"verse":"Now the Lord was angry with Solomon because his heart had turned away from the Lord, the God of Israel, who had appeared to him twice,"},{"num":10,"verse":"and had commanded him regarding this thing, that he was not to follow other gods; but he did not comply with what the Lord had commanded."},{"num":11,"verse":"So the Lord said to Solomon, “Since you have done this, and you have not kept My covenant and My statutes, which I have commanded you, I will certainly tear the kingdom away from you, and will give it to your servant."},{"num":12,"verse":"However, I will not do it in your days, only for the sake of your father David; but I will tear it away from the hand of your son."},{"num":13,"verse":"Yet I will not tear away all the kingdom, but I will give one tribe to your son for the sake of My servant David, and for the sake of Jerusalem, which I have chosen.”"},{"header":"God Raises Adversaries"},{"num":14,"verse":"Then the Lord raised up an adversary against Solomon, Hadad the Edomite; he was of the royal line in Edom."},{"num":15,"verse":"For it came about, when David was in Edom and Joab the commander of the army had gone up to bury those killed in battle, and had struck and killed every male in Edom"},{"num":16,"verse":"(for Joab and all Israel stayed there for six months, until he had eliminated every male in Edom),"},{"num":17,"verse":"that Hadad fled to Egypt, he and certain Edomites of his father’s servants with him, while Hadad was a young boy."},{"num":18,"verse":"They set out from Midian and came to Paran; and they took men with them from Paran and came to Egypt, to Pharaoh king of Egypt, who gave him a house and assigned him food and gave him land."},{"num":19,"verse":"Now Hadad found great favor in the sight of Pharaoh, so that he gave him in marriage the sister of his own wife, the sister of Tahpenes the queen."},{"num":20,"verse":"And the sister of Tahpenes gave birth to his son Genubath, whom Tahpenes weaned in Pharaoh’s house; and Genubath was in Pharaoh’s house among the sons of Pharaoh."},{"num":21,"verse":"But when Hadad heard in Egypt that David lay down with his fathers and that Joab the commander of the army was dead, Hadad said to Pharaoh, “Let me go, so that I may go to my own country.”"},{"num":22,"verse":"However, Pharaoh said to him, “But what have you lacked with me that you are here, requesting to go to your own country?” And he answered, “Nothing; nevertheless you must let me go.”"},{"num":23,"verse":"God also raised up another adversary against him, Rezon the son of Eliada, who had fled from his master Hadadezer, king of Zobah."},{"num":24,"verse":"And he gathered men to himself and became leader of a marauding band, after David killed those of Zobah; and they went to Damascus and stayed there, and reigned in Damascus."},{"num":25,"verse":"So he was an adversary to Israel all the days of Solomon, along with the harm that Hadad inflicted; and he felt disgust for Israel and reigned over Aram."},{"num":26,"verse":"Then Jeroboam the son of Nebat, an Ephraimite of Zeredah, Solomon’s servant, whose mother’s name was Zeruah, a widow, also rebelled against the king."},{"num":27,"verse":"Now this was the reason why he rebelled against the king: Solomon built the Millo, and closed up the breach of the city of his father David."},{"num":28,"verse":"Now the man Jeroboam was a valiant warrior, and when Solomon saw that the young man was industrious, he appointed him over all the forced labor of the house of Joseph."},{"num":29,"verse":"And it came about at that time, when Jeroboam went out of Jerusalem, that the prophet Ahijah the Shilonite found him on the road. Now Ahijah had clothed himself with a new cloak; and both of them were alone in the field."},{"num":30,"verse":"Then Ahijah took hold of the new cloak which was on him and tore it into twelve pieces."},{"num":31,"verse":"And he said to Jeroboam, “Take for yourself ten pieces; for this is what the Lord, the God of Israel says: ‘Behold, I am going to tear the kingdom away from the hand of Solomon and give you ten tribes"},{"num":32,"verse":"(but he shall have one tribe, for the sake of My servant David and for the sake of Jerusalem, the city which I have chosen from all the tribes of Israel),"},{"num":33,"verse":"because they have abandoned Me, and have worshiped Ashtoreth the goddess of the Sidonians, Chemosh the god of Moab, and Milcom the god of the sons of Ammon; and they have not walked in My ways, doing what is right in My sight and keeping My statutes and My ordinances, as his father David did."},{"num":34,"verse":"Nevertheless I will not take the whole kingdom out of his hand, but I will make him ruler all the days of his life, for the sake of My servant David whom I chose, who kept My commandments and My statutes;"},{"num":35,"verse":"but I will take the kingdom from his son’s hand and give it to you; that is, ten tribes."},{"num":36,"verse":"But to his son I will give one tribe, so that My servant David may always have a lamp before Me in Jerusalem, the city where I have chosen for Myself to put My name."},{"num":37,"verse":"However I will take you, and you shall reign over all that you desire, and you shall be king over Israel."},{"num":38,"verse":"Then it shall be, that if you listen to all that I command you and walk in My ways, and do what is right in My sight by keeping My statutes and My commandments, as My servant David did, then I will be with you and build you an enduring house as I built for David, and I will give Israel to you."},{"num":39,"verse":"So I will oppress the descendants of David for this, but not always.’”"},{"num":40,"verse":"Solomon sought therefore to put Jeroboam to death; but Jeroboam set out and fled to Egypt to Shishak king of Egypt, and he was in Egypt until the death of Solomon."},{"header":"The Death of Solomon"},{"num":41,"verse":"Now the rest of the acts of Solomon and whatever he did, and his wisdom, are they not written in the Book of the Acts of Solomon?"},{"num":42,"verse":"So the time that Solomon reigned in Jerusalem over all Israel was forty years."},{"num":43,"verse":"Then Solomon lay down with his fathers and was buried in the city of his father David, and his son Rehoboam reigned in his place."}]