[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(54) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Whoso eateth my flesh, and drinketh my blood.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The thought advances from the negative to the positive. The previous verse stated the condition without which they could not have life. This verse declares that they who thus eat and drink possess that life now, and that it is eternal. (Comp. Note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 6:47",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) The thought advances, too, from the “ye” of those immediately addressed to the “whoso,” which has no limit but the fulfilment of the condition. The word for “eateth” is a stronger word than that before used, meaning literally the act of dividing the food by the teeth; but this meaning is not to be pressed. It is simply the present tense, which describes the process of eating, and is the same word which is used in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 6:56-58",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 13:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The sense of the word in the only other place in the New Testament where it occurs (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 24:38",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") confirms this.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And I will raise him up at the last day.—The thought of the eternal life, which is the present possession of the spirit in communion with God, leads on once again to the fuller expansion of that life in the final victory over death. (Comp. John 6:40; John 6:44.)",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "And I will raise him up at the last day.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The thought of the eternal life, which is the present possession of the spirit in communion with God, leads on once again to the fuller expansion of that life in the final victory over death. (Comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 6:40",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 6:44",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "John 6:54-58",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 6:54-58",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Whoso eateth my flesh, &c., hath eternal life ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Has the principles of eternal life implanted in him, and shall enjoy it; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for I will raise him up, &c. For my flesh is meat indeed, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — My flesh and blood are the true nutriment of the soul: they feed it and make it grow: they give vigour to all the faculties, preserve it in spiritual life, and make it fit for heaven. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He that eateth my flesh, &c., dwelleth in me, and I in him ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— By an intimate and inseparable union. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "As the living Father ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— The great source of life and felicity; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "has sent me, and I live by the Father ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Being one with him: or, as to my human nature, live by his support, protection, and care; he continually dwelling in me, and communicating his Spirit to me in the richest abundance of gifts and graces; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "so he that eateth me ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— That confides in, and cleaves to me, by a lively operative faith; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall live by me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " — A spiritual, holy, and happy life, through the Spirit which I will communicate to him: he shall be united to me by an internal and vital union. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "This is the bread ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— This, of which I speak, or, I am the bread; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "which came down from heaven ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— For the purposes aforesaid. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Not as your fathers did eat manna, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — This bread is not like the manna which your fathers ate, who died notwithstanding; and it is not to be eaten the same way that your fathers did eat the manna, nor with the same effect; for ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he that eateth of this bread shall live for ever ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— He shall be so far from dying, as your fathers did in the wilderness, that his life and happiness shall have no end, but shall run parallel with the longest line of eternity itself.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6:52-59 The flesh and blood of the Son of man, denote the Redeemer in the nature of man; Christ and him crucified, and the redemption wrought out by him, with all the precious benefits of redemption; pardon of sin, acceptance with God, the way to the throne of grace, the promises of the covenant, and eternal life. These are called the flesh and blood of Christ, because they are purchased by the breaking his body, and the shedding of his blood. Also, because they are meat and drink to our souls. Eating this flesh and drinking this blood mean believing in Christ. We partake of Christ and his benefits by faith. The soul that rightly knows its state and wants, finds whatever can calm the conscience, and promote true holiness, in the redeemer, God manifest in the flesh. Meditating upon the cross of Christ gives life to our repentance, love, and gratitude. We live by him, as our bodies live by our food. We live by him, as the members by the head, the branches by the root: because he lives we shall live also.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In these verses Jesus repeats what he had in substance said before.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Except ye eat the flesh ... - He did not mean that this should be understood literally, for it was never done, and it is absurd to suppose that it was intended to be so understood. Nothing can possibly be more absurd than to suppose that when he instituted the Supper, and gave the bread and wine to his disciples, they literally ate his flesh and drank his blood. Who can believe this? There he stood, a living man - his body yet alive, his blood flowing in his veins; and how can it be believed that this body was eaten and this blood drunk? Yet this absurdity must be held by those who hold that the bread and wine at the communion are \"changed into the body, blood, and divinity of our Lord.\" So it is taught in the decrees of the Council of Trent; and to such absurdities are men driven when they depart from the simple meaning of the Scriptures and from common sense. It may be added that if the bread and wine used in the Lord's Supper were not changed into his literal body and blood when it was first instituted, they have never been since.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The Lord Jesus would institute it just as he meant it should be observed, and there is nothing now in that ordinance which there was not when the Saviour first appointed it. His body was offered on the cross, and was raised up from the dead and received into heaven. Besides, there is no evidence that he had any reference in this passage to the Lord's Supper. That was not yet instituted, and in that there was no literal eating of his flesh and drinking of his blood. The plain meaning of the passage is, that by his bloody death - his body and his blood offered in sacrifice for sin - he would procure pardon and life for man; that they who partook of that, or had an interest in that, should obtain eternal life. He uses the figure of eating and drinking because that was the subject of discourse; because the Jews prided themselves much on the fact that their fathers had eaten manna; and because, as he had said that he was the bread of life, it was natural and easy, especially in the language which he used, to carry out the figure, and say that bread must be eaten in order to be of any avail in supporting and saving men. To eat and to drink, among the Jews, was also expressive of sharing in or partaking of the privileges of friendship. The happiness of heaven and all spiritual blessings are often represented under this image, Matthew 8:11; Matthew 26:29; Luke 14:15, etc.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The Lord Jesus would institute it just as he meant it should be observed, and there is nothing now in that ordinance which there was not when the Saviour first appointed it. His body was offered on the cross, and was raised up from the dead and received into heaven. Besides, there is no evidence that he had any reference in this passage to the Lord's Supper. That was not yet instituted, and in that there was no literal eating of his flesh and drinking of his blood. The plain meaning of the passage is, that by his bloody death - his body and his blood offered in sacrifice for sin - he would procure pardon and life for man; that they who partook of that, or had an interest in that, should obtain eternal life. He uses the figure of eating and drinking because that was the subject of discourse; because the Jews prided themselves much on the fact that their fathers had eaten manna; and because, as he had said that he was the bread of life, it was natural and easy, especially in the language which he used, to carry out the figure, and say that bread must be eaten in order to be of any avail in supporting and saving men. To eat and to drink, among the Jews, was also expressive of sharing in or partaking of the privileges of friendship. The happiness of heaven and all spiritual blessings are often represented under this image, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 8:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 26:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 14:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", etc.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "54. Whoso eateth … hath, &c.—The former verse said that unless they partook of Him they had no life; this adds, that whoever does so \"hath eternal life.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and I will raise him up at the last day—For the fourth time this is repeated (see Joh 6:39, 40, 44)—showing most clearly that the \"eternal life\" which such a man \"hath\" cannot be the same with the future resurrection life from which it is carefully distinguished each time, but a life communicated here below immediately on believing (Joh 3:36; 5:24, 25); and giving to the resurrection of the body as that which consummates the redemption of the entire man, a prominence which in the current theology, it is to be feared, it has seldom had. (See Ro 8:23; 1Co 15:1-58, throughout).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Hath eternal life; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " he hath it in a sure and just right title, and he shall have it in a certain actual possession: and in order to it, he shall have a joyful resurrection unto it at the last day. This is no more than what our Saviour had often said, particularly ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "John 3:18,36",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 3:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",36",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", admitting what was before said, that by eating the flesh and drinking the blood of Christ, is to be meant believing in him; only here is a clearer discovery than was there, of the true object of that faith which justifieth, viz. a Christ crucified, for that is signified by the flesh and blood mentioned. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Whoso eateth my flesh, and drinketh my blood,.... Spiritually by faith, as explained in the preceding verse: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "hath eternal life; the principle of spiritual life, which is evidently implanted in him, as appears from his eating and drinking; and is a durable and lasting principle: grace is an incorruptible seed; every part of it is abiding and permanent; and it is itself the beginning, pledge, and earnest of everlasting life, and is inseparably connected with it: moreover, such have eternal life itself, not only in Christ their head, but in themselves: they have a right unto it, and a meetness for it: and may be assured of it, as if they were personally possessed of it, from their election to it; the security of it in Christ; from the grace they have received, which is the beginning of glory; and the earnest of it in themselves: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and I will raise him up at the last day; to enjoy it in soul and body; See Gill on John 6:39,  See Gill on John 6:40. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and I will raise him up at the last day; to enjoy it in soul and body; See Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 6:39",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",  See Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 6:40",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Whoso eateth my flesh, and drinketh my blood, hath eternal life; and I will raise him up at the last day.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Meyer's NT Commentary",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 6:54-55",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". He now more fully explains Himself, onwards to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 6:58",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", with regard to the saving efficacy of this spiritual eating and drinking: “",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He who eateth my flesh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",” etc.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὁ τρώγων",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Previously the word was ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "φάγητε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but there is in the change no special intention as if to use a stronger term (to chew, to crunch), as the repetition of ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πίνων",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " shows. Comp. Dem. 402. 21 : ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τρώγειν καὶ πίνειν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Plut. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Mor",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". p. 613 B; Polyb. xxxii. 9. 9. Comp. also ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 13:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 24:38",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ζωὴν αἰών",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".] Fuller definition of the general ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ζωή",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which precedes; it signifies the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "eternal Messianic life",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but the development of this in time as ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "spiritual",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " life is included in the thought; therefore ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἔχει",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 3:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and the result of the possession of this life: ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀναστήσω",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "κ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "λ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 6:40",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 6:55",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Proof of the assertion ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἔχει",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " … ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἡμέρᾳ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; for if the flesh of Jesus were not ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "true",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " food (something ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "which in very deed has nourishing power",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), etc., the effect named in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 6:54",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " could not ensue. It is self-evident that food for the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "inner",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " man is meant; but ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀληθής",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (see the critical notes) is not the same as ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀληθινή",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (this would mean ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "genuine",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " food, food that realizes its own ideal). It denotes the opposite of that which is merely apparent or so called, and therefore expresses the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "actual fact",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 John 2:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 12:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), which the Jews could not understand, since they asked ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πῶς δύναται",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "κ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "λ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 6:52",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "54",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The gracious positive of the previous minatory negative. From the warning as to the disastrous consequences of not partaking He passes to a declaration of the blessed consequences of partaking, viz. eternal life, and that at once, with resurrection among the just hereafter.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "John 6:54",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Eateth (τρώγων)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Another verb for eating is used. With the exception of Matthew 24:38, it is found only in John, and always in connection with Christ. No special significance can be fairly attached to its use here. It seems to be taken as a current word, and ἔφαγον is resumed in John 6:58. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Another verb for eating is used. With the exception of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 24:38",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", it is found only in John, and always in connection with Christ. No special significance can be fairly attached to its use here. It seems to be taken as a current word, and ἔφαγον is resumed in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 6:58",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      }
    ]
  }
]