[{"num":39,"verse":"¶ Knowest thou the time when the mountain goats bring forth? Hast thou observed when the hinds calve?"},{"num":2,"verse":"Canst thou number the months that they fulfil, and knowest thou the time when they bring forth?"},{"num":3,"verse":"How they crouch down, they bring forth their young ones, and dismiss their pain."},{"num":4,"verse":"Their young ones are healthy, they grow up with grain; they go forth and never return unto them again."},{"num":5,"verse":"Who freed the wild ass, and who loosed its bands?"},{"num":6,"verse":"Unto whom I made a house in the wilderness, and his dwellings in the salty land."},{"num":7,"verse":"He laughs at the multitude of the city, neither does he hearken to the voice of the exactor of tribute."},{"num":8,"verse":"The range of the mountains is his pasture, and he searches after every green thing."},{"num":9,"verse":"Will the unicorn be willing to serve thee or abide by thy crib?"},{"num":10,"verse":"Canst thou bind the unicorn with his band in the furrow? Will he harrow the valleys after thee?"},{"num":11,"verse":"Wilt thou trust him because his strength is great? Or wilt thou leave thy labour to him?"},{"num":12,"verse":"Wilt thou trust him, that he will bring home thy seed and gather it into thy barn?"},{"num":13,"verse":"¶ Didst thou give beautiful wings unto the peacock, or wings and feathers unto the ostrich?"},{"num":14,"verse":"Who leaves her eggs in the earth and warms them in dust"},{"num":15,"verse":"and forgets that the foot may crush them or that the wild beast may break them."},{"num":16,"verse":"She is hardened against her young ones, as though they were not hers, not fearing that her labour is in vain,"},{"num":17,"verse":"because God caused her to forget wisdom and did not give her understanding."},{"num":18,"verse":"In her time she lifts up herself on high; she scorns the horse and his rider."},{"num":19,"verse":"¶ Hast thou given the horse strength? Hast thou clothed his neck with thunder?"},{"num":20,"verse":"Canst thou make him leap as a grasshopper? The glory of his nostrils is formidable."},{"num":21,"verse":"He paws at the earth and rejoices in his strength; he goes forth to meet the armed men."},{"num":22,"verse":"He mocks fear and is not afraid; neither does he turn his face from the sword."},{"num":23,"verse":"The quiver rattles against him, the glittering spear and the shield."},{"num":24,"verse":"He swallows the ground with fierceness and rage; the sound of the shofar does not trouble him;"},{"num":25,"verse":"for the blasts of the shofar fill him with courage; he smells the battle afar off, the thunder of the princes and the sound of the battle-cry."},{"num":26,"verse":"¶ Does the hawk fly by thy industry and stretch her wings toward the south?"},{"num":27,"verse":"Does the eagle mount up at thy command and make her nest on high?"},{"num":28,"verse":"She dwells and abides on the rock upon the crag of the rock and the strong place."},{"num":29,"verse":"From there she seeks food, and her eyes behold afar off."},{"num":30,"verse":"Her young ones suck up the blood; and wherever the slain are, there she is."}]