[{"num":20,"verse":"Then all the people of Israel came out, and the whole community from Dan to Beersheba, including the Israelites in Gilead, assembled as one man before the Lord at Mizpah. "},{"num":2,"verse":"The pillars of the people from all the tribes of Israel took their places in the assembly of the people of God—four hundred thousand foot soldiers, armed with swords. "},{"num":3,"verse":"(The people of Benjamin heard that the people of Israel had gone up to Mizpah.) The people of Israel said, “Speak up! How did this evil happen?”"},{"num":4,"verse":"Then the Levite, the husband of the woman who had been murdered, answered, “I, along with my concubine, came to Gibeah in Benjamin to spend the night. "},{"num":5,"verse":"But the citizens of Gibeah rose up against me and surrounded the house during the night. They intended to kill me. They abused my concubine, and she died. "},{"num":6,"verse":"So I took hold of my concubine, cut her into pieces, and I sent her to every region of the inheritance of Israel, because the men of Gibeah did this outrageous, foolish deed in Israel. "},{"num":7,"verse":"Look! All of you are descendants of Israel! Consider the matter and give your judgment.”"},{"num":8,"verse":"All the people then rose up as one man. They said, “Not one of us will go to his tent, nor will any of us return to their homes. "},{"num":9,"verse":"Now this is what we will do to Gibeah: We will determine who goes against it by choosing lots. "},{"num":10,"verse":"We will choose ten men out of every hundred from all the tribes of Israel—and a hundred out of a thousand, and a thousand out of ten thousand—to gather provisions for the troops. When the men of Israel arrive at Gibeah in Benjamin, Israel can do to the men of Gibeah what they deserve for all the disgraceful things they did in Israel.” "},{"num":11,"verse":"So all the men of Israel were gathered against the city. The various groups were united as if they were one man."},{"num":12,"verse":"The tribes of Israel sent men through the whole tribe of Benjamin, saying, “What is this evil thing that has been done among you? "},{"num":13,"verse":"Now, hand over the men, these worthless, wicked men from Gibeah! We will put them to death and root out this evil from Israel.”"},{"num":14,"verse":"Instead, the people from all the cities of Benjamin gathered at Gibeah to go out for war against the people of Israel. "},{"num":15,"verse":"On that day the people of Benjamin mustered from their cities twenty-six thousand men armed with swords, not counting those who lived in Gibeah, from which they mustered an additional seven hundred elite men. "},{"num":16,"verse":"From all these troops, there were seven hundred elite soldiers who were left-handed, each of whom could sling a stone at a single hair and not miss."},{"num":17,"verse":"Meanwhile, the men of Israel, apart from Benjamin, mustered four hundred thousand men armed with swords, each of them a trained soldier."},{"num":18,"verse":"They arose and went up to Bethel, and the people of Israel inquired of God, “Who will go up to lead us into the battle against the Benjaminites?”"},{"num":19,"verse":"The Israelites got up in the morning and set up camp against Gibeah. "},{"num":20,"verse":"The men of Israel went out for war against Benjamin and lined up for battle at Gibeah. "},{"num":21,"verse":"But the Benjaminites came out from Gibeah, and that day they struck down to the ground twenty-two thousand men of Israel!"},{"num":22,"verse":"The men of Israel renewed their courage and again lined up for battle in the same spot where they had lined up on the first day. "},{"num":23,"verse":"The people of Israel went up and wept before the Lord until evening. They inquired of the Lord, “Shall we go out again to engage in battle with the people of Benjamin, our brothers?”"},{"num":24,"verse":"The Israelites approached the Benjaminites on the second day. "},{"num":25,"verse":"Benjamin came out from Gibeah to confront them on the second day and took down an additional eighteen thousand men from among the Israelites—right down to the ground!—all of them men armed with swords."},{"num":26,"verse":"After that, all the Israelites, the entire army, went up to Bethel. There they wept and sat before the Lord and fasted all that day until evening. They offered burnt offerings and fellowship offerings before the Lord. "},{"num":27,"verse":"The people of Israel inquired of the Lord. (The Ark of the Covenant of God was there in those days.) "},{"num":28,"verse":"Phinehas son of Eleazar, son of Aaron, was ministering in front of the ark in those days. He asked, “Shall I again go out to battle against our brothers the Benjaminites, or shall I stop?”"},{"num":29,"verse":"Then Israel positioned men in ambushes all around Gibeah. "},{"num":30,"verse":"The men of Israel went up against the men of Benjamin on the third day, and they lined up against Gibeah as they had done before. "},{"num":31,"verse":"Again the Benjaminites went out to confront the people of Israel. The Benjaminites were drawn away from the city, and they began to strike down some of the people, killing them in the open country as they had done before, along the highway that goes up to Bethel and the one to Gibeah. They killed about thirty men of Israel."},{"num":32,"verse":"The Benjaminites thought, “They are being struck down before us, just as they were before.”"},{"num":33,"verse":"So all the men of Israel fell back from their positions and drew up a battle line at Baal Tamar. Then the Israelites who were hiding in ambush came bursting out from their positions west of Geba. "},{"num":34,"verse":"Ten thousand specially chosen men from all Israel came out against Gibeah. The battle was fierce, and the Benjaminites did not realize that calamity was about to fall upon them. "},{"num":35,"verse":"The Lord struck down Benjamin before Israel, and the Israelites brought Benjamin to ruin on that day. Twenty-five thousand one hundred men, who were armed with swords, fell. "},{"num":36,"verse":"Then the Benjaminites saw that they were beaten."},{"num":37,"verse":"The hidden attackers struck quickly. They dashed into Gibeah, spread out, and struck the entire city with the edge of the sword. "},{"num":38,"verse":"This was the signal for the men of Israel and for those in the ambush: When they saw a great cloud of smoke coming up from the city, "},{"num":39,"verse":"the men of Israel were to turn back to join the battle."},{"num":40,"verse":"But as a column of smoke began to rise above the city, the Benjaminites turned to look behind them, and suddenly they saw that the city was going up toward heaven like a burnt offering. "},{"num":41,"verse":"Then the Israelites turned back, and the Benjaminites were horrified because they realized that disaster was falling upon them. "},{"num":42,"verse":"They fled from the men of Israel to escape toward the wilderness, but the battle kept up with them, as Israelites from the cities all around them were striking them down. "},{"num":43,"verse":"The Israelites encircled Benjamin, pursued them, and overran their positions all the way to Nohah, a spot east of Gibeah. "},{"num":44,"verse":"From Benjamin, eighteen thousand fell, all of them strong warriors. "},{"num":45,"verse":"The surviving Benjaminites turned and fled toward the wilderness, to the Rock of Rimmon, but five thousand of these men were picked off along the highways. The Israelites caught up with them at Gidom and struck down two thousand more of their men."},{"num":46,"verse":"So the total number of Benjaminites that fell that day was twenty-five thousand men armed with swords, all of them powerful warriors. "},{"num":47,"verse":"But the surviving six hundred men turned and fled toward the wilderness to the Rock of Rimmon, and they stayed at the Rock of Rimmon for four months."},{"num":48,"verse":"The men of Israel had turned back against the Benjaminites and struck them with the edge of the sword. They struck the entire city, including the animals and whatever else could be found. They burned down all the rest of the cities."}]