[[],[{"type":"header","content":"Resolve to Punish the Guilty"},{"type":"prose","content":"Then all the sons of Israel from Dan to Beersheba, including the land of Gilead, came out, and the congregation assembled as one person to the LORD at Mizpah."}],[{"type":"prose","content":"And the leaders of all the people, all the tribes of Israel, took their stand in the assembly of the people of God, four hundred thousand foot soldiers who drew the sword."}],[{"type":"prose","content":"(Now the sons of Benjamin heard that the sons of Israel had gone up to Mizpah.) And the sons of Israel said, “Tell , how did this wickedness take place?”"}],[{"type":"prose","content":"So the Levite, the husband of the woman who was murdered, answered and said, “I came with my concubine to spend the night at Gibeah which belongs to Benjamin."}],[{"type":"prose","content":"But the citizens of Gibeah rose up against me and surrounded the house at night, threatening me. They intended to kill me; instead, they raped my concubine so that she died."}],[{"type":"prose","content":"And I took hold of my concubine and cut her in pieces, and sent her throughout the land of Israel’s inheritance; for they have committed an outrageous sin and vile act in Israel."}],[{"type":"prose","content":"Behold, all you sons of Israel, give your response and advice here.”"}],[{"type":"prose","content":"Then all the people rose up as one person, saying, “Not one of us will go to his tent, nor will any of us go home."}],[{"type":"prose","content":"But now this is the thing which we will do to Gibeah;  against it by lot."}],[{"type":"prose","content":"And we will take ten men out of a hundred throughout the tribes of Israel, and a hundred out of a thousand, and a thousand out of ten thousand to supply provisions for the people, so that when they come to Gibeah of Benjamin, they may punish  for all the vile sin that they have committed in Israel.”"}],[{"type":"prose","content":"So all the men of Israel were gathered against the city, united as one man."}],[{"type":"prose","content":"Then the tribes of Israel sent men through the entire tribe of Benjamin, saying, “What is this wickedness that has taken place among you?"}],[{"type":"prose","content":"Now then, turn over the men, the worthless men who are in Gibeah, so that we may put them to death and remove  wickedness from Israel.” But the sons of Benjamin would not listen to the voice of their brothers, the sons of Israel."}],[{"type":"prose","content":"Instead, the sons of Benjamin gathered from the cities to Gibeah, to go out to battle against the sons of Israel."}],[{"type":"prose","content":"From the cities on that day the sons of Benjamin were counted, twenty-six thousand men who drew the sword, besides the inhabitants of Gibeah who were counted, seven hundred choice men."}],[{"type":"prose","content":"Out of all these people seven hundred choice men were left-handed; each one could sling a stone at a hair and not miss."}],[{"type":"prose","content":"Then the men of Israel besides Benjamin were counted, four hundred thousand men who drew the sword; all of these were men of war."}],[{"type":"header","content":"Civil War, Benjamin Defeated"},{"type":"prose","content":"Now the sons of Israel set out, went up to Bethel, and inquired of God and said, “Who shall go up first for us to battle against the sons of Benjamin?” Then the LORD said, “Judah  first.”"}],[{"type":"prose","content":"So the sons of Israel got up in the morning and camped against Gibeah."}],[{"type":"prose","content":"The men of Israel went to battle against Benjamin, and the men of Israel lined up for battle against them at Gibeah."}],[{"type":"prose","content":"Then the sons of Benjamin came out of Gibeah and struck to the ground on that day twenty-two thousand men of Israel."}],[{"type":"prose","content":"But the people, the men of Israel, showed themselves courageous and lined up for battle again in the place where they had lined themselves up on the first day."}],[{"type":"prose","content":"And the sons of Israel went up and wept before the LORD until evening, and inquired of the LORD, saying, “Shall we again advance for battle against the sons of my brother Benjamin?” And the LORD said, “Go up against him.”"}],[{"type":"prose","content":"So the sons of Israel came against the sons of Benjamin on the second day."}],[{"type":"prose","content":"And Benjamin went out against them from Gibeah the second day and struck to the ground again eighteen thousand men of the sons of Israel; all of these drew the sword."}],[{"type":"prose","content":"Then all the sons of Israel and all the people went up and came to Bethel, and they wept and remained there before the LORD, and fasted that day until evening. And they offered burnt offerings and peace offerings before the LORD."}],[{"type":"prose","content":"And the sons of Israel inquired of the LORD (for the ark of the covenant of God  there in those days,"}],[{"type":"prose","content":"and Phinehas the son of Eleazar, Aaron’s son, stood before it  in those days), saying, “Shall I yet again go out to battle against the sons of my brother Benjamin, or shall I stop?” And the LORD said, “Go up, for tomorrow I will hand them over to you.”"}],[{"type":"prose","content":"So Israel set men in ambush around Gibeah."}],[{"type":"prose","content":"And the sons of Israel went up against the sons of Benjamin on the third day and lined up against Gibeah as at other times."}],[{"type":"prose","content":"When the sons of Benjamin went out against the people, they were lured away from the city, and they began to strike and kill some of the people as at other times, on the roads (one of which goes up to Bethel, and the other to Gibeah),  in the field, about thirty men of Israel."}],[{"type":"prose","content":"And the sons of Benjamin said, “They are defeated before us, like the first time.” But the sons of Israel said, “Let’s flee, so that we may draw them away from the city to the roads.”"}],[{"type":"prose","content":"Then all the men of Israel rose from their place and lined up at Baal-tamar; and the men of Israel in ambush charged from their place, from Maareh-geba."}],[{"type":"prose","content":"When ten thousand choice men from all Israel came against Gibeah, the battle became fierce; but Benjamin did not know that disaster was close to them."}],[{"type":"prose","content":"And the LORD struck Benjamin before Israel, so that the sons of Israel destroyed 25,100 men of Benjamin that day, all who drew the sword."}],[{"type":"prose","content":"So the sons of Benjamin saw that they were defeated. When the men of Israel gave ground to Benjamin because they relied on the men in ambush whom they had set against Gibeah,"}],[{"type":"prose","content":"the men in ambush hurried and rushed against Gibeah; the men in ambush also deployed and struck all the city with the edge of the sword."}],[{"type":"prose","content":"Now the agreed sign between the men of Israel and the men in ambush was that they would make a great cloud of smoke rise from the city."}],[{"type":"prose","content":"Then the men of Israel turned in the battle, and Benjamin began to strike and kill about thirty men of Israel, for they said, “Undoubtedly they are defeated before us, as in the first battle.”"}],[{"type":"prose","content":"But when the cloud began to rise from the city  a column of smoke, Benjamin looked behind them; and behold, the entire city was going up  to heaven."}],[{"type":"prose","content":"Then the men of Israel turned, and the men of Benjamin were terrified; for they saw that disaster was close to them."}],[{"type":"prose","content":"Therefore, they turned their backs before the men of Israel  in the direction of the wilderness, but the battle overtook them while those who  from the cities were annihilating them in the midst of them."}],[{"type":"prose","content":"They surrounded Benjamin, pursued them without rest,  trampled them down opposite Gibeah toward the east."}],[{"type":"prose","content":"So eighteen thousand men of Benjamin fell; all of these  valiant men."}],[{"type":"prose","content":"The rest turned and fled toward the wilderness to the rock of Rimmon, but they caught five thousand of them on the roads and overtook them at Gidom, and killed two thousand of them."}],[{"type":"prose","content":"So all those of Benjamin who fell that day were twenty-five thousand men who drew the sword; all of these were valiant men."}],[{"type":"prose","content":"But six hundred men turned and fled toward the wilderness to the rock of Rimmon; and they remained at the rock of Rimmon for four months."}],[{"type":"prose","content":"The men of Israel then turned back against the sons of Benjamin and struck them with the edge of the sword, both the entire city with the cattle and all that they found; they also set on fire all the cities which they found."}]]