[{"header":"Right Teaching"},{"num":2,"verse":"You must teach what is right and true. "},{"num":2,"verse":"Older men are to be quiet and to be careful how they act. They are to be the boss over their own desires. Their faith and love are to stay strong and they are not to give up. "},{"num":3,"verse":"Teach older women to be quiet and to be careful how they act also. They are not to go around speaking bad things about others or things that are not true. They are not to be chained by strong drink. They should teach what is good."},{"num":4,"verse":"Older women are to teach the young women to love their husbands and children. "},{"num":5,"verse":"They are to teach them to think before they act, to be pure, to be workers at home, to be kind, and to obey their own husbands. In this way, the Word of God is honored. "},{"num":6,"verse":"Also teach young men to be wise. "},{"num":7,"verse":"In all things show them how to live by your life and by right teaching. "},{"num":8,"verse":"You should be wise in what you say. Then the one who is against you will be ashamed and will not be able to say anything bad about you."},{"num":9,"verse":"Those who are servants owned by someone must obey their owners and please them in everything. They must not argue. "},{"num":10,"verse":"They must not steal from their owners but prove they can be trusted in every way. In this way, their lives will honor the teaching of God Who saves us."},{"num":11,"verse":"God’s free gift of being saved is being given to everyone. "},{"num":12,"verse":"We are taught to have nothing to do with that which is against God. We are to have nothing to do with the desires of this world. We are to be wise and to be right with God. We are to live God-like lives in this world. "},{"num":13,"verse":"We are to be looking for the great hope and the coming of our great God and the One Who saves, Christ Jesus. "},{"num":14,"verse":"He gave Himself for us. He did this by buying us with His blood and making us free from all sin. He gave Himself so His people could be clean and want to do good. "},{"num":15,"verse":"Teach all these things and give words of help. Show them if they are wrong. You have the right and the power to do this. Do not let anyone think little of you."}]