[{"num":2,"verse":"But as for you, Titus, you must teach what is right."},{"num":2,"verse":"Tell the older men that they must not drink too much wine. They must be men whom people respect. They must be wise. They must believe what is true. They must be loving and patient."},{"num":3,"verse":"Tell the older women also that they must live like Christians. They must not tell lies about anyone. They must not drink much wine. They must teach what is good."},{"num":4,"verse":"They must teach the young women to love their husbands and their children."},{"num":5,"verse":"They must teach young women to have good sense, to live a clean life, to care for their homes, to be kind, and to obey their husbands. Then people cannot say wrong things about God's word."},{"num":6,"verse":"Also tell the young men to have good sense."},{"num":7,"verse":"Titus, show them what they should do in all matters by the good things you do. Do not mix your teaching with things that are not true. Teach in such a way that people will respect you."},{"num":8,"verse":"Be sure that what you say is true, so that no one can say anything against it. Then anyone who is against us will be made ashamed because he can find nothing wrong to say about us."},{"num":9,"verse":"Tell servants to obey their master in everything. Tell them to please them and not talk back to them."},{"num":10,"verse":"They must not steal, but be very honest so the person they work for can trust them. In all things they must show that the teaching about God our Saviour is good."},{"num":11,"verse":"God's loving kindness has come. It is through that blessing that all men are saved."},{"num":12,"verse":"It teaches us to say no to the things that are not true of God, and to the things of this world. It teaches us to use good sense, to do what is right, and to please God while we live in this world."},{"num":13,"verse":"All this is while we wait and hope to see the one who brings blessing. We are waiting for our great God to come in Jesus Christ. He is the One who will save us. He is wonderful!"},{"num":14,"verse":"Christ gave himself for us so that he might make us free from all that is wrong. He gave himself to make us into clean people who belong to him and want to do good."},{"num":15,"verse":"Talk about these things. Tell people they must do them. And use all your power to stop people if they are doing wrong. Do not let anyone despise you."}]