[[],[{"type":"prose","content":"And thou -- be speaking what doth become the sound teaching;"}],[{"type":"prose","content":"aged men to be temperate, grave, sober, sound in the faith, in the love, in the endurance;"}],[{"type":"prose","content":"aged women, in like manner, in deportment as doth become sacred persons, not false accusers, to much wine not enslaved, of good things teachers,"}],[{"type":"prose","content":"that they may make the young women sober-minded, to be lovers of [their] husbands, lovers of [their] children,"}],[{"type":"prose","content":"sober, pure, keepers of [their own] houses, good, subject to their own husbands, that the word of God may not be evil spoken of."}],[{"type":"prose","content":"The younger men, in like manner, be exhorting to be sober-minded;"}],[{"type":"prose","content":"concerning all things thyself showing a pattern of good works; in the teaching uncorruptedness, gravity, incorruptibility,"}],[{"type":"prose","content":"discourse sound, irreprehensible, that he who is of the contrary part may be ashamed, having nothing evil to say concerning you."}],[{"type":"prose","content":"Servants -- to their own masters [are] to be subject, in all things to be well-pleasing, not gainsaying,"}],[{"type":"prose","content":"not purloining, but showing all good stedfastness, that the teaching of God our Saviour they may adorn in all things."}],[{"type":"prose","content":"For the saving grace of God was manifested to all men,"}],[{"type":"prose","content":"teaching us, that denying the impiety and the worldly desires, soberly and righteously and piously we may live in the present age,"}],[{"type":"prose","content":"waiting for the blessed hope and manifestation of the glory of our great God and Saviour Jesus Christ,"}],[{"type":"prose","content":"who did give himself for us, that he might ransom us from all lawlessness, and might purify to himself a peculiar people, zealous of good works;"}],[{"type":"prose","content":"these things be speaking, and exhorting, and convicting, with all charge; let no one despise thee!"}]]