[{"header":"The Lord Answers Job"},{"num":38,"verse":"Then the Lord answered Job out of the strong wind and said, "},{"num":2,"verse":"“Who is this that makes words of wisdom dark by speaking without much learning? "},{"num":3,"verse":"Now get ready like a man, and I will ask you some questions and you answer Me. "},{"num":4,"verse":"Where were you when I began building the earth? Tell Me, if you have understanding. "},{"num":5,"verse":"Who decided how big it was to be, since you know? Who looked to see if it was as big as it should be? "},{"num":6,"verse":"What was it built upon? Who laid its first stone, "},{"num":7,"verse":"when the morning stars sang together and all the sons of God called out for joy?"},{"num":8,"verse":"“Who shut up the sea with doors, when it rushed out from its secret place? "},{"num":9,"verse":"I made clouds its clothing, and put much darkness around it. "},{"num":10,"verse":"I marked the places where it could not pass, and set locks and doors. "},{"num":11,"verse":"And I said, ‘You will come this far, and no farther. Here will your proud waves stop.’"},{"num":12,"verse":"“Have you ever in your life told the morning when to come, and caused the first light of day to know its place, "},{"num":13,"verse":"that it might take hold of the ends of the earth, and the sinful be shaken out of it? "},{"num":14,"verse":"It is changed like clay when an object is pushed down to mark it, and they stand out like clothing. "},{"num":15,"verse":"The light of the sinful is held back, and the arm lifted up is broken."},{"num":16,"verse":"“Have you gone into the wells of the sea? Have you walked on the bottom of the deep sea? "},{"num":17,"verse":"Have the gates of death been shown to you? Or have you seen the gates of the deep darkness? "},{"num":18,"verse":"Have you understood how great the earth is? Tell Me, if you know all this."},{"num":19,"verse":"“Where does the light come from? And where is the place of darkness, "},{"num":20,"verse":"that you may take it to its land, and know the paths to its home? "},{"num":21,"verse":"You know, for you were born then. You are very old! "},{"num":22,"verse":"Have you gone into the store-houses of the snow? Have you seen the store-houses of the hail, "},{"num":23,"verse":"which I have kept for the time of trouble, for the day of war and battle? "},{"num":24,"verse":"What is the way to the place where the light is divided, or the east wind spread over the earth?"},{"num":25,"verse":"“Who has cut open a way for the flood, and a path for the thunderstorm? "},{"num":26,"verse":"Who brings rain on the land without people, on a desert without a man in it, "},{"num":27,"verse":"to fill the need of the wasted land, and to make the grass grow? "},{"num":28,"verse":"Does the rain have a father? Who has given birth to the drops of rain? "},{"num":29,"verse":"Who gave birth to ice? And who gave birth to the snow water of heaven? "},{"num":30,"verse":"Water becomes hard like stone, and the top of the sea is covered with ice."},{"num":31,"verse":"“Can you tie the chains of the stars of Pleiades, or loose the ropes of Orion? "},{"num":32,"verse":"Can you lead the groups of stars out at the right times? Can you lead the stars of the Bear with her young? "},{"num":33,"verse":"Do you know the laws of the heavens? Can you make them to rule over the earth?"},{"num":34,"verse":"“Can you lift up your voice to the clouds, that a flood of water may cover you? "},{"num":35,"verse":"Can you send out lightnings, that they may go and say to you, ‘Here we are’? "},{"num":36,"verse":"Who has given wisdom to the heart? Who has given understanding to the mind? "},{"num":37,"verse":"Who can number the clouds by wisdom? Or who can push over the water jars of the heavens, "},{"num":38,"verse":"when the dust gathers together and becomes hard?"},{"num":39,"verse":"“Can you hunt food for the lion? Can you fill the hunger of the young lions, "},{"num":40,"verse":"when they lie in their own place in the rock, or wait in their hiding place? "},{"num":41,"verse":"Who gets the food ready for the raven, when its young cry to God and go about without food?"}]