[{"num":38,"verse":"Then Hashem answered Iyov out of the whirlwind, and said,"},{"num":2,"verse":"Who is this that darkeneth etzah (counsel) with words without da’as?"},{"num":3,"verse":"Gird up now thy loins like a gever; for I will ask of thee, and thou wilt answer Me."},{"num":4,"verse":"Where wast thou when I laid the foundations of eretz? Tell, if thou hast binah."},{"num":5,"verse":"Who hath drafted the dimensions thereof, if thou hast da’as? Or who hath stretched a measuring line across it?"},{"num":6,"verse":"Whereupon are the foundations thereof set? Or who laid the even-pinnah (cornerstone) thereof"},{"num":7,"verse":"When the kokhvei boker sang together, and all the Bnei Elohim shouted for joy?"},{"num":8,"verse":"Or who shut up the yam behind doors? Who brought it forth, issuing out of the rekhem (womb)"},{"num":9,"verse":"When I made the anan the garment thereof, and thick darkness its swaddling band,"},{"num":10,"verse":"And fixed bounds for it, and set bars and dlatot (doors),"},{"num":11,"verse":"And said, Hitherto shalt thou come, but no further; and poh (here) shall thy proud waves be stopped?"},{"num":12,"verse":"Hast thou commanded the boker since thy yamim began; or caused the shachar (dawn) to know its place;"},{"num":13,"verse":"That it might seize the ends of ha’aretz, that the resha’im be shaken out of it?"},{"num":14,"verse":"It is changed like chomer (clay) under the khotam (seal); and they stand out like a garment."},{"num":15,"verse":"And from the resha’im their ohr is denied, and the upraised zero’a shall be broken."},{"num":16,"verse":"Hast thou entered into the springs of the yam? Or hast thou walked in the recesses of the tehom?"},{"num":17,"verse":"Have the sha’arei mavet been disclosed unto thee? Or hast thou seen the sha’arei tzalmavet?"},{"num":18,"verse":"Hast thou perceived the expanse of eretz? Tell Me if thou hast da’as of it all."},{"num":19,"verse":"Where is the derech where ohr dwelleth? And as for choshech, where is the place thereof,"},{"num":20,"verse":"That thou shouldest take it to its border, and that thou shouldest have da’as of the paths to its bais?"},{"num":21,"verse":"Knowest thou it, because thou wast then born? Or because the mispar of thy yamim is so great?"},{"num":22,"verse":"Hast thou entered into the otzrot (storehouses) of the snow? Or hast thou seen the otzrot of barad (hail),"},{"num":23,"verse":"Which I have reserved for the time of tzar, for the yom kerav (battle) and milchamah (war)?"},{"num":24,"verse":"Which is the derech where the ohr is distributed, where is scattered the east wind upon eretz?"},{"num":25,"verse":"Who hath cut a channel for the overflowing of waters, or a derech for the lightning of thunder,"},{"num":26,"verse":"To cause it to rain on eretz, where lo ish is; on midbar, wherein there is lo adam;"},{"num":27,"verse":"To saturate a desolate and waste ground; and to cause the bud of the desheh to spring forth?"},{"num":28,"verse":"Hath the rain an av? Or who hath begotten the drops of tal (dew)?"},{"num":29,"verse":"Out of whose beten cometh the ice? And the frost of Shomayim, who giveth birth to it?"},{"num":30,"verse":"The mayim harden like even (stone), and the face of tehom is frozen."},{"num":31,"verse":"Canst thou bind the chains of the Pleiades, or loose the bonds of Orion?"},{"num":32,"verse":"Canst thou bring forth Mazzarot in their times? Or canst thou guide the Bear with its banim?"},{"num":33,"verse":"Knowest thou the chukkot of Shomayim? Canst thou set the rule over ha’aretz?"},{"num":34,"verse":"Canst thou lift up thy kol (voice) to the clouds, that abundance of mayim may cover thee?"},{"num":35,"verse":"Canst thou send lightning bolts, that they may go and say unto thee, Hineinu (here we are)?"},{"num":36,"verse":"Who hath put chochmah in the inward parts, or who hath given binah to the mind?"},{"num":37,"verse":"Who can number the clouds in chochmah, or who can tip the waterskins of Shomayim,"},{"num":38,"verse":"When the dust hardens into a clump, and the clods cleave fast together?"},{"num":39,"verse":"Wilt thou hunt the teref for the lioness, or fill the appetite of her whelps,"},{"num":40,"verse":"When they crouch in their me’onot (dens), and abide in the lair to lie in ambush?"},{"num":41,"verse":"Who provideth for the raven his food? When his young ones cry unto El, they wander about for lack of okhel."}]