[{"header":"Jehu Is Anointed King of Israel"},{"num":9,"verse":"Meanwhile the prophet Elisha called one of the young prophets and said to him, “Get ready and go to Ramoth in Gilead. Take this jar of olive oil with you, "},{"num":2,"verse":"and when you get there look for Jehu, the son of Jehoshaphat and grandson of Nimshi. Take him to a private room away from his companions, "},{"num":3,"verse":"pour this olive oil on his head, and say, ‘The Lord proclaims that he anoints you king of Israel.’ Then leave there as fast as you can.”"},{"num":4,"verse":"So the young prophet went to Ramoth, "},{"num":5,"verse":"where he found the army officers in a conference. He said, “Sir, I have a message for you.”"},{"num":6,"verse":"Then the two of them went indoors, and the young prophet poured the olive oil on Jehu's head and said to him, “The Lord, the God of Israel, proclaims: ‘I anoint you king of my people Israel. "},{"num":7,"verse":"You are to kill your master the king, that son of Ahab, so that I may punish Jezebel for murdering my prophets and my other servants. "},{"num":8,"verse":"All of Ahab's family and descendants are to die; I will get rid of every male in his family, young and old alike. "},{"num":9,"verse":"I will treat his family as I did the families of King Jeroboam of Israel and of King Baasha of Israel. "},{"num":10,"verse":"Jezebel will not be buried; her body will be eaten by dogs in the territory of Jezreel.’” After saying this, the young prophet left the room and fled."},{"num":11,"verse":"Jehu went back to his fellow officers, who asked him, “Is everything all right? What did that crazy fellow want with you?”"},{"num":12,"verse":"“No we don't!” they replied. “Tell us what he said!”"},{"num":13,"verse":"At once Jehu's fellow officers spread their cloaks at the top of the steps for Jehu to stand on, blew trumpets, and shouted, “Jehu is king!”"},{"header":"King Joram of Israel Is Killed"},{"num":14,"verse":"Then Jehu plotted against King Joram, who was in Jezreel, where he had gone to recover from the wounds which he had received in the battle at Ramoth against King Hazael of Syria. So Jehu said to his fellow officers, “If you are with me, make sure that no one slips out of Ramoth to go and warn the people in Jezreel.” "},{"num":16,"verse":"Then he got into his chariot and set off for Jezreel. Joram had still not recovered, and King Ahaziah of Judah was there, visiting him."},{"num":17,"verse":"A guard on duty in the watchtower at Jezreel saw Jehu and his men approaching. “I see some men riding up!” he called out."},{"num":18,"verse":"The messenger rode out to Jehu and said to him, “The king wants to know if you come as a friend.”"},{"num":19,"verse":"Another messenger was sent out, who asked Jehu the same question. Again Jehu answered, “That's none of your business! Fall in behind me.”"},{"num":20,"verse":"Once more the guard reported that the messenger had reached the group but was not returning. And he added, “The leader of the group is driving his chariot like a madman, just like Jehu!”"},{"num":21,"verse":"“Get my chariot ready,” King Joram ordered. It was done, and he and King Ahaziah rode out, each in his own chariot, to meet Jehu. They met him at the field which had belonged to Naboth. "},{"num":22,"verse":"“Are you coming in peace?” Joram asked him."},{"num":23,"verse":"“It's treason, Ahaziah!” Joram cried out, as he turned his chariot around and fled. "},{"num":24,"verse":"Jehu drew his bow, and with all his strength shot an arrow that struck Joram in the back and pierced his heart. Joram fell dead in his chariot, "},{"num":25,"verse":"and Jehu said to his aide Bidkar, “Get his body and throw it in the field that belonged to Naboth. Remember that when you and I were riding together behind King Joram's father Ahab, the Lord spoke these words against Ahab: "},{"num":26,"verse":"‘I saw the murder of Naboth and his sons yesterday. And I promise that I will punish you here in this same field.’ So take Joram's body,” Jehu ordered his aide, “and throw it in the field that belonged to Naboth, so as to fulfill the Lord's promise.”"},{"header":"King Ahaziah of Judah Is Killed"},{"num":27,"verse":"King Ahaziah saw what happened, so he fled in his chariot toward the town of Beth Haggan, pursued by Jehu. “Kill him too!” Jehu ordered his men, and they wounded him as he drove his chariot on the road up to Gur, near the town of Ibleam. But he managed to keep on going until he reached the city of Megiddo, where he died. "},{"num":28,"verse":"His officials took his body back to Jerusalem in a chariot and buried him in the royal tombs in David's City."},{"num":29,"verse":"Ahaziah had become king of Judah in the eleventh year that Joram son of Ahab was king of Israel."},{"header":"Queen Jezebel Is Killed"},{"num":30,"verse":"Jehu arrived in Jezreel. Jezebel, having heard what had happened, put on eye shadow, arranged her hair, and stood looking down at the street from a window in the palace. "},{"num":31,"verse":"As Jehu came through the gate, she called out, “You Zimri! You assassin! Why are you here?”"},{"num":32,"verse":"Jehu looked up and shouted, “Who is on my side?” Two or three palace officials looked down at him from a window, "},{"num":33,"verse":"and Jehu said to them, “Throw her down!” They threw her down, and her blood spattered on the wall and on the horses. Jehu drove his horses and chariot over her body, "},{"num":34,"verse":"entered the palace, and had a meal. Only then did he say, “Take that cursed woman and bury her; after all, she is a king's daughter.” "},{"num":35,"verse":"But the men who went out to bury her found nothing except her skull and the bones of her hands and feet. "},{"num":36,"verse":"When they reported this to Jehu, he said, “This is what the Lord said would happen, when he spoke through his servant Elijah: ‘Dogs will eat Jezebel's body in the territory of Jezreel. "},{"num":37,"verse":"Her remains will be scattered there like dung, so that no one will be able to identify them.’”"}]