[{"num":11,"verse":"I say then, has God cast away his people? God forbid. For even I of course am an Israelite, of the seed of Abraham and of the tribe of Benjamin. "},{"num":2,"verse":"God has not cast away his people whom he foreknew. Or do you not know what the scripture says by the mouth of Elijah, how he makes intercession to God against Israel, saying, "},{"num":3,"verse":"Lord, they have killed your prophets and dug down your altars, and only I am left, and they seek my life? "},{"num":4,"verse":"But what is the answer of God to him in response? – I have reserved for myself seven thousand who have not bowed the knee to Baal. "},{"num":5,"verse":"Likewise also there is at this time a remnant left through the election of grace. "},{"num":6,"verse":"If it is by grace, then it is not by works, for then grace would not be grace any more. And if it is by works, then it is not grace any more, for then deserving would no longer be deserving.  "},{"num":7,"verse":"What then? Israel has not obtained what it sought. No, but yet the chosen ones have obtained it. The rest are blinded, "},{"num":8,"verse":"as it is written: God has given them the spirit of unquietness: eyes so that they cannot see, and ears so that they cannot hear, until this day. "},{"num":9,"verse":"And David says, Let their table be made a snare to take them with, and an occasion to fall, and a reward to them. "},{"num":10,"verse":"Let their eyes be blinded so that they do not see, and ever bow down their backs."},{"num":11,"verse":"I say then, have they therefore stumbled, only but to fall? God forbid. But through their fall, salvation has come to the Gentiles, to rally them at the same time. "},{"num":12,"verse":"And so if their fall is the riches of the world, and their diminishment the riches of the Gentiles, how much greater the riches if they all believed? "},{"num":13,"verse":"I preach to you Gentiles, inasmuch as I am the apostle to the Gentiles. I will magnify my office, "},{"num":14,"verse":"so that I might rally those who are my flesh, and might save some of them. "},{"num":15,"verse":"For if the casting away of them is the reconciling of the world, what is the receiving of them, but life again from death? "},{"num":16,"verse":"For if one piece is holy, the whole lump is holy. And if the root is holy, the branches are holy also."},{"num":17,"verse":"Though some of the branches are broken off, and you, being a wild olive tree, are grafted in among them and made partaker of the root and sap of the olive tree, "},{"num":18,"verse":"do not boast against the branches. For if you boast, remember that you do not bear the root, but the root bears you. "},{"num":19,"verse":"You will say then that the branches are broken off so that you may be grafted in. "},{"num":20,"verse":"Well said: because of unbelief they are broken off, and you stand steadfast in faith. Be not high-minded, but fear, "},{"num":21,"verse":"seeing that God spared not the natural branches, lest perhaps he also not spare you."},{"num":22,"verse":"Behold the kindness and severity of God: on those who fell, severity, but towards you, kindness – if you continue in his kindness. Otherwise you will be hewn off. "},{"num":23,"verse":"And they, if they do not persist in unbelief, will be grafted in again. For God is of power to graft them in again. "},{"num":24,"verse":"For if you were cut out of a naturally wild olive tree, and were grafted contrary to nature into a true olive tree, how much more may the natural branches be grafted into their own olive tree again?"},{"num":25,"verse":"I would not that this mystery be hid from you my brethren (lest you be wise in your own estimations), that with respect to a part, blindness is upon Israel, until the fullness of the Gentiles be come in; "},{"num":26,"verse":"and in this way all Israel will be saved. As it is written: There will come out of Zion he who does deliver, and who will turn away ungodliness from Jacob. "},{"num":27,"verse":"And: This is my covenant to them, when I take away their sins. "},{"num":28,"verse":"Concerning the gospel, they are enemies for your sakes; but as for the chosen ones, these are loved for the fathers’ sakes. "},{"num":29,"verse":"For indeed, the gifts and calling of God are such that he cannot change his mind about them."},{"num":30,"verse":"For look, just as you in time past did not believe God, and yet have now obtained mercy through their unbelief, "},{"num":31,"verse":"in the same way now they have not believed the mercy that has come to you so that they also may obtain mercy. "},{"num":32,"verse":"God has wrapped all nations in unbelief in order that he may have mercy on all."},{"num":33,"verse":"O the deepness of the riches of the wisdom and knowledge of God! How unsearchable are his judgments, and his ways past finding out. "},{"num":34,"verse":"For who has known the mind of the Lord? Or who has been his counsellor? "},{"num":35,"verse":"Or who has given to him first, that he should be recompensed? "},{"num":36,"verse":"For from him, and through him, and for him, are all things. To him be glory forever. Amen."}]