[{"header":"God Keeps His Own"},{"num":40,"verse":"I did not give up waiting for the Lord. And He turned to me and heard my cry. "},{"num":2,"verse":"He brought me up out of the hole of danger, out of the mud and clay. He set my feet on a rock, making my feet sure. "},{"num":3,"verse":"He put a new song in my mouth, a song of praise to our God. Many will see and fear and will put their trust in the Lord."},{"num":4,"verse":"How happy is the man who has made the Lord his trust, and has not turned to the proud or to the followers of lies. "},{"num":5,"verse":"O Lord my God, many are the great works You have done, and Your thoughts toward us. No one can compare with You! If I were to speak and tell of them, there would be too many to number."},{"num":6,"verse":"You have not wanted gifts given on the altar in worship. You have opened my ears. You have not wanted burnt gifts or gifts to cover sins. "},{"num":7,"verse":"Then I said, “Look, I have come. It is written about me in the book. "},{"num":8,"verse":"I am happy to do Your will, O my God. Your Law is within my heart.”"},{"num":9,"verse":"I have told the good news about what is right and good in the big meeting with many people. You know I will not close my lips, O Lord. "},{"num":10,"verse":"I have not hidden what is right and good with You in my heart. I have spoken about how faithful You are and about Your saving power. I have not hidden Your loving-kindness and Your truth from the big meeting."},{"num":11,"verse":"O Lord, You will not keep Your loving-pity from me. Your loving-kindness and Your truth will always keep me safe. "},{"num":12,"verse":"Too many troubles gather around me. My sins have taken such a hold on me that I am not able to see. There are more of them than there are hairs on my head. And the strength of my heart has left me."},{"num":13,"verse":"Be pleased to save me, O Lord. Hurry, O Lord, to help me. "},{"num":14,"verse":"Let all who want to destroy my life be ashamed and troubled. Let those who want to hurt me be turned away without honor. "},{"num":15,"verse":"Let those who say to me, “O! O!” be filled with fear because of their shame. "},{"num":16,"verse":"But let all who look for You have joy and be glad in You. Let those who love Your saving power always say, “The Lord be honored!” "},{"num":17,"verse":"Because I suffer and am in need, let the Lord think of me. You are my help and the One Who sets me free. O my God, do not wait."}]