[{"num":40,"verse":"For victory, the psalm of David. I abiding abode the Lord; and he gave attention to me. And he heard my prayers; (To victory, the song of David. Patiently waiting, I waited for the Lord; and he gave attention to me. And he heard my prayers;)"},{"num":2,"verse":"and he led out me from the pit of wretchedness, and from the filth of dregs. And he ordained my feet on a stone; and he (ad)dressed my goings. (and he led me out of the pit of wretchedness, and out of the filth of dregs. And he ordained my feet upon a stone; and he directed my goings.)"},{"num":3,"verse":"And he sent into my mouth a new song; a song to our God. Many men shall see, and dread; and shall hope in the Lord. (And he put a new song in my mouth; a song to our God. And many shall see this, and shall have fear/and shall be in awe; and then they shall put their trust in the Lord.)"},{"num":4,"verse":"Blessed is the man, of whom the name of the Lord is his hope; and he beheld not into vanities, and into false vengeances. (Happy is the person, for whom the Lord’s name is his hope; and he looketh not to idols, or to false gods.)"},{"num":5,"verse":"My Lord God, thou hast made thy marvels many; and in thy thoughts none is, that is like thee (toward us). I told and I spake; and they be multiplied above number. (My Lord God, thou hast done many marvellous deeds; and there is no one like thee, for all thy thoughts be for our benefit. I have told about them; yea, I have spoken about them, and they be multiplied far above number.)"},{"num":6,"verse":"Thou wouldest not sacrifice and offering; but thou madest perfectly ears to me. Thou askedest not burnt sacrifice, and other sacrifice for sin; (Thou desiredest not sacrifices and offerings; but thou hast given me ears to hear thee. Thou askedest not for burnt sacrifices, and other sacrifices for sin;)"},{"num":7,"verse":"then I said, Lo! I come. In the head of the book it is written of me, (and so I said, Lo! I am here. From the beginning, the Book of thy Law was written for me,)"},{"num":8,"verse":"that I should do thy will; my God, I would/I desired also to do (it); and thy law in the midst of mine heart. (so that I would do thy will; my God, I desire to do it; and thy Law is there in the midst of my heart.)"},{"num":9,"verse":"I told thy rightfulness in a great church; lo! I shall not refrain my lips, Lord, thou knewest. (I told of thy righteousness in the great congregation; lo! I shall not refrain my lips, Lord, thou knowest that.)"},{"num":10,"verse":"I hid not thy rightfulness in mine heart; I said thy truth and thine health. I hid not thy mercy, and thy truth, from a much council. (I kept not thy righteousness, or thy goodness, hidden in my heart; I spoke about thy faithfulness, and thy salvation, or thy deliverance. I hid not thy love, and thy faithfulness, from the great congregation.)"},{"num":11,"verse":"But thou, Lord, make not far thy merciful doings from me; thy mercy and truth ever[more] take me up. (But thou, Lord, make not thy merciful doings to be far away from me; let thy love, and thy faithfulness, keep me safe forevermore.)"},{"num":12,"verse":"For why evils, of which is no number, (en)compassed me; my wickednesses have taken me, and I might not, that I should (even) see. Those be multiplied above the hairs of mine head; and mine heart forsook me. (For evils, of which there is no number, surrounded me; my wickednesses have taken hold of me, and I can no longer see. Yea, they be multiplied far above the hairs of my head; and my heart hath deserted me.)"},{"num":13,"verse":"Lord, please it to thee, that thou deliver me; Lord, behold thou to help me. (Lord, may it please thee to save me; Lord, look thou to help me.)"},{"num":14,"verse":"Be they shamed, and ashamed together; that seek my life, to take away it. Be they turned aback, and be they shamed/and be they ashamed; that will evils to me. (Be they shamed, and ashamed; all who seek to take my life. Be they turned back, and be shamed/and be ashamed; all who desire evil for me.)"},{"num":15,"verse":"Bear they their confusion anon; that say to me, Well! well! in scorn. (Bear they their own shame at once/Be they ashamed at once; who scornfully say to me, Well! well!)"},{"num":16,"verse":"All men that seek thee, be fully joyful, and be glad in thee; and say they, that love thine health, The Lord be magnified ever[more]. (But let all those who seek thee, be very joyful, and be glad in thee; and let those who love thy salvation, or thy deliverance, say forevermore, The Lord be magnified.)"},{"num":17,"verse":"Forsooth I am a beggar and poor; the Lord is busy of me (But I am a poor and needy man, yea, a beggar; Lord, help thou me). Thou art mine helper and my defender; my God, tarry thou not."}]