[{"header":"The Day of the Lord"},{"num":5,"verse":"Now as to the times and dates, brothers and sisters, you have no need for anything to be written to you. "},{"num":2,"verse":"For you yourselves know perfectly well that the day of the [return of the] Lord is coming just as a thief [comes unexpectedly and suddenly] in the night. "},{"num":3,"verse":"While they are saying, “Peace and safety [all is well and secure!]” then [in a moment unforeseen] destruction will come upon them suddenly like labor pains on a woman with child, and they will absolutely not escape [for there will be no way to escape the judgment of the Lord]. "},{"num":4,"verse":"But you, believers, [all you who believe in Christ as Savior and acknowledge Him as God’s Son] are not in spiritual darkness [nor held by its power], that the day [of judgment] would overtake you [by surprise] like a thief; "},{"num":5,"verse":"for you are all sons of light and sons of day. We do not belong to the night nor to darkness. "},{"num":6,"verse":"So then let us not sleep [in spiritual indifference] as the rest [of the world does], but let us keep wide awake [alert and cautious] and let us be sober [self-controlled, calm, and wise]. "},{"num":7,"verse":"For those who sleep, sleep at night, and those who are drunk get drunk at night. "},{"num":8,"verse":"But since we [believers] belong to the day, let us be sober, having put on the breastplate of faith and love, and as a helmet, the hope and confident assurance of salvation. "},{"num":9,"verse":"For God has not destined us to [incur His] wrath [that is, He did not select us to condemn us], but to obtain salvation through our Lord Jesus Christ, "},{"num":10,"verse":"who died [willingly] for us, so that whether we are awake (alive) or asleep (dead) [at Christ’s appearing], we will live together with Him [sharing eternal life]. "},{"num":11,"verse":"Therefore encourage and comfort one another and build up one another, just as you are doing."},{"header":"Christian Conduct"},{"num":12,"verse":"Now we ask you, brothers and sisters, to appreciate those who diligently work among you [recognize, acknowledge, and respect your leaders], who are in charge over you in the Lord and who give you instruction, "},{"num":13,"verse":"and [we ask that you appreciate them and] hold them in the highest esteem in love because of their work [on your behalf]. Live in peace with one another. "},{"num":14,"verse":"We [earnestly] urge you, believers, admonish those who are out of line [the undisciplined, the unruly, the disorderly], encourage the timid [who lack spiritual courage], help the [spiritually] weak, be very patient with everyone [always controlling your temper]. "},{"num":15,"verse":"See that no one repays another with evil for evil, but always seek that which is good for one another and for all people. "},{"num":16,"verse":"Rejoice always and delight in your faith; "},{"num":17,"verse":"be unceasing and persistent in prayer; "},{"num":18,"verse":"in every situation [no matter what the circumstances] be thankful and continually give thanks to God; for this is the will of God for you in Christ Jesus. "},{"num":19,"verse":"Do not quench [subdue, or be unresponsive to the working and guidance of] the [Holy] Spirit. "},{"num":20,"verse":"Do not scorn or reject gifts of prophecy or prophecies [spoken revelations—words of instruction or exhortation or warning]. "},{"num":21,"verse":"But test all things carefully [so you can recognize what is good]. Hold firmly to that which is good. "},{"num":22,"verse":"Abstain from every form of evil [withdraw and keep away from it]."},{"num":23,"verse":"Now may the God of peace Himself sanctify you through and through [that is, separate you from profane and vulgar things, make you pure and whole and undamaged—consecrated to Him—set apart for His purpose]; and may your spirit and soul and body be kept complete and [be found] blameless at the coming of our Lord Jesus Christ. "},{"num":24,"verse":"Faithful and absolutely trustworthy is He who is calling you [to Himself for your salvation], and He will do it [He will fulfill His call by making you holy, guarding you, watching over you, and protecting you as His own]."},{"num":25,"verse":"Brothers and sisters, pray for us."},{"num":26,"verse":"Greet all the believers with a holy kiss [as brothers and sisters in God’s family]. "},{"num":27,"verse":"I solemnly charge you by the Lord to have this letter read before all the congregation."},{"num":28,"verse":"The grace of our Lord Jesus Christ be with you."}]