[{"header":"The Day of the Lord"},{"num":5,"verse":"About the times and the seasons: Brothers, you do not need anything to be written to you. "},{"num":2,"verse":"For you yourselves know very well that the Day of the Lord will come just like a thief in the night. "},{"num":3,"verse":"When they say, “Peace and security,” then sudden destruction comes on them, like labor pains come on a pregnant woman, and they will not escape. "},{"num":4,"verse":"But you, brothers, are not in the dark, for this day to overtake you like a thief. "},{"num":5,"verse":"For you are all sons of light and sons of the day. We do not belong to the night or the darkness. "},{"num":6,"verse":"So then, we must not sleep, like the rest, but we must stay awake and be serious. "},{"num":7,"verse":"For those who sleep, sleep at night, and those who get drunk are drunk at night. "},{"num":8,"verse":"But since we belong to the day, we must be serious and put the armor of faith and love on our chests, and put on a helmet of the hope of salvation. "},{"num":9,"verse":"For God did not appoint us to wrath, but to obtain salvation through our Lord Jesus Christ, "},{"num":10,"verse":"who died for us, so that whether we are awake or asleep, we will live together with Him. "},{"num":11,"verse":"Therefore encourage one another and build each other up as you are already doing."},{"header":"Exhortations and Blessings"},{"num":12,"verse":"Now we ask you, brothers, to give recognition to those who labor among you and lead you in the Lord and admonish you, "},{"num":13,"verse":"and to regard them very highly in love because of their work. Be at peace among yourselves. "},{"num":14,"verse":"And we exhort you, brothers: warn those who are irresponsible, comfort the discouraged, help the weak, be patient with everyone. "},{"num":15,"verse":"See to it that no one repays evil for evil to anyone, but always pursue what is good for one another and for all."},{"num":23,"verse":"Now may the God of peace Himself sanctify you completely. And may your spirit, soul, and body be kept sound and blameless for the coming of our Lord Jesus Christ. "},{"num":24,"verse":"He who calls you is faithful, who also will do it. "},{"num":25,"verse":"Brothers, pray for us also. "},{"num":26,"verse":"Greet all the brothers with a holy kiss. "},{"num":27,"verse":"I charge you by the Lord that this letter be read to all the brothers. "},{"num":28,"verse":"The grace of our Lord Jesus Christ be with you."}]