[[],[{"type":"header","content":"The Day of the Lord"},{"type":"prose","content":"But concerning the times and the seasons, brethren, you have no need that I should write to you. "}],[{"type":"prose","content":"For you yourselves know perfectly that the day of the Lord so comes as a thief in the night. "}],[{"type":"prose","content":"For when they say, “Peace and safety!” then sudden destruction comes upon them, as labor pains upon a pregnant woman. And they shall not escape. "}],[{"type":"prose","content":"But you, brethren, are not in darkness, so that this Day should overtake you as a thief. "}],[{"type":"prose","content":"You are all sons of light and sons of the day. We are not of the night nor of darkness. "}],[{"type":"prose","content":"Therefore let us not sleep, as others  but let us watch and be sober. "}],[{"type":"prose","content":"For those who sleep, sleep at night, and those who get drunk are drunk at night. "}],[{"type":"prose","content":"But let us who are of the day be sober, putting on the breastplate of faith and love, and  a helmet the hope of salvation. "}],[{"type":"prose","content":"For God did not appoint us to wrath, but to obtain salvation through our Lord Jesus Christ, "}],[{"type":"prose","content":"who died for us, that whether we wake or sleep, we should live together with Him."}],[{"type":"prose","content":"Therefore comfort each other and edify one another, just as you also are doing."}],[{"type":"header","content":"Various Exhortations"},{"type":"prose","content":"And we urge you, brethren, to recognize those who labor among you, and are over you in the Lord and admonish you, "}],[{"type":"prose","content":"and to esteem them very highly in love for their work’s sake. Be at peace among yourselves."}],[{"type":"prose","content":"Now we exhort you, brethren, warn those who are unruly, comfort the fainthearted, uphold the weak, be patient with all. "}],[{"type":"prose","content":"See that no one renders evil for evil to anyone, but always pursue what is good both for yourselves and for all."}],[{"type":"prose","content":"Rejoice always, "}],[{"type":"prose","content":"pray without ceasing, "}],[{"type":"prose","content":"in everything give thanks; for this is the will of God in Christ Jesus for you."}],[{"type":"prose","content":"Do not quench the Spirit. "}],[{"type":"prose","content":"Do not despise prophecies. "}],[{"type":"prose","content":"Test all things; hold fast what is good. "}],[{"type":"prose","content":"Abstain from every form of evil."}],[{"type":"header","content":"Blessing and Admonition"},{"type":"prose","content":"Now may the God of peace Himself sanctify you completely; and may your whole spirit, soul, and body be preserved blameless at the coming of our Lord Jesus Christ. "}],[{"type":"prose","content":"He who calls you  faithful, who also will do "}],[{"type":"prose","content":"Brethren, pray for us."}],[{"type":"prose","content":"Greet all the brethren with a holy kiss."}],[{"type":"prose","content":"I charge you by the Lord that this epistle be read to all the holy brethren."}],[{"type":"prose","content":"The grace of our Lord Jesus Christ  with you. Amen."}]]