[{"header":"Children of Light"},{"num":5,"verse":"Now when it comes to specific times and dates, my dear family, you don’t need to have anyone write to you. "},{"num":2,"verse":"You yourselves know very well that the day of the Lord will come like a midnight robber. "},{"num":3,"verse":"When people say, ‘Peace and security!’, then swift ruin will arrive at their doorstep, like the pains that come over a woman in labour, and they won’t have a chance of escape."},{"num":4,"verse":"But as for you, my dear family – you are not in darkness. That day won’t surprise you like a robber. "},{"num":5,"verse":"You are all children of light, children of the day! We don’t belong to the night, or to darkness. "},{"num":6,"verse":"So, then, let’s not go to sleep, like the others, but let’s keep awake and stay sober."},{"num":7,"verse":"People who sleep, you see, sleep at night. People who get drunk get drunk at night. "},{"num":8,"verse":"But we daytime people should be self-controlled, clothing ourselves with the breastplate of faith and love, and with the helmet of the hope of salvation; "},{"num":9,"verse":"because God has not placed us on the road to fury, but to gaining salvation, through our Lord Jesus the Messiah. "},{"num":10,"verse":"He died for us, so that whether we stay awake or go to sleep we should live together with him. "},{"num":11,"verse":"So strengthen one another, and build each other up, just as you are doing."},{"header":"Final Exhortations"},{"num":12,"verse":"This, my dear family, is the request we make of you. Take note of those who work among you and exercise leadership over you in the Lord, those who give you instruction. "},{"num":13,"verse":"Give them the highest possible rank of love because of their work. Live at peace among yourselves."},{"num":14,"verse":"And, my dear family, we beg you to warn those who step out of line. Console the downcast; help the weak, be warm-hearted and patient towards everybody. "},{"num":15,"verse":"Make sure nobody pays anyone back evil for evil. Instead, always find the way to do good to one another, and to everybody."},{"header":"Final Blessings and Charge"},{"num":23,"verse":"Now may the God of peace himself make you completely holy. May your complete spirit, soul and body be kept blameless at the coming of our Lord Jesus the Messiah. "},{"num":24,"verse":"The one who calls you is faithful; he will do it."},{"num":25,"verse":"My dear family, pray for us."},{"num":26,"verse":"Greet the whole family with a holy kiss. "},{"num":27,"verse":"I charge you by the Lord to have this letter read to the whole family."},{"num":28,"verse":"The grace of our Lord Jesus the Messiah be with you."}]