[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(63) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I adjure thee by the living God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": ". . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The appeal was one of unusual solemnity. All else had failed to break through the silence, but this would surely rouse Him. Technically, the oath thus tendered to the accused was of the nature of an oath of compurgation, such as that recognised in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 22:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 5:19-22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Kings 8:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but it was skilfully worded so as to force upon our Lord the alternative either of denying what indeed He was, or of making a confession which would be treated as blasphemy. The records of St. John’s Gospel (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 5:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 8:58",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 9:37",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 10:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") show us that they had good means of knowing what answer to expect.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "26:57-68 Jesus was hurried into Jerusalem. It looks ill, and bodes worse, when those who are willing to be Christ's disciples, are not willing to be known to be so. Here began Peter's denying him: for to follow Christ afar off, is to begin to go back from him. It is more our concern to prepare for the end, whatever it may be, than curiously to ask what the end will be. The event is God's, but the duty is ours. Now the Scriptures were fulfilled, which said, False witnesses are risen up against me. Christ was accused, that we might not be condemned; and if at any time we suffer thus, let us remember we cannot expect to fare better than our Master. When Christ was made sin for us, he was silent, and left it to his blood to speak. Hitherto Jesus had seldom professed expressly to be the Christ, the Son of God; the tenor of his doctrine spoke it, and his miracles proved it; but now he would not omit to make an open confession of it. It would have looked like declining his sufferings. He thus confessed, as an example and encouragement to his followers, to confess him before men, whatever hazard they ran. Disdain, cruel mocking, and abhorrence, are the sure portion of the disciple as they were of the Master, from such as would buffet and deride the Lord of glory. These things were exactly foretold in the fiftieth chapter of Isaiah. Let us confess Christ's name, and bear the reproach, and he will confess us before his Father's throne.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Jesus held his peace - Was silent. He knew that the evidence did not even appear to amount to anything worth a reply. He knew that they were aware of that, and that feeling that, the high priest attempted to draw something from him on which they could condemn him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I adjure thee by the living God - I put thee upon thy oath before God. This was the usual form of putting an oath among the Jews. It implies calling God to witness the truth of what was said. The law respecting witnesses also made it a violation of an oath to conceal any part of the truth; and though our Saviour might have felt that such a question, put in such a manner, was very improper or was unlawful, yet he also knew that to be silent would be construed into a denial of his being the Christ. The question was probably put in auger. They had utterly failed in their proof. They had no way left to accomplish their purpose of condemning him but to draw it from his own lips. This cunning question was therefore proposed. The difficulty of the question consisted in this: If he confessed that he was the Son of God, they stood ready to condemn him for \"blasphemy;\" if he denied it, they were prepared to condemn him for being an impostor, and for deluding the people under the pretence of being the Messiah.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The living God - Yahweh is called the living God in opposition to idols, which were without life.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The Christ - The Messiah, the Anointed. See the notes at Matthew 1:1.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The Christ - The Messiah, the Anointed. See the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 1:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The Son of God - The Jews uniformly expected that the Messiah would be the Son of God. In their view it denoted, also, that he would be \"divine,\" or equal to the Father, John 10:31-36. To claim that title was therefore, in their view, \"blasphemy;\" and as they had determined beforehand in their own minds that he was not the Messiah, they were ready at once to accuse him of blasphemy. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The Son of God - The Jews uniformly expected that the Messiah would be the Son of God. In their view it denoted, also, that he would be \"divine,\" or equal to the Father, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 10:31-36",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". To claim that title was therefore, in their view, \"blasphemy;\" and as they had determined beforehand in their own minds that he was not the Messiah, they were ready at once to accuse him of blasphemy. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Mt 26:57-75. Jesus Arraigned before the Sanhedrim Condemned to Die, and Shamefully Entreated—The Denial of Peter. ( = Mr 14:53-72; Lu 22:54-71; Joh 18:13-18, 24-27).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "For the exposition, see on [1366]Mr 14:53-72.   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ver. 62,63. Mark speaks to the same purpose, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Mark 14:60,61",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 14:60",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",61",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". The high priest expected a long defence, and so to have had matter of accusation against him out of his own mouth. Christ disappointeth him, saying nothing at all, either out of modesty, or not thinking what they said of any moment, or worthy of any reply, or perhaps seeing that they could not agree in their tale, so as what they said was of no force against him. The high priest therefore comes at last to examine him, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ex officio.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Mark saith, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Mark 14:61",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 14:61",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Again the high priest asked him, and said unto him, Art thou the Christ, the Son of the Blessed.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Luke, to give us the story of Peter, from his first coming into the high priest’s hall to his going out, entire, interrupts himself a little in his relation of their dealings with Christ, and then relates some indignities offered him which the other evangelists do not mention; which seem to have been offered him where the soldiers and the rabble had been before he appeared in the council: ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Luke 22:63-67",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 22:63-67",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And the men that held Jesus mocked him, and smote him. And when they had blindfolded him, they struck him on the face, and asked him, saying, Prophesy, who is it that smote thee? And many other things blasphemously spake they against him. And as soon as it was day, the elders of the people, and the chief priests, and the scribes came together, and led him into their council.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Then he mentions nothing of what the witnesses said, possibly because it was nothing of moment, nothing upon which they proceeded against our Saviour for his life, but goes on, saying, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Art thou the Christ? tell us.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Matthew saith, Art thou the Christ, the Son of the living God? Mark, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the Son of the Blessed.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " It is plain both from this text, and from ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "John 1:49",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 1:49",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", that the Jews did expect a Messiah who should be the Son of the ever living and blessed God; but whether they understood that he should be the Son of God by nature and eternal generation, or only by a more special adoption, than the whole Jewish nation was, (to whom the apostle saith belonged the adoption), I cannot say. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I adjure thee that thou tell us, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that is, as some say, I charge thee upon thy oath to tell me; but it doth not appear that they had given any such oath to him, the guilty person was not wont to be forced by an oath to accuse himself, neither is it very probable that our Saviour would have taken such an oath. The sense therefore seemeth to be rather, I command, or require, or charge thee, as solemnly as if thou hadst taken an oath, (as in the presence of God), to tell us. Or, I charge thee with a terrible imprecation on thee, if thou speakest falsely, or wilt be silent, to declare if thou be the Christ, the Son of the living God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But Jesus held his peace,.... Knowing it would signify nothing, whatever he should say, they being set upon his death, the time of which was now come; and therefore he quietly submits, and says nothing in his own defence to prevent it. To be silent in a court of judicature, Apollonius Tyanaeus (c) says, is the fourth virtue; this Christ had, and all others: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the high priest answered and said unto him; though Christ had said nothing, a way of speaking very frequent among the Jews, and in the sacred writings: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I adjure thee by the living God, that thou tell us whether thou be the Christ, the Son of God; the Christ; the anointed, that David speaks of in the second Psalm, and who is there said to be the Son of God, Psalm 2:2, to which the high priest seems to have respect; since there is no other passage, in which both these characters meet; and which was understood by the ancient Jews of the Messiah, as is owned by modern ones (d). Jesus was given out to be the Messiah, and his disciples believed him to be the Son of God, and he had affirmed himself to be so; wherefore the high priest, exerting his priestly power and authority, puts him upon his oath; or at least with an oath made by the living God, charges him to tell the truth, and which when ever any heard the voice of swearing, he was obliged to do, Leviticus 5:1. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I adjure thee by the living God, that thou tell us whether thou be the Christ, the Son of God; the Christ; the anointed, that David speaks of in the second Psalm, and who is there said to be the Son of God, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 2:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", to which the high priest seems to have respect; since there is no other passage, in which both these characters meet; and which was understood by the ancient Jews of the Messiah, as is owned by modern ones (d). Jesus was given out to be the Messiah, and his disciples believed him to be the Son of God, and he had affirmed himself to be so; wherefore the high priest, exerting his priestly power and authority, puts him upon his oath; or at least with an oath made by the living God, charges him to tell the truth, and which when ever any heard the voice of swearing, he was obliged to do, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 5:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) Philostrat. Vita Apollouii, l. 8. c. 1.((d) Jarchi & Aben Ezra in Psal. ii. 1. & Kimchi in ver. 12. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(c) Philostrat. Vita Apollouii, l. 8. c. 1.((d) Jarchi & Aben Ezra in Psal. ii. 1. & Kimchi in ver. 12. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "But Jesus held his peace, And the high priest answered and said unto him, I adjure thee by the living God, that thou tell us whether thou be the Christ, the Son of God.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Meyer's NT Commentary",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 26:63",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The high priest ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "answers",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " this second refusal to speak by repeating a formal ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "oath",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in which Jesus is adjured to declare whether He be the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Messiah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or not. For ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "this",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " confession would determine how far they would be justified in pronouncing a capital sentence, and such as the Roman procurator would not fail to confirm.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐξορκίζω",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] means, like the earlier form ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἑξορκόω",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I call upon thee to swear",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Dem. 1265, 6; Polyb. iii. 61. 10, vi. 21. 1, xvi. 31. 5. Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "הִשְּׁבִּיעַ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 24:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", al. To give an affirmative answer to this formula was to take the full oath usually administered in any court of law. Michaelis, Mos. R. § 302; Matthaei, doctr. Christi de jurejur. 1847, p. 8; Keil, Arch. II. p. 256. The fact that Jesus took the oath has been denied, though without any reason whatever, by Wuttke, Döllinger, Steinmeyer.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "κατὰ τοῦ θεοῦ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "κ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "λ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".] by the living God. Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 3:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jdt 1:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; common in Greek authors, see Kühner, I. 1, p. 434; also ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 6:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and Bleek thereon. The living God as such would not fail to punish the perjured, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 10:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It was the uniform practice in courts of law to swear by God. See Saalschutz, M. R. p. 614.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὁ υἱὸς τοῦ θεοῦ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ordinary, recognised designation of the Messiah, into which, naturally enough, the metaphysical conception does not enter here, however much it may have been present to the mind of Christ Himself in making the affirmation which follows.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 26:63",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐσιώπα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": Jesus seeing the drift of the questions gave the high priest no assistance, but continued silent.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐξορκίζω",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐξορκόω",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " more common in classics). The high priest now takes a new line, seeing that there is no chance of conviction any other way. He puts Jesus on His oath as to the cardinal question of Messiahship.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "εἱ σὺ εἰ ὁ Χριστὸς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.: not two questions but one, Son of God being exegetical of the title Christ. If He was the one He was the other ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ipso facto",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 26:63",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ὁ Υἱὸς τοῦ Θεοῦ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the Son of God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Caiaphas, in common with the rest of his nation, did not entertain a merely political idea of the promised Messiah.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 63.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Jesus hold his peace;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἐσιώπα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "continued silent",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 27:12-14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). \"He was oppressed, and he was afflicted, yet he opened not his mouth,\" etc.  (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 53:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 38:13, 14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). He knew it was of no use, and was not the moment, to explain the mystery of the words which he had used. Indeed, it was unfair to ask him to explain the discrepancies in the alleged testimony. \"Attempts at defence were unprofitable, no man hearing. For this was a show only of a court of justice, but in truth an onset of robbers, assailing him without cause, as in a cave or on the road\" (St. Chysostom, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "in loc.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The case was best met by a majestic silence. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Answered",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Puzzled and embarrassed by Christ's persistent silence, Caiaphas at last proceeds to put to him a question which he must answer, and which must lead to some definite result. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "I adjure thee by the living God.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The high priest now addresses Jesus officially as the minister of Jehovah, and puts him under an oath to make an answer. To such an adjuration a reply was absolutely necessary, and the Law held a man guilty who kept silence under such circumstances (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 5:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The Christ, the Son of God.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " It is not to be supposed that Caiaphas by these words intended to imply that Messiah was one with God, of one nature, power, and eternity. It is not likely that he had risen above the popular Jewish conception of Messiah, which was of one inferior to God, though invested with certain Divine attributes. But he had heard that Jesus had more than once claimed God as his Father, so he now, as he hopes, will force a confession from the Prisoner's lips, which will set the question at rest one way or the other, and give him ground for decisive action, and enable him to denounce Christ either as an acknowledged impostor or a blasphemer. His language is, perhaps, based on the second psalm, vers. 2, 6, etc. Matthew 26:63",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "I adjure thee",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I call upon thee to swear. The high-priest put Christ upon oath.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "That (ἵνα)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In order that; signifying the design with which he adjured the Lord. ",
        "children": []
      }
    ]
  }
]