[[],[{"type":"header","content":"David’s Last Song"},{"type":"prose","content":"Now these are the last words of David."},{"type":"poetry","content":"David the son of Jesse declares,"},{"type":"poetry","content":"The man who was raised on high,"},{"type":"poetry","content":"The anointed of the God of Jacob"},{"type":"poetry","content":"And the sweet psalmist of Israel, declares,"}],[{"type":"poetry","content":"“The Spirit of the  spoke through me,"},{"type":"poetry","content":"And His word was on my tongue."}],[{"type":"poetry","content":"The God of Israel said ;"},{"type":"poetry","content":"The Rock of Israel spoke to me:"},{"type":"poetry","content":"‘He who rules over mankind righteously,"},{"type":"poetry","content":"Who rules  the fear of God,"}],[{"type":"poetry","content":"Is like the light of the morning  the sun rises,"},{"type":"poetry","content":"A morning without clouds,"},{"type":"poetry","content":" the fresh grass  out of the earth"},{"type":"poetry","content":"From sunshine after rain.’"}],[{"type":"poetry","content":"Is my house not indeed so with God?"},{"type":"poetry","content":"For He has made an everlasting covenant with me,"},{"type":"poetry","content":"Properly ordered in all things, and secured;"},{"type":"poetry","content":"For will He not indeed make"},{"type":"poetry","content":"All my salvation and all  delight grow?"}],[{"type":"poetry","content":"But the worthless, every one of them, are like scattered thorns,"},{"type":"poetry","content":"Because they cannot be taken in hand;"}],[{"type":"poetry","content":"Instead, the man  touches them"},{"type":"poetry","content":"Must be armed with iron and the shaft of a spear,"},{"type":"poetry","content":"And they will be completely burned with fire in  place.”"}],[{"type":"header","content":"David’s Mighty Men"},{"type":"prose","content":"These are the names of the mighty men whom David had: Josheb-basshebeth, a Tahchemonite, chief of the captains; he was  Adino the Eznite because of eight hundred who were killed  at one time."}],[{"type":"prose","content":"And after him was Eleazar the son of Dodo the Ahohite, one of the three mighty men with David when they defied the Philistines who were gathered there to battle and the men of Israel had withdrawn."}],[{"type":"prose","content":"He rose up and struck the Philistines until his hand was weary and it clung to the sword, and the LORD brought about a great victory that day; and the people returned after him only to plunder ."}],[{"type":"prose","content":"Now after him was Shammah the son of Agee, a Hararite. And the Philistines were gathered into an army where there was a plot of land full of lentils, and the people fled from the Philistines."}],[{"type":"prose","content":"But he took his stand in the midst of the plot, defended it, and struck the Philistines; and the LORD brought about a great victory."}],[{"type":"prose","content":"Then three of the thirty chief men went down and came to David at harvest time to the cave of Adullam, while the army of the Philistines was camping in the Valley of Rephaim."}],[{"type":"prose","content":"David was then in the stronghold, while the garrison of the Philistines was then in Bethlehem."}],[{"type":"prose","content":"And David had a craving and said, “Oh that someone would give me water to drink from the well of Bethlehem which is by the gate!”"}],[{"type":"prose","content":"So the three mighty men forced their way into the camp of the Philistines, and drew water from the well of Bethlehem which was by the gate, and carried  and brought  to David. Yet he would not drink it, but poured it out as an offering to the LORD;"}],[{"type":"prose","content":"and he said, “Far be it from me, LORD, that I would do this!  the blood of the men who went at  their lives?” So he would not drink it. These things the three mighty men did."}],[{"type":"prose","content":"Now Abishai, the brother of Joab, the son of Zeruiah, was chief of the thirty. And he swung his spear against three hundred and killed , and had a name as well as the three."}],[{"type":"prose","content":"He was the most honored among the thirty, so he became their commander; however, he did not attain to  of the three."}],[{"type":"prose","content":"Then Benaiah the son of Jehoiada, the son of a valiant man of Kabzeel, who had done great deeds, killed the two  Ariel of Moab. He also went down and killed a lion in the middle of a pit on a snowy day."}],[{"type":"prose","content":"And he killed an Egyptian, an impressive man. Now the Egyptian  a spear in his hand, but he went down to him with a club and snatched the spear from the Egyptian’s hand, and killed him with his own spear."}],[{"type":"prose","content":"These  Benaiah the son of Jehoiada did, and had a name as well as the three mighty men."}],[{"type":"prose","content":"He was honored among the thirty, but he did not attain  of the three. And David appointed him over his bodyguard."}],[{"type":"prose","content":"Asahel the brother of Joab was among the thirty;  Elhanan the son of Dodo of Bethlehem,"}],[{"type":"prose","content":"Shammah the Harodite, Elika the Harodite,"}],[{"type":"prose","content":"Helez the Paltite, Ira the son of Ikkesh the Tekoite,"}],[{"type":"prose","content":"Abiezer the Anathothite, Mebunnai the Hushathite,"}],[{"type":"prose","content":"Zalmon the Ahohite, Maharai the Netophathite,"}],[{"type":"prose","content":"Heleb the son of Baanah the Netophathite, Ittai the son of Ribai of Gibeah of the sons of Benjamin,"}],[{"type":"prose","content":"Benaiah a Pirathonite, Hiddai of the brooks of Gaash,"}],[{"type":"prose","content":"Abi-albon the Arbathite, Azmaveth the Barhumite,"}],[{"type":"prose","content":"Eliahba the Shaalbonite, the sons of Jashen, Jonathan,"}],[{"type":"prose","content":"Shammah the Hararite, Ahiam the son of Sharar the Ararite,"}],[{"type":"prose","content":"Eliphelet the son of Ahasbai, the son of the Maacathite, Eliam the son of Ahithophel the Gilonite,"}],[{"type":"prose","content":"Hezro the Carmelite, Paarai the Arbite,"}],[{"type":"prose","content":"Igal the son of Nathan of Zobah, Bani the Gadite,"}],[{"type":"prose","content":"Zelek the Ammonite, Naharai the Beerothite, armor bearers of Joab the son of Zeruiah,"}],[{"type":"prose","content":"Ira the Ithrite, Gareb the Ithrite,"}],[{"type":"prose","content":" Uriah the Hittite; thirty-seven in all."}]]