[{"header":"The Cities Solomon Built"},{"num":8,"verse":"It took 20 years for King Solomon to build the Lord’s Temple and the king’s palace."},{"num":2,"verse":"Then Solomon rebuilt the towns that Hiram gave him and then moved Israelites into those towns to live there."},{"num":3,"verse":"After this Solomon went to Hamath of Zobah and captured it."},{"num":4,"verse":"He also built the town of Tadmor in the desert. He built all the towns in Hamath to store things in."},{"num":5,"verse":"He rebuilt the towns of Upper Beth Horon and Lower Beth Horon. He made them into strong forts with strong walls, gates, and bars in the gates."},{"num":6,"verse":"He also rebuilt the town of Baalath and all the other towns where he stored things. He built all the cities where the chariots were kept and where the horse riders lived. Solomon built all he wanted in Jerusalem, Lebanon, and in all the country where he was king."},{"num":7,"verse":"There were many people left in the land who were not Israelites. There were Hittites, Amorites, Perizzites, Hivites, and Jebusites. The Israelites had not been able to destroy them, but Solomon forced them to work for him as slaves. They are still slaves today."},{"num":9,"verse":"Solomon did not force any of the Israelites to be his slaves. They were soldiers, government officials, officers, captains, and chariot commanders and drivers."},{"num":10,"verse":"There were 250 supervisors over Solomon’s projects. They supervised the men."},{"num":11,"verse":"Solomon brought Pharaoh’s daughter up from the City of David to the house he built for her. He said, “My wife must not live in King David’s palace because the places where the Lord’s Holy Box has been are holy places.”"},{"num":12,"verse":"Then Solomon offered burnt offerings to the Lord on the Lord’s altar. He built that altar in front of the Temple porch."},{"num":13,"verse":"Solomon offered sacrifices every day the way Moses commanded. Sacrifices were to be offered on Sabbath days, during New Moon celebrations, and at the three yearly festivals. The three yearly festivals were the Festival of Unleavened Bread, the Festival of Harvest, and the Festival of Shelters."},{"num":14,"verse":"Solomon followed his father David’s instructions. He chose the groups of priests for their service and the Levites for their duties. The Levites were to lead the praise and help the priests from day to day to do what needed to be done in the Temple service. And he chose the gatekeepers by their groups to serve at each gate. This is the way David, the man of God, instructed."},{"num":15,"verse":"The Israelites did not change or disobey any of Solomon’s instructions to the priests and Levites. They did not change any of the instructions, even in the way they should keep the valuable things."},{"num":16,"verse":"So Solomon completed his work on the Lord’s Temple. Work began the day they laid the foundation and continued without stopping until the day the Temple was finished."},{"num":17,"verse":"King Solomon also built ships at Ezion Geber. This town is near Elath on the shore of the Red Sea, in the land of Edom."},{"num":18,"verse":"Hiram sent ships to Solomon. Hiram’s own men sailed the ships. They were skilled at sailing on the sea. His men went with Solomon’s servants to Ophir and brought back 17 tons of gold to King Solomon."}]