[{"header":"Habakkuk Complains to God"},{"num":1,"verse":"This is the message that was given to Habakkuk the prophet."},{"num":2,"verse":"Lord, I continue to ask for help. When will you listen to me? I cried to you about the violence, but you did nothing!"},{"num":3,"verse":"People are stealing things and hurting others. They are arguing and fighting. Why do you make me look at these terrible things?"},{"num":4,"verse":"The law is weak and not fair to people. Evil people win their fights against good people. So the law is no longer fair, and justice does not win anymore."},{"header":"The Lord Answers Habakkuk"},{"num":5,"verse":"“Look at the other nations! Watch them, and you will be amazed. I will do something in your lifetime that will amaze you. You would not believe it even if you were told about it."},{"num":6,"verse":"I will make the Babylonians a strong nation. They are cruel and powerful fighters. They will march across the earth. They will take houses and cities that don’t belong to them."},{"num":7,"verse":"The Babylonians will scare the other people. They will do what they want to do and go where they want to go."},{"num":8,"verse":"Their horses will be faster than leopards and more dangerous than wolves at sunset. Their horse soldiers will come from faraway places. They will attack their enemies quickly, like a hungry eagle swooping down from the sky."},{"num":9,"verse":"The one thing they all want to do is fight. Their armies will march fast like the wind in the desert. And the Babylonian soldiers will take many prisoners—as many as the grains of sand."},{"num":10,"verse":"“The Babylonian soldiers will laugh at the kings of other nations. Foreign rulers will be like jokes to them. The Babylonian soldiers will laugh at the cities with tall, strong walls. They will simply build dirt roads up to the top of the walls and easily defeat the cities."},{"num":11,"verse":"Then they will leave like the wind and go on to fight against other places. The only thing the Babylonians worship is their own strength.”"},{"header":"Habakkuk’s Second Complaint"}]