[{"header":"Abraham’s Old Age and Descendants"},{"num":25,"verse":"Now Abraham took another wife—her name was Keturah. "},{"num":2,"verse":"She bore him Zimran, Jokshan, Medan, Midian, Ishbak and Shuah. "},{"num":3,"verse":"Jokshan fathered Sheba and Dedan. Dedan’s sons were Asshurim, Letushim and Leummim. "},{"num":4,"verse":"Midian’s sons were Ephah, Epher, Hanoch, Abida and Eldaah. All of these were Keturah’s sons. "},{"num":5,"verse":"Now Abraham gave everything that he had to Isaac, "},{"num":6,"verse":"but to the sons of Abraham’s concubines, Abraham had given gifts and sent them away from his son Isaac while he was still living, eastward to the land of the east."},{"num":7,"verse":"Now these are the days of the years of Abraham’s life that he lived: 175 years. "},{"num":8,"verse":"So Abraham breathed his last and died at a good old age, old and satisfied. Then he was gathered to his peoples. "},{"num":9,"verse":"Then Isaac and Ishmael his sons buried him in the cave of Machpelah in the field of Ephron son of Zohar the Hittite, next to Mamre, "},{"num":10,"verse":"the field that Abraham bought from the sons of Heth. There Abraham is buried along with Sarah his wife."},{"num":11,"verse":"After Abraham’s death, God blessed Isaac his son, and Isaac lived near Beer-lahai-roi."},{"num":12,"verse":"Now these are the genealogies of Ishmael, Abraham’s son, whom Hagar, Sarah’s Egyptian slave-girl, bore to Abraham. "},{"num":13,"verse":"These are the names of the sons of Ishmael, by their names according to their descendants: Ishmael’s firstborn, Nebaioth, then Kedar, Adbeel, Mibsam, "},{"num":14,"verse":"Mishma, Dumah, Massa, "},{"num":15,"verse":"Hadad, Tema, Jetur, Naphish and Kedem. "},{"num":16,"verse":"These are Ishmael’s sons and these are their names, by their unwalled and walled settlements, twelve princes according to their clans. "},{"num":17,"verse":"These are the years of Ishmael’s life: 137 years. He breathed his last, died and was gathered to his peoples. "},{"num":18,"verse":"Then they dwelled from Havilah to Shur, which is east of Egypt as you go toward Assyria. Over against all his brothers he fell."},{"header":"Esau and Jacob"},{"num":19,"verse":"Now these are the genealogies of Isaac, Abraham’s son. Abraham fathered Isaac. "},{"num":20,"verse":"Isaac was 40 years old when he took for himself Rebekah, the daughter of Bethuel the Aramean from Paddan-aram, the sister of Laban the Aramean, to be his wife. "},{"num":21,"verse":"Isaac prayed to Adonai on behalf of his wife because she was barren. Adonai answered his plea and his wife Rebekah became pregnant."},{"num":22,"verse":"But the children struggled with one another inside her, and she said, “If it’s like this, why is this happening to me?” So she went to inquire of Adonai. "},{"num":23,"verse":"Adonai said to her:"},{"num":24,"verse":"When her time came to give birth, indeed there were twins in her womb. "},{"num":25,"verse":"Now the first came out reddish, all of him was like a fur coat, and they named him Esau. "},{"num":26,"verse":"Afterward his brother came out with his hand holding onto Esau’s heel—so he was named Jacob. Isaac was 60 years old when he fathered them."},{"num":27,"verse":"When the boys grew up, Esau became a man knowledgeable in hunting, an outdoorsman, while Jacob was a mild man, remaining in tents. "},{"num":28,"verse":"Now Isaac loved Esau because he had a taste for wild game, but Rebekah loved Jacob."},{"num":29,"verse":"Now Jacob cooked a stew. When Esau came in from the field, he was exhausted, "},{"num":30,"verse":"so Esau said to Jacob, “Please feed me some of this really red stuff, because I’m exhausted”—that is why he is called Edom."},{"num":31,"verse":"So Jacob said, “Sell your birthright to me today.”"},{"num":32,"verse":"Esau said, “Look, I’m about to die. Of whatever use is this to me—a birthright?”"},{"num":33,"verse":"Jacob said, “Make a pledge to me now.”"},{"num":34,"verse":" Then Jacob gave Esau bread and lentil stew, and he ate and drank, then got up and left. So Esau despised his birthright."}]