[{"num":2,"verse":"On the twenty-first day of the seventh month, this word of Adonai came through Hagai the prophet: "},{"num":2,"verse":"“Speak now to Z’rubavel the son of Sh’alti’el, governor of Y’hudah, and to Y’hoshua the son of Y’hotzadak, the cohen hagadol, and to the rest of the people; say this to them: "},{"num":3,"verse":"‘“Who among you is left that saw this house in its former glory? And how does it look to you now? It seems like nothing to you, doesn’t it? "},{"num":4,"verse":"Nevertheless, Z’rubavel, take courage now,” says Adonai; “and take courage, Y’hoshua the son of Y’hotzadak, the cohen hagadol; and take courage, all you people of the land,” says Adonai; “and get to work! For I am with you,” says Adonai-Tzva’ot. "},{"num":5,"verse":"“This is in keeping with the word that I promised in a covenant with you when you came out of Egypt, and my Spirit remains with you, so don’t be afraid!” "},{"num":6,"verse":"For this is what Adonai-Tzva’ot says: “It won’t be long before one more time I will shake the heavens and the earth, the sea and the dry land; "},{"num":7,"verse":"and I will shake all the nations, so that the treasures of all the nations will flow in; and I will fill this house with glory,” says Adonai-Tzva’ot. "},{"num":8,"verse":"“The silver is mine, and the gold is mine,” says Adonai-Tzva’ot. "},{"num":9,"verse":"“The glory of this new house will surpass that of the old,” says Adonai-Tzva’ot, “and in this place I will grant shalom,” says Adonai-Tzva’ot.’”"},{"num":10,"verse":"On the twenty-fourth day of the ninth month in the second year of Daryavesh, this word of Adonai came through Hagai the prophet: "},{"num":11,"verse":"“Here is what Adonai-Tzva’ot says: ‘Ask the cohanim what the Torah says about this: "},{"num":12,"verse":"if someone carries meat that has been set aside as holy in a fold of his cloak; and then he lets his cloak touch bread, stew, wine, olive oil or any other food; does that food become holy too?’” The cohanim answered, “No.” "},{"num":13,"verse":"Then Hagai asked, “If someone who is unclean from having had contact with a corpse touches any of these [food items], will they become unclean?” The cohanim answered, “They become unclean.” "},{"num":14,"verse":"Hagai then said, “‘That is the condition of this people, that is the condition of this nation before me,’ says Adonai, ‘and that is the condition of everything their hands produce; so that anything they offer there is unclean. "},{"num":15,"verse":"Now, please, from this day on, keep this in mind: before you began laying stones on each other to rebuild the temple of Adonai, "},{"num":16,"verse":"throughout that whole time, when someone approached a twenty-measure pile [of grain], he found only ten; and when he came to the winepress to draw out fifty measures, there were only twenty. "},{"num":17,"verse":"I struck you with blasting winds, mildew and hail on everything your hands produced; but you still wouldn’t return to me,’ says Adonai. "},{"num":18,"verse":"‘So please keep this in mind, from this day on, from the twenty-fourth day of the ninth month, from the day the foundation of Adonai’s temple was laid, consider this: "},{"num":19,"verse":"there’s no longer any seed in the barn, is there? and the vine, fig tree, pomegranate tree and olive tree have produced nothing yet, right? However, from this day on, I will bless you.’”"},{"num":20,"verse":"The word of Adonai came a second time to Hagai on the twenty-fourth day of the month, as follows: "},{"num":21,"verse":"“Tell Z’rubavel, governor of Y’hudah, ‘I will shake the heavens and the earth, "},{"num":22,"verse":"I will overturn the thrones of kingdoms, I will destroy the strength of the kingdoms of the nations, and I will overturn the chariots and the people riding in them; the horses and their riders will fall, each by the sword of his brother. "},{"num":23,"verse":"When that day comes,’ says Adonai-Tzva’ot, ‘I will take you, Z’rubavel, my servant, the son of Sh’alti’el,’ says Adonai, ‘and wear you like a signet ring; for I have chosen you,’ says Adonai-Tzva’ot.”"}]