[{"num":1,"verse":"a second message came from the Lord. It came to Haggai the prophet. The message came on the 21st day of the seventh month. The Lord said, "},{"num":2,"verse":"“Speak to Zerubbabel, the governor of Judah and the son of Shealtiel. Also speak to Joshua the high priest, the son of Jozadak. And speak to all my people who are still left alive. Ask them, "},{"num":3,"verse":"‘Did any of you who are here see how beautiful this temple used to be? How does it look to you now? It doesn’t look so good, does it? "},{"num":4,"verse":"But be strong, Zerubbabel,’ announces the Lord. ‘Be strong, Joshua. Be strong, all of you people in the land,’ announces the Lord. ‘Start rebuilding. I am with you,’ announces the Lord who rules over all. "},{"num":5,"verse":"‘That is what I promised you when you came out of Egypt. My Spirit continues to be with you. So do not be afraid.’ ”"},{"num":6,"verse":"The Lord says, “In a little while I will shake the heavens and the earth once more. I will also shake the ocean and the dry land. "},{"num":7,"verse":"I will shake all the nations. Then what is desired by all nations will come to my temple. And I will fill the temple with glory,” says the Lord who rules over all. "},{"num":8,"verse":"“The silver belongs to me. So does the gold,” announces the Lord who rules over all. "},{"num":9,"verse":"“The new temple will be more beautiful than the first one was,” says the Lord. “And in this place I will bring peace,” announces the Lord who rules over all."},{"header":"The Lord Will Make His People Pure and “Clean”"},{"num":10,"verse":"A third message from the Lord came to Haggai the prophet. The message came on the 24th day of the ninth month of the second year that Darius was king. "},{"num":11,"verse":"The Lord who rules over all speaks. He says, “Ask the priests what the law says. "},{"num":12,"verse":"Suppose someone carries holy meat in the clothes they are wearing. And the clothes touch some bread or stew. Or they touch some wine, olive oil or other food. Then do these things also become holy?”"},{"num":13,"verse":"So Haggai said, “Suppose someone is made ‘unclean’ by touching a dead body. And then they touch one of these things. Does it become ‘unclean’ too?”"},{"num":14,"verse":"Then here is what Haggai said. “The Lord announces, ‘That is how I look at these people and this nation. Anything they do and anything they sacrifice on the altar is “unclean.”"},{"num":15,"verse":"“ ‘Think carefully about this from now on. Think about how things were before the Lord’s temple was built. This was before one stone was laid on top of another. "},{"num":16,"verse":"People went to get 20 measures of grain. But they could find only 10. They went to where the wine was stored to get 50 measures. But only 20 were there. "},{"num":17,"verse":"You worked very hard to produce all those things. But I struck them with rot, mold and hail. And you still did not return to me,’ announces the Lord. "},{"num":18,"verse":"It is the 24th day of the ninth month. From this day on, here is what you should think carefully about. Think about the day when the foundation of my temple was laid. "},{"num":19,"verse":"Are any seeds still left in your barns? Until now, your vines and fig trees have not produced any fruit. Your pomegranate and olive trees have not produced any either."},{"header":"The Lord Compares Zerubbabel to His Royal Ring"},{"num":20,"verse":"A final message from the Lord came to Haggai. This message also came on the 24th day of the ninth month. The Lord said, "},{"num":21,"verse":"“Speak to Zerubbabel, the governor of Judah. Tell him I am going to shake the heavens and the earth. "},{"num":22,"verse":"I will throw down royal thrones. I will smash the power of other kingdoms. I will destroy chariots and their drivers. Horses and their riders will fall. They will be killed by the swords of their relatives."},{"num":23,"verse":"“ ‘Zerubbabel, at that time I will pick you,’ announces the Lord. ‘You are my servant,’ announces the Lord. ‘You will be like a ring that has my royal mark on it. I have chosen you,’ announces the Lord who rules over all.”"}]