[{"header":"Job’s piety and life of bliss"},{"num":1,"verse":"A man in the land of Uz was named Job. That man was honest, a person of absolute integrity; he feared God and avoided evil."},{"num":2,"verse":"He had seven sons and three daughters,"},{"num":3,"verse":"and owned seven thousand sheep, three thousand camels, five hundred pairs of oxen, five hundred female donkeys, and a vast number of servants, so that he was greater than all the people of the east."},{"num":4,"verse":"Each of his sons hosted a feast in his own house on his birthday. They invited their three sisters to eat and drink with them."},{"num":5,"verse":"When the days of the feast had been completed, Job would send word and purify his children. Getting up early in the morning, he prepared entirely burned offerings for each one of them, for Job thought, Perhaps my children have sinned and then cursed God in their hearts. Job did this regularly."},{"header":"Job’s motives questioned"},{"num":6,"verse":"One day the divine beings came to present themselves before the Lord, and the Adversary also came among them."},{"num":7,"verse":"The Lord said to the Adversary, “Where did you come from?”"},{"num":8,"verse":"The Lord said to the Adversary, “Have you thought about my servant Job; surely there is no one like him on earth, a man who is honest, who is of absolute integrity, who reveres God and avoids evil?”"},{"num":9,"verse":"The Adversary answered the Lord, “Does Job revere God for nothing?"},{"num":10,"verse":"Haven’t you fenced him in—his house and all he has—and blessed the work of his hands so that his possessions extend throughout the earth?"},{"num":11,"verse":"But stretch out your hand and strike all he has. He will certainly curse you to your face.”"},{"num":12,"verse":"The Lord said to the Adversary, “Look, all he has is within your power; only don’t stretch out your hand against him.” So the Adversary left the Lord’s presence."},{"header":"Job passes the test"},{"num":13,"verse":"One day Job’s sons and daughters were eating and drinking wine in their oldest brother’s house."},{"num":14,"verse":"A messenger came to Job and said: “The oxen were plowing, and the donkeys were grazing nearby"},{"num":15,"verse":"when the Sabeans took them and killed the young men with swords. I alone escaped to tell you.”"},{"num":16,"verse":"While this messenger was speaking, another arrived and said: “A raging fire fell from the sky and burned up the sheep and devoured the young men. I alone escaped to tell you.”"},{"num":17,"verse":"While this messenger was speaking, another arrived and said: “Chaldeans set up three companies, raided the camels and took them, killing the young men with swords. I alone escaped to tell you.”"},{"num":18,"verse":"While this messenger was speaking, another arrived and said: “Your sons and your daughters were eating and drinking wine in their oldest brother’s house,"},{"num":19,"verse":"when a strong wind came from the desert and struck the four corners of the house. It fell upon the young people, and they died. I alone escaped to tell you.”"},{"num":20,"verse":"Job arose, tore his clothes, shaved his head, fell to the ground, and worshipped."},{"num":21,"verse":"He said: “Naked I came from my mother’s womb; naked I will return there. The Lord has given; the Lord has taken; bless the Lord’s name.”"},{"num":22,"verse":"In all this, Job didn’t sin or blame God."}]