[{"header":"The Prologue"},{"num":1,"verse":"There was a man in the land of Uz whose name was Job. That man was blameless and upright, fearing God and avoiding evil. "},{"num":2,"verse":"Seven sons and three daughters were born to him. "},{"num":3,"verse":"His possessions were seven thousand sheep, three thousand camels, five hundred yoke of oxen, five hundred female donkeys, and very many servants. This man was the greatest of all the people of the East."},{"num":4,"verse":"His sons used to go and make a feast in the house of each on his day, and they would send and call for their three sisters to eat and drink with them. "},{"num":5,"verse":"Now when the days of feasting had run their course, Job sent and sanctified them. He would rise up early in the morning, and he would offer burnt offerings according to the number of them all, because Job said: “It may be that my sons have sinned, and cursed God in their hearts.” Thus Job would do always."},{"num":6,"verse":"Now there was a day when the sons of God came to present themselves before the Lord, and the Adversary also came among them. "},{"num":7,"verse":"And the Lord said to the Adversary, “From where have you come?”"},{"num":8,"verse":"And the Lord said to the Adversary, “Have you considered My servant Job, that there is none like him on the earth, a blameless and an upright man, who fears God, and avoids evil?”"},{"num":9,"verse":"Then the Adversary answered the Lord, saying, “Has Job feared God for nothing? "},{"num":10,"verse":"Have You not made a hedge around him, around his household, and around all that he has on every side? You have blessed the work of his hands, and his possessions have increased in the land. "},{"num":11,"verse":"But stretch out Your hand now, and touch all that he has, and he will curse You to Your face.”"},{"num":12,"verse":"The Lord said to the Adversary, “Look, all that he has is in your power; only do not stretch out your hand against his person.”"},{"num":13,"verse":"So a day came when his sons and his daughters were eating and drinking wine in their eldest brother’s house, "},{"num":14,"verse":"and a messenger came to Job and said, “The oxen were plowing, and the donkeys were feeding beside them, "},{"num":15,"verse":"and the Sabeans attacked them, and took them away, and they killed the servants with the edge of the sword, and only I alone have escaped to tell you.”"},{"num":16,"verse":"While he was still speaking, another came and said, “The fire of God fell from heaven and burned up the sheep and the servants and consumed them, and I alone have escaped to tell you.”"},{"num":17,"verse":"While he was still speaking, another came and said, “The Chaldeans formed three companies and made a raid on the camels and have taken them away. They killed the servants with the edge of the sword, and I alone have escaped to tell you.”"},{"num":18,"verse":"While he was still speaking, another came and said, “Your sons and your daughters were eating and drinking wine in their eldest brother’s house, "},{"num":19,"verse":"and suddenly a great wind came from the wilderness and struck the four corners of the house, and it fell on the young people, and they are dead; and I alone have escaped to tell you.”"},{"num":20,"verse":"Then Job stood up, tore his robe, and shaved his head. He fell to the ground and worshipped. "},{"num":21,"verse":"He said,"},{"num":22,"verse":"In all this Job did not sin, and he did not accuse God of wrongdoing."}]