[{"header":"Job, the Good Man"},{"num":1,"verse":"A man named Job lived in the land of Uz. He was an honest and innocent man; he honored God and stayed away from evil. "},{"num":2,"verse":"Job had seven sons and three daughters. "},{"num":3,"verse":"He owned seven thousand sheep, three thousand camels, five hundred teams of oxen, and five hundred female donkeys. He also had a large number of servants. He was the greatest man among all the people of the East."},{"num":4,"verse":"Job’s sons took turns holding feasts in their homes and invited their sisters to eat and drink with them. "},{"num":5,"verse":"After a feast was over, Job would send and have them made clean. Early in the morning Job would offer a burnt offering for each of them, because he thought, “My children may have sinned and cursed God in their hearts.” Job did this every time."},{"header":"Satan Appears Before the Lord"},{"num":6,"verse":"One day the angels came to show themselves before the Lord, and Satan was with them. "},{"num":7,"verse":"The Lord said to Satan, “Where have you come from?”"},{"num":8,"verse":"Then the Lord said to Satan, “Have you noticed my servant Job? No one else on earth is like him. He is an honest and innocent man, honoring God and staying away from evil.”"},{"num":9,"verse":"But Satan answered the Lord, “Job honors God for a good reason. "},{"num":10,"verse":"You have put a wall around him, his family, and everything he owns. You have blessed the things he has done. His flocks and herds are so large they almost cover the land. "},{"num":11,"verse":"But reach out your hand and destroy everything he has, and he will curse you to your face.”"},{"num":12,"verse":"The Lord said to Satan, “All right, then. Everything Job has is in your power, but you must not touch Job himself.” Then Satan left the Lord’s presence."},{"num":13,"verse":"One day Job’s sons and daughters were eating and drinking wine together at the oldest brother’s house. "},{"num":14,"verse":"A messenger came to Job and said, “The oxen were plowing and the donkeys were eating grass nearby, "},{"num":15,"verse":"when the Sabeans attacked and carried them away. They killed the servants with swords, and I am the only one who escaped to tell you!”"},{"num":16,"verse":"The messenger was still speaking when another messenger arrived and said, “Lightning from God fell from the sky. It burned up the sheep and the servants, and I am the only one who escaped to tell you!”"},{"num":17,"verse":"The second messenger was still speaking when another messenger arrived and said, “The Babylonians sent three groups of attackers that swept down and stole your camels and killed the servants. I am the only one who escaped to tell you!”"},{"num":18,"verse":"The third messenger was still speaking when another messenger arrived and said, “Your sons and daughters were eating and drinking wine together at the oldest brother’s house. "},{"num":19,"verse":"Suddenly a great wind came from the desert, hitting all four corners of the house at once. The house fell in on the young people, and they are all dead. I am the only one who escaped to tell you!”"},{"num":20,"verse":"When Job heard this, he got up and tore his robe and shaved his head to show how sad he was. Then he bowed down to the ground to worship God. "},{"num":21,"verse":"He said:"},{"num":22,"verse":"In all this Job did not sin or blame God."}]