[{"num":1,"verse":"In the land of Uz was a man that was called Job; and that man was simple, that is, without guile, and rightful, and dreading God, and going away from evil. (In the land of Uz there was a man who was called Job; and that man was without guile, and upright, and feared God/and revered God, and went away from evil.)"},{"num":2,"verse":"And there were seven sons and three daughters born to him;"},{"num":3,"verse":"and his possession was seven thousand of sheep, and three thousand of camels, and five hundred yokes of oxen, and five hundred of female asses (and five hundred female donkeys), and full much household; and this Job was a great man among all the men of the east."},{"num":4,"verse":"And his sons went, and made feasts by their houses, each man in his day; and they sent, and called their three sisters, to eat, and to drink wine with them. (And his sons held feasts at their houses, each one in his turn; and they sent, and called their three sisters, to come and eat, and drink wine with them.)"},{"num":5,"verse":"And when the days of feast had passed into the world, that is, in(to) the end of the week, Job sent to them, and hallowed them, and he rose early, and offered burnt sacrifices by all (And when the days of feasting had ended, Job sent for them, and sanctified them, and he rose up early, and offered burnt sacrifices for all of them). For he said, Lest peradventure my sons do sin, and curse God in their hearts [Forsooth he said, Lest peradventure my sons sin, and bless to God in their hearts]. Job did so in all (the) days."},{"num":6,"verse":"And in a day, when the sons of God were come to be present before the Lord, also Satan came among them. (Now on a day, when the sons of God came and were present before the Lord, Satan also came among them.)"},{"num":7,"verse":"To whom the Lord said, From whence comest thou? And Satan answered, and said, I have compassed the earth, and I have walked through it. (To whom the Lord said, Where did you come from? And Satan answered, I have gone all around the earth, and I have walked throughout it.)"},{"num":8,"verse":"And the Lord said to him, Whether thou hast beheld my servant Job, that there is no man in [the] earth like him; he is a simple man, and rightful, and dreading God, and going away from evil? (And the Lord said to him, Hast thou seen my servant Job? There is no man on earth like him; yea, he is without guile, and upright, and feareth God/and revereth God, and goeth away from evil.)"},{"num":9,"verse":"To whom Satan answered, Whether Job dreadeth God vainly? (To whom Satan answered, Hast not Job good reason to fear God?/to revere God?)"},{"num":10,"verse":"Whether thou hast not (en)compassed him, and his house(hold), and all his chattel by compass? (Hast thou not surrounded him, and his family, and all his possessions, with protection?) Thou hast blessed the works of his hands, and his possession is increased on [the] earth."},{"num":11,"verse":"But stretch forth thine hand a little, and touch thou all things that he hath in possession, taking them away, or extinguishing them; and if he curse not thee in the face, he is verily simple, and rightwise, and dreading thee (and then if he shall not curse thee to thy face, he is truly without guile, and righteous, and feareth thee/and revereth thee)."},{"num":12,"verse":"Therefore the Lord said to Satan, Lo! all things, which he hath, be in thine hand; only stretch thou not forth thine hand into him. And Satan went out from the face of the Lord. (And so the Lord said to Satan, Lo! everything which he hath, is in thy power; only stretch not forth thy hand onto him. And Satan went out from before the Lord.)"},{"num":13,"verse":"And when in a day the sons of Job and his daughters ate, and drank wine in the house of their first begotten brother, (And so one day, when Job’s sons and daughters ate, and drank wine in the house of their first-born brother,)"},{"num":14,"verse":"a messenger came to Job, and said to him, Thine oxen eared, and thy female asses [were] pastured beside them; (a messenger came to Job, and said to him, Thy oxen plowed, and thy female donkeys were pastured beside them;)"},{"num":15,"verse":"and (the) Sabeans felled in, and took away all (thy) things, and smited the servants with sword (and struck down thy servants with their swords); and I alone escaped to tell this to thee."},{"num":16,"verse":"And when he spake yet, another came, and said, [The] Fire of God came down from heaven, and wasted [the] sheep, and [the] servants touched; and I alone escaped for to tell to thee. (And while he still spoke, another messenger came, and said, The fire of God came down from the heavens, and destroyed the sheep, and torched the servants; and I alone escaped to tell this to thee.)"},{"num":17,"verse":"But yet the while he spake, also another came, and said, Chaldees made three companies, and assailed the camels, and took those away, and they smited also the servants with sword; and I alone escaped to tell to thee. (And while he still spoke, also another came, and said, The Chaldeans made three companies, and assailed the camels, and took them away, and they also struck down thy servants with their swords; and I alone escaped to tell this to thee.)"},{"num":18,"verse":"And yet while he spake, lo! another entered, and said, While thy sons and daughters ate, and drank wine in the house of their first begotten brother, (And while he still spoke, lo! another entered, and said, While thy sons and daughters ate, and drank wine in the house of their first-born brother,)"},{"num":19,"verse":"a great wind felled in suddenly from the coast of (the) desert, and shook [the] four corners of the house, which felled down, and (it) oppressed thy children, and they be dead (and they all died); and I alone fled to tell (this) to thee."},{"num":20,"verse":"Then Job rose up, and he rent his clothes, and when his head was polled, he felled down upon the earth, and he worshipped God, (Then Job rose up, and he tore his clothes, and when his head was shaved, he fell down on the ground, and he worshipped God,)"},{"num":21,"verse":"and said, I went naked out of the womb of my mother, and naked I shall turn again thither; the Lord gave, and the Lord hath taken away; as it pleased the Lord, so be it done; the name of the Lord be blessed (blessed be the name of the Lord)."},{"num":22,"verse":"In all these things Job sinned not in his lips, neither spake any folly thing against God. (And in all these things Job did not sin with his lips, nor spoke any foolish thing against God.)"}]