[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(17) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Mine eyes are upon all their ways.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The context shows that here also the thought is presented on its severer side. The sins of Israel have not escaped the all-seeing eye of Jehovah.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "16:14-21 The restoration from the Babylonish captivity would be remembered in place of the deliverance from Egypt; it also typified spiritual redemption, and the future deliverance of the church from antichristian oppression. But none of the sins of sinners can be hidden from God, or shall be overlooked by him. He will find out and raise up instruments of his wrath, that shall destroy the Jews, by fraud like fishers, by force like hunters. The prophet, rejoicing at the hope of mercy to come, addressed the Lord as his strength and refuge. The deliverance out of captivity shall be a figure of the great salvation to be wrought by the Messiah. The nations have often known the power of Jehovah in his wrath; but they shall know him as the strength of his people, and their refuge in time of trouble.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "This chastisement arises not from caprice, but is decreed upon full knowledge and examination of their doings. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "17. (Jer 32:19; Pr 5:21; 15:3).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "their iniquity—the cause of God's judgments on them.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " God is of purer eyes than that he can behold iniquity in any so as to approve it, and therefore though he be long patient, yet he will at last punish evil-doers; for his eyes behold them, their sins are open in his sight, and he particularly observeth men’s actions, that he may render unto every one according to his works. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "For mine eyes are upon all their ways,.... Not only which they may take to hide themselves from their enemies, and where they should be directed to find them; but their evil ways in which they walked, and which were the cause of their calamities; these, how secret soever they were, were under the eye of God, whose eyes are in every place, and upon all the ways of men, good and bad; though they might flatter themselves, as wicked men sometimes do, that the Lord sees them not, and does not take notice of their iniquities: but, that they might be assured of the contrary, it is added, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "they are not hid from my face, neither is their iniquity hid from mine eyes; neither their ways nor their works, their persons nor their actions, could be concealed from the Lord; none can hide himself in secret places, that they should not be seen by him; the darkness and the light are both alike to an omniscient God. The Targum is, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"their iniquities are not hid from before (or from, or the sight of) my Word;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the essential Word of God; see Hebrews 4:12. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "the essential Word of God; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 4:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "For mine eyes are upon all their ways: they are not hid from my face, neither is their iniquity hid from mine eyes.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Further account of the punishment foretold, with the reasons for the same. - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 16:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"Behold, I send for many fishers, saith Jahve, who shall fish them, and after will I send fore many hunters, who shall hunt them from every mountain and every hill, and out of the clefts of the rock. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 16:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". For mine eyes are upon all their ways, they are not hidden from me, neither is their iniquity concealed from mine eyes. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 16:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And first, I requite double their iniquity and their sin, because they defiled my land with the carcases of their detestables, and with their abominations they have filled mine inheritance. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 16:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Jahveh, my strength and my fortress, and my refuge in the day of trouble! Unto Thee shall the peoples come from the ends of the earth and say: But lies have our fathers inherited, vanity, and amidst them none profiteth at all. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 16:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Shall a man make gods to himself, which are yet no gods? ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 16:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Therefore, behold, I make them to know this once, I make them to know my hand and my might, and they shall know that my name is Jahveh.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Jeremiah 16:16-17",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 16:16-17",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Jeremiah 16:16-18 are a continuation of the threatening in Jeremiah 16:13, that Judah is to be cast out, but are directly connected with Jeremiah 16:15, and elucidate the expulsion into many lands there foretold. The figures of the fishers and hunters do not bespeak the gathering again and restoration of the scattered people, as Ven. would make out, but the carrying of Judah captive out of his land. This is clear from the second of the figures, for the hunter does not gather the animals together, but kills them; and the reference of the verses is put beyond a doubt by Jeremiah 16:17 and Jeremiah 16:18, and is consequently admitted by all other comm. The two figures signify various kinds of treatment at the hands of enemies. The fishers represent the enemies that gather the inhabitants of the land as in a net, and carry them wholesale into captivity (cf. Amos 4:2; Habakkuk 1:15). The hunters, again, are those who drive out from their hiding-places, and slay or carry captive such as have escaped from the cities, and have taken refuge in the mountains and ravines; cf. Jeremiah 4:29, Judges 6:2 1 Samuel 13:6. In this the idea is visibly set forth that none shall escape the enemy. שׁלה c. ל pers., send for one, cause him to come, as in Jeremiah 14:3 (send for water), so that there is no call to take ל according to the Aram. usage as sign of the accusative, for which we can cite in Jeremiah only the case in Jeremiah 40:2. The form דּוּגים (Chet.) agrees with Ezekiel 47:10, while the Keri, דּיּגים, is a formation similar to ציּדים. In the second clause רבּים is, like the numerals, made to precede the noun; cf. Proverbs 31:29; Psalm 89:51. - For the Lord knows their doings and dealings, and their transgressions are not hid from Him; cf. Jeremiah 23:24; Jeremiah 32:19. על for אל, indicating the direction. Their ways are not the ways of flight, but their course of action.",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 16:16-18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " are a continuation of the threatening in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 16:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", that Judah is to be cast out, but are directly connected with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 16:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and elucidate the expulsion into many lands there foretold. The figures of the fishers and hunters do not bespeak the gathering again and restoration of the scattered people, as Ven. would make out, but the carrying of Judah captive out of his land. This is clear from the second of the figures, for the hunter does not gather the animals together, but kills them; and the reference of the verses is put beyond a doubt by ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 16:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 16:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and is consequently admitted by all other comm. The two figures signify various kinds of treatment at the hands of enemies. The fishers represent the enemies that gather the inhabitants of the land as in a net, and carry them wholesale into captivity (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 4:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 1:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The hunters, again, are those who drive out from their hiding-places, and slay or carry captive such as have escaped from the cities, and have taken refuge in the mountains and ravines; cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 4:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 6:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 13:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". In this the idea is visibly set forth that none shall escape the enemy. שׁלה c. ל pers., send for one, cause him to come, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 14:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (send for water), so that there is no call to take ל according to the Aram. usage as sign of the accusative, for which we can cite in Jeremiah only the case in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 40:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The form דּוּגים (Chet.) agrees with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 47:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", while the Keri, דּיּגים, is a formation similar to ציּדים. In the second clause רבּים is, like the numerals, made to precede the noun; cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 31:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 89:51",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". - For the Lord knows their doings and dealings, and their transgressions are not hid from Him; cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 23:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 32:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". על for אל, indicating the direction. Their ways are not the ways of flight, but their course of action.",
            "children": []
          }
        ]
      }
    ]
  }
]