[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(19) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "O Lord, my strength, and my fortress.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The words speak of a returning confidence in the prophet’s mind, and find utterance in what is practically (though the Hebrew words are not the same) an echo of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 18:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or more closely of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 28:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 28:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 59:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Samuel 22:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The Gentiles shall come unto thee.—The sin and folly of Israel are painted in contrast with the prophet’s vision of the future. Then, in that far-off time of which other prophets had spoken (Micah 4:1; Isaiah 2:2), the Gentiles should come to Jerusalem, turning from the “vanities” they had inherited; and yet Israel, who had inherited a truer faith, was now abasing herself even to their level or below it. Israel had answered in the affirmative the question which seemed to admit only of an answer in the negative: “Shall a man make gods unto himself, and they are no gods?”",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "The Gentiles shall come unto thee.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The sin and folly of Israel are painted in contrast with the prophet’s vision of the future. Then, in that far-off time of which other prophets had spoken (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 4:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 2:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), the Gentiles should come to Jerusalem, turning from the “vanities” they had inherited; and yet Israel, who had inherited a truer faith, was now abasing herself even to their level or below it. Israel had answered in the affirmative the question which seemed to admit only of an answer in the negative: “Shall a man make gods unto himself, and they are no gods?”",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Jeremiah 16:19-20",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 16:19-20",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "O Lord, my strength ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— To support and comfort me; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "my fortress ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— To protect and shelter me; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and my refuge in the day of affliction ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— To whom I may flee for deliverance and consolation; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the Gentiles, the nations, shall come to thee from the ends of the earth ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— The prophet, shocked at the apostacy of Israel, and concerned for God’s honour, here comforts himself by looking forward to the time when even the Gentiles themselves should become sensible of the absurdity of their hereditary idolatry, and be converted to the acknowledgment of the one living and true God: and this remarkable and desirable event he predicts, the more emphatically to demonstrate the unreasonableness and folly of forsaking him for idols. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And shall say ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— That is, the Gentiles shall say, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Surely our fathers, our ancestors, have inherited lies, vanity, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — And did not receive the satisfaction they promised themselves and their children; we are now sensible of the folly and deception of their idolatrous worship, by which they were cheated to their ruin, and therefore we will entirely and for ever renounce it, and in all our wants address ourselves to the true God as our only refuge and protection. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Shall a man make gods unto himself?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " — Thus the prophet represents the Gentiles, when enlightened by the truth, as reasoning with themselves. Shall a man be so ignorant and foolish; so perfectly void of reason and discernment, as to make gods to himself, the creatures of his own fancy, the work of his own hands, which ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "are ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "really ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "no gods? ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Can a man be so infatuated, so entirely lost to human understanding, as to expect any divine blessing or favour from that which pretends to no divinity but what it first received from him? Observe, reader, that reformation is likely to be sincere and durable which results from a rational conviction of the gross absurdity which there is in sin, and the service of Satan.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "16:14-21 The restoration from the Babylonish captivity would be remembered in place of the deliverance from Egypt; it also typified spiritual redemption, and the future deliverance of the church from antichristian oppression. But none of the sins of sinners can be hidden from God, or shall be overlooked by him. He will find out and raise up instruments of his wrath, that shall destroy the Jews, by fraud like fishers, by force like hunters. The prophet, rejoicing at the hope of mercy to come, addressed the Lord as his strength and refuge. The deliverance out of captivity shall be a figure of the great salvation to be wrought by the Messiah. The nations have often known the power of Jehovah in his wrath; but they shall know him as the strength of his people, and their refuge in time of trouble.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "First - Before the return from exile.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I will recompense their iniquity ... double - The ordinary rule of the Law (Isaiah 40:2 note). Sin is twofold; there is the leaving of God's will undone, and the actual wrongdoing. And every punishment is twofold: first, there is the loss of the blessing which would have followed upon obedience, and secondly, the presence of actual misery.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I will recompense their iniquity ... double - The ordinary rule of the Law (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 40:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " note). Sin is twofold; there is the leaving of God's will undone, and the actual wrongdoing. And every punishment is twofold: first, there is the loss of the blessing which would have followed upon obedience, and secondly, the presence of actual misery.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Because they have defiled ... - Rather, \"because they have profaned My land with the carcases of their detestable things\" (their lifeless and hateful idols, the very touch of which pollutes like that of a corpse, Numbers 19:11); \"and hare filled My inheritance with their abominations.\" ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Because they have defiled ... - Rather, \"because they have profaned My land with the carcases of their detestable things\" (their lifeless and hateful idols, the very touch of which pollutes like that of a corpse, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 19:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); \"and hare filled My inheritance with their abominations.\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "19, 20. The result of God's judgments on the Jews will be that both the Jews when restored, and the Gentiles who have witnessed those judgments, shall renounce idolatry for the worship of Jehovah. Fulfilled partly at the return from Babylon, after which the Jews entirely renounced idols, and many proselytes were gathered in from the Gentiles, but not to be realized in its fulness till the final restoration of Israel (Isa 2:1-17).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " The prophet hearing God’s resolution, before he showed this people any mercy, to be avenged on them for their sins, leaves off speaking to him upon that argument; but applieth himself to God for mercy for himself, and, to confirm his faith in him, gives him names suited to his hopes in him, and which might declare his faith in him for the obtaining favour from him in an evil day; and comforteth himself with the thoughts of those good days that were coming, when not only the Jews should be again restored to their country, but the ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Gentiles",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " also from all parts of the world (whom also many of the Jews should accompany) should apply themselves to God, confessing that both they and their fathers, in their worshipping dumb idols, had but inherited lies and vanity, and things that were unprofitable. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "O Lord, my strength and my fortress,.... These are the words of the prophet, rising out of the temptation which beset him; casting off his impatience, diffidence, and unbelief; calling upon God, and exercising faith in him; having received the promise of the restoration of his people to their land, and a view of the future conversion of the Gentiles; which were a means of recovering his spiritual strength, of invigorating grace in him, and of encouraging him to exercise it in a lively manner; to go on in his duty constantly, and to bear affliction cheerfully and patiently; \"strength\" to do which he had from the Lord; and to whom he ascribes it; and whom he calls his \"fortress\", or strong hold; and such the Lord is to his people, a strong hold to prisoners of hope, and a strong tower or place of defence to all his saints: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and my refuge in the day of affliction; in which he now was, or saw was coming upon him, when he should be carried captive into Babylon; but God was his refuge, shelter, and protection, and to him he betook himself, where he was safe; and which was infinitely better to him than the mountains, hills, and holes of rocks, others would fly unto, Jeremiah 16:16. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and my refuge in the day of affliction; in which he now was, or saw was coming upon him, when he should be carried captive into Babylon; but God was his refuge, shelter, and protection, and to him he betook himself, where he was safe; and which was infinitely better to him than the mountains, hills, and holes of rocks, others would fly unto, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 16:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The Gentiles shall come unto thee from the ends of the earth; not the Jews, who were like to the Gentiles for their idolatries, and other wicked practices, and therefore so called, who should return from the several distant countries where they had been scattered, to their own land, and to the worship of God in it; but such who were really Gentiles, that should be converted, either at the time of the Babylonish captivity, and should come along with the Jews when they returned, and worship the Lord with them; or rather in Gospel times. And so Kimchi says this belongs to the times of the Messiah; when the Gospel was to be, and was preached among them, even to the ends of the earth; and many savingly came to Christ for righteousness and strength, for peace, pardon, salvation, and eternal life; and turned to him as to a strong hold, and fled to him for refuge, and laid hold on him, the hope set before them. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And shall say, surely our fathers have inherited lies, vanities, and things wherein there is no profit; meaning their idols, which did not give what their priests, and the abettors of them, promised; and so deceived their votaries, and disappointed them of their expectations, which became vain, and so were of no profit and advantage to them; a poor inheritance this, which they had possessed and enjoyed for many generations, which their children, now being convinced of, relinquish; for a false religion is not to be retained on this score, because the religion of ancestors, and of long possession with them. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And shall say, surely our fathers have inherited lies, vanities, and things wherein there is no profit; meaning their idols, which did not give what their priests, and the abettors of them, promised; and so deceived their votaries, and disappointed them of their expectations, which became vain, and so were of no profit and advantage to them; a poor inheritance this, which they had possessed and enjoyed for many generations, which their children, now being convinced of, relinquish; for a false religion is not to be retained on this score, because the religion of ancestors, and of long possession with them. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "O LORD, my {i} strength, and my fortress, and my refuge in the day of affliction, the Gentiles shall come to thee from the ends of the earth, and shall say, Surely our fathers have inherited {k} lies, vanity, and things in which there is no profit.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "O LORD, my ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{i}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " strength, and my fortress, and my refuge in the day of affliction, the Gentiles shall come to thee from the ends of the earth, and shall say, Surely our fathers have inherited ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{k}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " lies, vanity, and ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "things",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " in which ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "there is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " no profit.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(i) He wonders at the great mercy of God in this deliverance which will not only extend to the Jews but also to the Gentiles.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(k) Our fathers were most vile idolaters therefore it comes only of God's mercy that he performs his promise and has not utterly cast us off.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "my strength, and my strong hold",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The two Hebrew substantives are derivatives of the same root.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "vanity … no profit",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] See on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 2:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 2:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "19–21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". See introd. summary to section. For the thought in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Jeremiah 16:19",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 16:19",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 12:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " f. and for the interest felt by Jeremiah in the religious life of the heathen, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 2:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Hence Co. with Gi. accepts the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "v",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". as genuine.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 19.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "O Lord, my strength, and my fortress",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc. Jeremiah falls into the tone of the psalmists (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 18:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 28:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 59:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). All that is choicest and most permanent in Old Testament religion finds its adequate lyric expression in the Book of Psalms. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The Gentiles shall some unto thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The article, however, is not expressed. \"Nations.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a crowd of peoples, hitherto ignorant of the true God, shall hasten to the scene of Jehovah's great interposition; they have been convinced by Israel's unlooked-for restoration of the unique divinity of Jehovah. Jeremiah 16:19",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " In his cry to the Lord: My strength...in the day of trouble, which agrees closely with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 28:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 59:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 18:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Jeremiah utters not merely his own feelings, but those which would animate every member of his people. In the time of need the powerlessness of the idols to help, and so their vanity, becomes apparent. Trouble therefore drives to God, the Almighty Lord and Ruler of the world, and forces to bend under His power. The coming tribulation is to have this fruit not only in the case of the Israelites, but also in that of the heathen nations, so that they shall see the vanity of the idolatry they have inherited from their fathers, and be converted to the Lord, the only true God. How this knowledge is to be awakened in the heathen, Jeremiah does not disclose; but it may be gathered from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 16:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", from the deliverance of Israel, there announced, out of the heathen lands into which they had been cast forth. By this deliverance the heathen will be made aware both of the almighty power of the God of Israel and of the nothingness of their own gods. On הבל cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 2:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and with \"none that profiteth,\" cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 2:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 14:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 16:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the prophet confirms what the heathen have been saying. The question has a negative force, as is clear from the second clause. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 16:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " we have the Lord's answer to the prophets' confession in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 16:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Since the Jews are so blinded that they prefer vain idols to the living God, He will this time so show them His hand and His strength in that foretold chastisement, that they shall know His name, i.e., know that He alone is God in deed and in truth. Cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 12:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 3:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      }
    ]
  }
]