[{"num":12,"verse":"I beseech you therefore, brethren, by the mercies of God, to present your bodies a living sacrifice, holy, acceptable to God, which is your spiritual service. "},{"num":2,"verse":"And be not fashioned according to this world: but be ye transformed by the renewing of your mind, that ye may prove what is the good and acceptable and perfect will of God."},{"num":3,"verse":"For I say, through the grace that was given me, to every man that is among you, not to think of himself more highly than he ought to think; but so to think as to think soberly, according as God hath dealt to each man a measure of faith. "},{"num":4,"verse":"For even as we have many members in one body, and all the members have not the same office: "},{"num":5,"verse":"so we, who are many, are one body in Christ, and severally members one of another. "},{"num":6,"verse":"And having gifts differing according to the grace that was given to us, whether prophecy, let us prophesy according to the proportion of our faith; "},{"num":7,"verse":"or ministry, let us give ourselves to our ministry; or he that teacheth, to his teaching; "},{"num":8,"verse":"or he that exhorteth, to his exhorting: he that giveth, let him do it with liberality; he that ruleth, with diligence; he that showeth mercy, with cheerfulness."},{"num":9,"verse":"Let love be without hypocrisy. Abhor that which is evil; cleave to that which is good. "},{"num":10,"verse":"In love of the brethren be tenderly affectioned one to another; in honor preferring one another; "},{"num":11,"verse":"in diligence not slothful; fervent in spirit; serving the Lord; "},{"num":12,"verse":"rejoicing in hope; patient in tribulation; continuing stedfastly in prayer; "},{"num":13,"verse":"communicating to the necessities of the saints; given to hospitality. "},{"num":14,"verse":"Bless them that persecute you; bless, and curse not. "},{"num":15,"verse":"Rejoice with them that rejoice; weep with them that weep. "},{"num":16,"verse":"Be of the same mind one toward another. Set not your mind on high things, but condescend to things that are lowly. Be not wise in your own conceits. "},{"num":17,"verse":"Render to no man evil for evil. Take thought for things honorable in the sight of all men. "},{"num":18,"verse":"If it be possible, as much as in you lieth, be at peace with all men. "},{"num":19,"verse":"Avenge not yourselves, beloved, but give place unto the wrath of God: for it is written, Vengeance belongeth unto me; I will recompense, saith the Lord. "},{"num":20,"verse":"But if thine enemy hunger, feed him; if he thirst, give him to drink: for in so doing thou shalt heap coals of fire upon his head. "},{"num":21,"verse":"Be not overcome of evil, but overcome evil with good."}]