[{"num":12,"verse":"I BESEECH you therefore, brethren, by the mercy of God, that you present your bodies a living sacrifice, holy, pleasing unto God, your reasonable service."},{"num":2,"verse":"And be not conformed to this world; but be reformed in the newness of your mind, that you may prove what is the good, and the acceptable, and the perfect will of God."},{"num":3,"verse":"For I say, by the grace that is given me, to all that are among you, not to be more wise than it behoveth to be wise, but to be wise unto sobriety, and according as God hath divided to every one the measure of faith."},{"num":4,"verse":"For as in one body we have many members, but all the members have not the same office:"},{"num":5,"verse":"So we being many, are one body in Christ, and every one members one of another."},{"num":6,"verse":"And having different gifts, according to the grace that is given us, either prophecy, to be used according to the rule of faith;"},{"num":7,"verse":"Or ministry, in ministering; or he that teacheth, in doctrine;"},{"num":8,"verse":"He that exhorteth, in exhorting; he that giveth, with simplicity; he that ruleth, with carefulness; he that sheweth mercy, with cheerfulness."},{"num":9,"verse":"Let love be without dissimulation. Hating that which is evil, cleaving to that which is good."},{"num":10,"verse":"Loving one another with the charity of brotherhood, with honour preventing one another."},{"num":11,"verse":"In carefulness not slothful. In spirit fervent. Serving the Lord."},{"num":12,"verse":"Rejoicing in hope. Patient in tribulation. Instant in prayer."},{"num":13,"verse":"Communicating to the necessities of the saints. Pursuing hospitality."},{"num":14,"verse":"Bless them that persecute you: bless, and curse not."},{"num":15,"verse":"Rejoice with them that rejoice; weep with them that weep."},{"num":16,"verse":"Being of one mind one towards another. Not minding high things, but consenting to the humble. Be not wise in your own conceits."},{"num":17,"verse":"To no man rendering evil for evil. Providing good things, not only in the sight of God, but also in the sight of all men."},{"num":18,"verse":"If it be possible, as much as is in you, have peace with all men."},{"num":19,"verse":"Revenge not yourselves, my dearly beloved; but give place unto wrath, for it is written: Revenge is mine, I will repay, saith the Lord."},{"num":20,"verse":"But if thy enemy be hungry, give him to eat; if he thirst, give him to drink. For, doing this, thou shalt heap coals of fire upon his head."},{"num":21,"verse":"Be not overcome by evil, but overcome evil by good."}]