[[],[{"type":"header","content":"A Living Sacrifice to God"},{"type":"prose","content":"And so, dear brothers and sisters, I plead with you to give your bodies to God because of all he has done for you. Let them be a living and holy sacrifice—the kind he will find acceptable. This is truly the way to worship him."}],[{"type":"prose","content":"Don’t copy the behavior and customs of this world, but let God transform you into a new person by changing the way you think. Then you will learn to know God’s will for you, which is good and pleasing and perfect."}],[{"type":"prose","content":"Because of the privilege and authority God has given me, I give each of you this warning: Don’t think you are better than you really are. Be honest in your evaluation of yourselves, measuring yourselves by the faith God has given us."}],[{"type":"prose","content":"Just as our bodies have many parts and each part has a special function,"}],[{"type":"prose","content":"so it is with Christ’s body. We are many parts of one body, and we all belong to each other."}],[{"type":"prose","content":"In his grace, God has given us different gifts for doing certain things well. So if God has given you the ability to prophesy, speak out with as much faith as God has given you."}],[{"type":"prose","content":"If your gift is serving others, serve them well. If you are a teacher, teach well."}],[{"type":"prose","content":"If your gift is to encourage others, be encouraging. If it is giving, give generously. If God has given you leadership ability, take the responsibility seriously. And if you have a gift for showing kindness to others, do it gladly."}],[{"type":"prose","content":"Don’t just pretend to love others. Really love them. Hate what is wrong. Hold tightly to what is good."}],[{"type":"prose","content":"Love each other with genuine affection, and take delight in honoring each other."}],[{"type":"prose","content":"Never be lazy, but work hard and serve the Lord enthusiastically."}],[{"type":"prose","content":"Rejoice in our confident hope. Be patient in trouble, and keep on praying."}],[{"type":"prose","content":"When God’s people are in need, be ready to help them. Always be eager to practice hospitality."}],[{"type":"prose","content":"Bless those who persecute you. Don’t curse them; pray that God will bless them."}],[{"type":"prose","content":"Be happy with those who are happy, and weep with those who weep."}],[{"type":"prose","content":"Live in harmony with each other. Don’t be too proud to enjoy the company of ordinary people. And don’t think you know it all!"}],[{"type":"prose","content":"Never pay back evil with more evil. Do things in such a way that everyone can see you are honorable."}],[{"type":"prose","content":"Do all that you can to live in peace with everyone."}],[{"type":"prose","content":"Dear friends, never take revenge. Leave that to the righteous anger of God. For the Scriptures say,"}],[{"type":"prose","content":"Instead, "}],[{"type":"prose","content":"Don’t let evil conquer you, but conquer evil by doing good."}]]