[{"num":12,"verse":"I appeal to you, therefore, Achim b’Moshiach, through the rachamei Hashem (mercies of G-d), to present your geviyah (BERESHIS 47:18), all of your being as a korban chai (living sacrifice), kadosh (holy) and acceptable to Hashem (BERESHIS 8:21), which is your spiritual avodas kodesh service."},{"num":2,"verse":"Stop allowing yourself to be conformed to the Olam Hazeh, but be transformed by your hitkhadshut (regeneration, renewal) of your mind, so that you may ascertain what is the ratzon Hashem (the will of G-d), what is the good, acceptable, and perfect will of G-d."},{"num":3,"verse":"For I say to all who are among you through the chesed (unmerited favor, grace) given to me, that you should avoid a false sense of superiority in your thinking; rather exercise shlitah atzmi (self-control), thinking with seichel, as G-d has measured to each a measure of emunah."},{"num":4,"verse":"For just as in one body we have many members (natural capacities), and all the members do not have the same function,"},{"num":5,"verse":"So we all are one body in Moshiach, and are individually members one of another"},{"num":6,"verse":"Having matanot (gifts) which differ in accordance with the chesed (unmerited favor, grace) given to us. If we speak for G-d as nevi’im (prophets), it should be in proportion to the emunah given to us."},{"num":7,"verse":"If we offer particular acts of avodas kodesh service, it should be used in serving. One who functions as a rabbinic moreh should be active in teaching."},{"num":8,"verse":"One who imparts chizzuk (strengthening, encouragement) should be active in that avodas kodesh ministry. One who makes tzedakah (contributions) should do so with nedivut (generosity). The one in manhigut (leadership), with diligence. The one in bikkur cholim (visiting the sick) and gemilut chasadim (benevolence), with simcha."},{"num":9,"verse":"Let ahavah (agape) be without tzevi’ut (hypocrisy). Hate what is haRah, be devoted to what is tov."},{"num":10,"verse":"Show mishpochah (family) affection to one another in ahavah shel achvah (brotherly love). Be first in esteeming one another, in showing mutual respect."},{"num":11,"verse":"Be zealous without negligence; with bren (fervor, hitlahavut) be burning with the Ruach Hakodesh. With avodas kodesh serve Hashem."},{"num":12,"verse":"Have simcha in tikvah. Have zitzfleisch in tzoros. Keep davening tefillos."},{"num":13,"verse":"With a spirit of koinonia, keep the pushke full for the needs of the Kadoshim. Aspire to hachnosas orchim."},{"num":14,"verse":"Say a bracha on those who bring redifah (persecution) on you, let it be a bracha and not a kelalah (curse)."},{"num":15,"verse":"Join in simcha with those who rejoice, weep with those who weep."},{"num":16,"verse":"Think with a (spiritual) consensus in achdus harmony among yourselves. Do not cherish the thoughts of the ba’al gaavah (haughty person), but associate with the anavim (\"humble,\" YESHAYAH 29:19), with the lowly am ha’aretz; do not be chachamim (wise ones) in your own estimation [1:22]."},{"num":17,"verse":"Repay no one ra’a (evil) for ra’a (evil). Take into consideration what is haTov in the sight of everyone and do that. [MISHLE 3:4 TARGUM HASHIVIM]"},{"num":18,"verse":"If possible, so far as it depends on you, live in shalom with everyone."},{"num":19,"verse":"Do not take your own revenge, beloved, but give opportunity for G-d’s Charon Af (burning wrath), for it is written, LI NAKAM V’SHILEM (\"Vengeance is mine and recompense, repayment‖I am He who will repay, says Hashem\" DEVARIM 32:35)."},{"num":20,"verse":"\"But if your enemy is hungry, feed him; if he is thirsty, give him drink; for in so doing you will heap coals of fire on his head\" MISHLE 25:21-22."},{"num":21,"verse":"Do not be overcome by what is ra’a, but overcome haRah with haTov."}]