[{"header":"Be Dead to Self"},{"num":12,"verse":"I urge you therefore, brothers and sisters, by the mercies of God, to present your bodies as a living sacrifice—holy, acceptable to God—which is your spiritual service. "},{"num":2,"verse":"Do not be conformed to this world but be transformed by the renewing of your mind, so that you may discern what is the will of God—what is good and acceptable and perfect."},{"num":3,"verse":"For through the grace given me, I say to everyone among you not to think more highly of yourself than you ought to think—but to use sound judgment, as God has assigned to each person a measure of faith. "},{"num":4,"verse":"For just as we have many parts in one body—and all the parts do not have the same function—"},{"num":5,"verse":"so we, who are many, are one body in Messiah and everyone parts of one another. "},{"num":6,"verse":"We have gifts that differ according to the grace that was given to us—if prophecy, in proportion to our faith; "},{"num":7,"verse":"if service, in our serving; or the one who teaches, in his teaching; "},{"num":8,"verse":"or the one who exhorts, in his exhortation; the one who gives, in generosity; the one who leads, with diligence; the one who shows mercy, with cheerfulness."},{"num":9,"verse":"Let love be without hypocrisy—detesting what is evil, holding fast to the good. "},{"num":10,"verse":"Be tenderly devoted to one another in brotherly love; outdo one another in giving honor. "},{"num":11,"verse":"Do not be lagging in zeal; be fervent in spirit. Keep serving the Lord, "},{"num":12,"verse":"rejoicing in hope, enduring in distress, persisting in prayer, "},{"num":13,"verse":"contributing to the needs of the kedoshim, extending hospitality."},{"num":14,"verse":"Bless those who persecute you—bless and do not curse. "},{"num":15,"verse":"Rejoice with those who rejoice; weep with those who weep."},{"num":16,"verse":" Live in harmony with one another; do not be proud, but associate with the lowly. Do not be wise in your own eyes."},{"num":17,"verse":" Repay no one evil for evil; give thought to what is good in the eyes of all people. "},{"num":18,"verse":"If possible, so far as it depends on you, live in shalom with all people. "},{"num":19,"verse":"Never take your own revenge, loved ones, but give room for God’s wrath—for it is written, “Vengeance is Mine; I will repay,” says Adonai. "},{"num":20,"verse":"Rather, “If your enemy is hungry, feed him; if he is thirsty, give him a drink. For by doing so you will heap coals of fire upon his head.”"},{"num":21,"verse":" Do not be overcome by evil, but overcome evil with good."}]