[{"num":14,"verse":"Behold, a day of the Lord is coming when the spoil [taken from you] shall be divided [among the victors] in the midst of you."},{"num":2,"verse":"For I will gather all nations against Jerusalem to battle, and the city shall be taken and the houses rifled and the women ravished; and half of the city shall go into exile, but the rest of the people shall not be cut off from the city."},{"num":3,"verse":"Then shall the Lord go forth and fight against those nations, as when He fought in the day of battle."},{"num":4,"verse":"And His feet shall stand in that day upon the Mount of Olives, which lies before Jerusalem on the east, and the Mount of Olives shall be split in two from the east to the west by a very great valley; and half of the mountain shall remove toward the north and half of it toward the south."},{"num":5,"verse":"And you shall flee by the valley of My mountains, for the valley of the mountains shall reach to Azal, and you shall flee as you fled from before the earthquake in the days of Uzziah king of Judah; and the Lord my [Zechariah’s] God shall come, and all the holy ones [saints and angels] with Him."},{"num":6,"verse":"And it shall come to pass in that day that there shall not be light; the glorious and bright ones [the heavenly bodies] shall be darkened."},{"num":7,"verse":"But it shall be one continuous day, known to the Lord—not day and not night, but at evening time there shall be light."},{"num":8,"verse":"And it shall be in that day that living waters shall go out from Jerusalem, half of them to the eastern [Dead] Sea and half of them to the western [Mediterranean] Sea; in summer and in winter shall it be."},{"num":9,"verse":"And the Lord shall be King over all the earth; in that day the Lord shall be one [in the recognition and worship of men] and His name one."},{"num":10,"verse":"All the land shall be turned into a plain from Geba to Rimmon, [the Rimmon that is] south of Jerusalem. But Jerusalem shall remain lifted up on its site and dwell in its place, from Benjamin’s gate to the place of the First Gate, to the Corner Gate, and from the Tower of Hananel to the king’s winepresses."},{"num":11,"verse":"And it shall be inhabited, for there shall be no more curse or ban of utter destruction, but Jerusalem shall dwell securely."},{"num":12,"verse":"And this shall be the plague wherewith the Lord will smite all the peoples that have warred against Jerusalem: their flesh shall rot away while they stand upon their feet and their eyes shall corrode away in their sockets and their tongue shall decay away in their mouth."},{"num":13,"verse":"And in that day there shall be a great confusion, discomfiture, and panic among them from the Lord; and they shall seize each his neighbor’s hand, and the hand of the one shall be raised against the hand of the other."},{"num":14,"verse":"And Judah also shall fight at Jerusalem, and the wealth of all the nations round about shall be gathered together—gold and silver and apparel in great abundance."},{"num":15,"verse":"And as that plague on men, so shall be the plague on the horse, on the mule, on the camel, on the donkey, and on all the livestock and beasts that may be in those camps."},{"num":16,"verse":"And everyone who is left of all the nations which came against Jerusalem shall even go up from year to year to worship the King, the Lord of hosts, and to keep the Feast of Tabernacles or Booths."},{"num":17,"verse":"And it shall be that whoso of the families of the earth shall not go up to Jerusalem to worship the King, the Lord of hosts, upon them there shall be no rain."},{"num":18,"verse":"And if the family of Egypt does not go up to Jerusalem and present themselves, upon them there shall be no rain, but there shall be the plague with which the Lord will smite the nations that go not up to keep the Feast of Tabernacles."},{"num":19,"verse":"This shall be the consequent punishment of the sin of Egypt and the consequent punishment of the sin of all the nations that do not go up to keep the Feast of Tabernacles."},{"num":20,"verse":"In that day there shall be [written] upon the [little] bells on the horses, holy to the lord, and the pots in the Lord’s house shall be holy to the Lord like the bowls before the altar."},{"num":21,"verse":"Yes, every pot in all the houses of Jerusalem and in Judah shall be dedicated and holy to the Lord of hosts, and all who sacrifice may come and take of them and boil their sacrifices in them [and traders in such wares will no longer be seen at the temple]. And in that day there shall be no more a Canaanite [that is, any godless or unclean person, whether Jew or Gentile] in the house of the Lord of hosts."}]