[{"header":"The Lord Will Be King Over the Whole Earth"},{"num":14,"verse":"The day of the Lord is coming, Jerusalem. At that time your enemies will steal everything your people own. They will divide it up within your walls."},{"num":2,"verse":"The Lord will gather all the nations together. They will fight against Jerusalem. They’ll capture the city. Its houses will be robbed. Its women will be raped. Half of the people will be taken away as prisoners. But the rest of them won’t be taken. "},{"num":3,"verse":"Then the Lord will march out and fight against those nations. He will fight as on a day of battle. "},{"num":4,"verse":"On that day he will stand on the Mount of Olives. It’s east of Jerusalem. It will be split in two from east to west. Half of the mountain will move north. The other half will move south. A large valley will be formed. "},{"num":5,"verse":"The people will run away through that mountain valley. It will reach all the way to Azel. They’ll run away just as they ran from the earthquake when Uzziah was king of Judah. Then the Lord my God will come. All the holy ones will come with him."},{"num":6,"verse":"There won’t be any sunlight on that day. There will be no cold, frosty darkness either. "},{"num":7,"verse":"It will be a day unlike any other. It will be a day known only to the Lord. It won’t be separated into day and night. After that day is over, there will be light again."},{"num":8,"verse":"At that time water that gives life will flow out from Jerusalem. Half of it will run east into the Dead Sea. The other half will go west to the Mediterranean Sea. The water will flow in summer and winter."},{"num":9,"verse":"The Lord will be king over the whole earth. On that day there will be one Lord. His name will be the only name."},{"num":10,"verse":"The whole land south of Jerusalem will be changed. From Geba to Rimmon it will become like the Arabah Valley. But Jerusalem will be raised up high. It will be raised from the Benjamin Gate to the First Gate to the Corner Gate. It will be raised from the Tower of Hananel to the royal winepresses. And it will remain in its place. "},{"num":11,"verse":"People will live in it. Jerusalem will never be destroyed again. It will be secure."},{"num":12,"verse":"The Lord will punish all the nations that fought against Jerusalem. He’ll strike them with a plague. It will make their bodies rot while they are still standing on their feet. Their eyes will rot in their heads. Their tongues will rot in their mouths. "},{"num":13,"verse":"On that day the Lord will fill people with great panic. They will grab one another by the hand. And they’ll attack one another. "},{"num":14,"verse":"Judah will also fight at Jerusalem. The wealth of all the surrounding nations will be collected. Huge amounts of gold, silver and clothes will be gathered up. "},{"num":15,"verse":"The same kind of plague will strike the horses, mules, camels and donkeys. In fact, it will strike all the animals in the army camps."},{"num":16,"verse":"But some people from all the nations that have attacked Jerusalem will still be left alive. All of them will go up there to worship the King. He is the Lord who rules over all. Year after year these people will celebrate the Feast of Booths. "},{"num":17,"verse":"Some nations might not go up to Jerusalem to worship the King. If they don’t, they won’t have any rain. "},{"num":18,"verse":"The people of Egypt might not go up there to take part. Then they won’t have any rain either. That’s the plague the Lord will send on the nations that don’t go to celebrate the Feast of Booths. "},{"num":19,"verse":"Egypt will be punished. So will all the other nations that don’t celebrate the feast."},{"num":20,"verse":"On that day “Holy to the Lord” will be carved on the bells of the horses. The cooking pots in the Lord’s temple will be just like the sacred bowls in front of the altar for burnt offerings. "},{"num":21,"verse":"Every pot in Jerusalem and Judah will be set apart to the Lord. All those who come to offer sacrifices will get some of the pots and cook in them. At that time there won’t be any Canaanites in the Lord’s temple. He is the Lord who rules over all."}]