[{"num":14,"verse":"Pay attention. The day for the Eternal is coming, a day of judgment when your enemies will plunder your goods and divide them right in front of you. "},{"num":2,"verse":"For I am going to incite all the nations to battle against Jerusalem. The city will be surrounded and taken. The houses will be ransacked; all of your treasured possessions will be looted. Your wives and daughters will be raped. Half of the city will be forced into exile. The other half will remain in the city to pick up the pieces. "},{"num":3,"verse":"The Eternal One will join in the battle and fight against those enemy nations as your champion as He would on any day of any battle. "},{"num":4,"verse":"When that day comes, His feet will stand securely on the Mount of Olives, which sits east of Jerusalem. The mountain will quake under His weight and split in two, divided by a wide valley that runs east to west. Half of the mountain will retreat to the north, the other half to the south. "},{"num":5,"verse":"That valley will become your escape route because the valley of My mountains will lead as far as Azel, and you shall run as you ran from the earthquake that hit during the reign of King Uzziah of Judah. Once you are safe, the Eternal my God will come to you with all His holy ones."},{"num":6,"verse":"On that day, there will be no light, no cold or biting frost. "},{"num":7,"verse":"There will be a single, continuous day—a unique kind of day known only to the Eternal One—when night does not eclipse the day and when light shines through the evening. "},{"num":8,"verse":"On that day, living waters will stream out of Jerusalem. Half of them will flow to the eastern Dead Sea; the other half will descend the hills and cross the plains to join the western Mediterranean Sea. These waters will flow throughout the dry summer as they do in the wet winter. "},{"num":9,"verse":"And the Eternal will be crowned as King over all the earth. On that day, the Eternal will be one and His name will be one. "},{"num":10,"verse":"The mountainous land around Jerusalem will be turned into plains from Geba to Rimmon, south of the city. Jerusalem itself will then sit prominently in her place between Benjamin’s gate, the location of the first gate, and the corner gate; she’ll sit between Hananel’s Tower and the royal winepresses. "},{"num":11,"verse":"And Jerusalem will remain secure, bustling with residents, because she will never again be destined for destruction."},{"num":12,"verse":"Every nation that attempts to wage war against Jerusalem will be struck with a plague. The Eternal will infect them with a disease making their flesh decay even as they stand, their eyes decay in their sockets, and their tongues decay in their mouths. "},{"num":13,"verse":"When that horrible day arrives, the Eternal will provoke them to panic, so that in their confusion they will grab each other for safety and then turn and attack each other. "},{"num":14,"verse":"Even Judah will be forced to fight in Jerusalem. And the riches of all the surrounding enemy nations will be gathered together—gold, silver, and costly clothing piled deep. "},{"num":15,"verse":"Then the same disease that plagues the enemy forces will infect the horses, mules, camels, donkeys—whatever domesticated animals are in their battle camps."},{"num":16,"verse":"In days to come, all people who took up arms against Jerusalem and survived will make a choice: they will either journey to Jerusalem every year to keep the Feast of Booths and to worship the King—the Eternal, Commander of heavenly armies—"},{"num":17,"verse":"or the families of nations will refuse the journey to Jerusalem to adore the King, the Eternal, Commander of heavenly armies. The rains will never come to those who refuse the journey. "},{"num":18,"verse":"Even the family of people known as Egypt, if they do not come up to and travel through the gates of Jerusalem to present themselves to God, the Eternal will afflict them with the same plague of drought He’ll use to crush those nations who won’t keep the Feast of Booths. "},{"num":19,"verse":"This is the punishment Egypt and the enemy nations can expect if they refuse the journey to keep the Feast of Booths."},{"num":20,"verse":"On that day, every aspect of the land will be ritually pure. Engraved on the bells worn by horses will be the same phrase on the high priest’s turban: “Sacred to the Eternal One.” The cooking pots used in the house of the Eternal will be as sacred as those collection bowls used at the altar. "},{"num":21,"verse":"In fact every pot in Jerusalem and Judah will be treated as sacred to the Eternal, Commander of heavenly armies, so that anyone who offers a sacrifice may borrow them and use them to boil the meat of the sacrifice. In that day, no merchant will be found in the temple of the Eternal, Commander of heavenly armies."}]