[{"header":"Stephen Speaks about the God of Abraham"},{"num":7,"verse":"The head religious leader asked Stephen, “Are these things true?” "},{"num":2,"verse":"Stephen said, “My brothers and fathers, listen to me. The great God showed Himself to our early father Abraham while he lived in the country of Mesopotamia. This was before he moved to the country of Haran. "},{"num":3,"verse":"God said to him, ‘Leave your family and this land where you were born. Go to a land that I will show you.’ "},{"num":4,"verse":"He went from the land of the Chaldeans and lived in Haran. After his father died, he came to this country where you now live. "},{"num":5,"verse":"God did not give him any land to own, not even enough to put his feet on. But He promised that the land would be his and his children’s after him. At that time he had no children. "},{"num":6,"verse":"This is what God said, ‘Your children’s children will be living in a strange land. They will live there 400 years. They will be made to work without pay and will suffer many hard things. "},{"num":7,"verse":"I will say to that nation that it is guilty for holding them and making them work without pay. After that they will go free. They will leave that country and worship Me in this place.’"},{"num":8,"verse":"“He made a promise with Abraham. It was kept by a religious act of becoming a Jew. Abraham had a son, Isaac. On the eighth day Abraham took Isaac and had this religious act done to him. Isaac was the father of Jacob. Jacob was the father of our twelve early fathers."},{"num":9,"verse":"“The sons of Jacob sold Joseph to people from the country of Egypt because they were jealous of him. But God was with Joseph. "},{"num":10,"verse":"He helped him in all his troubles. He gave him wisdom and favor with Pharaoh, the king of Egypt. This king made Joseph leader over Egypt and over all the king’s house."},{"num":11,"verse":"“The time came when there was no food to eat in all the land of Egypt and Canaan. The people suffered much. Our early fathers were not able to get food. "},{"num":12,"verse":"Then Jacob heard there was food in Egypt. He sent our early fathers there the first time."},{"num":13,"verse":"“The second time they went to the country of Egypt, Joseph made himself known to his brothers. The family of Joseph became known to Pharaoh. "},{"num":14,"verse":"Joseph asked his father Jacob and all his family to come. There were seventy-five people in the family. "},{"num":15,"verse":"Jacob moved down to Egypt and died there. Our early fathers died there also. "},{"num":16,"verse":"They were brought back to the city of Shechem where they were buried. Abraham paid money for the grave from the sons of Hamor in Shechem."},{"header":"Stephen Speaks about the God of Moses"},{"num":17,"verse":"“The promise God had given Abraham was about to happen. At this time many more of our people were in the country of Egypt. "},{"num":18,"verse":"Then another man became king in Egypt. He was a king who did not know Joseph. "},{"num":19,"verse":"He was hard on our people and nation. He worked against our early fathers. He made them put their babies outside so they would die."},{"num":20,"verse":"“At that time Moses was born. He was beautiful in God’s sight. He was fed in his father’s house for three months. "},{"num":21,"verse":"Then he was put outside. Pharaoh’s daughter took him and cared for him as her own son. "},{"num":22,"verse":"Moses was taught in all the wisdom of the Egyptians. He became a powerful man in words and in the things he did. "},{"num":23,"verse":"When he was forty years old, he thought he should visit his brothers, the Jews. "},{"num":24,"verse":"He saw one of the Jews being hurt. Moses helped the Jew and killed the man from Egypt. "},{"num":25,"verse":"He thought his people would understand. He thought they knew God would let them go free by his help. But the people did not understand."},{"num":26,"verse":"“The next day Moses came to some Jews who were fighting. He tried to get them to stop. Moses said to the Jews, ‘Sirs, you are brothers. Why do you hurt each other?’ "},{"num":27,"verse":"One was beating his neighbor. He pushed Moses away and said, ‘Who made you a leader over us? Who said you could say who is guilty? "},{"num":28,"verse":"Do you want to kill me as you killed the man from Egypt yesterday?’ "},{"num":29,"verse":"When Moses heard that, he went as fast as he could to the country of Midian where he was a stranger. While he was there, he became the father of two sons. "},{"num":30,"verse":"Forty years passed and Moses was near Mount Sinai where no people live. There he saw an angel in the fire of a burning bush. "},{"num":31,"verse":"He was surprised and wondered when he saw it. He went up close to see it better. Then he heard the voice of the Lord speak to him. "},{"num":32,"verse":"‘I am the God of your fathers, the God of Abraham and of Isaac and of Jacob.’ Moses shook! He was so afraid he did not look at the bush."},{"num":33,"verse":"“Then the Lord said to him, ‘Take your shoes off your feet! The place where you are standing is holy ground. "},{"num":34,"verse":"I have seen My people suffer in the country of Egypt and I have heard their cries. I have come down to let them go free. So come now, I will send you back to Egypt.’"},{"num":35,"verse":"“The people had put Moses aside. They said, ‘Who made you a leader over us? Who said you are the one to say what is right or wrong?’ But God made this man a leader. Moses was the one who brought them out of the country of Egypt. This was done by the help of the angel who was in the burning bush. "},{"num":36,"verse":"This man led them. He did powerful works in Egypt and at the Red Sea. For forty years he led them in the desert."},{"num":37,"verse":"“Moses said to the Jews, ‘God will give you one who speaks for Him like me from among your brothers.’ "},{"num":38,"verse":"This is the man who was with the Jewish nation in the desert. The angel talked to him on Mount Sinai. Moses told it to our early fathers. He also received the living Words of God to give to us."},{"num":39,"verse":"“Our early fathers would not listen to him. They did not obey him. In their hearts they wanted to go back to the country of Egypt. "},{"num":40,"verse":"They said to Aaron, ‘Make us gods to go before us. We do not know what has happened to this Moses who led us out of Egypt.’"},{"num":41,"verse":"“In those days they made a calf of gold. They put gifts down in front of their god in worship. They were happy with what they had made with their hands. "},{"num":42,"verse":"But God turned from them and let them worship the stars of heaven. This is written in the book of the early preachers, ‘Nation of Jews, was it to Me you gave gifts of sheep and cattle on the altar for forty years in the desert? "},{"num":43,"verse":"No, you set up the tent to worship the god of Molock and the star of your god Rompha. You made gods to worship them. I will carry you away to the other side of the country of Babylon.’ "},{"header":"The Place of Worship and the House of God"},{"num":44,"verse":"“Our early fathers had the tent to worship in. They used it in the desert. God told Moses to make it like the plan which he had seen. "},{"num":45,"verse":"This was received by our early fathers. They brought it here when they won the wars with the people who were not Jews. It was when Joshua was our leader. God made those people leave as our early fathers took the land. The tent was here until the time of David. "},{"num":46,"verse":"David pleased God and wanted to build a house for worship for the God of Jacob. "},{"num":47,"verse":"But Solomon was the one who built the house of God for Him. "},{"num":48,"verse":"But the Most High does not live in buildings made by hands. The early preacher said, "},{"num":49,"verse":"’Heaven is the place where I sit and the earth is the place where I rest My feet. What house will you build Me?’ says the Lord. ‘Or what is My place of rest? "},{"num":50,"verse":"Did not My hands make all these things?’ "},{"header":"The Jews Are Hurt"},{"num":51,"verse":"“You have hard hearts and ears that will not listen to me! You are always working against the Holy Spirit. Your early fathers did. You do too. "},{"num":52,"verse":"Which of the early preachers was not beaten and hurt by your early fathers? They killed those who told of the coming of the One Right with God. Now you have handed Him over and killed Him. "},{"num":53,"verse":"You had the Law given to you by angels. Yet you have not kept it.”"},{"header":"Stephen Is Killed"},{"num":54,"verse":"The Jews and religious leaders listened to Stephen. Then they became angry and began to grind their teeth at him. "},{"num":55,"verse":"He was filled with the Holy Spirit. As he looked up to heaven, he saw the shining-greatness of God and Jesus standing at the right side of God. "},{"num":56,"verse":"He said, “See! I see heaven open and the Son of Man standing at the right side of God!” "},{"num":57,"verse":"They cried out with loud voices. They put their hands over their ears and they all pushed on him. "},{"num":58,"verse":"Then they took him out of the city and threw stones at him. The men who were throwing the stones laid their coats down in front of a young man named Saul. "},{"num":59,"verse":"While they threw stones at Stephen, he prayed, “Lord Jesus, receive my spirit.” "},{"num":60,"verse":"After that he fell on his knees and cried out with a loud voice, “Lord, do not hold this sin against them.” When he had said this, he died."}]