[{"header":"Stephen makes his defence from Israel’s history:"},{"num":1,"verse":"Then the High Priest said, “Is this statement true?”"},{"num":1,"verse":"And Stephen answered, “My brothers and my fathers, listen to me. Our glorious God appeared to our forefather Abraham while he was in Mesopotamia before he ever came to live in Haran, and said to him, ‘Get out of your country and from your relatives, and come to a land that I will show you.’"},{"num":4,"verse":"That was how he came to leave the land of the Chaldeans and settle in Haran. And it was from there after his father’s death that God moved him into this very land where you are living today. Yet God gave him no part of it as an inheritance, not a foot that he could call his own, and yet promised that it should eventually belong to him and his descendants—even though at the time he had no descendant at all. And this is the way in which God spoke to him: he told him that his descendants should live as strangers in a foreign land where they would become slaves and be ill-treated for four hundred years, ‘And the nation to whom they will be in bondage I will judge,’ said God: ‘and after that they shall come out and serve me in this place.’ “Further, he gave him the agreement of circumcision, so that when Abraham became the father of Isaac he circumcised him on the eighth day."},{"header":"Stephen’s defence:"},{"num":8,"verse":"“Isaac became the father of Jacob, and Jacob the father of the twelve patriarchs. Then the patriarchs in their jealousy of Joseph sold him as a slave into Egypt. But God was with him and saved him from all his troubles and gave him favour and wisdom in the eyes of Pharaoh the king of Egypt. Pharaoh made him governor of Egypt and put him in charge of his own entire household."},{"num":11,"verse":"“Then came the famine over all the land of Egypt and Canaan which caused great suffering, and our forefathers could find no food. But when Jacob heard that there was corn in Egypt he sent our forefathers out of their own country for the first time. It was on their second visit that Joseph was recognised by his brothers, and his ancestry became plain to Pharaoh. Then Joseph sent and invited to come and live with him his father and all his kinsmen, seventy-five people in all. So Jacob came down to Egypt and both he and our fathers ended their days there. After their deaths they were carried back into Shechem and laid in the tomb which Abraham had bought with silver from the sons of Hamor in Shechem."},{"num":17,"verse":"“But as the time drew near for the fulfilment of the promise which God had made to Abraham, our people grew more and more numerous in Egypt. Finally another king came to the Egyptian throne who knew nothing of Joseph. This man cleverly victimised our race. He treated our forefathers abominably, forcing them to expose our infant children so that the race should die out."},{"header":"Stephen’s defence:"},{"num":20,"verse":"“It was at this very time that Moses was born. He was a child of remarkable beauty, and for three months he was brought up in his father’s house, and then when the time came for him to be abandoned Pharaoh’s daughter adopted him and brought him up as her own son. So Moses was trained in all the wisdom of the Egyptians, and became not only an excellent speaker but a man of action as well."},{"header":"Moses’ first abortive attempt at rescue"},{"num":23,"verse":"“Now when he was turned forty the thought came into his mind that he should go and visit his own brothers, the sons of Israel. He saw one of them being unjustly treated, went to the rescue and paid rough justice for the man who had been ill-treated by striking down the Egyptian. He fully imagined that his brothers would understand that God was using him to rescue them. But they did not understand. Indeed, on the very next day he came upon two of them who were quarrelling and urged them to make peace, saying, ‘Men, you are brothers. What good can come from your injuring each other?’ But the man who was wronging his neighbour pushed Moses aside saying, ‘Who made you a ruler and judge over us? Do you want to kill me as you killed that Egyptian yesterday?’ At that retort Moses fled and lived as an exile in the land of Midian, where he became the father of two sons."},{"header":"Moses hears the voice of God"},{"num":30,"verse":"“It was forty years later in the desert of Mount Sinai that an angel appeared to him in the flames of a burning bush, and the sight filled Moses with wonder. As he approached to look at it more closely the voice of the Lord spoke to him, saying, ‘I am the God of your fathers—the God of Abraham, the God of Isaac, and the God of Jacob.’ Then Moses trembled and was afraid to look any more. But the Lord spoke to him and said, ‘Take your sandals off your feet, for the place where you stand is holy ground. I have certainly seen the oppression of my people who are in Egypt; I have heard their groaning and have come down to deliver them. And now come, I will send you to Egypt.’"},{"header":"But Israel rejects Moses"},{"num":35,"verse":"“So this same Moses whom they had rejected in the words, ‘Who made you a ruler and a judge?’ God sent to be both ruler and deliverer with the help of the angel who had appeared to him in the bush. This is the man who showed wonders and signs in Egypt and in the Red Sea, the man who led them out of Egypt and was their leader in the desert for forty years. He was Moses, the man who said to the sons of Israel, ‘The Lord your God will raise up for you a prophet like me from your brethren. Him you shall hear.’"},{"num":38,"verse":"In that church in the desert this was the man who was the mediator between the angel who used to talk with him on Mount Sinai and our fathers. This was the man who received words, living words, which were to be given to you; and this was the man to whom our forefathers turned a deaf ear! They disregarded him, and in their hearts hankered after Egypt. They said to Aaron, ‘Make us gods to go before us; as for this Moses who brought us out of Egypt, we do not know what has become of him.’"},{"num":41,"verse":"In those days they even made a calf, and offered sacrifices to their idol. They rejoiced in the work of their own hands. So God turned away from them and left them to worship the Host of Heaven, as it is written in the book of the prophets, ‘Did you offer me slaughtered animals and sacrifices during forty years in the wilderness, O house of Israel? Yes, you took up the tabernacle of Moloch, and the star of your god Remphan, images which you made to worship; and I will carry you away beyond Babylon.’"},{"header":"God’s privileges to Israel"},{"num":44,"verse":"“There in the desert our forefather possessed the Tabernacle of witness made according to the pattern which Moses saw when God instructed him to build it. This Tabernacle was handed down to our forefathers, and they brought it here when the Gentiles were defeated under Joshua, for God drove them out as our ancestors advanced. Here it stayed until the time of David. David won the approval of God and prayed that he might find a habitation for the God of Jacob, even though it was not he but Solomon who actually built a house for him. Yet of course the most high does not live in man-made houses. As the prophet says, ‘Heaven is my throne. and earth is my footstool. What house will you build for me? says the Lord, or what is the place of my rest? Has my hand not made all these things?’"},{"header":"Yet Israel is blind and disobedient"},{"num":51,"verse":"“You obstinate people, heathen in your thinking, heathen in the way you are listening to me now! It is always the same—you never fail to resist the Holy Spirit! Just as your fathers did so are you doing now. Can you name a single prophet whom your fathers did not persecute? They killed the men who long ago foretold the coming of the just one, and now in our own day you have become betrayers and his murderers. You are the men who have received the Law of God miraculously, by the hand of angels, and you are the men who have disobeyed it!”"},{"header":"The truth arouses murderous fury"},{"num":54,"verse":"These words stung them to fury and they ground their teeth at him in rage. Stephen, filled through all his being with the Holy Spirit, looked steadily up into Heaven. He saw the glory of God, and Jesus himself standing at his right hand."},{"num":56,"verse":"“Look!” he exclaimed, “the heavens are opened and I can see the Son of Man standing at God’s right hand!”"},{"num":57,"verse":"At this they put their fingers in their ears. Yelling with fury, as one man they made a rush at him and hustled him out of the city and stoned him. The witnesses of the execution flung their clothes at the feet of a young man by the name of Saul."},{"num":59,"verse":"So they stoned Stephen while he called upon God, and said, “Jesus, Lord, receive my spirit!”"},{"num":60,"verse":"Then, on his knees, he cried in ringing tones, “Lord, forgive them for this sin.” And with these words he fell into the sleep of death,"}]