[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(23) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "These were the potters.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Viz., the clans enumerated in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Chronicles 4:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And those that dwelt among plants and hedges.—Rather, and inhabitants of Net aim and Gederah. Netaim means “plantations” (Isaiah 17:10). Solomon had pleasure-gardens near Bethlehem. See also the notice of Uzziah’s farms and vineyards (2Chronicles 26:10). Gederah (Joshua 15:36), a town in the Shephelah.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "And those that dwelt among plants and hedges.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Rather, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "and inhabitants of Net aim and Gederah.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Netaim means “plantations” (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 17:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Solomon had pleasure-gardens near Bethlehem. See also the notice of Uzziah’s farms and vineyards (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2Chronicles 26:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Gederah (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 15:36",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), a town in the Shephelah.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "There they dwelt with the king.—Literally, with the king in his work they dwelt there. This seems to say that the potteries of Netaim and Gederah were a royal establishment, as those of Sevres used to be. Perhaps the linen-weaving of Beth-Ashbea (1Chronicles 4:21) should be included.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "There they dwelt with the king.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Literally, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "with the king in his work they dwelt there.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " This seems to say that the potteries of Netaim and Gederah were a royal establishment, as those of Sevres used to be. Perhaps the linen-weaving of Beth-Ashbea (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Chronicles 4:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") should be included.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1 Chronicles",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "THE KING’S POTTERS1 Chronicles 4:23",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "THE KING’S POTTERS",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 4:23",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " In these dry lists of names which abound in Chronicles, we now and then come across points of interest, oases in the desert, which need but to be pondered sympathetically to yield interesting suggestions. Here for example, buried in a dreary genealogical table, is a little touch which repays meditating on. Among the members of the tribe of Judah were a hereditary caste of potters who lived in ‘Netaim and Gederah,’ if we adhere to the Revised Version’s text, or ‘among plantations and hedges’ if we prefer the margin. But they are also described as dwelling ‘with the king.’ That can only mean on the royal estates, for the king himself resided in Jerusalem. He, however, held large domains in the territory of Judah, on some of which these ceramic artists were settled down and followed their calling. They were kept on the royal estates and kept in comfort, not needing to till, but fed and cared for, that they might be free to mould, out of common clay, forms of beauty and ‘vessels meet for the master’s use.’ Surely we may read into the brief statement of the text a meaning of which the writer of it never dreamt, and see in the description of these forgotten artisans, a symbol of our Christian relations to our Lord and of our life’s work.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. We, too, dwell with the King. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. We, too, dwell with the King.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The Davidic king was in Jerusalem, and the potters were ‘among plantations and hedges,’ yet in a real sense they ‘dwelt with the king,’ though some of them might never have seen his face or trod the streets of the sacred city. Perhaps now and then he came to visit them on his outlying domains, but they were always parts of his household. And have we, Christ’s servants, not His gracious parting word: ‘I am with you always’? True, we are not beside Him in the great city, but He is beside us in His outlying domains, and we may be with Him in His glory, if while we still outwardly live among the ‘plantations and hedges’ of this life, we dwell in spirit, by faith and aspiration, with our risen and ascended Lord. If we so ‘dwell with the King,’ He will dwell with us, and fill our humble abode with the radiance of His presence, ‘making that place of His feet glorious.’ That He should be with us is supreme condescension, that we should be with Him is the perfection of exaltation. How low He stoops, how high we can rise! The vigour of our Christian life largely depends on our keeping vivid the consciousness of our communion with Jesus and the sense of His real presence with us. How life’s burdens would be lightened if we faced them all in the strength of the felt nearness of our Lord! How impossible it would be that we should ever feel the dreary sense of solitude, if we felt that unseen, but most real, Presence wrapping us round! It is only when our faith in it has fallen asleep that any earthly good allures, or any earthly evil frightens us. To be sure, in our thrilling consciousness, that we dwell with Jesus is an impenetrable cuirass that blunts the points of all arrows and keeps the breast that wears it unwounded in the fray. The world has no voices which can make themselves heard above that low sovereign whisper: ‘I am with you always, even to the end of the world’-and after the end has come, then we shall be with Him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But we find in this notice a hint that leads us in yet another direction. They ‘dwelt with the king’ in the sense that they were housed and cared for on his lands. And in like manner, the true conception of the Christian life is that each of us is ‘a sojourner with Thee,’ set down on Christ’s domains, and looked after by Him in regard to provision for outward wants. We have nothing in property, but all is His and held by His gift and to be used for Him. The slave owns nothing. The patch of ground which he cultivates for his food and what grows on it, are his master’ s. These workmen were not slaves, but they were not owners either. And we hold nothing as our own, if we are true to the terms on which it is given us to hold.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So if we rightly appreciate our position as dwelling on the King’s lands, our delusion of possession will vanish, and we shall feel more keenly the pressure of responsibility while we feel less keenly the grip of anxiety. We are for the time being entrusted with a tiny piece of the royal estates. Let us not strut about as if we were owners, nor be for ever afraid that we shall not have enough for our needs. One sometimes comes on a model village close to the gates of some ducal palace, and notes how the lordly owner’s honour prompts its being kept up to a high standard of comfort and beauty. We may be sure that the potters were well lodged and looked after, and that care for their personal wants was shifted from their shoulders to the king’ s. So should ours be. He will not leave His servants to starve. They should not dishonour Him and disturb themselves by worries and cares that would be reasonable only if they had no Provider. He has said, ‘All things are given to Me of My Father,’ and He gives us all that God has given Him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. We dwell with the King for His work. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. We dwell with the King for His work.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The king’s potters had not to till the land nor do any work but to mould clay into vessels for use and beauty. For that purpose they had their huts and bits of ground assigned them. So with us, Christ has a purpose in His provision for us. We are set down on His domains, and we enjoy His presence and providing in order that, set free from carking cares and low ends, we may, with free and joyous hearts, yield ourselves to His joyful service. The law of our life should be that we please not ourselves, nor consult our own will in choosing our tasks, nor seek our own profit or gratification in doing them, but ever ask of Him: ‘Lord, what wilt Thou have me to do?’ and when the answer comes, as come it will to all who ask with real desire to learn and with real inclination to do His will, that we ‘make haste and delay not, but make haste to keep His commandments.’ The spirit which should animate our active lives is plainly enough taught us in that little word, they ‘dwelt with the king for his work.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Nor are we to forget that, in a very profound sense, dwelling with the King must go before doing His work. Unless we are living continually under the operation of the stimulus of communion with Jesus, we shall have neither quickness of ear to know what He wishes us to do, nor any resolute concentration of ourselves on our Christ-appointed tasks. The spring of all noble living is communion with noble ideals, and fellowship with Jesus sets men agoing, as nothing else will, in practical lives of obedience to Jesus. Time given to silent, retired meditation on that sweet, sacred bond that knits the believing soul to the redeeming Lord is not lost with reference to active work for Jesus. The meditative and the practical life are not antagonistic, but complementary, Mary and Martha are sisters, though sometimes they differ, and foolish people try to set them against each other.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But we must beware of a common misconception of what the King’s work is. The royal potters did not make only things of beauty, but very common vessels designed for common and ignoble uses. There were vessels of dishonour dried in their kilns as well as vessels ‘meet for the master’s use.’ There is a usual and lamentable narrowing of the term ‘Christian work,’ to certain conventional forms of service, which has done and is doing an immense amount of harm. The King’s work is far wider in scope than teaching in Sunday-schools, or visiting the sick, or any similar acts that are usually labelled with the name. It covers all the common duties of life. A shallow religion tickets some selected items with the name; a robuster, truer conception extends the designation to everything. It is not only when we are definitely trying to bring others into touch with Jesus that we are doing Him service, but we may be equally serving Him in everything. The difference between the king’s work and the poor potters’ own lay not so much in the nature as in the motive of it, and whatever we do for Christ’s sake and with a view to His will is work that He owns, while a regard to self in our motive or in our end decisively strikes any service tainted by it out of the category.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " We are to hallow all our deeds by drawing the motive for them from the King and by laying the fruits of them at His feet. Thus, and only thus, will the most ‘secular’ actions be sanctified and the narrowest life be widened to contain a present Christ.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " There are subsidiary motives which may legitimately blend with the supreme one. The potters would be stimulated to work hard and with their utmost skill when they thought of how well they were paid in house and store for their work. We have ample reasons for dedicating our whole selves to Jesus when we think of His gift of Himself to us, of His wages beforehand, of His joyful presence with His eye ever on us, marking our purity of motive and our diligence.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " There is a final thought that may well stimulate us to put all our skill and effort into our work. The potters’ work went to Jerusalem. It was for the king. What can be too good for him? He will see it, therefore let us put our best into it. And we shall see it too, when we too enter ‘the city of the great King.’ Jars that perhaps were wrought by these very workmen of whom we have been speaking turn up to-day in the excavations in Palestine. So much has perished and they remain, speaking symbols of the solemn truth that nothing human ever dies. Our ‘works do follow us.’ Let us so live that these may be ‘found unto praise and honour and glory’ at the appearing of ‘the King.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "4:1-43 Genealogies. - In this chapter we have a further account of Judah, the most numerous and most famous of all the tribes; also an account of Simeon. The most remarkable person in this chapter is Jabez. We are not told upon what account Jabez was more honourable than his brethren; but we find that he was a praying man. The way to be truly great, is to seek to do God's will, and to pray earnestly. Here is the prayer he made. Jabez prayed to the living and true God, who alone can hear and answer prayer; and, in prayer he regarded him as a God in covenant with his people. He does not express his promise, but leaves it to be understood; he was afraid to promise in his own strength, and resolved to devote himself entirely to God. Lord, if thou wilt bless me and keep me, do what thou wilt with me; I will be at thy command and disposal for ever. As the text reads it, this was the language of a most ardent and affectionate desire, Oh that thou wouldest bless me! Four things Jabez prayed for. 1. That God would bless him indeed. Spiritual blessings are the best blessings: God's blessings are real things, and produce real effects. 2. That He would enlarge his coast. That God would enlarge our hearts, and so enlarge our portion in himself, and in the heavenly Canaan, ought to be our desire and prayer. 3. That God's hand might be with him. God's hand with us, to lead us, protect us, strengthen us, and to work all our works in us and for us, is a hand all-sufficient for us. 4. That he would keep him from evil, the evil of sin, the evil of trouble, all the evil designs of his enemies, that they might not hurt, nor make him a Jabez indeed, a man of sorrow. God granted that which he requested. God is ever ready to hear prayer: his ear is not now heavy.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Among plants and hedges - Rather, \"in Netaim and Gederah\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 15:36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "With the king - Or, probably, \"on the king's property.\" Both David and several of the later kings had large territorial possessions in various parts of Judaea 1 Chronicles 27:25, 1 Chronicles 27:31; 2 Chronicles 26:10; 2 Chronicles 27:4; 2 Chronicles 32:28-29.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "With the king - Or, probably, \"on the king's property.\" Both David and several of the later kings had large territorial possessions in various parts of Judaea ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 27:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 27:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 26:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 27:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 32:28-29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "22, 23. had the dominion in Moab, and Jashubi-lehem—\"And these are ancient things\" seems a strange rendering of a proper name; and, besides, it conveys a meaning that has no bearing on the record. The following improved translation has been suggested: \"Sojourned in Moab, but returned to Beth-lehem and Adaberim-athekim. These and the inhabitants of Netaim and Gedera were potters employed by the king in his own work.\" Gedera or Gederoth, and Netaim, belonged to the tribe of Judah, and lay on the southeast border of the Philistines' territory (Jos 15:36; 2Ch 28:18).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "These were the potters; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or rather, these are; for he seems to oppose their present servitude to their former glory and to show their low and mean spirits, that had rather tarry among the heathen to do their drudgery, than return to Jerusalem to serve God and enjoy their freedom. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "There they dwelt, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "tarried",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "now dwell",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", when their brethren are returned. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "With the king",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of Babylon or Persia; esteeming it a greater honour and happiness to serve that earthly monarch in the meanest employments, than to serve the King of kings in his temple, and in his most noble and heavenly work. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "These were the potters,.... Or are the potters; the posterity of those men, who were so famous in their day, are now of mean employments: some of them made earthen pots; and some of them ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "dwelt among plants and hedges; or were employed in planting gardens and orchards, and making fences for them; or, as others think, \"dwelt in Netaim and Gadara\", cities in the tribe of Judah: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "there they dwelt with the king for his work; to make pots, plant gardens, and set hedges for him; either for the king of Judah, or it may be for the king of Babylon, where they were carried captive, and now chose to remain, doing those servile works for the king, without the city, in the fields. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "there they dwelt with the king for his work; to make pots, plant gardens, and set hedges for him; either for the king of Judah, or it may be for the king of Babylon, where they were carried captive, and now chose to remain, doing those servile works for the king, without the city, in the fields. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "These were the potters, and those that dwelt among plants and hedges: {g} there they dwelt with the king for his work.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "These ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "were",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the potters, and those that dwelt among plants and hedges: ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{g}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " there they dwelt with the king for his work.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(g) They were David's gardeners and served him in his works.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "those that dwelt amongst plants and hedges",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] R.V. ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The inhabitants of Netaim and Gederah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "there they dwelt with the king for his work",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] In the days of the kingdom the inhabitants of these villages were clients of the king and did his work; cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 7:46",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The simplicity of this statement seems to have been a stumbling-block to the early translators; LXX. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "They were strong in his kingdom and dwelt there",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; Targ., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "They made their dwelling there with the Shekinah of the King of the World for the practice of the Law",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1 Chronicles 4:23",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "\"These are the potters and the inhabitants of Netaim and Gedera.\" It is doubtful whether המּה refers to all the descendants of Shelah, or only to those named in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 4:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Bertheau holds the latter to be the more probable reference; \"for as those named in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 4:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " have already been denominated Byssus-workers, it appears fitting that those in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 4:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " should be regarded as the potters, etc.\" But all those mentioned in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 4:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " are by no means called Byssus-weavers, but only the families of Ashbea. What the descendants of Er and Laadan were is not said. The המּה may consequently very probably refer to all the sons of Shelah enumerated in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 4:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 4:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", with the exception of the families designated Byssus-weavers, who are, of course, understood to be excepted. נטעים signifies \"plantings;\" but since גּדרה is probably the name of a city Gedera in the lowlands of Judah (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 15:36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and for the situation, see on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 12:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), Netaim also will most likely denote a village where there were royal plantations, and about which these descendants of Shelah were employed, as the words \"with the king in his business to dwell there\" expressly state. המּלך is not an individual king of Judah, for we know not merely \"of King Uzziah that he had country lands, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 26:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "\" (Berth.); but we learn from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 27:25-31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that David also possessed great estates and country lands, which were managed by regularly appointed officers.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "We may therefore with certainty assume that all the kings of Judah had domains on which not only agriculture and the rearing of cattle, but also trades, were carried on.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: From the arrangement of the names in vv. 2-20, in which Bertheau finds just twelve families grouped together, he concludes, S. 44f., that the division of the tribe of Judah into these twelve families did actually exist at some time or other, and had been established by a new reckoning of the families which the heads of the community found themselves compelled to make after deep and wide alterations had taken place in the circumstances of the tribe. He then attempts to determine this time more accurately by the character of the names. For since only a very few names in these verses are known to us from the historical books, from Genesis to 2 Kings, and the few thus known refer to the original divisions of the tribe, which may have maintained themselves till post-exilic times, while, on the contrary, a great number of the other names recur in the books of Ezra and Nehemiah; and since localities which in the earliest period after the exile were important for the new community are frequently met with in our verses, while such as were constantly being mentioned in prae-exilic times are nowhere to be found, - Bertheau supposes that a division of the tribe of Judah is here spoken of, which actually existed at some time in the period between Zerubbabel and Ezra. This hypothesis has, however, no solid foundation. The assumption even that the names in vv. 2-20 belong to just twelve families is very questionable; for this number can only be arrived at by separating the descendants of Caleb, 1 Chronicles 4:15, from the descendants of Kenaz, 1 Chronicles 4:13 and 1 Chronicles 4:14, of whom Caleb himself was one, and reckoning them separately. But the circumstance that in this reckoning only the names in 1 Chronicles 4:12-20 are taken into consideration, which no notice is taken of the descendants of Shelah the son of Judah, enumerated in 1 Chronicles 4:21-23, is much more important. Bertheau considers this verse to be merely a supplementary addition, but without reason, as we have pointed out on 1 Chronicles 4:21. For if the descendants of Shelah form a second line of families descended from Judah, co-ordinate with the descendants of Pharez and Zerah, the tribe of Judah could not, either before or after the exile, have been divided into the twelve families supposed by Bertheau; for we have no reason to suppose, on behalf of this hypothesis, that all the descendants of Shelah had died out towards the end of the exile, and that from the time of Zerubbabel only families descended from Pharez and Zerah existed. But besides this, the hypothesis is decisively excluded by the fact that in the enumeration, vv. 2-20, no trace can be discovered of a division of the tribe of Judah into twelve families; for not only are the families mentioned not ranger according to the order of the sons and grandsons of Judah mentioned in 1 Chronicles 4:1, but also the connection of many families with Judah is not even hinted at. An enumeration of families which rested upon a division either made or already existing at any particular time, would be very differently planned and ordered. But if we must hold the supposition of a division of the tribe of Judah into twelve families to be unsubstantiated, since it appears irreconcilable with the present state of these genealogies, we must also believe the opinion that this division actually existed at any time between Zerubbabel and Ezra to be erroneous, and to rest upon no tenable grounds. The relation of the names met with in these verses to the names in the books from Genesis to 2 Kings n the one hand, and to the books of Ezra and Nehemiah on the other, is not really that which Bertheau represents it to be. If we turn our attention in the first place to the names of places, we find that, except a few quite unknown villages or towns, the localities mentioned in vv. 2-20 occur also in the book of Joshua, and many of them even here and there throughout Genesis, in the book of Judges, and in the books of Samuel and Kings. In these latter they are somewhat more rarely met with, but only because they played no great part in history. The fact of a disproportionate number of these towns occurring also in the books of Ezra and Nehemiah is connected with the peculiar character of the contents of these books, containing as they do a number of registers of the families of Judah which had returned out of exile. Then if we consider the names of persons in vv. 2-20, we find that not a few of them occur in the historical narratives of the books of Samuel and Kings. Others certainly are found only in the family registers of the books of Ezra and Nehemiah, while others again are peculiar to our verses. This phenomenon also is completely accounted for by the contents of the various historical books of the Old Testament. For example, had Nehemiah not received into his book the registers of all the families who had returned from Babylon, and who took part in the building of the walls of Jerusalem, no more names would be met with in his book than are found in the books of Samuel and Kings. Bertheau attempts to find support for his hypothesis in the way in which the names are enumerated, and their loose connection with each other, inasmuch as the disconnected statements abruptly and intermittently following one another, which to us bring enigma after enigma, must have been intended for readers who could bring a key to the understanding of the whole from an accurate knowledge of the relations which are here only hinted at; but the strength of this argument depends upon the assumption that complete family registers were at the command of the author of the Chronicle, from which he excerpted unconnected and obscure fragments, without any regard to order. But such an assumption cannot be justified. The character of that which is communicated would rather lead us to believe that only fragments were in the hands of the chronicler, which he has given to us as he found them. We must therefore pronounce this attempt at an explanation of the contents and form of vv. 2-20 to be an utter failure.) ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: From the arrangement of the names in vv. 2-20, in which Bertheau finds just twelve families grouped together, he concludes, S. 44f., that the division of the tribe of Judah into these twelve families did actually exist at some time or other, and had been established by a new reckoning of the families which the heads of the community found themselves compelled to make after deep and wide alterations had taken place in the circumstances of the tribe. He then attempts to determine this time more accurately by the character of the names. For since only a very few names in these verses are known to us from the historical books, from Genesis to 2 Kings, and the few thus known refer to the original divisions of the tribe, which may have maintained themselves till post-exilic times, while, on the contrary, a great number of the other names recur in the books of Ezra and Nehemiah; and since localities which in the earliest period after the exile were important for the new community are frequently met with in our verses, while such as were constantly being mentioned in prae-exilic times are nowhere to be found, - Bertheau supposes that a division of the tribe of Judah is here spoken of, which actually existed at some time in the period between Zerubbabel and Ezra. This hypothesis has, however, no solid foundation. The assumption even that the names in vv. 2-20 belong to just twelve families is very questionable; for this number can only be arrived at by separating the descendants of Caleb, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 4:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", from the descendants of Kenaz, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 4:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 4:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", of whom Caleb himself was one, and reckoning them separately. But the circumstance that in this reckoning only the names in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 4:12-20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " are taken into consideration, which no notice is taken of the descendants of Shelah the son of Judah, enumerated in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 4:21-23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", is much more important. Bertheau considers this verse to be merely a supplementary addition, but without reason, as we have pointed out on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 4:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". For if the descendants of Shelah form a second line of families descended from Judah, co-ordinate with the descendants of Pharez and Zerah, the tribe of Judah could not, either before or after the exile, have been divided into the twelve families supposed by Bertheau; for we have no reason to suppose, on behalf of this hypothesis, that all the descendants of Shelah had died out towards the end of the exile, and that from the time of Zerubbabel only families descended from Pharez and Zerah existed. But besides this, the hypothesis is decisively excluded by the fact that in the enumeration, vv. 2-20, no trace can be discovered of a division of the tribe of Judah into twelve families; for not only are the families mentioned not ranger according to the order of the sons and grandsons of Judah mentioned in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 4:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", but also the connection of many families with Judah is not even hinted at. An enumeration of families which rested upon a division either made or already existing at any particular time, would be very differently planned and ordered. But if we must hold the supposition of a division of the tribe of Judah into twelve families to be unsubstantiated, since it appears irreconcilable with the present state of these genealogies, we must also believe the opinion that this division actually existed at any time between Zerubbabel and Ezra to be erroneous, and to rest upon no tenable grounds. The relation of the names met with in these verses to the names in the books from Genesis to 2 Kings n the one hand, and to the books of Ezra and Nehemiah on the other, is not really that which Bertheau represents it to be. If we turn our attention in the first place to the names of places, we find that, except a few quite unknown villages or towns, the localities mentioned in vv. 2-20 occur also in the book of Joshua, and many of them even here and there throughout Genesis, in the book of Judges, and in the books of Samuel and Kings. In these latter they are somewhat more rarely met with, but only because they played no great part in history. The fact of a disproportionate number of these towns occurring also in the books of Ezra and Nehemiah is connected with the peculiar character of the contents of these books, containing as they do a number of registers of the families of Judah which had returned out of exile. Then if we consider the names of persons in vv. 2-20, we find that not a few of them occur in the historical narratives of the books of Samuel and Kings. Others certainly are found only in the family registers of the books of Ezra and Nehemiah, while others again are peculiar to our verses. This phenomenon also is completely accounted for by the contents of the various historical books of the Old Testament. For example, had Nehemiah not received into his book the registers of all the families who had returned from Babylon, and who took part in the building of the walls of Jerusalem, no more names would be met with in his book than are found in the books of Samuel and Kings. Bertheau attempts to find support for his hypothesis in the way in which the names are enumerated, and their loose connection with each other, inasmuch as the disconnected statements abruptly and intermittently following one another, which to us bring enigma after enigma, must have been intended for readers who could bring a key to the understanding of the whole from an accurate knowledge of the relations which are here only hinted at; but the strength of this argument depends upon the assumption that complete family registers were at the command of the author of the Chronicle, from which he excerpted unconnected and obscure fragments, without any regard to order. But such an assumption cannot be justified. The character of that which is communicated would rather lead us to believe that only fragments were in the hands of the chronicler, which he has given to us as he found them. We must therefore pronounce this attempt at an explanation of the contents and form of vv. 2-20 to be an utter failure.) ",
            "children": []
          }
        ]
      }
    ]
  }
]