[{"num":13,"verse":"Thus the Lord said to me: Go and buy yourself a linen girdle and put it on your loins, but do not put it in water."},{"num":2,"verse":"So I bought a girdle or waistcloth, according to the word of the Lord, and put it on my loins."},{"num":3,"verse":"And the word of the Lord came to me the second time, saying,"},{"num":4,"verse":"Take the girdle which you have bought, which is on your loins, and arise, go to the [river] Euphrates, and hide it there in a cleft of the rock."},{"num":5,"verse":"So I went and hid it by the Euphrates, as the Lord commanded me."},{"num":6,"verse":"And after many days the Lord said to me, Arise, go to the Euphrates, and take from there the girdle which I commanded you to hide there."},{"num":7,"verse":"Then I went to the Euphrates and dug and took the girdle or waistcloth from the place where I had hidden it. And behold, the girdle was decayed and spoiled; it was good for nothing."},{"num":8,"verse":"Then the word of the Lord came to me, saying,"},{"num":9,"verse":"Thus says the Lord: After this manner will I mar the pride of Judah and the great pride of Jerusalem."},{"num":10,"verse":"These evil people, who refuse to hear My words, who walk in the stubbornness of their hearts and have gone after other gods to serve them and to worship them, shall even be like this girdle or waistcloth, which is profitable for nothing."},{"num":11,"verse":"For as the girdle clings to the loins of a man, so I caused the whole house of Israel and the whole house of Judah to cling to Me, says the Lord, that they might be for Me a people, a name, a praise, and a glory; but they would not listen or obey."},{"num":12,"verse":"Therefore you shall speak to them this word: Thus says the Lord, the God of Israel: Every bottle and jar should be filled with wine. [The people] will say to you, Do we not certainly know that every bottle and jar should be filled with wine?"},{"num":13,"verse":"Then say to them, Thus says the Lord: Behold, I will fill with drunkenness all the inhabitants of this land, even the kings who sit upon David’s throne, the priests, the prophets, and all the inhabitants of Jerusalem."},{"num":14,"verse":"And I will dash them one against another, even the fathers and the sons together, says the Lord. I will not pity or spare or have compassion, that I should not destroy them."},{"num":15,"verse":"Hear and give ear, do not be proud, for the Lord has spoken [says Jeremiah]."},{"num":16,"verse":"Give glory to the Lord your God before He brings darkness and before your feet stumble upon the dark and twilit mountains, and [before], while you are looking for light, He turns it into the shadow of death and makes it thick darkness."},{"num":17,"verse":"But if you will not hear and obey, I will weep in secret for your pride; my eyes will weep bitterly and run down with tears, because the Lord’s flock has been taken captive."},{"num":18,"verse":"Say to the king and the queen mother, Humble yourselves and take a lowly seat, for down from your head has come your beautiful crown (the crown of your glory)."},{"num":19,"verse":"The cities of the South (the Negeb) have been shut up, and there is no one to open them; all Judah has been carried away captive, it has been wholly taken captive and into exile."},{"num":20,"verse":"Lift up your eyes and behold those [the eruption of a hostile army] who come from the north. Where is the flock that was given to you [to shepherd], your beautiful flock?"},{"num":21,"verse":"What will you say [O Jerusalem] when He [the Lord] sets over you as head those [tyrannical foreign nations] whom you yourselves [at intervals] have taught to be lovers (allies) with you [instructing them, even your friends, to be head over you]? Will not pangs take hold of you like that of a woman in travail?"},{"num":22,"verse":"And if you say in your heart, Why have these things come upon me?—[the answer is], Because of the greatness of your iniquity has your long robe been pulled aside [showing you in the garb of a menial] and have you [barefooted and treated like a slave] suffered violence."},{"num":23,"verse":"Can the Ethiopian change his skin or the leopard his spots? Then also can you do good who are accustomed and taught [even trained] to do evil."},{"num":24,"verse":"Therefore I will scatter you like chaff driven away by the wind from the desert."},{"num":25,"verse":"This is your lot, the portion measured to you from Me, says the Lord, because you have forgotten Me and trusted in falsehood [false gods and alliances with idolatrous nations]."},{"num":26,"verse":"Therefore I Myself will [retaliate], throwing your skirts up over your face, that your shame [of being clad like a slave] may be exposed."},{"num":27,"verse":"I have seen your detestable acts, even your adulteries and your lustful neighings [after idols], and the lewdness of your harlotry on the hills in the field. Woe to you, O Jerusalem! For how long a time yet will you not [meet My conditions and] be made clean?"}]