[{"num":13,"verse":"Thus saith Jehovah unto me, Go, and buy thee a linen girdle, and put it upon thy loins, and put it not in water. "},{"num":2,"verse":"So I bought a girdle according to the word of Jehovah, and put it upon my loins. "},{"num":3,"verse":"And the word of Jehovah came unto me the second time, saying, "},{"num":4,"verse":"Take the girdle that thou hast bought, which is upon thy loins, and arise, go to the Euphrates, and hide it there in a cleft of the rock. "},{"num":5,"verse":"So I went, and hid it by the Euphrates, as Jehovah commanded me. "},{"num":6,"verse":"And it came to pass after many days, that Jehovah said unto me, Arise, go to the Euphrates, and take the girdle from thence, which I commanded thee to hide there. "},{"num":7,"verse":"Then I went to the Euphrates, and digged, and took the girdle from the place where I had hid it; and, behold, the girdle was marred, it was profitable for nothing."},{"num":8,"verse":"Then the word of Jehovah came unto me, saying, "},{"num":9,"verse":"Thus saith Jehovah, After this manner will I mar the pride of Judah, and the great pride of Jerusalem. "},{"num":10,"verse":"This evil people, that refuse to hear my words, that walk in the stubbornness of their heart, and are gone after other gods to serve them, and to worship them, shall even be as this girdle, which is profitable for nothing. "},{"num":11,"verse":"For as the girdle cleaveth to the loins of a man, so have I caused to cleave unto me the whole house of Israel and the whole house of Judah, saith Jehovah; that they may be unto me for a people, and for a name, and for a praise, and for a glory: but they would not hear."},{"num":12,"verse":"Therefore thou shalt speak unto them this word: Thus saith Jehovah, the God of Israel, Every bottle shall be filled with wine: and they shall say unto thee, Do we not certainly know that every bottle shall be filled with wine? "},{"num":13,"verse":"Then shalt thou say unto them, Thus saith Jehovah, Behold, I will fill all the inhabitants of this land, even the kings that sit upon David’s throne, and the priests, and the prophets, and all the inhabitants of Jerusalem, with drunkenness. "},{"num":14,"verse":"And I will dash them one against another, even the fathers and the sons together, saith Jehovah: I will not pity, nor spare, nor have compassion, that I should not destroy them."},{"num":15,"verse":"Hear ye, and give ear; be not proud; for Jehovah hath spoken. "},{"num":16,"verse":"Give glory to Jehovah your God, before he cause darkness, and before your feet stumble upon the dark mountains, and, while ye look for light, he turn it into the shadow of death, and make it gross darkness. "},{"num":17,"verse":"But if ye will not hear it, my soul shall weep in secret for your pride; and mine eye shall weep sore, and run down with tears, because Jehovah’s flock is taken captive."},{"num":18,"verse":"Say thou unto the king and to the queen-mother, Humble yourselves, sit down; for your headtires are come down, even the crown of your glory. "},{"num":19,"verse":"The cities of the South are shut up, and there is none to open them: Judah is carried away captive, all of it; it is wholly carried away captive."},{"num":20,"verse":"Lift up your eyes, and behold them that come from the north: where is the flock that was given thee, thy beautiful flock? "},{"num":21,"verse":"What wilt thou say, when he shall set over thee as head those whom thou hast thyself taught to be friends to thee? shall not sorrows take hold of thee, as of a woman in travail? "},{"num":22,"verse":"And if thou say in thy heart, Wherefore are these things come upon me? for the greatness of thine iniquity are thy skirts uncovered, and thy heels suffer violence. "},{"num":23,"verse":"Can the Ethiopian change his skin, or the leopard his spots? then may ye also do good, that are accustomed to do evil. "},{"num":24,"verse":"Therefore will I scatter them, as the stubble that passeth away, by the wind of the wilderness. "},{"num":25,"verse":"This is thy lot, the portion measured unto thee from me, saith Jehovah; because thou hast forgotten me, and trusted in falsehood. "},{"num":26,"verse":"Therefore will I also uncover thy skirts upon thy face, and thy shame shall appear. "},{"num":27,"verse":"I have seen thine abominations, even thine adulteries, and thy neighings, the lewdness of thy whoredom, on the hills in the field. Woe unto thee, O Jerusalem! thou wilt not be made clean; how long shall it yet be?"}]