[{"header":"The Linen Loincloth"},{"num":13,"verse":"Thus said the Lord to me, ‘Go and buy yourself a linen loincloth, and put it on your loins, but do not dip it in water.’ "},{"num":2,"verse":"So I bought a loincloth according to the word of the Lord, and put it on my loins. "},{"num":3,"verse":"And the word of the Lord came to me a second time, saying, "},{"num":4,"verse":"‘Take the loincloth that you bought and are wearing, and go now to the Euphrates, and hide it there in a cleft of the rock.’ "},{"num":5,"verse":"So I went, and hid it by the Euphrates, as the Lord commanded me. "},{"num":6,"verse":"And after many days the Lord said to me, ‘Go now to the Euphrates, and take from there the loincloth that I commanded you to hide there.’ "},{"num":7,"verse":"Then I went to the Euphrates, and dug, and I took the loincloth from the place where I had hidden it. But now the loincloth was ruined; it was good for nothing."},{"num":8,"verse":"Then the word of the Lord came to me: "},{"num":9,"verse":"Thus says the Lord: Just so I will ruin the pride of Judah and the great pride of Jerusalem. "},{"num":10,"verse":"This evil people, who refuse to hear my words, who stubbornly follow their own will and have gone after other gods to serve them and worship them, shall be like this loincloth, which is good for nothing. "},{"num":11,"verse":"For as the loincloth clings to one’s loins, so I made the whole house of Israel and the whole house of Judah cling to me, says the Lord, in order that they might be for me a people, a name, a praise, and a glory. But they would not listen."},{"header":"Symbol of the Wine-Jars"},{"num":12,"verse":"You shall speak to them this word: Thus says the Lord, the God of Israel: Every wine-jar should be filled with wine. And they will say to you, ‘Do you think we do not know that every wine-jar should be filled with wine?’ "},{"num":13,"verse":"Then you shall say to them: Thus says the Lord: I am about to fill all the inhabitants of this land—the kings who sit on David’s throne, the priests, the prophets, and all the inhabitants of Jerusalem—with drunkenness. "},{"num":14,"verse":"And I will dash them one against another, parents and children together, says the Lord. I will not pity or spare or have compassion when I destroy them."},{"header":"Exile Threatened"}]