[{"header":"The Example of Abraham"},{"num":4,"verse":"What shall we say, then, of Abraham, the father of our race? What was his experience? "},{"num":2,"verse":"If he was put right with God by the things he did, he would have something to boast about—but not in God's sight. "},{"num":3,"verse":"The scripture says, “Abraham believed God, and because of his faith God accepted him as righteous.” "},{"num":4,"verse":"A person who works is paid wages, but they are not regarded as a gift; they are something that has been earned. "},{"num":5,"verse":"But those who depend on faith, not on deeds, and who believe in the God who declares the guilty to be innocent, it is this faith that God takes into account in order to put them right with himself. "},{"num":6,"verse":"This is what David meant when he spoke of the happiness of the person whom God accepts as righteous, apart from anything that person does:"},{"num":9,"verse":"Does this happiness that David spoke of belong only to those who are circumcised? No indeed! It belongs also to those who are not circumcised. For we have quoted the scripture, “Abraham believed God, and because of his faith God accepted him as righteous.” "},{"num":10,"verse":"When did this take place? Was it before or after Abraham was circumcised? It was before, not after. "},{"num":11,"verse":"He was circumcised later, and his circumcision was a sign to show that because of his faith God had accepted him as righteous before he had been circumcised. And so Abraham is the spiritual father of all who believe in God and are accepted as righteous by him, even though they are not circumcised. "},{"num":12,"verse":"He is also the father of those who are circumcised, that is, of those who, in addition to being circumcised, also live the same life of faith that our father Abraham lived before he was circumcised."},{"header":"God's Promise Is Received through Faith"},{"num":13,"verse":"When God promised Abraham and his descendants that the world would belong to him, he did so, not because Abraham obeyed the Law, but because he believed and was accepted as righteous by God. "},{"num":14,"verse":"For if what God promises is to be given to those who obey the Law, then faith means nothing and God's promise is worthless. "},{"num":15,"verse":"The Law brings down God's anger; but where there is no law, there is no disobeying of the law."},{"num":16,"verse":"And so the promise was based on faith, in order that the promise should be guaranteed as God's free gift to all of Abraham's descendants—not just to those who obey the Law, but also to those who believe as Abraham did. For Abraham is the spiritual father of us all; "},{"num":17,"verse":"as the scripture says, “I have made you father of many nations.” So the promise is good in the sight of God, in whom Abraham believed—the God who brings the dead to life and whose command brings into being what did not exist. "},{"num":18,"verse":"Abraham believed and hoped, even when there was no reason for hoping, and so became “the father of many nations.” Just as the scripture says, “Your descendants will be as many as the stars.” "},{"num":19,"verse":"He was then almost one hundred years old; but his faith did not weaken when he thought of his body, which was already practically dead, or of the fact that Sarah could not have children. "},{"num":20,"verse":"His faith did not leave him, and he did not doubt God's promise; his faith filled him with power, and he gave praise to God. "},{"num":21,"verse":"He was absolutely sure that God would be able to do what he had promised. "},{"num":22,"verse":"That is why Abraham, through faith, “was accepted as righteous by God.” "},{"num":23,"verse":"The words “he was accepted as righteous” were not written for him alone. "},{"num":24,"verse":"They were written also for us who are to be accepted as righteous, who believe in him who raised Jesus our Lord from death. "},{"num":25,"verse":"Because of our sins he was given over to die, and he was raised to life in order to put us right with God."}]