[{"header":"The Birth of Moses"},{"num":2,"verse":"Now a man of the house of Levi went and married a daughter of Levi. "},{"num":2,"verse":"And the woman conceived and bore a son, and when she saw him, that he was a beautiful child, she hid him three months. "},{"num":3,"verse":"When she could no longer hide him, she took for him a container made of bulrushes and daubed it with tar and with pitch. She then put the child in it and set it in the reeds by the river’s bank. "},{"num":4,"verse":"Then his sister stood afar off so that she might know what would happen to him."},{"num":5,"verse":"The daughter of Pharaoh came down to wash herself at the river while her maidens walked along by the river’s side, and when she saw the container among the reeds, she sent her maid, and she retrieved it. "},{"num":6,"verse":"When she opened it, she saw the child. He was crying. She had compassion on him and said, “This is one of the Hebrews’ children.”"},{"num":7,"verse":"Then his sister said to Pharaoh’s daughter, “Shall I go and call for you a nursing woman of the Hebrew women so that she may nurse the child for you?”"},{"num":8,"verse":"And Pharaoh’s daughter said to her, “Go.” So the young girl went and called the child’s mother. "},{"num":9,"verse":"Pharaoh’s daughter said to her, “Take this child away, and nurse him for me, and I will give you your wages.” So the woman took the child and nursed him. "},{"num":10,"verse":"Now the child grew, and she brought him to Pharaoh’s daughter, and he became her son. And she called his name Moses and said, “Because I drew him out of the water.”"},{"num":11,"verse":"In those days, when Moses was grown, he went out to his brothers and looked on their burdens; and he saw an Egyptian striking a Hebrew, one of his brothers. "},{"num":12,"verse":"He looked this way and that way, and when he saw no one, he killed the Egyptian and hid him in the sand. "},{"num":13,"verse":"When he went out the next day, two men of the Hebrews struggled with each other; and he said to him that did the wrong, “Why do you strike your companion?”"},{"num":14,"verse":"He said, “Who made you a prince and a judge over us? Do you intend to kill me as you killed the Egyptian?” Moses feared and said, “Surely this thing is known.”"},{"header":"Moses Flees to Midian"},{"num":15,"verse":"Now when Pharaoh heard this thing, he sought to slay Moses. But Moses fled from the presence of Pharaoh and settled in the land of Midian, and he dwelled by a well. "},{"num":16,"verse":"Now the priest of Midian had seven daughters, and they came and drew water, and filled the troughs to water their father’s flock. "},{"num":17,"verse":"Then shepherds came and drove them away, but Moses stood up and helped them, and watered their flock."},{"num":18,"verse":"When they came to Reuel their father, he said, “Why is it you have come back so soon today?”"},{"num":19,"verse":"And they said, “An Egyptian delivered us out of the hand of the shepherds and also drew water for us and watered the flock.”"},{"num":20,"verse":"He said to his daughters, “So where is he? Why is it that you have left the man? Call him so that he may eat bread.”"},{"num":21,"verse":"Moses was content to dwell with the man, and he gave Zipporah, his daughter, to Moses. "},{"num":22,"verse":"Then she gave birth to a son, and he called his name Gershom, for he said, “I have been a sojourner in a foreign land.”"},{"num":23,"verse":"In the passing of time the king of Egypt died. And the children of Israel sighed because of the bondage, and they cried out, and their cry came up to God on account of the bondage. "},{"num":24,"verse":"God heard their groaning, and God remembered His covenant with Abraham, Isaac, and Jacob. "},{"num":25,"verse":"God looked on the children of Israel, and God had concern for them."}]