[{"num":13,"verse":"It was in the twenty-third year of Yo’ash the son of Achazyah, king of Y’hudah, that Y’ho’achaz the son of Yehu began his reign over Isra’el in Shomron; he ruled for seventeen years. "},{"num":2,"verse":"He did what was evil from Adonai’s perspective; he followed the sins of Yarov‘am the son of N’vat, who made Isra’el sin; and he never ceased committing those sins. "},{"num":3,"verse":"Adonai’s anger burned against Isra’el, and he kept handing them over to Haza’el king of Aram and Ben-Hadad the son of Haza’el. "},{"num":4,"verse":"But Y’ho’achaz pleaded to Adonai, and Adonai listened to him, because he saw the oppression the king of Aram was inflicting on Isra’el. "},{"num":5,"verse":"So Adonai gave Isra’el a savior who freed them from the grip of Aram, so that the people of Isra’el could live in their tents, as they had before. "},{"num":6,"verse":"Despite that, instead of turning from the sins of the house of Yarov‘am, who made Isra’el sin, they continued to live in this sinful way. Moreover, the asherah continued to stand in Shomron. "},{"num":7,"verse":"The king of Aram destroyed Y’ho’achaz’s army, making them like chaff when grain is threshed, except for fifty horsemen, ten chariots and 10,000 foot soldiers."},{"num":8,"verse":"Other activities of Y’ho’achaz, all his accomplishments and his power are recorded in the Annals of the Kings of Isra’el. "},{"num":9,"verse":"Y’ho’achaz slept with his ancestors, and they buried him in Shomron. Then Yo’ash his son took his place as king."},{"num":10,"verse":"It was in the thirty-seventh year of Yo’ash king of Y’hudah that Yo’ash the son of Y’ho’achaz began his rule over Isra’el in Shomron; he ruled for sixteen years. "},{"num":11,"verse":"He did what was evil from Adonai’s perspective and did not turn from all the sins of Yarov‘am the son of N’vat, who made Isra’el sin; on the contrary, he lived in this sinful way."},{"num":12,"verse":"Other activities of Yo’ash, all his accomplishments and his power in fighting Amatzyah king of Y’hudah are recorded in the Annals of the Kings of Isra’el. "},{"num":13,"verse":"Yo’ash slept with his ancestors, and Yarov‘am occupied his throne. Yo’ash was buried in Shomron with the kings of Isra’el."},{"num":14,"verse":"Elisha was now ill with the disease from which he would eventually die. Yo’ash the king of Isra’el came down to visit him and wept over him; he said, “My father! My father! The chariots and horsemen of Isra’el!” "},{"num":15,"verse":"Elisha said to him, “Bring a bow and arrows”; and he brought him a bow and arrows. "},{"num":16,"verse":"He said to the king of Isra’el, “Put your hand on the bow”; and he put his hand on it. Then Elisha laid his hands on the king’s hands "},{"num":17,"verse":"and said, “Open the east window.” He opened it. Elisha said, “Shoot”; and he shot. He said, “Adonai’s arrow of victory, the arrow of victory against Aram! You will defeat Aram completely at Afek!” "},{"num":18,"verse":"He said, “Take the arrows”; and he took them. He told the king of Isra’el, “Strike the ground.” He struck three times, then stopped. "},{"num":19,"verse":"The man of God became angry with him; he said, “You should have struck five or six times; then you would have defeated Aram completely. As it is, you will defeat Aram only three times.”"},{"num":20,"verse":"Elisha died, and they placed him in a burial cave. Now the raiding parties of Mo’av used to make yearly incursions into the land at the start of the year. "},{"num":21,"verse":"Once it happened that just as they were burying a man, they spotted a raiding party; so they threw the man’s body into Elisha’s burial cave; and the moment the man touched the bones of Elisha, he revived and stood on his feet."},{"num":22,"verse":"Haza’el king of Aram oppressed Isra’el throughout the lifetime of Y’ho’achaz; "},{"num":23,"verse":"but Adonai was gracious, took pity on them and looked on them with favor, because of his covenant with Avraham, Yitz’chak and Ya‘akov. He was not willing to destroy them, and to this day he has not banished them from his presence. "},{"num":24,"verse":"Haza’el king of Aram died, and Ben-Hadad his son took his place as king. "},{"num":25,"verse":"Then Y’ho’ash the son of Y’ho’achaz captured from Ben-Hadad the son of Haza’el the cities which he had captured in war from Y’ho’achaz his father. Three times Yo’ash defeated him, thus recovering the cities of Isra’el."}]