[{"header":"King Jehoahaz of Israel"},{"num":13,"verse":"Ahaziah’s son King Joash of Judah was in his twenty-third year as king of Judah when Jehoahaz, son of Jehu, began to rule in Samaria as king of Israel. He ruled for 17 years. "},{"num":2,"verse":"He did what the Lord considered evil. He continued to commit the sins that Jeroboam (Nebat’s son) led Israel to commit. He never gave up committing those sins. "},{"num":3,"verse":"So the Lord became angry with Israel and put it at the mercy of King Hazael of Aram and Hazael’s son Benhadad as long as they lived."},{"num":4,"verse":"Then Jehoahaz pleaded with the Lord, and the Lord heard him because he saw how the Aramean king was oppressing Israel. "},{"num":5,"verse":"So the Lord gave the Israelites someone to save them, and they were freed from Aram’s power. They were able to live in their homes again as they had done before. "},{"num":6,"verse":"But they didn’t turn away from the sins that Jeroboam and his dynasty led Israel to commit. They continued to commit those sins. In addition, the pole dedicated to the goddess Asherah remained standing in Samaria."},{"num":7,"verse":"Jehoahaz had no army left except for 50 horses, 10 chariots, and 10,000 foot soldiers because the king of Aram had destroyed the rest. He had made them like dust that people trample. "},{"num":8,"verse":"Isn’t everything else about Jehoahaz—everything he did, his heroic acts—written in the official records of the kings of Israel? "},{"num":9,"verse":"Jehoahaz lay down in death with his ancestors and was buried in Samaria. His son Jehoash  ruled as king in his place."},{"header":"King Jehoash of Israel"},{"num":10,"verse":"In Joash’s thirty-seventh year as king of Judah, Jehoahaz’s son Jehoash began to rule Israel in Samaria. He ruled for 16 years. "},{"num":11,"verse":"He did what the Lord considered evil and never gave up committing the sins that Jeroboam led Israel to commit. He continued to commit them. "},{"num":12,"verse":"Isn’t everything else about Jehoash—everything he did, his heroic acts when he fought against King Amaziah of Judah—written in the official records of the kings of Israel? "},{"num":13,"verse":"Jehoash lay down in death with his ancestors and was buried with the kings of Israel in Samaria. Then Jeroboam claimed the throne."},{"header":"The Death of Elisha"},{"num":14,"verse":"Elisha became fatally ill. King Jehoash of Israel visited him, cried over him, and said, “Master! Master! Israel’s chariot and horses!”"},{"num":15,"verse":"Elisha told him, “Get a bow and some arrows.” So he got a bow and some arrows. "},{"num":16,"verse":"Then Elisha told the king of Israel, “Take the bow in your hand.” So the king picked up the bow. Elisha laid his hands on the king’s hands. "},{"num":17,"verse":"Elisha said, “Open the window that faces east.” So the king opened it. “Shoot,” Elisha said, and the king shot. Then Elisha said, “That is the arrow of the Lord’s victory, the arrow of victory against Aram. You will completely defeat the Arameans at Aphek.” "},{"num":18,"verse":"Then Elisha said, “Take the arrows.” So the king took them. “Stomp on them,” he told the king of Israel. The king stomped three times and stopped."},{"num":19,"verse":"Then the man of God became angry with him. “You should have stomped five or six times!” he said. “Then you would have completely defeated the Arameans. But now you will only defeat the Arameans three times.”"},{"num":20,"verse":"Elisha died and was buried. Moabite raiding parties used to invade the country in the spring. "},{"num":21,"verse":"One day some people who were burying a man saw one of these raiding parties. So they quickly put the man into Elisha’s tomb. But when the body touched Elisha’s bones, the man came back to life and stood up."},{"num":22,"verse":"King Hazael of Aram oppressed Israel as long as Jehoahaz ruled. "},{"num":23,"verse":"But the Lord was kind and merciful to the Israelites because of his promise  to Abraham, Isaac, and Jacob. He didn’t want to destroy the Israelites, and even now he hasn’t turned away from them."},{"num":24,"verse":"King Hazael of Aram died, and his son Benhadad succeeded him as king. "},{"num":25,"verse":"Then Jehoash, son of Jehoahaz, reconquered the cities that Benhadad had taken from his father Jehoahaz. Jehoash defeated Benhadad three times and recovered those cities of Israel."}]