[{"num":13,"verse":"In the three and twentieth shanah (year) of Yoash Ben Achazyahu Melech Yehudah, Yehoachaz Ben Yehu began to reign as melech over Yisroel in Shomron, and reigned seventeen shanah."},{"num":2,"verse":"And he did that which was rah before the eyes of Hashem, and followed after the chattot of Yarov‘am Ben Nevat, which he caused Yisroel to sin; he departed not therefrom."},{"num":3,"verse":"And the af Hashem (anger of Hashem) was kindled against Yisroel, and He delivered them into the yad Chazael Melech Aram (Syria), and into the yad Ben-Hadad Ben Chazael, all their yamim."},{"num":4,"verse":"And Yehoachaz besought Hashem, and Hashem paid heed unto him; for He saw the lakhatz (oppression) of Yisroel, because Melech Aram (Syria) oppressed them—"},{"num":5,"verse":"And Hashem gave Yisroel a moshia (savior), so that they went out from under the yad Aram; and the Bnei Yisroel dwelt in their ohalim, as formerly."},{"num":6,"verse":"Nevertheless they departed not from the chattot of the Bais Yarov‘am, who made Yisroel sin, but walked therein; and also there remained standing the Asherah in Shomron—"},{"num":7,"verse":"For he [Melech Aram] did leave of the army to Yehoachaz but 50 parashim, and 10 merkavot, and 10,000 foot soldiers; for Melech Aram had destroyed them, and had made them like the aphar for trampling."},{"num":8,"verse":"Now the rest of the acts of Yehoachaz, and all that he did, and his gevurah, are they not written in the Sefer Divrei HaYamim L’Malkhei Yisroel?"},{"num":9,"verse":"And Yehoachaz slept with his avot; and they buried him in Shomron; and Yoash bno reigned as Melech in his place."},{"num":10,"verse":"In the 37th shanah of Yoash Melech Yehudah began Yehoash Ben Yehoachaz to reign as Melech over Yisroel in Shomron, and reigned as Melech 16 shanah."},{"num":11,"verse":"And he did that which was rah before the eyes of Hashem; he departed not from all the chattot Yarov‘am Ben Nevat, who caused Yisroel to commit sin; but he walked therein."},{"num":12,"verse":"And the rest of the acts of Yoash, and all that he did, and his gevurah wherewith he warred against Amatzyah (Amaziah) Melech Yehudah, are they not written in the Sefer Divrei HaYamim L’Malkhei Yisroel?"},{"num":13,"verse":"And Yoash slept with his avot; and Yarov‘am sat upon his kisse: and Yoash was buried in Shomron with the Malkhei Yisroel."},{"num":14,"verse":"Now Elishah was fallen ill of his illness whereof he would die. And Yoash Melech Yisroel came down unto him, and wept over his face, and said, O Avi, Avi, the merkavah of Yisroel, and the parashim thereof."},{"num":15,"verse":"And Elishah said unto him, Take keshet and khitzim. And he took unto him keshet and khitzim."},{"num":16,"verse":"And he said to Melech Yisroel, Place thine yad upon the keshet. And he put his yad upon it; and Elishah put his hands upon the hands of HaMelech."},{"num":17,"verse":"And he said, Open the east chalon. And he opened it. Then Elishah said, Shoot. And he shot. And he said, The khetz (arrow) of the teshuah (salvation) unto Hashem, and the khetz of teshuah against Aram; for thou shalt strike down Aram at Aphek, unto complete destruction."},{"num":18,"verse":"And he said, Take the khitzim (arrows). And he took them. And he said unto Melech Yisroel, Strike the ground. And he struck shalosh pe’amim (three times) and stopped."},{"num":19,"verse":"And the Ish HaElohim was in wrath with him, and said, Thou shouldest have struck chamesh or shesh pe’amim; then hadst thou struck down Aram till thou hadst completely destroyed it; whereas now thou shalt defeat Aram but 3 pe’amim."},{"num":20,"verse":"And Elishah died, and they buried him. And the raiding parties of Mo’av would invade the land at the beginning of the shanah."},{"num":21,"verse":"And it came to pass, as they were burying an ish, that, hinei, they spotted a raiding party; and they cast the ish into the kever of Elishah; and when the ish was let down, and touched the atzmot of Elishah, he revived, and stood up alive on his raglayim."},{"num":22,"verse":"But Chazael Melech Aram oppressed Yisroel all days of Yehoachaz."},{"num":23,"verse":"And Hashem was gracious unto them, and had rachamim on them, and showed regard unto them, because of His brit (covenant) with Avraham, Yitzchak, and Ya’akov, and would not destroy them, neither cast He them from His presence up to now."},{"num":24,"verse":"So Chazael Melech Aram died; and Ben-Hadad bno reigned as melech in his place."},{"num":25,"verse":"And Yehoash Ben Yehoachaz returned and recaptured out of the yad of Ben-Hadad Ben Chazael the towns, which he [Ben-Hadad] had taken out of the yad of Yehoachaz aviv by milchamah (war). Shalosh times did Yoash defeat him, and recovered the towns of Yisroel."}]