[{"header":"Jehoahaz Reigns over Israel"},{"num":13,"verse":"In the twenty-third year of Jo′ash the son of Ahazi′ah, king of Judah, Jeho′ahaz the son of Jehu began to reign over Israel in Samar′ia, and he reigned seventeen years. "},{"num":2,"verse":"He did what was evil in the sight of the Lord, and followed the sins of Jerobo′am the son of Nebat, which he made Israel to sin; he did not depart from them. "},{"num":3,"verse":"And the anger of the Lord was kindled against Israel, and he gave them continually into the hand of Haz′ael king of Syria and into the hand of Ben-ha′dad the son of Haz′ael. "},{"num":4,"verse":"Then Jeho′ahaz besought the Lord, and the Lord hearkened to him; for he saw the oppression of Israel, how the king of Syria oppressed them. "},{"num":5,"verse":"(Therefore the Lord gave Israel a savior, so that they escaped from the hand of the Syrians; and the people of Israel dwelt in their homes as formerly. "},{"num":6,"verse":"Nevertheless they did not depart from the sins of the house of Jerobo′am, which he made Israel to sin, but walked in them; and the Ashe′rah also remained in Samar′ia.) "},{"num":7,"verse":"For there was not left to Jeho′ahaz an army of more than fifty horsemen and ten chariots and ten thousand footmen; for the king of Syria had destroyed them and made them like the dust at threshing. "},{"num":8,"verse":"Now the rest of the acts of Jeho′ahaz and all that he did, and his might, are they not written in the Book of the Chronicles of the Kings of Israel? "},{"num":9,"verse":"So Jeho′ahaz slept with his fathers, and they buried him in Samar′ia; and Jo′ash his son reigned in his stead."},{"header":"Jehoash Reigns over Israel"},{"num":10,"verse":"In the thirty-seventh year of Jo′ash king of Judah Jeho′ash the son of Jeho′ahaz began to reign over Israel in Samar′ia, and he reigned sixteen years. "},{"num":11,"verse":"He also did what was evil in the sight of the Lord; he did not depart from all the sins of Jerobo′am the son of Nebat, which he made Israel to sin, but he walked in them. "},{"num":12,"verse":"Now the rest of the acts of Jo′ash, and all that he did, and the might with which he fought against Amazi′ah king of Judah, are they not written in the Book of the Chronicles of the Kings of Israel? "},{"num":13,"verse":"So Jo′ash slept with his fathers, and Jerobo′am sat upon his throne; and Jo′ash was buried in Samar′ia with the kings of Israel."},{"header":"Death of Elisha"},{"num":14,"verse":"Now when Eli′sha had fallen sick with the illness of which he was to die, Jo′ash king of Israel went down to him, and wept before him, crying, “My father, my father! The chariots of Israel and its horsemen!” "},{"num":15,"verse":"And Eli′sha said to him, “Take a bow and arrows”; so he took a bow and arrows. "},{"num":16,"verse":"Then he said to the king of Israel, “Draw the bow”; and he drew it. And Eli′sha laid his hands upon the king’s hands. "},{"num":17,"verse":"And he said, “Open the window eastward”; and he opened it. Then Eli′sha said, “Shoot”; and he shot. And he said, “The Lord’s arrow of victory, the arrow of victory over Syria! For you shall fight the Syrians in Aphek until you have made an end of them.” "},{"num":18,"verse":"And he said, “Take the arrows”; and he took them. And he said to the king of Israel, “Strike the ground with them”; and he struck three times, and stopped. "},{"num":19,"verse":"Then the man of God was angry with him, and said, “You should have struck five or six times; then you would have struck down Syria until you had made an end of it, but now you will strike down Syria only three times.”"},{"num":20,"verse":"So Eli′sha died, and they buried him. Now bands of Moabites used to invade the land in the spring of the year. "},{"num":21,"verse":"And as a man was being buried, lo, a marauding band was seen and the man was cast into the grave of Eli′sha; and as soon as the man touched the bones of Eli′sha, he revived, and stood on his feet."},{"header":"Israel Recaptures Cities from Aram"},{"num":22,"verse":"Now Haz′ael king of Syria oppressed Israel all the days of Jeho′ahaz. "},{"num":23,"verse":"But the Lord was gracious to them and had compassion on them, and he turned toward them, because of his covenant with Abraham, Isaac, and Jacob, and would not destroy them; nor has he cast them from his presence until now."},{"num":24,"verse":"When Haz′ael king of Syria died, Ben-ha′dad his son became king in his stead. "},{"num":25,"verse":"Then Jeho′ash the son of Jeho′ahaz took again from Ben-ha′dad the son of Haz′ael the cities which he had taken from Jeho′ahaz his father in war. Three times Jo′ash defeated him and recovered the cities of Israel."}]