[[],[{"type":"header","content":"Sin-Offering Regulations"},{"type":"prose","content":"Then the LORD spoke to Moses: "}],[{"type":"prose","content":"“Tell the Israelites, ‘When a person sins by straying unintentionally from any of the LORD’s commandments which must not be violated, and violates any one of them—"}],[{"type":"header","content":"For the Priest"},{"type":"prose","content":"“‘If the high priest sins so that the people are guilty, on account of the sin he has committed he must present a flawless young bull to the LORD for a sin offering. "}],[{"type":"prose","content":"He must bring the bull to the entrance of the Meeting Tent before the LORD, lay his hand on the head of the bull, and slaughter the bull before the LORD. "}],[{"type":"prose","content":"Then that high priest must take some of the blood of the bull and bring it to the Meeting Tent. "}],[{"type":"prose","content":"The priest must dip his finger in the blood and sprinkle some of it seven times before the LORD toward the front of the special curtain of the sanctuary. "}],[{"type":"prose","content":"The priest must put some of the blood on the horns of the altar of fragrant incense that is before the LORD in the Meeting Tent, and all the rest of the bull’s blood he must pour out at the base of the altar of burnt offering that is at the entrance of the Meeting Tent."}],[{"type":"prose","content":"“‘Then he must take up all the fat from the sin offering bull: the fat covering the entrails and all the fat surrounding the entrails, "}],[{"type":"prose","content":"the two kidneys with the fat on their sinews, and the protruding lobe on the liver (which he is to remove along with the kidneys) "}],[{"type":"prose","content":"—just as it is taken from the ox of the peace-offering sacrifice—and the priest must offer them up in smoke on the altar of burnt offering. "}],[{"type":"prose","content":"But the hide of the bull, all its flesh along with its head and its legs, its entrails, and its dung—"}],[{"type":"prose","content":"all the rest of the bull—he must bring outside the camp to a ceremonially clean place, to the fatty-ash pile, and he must burn it on a wood fire; it must be burned on the fatty-ash pile."}],[{"type":"header","content":"For the Whole Congregation"},{"type":"prose","content":"“‘If the whole congregation of Israel strays unintentionally and the matter is not noticed by the assembly, and they violate one of the LORD’s commandments, which must not be violated, so they become guilty, "}],[{"type":"prose","content":"the assembly must present a young bull for a sin offering when the sin they have committed becomes known. They must bring it before the Meeting Tent, "}],[{"type":"prose","content":"the elders of the congregation must lay their hands on the head of the bull before the LORD, and someone must slaughter the bull before the LORD. "}],[{"type":"prose","content":"Then the high priest must bring some of the blood of the bull to the Meeting Tent, "}],[{"type":"prose","content":"and that priest must dip his finger in the blood and sprinkle some of the blood seven times before the LORD toward the front of the curtain. "}],[{"type":"prose","content":"He must put some of the blood on the horns of the altar which is before the LORD in the Meeting Tent, and all the rest of the blood he must pour out at the base of the altar of burnt offering that is at the entrance of the Meeting Tent."}],[{"type":"prose","content":"“‘Then the priest must take all its fat and offer the fat up in smoke on the altar. "}],[{"type":"prose","content":"He must do with the rest of the bull just as he did with the bull of the sin offering; this is what he must do with it. So the priest will make atonement on their behalf and they will be forgiven. "}],[{"type":"prose","content":"He must bring the rest of the bull outside the camp and burn it just as he burned the first bull—it is the sin offering of the assembly."}],[{"type":"header","content":"For the Leader"},{"type":"prose","content":"“‘Whenever a leader, by straying unintentionally, sins and violates one of the commandments of the LORD his God which must not be violated, and he pleads guilty, "}],[{"type":"prose","content":"or his sin that he committed is made known to him, he must bring a flawless male goat as his offering. "}],[{"type":"prose","content":"He must lay his hand on the head of the male goat and slaughter it in the place where the burnt offering is slaughtered before the LORD—it is a sin offering. "}],[{"type":"prose","content":"Then the priest must take some of the blood of the sin offering with his finger and put it on the horns of the altar of burnt offering, and he must pour out the rest of its blood at the base of the altar of burnt offering. "}],[{"type":"prose","content":"Then the priest must offer all of its fat up in smoke on the altar like the fat of the peace-offering sacrifice. So the priest will make atonement on his behalf for his sin and he will be forgiven."}],[{"type":"header","content":"For the Common Person"},{"type":"prose","content":"“‘If an ordinary individual sins by straying unintentionally when he violates one of the LORD’s commandments which must not be violated, and he pleads guilty, "}],[{"type":"prose","content":"or his sin that he committed is made known to him, he must bring a flawless female goat as his offering for the sin that he committed. "}],[{"type":"prose","content":"He must lay his hand on the head of the sin offering and slaughter the sin offering in the place where the burnt offering is slaughtered. "}],[{"type":"prose","content":"Then the priest must take some of its blood with his finger and put it on the horns of the altar of burnt offering, and he must pour out all the rest of its blood at the base of the altar. "}],[{"type":"prose","content":"Then he must remove all of its fat (just as fat was removed from the peace-offering sacrifice) and the priest must offer it up in smoke on the altar for a soothing aroma to the LORD. So the priest will make atonement on his behalf and he will be forgiven."}],[{"type":"prose","content":"“‘But if he brings a sheep as his offering, for a sin offering, he must bring a flawless female. "}],[{"type":"prose","content":"He must lay his hand on the head of the sin offering and slaughter it for a sin offering in the place where the burnt offering is slaughtered. "}],[{"type":"prose","content":"Then the priest must take some of the blood of the sin offering with his finger and put it on the horns of the altar of burnt offering, and he must pour out all the rest of its blood at the base of the altar. "}],[{"type":"prose","content":"Then the one who brought the offering must remove all its fat (just as the fat of the sheep is removed from the peace-offering sacrifice) and the priest must offer them up in smoke on the altar on top of the other gifts for the LORD. So the priest will make atonement on his behalf for his sin which he has committed and he will be forgiven."}]]