[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(17-23) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Likewise, thou son of man, set thy face . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—This passage deals with a class of people the false prophetesses, who are not mentioned elsewhere in the Old Testament. True prophetesses, as in the case of Miriam (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 15:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), Deborah (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 4:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and, at this very time, Huldah (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Kings 22:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Chronicles 34:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and somewhat later, Noadiah (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nehemiah 6:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), are frequently spoken of, and continued to exist in New Testament times, as in the case of Anna (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 2:36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). It was naturally to be expected that as false prophets dogged the steps of the true, the same thing would happen with the other sex, and we find express mention of a false prophetess in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 2:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Their course, in prophesying “out of their own heart” deceiving the people, was essentially the same as that of the false prophets; but they are described as doing this in ways suited to their sex. Of the general meaning of this description there can be no doubt; but it is difficult to follow it with certainty in the details, because of the occurrence of some words of uncertain meaning, found nowhere else, and of some others in an unusual sense. Without attempting a discussion of each single word, (which would be useless except with a careful examination of the original), the following is given as the most probable translation of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 13:18-21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but it is to be remembered that several of the words, like the similar ones in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 3:16-24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", are so uncertain that there is a difference of opinion in regard to their exact meaning :—“Woe to those who fasten charms on every finger-joint, that place kerchiefs on heads of every height to snare souls. Will ye snare the souls of my people, and keep your own souls alive? (19) And will ye profane me with my people for handfuls of barley, and for pieces of bread, to slay souls that should not die, and to make live souls that should not live, by your lying to my people who hearken to a lie? (20) Therefore, thus saith the Lord Jehovah, Behold, I am against your charms, when ye snare the souls like birds, and I will tear them from your arms, and will let the souls go, the souls that ye are snaring like birds. (21) Your kerchiefs also will I tear, and deliver my people out of your hand, and they shall be no more in your hand to be snared; and ye shall know that I am the Lord.” (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "See Excursus 8 ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "at the end of this book, on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 13:6-7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 13:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Ezekiel 13:17-19",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 13:17-19",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Likewise, set thy face against the daughters of thy people — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Direct thy discourse against the female pretenders to prophecy. God sometimes bestowed the gift of prophecy upon women, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 15:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jdg 9:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 22:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This encouraged others of that sex to pretend to the same gift: compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 2:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Wo to the women that sew pillows, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — As the prophet compares the deceitful practices of the false prophets to the daubing of a wall, so he represents the artifices of these female seducers by sewing pillows under the hearers’ arms, that they might rest securely in their evil ways. “The eastern mode of sitting,” says Harmer, chap. 6. observ. 35, “supported by pillows, explains this representation of Ezekiel. Dr. Russel has given us a print representing a fine eastern lady reposing herself on one of these bolsters, or pillows, by leaning with one of her arms on one of them, while she is smoking.” In Barbary and the Levant they “always cover the floors of their houses with carpets; and along the sides of the wall, or floor, a range of narrow beds, or mattresses, is often placed upon these carpets; and, for their further ease and convenience, several velvet or damask bolsters are placed upon these carpets or mattresses: indulgences that seem to be alluded to by the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "stretching of themselves upon couches, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and by the sewing of pillows to arm-holes.” — Shaw’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Travels, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "p. 209, second edition. Sir John Chardin also mentions “a mattress, with large cushions, placed at the back and sides” of the person who uses it as a bed, Harm., vol. 2., chap. 6. observ. 46. See also, to the same purpose, Lady M. W. Montague’s description of a Turkish lady’s apartment, let. 32, vol. 2. p. 55. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And make kerchiefs upon the head of every stature — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Upon every head, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "כל ראשׁ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of every stature, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "the false prophetess doing this without distinction of stature or age. “This,” says Bishop Newcome, “may be a strong, eastern manner of expressing that these women ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "hoodwinked ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "their votaries, and kept them in spiritual darkness.” In the same light the passage is considered by Lowth and many others. “Or the covering of the head may have been of the ornamental kind, to denote prosperity or victory, as pillows denoted tranquillity and plenty; and both may have been significantly applied to the heads and arms of those who consulted the prophetesses.” Thus we are told by Dr. Shaw, p. 221, and Lady M. W. Montague, vol. 2. p. 30, that the eastern women bind on their other ornaments for the head with a handkerchief, which the latter calls “a rich embroidered handkerchief.” These prophetesses, therefore, Harmer thinks, “did the same thing by their flattering words, as would have been best expressed, if they had thought fit to signify the same thing by actions only, (as the prophets sometimes did,) by making bolsters for the arms, and presenting them to the Israelitish women, whom they wanted to assure of the continuance of their prosperity; and embroidering handkerchiefs, proper to bind over the ornaments of females in a state of honour, and afterward putting them on their heads. Whereas, the true prophets of God gave them to understand, in direct contradiction to all this, that if the Jews would not yield up themselves to the Chaldeans, great numbers of their men should perish, and their women should be brought down from those elevated places in which they sat supported by rich bolsters, and should be forced to sit on the ground; and, instead of a rich attire for their heads, should have their hair miserably dishevelled, strongly marking out grief in a despairing neglect of their persons. Such is the description Isaiah gives of the state of captives, (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 47:1-2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) which every one must see is just the reverse of what these prophetesses are represented as doing: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Come down and sit in the dust, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c.” — Harmer, chap. 6., observ. 35.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "To hunt souls — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "To allure, draw, or drive men into those nets and snares that they have laid for them, and thereby to make them their prey. Or to destroy men, to expose them to the divine vengeance, by lulling them into security, and enticing them to commit sin in following their directions. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Will ye hunt the souls of my people? — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Will ye make a prey of men’s souls by deluding them with fair promises and vain hopes? Will ye draw my people into destruction, by promising them safety and happiness, while they continue in sin? “This verse,” says Secker, “should seem to mean, that these women made every body easy to their ruin, for their own profit.” ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Will ye pollute me among my people? — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Will ye profane my name, by making use of it to give credit to your own dreams and lies? Or, Will ye dishonour it by employing it to the vilest use, the encouraging of wickedness, and the discouraging of piety and virtue? ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For handfuls of barley, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — For the sake of gain to yourselves, even for the meanest presents? It is well known how customary gifts were, and still are, in the East. These false prophets and prophetesses being chiefly, if not solely, consulted by the corrupt and wicked part of the Jews, who made them presents for their answers; and those presents being generally the larger the more agreeable the answers were, therefore these prophets and prophetesses always uttered what was pleasing, and gave encouragement to the wicked, and what tended to disgrace and discourage the truly good. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "To slay the souls that should not die — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "To denounce or prophesy death and destruction to those that shall be preserved. Thus they denounced death to those who yielded themselves to the Chaldeans in Jeconiah’s captivity, whom God had determined to preserve alive, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 29:5-6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And they encouraged those who remained at Jerusalem, with promises of peace and safety, who, God had foretold, should perish: see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 5:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Or the words may be understood, in a more general sense, of discouraging the godly, and confirming the wicked in their evil ways: see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 13:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 23:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 23:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". To ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "slay, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "make alive, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "signify here, to promise men life, or threaten them with death. So the prophet says he came ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to destroy the city, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 43:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) when he came to pronounce the sentence of destruction upon it. — Lowth.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13:17-23 It is ill with those who had rather hear pleasing lies than unpleasing truths. The false prophetesses tried to make people secure, signified by laying them at ease, and to make them proud, signified by the finery laid on their heads. They shall be confounded in their attempts, and God's people shall be delivered out of their hands. It behoves Christians to keep close to the word of God, and in every thing to seek the teaching of the Holy Spirit. Let us so trust the promises of God as to keep his commandments.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "A rebuke to the false prophetesses, and a declaration that God will confound them, and deliver their victims from their snares. Women were sometimes inspired by the true God, as were Miriam, Deborah, Hannah, and Huldah; but an order of prophetesses was unknown among the people of God, and the existence of such a class in the last days of the kings of Judah was a fresh instance of declension into pagan usages.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ezekiel 13:18-21. Render thus: \"Woe to the women that\" put charms on every finger-joint, that set veils upon heads of every height to ensnare souls. \"Will ye\" ensnare \"the souls of my people,\" and keep your own souls alive, and will ye profane my name \"among my people for handfuls of barley and pieces of bread, to slay the souls that should not die, and to\" keep alive \"the souls that should not live, by lying to my people\" who listen to \"a lie? Wherefore thus saith the Lord God, Behold\" I will come upon your charms, where ye are ensnaring the souls like birds; \"and I will tear them from your arms and will let the souls go\" free, \"even the souls\" which ye are ensnaring like birds. \"Your\" veils \"also will I tear, and deliver my people out of your hand, and they shall be no more in your hand to be\" ensnared; \"and ye shall know that I am the Lord.\"",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 13:18-21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Render thus: \"Woe to the women that\" put charms on every finger-joint, that set veils upon heads of every height to ensnare souls. \"Will ye\" ensnare \"the souls of my people,\" and keep your own souls alive, and will ye profane my name \"among my people for handfuls of barley and pieces of bread, to slay the souls that should not die, and to\" keep alive \"the souls that should not live, by lying to my people\" who listen to \"a lie? Wherefore thus saith the Lord God, Behold\" I will come upon your charms, where ye are ensnaring the souls like birds; \"and I will tear them from your arms and will let the souls go\" free, \"even the souls\" which ye are ensnaring like birds. \"Your\" veils \"also will I tear, and deliver my people out of your hand, and they shall be no more in your hand to be\" ensnared; \"and ye shall know that I am the Lord.\"",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Most ancient interpreters and many modern interpreters have understood the \"pillows\" (or charms) and \"kerchiefs\" (or veils), as appliances to which the sorcerers had resort in order to attract notice. The veil was a conspicuous ornament in the east - women whatever their \"stature\" (or, height) putting them on - and it was worn by magicians in order to seem more mysterious and awful.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Most ancient interpreters and many modern interpreters have understood the \"pillows\" (or charms) and \"kerchiefs\" (or veils), as appliances to which the sorcerers had resort in order to attract notice. The veil was a conspicuous ornament in the east - women whatever their \"stature\" (or, height) putting them on - and it was worn by magicians in order to seem more mysterious and awful.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "17. set thy face—put on a bold countenance, fearlessly to denounce them (Eze 3:8, 9; Isa 50:7).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "daughters—the false prophetesses; alluded to only here; elsewhere the guilt specified in the women is the active share they took in maintaining idolatry (Eze 8:14). It was only in extraordinary emergencies that God bestowed prophecy on women, for example on Miriam, Deborah, Huldah (Ex 15:20; Jud 4:4; 2Ki 22:14); so in the last days to come (Joe 2:28). The rareness of such instances enhanced their guilt in pretending inspiration.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Now turn thyself and discourse against the prophetesses, fear them not: see the phrase, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ezekiel 4:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 4:3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". Some would have the prophet’s words to be intended against the effeminate men, who were of no value, and by contempt called the daughters of his people; but I see no cause why the prophet’s words should not be directed against the women who pretended to be prophetesses. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Of thy people, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that were with him in Babylon. Or rather, because they were Jews, they are called daughters of his people. Or might they not be daughters of priests, and so more nearly of kin to Ezekiel? ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Which prophesy; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " there were women who had the gift of prophecy, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Exodus 15:20 Judges 4:4 2 Kings 22:14 Joel 2:28",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 15:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 4:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 22:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joel 2:28",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and brought messages from God, but these in the text pretend themselves to be prophetesses, and speak their own imaginations, and fasten their lies on the God of truth. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Likewise, thou son of man, set thy face against the daughters of thy people,.... The false prophetesses; for as there were women in some ages, who had the true spirit of prophecy, as Miriam, Deborah, and Huldah, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 15:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; so there were some that pretended to it, who had it not, as Noadiah in the times of Nehemiah, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nehemiah 6:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and such there were in the times of Ezekiel; against whom he is bid to set his face, and look them out of countenance, and make them ashamed; who, contrary to the modesty of the sex, had impudently taken upon them to prophesy to the people; and such have been since in the times of the Gospel, as Jezebel, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 2:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and Prisca, Maximilia, Quintilia, and others: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "who prophesy out of their own heart; as the men did, Ezekiel 13:2; what their own hearts suggested to them; what came into their minds, and their own fancies and imaginations led them to; what was according to their carnal affections and desires, and agreeable to those that heard them: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "who prophesy out of their own heart; as the men did, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 13:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; what their own hearts suggested to them; what came into their minds, and their own fancies and imaginations led them to; what was according to their carnal affections and desires, and agreeable to those that heard them: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and prophesy thou against them; declare their prophecies false; warn the people from giving heed to them; and foretell what shall befall them for deceiving the people. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and prophesy thou against them; declare their prophecies false; warn the people from giving heed to them; and foretell what shall befall them for deceiving the people. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Likewise, thou son of man, set thy face against the daughters of thy people, which prophesy out of their own heart; and prophesy thou against them,",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "17–23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Denunciation of the false prophetesses",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Female prophets were not unknown in Israel whether in earlier or later times, as Deborah (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jdg 4:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") and Huldah (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 22:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The prophetesses referred to here were like the prophets, prophesying out of their own heart (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ezekiel 13:17",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 13:17",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "). Their prophesying was by some species of divination, which they used in order to obtain oracles. The methods of divination practised are somewhat obscure: they bound fillets upon the joints and threw cloths or veils over the heads of those who consulted them. By these means they “hunted” souls; they saved souls alive that should not live and slew souls that should not die (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ezekiel 13:19",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 13:19",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "), or as expressed otherwise, they made the heart of the righteous sad and strengthened the hands of the wicked (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ezekiel 13:22",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 13:22",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "). In other words like the false prophets they misled the people, promising life to the ungodly and prophesying disaster to those who were righteous.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 17.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Set thy face against the daughters of thy people.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Here we note that the formula, \"thy people,\" of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 3:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " reappears. The section which follows (vers. 17-23) throws an interesting side light on the position of women in the religious life of Israel. For good as for evil, their influence was stronger there than in most other nations. Miriam had led the way (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 15:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and had been followed by Deborah (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 5:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Huldah had been almost as prominent in Josiah's reformation as Hilkiah the high priest (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 22:14-20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 34:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). It was but natural that there should be women on the other side also, guiding their own sex; and it is probable that Ezekiel had in his thoughts some special leaders who headed the women of Jerusalem in their opposition to Jeremiah, as afterwards at Pathros (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 44:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). So, later on, we have the prophetess Noadiah heading the opposition to Nehemiah (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nehemiah 6:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); and in the New Testament, on the one hand, Anns (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 2:36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") and the daughters of Philip (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 21:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and on the other, the ill-regulated prophetesses of Corinth (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 11:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") and the woman Jezebel, who called herself a prophetess (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 2:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Ezekiel 13:17",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Against the False Prophetesses",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "As the Lord had not endowed men only with the gifts of prophecy, but sometimes women also, e.g., Miriam, Deborah, and Huldah; so women also rose up along with the false prophets, and prophesied out of their own hearts without being impelled by the Spirit of God. Ezekiel 13:17-19. Their conduct. - Ezekiel 13:17. And thou, son of man, direct thy face towards the daughters of thy people, who prophesy out of their heart and prophesy against them, Ezekiel 13:18. And say, Thus saith the Lord Jehovah, Woe to those who sew coverings together over all the joints of my hands, and make caps for the head of every size, to catch souls! Ye catch the souls of my people, and keep your souls alive. Ezekiel 13:19. And ye profane me with my people for handfuls of barley and for pieces of bread, to slay souls which should not die, and to keep alive which should not live, by your lying to my people who hearken to lying. - Like the prophets in Ezekiel 13:2, the prophetesses are here described as prophesying out of their own heart (Ezekiel 13:17); and in Ezekiel 13:18 and Ezekiel 13:19 their offences are more particularly described. The meaning of these verses is entirely dependent upon the view to be taken of ידי, which the majority of expositors, following the lead of the lxx, the Syriac, and the Vulgate, have regarded as identical with ידים or יד, and understood as referring to the hands of the women or prophetesses. But there is nothing to justify the assumption that ידי is an unusual form for ידים, which even Ewald takes it to be (Lehrbuch, 177a). Still less can it stand for the singular יד. And we have not sufficient ground for altering the text, as the expression זרועתיכם in Ezekiel 13:20 (I will tear the כּסתות from your arms) does not require the assumption that the prophetesses had hidden their arms in כסתות; and such a supposition is by no means obviously in harmony with the facts.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "As the Lord had not endowed men only with the gifts of prophecy, but sometimes women also, e.g., Miriam, Deborah, and Huldah; so women also rose up along with the false prophets, and prophesied out of their own hearts without being impelled by the Spirit of God. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 13:17-19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Their conduct. - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 13:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And thou, son of man, direct thy face towards the daughters of thy people, who prophesy out of their heart and prophesy against them, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 13:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And say, Thus saith the Lord Jehovah, Woe to those who sew coverings together over all the joints of my hands, and make caps for the head of every size, to catch souls! Ye catch the souls of my people, and keep your souls alive. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 13:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And ye profane me with my people for handfuls of barley and for pieces of bread, to slay souls which should not die, and to keep alive which should not live, by your lying to my people who hearken to lying. - Like the prophets in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 13:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the prophetesses are here described as prophesying out of their own heart (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 13:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); and in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 13:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 13:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " their offences are more particularly described. The meaning of these verses is entirely dependent upon the view to be taken of ידי, which the majority of expositors, following the lead of the lxx, the Syriac, and the Vulgate, have regarded as identical with ידים or יד, and understood as referring to the hands of the women or prophetesses. But there is nothing to justify the assumption that ידי is an unusual form for ידים, which even Ewald takes it to be (Lehrbuch, 177a). Still less can it stand for the singular יד. And we have not sufficient ground for altering the text, as the expression זרועתיכם in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 13:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (I will tear the כּסתות from your arms) does not require the assumption that the prophetesses had hidden their arms in כסתות; and such a supposition is by no means obviously in harmony with the facts.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The word כּסתות, from כּסת, with ת fem. treated as a radical letter (cf. Ewald, 186e), means a covering or concealment  equals  כּסוּת. The meaning \"cushion\" or \"pillow\" (lxx προσκεφάλαια, Vulg. pulvilli) is merely an inference drawn from this passage, and is decidedly erroneous; for the word תּפר (to sew together) is inapplicable to cushions, as well as the phrase על כּל־אצּילי ידי, inasmuch as cushions are not placed upon the joints of the hands, and still less are they sewed together upon them. The latter is also a decisive reason for rejecting the explanation given by Hvernick, namely, that the kesâthōth were carpets, which were used as couches, and upon which these voluptuous women are represented as reclining. For cushions or couches are not placed upon, but under, the arm-joints (or elbows) and the shoulders, which Hvernick understands by אצּילי יד. This also overthrows another explanation given of the words, namely, that they refer to carpets, which the prophetesses had sewed together for all their arm-joints, so as to form comfortable beds upon splendid carpets, that they may indulge in licentiousness thereon. The explanation given by Ephraem Syrus, and adopted by Hitzig, namely, that the kesâthōth were amulets or straps, which they would round their arm-joints when they received or delivered their oracles, is equally untenable. For, as Kliefoth has observed, \"it is evident that there is not a word in the text about adultery, or amulets, or straps used in prayer.\" And again, when we proceed to the next clause, the traditional rendering of מספּחות, as signifying either pillows (ὑπαυχένια, Symm.; cervicalia, Vulg.) or broad cloaks  equals  מטפּחות (Hitzig, Hvernick, etc.), is neither supported by the usage of the language, nor in harmony with על ראשׁ. Mispâchōth, from sâphach, to join, cannot have any other meaning in the present context than a cap fitting close to the head; and על must denote the pattern which was followed, as in Psalm 110:4; Esther 9:26 : they make the caps after (answering to) the head of every stature. The words of both clauses are figurative, and have been correctly explained by Kliefoth as follows: \"A double charge is brought against the prophetesses. In the first place, they sew coverings together to wrap round all the joints of the hand of God, so that He cannot touch them; i.e., they cover up and conceal the word of God by their prophesying, more especially its rebuking and threatening force, so that the threatening and judicial arm of God, which ought above all to become both manifest and effective through His prophetic word, does not become either one or the other. In the second place, they make coverings upon the heads of men, and construct them in such a form that they exactly fit the stature or size or every individual, so that the men neither hear nor see; i.e., by means of their flattering lies, which adapt themselves to the subjective inclinations of their hearers at the time, they cover up the senses of the men, so that they retain neither ear nor eye for the truth.\" They do both of these to catch souls. The inevitable consequence of their act is represented as having been intended by them; and this intention is then still further defined as being to catch the souls of the people of God; i.e., to allure them to destruction, and take care of their own souls. The clause הנּפשׁות תּצודדנה is not to be taken as a question, \"Will ye catch the souls?\" implying a doubt whether they really thought that they could carry on such conduct as theirs with perfect impunity (Hvernick). It contains a simple statement of what really took place in their catching of souls, namely, \"they catch the souls of the people of God, and preserve their own souls;\" i.e., they rob the people of God of their lives, and take care of their own (Kliefoth). לעמּי is used instead of the genitive (stat. constr.) to show that the accent rests upon עמּי. And in the same way we have לכנה instead of the suffix. The construction is the same as in 1 Samuel 14:16. Ezekiel 13:19 shows how great their sin had been. They profane God among His people; namely, by delivering the suggestions of their own heart to the people as divine revelations, for the purpose of getting their daily bread thereby (cf. Micah 3:5); by hurling into destruction, through their lies, those who are only too glad to listen to lying; by slaying the souls of the people which ought to live, and by preserving those which ought not to live, i.e., their own souls (Deuteronomy 18:20). The punishment for this will not fail to come. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The word כּסתות, from כּסת, with ת fem. treated as a radical letter (cf. Ewald, 186e), means a covering or concealment  equals  כּסוּת. The meaning \"cushion\" or \"pillow\" (lxx προσκεφάλαια, Vulg. pulvilli) is merely an inference drawn from this passage, and is decidedly erroneous; for the word תּפר (to sew together) is inapplicable to cushions, as well as the phrase על כּל־אצּילי ידי, inasmuch as cushions are not placed upon the joints of the hands, and still less are they sewed together upon them. The latter is also a decisive reason for rejecting the explanation given by Hvernick, namely, that the kesâthōth were carpets, which were used as couches, and upon which these voluptuous women are represented as reclining. For cushions or couches are not placed upon, but under, the arm-joints (or elbows) and the shoulders, which Hvernick understands by אצּילי יד. This also overthrows another explanation given of the words, namely, that they refer to carpets, which the prophetesses had sewed together for all their arm-joints, so as to form comfortable beds upon splendid carpets, that they may indulge in licentiousness thereon. The explanation given by Ephraem Syrus, and adopted by Hitzig, namely, that the kesâthōth were amulets or straps, which they would round their arm-joints when they received or delivered their oracles, is equally untenable. For, as Kliefoth has observed, \"it is evident that there is not a word in the text about adultery, or amulets, or straps used in prayer.\" And again, when we proceed to the next clause, the traditional rendering of מספּחות, as signifying either pillows (ὑπαυχένια, Symm.; cervicalia, Vulg.) or broad cloaks  equals  מטפּחות (Hitzig, Hvernick, etc.), is neither supported by the usage of the language, nor in harmony with על ראשׁ. Mispâchōth, from sâphach, to join, cannot have any other meaning in the present context than a cap fitting close to the head; and על must denote the pattern which was followed, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 110:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Esther 9:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : they make the caps after (answering to) the head of every stature. The words of both clauses are figurative, and have been correctly explained by Kliefoth as follows: \"A double charge is brought against the prophetesses. In the first place, they sew coverings together to wrap round all the joints of the hand of God, so that He cannot touch them; i.e., they cover up and conceal the word of God by their prophesying, more especially its rebuking and threatening force, so that the threatening and judicial arm of God, which ought above all to become both manifest and effective through His prophetic word, does not become either one or the other. In the second place, they make coverings upon the heads of men, and construct them in such a form that they exactly fit the stature or size or every individual, so that the men neither hear nor see; i.e., by means of their flattering lies, which adapt themselves to the subjective inclinations of their hearers at the time, they cover up the senses of the men, so that they retain neither ear nor eye for the truth.\" They do both of these to catch souls. The inevitable consequence of their act is represented as having been intended by them; and this intention is then still further defined as being to catch the souls of the people of God; i.e., to allure them to destruction, and take care of their own souls. The clause הנּפשׁות תּצודדנה is not to be taken as a question, \"Will ye catch the souls?\" implying a doubt whether they really thought that they could carry on such conduct as theirs with perfect impunity (Hvernick). It contains a simple statement of what really took place in their catching of souls, namely, \"they catch the souls of the people of God, and preserve their own souls;\" i.e., they rob the people of God of their lives, and take care of their own (Kliefoth). לעמּי is used instead of the genitive (stat. constr.) to show that the accent rests upon עמּי. And in the same way we have לכנה instead of the suffix. The construction is the same as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 14:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 13:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " shows how great their sin had been. They profane God among His people; namely, by delivering the suggestions of their own heart to the people as divine revelations, for the purpose of getting their daily bread thereby (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 3:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); by hurling into destruction, through their lies, those who are only too glad to listen to lying; by slaying the souls of the people which ought to live, and by preserving those which ought not to live, i.e., their own souls (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 18:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The punishment for this will not fail to come. ",
            "children": []
          }
        ]
      }
    ]
  }
]