[{"header":"Satan Appears Before the Lord Again"},{"num":2,"verse":"On another day the angels came to show themselves before the Lord, and Satan was with them again. "},{"num":2,"verse":"The Lord said to Satan, “Where have you come from?”"},{"num":3,"verse":"Then the Lord said to Satan, “Have you noticed my servant Job? No one else on earth is like him. He is an honest and innocent man, honoring God and staying away from evil. You caused me to ruin him for no good reason, but he continues to be without blame.”"},{"num":4,"verse":"“One skin for another!” Satan answered. “A man will give all he has to save his own life. "},{"num":5,"verse":"But reach out your hand and destroy his flesh and bones, and he will curse you to your face.”"},{"num":6,"verse":"The Lord said to Satan, “All right, then. Job is in your power, but you may not take his life.”"},{"num":7,"verse":"So Satan left the Lord’s presence. He put painful sores on Job’s body, from the top of his head to the soles of his feet. "},{"num":8,"verse":"Job took a piece of broken pottery to scrape himself, and he sat in ashes in misery."},{"num":9,"verse":"Job’s wife said to him, “Why are you trying to stay innocent? Curse God and die!”"},{"num":10,"verse":"Job answered, “You are talking like a foolish woman. Should we take only good things from God and not trouble?” In spite of all this Job did not sin in what he said."},{"header":"Job’s Three Friends Come to Help"},{"num":11,"verse":"Now Job had three friends: Eliphaz the Temanite, Bildad the Shuhite, and Zophar the Naamathite. When these friends heard about Job’s troubles, they agreed to meet and visit him. They wanted to show their concern and to comfort him. "},{"num":12,"verse":"They saw Job from far away, but he looked so different they almost didn’t recognize him. They began to cry loudly and tore their robes and put dirt on their heads to show how sad they were. "},{"num":13,"verse":"Then they sat on the ground with Job seven days and seven nights. No one said a word to him because they saw how much he was suffering."}]