[{"num":2,"verse":"Again there was a day when the Bnei HaElohim came to present themselves before Hashem, and Hasatan came also among them to present himself before Hashem."},{"num":2,"verse":"And Hashem said unto Hasatan, From where comest thou? And Hasatan answered Hashem, and said, From going to and fro through ha’aretz, and from walking up and down in it."},{"num":3,"verse":"And Hashem said unto Hasatan, Hast thou considered in your meditation Avdi (My Servant) Iyov, that there is none like him in ha’aretz, ish tam and yashar, yire Elohim, and shunning rah? And still he holdeth fast his integrity, although thou inciteth Me against him, to ruin him for no reason."},{"num":4,"verse":"And Hasatan answered Hashem, and said, Skin for skin, yea, all that an ish hath will he give for his nefesh."},{"num":5,"verse":"But stretch forth Thine yad now, and touch his etzem and his basar, and he will curse Thee to Thy face."},{"num":6,"verse":"And Hashem said unto Hasatan, Hinei, he is in thine yad; but spare his nefesh."},{"num":7,"verse":"So went Hasatan out from the presence of Hashem, and afflicted Iyov with shekhin rah (foul boils) from the sole of his regel unto the top of his head."},{"num":8,"verse":"And he took him a cheres (potsherd, piece of broken pottery) to scrape himself withal; and he sat down among the ashes."},{"num":9,"verse":"Then said his isha unto him, Dost thou still retain thine integrity? Curse Elohim, and die."},{"num":10,"verse":"But he said unto her, Thou speakest as one of the nevalot (foolish women) speaketh. What? Shall we receive hatov from Elohim, and shall we not accept harah? In all this did not Iyov sin in what he said."},{"num":11,"verse":"Now when the three friends of Iyov heard of all this ra’ah that had come upon him, they came every one from his own place; Eliphaz the Temani, and Bildad the Shuchi, and Tzophar the Na’amati; for they had made an appointment together to come to sympathize with him and to comfort him."},{"num":12,"verse":"And when they lifted up their eyes afar off, and recognized him not, they lifted up their voice, and wept; and they made the keri’ah every one on his mantle, and sprinkled dust upon their heads toward Shomayim."},{"num":13,"verse":"So they sat [shiva] with him upon the ground shivat yamim and shivat lailah, and none spoke a word unto him; for they saw that his suffering was very great."}]