[{"header":"Promote Right Teaching"},{"num":2,"verse":"As for you, Titus, promote the kind of living that reflects wholesome teaching."},{"num":2,"verse":"Teach the older men to exercise self-control, to be worthy of respect, and to live wisely. They must have sound faith and be filled with love and patience."},{"num":3,"verse":"Similarly, teach the older women to live in a way that honors God. They must not slander others or be heavy drinkers. Instead, they should teach others what is good."},{"num":4,"verse":"These older women must train the younger women to love their husbands and their children,"},{"num":5,"verse":"to live wisely and be pure, to work in their homes, to do good, and to be submissive to their husbands. Then they will not bring shame on the word of God."},{"num":6,"verse":"In the same way, encourage the young men to live wisely."},{"num":7,"verse":"And you yourself must be an example to them by doing good works of every kind. Let everything you do reflect the integrity and seriousness of your teaching."},{"num":8,"verse":"Teach the truth so that your teaching can’t be criticized. Then those who oppose us will be ashamed and have nothing bad to say about us."},{"num":9,"verse":"Slaves must always obey their masters and do their best to please them. They must not talk back"},{"num":10,"verse":"or steal, but must show themselves to be entirely trustworthy and good. Then they will make the teaching about God our Savior attractive in every way."},{"num":11,"verse":"For the grace of God has been revealed, bringing salvation to all people."},{"num":12,"verse":"And we are instructed to turn from godless living and sinful pleasures. We should live in this evil world with wisdom, righteousness, and devotion to God,"},{"num":13,"verse":"while we look forward with hope to that wonderful day when the glory of our great God and Savior, Jesus Christ, will be revealed."},{"num":14,"verse":"He gave his life to free us from every kind of sin, to cleanse us, and to make us his very own people, totally committed to doing good deeds."},{"num":15,"verse":"You must teach these things and encourage the believers to do them. You have the authority to correct them when necessary, so don’t let anyone disregard what you say."}]