[{"num":26,"verse":"A famine came over the land, not the same as the first famine, which had taken place when Avraham was alive. Yitz’chak went to G’rar, to Avimelekh king of the P’lishtim. "},{"num":2,"verse":"Adonai appeared to him and said, “Don’t go down into Egypt, but live where I tell you. "},{"num":3,"verse":"Stay in this land, and I will be with you and bless you, because I will give all these lands to you and to your descendants. I will fulfill the oath which I swore to Avraham your father — "},{"num":4,"verse":"I will make your descendants as numerous as the stars in the sky, I will give all these lands to your descendants, and by your descendants all the nations of the earth will bless themselves. "},{"num":5,"verse":"All this is because Avraham heeded what I said and did what I told him to do — he followed my mitzvot, my regulations and my teachings.”"},{"num":6,"verse":"(ii) So Yitz’chak settled in G’rar. "},{"num":7,"verse":"The men of the place asked him about his wife, and out of fear he said, “She is my sister.” He thought, “If I tell them she’s my wife, they might kill me in order to take Rivkah. After all, she is a beautiful woman.” "},{"num":8,"verse":"But one day, after he had lived there a long time, Avimelekh king of the P’lishtim happened to be looking out of a window when he spotted Yitz’chak caressing Rivkah his wife. "},{"num":9,"verse":"Avimelekh summoned Yitz’chak and said, “So she is your wife, after all! How come you said, ‘She is my sister’?” Yitz’chak responded, “Because I thought, ‘I could get killed because of her.’” "},{"num":10,"verse":"Avimelekh said, “What is this you have done to us? One of the people could easily have slept with your wife, and you would have brought guilt on us!” "},{"num":11,"verse":"Then Avimelekh warned all the people: “Whoever touches this man or his wife will certainly be put to death.”"},{"num":12,"verse":"Yitz’chak planted crops in that land and reaped that year a hundred times as much as he had sowed. Adonai had blessed him."},{"num":13,"verse":"(iii) The man became rich and prospered more and more, until he had become very wealthy indeed. "},{"num":14,"verse":"He had flocks, cattle and a large household; and the P’lishtim envied him. "},{"num":15,"verse":"Now the P’lishtim had stopped up and filled with dirt all the wells his father’s servants had dug during the lifetime of Avraham his father. "},{"num":16,"verse":"Avimelekh said to Yitz’chak, “You must go away from us, because you have become much more powerful than we are.” "},{"num":17,"verse":"So Yitz’chak left, set up camp in Vadi G’rar and lived there. "},{"num":18,"verse":"Yitz’chak reopened the wells which had been dug during the lifetime of Avraham his father, the ones the P’lishtim had stopped up after Avraham died, and called them by the names his father had used for them. "},{"num":19,"verse":"Yitz’chak’s servants dug in the vadi and uncovered a spring of running water. "},{"num":20,"verse":"But the herdsmen of G’rar quarreled with Yitz’chak’s herdsmen, claiming, “That water is ours!” So he called the well ‘Esek [quarrel], because they quarreled with him. "},{"num":21,"verse":"They dug another well and quarreled over that one too. So he called it Sitnah [enmity]. "},{"num":22,"verse":"He went away from there and dug another well, and over that one they didn’t quarrel. So he called it Rechovot [wide open spaces] and said, “Because now Adonai has made room for us, and we will be productive in the land.”"},{"num":23,"verse":"(iv) From there Yitz’chak went up to Be’er-Sheva. "},{"num":24,"verse":"Adonai appeared to him that same night and said, “I am the God of Avraham your father. Don’t be afraid, because I am with you; I will bless you and increase your descendants for the sake of my servant Avraham.” "},{"num":25,"verse":"There he built an altar and called on the name of Adonai. He pitched his tent there, and there Yitz’chak’s servants dug a well."},{"num":26,"verse":"Then Avimelekh went to him from G’rar with his friend Achuzat and Pikhol the commander of his army. "},{"num":27,"verse":"Yitz’chak said to them, “Why have you come to me, even though you were unfriendly to me and sent me away?” "},{"num":28,"verse":"They answered, “We saw very clearly that Adonai has been with you; so we said, ‘Let there be an oath between us: let’s make a pact between ourselves and you "},{"num":29,"verse":"that you will not harm us, just as we have not caused you offense but have done you nothing but good and sent you on your way in peace. Now you are blessed by Adonai.’”"},{"num":30,"verse":"(v) Yitz’chak prepared a banquet for them, and they ate and drank. "},{"num":31,"verse":"The next morning, they got up early and swore to each other. Then Yitz’chak sent them on their way, and they left him peacefully. "},{"num":32,"verse":"That very day Yitz’chak’s servants came and told him about the well they had dug, “We have found water.” "},{"num":33,"verse":"So he called it Shiv‘ah [oath, seven], and for this reason the name of the city is Be’er-Sheva [well of seven, well of an oath] to this day."},{"num":34,"verse":"When ‘Esav was forty years old, he took as wives Y’hudit the daughter of Be’eri the Hitti and Basmat the daughter of Elon the Hitti. "},{"num":35,"verse":"But they became a cause for embitterment of spirit to Yitz’chak and Rivkah."}]