[{"header":"The Lord’s First Promise to Isaac"},{"num":26,"verse":"There was a famine in the land in addition to the earlier one during Abraham’s time. So Isaac went to King Abimelech of the Philistines in Gerar."},{"num":2,"verse":"The Lord appeared to Isaac and said, “Don’t go to Egypt. Stay where I tell you. "},{"num":3,"verse":"Live here in this land for a while, and I will be with you and bless you. I will give all these lands to you and your descendants. I will keep the oath that I swore to your father Abraham. "},{"num":4,"verse":"I will make your descendants as numerous as the stars in the sky and give all these lands to your descendants. Through your descendant all the nations of the earth will be blessed. "},{"num":5,"verse":"I will bless you because Abraham obeyed me and completed the duties, commands, laws, and instructions I gave him.” "},{"num":6,"verse":"So Isaac lived in Gerar."},{"header":"Isaac and Rebekah at Gerar"},{"num":7,"verse":"When the men of that place asked about his wife, Isaac answered, “She’s my sister.” He was afraid to say “my wife.” He thought that the men of that place would kill him to get Rebekah, because she was an attractive woman. "},{"num":8,"verse":"When he had been there a long time, King Abimelech of the Philistines looked out of his window and saw Isaac caressing his wife Rebekah."},{"num":9,"verse":"Abimelech called for Isaac and said, “So she’s really your wife! How could you say, ‘She’s my sister’?”"},{"num":10,"verse":"Then Abimelech said, “What have you done to us! One of the people might have easily gone to bed with your wife, and then you would have made us guilty of sin.” "},{"num":11,"verse":"So Abimelech ordered his people, “Anyone who touches this man or his wife will be put to death.”"},{"num":12,"verse":"Isaac planted ⌞crops⌟ in that land. In that same year he harvested a hundred times as much as he had planted because the Lord had blessed him. "},{"num":13,"verse":"He continued to be successful, becoming very rich. "},{"num":14,"verse":"Because he owned so many flocks, herds, and servants, the Philistines became jealous of him. "},{"num":15,"verse":"So the Philistines filled in all the wells that his father’s servants had dug during his father Abraham’s lifetime."},{"num":16,"verse":"Finally, Abimelech said to Isaac, “Go away from us! You’ve become more powerful than we are.”"},{"num":17,"verse":"So Isaac moved away. He set up his tents in the Gerar Valley and lived there. "},{"num":18,"verse":"He dug out the wells that had been dug during his father Abraham’s lifetime. The Philistines had filled them in after Abraham’s death. He gave them the same names that his father had given them."},{"num":19,"verse":"Isaac’s servants dug in the valley and found a spring-fed well. "},{"num":20,"verse":"The herders from Gerar quarreled with Isaac’s herders, claiming, “This water is ours!” So Isaac named the well Esek [Argument], because they had argued with him. "},{"num":21,"verse":"Then they dug another well, and they quarreled over that one too. So Isaac named it Sitnah [Accusation]. "},{"num":22,"verse":"He moved on from there and dug another well. They didn’t quarrel over this one. So he named it Rehoboth [Roomy] and said, “Now the Lord has made room for us, and we will prosper in this land.”"},{"header":"The Lord’s Second Promise to Isaac"},{"num":23,"verse":"He went from there to Beersheba. "},{"num":24,"verse":"That night the Lord appeared to Isaac, and said, “I am the God of your father Abraham. Don’t be afraid, because I am with you. I will bless you and increase the number of your descendants for my servant Abraham’s sake.” "},{"num":25,"verse":"So Isaac built an altar there and worshiped the Lord. He also pitched his tent in that place, and his servants dug a well there."},{"header":"Isaac’s Agreement with Abimelech"},{"num":26,"verse":"Abimelech, his friend Ahuzzath, and Phicol, the commander of his army, came from Gerar to see Isaac. "},{"num":27,"verse":"Isaac asked them, “Why have you come to me, since you hate me and sent me away from you?”"},{"num":28,"verse":"They answered, “We have seen that the Lord is with you. So we thought, ‘There should be a solemn agreement between us.’ We’d like to make an agreement with you "},{"num":29,"verse":"that you will not harm us, since we have not touched you. We have done only good to you and let you go in peace. Now you are blessed by the Lord.”"},{"num":30,"verse":"Isaac prepared a special dinner for them, and they ate and drank. "},{"num":31,"verse":"Early the next morning they exchanged oaths. Then Isaac sent them on their way, and they left peacefully."},{"num":32,"verse":"That same day Isaac’s servants came and told him about a well they had dug. They said to him, “We’ve found water.” "},{"num":33,"verse":"So he named it Shibah [Oath]. That is why the name of the city is still Beersheba today."},{"header":"Esau’s Marriages"},{"num":34,"verse":"When Esau was 40 years old, he married Judith, daughter of Beeri the Hittite. He also married Basemath, daughter of Elon the Hittite. "},{"num":35,"verse":"These women brought Isaac and Rebekah a lot of grief."}]