[{"num":5,"verse":"Seeing the crowds, He went up on the mountain; and when He was seated, His disciples came to Him."},{"num":2,"verse":"Then He opened His mouth and taught them, saying:"},{"num":3,"verse":"Blessed (happy, to be envied, and spiritually prosperous—with life-joy and satisfaction in God’s favor and salvation, regardless of their outward conditions) are the poor in spirit (the humble, who rate themselves insignificant), for theirs is the kingdom of heaven!"},{"num":4,"verse":"Blessed and enviably happy [with a happiness produced by the experience of God’s favor and especially conditioned by the revelation of His matchless grace] are those who mourn, for they shall be comforted!"},{"num":5,"verse":"Blessed (happy, blithesome, joyous, spiritually prosperous—with life-joy and satisfaction in God’s favor and salvation, regardless of their outward conditions) are the meek (the mild, patient, long-suffering), for they shall inherit the earth!"},{"num":6,"verse":"Blessed and fortunate and happy and spiritually prosperous (in that state in which the born-again child of God enjoys His favor and salvation) are those who hunger and thirst for righteousness (uprightness and right standing with God), for they shall be completely satisfied!"},{"num":7,"verse":"Blessed (happy, to be envied, and spiritually prosperous—with life-joy and satisfaction in God’s favor and salvation, regardless of their outward conditions) are the merciful, for they shall obtain mercy!"},{"num":8,"verse":"Blessed (happy, enviably fortunate, and spiritually prosperous—possessing the happiness produced by the experience of God’s favor and especially conditioned by the revelation of His grace, regardless of their outward conditions) are the pure in heart, for they shall see God!"},{"num":9,"verse":"Blessed (enjoying enviable happiness, spiritually prosperous—with life-joy and satisfaction in God’s favor and salvation, regardless of their outward conditions) are the makers and  maintainers of peace, for they shall be called the sons of God!"},{"num":10,"verse":"Blessed and happy and enviably fortunate and spiritually prosperous (in the state in which the born-again child of God enjoys and finds satisfaction in God’s favor and salvation, regardless of his outward conditions) are those who are persecuted for righteousness’ sake (for being and doing right), for theirs is the kingdom of heaven!"},{"num":11,"verse":"Blessed (happy, to be envied, and spiritually prosperous—with life-joy and satisfaction in God’s favor and salvation, regardless of your outward conditions) are you when people revile you and persecute you and say all kinds of evil things against you falsely on My account."},{"num":12,"verse":"Be glad and supremely joyful, for your reward in heaven is great (strong and intense), for in this same way people persecuted the prophets who were before you."},{"num":13,"verse":"You are the salt of the earth, but if salt has lost its taste (its strength, its quality), how can its saltness be restored? It is not good for anything any longer but to be thrown out and trodden underfoot by men."},{"num":14,"verse":"You are the light of the world. A city set on a hill cannot be hidden."},{"num":15,"verse":"Nor do men light a lamp and put it under a peck measure, but on a lampstand, and it gives light to all in the house."},{"num":16,"verse":"Let your light so shine before men that they may see your moral excellence and your praiseworthy, noble, and good deeds and recognize and honor and praise and glorify your Father Who is in heaven."},{"num":17,"verse":"Do not think that I have come to do away with or undo the Law or the Prophets; I have come not to do away with or undo but to complete and fulfill them."},{"num":18,"verse":"For truly I tell you, until the sky and earth pass away and perish, not one smallest letter nor one little hook [identifying certain Hebrew letters] will pass from the Law until all things [it foreshadows] are accomplished."},{"num":19,"verse":"Whoever then breaks or does away with or relaxes one of the least [important] of these commandments and teaches men so shall be called least [important] in the kingdom of heaven, but he who practices them and teaches others to do so shall be called great in the kingdom of heaven."},{"num":20,"verse":"For I tell you, unless your righteousness (your uprightness and your right standing with God) is more than that of the scribes and Pharisees, you will never enter the kingdom of heaven."},{"num":21,"verse":"You have heard that it was said to the men of old, You shall not kill, and whoever kills shall be liable to and unable to escape the punishment imposed by the court."},{"num":22,"verse":"But I say to you that everyone who continues to be angry with his brother or harbors malice (enmity of heart) against him shall be liable to and unable to escape the punishment imposed by the court; and whoever speaks contemptuously and insultingly to his brother shall be liable to and unable to escape the punishment imposed by the Sanhedrin, and whoever says, You cursed fool! [You empty-headed idiot!] shall be liable to and unable to escape the hell (Gehenna) of fire."},{"num":23,"verse":"So if when you are offering your gift at the altar you there remember that your brother has any [grievance] against you,"},{"num":24,"verse":"Leave your gift at the altar and go. First make peace with your brother, and then come back and present your gift."},{"num":25,"verse":"Come to terms quickly with your accuser while you are on the way traveling with him, lest your accuser hand you over to the judge, and the judge to the guard, and you be put in prison."},{"num":26,"verse":"Truly I say to you, you will not be released until you have paid the last fraction of a penny."},{"num":27,"verse":"You have heard that it was said, You shall not commit adultery."},{"num":28,"verse":"But I say to you that everyone who so much as looks at a woman with evil desire for her has already committed adultery with her in his heart."},{"num":29,"verse":"If your right eye serves as a trap to ensnare you or is an occasion for you to stumble and sin, pluck it out and throw it away. It is better that you lose one of your members than that your whole body be cast into hell (Gehenna)."},{"num":30,"verse":"And if your right hand serves as a trap to ensnare you or is an occasion for you to stumble and sin, cut it off and cast it from you. It is better that you lose one of your members than that your entire body should be cast into hell (Gehenna)."},{"num":31,"verse":"It has also been said, Whoever divorces his wife must give her a certificate of divorce."},{"num":32,"verse":"But I tell you, Whoever dismisses and repudiates and divorces his wife, except on the grounds of unfaithfulness (sexual immorality), causes her to commit adultery, and whoever marries a woman who has been divorced commits adultery."},{"num":33,"verse":"Again, you have heard that it was said to the men of old, You shall not swear falsely, but you shall perform your oaths to the Lord [as a religious duty]."},{"num":34,"verse":"But I tell you, Do not bind yourselves by an oath at all: either by heaven, for it is the throne of God;"},{"num":35,"verse":"Or by the earth, for it is the footstool of His feet; or by Jerusalem, for it is the city of the Great King."},{"num":36,"verse":"And do not swear by your head, for you are not able to make a single hair white or black."},{"num":37,"verse":"Let your Yes be simply Yes, and your No be simply No; anything more than that comes from the evil one."},{"num":38,"verse":"You have heard that it was said, An eye for an eye, and a tooth for a tooth."},{"num":39,"verse":"But I say to you, Do not resist the evil man [who injures you]; but if anyone strikes you on the right jaw or cheek, turn to him the other one too."},{"num":40,"verse":"And if anyone wants to sue you and take your undershirt (tunic), let him have your coat also."},{"num":41,"verse":"And if anyone forces you to go one mile, go with him two [miles]."},{"num":42,"verse":"Give to him who keeps on begging from you, and do not turn away from him who would borrow [at interest] from you."},{"num":43,"verse":"You have heard that it was said, You shall love your neighbor and hate your enemy;"},{"num":44,"verse":"But I tell you, Love your enemies and pray for those who persecute you,"},{"num":45,"verse":"To show that you are the children of your Father Who is in heaven; for He makes His sun rise on the wicked and on the good, and makes the rain fall upon the upright and the wrongdoers [alike]."},{"num":46,"verse":"For if you love those who love you, what reward can you have? Do not even the tax collectors do that?"},{"num":47,"verse":"And if you greet only your brethren, what more than others are you doing? Do not even the Gentiles (the heathen) do that?"},{"num":48,"verse":"You, therefore, must be perfect [growing into complete maturity of godliness in mind and character, having reached the proper height of virtue and integrity], as your heavenly Father is perfect."}]