[{"num":1,"verse":"And having seen the crowds, He went up on the mountain. And He having sat-down, His disciples came to Him. "},{"num":2,"verse":"And having opened His mouth He was teaching them, saying—"},{"header":"These Are The Ones God Considers Blessed"},{"num":3,"verse":"“Blessed are the poor in spirit, because the kingdom of the heavens is theirs. "},{"num":4,"verse":"Blessed are the ones mourning, because they will be comforted. "},{"num":5,"verse":"Blessed are the gentle ones, because they will inherit the earth. "},{"num":6,"verse":"Blessed are the ones hungering and thirsting as to righteousness, because they will be filled-to-satisfaction. "},{"num":7,"verse":"Blessed are the merciful ones, because they will be shown-mercy. "},{"num":8,"verse":"Blessed are the pure in heart, because they will see God. "},{"num":9,"verse":"Blessed are the peacemakers, because they will be called sons of God. "},{"num":10,"verse":"Blessed are the ones having been persecuted for the sake of righteousness, because the kingdom of the heavens is theirs. "},{"num":11,"verse":"You are blessed ones whenever they reproach you and persecute you and speak every [kind of] evil against you while lying, because-of  Me. "},{"num":12,"verse":"Be rejoicing and be overjoyed, because your reward is great in the heavens. For in this manner they persecuted the prophets before you."},{"header":"You Are Salt And Light. Salt Must Be Tasty. Light Must Shine"},{"num":13,"verse":"“You are the salt of the earth. But if the salt should become-tasteless, with what will it be salted? It no longer has strength for anything except, having been thrown outside, to be trampled-underfoot by people. "},{"num":14,"verse":"You are the light of the world. A city lying on a hill is not able to be hidden. "},{"num":15,"verse":"Nor do they burn a lamp and put it under the basket, but on the lampstand— and it shines on all the ones in the house. "},{"num":16,"verse":"In this manner, let your light shine in front of people so that they may see your good works and glorify your Father in the heavens."},{"header":"I Came To Fulfill The Law. Your Righteousness Must Abound More Than The Pharisees"},{"num":17,"verse":"“Do not think that I came to abolish the Law or the Prophets. I did not come to abolish, but to fulfill. "},{"num":18,"verse":"For truly I say to you, until heaven and earth pass away, one iota or one stroke will by no means pass away from the Law until all things take-place. "},{"num":19,"verse":"Therefore, whoever breaks one of the least of these commandments and in this manner teaches people— he will be called least in the kingdom of the heavens. But whoever does and teaches them— this one will be called great in the kingdom of the heavens. "},{"num":20,"verse":"For I say to you that unless your righteousness abounds more than [that of] the scribes and Pharisees, you will by-no-means enter into the kingdom of the heavens!"},{"header":"Some Say Do Not Murder. I Say Do Not Get Angry"},{"num":21,"verse":"“You heard that it was said to the ancient ones, ‘You shall not murder’, and ‘Whoever murders shall be liable to the judgment’. "},{"num":22,"verse":"But I say to you that everyone being angry with his brother shall be liable to judgment. And whoever says to his brother, ‘Raca’, shall be liable to the Sanhedrin. And whoever says, ‘Fool’, shall be liable to the Gehenna of  fire. "},{"num":23,"verse":"Therefore if you are offering your gift at the altar, and there you remember that your brother has something against you, "},{"num":24,"verse":"leave your gift there in front of the altar, and go. First be reconciled to your brother, and then, having come, be offering your gift. "},{"num":25,"verse":"Be settling with your adversary quickly— until you are with him on the way [to court]— that your adversary might not perhaps hand you over to the judge, and the judge to the officer, and you be thrown into prison. "},{"num":26,"verse":"Truly I say to you, you will by no means come out from there until you pay the last quadrans."},{"header":"Some Say Do Not Commit Adultery. I Say Do Not Desire Another Woman"},{"num":27,"verse":"“You heard that it was said, ‘You shall not commit-adultery’. "},{"num":28,"verse":"But I say to you that everyone looking-at a woman so-as to desire her already committed-adultery-with her in his heart. "},{"num":29,"verse":"And if your right eye is causing you to fall, tear it out and throw it from you. For it is better for you that one of your body-parts perish and your whole body not be thrown into Gehenna. "},{"num":30,"verse":"And if your right hand is causing you to fall, cut it off and throw it from you. For it is better for you that one of your body-parts perish and your whole body not go into Gehenna."},{"header":"Some Say Get a Legal Divorce. I Say Divorcees Who Remarry Commit Adultery"},{"num":31,"verse":"“And it was said, ‘Whoever sends-away his wife, let him give her a divorce certificate’. "},{"num":32,"verse":"But I say to you that everyone sending-away his wife except for a matter of sexual-immorality is causing her to commit-adultery. And whoever marries a woman having been sent-away [from her husband] is committing-adultery."},{"header":"Some Say Do Not Break Your Oath. I Say Do Not Swear an Oath At All"},{"num":33,"verse":"“Again, you heard that it was said to the ancient ones, ‘You shall not break-your-oath, but you shall pay your oaths to the Lord’. "},{"num":34,"verse":"But I say to you not to swear-with-an-oath at all— "},{"num":35,"verse":"neither by heaven, because it is the throne of God; nor by earth, because it is a footstool of His feet; nor with reference to Jerusalem, because it is the city of the great King; "},{"num":36,"verse":"nor may you swear-with-an-oath by your head, because you are not able to make one hair white or black. "},{"num":37,"verse":"But let your statement be, ‘Yes, yes’, [or] ‘No, no’. And the thing beyond these is from the evil one."},{"header":"Some Say Avenge an Eye For an Eye. I Say Do Not Retaliate, But Do The Opposite"},{"num":38,"verse":"“You heard that it was said, ‘An eye for an eye, and a tooth for a tooth’. "},{"num":39,"verse":"But I say to you not to resist the evil person. But whoever slaps you on your right cheek, turn the other to him also. "},{"num":40,"verse":"And to the one wanting to sue you and take your tunic, permit him also the cloak. "},{"num":41,"verse":"And whoever will press you into service for one mile, go with him two. "},{"num":42,"verse":"Give to the one asking you, and do not turn away from the one wanting to borrow from you."},{"header":"Some Say Hate Your Enemies. I Say Love Them And Pray For Them"},{"num":43,"verse":"“You heard that it was said, ‘You shall love your neighbor and hate your enemy’. "},{"num":44,"verse":"But I say to you, be loving your enemies, and be praying for the ones persecuting you, "},{"num":45,"verse":"so that you may prove-to-be sons of your Father in the heavens— because He causes His sun to rise upon evil and good ones, and He sends rain upon righteous and unrighteous ones. "},{"num":46,"verse":"For if you love the ones loving you, what reward do you have? Are not even the tax-collectors doing the same? "},{"num":47,"verse":"And if you greet your brothers only, what extraordinary thing are you doing? Are not even the Gentiles doing the same?"},{"header":"Be Perfect Reflections of Your Heavenly Father"},{"num":48,"verse":"“Therefore you shall be perfect, as your heavenly Father is perfect."}]