[{"header":"The Sermon on the Mount(A)"},{"num":5,"verse":"Now seeing the crowds, He went up on a mountain. And when He sat down, His disciples came to Him."},{"header":"The Beatitudes(B)"},{"num":2,"verse":"And He began speaking and taught them, saying:"},{"num":11,"verse":"“Blessed are you when men revile you, and persecute you, and say all kinds of evil against you falsely for My sake. "},{"num":12,"verse":"Rejoice and be very glad, because great is your reward in heaven, for in this manner they persecuted the prophets who were before you."},{"header":"Salt and Light(C)"},{"num":13,"verse":"“You are the salt of the earth. But if the salt loses its saltiness, how shall it be made salty? It is from then on good for nothing but to be thrown out and to be trampled underfoot by men."},{"num":14,"verse":"“You are the light of the world. A city that is set on a hill cannot be hidden. "},{"num":15,"verse":"Neither do men light a candle and put it under a basket, but on a candlestick. And it gives light to all who are in the house. "},{"num":16,"verse":"Let your light so shine before men that they may see your good works and glorify your Father who is in heaven."},{"header":"Teaching About the Law"},{"num":17,"verse":"“Do not think that I have come to abolish the Law or the Prophets. I have not come to abolish, but to fulfill. "},{"num":18,"verse":"For truly I say to you, until heaven and earth pass away, not one dot or one mark will pass from the law until all be fulfilled. "},{"num":19,"verse":"Whoever, therefore, breaks one of the least of these commandments and teaches others to do likewise shall be called the least in the kingdom of heaven. But whoever does and teaches them shall be called great in the kingdom of heaven. "},{"num":20,"verse":"For I say to you that unless your righteousness exceeds the righteousness of the scribes and Pharisees, you will in no way enter the kingdom of heaven."},{"header":"Teaching About Anger"},{"num":21,"verse":"“You have heard that it was said by the ancients, ‘You shall not murder,’ and ‘Whoever murders shall be in danger of the judgment.’ "},{"num":22,"verse":"But I say to you that whoever is angry with his brother without a cause shall be in danger of the judgment. And whoever says to his brother, ‘Raca,’ shall be in danger of the Sanhedrin. But whoever says, ‘You fool,’ shall be in danger of hell fire."},{"num":23,"verse":"“Therefore, if you bring your gift to the altar and there remember that your brother has something against you, "},{"num":24,"verse":"leave your gift there before the altar and go on your way. First be reconciled to your brother, and then come and offer your gift."},{"num":25,"verse":"“Reconcile with your adversary quickly, while you are on the way with him, lest your adversary deliver you to the judge, and the judge deliver you to the officer, and you be thrown into prison. "},{"num":26,"verse":"Truly I say to you, you will by no means come out of there until you have paid the last penny."},{"header":"Teaching About Adultery"},{"num":27,"verse":"“You have heard that it was said by the ancients, ‘You shall not commit adultery.’ "},{"num":28,"verse":"But I say to you that whoever looks on a woman to lust after her has committed adultery with her already in his heart. "},{"num":29,"verse":"And if your right eye causes you to sin, pluck it out and throw it away. For it is profitable that one of your members should perish, and not that your whole body be thrown into hell. "},{"num":30,"verse":"And if your right hand causes you to sin, cut it off and throw it away. For it is profitable for you that one of your members should perish, and not that your whole body be thrown into hell."},{"header":"Teaching About Divorce(D)"},{"num":31,"verse":"“It was said, ‘Whoever divorces his wife, let him give her a certificate of divorce.’ "},{"num":32,"verse":"But I say to you that whoever divorces his wife, except for marital unfaithfulness, causes her to commit adultery. And whoever marries her who is divorced commits adultery."},{"header":"Teaching About Oaths"},{"num":33,"verse":"“Again, you have heard that it was said by the ancients, ‘You shall not swear falsely, but shall fulfill your oaths to the Lord.’ "},{"num":34,"verse":"But I say to you, do not swear at all: neither by heaven, for it is God’s throne; "},{"num":35,"verse":"nor by the earth, for it is His footstool; nor by Jerusalem, for it is the city of the great King. "},{"num":36,"verse":"Nor shall you swear by your head, because you cannot make one hair white or black. "},{"num":37,"verse":"But let your ‘Yes’ mean ‘Yes,’ and ‘No’ mean ‘No.’ For whatever is more than these comes from the evil one."},{"header":"Teaching About Revenge(E)"},{"num":38,"verse":"“You have heard that it was said, ‘An eye for an eye, and a tooth for a tooth.’ "},{"num":39,"verse":"But I say to you, do not resist an evil person. But whoever strikes you on your right cheek, turn to him the other as well. "},{"num":40,"verse":"And if anyone sues you in a court of law and takes away your tunic, let him have your cloak also. "},{"num":41,"verse":"And whoever compels you to go a mile, go with him two. "},{"num":42,"verse":"Give to him who asks you, and from him who would borrow from you do not turn away."},{"header":"Love for Enemies(F)"},{"num":43,"verse":"“You have heard that it was said, ‘You shall love your neighbor and hate your enemy.’ "},{"num":44,"verse":"But I say to you, love your enemies, bless those who curse you, do good to those who hate you, and pray for those who spitefully use you and persecute you, "},{"num":45,"verse":"that you may be sons of your Father who is in heaven. For He makes His sun rise on the evil and on the good and sends rain on the just and on the unjust. "},{"num":46,"verse":"For if you love those who love you, what reward do you have? Do not even the tax collectors do the same? "},{"num":47,"verse":"And if you greet your brothers only, what are you doing more than others? Do not even the tax collectors do so? "},{"num":48,"verse":"Therefore be perfect, even as your Father who is in heaven is perfect."}]