[{"num":5,"verse":"And when He saw the multitude, He went up into a mountain. And when He was set, His disciples came to Him."},{"num":2,"verse":"And He opened His mouth, and taught them, saying,"},{"num":3,"verse":"“Blessed are the poor in spirit, for theirs is the Kingdom of Heaven."},{"num":4,"verse":"“Blessed are those who mourn, for they shall be comforted."},{"num":5,"verse":"“Blessed are the meek, for they shall inherit the earth."},{"num":6,"verse":"“Blessed are those who hunger and thirst for righteousness, for they shall be filled."},{"num":7,"verse":"“Blessed are the merciful, for they shall receive mercy."},{"num":8,"verse":"“Blessed are the pure in heart, for they shall see God."},{"num":9,"verse":"“Blessed are the peacemakers, for they shall be called the children of God."},{"num":10,"verse":"“Blessed are those who suffer persecution for righteousness’ sake, for theirs is the Kingdom of Heaven."},{"num":11,"verse":"“Blessed shall you be when others revile you, and people utter all kinds of evil against you falsely for My sake."},{"num":12,"verse":"“Rejoice and be glad! For great is your reward in Heaven! For so they persecuted the Prophets who were before you."},{"num":13,"verse":"“You are the salt of the earth. But if the salt has lost his savor, how shall it be salted? It is thereafter good for nothing but to be cast out, and to be trampled underfoot by men."},{"num":14,"verse":"“You are the light of the world. A city that is set on a hill cannot be hidden."},{"num":15,"verse":"“Nor does anyone light a candle and put it under a bushel, but on a candlestick. And it gives light to all who are in the house."},{"num":16,"verse":"“Let your light so shine before men, that they may see your good works and glorify your Father Who is in Heaven."},{"num":17,"verse":"“Do not think that I came to destroy the Law, or the Prophets. I have not come to destroy them, but to fulfill them."},{"num":18,"verse":"“For truly I say to you, until Heaven and Earth perish, not one jot or one tittle of the Law shall escape, till all things are fulfilled."},{"num":19,"verse":"“Therefore, whoever shall break one of these least commandments, and teach men so, he shall be called the least in the Kingdom of Heaven. But whoever shall observe and teach them, the same shall be called great in the Kingdom of Heaven."},{"num":20,"verse":"“For I say to you, unless your righteousness exceeds the righteousness of the scribes and Pharisees, you shall not enter into the Kingdom of Heaven."},{"num":21,"verse":"“You have heard that it was said to those of the old time, ‘You shall not murder’. For whoever murders shall be culpable of judgment."},{"num":22,"verse":"“But I say to you, whoever is angry with his brother unadvisedly, shall be culpable of judgment. And whoever says to his brother, ‘Raca’, shall be worthy to be punished by the Council. And whoever shall say, ‘Fool’, shall be worthy to be punished with hell fire."},{"num":23,"verse":"“If, then, you bring your gift to the altar, and there remember that your brother has something against you,"},{"num":24,"verse":"“leave your offering there before the altar and go your way. First, be reconciled to your brother, and then come and offer your gift."},{"num":25,"verse":"“Agree with your adversary quickly, while you are on the way with him, lest your adversary deliver you to the judge, and the judge delivers you to the sergeant, and you are cast into prison."},{"num":26,"verse":"“Truly I say to you, you shall not come out from there, till you have paid the last coin."},{"num":27,"verse":"“You have heard that it was said to those of old time, ‘You shall not commit adultery’."},{"num":28,"verse":"“But I say to you, that whoever looks on a woman to lust after her, has committed adultery with her already in his heart."},{"num":29,"verse":"“So if your right eye causes you to offend, pluck it out and cast it from you. For better it is for you that one of your members perish, than that your whole body should be cast into hell."},{"num":30,"verse":"“Also if your right hand makes you offend, cut it off, and cast it from you. For better it is for you, that one of your members perish, than that your whole body should be cast into hell."},{"num":31,"verse":"“It has been said also, ‘Whoever shall divorce his wife, let him give her a bill of divorcement’."},{"num":32,"verse":"“But I say to you, whoever shall divorce his wife (except for promiscuity) causes her to commit adultery. And whoever shall marry her who is divorced, commits adultery."},{"num":33,"verse":"“Again, you have heard that it was said to those of old time, ‘You shall not swear false oaths, but shall perform your oaths to the Lord’."},{"num":34,"verse":"“But I say to you do not swear at all, neither by Heaven (for it is the throne of God)"},{"num":35,"verse":"“nor by the earth (for it is His footstool), nor by Jerusalem (for it is the city of the great King)."},{"num":36,"verse":"“Nor shall you swear by your head, because you cannot make one hair white or black."},{"num":37,"verse":"“But let your communication be ‘Yes, yes. No, no.’ For whatever is more than these, comes from evil."},{"num":38,"verse":"“You have heard that it has been said, ‘An eye for an eye, and a tooth for a tooth.”"},{"num":39,"verse":"“But I say to you do not resist evil. But whoever shall strike you on your right cheek, turn to him the other also."},{"num":40,"verse":"“And if anyone would sue you, and take away your coat, let him have your cloak also."},{"num":41,"verse":"“And whoever will compel you to go a mile, go with him two."},{"num":42,"verse":"“Give to one who asks, and do not turn away from one who would borrow from you."},{"num":43,"verse":"“You have heard that it has been said, ‘You shall love your neighbor, and hate your enemy’."},{"num":44,"verse":"“But I say to you love your enemies. Bless those who curse you. Do good to those who hate you. And pray for those who hurt you and persecute you,"},{"num":45,"verse":"“so that you may be the children of your Father, Who is in Heaven. For He makes His sun to rise on the evil and the good and sends rain on the just and unjust."},{"num":46,"verse":"“For if you love those who love you, what reward shall you have? Do not even the tax collectors do the same?"},{"num":47,"verse":"“And if you are only friendly to your brothers, what singular thing do you do? Do not even the tax collectors do likewise?"},{"num":48,"verse":"“You shall therefore be perfect, as your Father, Who is in Heaven, is perfect.”"}]