[{"num":11,"verse":"(vi) Adonai said to Moshe and Aharon, "},{"num":2,"verse":"“Tell the people of Isra’el, ‘These are the living creatures which you may eat among all the land animals: "},{"num":3,"verse":"any that has a separate hoof which is completely divided and chews the cud — these animals you may eat. "},{"num":4,"verse":"But you are not to eat those that only chew the cud or only have a separate hoof. For example, the camel, the coney and the hare are unclean for you, because they chew the cud but don’t have a separate hoof; "},{"num":7,"verse":"while the pig is unclean for you, because, although it has a separate and completely divided hoof, it doesn’t chew the cud. "},{"num":8,"verse":"You are not to eat meat from these or touch their carcasses; they are unclean for you."},{"num":9,"verse":"“‘Of all the things that live in the water, you may eat these: anything in the water that has fins and scales, whether in seas or in rivers — these you may eat. "},{"num":10,"verse":"But everything in the seas and rivers without both fins and scales, of all the small water-creatures and of all the living creatures in the water, is a detestable thing for you. "},{"num":11,"verse":"Yes, these will be detestable for you — you are not to eat their meat, and you are to detest their carcasses. "},{"num":12,"verse":"Whatever lacks fins and scales in the water is a detestable thing for you."},{"num":13,"verse":"“‘The following creatures of the air are to be detestable for you — they are not to be eaten, they are a detestable thing: the eagle, the vulture, the osprey, "},{"num":14,"verse":"the kite, the various kinds of buzzards, "},{"num":15,"verse":"the various kinds of ravens, "},{"num":16,"verse":"the ostrich, the screech-owl, the seagull, the various kinds of hawks, "},{"num":17,"verse":"the little owl, the cormorant, the great owl, "},{"num":18,"verse":"the horned owl, the pelican, the barn owl, "},{"num":19,"verse":"the stork, the various kinds of herons, the hoopoe and the bat."},{"num":20,"verse":"“‘All winged swarming creatures that go on all fours are a detestable thing for you; "},{"num":21,"verse":"except that of all winged swarming creatures that go on all fours, you may eat those that have jointed legs above their feet, enabling them to jump off the ground. "},{"num":22,"verse":"Specifically, of these you may eat the various kinds of locusts, grasshoppers, katydids and crickets. "},{"num":23,"verse":"But other than that, all winged swarming creatures having four feet are a detestable thing for you."},{"num":24,"verse":"“‘The following will make you unclean; whoever touches the carcass of them will be unclean until evening, "},{"num":25,"verse":"and whoever picks up any part of their carcass is to wash his clothes and be unclean until evening: "},{"num":26,"verse":"every animal that has a separate but incompletely divided hoof or that doesn’t chew the cud is unclean for you; anyone who touches them will become unclean. "},{"num":27,"verse":"Whatever goes on its paws, among all animals that go on all fours, is unclean for you; whoever touches its carcass will be unclean until evening; "},{"num":28,"verse":"and whoever picks up its carcass is to wash his clothes and be unclean until evening — these are unclean for you."},{"num":29,"verse":"“‘The following are unclean for you among the small creatures that swarm on the ground: the weasel, the mouse, the various kinds of lizards, "},{"num":30,"verse":"the gecko, the land crocodile, the skink, the sand-lizard and the chameleon. "},{"num":31,"verse":"They are unclean crawling creatures; whoever touches them when they are dead will be unclean until evening. "},{"num":32,"verse":"Anything on which one of them falls when dead will become unclean — wooden utensil, article of clothing, leather, sacking — any utensil used for work; it must be put in water, and it will be unclean until evening; then it will be clean. "},{"num":33,"verse":"(vii) If one of them falls into a clay pot, whatever is in it will become unclean, and you are to break the pot. "},{"num":34,"verse":"Any food permitted to be eaten that water from such a vessel gets on will become unclean, and any permitted liquid in such a vessel will become unclean. "},{"num":35,"verse":"Everything on which any carcass-part of theirs falls will become unclean, whether oven or stove; it is to be broken in pieces — they are unclean and will be unclean for you; "},{"num":36,"verse":"although a spring or cistern for collecting water remains clean. But anyone who touches one of their carcasses will become unclean. "},{"num":37,"verse":"If any carcass-part of theirs falls on any kind of seed to be sown, it is clean; "},{"num":38,"verse":"but if water is put on the seed and a carcass-part of theirs falls on it, it is unclean for you."},{"num":39,"verse":"“‘If an animal of a kind that you are permitted to eat dies, whoever touches its carcass will be unclean until evening. "},{"num":40,"verse":"A person who eats meat from its carcass or carries its carcass is to wash his clothes; he will be unclean until evening."},{"num":41,"verse":"“‘Any creature that swarms on the ground is a detestable thing; it is not to be eaten — "},{"num":42,"verse":"whatever moves on its stomach, goes on all fours, or has many legs — all creatures that swarm on the ground; you are not to eat them, because they are a detestable thing. "},{"num":43,"verse":"You are not to make yourselves detestable with any of these swarming, crawling creatures; do not make yourselves unclean with them, do not defile yourselves with them. "},{"num":44,"verse":"For I am Adonai your God; therefore, consecrate yourselves and be holy, for I am holy; and do not defile yourselves with any kind of swarming creature that moves along the ground. "},{"num":45,"verse":"(Maftir) For I am Adonai, who brought you up out of the land of Egypt to be your God. Therefore you are to be holy, because I am holy."},{"num":46,"verse":"“‘Such, then, is the law concerning animals, flying creatures, all living creatures that move about in the water, and all creatures that swarm on the ground. "},{"num":47,"verse":"Its purpose is to distinguish between the unclean and the clean, and between the creatures that may be eaten and those that may not be eaten.’”"}]