[{"num":11,"verse":"And Hashem spoke unto Moshe and to Aharon, saying unto them,"},{"num":2,"verse":"Speak unto the Bnei Yisroel, saying, These are the beasts which ye shall eat among all the beasts that are on ha’aretz."},{"num":3,"verse":"Whatsoever spliteth the hoof, and separateth into double hooves, and cheweth the cud, among the behemah (animals), that shall ye eat."},{"num":4,"verse":"Nevertheless these shall ye not eat of them that chew the cud, or of them that separateth the hoof; as the gamal (camel), because he cheweth the cud, but separateth not the hoof; he is tamei unto you."},{"num":5,"verse":"And the hyrax, because he cheweth the cud, but separateth not the hoof; he is tamei unto you."},{"num":6,"verse":"And the hare, because he cheweth the cud, but separateth not the hoof; he is temeiah (unclean) unto you."},{"num":7,"verse":"And the chazir (swine), though he separate the hoof, and be separated into double hooves, yet he cheweth not the cud; he is tamei to you."},{"num":8,"verse":"Of their basar shall ye not eat, and their nevelah shall ye not touch; they are temei’im (unclean ones) to you."},{"num":9,"verse":"These shall ye eat of all that are in the mayim; whatsoever hath fins and scales in the mayim, in the seas, and in the rivers, them shall ye eat."},{"num":10,"verse":"And all that have not fins and scales in the seas, and in the rivers, of all that swarm in the mayim, and of any nefesh hachayyah which is in the mayim, they shall be sheketz (abomination, detestable) unto you;"},{"num":11,"verse":"They shall be even sheketz unto you; ye shall not eat of their basar, but ye shall have their nevelah in sheketz."},{"num":12,"verse":"Whatsoever hath no fins nor scales in the mayim, that shall be sheketz unto you."},{"num":13,"verse":"And these are they which ye shall have in sheketz among the fowls; they shall not be eaten, they are sheketz: the nesher (eagle), and the vulture, and the whitetailed eagle,"},{"num":14,"verse":"And the da’ah (kite), and the black kite after its kind;"},{"num":15,"verse":"Every orev (raven) after its kind;"},{"num":16,"verse":"And the ostrich, and the screech owl, and the seagull, and the hawk after its kind,"},{"num":17,"verse":"And the little owl, and the cormorant, and the great owl,"},{"num":18,"verse":"And the white owl, and the pelican, and the osprey,"},{"num":19,"verse":"And the stork, the heron after its kind, and the hoopoe, and the bat."},{"num":20,"verse":"All fowls that creep, going upon all fours, shall be sheketz unto you."},{"num":21,"verse":"Yet these may ye eat of every winged insect that goeth upon all fours, which have jumping legs above their feet, to hop withal upon ha’aretz;"},{"num":22,"verse":"Even these of them ye may eat: the arbeh (locust) after its kind, and the katydid after its kind, and the cricket after its kind, and the grasshopper after its kind."},{"num":23,"verse":"But all other winged insects, which have four feet, shall be sheketz unto you."},{"num":24,"verse":"And for these ye shall be temei’im; whosoever toucheth the nevelah of them shall be tamei until erev."},{"num":25,"verse":"And whosoever pick up any of the nevelah of them shall wash his clothes, and be tamei until erev."},{"num":26,"verse":"Every beast which spliteth the hooves, and is not completely split, nor cheweth the cud, are temei’im unto you; every one that toucheth them shall be tamei."},{"num":27,"verse":"And whatsoever goeth upon its paws, among all manner of beasts that go on all fours, those are temei’im unto you; whosoever toucheth their nevelah shall be tamei until erev."},{"num":28,"verse":"And he that beareth the nevelah of them shall wash his clothes, and be tamei until erev; they are temei’im unto you."},{"num":29,"verse":"These also shall be tamei unto you among the creeping things that creep upon ha’aretz: the weasel, and the rat, and the great lizard after its kind,"},{"num":30,"verse":"And the gecko, and the land crocodile, and the skink, and the lizard, and the chameleon."},{"num":31,"verse":"These are temei’im to you among all that creep; whosoever doth touch them, when they be dead, shall be tamei until erev."},{"num":32,"verse":"And whatsoever of them, when they are dead, doth fall on something, it shall be tamei; whether it be any vessel of wood, or cloth, or hide, or sackcloth, whatsoever vessel it be, wherein any melachah (work) is done, it must be put into mayim, and it shall be tamei until erev; then it shall be tahor (clean)."},{"num":33,"verse":"And every clay vessel, whereinto any of them falleth, whatsoever is in it shall be tamei; and ye shall break it."},{"num":34,"verse":"Of all okhel which may be eaten, that on which such mayim cometh shall be tamei; and all mashkeh that may be drunk in every such vessel shall be tamei."},{"num":35,"verse":"And everything whereupon any part of their nevelah falleth shall be tamei; whether it be oven, or stove, they shall be broken; for they are temei’im and shall be temei’im unto you."},{"num":36,"verse":"Nevertheless a spring or cistern, wherein there is a mikveh mayim (collection of water) shall be tahor; but that which toucheth their nevelah shall be tamei."},{"num":37,"verse":"And if any part of their nevelah fall upon any zera for sowing which is to be sown, it shall be tahor."},{"num":38,"verse":"But if any mayim be put upon the zera, and any part of their nevelah fall thereon, it shall be tamei unto you."},{"num":39,"verse":"And if any behemah, of which ye may eat, die, he that toucheth the nevelah thereof shall be tamei until erev."},{"num":40,"verse":"And he that eateth of the nevelah of it shall wash his clothes, and be tamei until erev; he also that picketh up the nevelah of it shall wash his clothes, and be tamei until erev."},{"num":41,"verse":"And every creeping thing that creepeth upon ha’aretz shall be sheketz; it shall not be eaten."},{"num":42,"verse":"Whatsoever goeth upon the belly, and whatsoever goeth upon all fours, or whatsoever hath marbeh raglayim (many feet) among all creeping things that creep upon ha’aretz, them ye shall not eat; for they are sheketz."},{"num":43,"verse":"Ye shall not make your nefashot sheketz with any creeping thing that creepeth, neither shall ye make yourselves tamei with them, that ye should be made tamei thereby."},{"num":44,"verse":"For I am Hashem Eloheichem; ye shall therefore set yourselves apart as kodesh, and ye shall be kadoshim; for I am kadosh; neither shall ye make your nefashot tamei with any manner of creeping thing that creepeth upon ha’aretz."},{"num":45,"verse":"For I am Hashem that bringeth you up out of Eretz Mitzrayim, to be for you as Elohim: ye shall therefore be kadoshim, for I am kadosh."},{"num":46,"verse":"This is the torah concerning the beasts, and of the fowl, and of every living creature that moveth in the mayim, and of every creature that creepeth upon ha’aretz;"},{"num":47,"verse":"To make a divide [lehavdil; to make a distinction, separation] between the tamei and the tahor, and between the beast that may be and the beast that may not be eaten."}]