[{"header":"Ezekiel Sees the Future Temple in Jerusalem"},{"num":1,"verse":"Twenty-five years after King Jehoiachin and the rest of us had been led away as prisoners to Babylonia, and fourteen years after the Babylonians had captured Jerusalem, the Lord’s power took control of me on the tenth day of the first month. The Lord showed me some visions in which I was carried to the top of a high mountain in Jerusalem. I looked to the south and saw what looked like a city full of buildings. "},{"num":3,"verse":"In my vision the Lord took me closer, and I saw a man who was sparkling like polished bronze. He was standing near one of the gates and was holding a tape measure in one hand and a measuring stick in the other. "},{"num":4,"verse":"The man said, “Ezekiel, son of man, pay close attention to everything I’m going to show you—that’s why you’ve been brought here. Listen carefully, because you must tell the people of Israel what you see.”"},{"header":"The East Gate"},{"num":5,"verse":"The first thing I saw was an outer wall that completely surrounded the temple area. The man took his measuring stick, which was ten feet long, and measured the wall; it was ten feet high and ten feet thick. "},{"num":6,"verse":"Then he went to the east gate, where he walked up steps that led to a long passageway. On each side of this passageway were three guardrooms, which were ten feet square, and they were separated by walls over eight feet thick. The man measured the distance between the opening of the gate and the first guardroom, and it was ten feet, the thickness of the outer wall."},{"num":8,"verse":"at the end of the passageway. The man measured this room: It was thirteen feet from the doorway to the opposite wall, and the distance from the doorway to the wall on either side was three feet. "},{"num":10,"verse":"The three guardrooms on each side of the passageway were the same size, and the walls that separated them were the same thickness."},{"num":11,"verse":"Next, the man measured the width of the passageway, and it was twenty-two feet, but the two doors of the gate were only sixteen feet wide. "},{"num":12,"verse":"In front of the guardrooms, which were ten feet square, was a railing about twenty inches high and twenty inches thick. "},{"num":13,"verse":"The man measured the distance from the back wall of one of these rooms to the same spot in the room directly across the passageway, and it was forty-two feet. "},{"num":14,"verse":"He measured the entrance room at the far end of the passageway, and it was thirty-four feet wide. "},{"num":15,"verse":"Finally, he measured the total length of the passageway, from the outer wall to the entrance room, and it was eighty-five feet. "},{"num":16,"verse":"The three walls in the guardrooms had small windows in them, just like the ones in the entrance room. The walls along the passageway were decorated with carvings of palm trees."},{"header":"The Outer Courtyard"},{"num":17,"verse":"The man then led me through the passageway and into the outer courtyard of the temple, where I saw thirty rooms built around the outside of the courtyard. These side rooms were built against the outer wall, and in front of them was a sidewalk that circled the courtyard. "},{"num":18,"verse":"This was known as the lower sidewalk, and it was eighty-five feet wide."},{"num":19,"verse":"I saw the gates that led to the inner courtyard of the temple and noticed that they were higher than those leading to the outer courtyard. The man measured the distance between the outer and inner gates, and it was one hundred seventy feet."},{"header":"The North Gate"},{"num":20,"verse":"Next, the man measured the north gate that led to the outer courtyard. "},{"num":21,"verse":"This gate also had three guardrooms on each side of a passageway. The measurements of these rooms, the walls between them, and the entrance room at the far end of the passageway were exactly the same as those of the east gate. The north gate was also eighty-five feet long and forty-two feet wide, "},{"num":22,"verse":"and the windows, the entrance room, and the carvings of palm trees were just like those in the east gate. The entrance room also faced the courtyard of the temple and had seven steps leading up to it. "},{"num":23,"verse":"Directly across the outer courtyard was a gate that led to the inner courtyard, just as there was for the east gate. The man measured the distance between the outer and inner gate, and it was one hundred seventy feet."},{"header":"The South Gate"},{"num":24,"verse":"The man then took me to the south gate. He measured the walls and the entrance room of this gate, and the measurements were exactly the same as those of the other two gates. "},{"num":25,"verse":"There were windows in the guardrooms of this gate and in the entrance room, just like the others, and this gate was also eighty-five feet long and forty-two feet wide. "},{"num":26,"verse":"Seven steps led up to the gate; the entrance room was at the far end of the passageway and faced the courtyard of the temple. Carvings of palm trees decorated the walls along the passageway. "},{"num":27,"verse":"And directly across the outer courtyard was a gate on the south side of the inner courtyard. The man measured the distance between the outer and inner gate, and it was also one hundred seventy feet."},{"header":"The Gates Leading to the Inner Courtyard"},{"num":28,"verse":"We then went into the inner courtyard, through the gate on the south side of the temple. The man measured the gate, and it was the same size as the gates in the outer wall. "},{"num":29,"verse":"In fact, everything along the passageway was also the same size, including the guardrooms, the walls separating them, the entrance room at the far end, and the windows. This gate, like the others, was eighty-five feet long and forty-two feet wide. "},{"num":31,"verse":"The entrance room of this gate faced the outer courtyard, and carvings of palm trees decorated the walls of the passageway. Eight steps led up to this gate."},{"num":32,"verse":"Next, we went through the east gate to the inner courtyard. The man measured this gate, and it was the same size as the others. "},{"num":33,"verse":"The guardrooms, the walls separating them, and its entrance room had the same measurements as the other gates. The guardrooms and the entrance room had windows, and the gate was eighty-five feet long and forty-two feet wide. "},{"num":34,"verse":"The entrance room faced the outer courtyard, and the walls in the passageway were decorated with carvings of palm trees. Eight steps also led up to this gate."},{"num":35,"verse":"Then the man took me to the north gate. He measured it, and it was the same size as the others, "},{"num":36,"verse":"including the guardrooms, the walls separating them, and the entrance room. There were also windows in this gate. It was eighty-five feet long and forty-two feet wide, "},{"num":37,"verse":"and like the other inner gates, its entrance room faced the outer courtyard, and its walls were decorated with carvings of palm trees. Eight steps also led up to this gate."},{"header":"The Rooms for Sacrificing Animals"},{"num":38,"verse":"Inside the entrance room of the north gate, I saw four tables, two on each side of the room, where the animals to be sacrificed were killed. Just outside this room was a small building used for washing the animals before they were offered as sacrifices to please the Lord or sacrifices for sin or sacrifices to make things right. "},{"num":40,"verse":"Four more tables were in the outer courtyard, two on each side of the steps leading into the entrance room. "},{"num":41,"verse":"So there was a total of eight tables, four inside and four outside, where the animals were killed, "},{"num":42,"verse":"and where the meat was placed until it was sacrificed on the altar."},{"header":"The Rooms Belonging to the Priests"},{"num":44,"verse":"The man then took me to the inner courtyard, where I saw two buildings, one beside the inner gate on the north and the other beside the inner gate on the south. "},{"num":45,"verse":"He said, “The building beside the north gate belongs to the priests who serve in the temple, "},{"num":46,"verse":"and the building beside the south gate belongs to those who serve at the altar. All of them are descendants of Zadok and are the only Levites allowed to serve as the Lord’s priests.”"},{"header":"The Inner Courtyard and the Temple"},{"num":47,"verse":"Now the man measured the inner courtyard; it was one hundred seventy feet square. I also saw an altar in front of the temple."},{"num":48,"verse":"We walked to the porch of the temple, and the man measured the doorway of the porch: It was twenty-four feet long, eight feet wide, and the distance from the doorway to the wall on either side was five feet. "},{"num":49,"verse":"The porch itself was thirty-four feet by twenty feet, with steps leading up to it. There was a column on each side of these steps."}]