[{"num":40,"verse":"In the five and twentieth year of our Golus, in the rosh hashanah [of Yovel (Jubilee)], in the tenth day of the month in the fourteenth year [573 B.C.E.] after the fall of the Ir [Yerushalayim] in the selfsame day the Yad Hashem was upon me, and brought me there."},{"num":2,"verse":"In the marot Elohim (visions of G-d, Divine visions) He brought me to Eretz Yisroel, and set me upon a very high mountain, on which was a mivneh (structure) resembling an ir to the negev (south)."},{"num":3,"verse":"And He brought me there, and, hinei, there was an ish, whose appearance was like the appearance of nechoshet, with a cord of linen in his yad, and a keneh hamiddah (measuring rod); and he [the angelic being] stood in the sha’ar (i.e., the Eastern Gate; see further 43:1-5; 44:1-3; Hashem’s glory enters and exits here and Moshiach, see 44:3)."},{"num":4,"verse":"And the ish said unto me, Ben Adam, behold with thine eyes, and hear with thine ears, and set thine lev upon all that I shall show thee; for l’ma’an (to the intent, in order that) I might show them unto thee art thou brought here; declare all that thou seest to Bais Yisroel."},{"num":5,"verse":"And, hinei, a chomah (wall) was on the outside of the Bais [Hamikdash] compound and was surrounding it, and in the yad of the ish was a keneh hamiddah of six long cubits, each a cubit and a handbreadth; so he [the angelic being] measured the thickness of the structure [of the chomah], one rod; and the wall’s height, one rod."},{"num":6,"verse":"Then came he [the angelic being] unto the sha’ar (gateway) which faceth eastward, and went up the ma’alot (steps, stairs) thereof, and measured the saf (threshold) of the sha’ar, which was one rod deep;"},{"num":7,"verse":"And every ta (recess) was one rod wide, and one rod deep; and between the ta’im (rooms) were five cubits; and the saf (threshold) of the sha’ar next to the ulam of the sha’ar on the inside was one rod."},{"num":8,"verse":"He [the angelic being] measured also the ulam of the sha’ar on the inside, one rod."},{"num":9,"verse":"Then he measured the ulam of the sha’ar, eight cubits; and the jambs thereof, two cubits; and the ulam of the sha’ar was on the inside."},{"num":10,"verse":"And the ta’im of the sha’ar eastward were shloshah on this side, and shloshah on that side; they three were of the same measurement; and the jambs had the same measurement on this side and on that side."},{"num":11,"verse":"And he measured the width of the petach (opening) of the sha’ar, ten cubits; and the length of the sha’ar, thirteen cubits."},{"num":12,"verse":"The boundary line also before the ta’ot (recesses) was one cubit on this side, one cubit on that side; and the ta were six cubits deep on this side, and six cubits on that side."},{"num":13,"verse":"He [the angelic being] measured then the sha’ar from the ceiling of one ta to the ceiling of another; the width was five and twenty cubits; petach [opening of the recess] was opposite to petach."},{"num":14,"verse":"He [the angelic being] made [measurement] of the ulam, threescore cubits, even unto the jamb of the khatzer at the sha’ar all around."},{"num":15,"verse":"And from the front of the sha’ar, the outer side, unto the front of the interior ulam vestibule was fifty cubits."},{"num":16,"verse":"And there were chalonot atumot (closed niches) for the ta’im, the sha’ar and for their side walls and these were interior of the sha’ar all around, and likewise the ulam vestibules: and chalonot were round about on the inside; and upon each jamb were timorim (palm trees)."},{"num":17,"verse":"Then he [the angelic being] brought me into the khatzer hakhitzonah (outer courtyard), and, hinei, there were leshakhot (chambers), and ritzpah (pavement) constructed for the khatzer (courtyard) all around; thirty leshakhot were along the ritzpah."},{"num":18,"verse":"And the ritzpah was by the side of the she’arim running the length of the she’arim, the lower ritzpah."},{"num":19,"verse":"Then he [the angelic being] measured the width from the forefront of the lower sha’ar unto the forefront of the khatzer hapenimi (inner courtyard) on its outside, a hundred cubits eastward and northward."},{"num":20,"verse":"And the sha’ar of the khatzer hakhitzonah that looked toward the north, he measured the length thereof, and the width thereof."},{"num":21,"verse":"And the ta’im thereof were shloshah on this side and shloshah on that side; and the jambs thereof and the ulam thereof were after the measure of the first sha’ar; the length thereof was fifty cubits, and the width five and twenty cubits."},{"num":22,"verse":"And their chalonot, and their ulam vestibules, and their timorim, had the same measurements as the sha’ar that looketh toward the east; and they went up unto it by ma’alot sheva; and the ulam thereof were before them."},{"num":23,"verse":"And the sha’ar of the khatzer hapenimi (inner courtyard) was facing toward the north, and toward the east; and he [the angelic being] measured from sha’ar to sha’ar a hundred cubits."},{"num":24,"verse":"After that he [the angelic being] brought me toward the south, and, hinei, a sha’ar toward the south; and he measured the jambs thereof and the ulam vestibules thereof according to these measures."},{"num":25,"verse":"And there were chalonim in it and in the ulam vestibule thereof round about, like those chalonot; the length was fifty cubits, and the width five and twenty cubits."},{"num":26,"verse":"And there were ma’alot shivah (seven steps, stairs) to go up to it, and the ulam vestibule thereof were before them; and it had timorim, one on this side, and another on that side, upon the jambs thereof."},{"num":27,"verse":"And there was a sha’ar in the khatzer hapenimi toward the south; and he [the angelic being] measured from sha’ar to sha’ar toward the south a hundred cubits."},{"num":28,"verse":"And he [the angelic being] brought me to the khatzer hapenimi through the south sha’ar; and he [the angelic being] measured the south sha’ar according to these measures;"},{"num":29,"verse":"And the ta’im thereof, and the jambs thereof, and the ulam vestibule thereof, according to these measures; and there were chalonot in it and in the ulam vestibule thereof round about; it was fifty cubits long, and five and twenty cubits wide."},{"num":30,"verse":"And the ulam vestibules round about were five and twenty cubits long, and five cubits wide."},{"num":31,"verse":"And the ulam vestibules thereof were facing the khatzer hachatzonah (the outer courtyard); and timorim were upon the jambs thereof; and the going up to it had ma’alot shmoneh (eight steps, stairs)."},{"num":32,"verse":"And he [the angelic being] brought me into the khatzer hapenimi toward the east; and he measured the sha’ar according to these measures."},{"num":33,"verse":"And the ta’im thereof, and the jambs thereof, and the ulam vestibule thereof, were according to these measures; and there were chalonot therein and in the ulam vestibule thereof round about; it was fifty cubits long, and five and twenty cubits wide."},{"num":34,"verse":"And the ulam vestibule thereof was toward the khatzer hakhitzonah; and timorim were upon the jambs thereof, on this side, and on that side; and the going up to it had ma’alot shmoneh."},{"num":35,"verse":"And he [the angelic being] brought me to the northern sha’ar, and measured it according to these measures:"},{"num":36,"verse":"The ta’im thereof, the jambs thereof, and the ulam vestibules thereof, and the chalonot to it round about; the length was fifty cubits, and the width five and twenty cubits."},{"num":37,"verse":"And the jambs thereof were toward the khatzer hakhitzonah; and timorim were upon the jambs thereof, on this side, and on that side; and the going up to it had ma’alot shmoneh."},{"num":38,"verse":"And the lishka and the entryways thereof were by the ulam vestibules of the she’arim, where they washed the olah (burnt offering)."},{"num":39,"verse":"And in the ulam of the sha’ar were two shulchanot (tables) on this side, and two shulchanot on that side, to slaughter thereon the olah and the chattat and the asham."},{"num":40,"verse":"And at the side outside, as one goeth up to the petach hasha’ar hatzafonah, were two shulchanot; and on the other side, which was at the ulam of the sha’ar, were two shulchanot."},{"num":41,"verse":"Four shulchanot were on this side, and four shulchanot on that side, by the side of the sha’ar; eight shulchanot, whereupon they slaughtered [shachat]."},{"num":42,"verse":"And the four shulchanot were of hewn stone for the olah (burnt offering), of a cubit and a half long, and a cubit and a half wide, and one cubit high; whereupon also they placed the kelim wherewith they slaughtered the olah (burnt offering) and the zevach."},{"num":43,"verse":"And within were hooks, one handbreadth, set up inside all around; and upon the shulchanot was the basar of the korban."},{"num":44,"verse":"And outside the sha’ar hapenimi were the lishkhot of the sharim (singers) in the khatzer hapenimi, which was at the side of the northern sha’ar; and their view was toward the south; one at the side of the eastern sha’ar having the view toward the north."},{"num":45,"verse":"And he [the angelic being] said unto me, This lishka, whose view is toward the south, is for the Kohanim, the Shomrei Mishmeret HaBeis [HaMikdash]."},{"num":46,"verse":"And the lishka whose view is toward the north is for the Kohanim, the Shomrei Mishmeret HaMizbe’ach; these are the Bnei Tzadok among the Bnei Levi, which come near to Hashem to minister unto Him."},{"num":47,"verse":"So he [the angelic being] measured the khatzer (court), a hundred cubits long, and a hundred cubits wide, foursquare; and the Mizbe’ach was before the Beis [HaMikdash]."},{"num":48,"verse":"And he [the angelic being] brought me to the Ulam of the Beis [HaMikdash], and measured each jamb of the Ulam, five cubits on this side, and five cubits on that side; and the width of the sha’ar was shalosh cubits on this side, and shalosh cubits on that side."},{"num":49,"verse":"The length of the Ulam was twenty cubits, and the width eleven cubits, and he [the angelic being] brought me by the ma’alot whereby they went up to it; and there were ammudim (pillars) by the doorposts, one on this side, and another on that side."}]