[{"num":40,"verse":"Early in April of the twenty-fifth year of our exile—the fourteenth year after Jerusalem was captured—the hand of the Lord was upon me, "},{"num":2,"verse":"and in a vision he took me to the land of Israel and set me down on a high mountain where I saw what appeared to be a city opposite me. "},{"num":3,"verse":"Going nearer, I saw a man whose face shone like bronze, standing beside the Temple gate, holding in his hand a measuring tape and a measuring stick."},{"num":4,"verse":"He said to me: “Son of dust, watch and listen and take to heart everything I show you, for you have been brought here so I can show you many things; and then you are to return to the people of Israel to tell them all you have seen.” "},{"num":5,"verse":"The man began to measure the wall around the outside of the Temple area with his measuring stick, which was 10½ feet long. He told me, “This wall is 10½ feet high and 10½ feet wide.” "},{"num":6,"verse":"Then he took me over to the passageway that goes through the eastern wall. We climbed the seven steps into the entrance, and he measured the entry hall of the passage; it was 10½ feet wide."},{"num":7,"verse":"Walking on through the passageway I saw that there were three guardrooms on each side; each of these rooms was 10½ feet square, with a distance of 8¾ feet along the wall between them. In front of these rooms was a low barrier 18 inches high and 18 inches wide. Beyond the guardrooms was a 10½-foot doorway opening into a 14-foot hall with 3½-foot columns. Beyond this hall, at the inner end of the passageway, was a vestibule 22¾ feet wide and 17½ feet long."},{"num":13,"verse":"Then he measured the entire outside width of the passageway, measuring across the roof from the outside doors of the guardrooms; this distance was 43¾ feet. "},{"num":14,"verse":"Then he estimated the pillars on each side of the porch to be about 100 feet high. "},{"num":15,"verse":"The full length of the entrance passage was 87½ feet from one end to the other. "},{"num":16,"verse":"There were windows that narrowed inward through the walls along both sides of the passageway and along the guardroom walls. The windows were also in the exit and in the entrance halls. The pillars were decorated with palm tree decorations."},{"num":17,"verse":"And so we passed through the passageway to the court inside. A stone pavement ran around the inside of the walls, and thirty rooms were built against the walls, opening onto this pavement. "},{"num":18,"verse":"This was called “the lower pavement.” It extended out from the walls into the court the same distance as the passageway did."},{"num":19,"verse":"Then he measured across to the wall on the other side of this court (which was called “the outer court” of the Temple) and found that the distance was 175 feet. "},{"num":20,"verse":"As I followed, he left the eastern passageway and went over to the passage through the northern wall and measured it. "},{"num":21,"verse":"Here, too, there were three guardrooms on each side, and all the measurements were the same as for the east passageway—87½ feet long and 43¾ feet from side to side across the top of the guardrooms. "},{"num":22,"verse":"There were windows, an entry hall, and the palm tree decorations just the same as on the east side. And there were seven steps leading up to the doorway to the entry hall inside."},{"num":23,"verse":"Here at the north entry, just as at the east, if one walked through the passageway into the court and straight across it, he came to an inner wall and a passageway through it to an inner court. The distance between the two passageways was 175 feet. "},{"num":24,"verse":"Then he took me around to the south gate and measured the various sections of its passageway and found they were just the same as in the others. "},{"num":25,"verse":"It had windows along the walls as the others did, and an entry hall. And like the others, it was 87½ feet long and 43¾ feet wide. "},{"num":26,"verse":"It, too, had a stairway of seven steps leading up to it, and there were palm tree decorations along the walls. "},{"num":27,"verse":"And here again, if one walked through the passageway into the court and straight across it, he came to the inner wall and a passageway through it to the inner court. And the distance between the passageways was 175 feet."},{"num":28,"verse":"Then he took me over to the inner wall and its south passageway. He measured this passageway and found that it had the same measurements as the passageways of the outer wall. "},{"num":29,"verse":"Its guardrooms, pillars, and entrance and exit hall were identical to all the others, and so were the windows along its walls and entry. And, like the others, it was 87½ feet long by 43¾ feet wide. "},{"num":31,"verse":"The only difference was that it had eight steps leading up to it instead of seven. It had palm tree decorations on the pillars, just as the others."},{"num":32,"verse":"Then he took me along the court to the eastern entrance of the inner wall, and measured it. It, too, had the same measurements as the others. "},{"num":33,"verse":"Its guardrooms, pillars, and entrance hall were the same size as those of the other passageways, and there were windows along the walls and in the entry hall; and it was 87½ feet long by 43¾ feet wide. "},{"num":34,"verse":"Its entry hall faced the outer court, and there were palm tree decorations on its columns, but there were eight steps instead of seven going up to the entrance."},{"num":35,"verse":"Then he took me around to the north gate of the inner wall, and the measurements there were just like the others: "},{"num":36,"verse":"The guardrooms, pillars, and entry hall of this passageway were the same as the others, with a length of 87½ feet and a width of 43¾ feet. "},{"num":37,"verse":"Its entry hall faced toward the outer court; it had palm tree decorations on the walls of each side of the passageway, and there were eight steps leading up to the entrance."},{"num":38,"verse":"But a door led from its entry hall into a side room where the flesh of the sacrifices was washed before being taken to the altar; "},{"num":39,"verse":"on each side of the entry hall of the passageway there were two tables where the animals for sacrifice were slaughtered for the burnt offerings, sin offerings, and guilt offerings to be presented in the Temple. "},{"num":40,"verse":"Outside the entry hall, on each side of the stairs going up to the north entrance, there were two more tables. "},{"num":41,"verse":"So, in all there were eight tables, four inside and four outside, where the sacrifices were cut up and prepared. "},{"num":42,"verse":"There were also four stone tables where the butchering knives and other implements were laid. These tables were about 2⅝ feet square and 1¾ feet high. "},{"num":43,"verse":"There were hooks, 3 or 4 inches long, fastened along the walls of the entry hall, and on the tables the flesh of the offering was to be laid."},{"num":44,"verse":"In the inner court there were two one-room buildings, one beside the northern entrance, facing south, and one beside the southern entrance, facing north."},{"num":45,"verse":"And he said to me: “The building beside the inner northern gate is for the priests who supervise the maintenance. "},{"num":46,"verse":"The building beside the inner southern entrance is for the priests in charge of the altar—the descendants of Zadok—for they alone of all the Levites may come near to the Lord to minister to him.”"},{"num":47,"verse":"Then he measured the inner court in front of the Temple and found it to be 175 feet square, and there was an altar in the court, standing in front of the Temple. "},{"num":48,"verse":"Then he brought me to the entrance hall of the Temple. Ten steps led up to it from the inner court. Its walls extended up on either side to form two pillars, each of them 8¾ feet thick. The entrance was 24½ feet wide with 5¼-foot walls. Thus the entry hall was 35 feet wide and 19¼ feet long."}]