[{"header":"Submit to the king of Babylon and live"},{"num":27,"verse":"Early in the rule of Judah’s King Zedekiah, Josiah’s son, this word came to Jeremiah from the Lord:"},{"num":2,"verse":"This is what the Lord said to me: Make a yoke of straps and bars and wear it on your neck."},{"num":3,"verse":"Then send word to the kings of Edom, Moab, Ammon, Tyre, and Sidon through their representatives who have come to Jerusalem to Judah’s King Zedekiah."},{"num":4,"verse":"Tell them to say to their masters: The Lord of heavenly forces, the God of Israel, proclaims: Say this to your masters:"},{"num":5,"verse":"By my great power and outstretched arm, I have made the earth and the people and animals that are on it. I can give it to anyone I please."},{"num":6,"verse":"Now I hand over all these countries to my servant King Nebuchadnezzar of Babylon. I even give him the wild animals as subjects."},{"num":7,"verse":"All nations will serve him, his son and grandson, until the time for his land arrives; then many nations and great kings will conquer him."},{"num":8,"verse":"As for the nation or country that won’t serve Babylon’s King Nebuchadnezzar and won’t put its neck under his yoke, I will punish it with sword, famine, and disease until I have destroyed it by his hand, declares the Lord."},{"num":9,"verse":"As for you, don’t listen to your prophets, diviners, dreamers, mediums, or your sorcerers who say to you, “Don’t serve the king of Babylon.”"},{"num":10,"verse":"They are lying to you, and their lies will lead to banishment from your land. I will drive you out, and you will perish."},{"num":11,"verse":"But any nation that puts its neck under the yoke of the king of Babylon and serves him, I will let stay in its land to till it and live on it, declares the Lord."},{"num":12,"verse":"I delivered the same message to Judah’s King Zedekiah: If you want to live, put your necks under the yoke of the king of Babylon and serve him and his people."},{"num":13,"verse":"Why should you and your people die by sword, famine, and disease, as the Lord pronounced against any nation that won’t serve the king of Babylon?"},{"num":14,"verse":"Pay no attention to the words of the prophets who encourage you not to serve the king of Babylon, for they are lying to you."},{"num":15,"verse":"I haven’t sent these prophets, declares the Lord; they are prophesying falsely in my name. If you listen to them, I will drive you out, and you will perish, both you and your prophets!"},{"num":16,"verse":"Then I spoke to the priests and all this people: This is what the Lord says: Don’t listen to the words of the prophets who are prophesying to you, “In a short while, the temple equipment will be brought back from Babylon.” They are prophesying a lie to you."},{"num":17,"verse":"Don’t listen to them; serve the king of Babylon and live. Otherwise, this city will be reduced to ruin."},{"num":18,"verse":"If they are really prophets and have the Lord’s word, let them intercede with the Lord of heavenly forces not to let the equipment left in the Lord’s temple and in the royal palace of Judah and Jerusalem be carted off to Babylon."},{"num":19,"verse":"This is what the Lord of heavenly forces proclaims about the pillars, the Sea, the stands, and the rest of the equipment left in this city,"},{"num":20,"verse":"which Babylon’s King Nebuchadnezzar didn’t plunder when he deported Jeconiah the son of Judah’s King Jehoiakim from Jerusalem to Babylon, along with all the officials of Judah and Jerusalem."},{"num":21,"verse":"Yes, this is what the Lord of heavenly forces, the God of Israel, proclaims about the equipment that is left in the Lord’s temple and in the royal palace in Judah, and in Jerusalem:"},{"num":22,"verse":"They will be carted off to Babylon where they will remain until the day I come looking for them, declares the Lord; then I will bring them back and restore them to this place."}]