[{"num":27,"verse":"At the beginning of the reign of Y’hoyakim the son of Yoshiyahu, king of Y’hudah, this word came to Yirmeyahu from Adonai: "},{"num":2,"verse":"“Adonai says this to me: ‘Make yourself a yoke of straps and crossbars, and put it on your neck. "},{"num":3,"verse":"Send [similar yokes] to the kings of Edom, of Mo’av, of the people of ‘Amon, of Tzor, and of Tzidon by means of the envoys they send to Yerushalayim, and to Tzidkiyahu king of Y’hudah. "},{"num":4,"verse":"Give them this message for their masters by telling their envoys that Adonai-Tzva’ot, the God of Isra’el, says for them to tell their masters:"},{"num":5,"verse":"“‘“I made the earth, humankind, and the animals on the earth by my great power and my outstretched arm; and I give it to whom it seems right to me. "},{"num":6,"verse":"For now, I have given over all these lands to my servant N’vukhadnetzar the king of Bavel; I have also given him the wild animals to serve him. "},{"num":7,"verse":"All the nations will serve him, his son and his grandson, until his own country gets its turn — at which time many nations and great kings will make him their slave. "},{"num":8,"verse":"The nation and kingdom that refuses to serve this N’vukhadnetzar king of Bavel, that will not put their necks under the yoke of the king of Bavel, I will punish,” says Adonai “with sword, famine and plague, until I have put an end to them through him."},{"num":9,"verse":"“‘“You, therefore, don’t listen to your prophets, diviners, dreamers, magicians or sorcerers, when they tell you that you won’t be subject to the king of Bavel; "},{"num":10,"verse":"for they are prophesying lies to you that will result in your being removed far from your land, with my driving you out, so that you perish. "},{"num":11,"verse":"But the nation that puts its neck under the yoke of the king of Bavel and serves him, that nation I will allow to remain on their own soil,” says Adonai. “They will farm it and live there.”’”"},{"num":12,"verse":"Then I spoke to Tzidkiyahu king of Y’hudah in just the same way: “Put your necks under the yoke of the king of Bavel, serve him and his people, and you will live. "},{"num":13,"verse":"Why would you want to die, you and your people, by sword, famine and plague — which is what Adonai has decreed for the nation that will not serve the king of Bavel? "},{"num":14,"verse":"Don’t listen to the words of the prophets who say to you, ‘You will not serve the king of Bavel’; because they are prophesying lies to you. "},{"num":15,"verse":"‘For I have not sent them,’ says Adonai, ‘and they are prophesying falsely in my name, with the result that I will drive you out, and you will perish — you and the prophets prophesying to you.’”"},{"num":16,"verse":"I also spoke to the cohanim and to all this people; I said, “This is what Adonai says: ‘Don’t listen to the words of the prophets prophesying to you that the articles from Adonai’s house will soon be returned from Bavel; because they are prophesying lies to you. "},{"num":17,"verse":"Don’t listen to them. Serve the king of Bavel, and stay alive; why should this city become a ruin?’ "},{"num":18,"verse":"But if they are in fact prophets, and if the word of Adonai is with them, then let them now intercede with Adonai-Tzva’ot that the articles still remaining in the house of Adonai and in the palace of the king of Y’hudah will not go off to Bavel. "},{"num":19,"verse":"For this is what Adonai-Tzva’ot says concerning the columns, the Sea, the bases and the rest of the articles still here in this city, "},{"num":20,"verse":"that N’vukhadnetzar, king of Bavel did not seize when he carried off captive Y’khanyahu the son of Y’hoyakim, king of Y’hudah, from Yerushalayim to Bavel, along with all the leading men of Y’hudah and Yerushalayim — "},{"num":21,"verse":"yes, this is what Adonai Shaddai, the God of Isra’el, says about the things remaining in the house of Adonai, in the palace of the king of Y’hudah and in Yerushalayim: "},{"num":22,"verse":"‘They will be carried to Bavel; and there they will stay until the day I remember them, bring them back and restore them to this place,’ says Adonai.”"}]