[{"header":"Jeremiah Wears an Ox Yoke"},{"num":27,"verse":"Soon after Josiah's son Zedekiah became king of Judah, the Lord told me "},{"num":2,"verse":"to make myself a yoke out of leather straps and wooden crossbars and to put it on my neck. "},{"num":3,"verse":"Then the Lord told me to send a message to the kings of Edom, Moab, Ammon, Tyre, and Sidon through their ambassadors who had come to Jerusalem to see King Zedekiah. "},{"num":4,"verse":"The Lord Almighty, the God of Israel, told me to command them to tell their kings that the Lord had said: "},{"num":5,"verse":"“By my great power and strength I created the world, human beings, and all the animals that live on the earth; and I give it to anyone I choose. "},{"num":6,"verse":"I am the one who has placed all these nations under the power of my servant, King Nebuchadnezzar of Babylonia, and I have made even the wild animals serve him. "},{"num":7,"verse":"All nations will serve him, and they will serve his son and his grandson until the time comes for his own nation to fall. Then his nation will serve powerful nations and great kings."},{"num":8,"verse":"“But if any nation or kingdom will not submit to his rule, then I will punish that nation by war, starvation, and disease until I have let Nebuchadnezzar destroy it completely. "},{"num":9,"verse":"Do not listen to your prophets or to those who claim they can predict the future, either by dreams or by calling up the spirits of the dead or by magic. They all tell you not to submit to the king of Babylonia. "},{"num":10,"verse":"They are deceiving you and will cause you to be taken far away from your country. I will drive you out, and you will be destroyed. "},{"num":11,"verse":"But if any nation submits to the king of Babylonia and serves him, then I will let it stay on in its own land, to farm it and live there. I, the Lord, have spoken.”"},{"num":12,"verse":"I said the same thing to King Zedekiah of Judah, “Submit to the king of Babylonia. Serve him and his people, and you will live. "},{"num":13,"verse":"Why should you and your people die in war or of starvation or disease? That is what the Lord has said will happen to any nation that does not submit to the king of Babylonia. "},{"num":14,"verse":"Do not listen to the prophets who tell you not to surrender to him. They are deceiving you. "},{"num":15,"verse":"The Lord himself has said that he did not send them and that they are lying to you in his name. And so he will drive you out, and you will be killed, you and the prophets who are telling you these lies.”"},{"num":16,"verse":"Then I told the priests and the people that the Lord had said: “Do not listen to the prophets who say that the Temple treasures will soon be brought back from Babylonia. They are lying to you. "},{"num":17,"verse":"Don't listen to them! Submit to the king of Babylonia and you will live! Why should this city become a pile of ruins? "},{"num":18,"verse":"If they are really prophets and if they have my message, let them ask me, the Lord Almighty, not to allow the treasures that remain in the Temple and in the royal palace to be taken to Babylonia.”"},{"num":19,"verse":"(When King Nebuchadnezzar took away to Babylonia the king of Judah, Jehoiachin son of Jehoiakim, and the leading men of Judah and Jerusalem, he left the columns, the bronze tank, the carts, and some of the other Temple treasures.)"},{"num":21,"verse":"“Listen to what I, the Lord Almighty, the God of Israel, say about the treasures that are left in the Temple and in the royal palace in Jerusalem: "},{"num":22,"verse":"They will be taken to Babylonia and will remain there until I turn my attention to them. Then I will bring them back and restore them to this place. I, the Lord, have spoken.”"}]