[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "7:6-27 Here is an affecting example of the danger of youthful lusts. It is a history or a parable of the most instructive kind. Will any one dare to venture on temptations that lead to impurity, after Solomon has set before his eyes in so lively and plain a manner, the danger of even going near them? Then is he as the man who would dance on the edge of a lofty rock, when he has just seen another fall headlong from the same place. The misery of self-ruined sinners began in disregard to God's blessed commands. We ought daily to pray that we may be kept from running into temptation, else we invite the enemies of our souls to spread snares for us. Ever avoid the neighbourhood of vice. Beware of sins which are said to be pleasant sins. They are the more dangerous, because they most easily gain the heart, and close it against repentance. Do nothing till thou hast well considered the end of it. Were a man to live as long as Methuselah, and to spend all his days in the highest delights sin can offer, one hour of the anguish and tribulation that must follow, would far outweigh them.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The reference to the husband is probably a blind. The use of the word \"goodman\" is due to the wish of the English translators to give a colloquial character to this part of their Version. The Hebrew is merely \"the man.\" A touch of scorn may be noticed in the form of speech: not \"my husband,\" but simply \"the man.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "20. the day appointed—perhaps, literally, \"a full moon,\" that is, a fortnight's time (compare Pr 7:19).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He hath taken a bag of money with him; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which is an evidence that he designs to go far, and to stay a considerable time. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And will come home at the day appointed; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " so that we need not fear any surprisal. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "He hath taken a bag of money with him,.... Or, \"in his hand\" (a); either for merchandise, as Gersom; or for defraying: the charges of his journey; and both suppose length of time: if for merchandise, it required time to purchase goods, and see them packed up and sent away; or if for his journey, since it was not a few pieces of money he put in his pocket to defray expenses, but a bag of it he carried in his hand, it shows that he should be out a considerable time; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and will come home at the day appointed; and not before: Aben Ezra interprets it, at the beginning of the month, at the new moon, when the moon is covered (b), which Horace (c) calls \"tricessima sabbata\": but rather it is to be understood of the full moon, as Aquila and the Vulgate Latin version render it; when it is light all night, and so a proper time for travelling home again. Gersom takes it to mean the beginning of the year, when the holy blessed God, parabolically speaking, sits upon a throne to judge the world in righteousness: the Targum calls it the day of the congregation; some fixed festival day, when the congregation meets together; and at such a festival, or appointed time, this good man had fixed for his return, and when, and not before, he would. This she says to remove all fears from the young man of being surprised and caught by her husband. There is an appointed time for Christ's second coming, when he will certainly come, and not before; and which is supposed to be at a great distance of time: and therefore wicked men and seducers, and such as the apostate church of Rome make use of to encourage themselves in their wickedness, in hopes of impunity, put the evil day far away from them; but in the appointed time Christ will come, and call his servants to an account, good and bad. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) \"in manu sua\", Pagninus, Montanus, Mercerus, Gejerus, Michaelis. (b)  \"in die plenae lunae\", V. L. Michaelis; \"novilunii\", so some in Vatablus, Piscator; \"ad diem interlunii\", Cocceius, Schultens. (c) Satirar. l. 1. Sat. 9. v. 69. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(a) \"in manu sua\", Pagninus, Montanus, Mercerus, Gejerus, Michaelis. (b)  \"in die plenae lunae\", V. L. Michaelis; \"novilunii\", so some in Vatablus, Piscator; \"ad diem interlunii\", Cocceius, Schultens. (c) Satirar. l. 1. Sat. 9. v. 69. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "He hath taken a bag of money with him, and will come home at the day appointed.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a bag of money",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] to cover his expenses for a considerable time.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "day appointed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "fall moon",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 81:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in the time appointed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", A.V. (as here), but ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "full moon",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", R.V.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "“A fortnight later, as now it would seem to have been new moon when the nights are dark.” Nutt, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "O. T. Comm. for English Readers",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 20.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "He hath taken a bag of money with him;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " not only to defray the expenses of the journey (a fact which need not be dwelt upon), but because he has some pecuniary business to transact which will occupy his time, and prevent his return before the appointed hour. And ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "will come home at the day appointed;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " better, as the Revised Version, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "he will come home at the full moor",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "in die pleura lunae",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Vulgate). ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "כֶּסֶא",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " here, and ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "כֶּסֶה",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 81:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", are rightly translated \"the full moon,\" this rendering being supported by the Syriac ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "keso",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", though the etymology is doubtful. As it has before been mentioned that the night was dark (ver. 9), it is plain that there were still many days to run before the moon was full, and the husband returned. Proverbs 7:20",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The adulteress now deprives the youth of all fear; the circumstances under which her invitation is given are as favourable as possible.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "19 \"For the man is not at home,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "     He has gone on a long journey.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "20 He has taken the purse with him:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "     He will not return home till the day of the full moon.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "It is true that the article stands in האישׁ, Arab. alm'ar-fat, i.e., serves to define the word: the man, to whom here κατ ̓  ̓ξοχήν and alone reference can be made, viz., the husband of the adulteress (Fl.); but on the other side it is characteristic that she does not say אישׁי (as e.g., Genesis 29:32), but ignores the relation of love and duty in which she is placed to him, and speaks of him as one standing at a distance from her (Aben-Ezra). Erroneously Vogel reads בּבּית after the Targ. instead of בּביתו. We say in Hebr. אינו בביתו, il n'est pas chez soi, as we say לקח בּידו, il a pris avec soi (cf. Jeremiah 38:10). מרחוק Hitzig seeks to connect with the verb, which, after Isaiah 17:13; Isaiah 22:3, is possible; for the Hebr. מרחוק (ממּרחק), far off, has frequently the meaning from afar, for the measure of length is determined not from the point of departure outward, but from the end, as e.g., Homer, Il. ii. 456; ἕκαθεν δέ τε φαίνεται αὐγή, from afar the gleam is seen, i.e., shines hither from the distance. Similarly we say in French, il vient du cot du nord, he comes from the north, as well as il va du cot du nord, he goes northwards. But as we do not say: he has gone on a journey far off, but: on a distant journey, so here מרחוק is virtually an adj. (vid., under Isaiah 5:26) equivalent to רחוקה (Numbers 9:10): a journey which is distant  equals  such as from it he has a long way back. Michaelis has well remarked here: ut timorem ei penitus adimat, veluti per gradus incedit. He has undertaken a journey to a remote point, but yet more: he has taken money with him, has thus business to detain him; and still further: he has even determined the distant time of his return. צרור־הכּסף .nruter (thus to be written after Ben-Asher, vid., Baer's Torath Emeth, p. 41) is the purse (from צרר, to bind together), not one of many, but that which is his own. The terminus precedes 20b to emphasize the lateness; vid., on כּסא under Psalm 81:4. Graec. Venet. τῇ ἡμέρᾳ τοῦ καιροῦ, after Kimchi and others, who derive כסא (כסה) from the root כס, to reckon, and regard it as denoting only a definite time. But the two passages require a special idea; and the Syr. ḳêso, which in 1 Kings 12:32; 2 Chronicles 7:10, designates the time from the 15th day of the month, shows that the word denotes not, according to the Talmud, the new moon (or the new year's day), when the moon's disk begins to cover itself, i.e., to fill (יתכסה), but the full moon, when it is covered, i.e., filled; so that thus the time of the night-scene here described is not that of the last quarter of the moon (Ewald), in which it rises at midnight, but that of the new moon (Hitzig), when the night is without moonlight. Since the derivation of the word from כסא (כסה), to cover, gives the satisfactory idea of the covering or filling of the moon's disk, we do not seek after any other; Dietrich fixes on the root-idea of roundness, and Hitzig of vision (כסא  equals  סכה, שׂכה, vid., on the contrary, under Psalm 143:9). The ל is that of time at which, in which, about which, anything is done; it is more indefinite than בּ would be. He will not return for some fourteen days. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "It is true that the article stands in האישׁ, Arab. alm'ar-fat, i.e., serves to define the word: the man, to whom here κατ ̓  ̓ξοχήν and alone reference can be made, viz., the husband of the adulteress (Fl.); but on the other side it is characteristic that she does not say אישׁי (as e.g., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 29:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), but ignores the relation of love and duty in which she is placed to him, and speaks of him as one standing at a distance from her (Aben-Ezra). Erroneously Vogel reads בּבּית after the Targ. instead of בּביתו. We say in Hebr. אינו בביתו, il n'est pas chez soi, as we say לקח בּידו, il a pris avec soi (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 38:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). מרחוק Hitzig seeks to connect with the verb, which, after ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 17:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 22:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", is possible; for the Hebr. מרחוק (ממּרחק), far off, has frequently the meaning from afar, for the measure of length is determined not from the point of departure outward, but from the end, as e.g., Homer, Il. ii. 456; ἕκαθεν δέ τε φαίνεται αὐγή, from afar the gleam is seen, i.e., shines hither from the distance. Similarly we say in French, il vient du cot du nord, he comes from the north, as well as il va du cot du nord, he goes northwards. But as we do not say: he has gone on a journey far off, but: on a distant journey, so here מרחוק is virtually an adj. (vid., under ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 5:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") equivalent to רחוקה (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 9:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "): a journey which is distant  equals  such as from it he has a long way back. Michaelis has well remarked here: ut timorem ei penitus adimat, veluti per gradus incedit. He has undertaken a journey to a remote point, but yet more: he has taken money with him, has thus business to detain him; and still further: he has even determined the distant time of his return. צרור־הכּסף .nruter (thus to be written after Ben-Asher, vid., Baer's Torath Emeth, p. 41) is the purse (from צרר, to bind together), not one of many, but that which is his own. The terminus precedes 20b to emphasize the lateness; vid., on כּסא under ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 81:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Graec. Venet. τῇ ἡμέρᾳ τοῦ καιροῦ, after Kimchi and others, who derive כסא (כסה) from the root כס, to reckon, and regard it as denoting only a definite time. But the two passages require a special idea; and the Syr. ḳêso, which in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 12:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 7:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", designates the time from the 15th day of the month, shows that the word denotes not, according to the Talmud, the new moon (or the new year's day), when the moon's disk begins to cover itself, i.e., to fill (יתכסה), but the full moon, when it is covered, i.e., filled; so that thus the time of the night-scene here described is not that of the last quarter of the moon (Ewald), in which it rises at midnight, but that of the new moon (Hitzig), when the night is without moonlight. Since the derivation of the word from כסא (כסה), to cover, gives the satisfactory idea of the covering or filling of the moon's disk, we do not seek after any other; Dietrich fixes on the root-idea of roundness, and Hitzig of vision (כסא  equals  סכה, שׂכה, vid., on the contrary, under ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 143:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The ל is that of time at which, in which, about which, anything is done; it is more indefinite than בּ would be. He will not return for some fourteen days. ",
            "children": []
          }
        ]
      }
    ]
  }
]