[{"header":"Jephthah Is Chosen as Leader"},{"num":11,"verse":"Jephthah was from the people of Gilead. He was a strong soldier. His father was named Gilead, and his mother was a prostitute. "},{"num":2,"verse":"Gilead’s wife had several sons. When they grew up, they forced Jephthah to leave his home. They said to him, “You will not get any of our father’s property. You are the son of another woman.” "},{"num":3,"verse":"So Jephthah ran away from his brothers. He lived in the land of Tob. There some worthless men began to follow Jephthah."},{"num":4,"verse":"After a time the Ammonite people fought against Israel. "},{"num":5,"verse":"The Ammonites made war against Israel. At that time the elders of Gilead came to Jephthah. They wanted him to come back to Gilead. "},{"num":6,"verse":"They said to him, “Come and lead our army so we can fight the Ammonites.”"},{"num":7,"verse":"But Jephthah said to them, “Didn’t you hate me? You forced me to leave my father’s house! Why are you coming to me now that you are in trouble?”"},{"num":8,"verse":"The elders of Gilead said to Jephthah, “That is the reason we come to you now. Please come with us and fight against the Ammonites! You will be the ruler over everyone who lives in Gilead.”"},{"num":9,"verse":"Then Jephthah answered, “Suppose you take me back to Gilead to fight the Ammonites. If the Lord helps me win, I will be your ruler.”"},{"num":10,"verse":"The elders of Gilead said to him, “The Lord is listening to everything we are saying. We promise to do all that you tell us to do.” "},{"num":11,"verse":"So Jephthah went with the elders of Gilead. The people made him their leader and commander of their army. Jephthah repeated all of his words in front of the Lord at Mizpah."},{"header":"Jephthah Sends Messengers to the Ammonite King"},{"num":12,"verse":"Jephthah sent messengers to the king of the Ammonites. The messengers asked the king, “What have you got against Israel? Why have you come to attack our land?”"},{"num":13,"verse":"The king of the Ammonites answered the messengers of Jephthah. He said, “We are fighting Israel because you took our land when you came up from Egypt. You took our land from the Arnon River to the Jabbok River to the Jordan River. Now tell the people of Israel to give our land back to us in peace.”"},{"num":14,"verse":"Jephthah sent the messengers to the Ammonite king again. "},{"num":15,"verse":"They took this message:"},{"num":16,"verse":"When the people of Israel came out of Egypt, they went into the desert. They went to the Gulf of Aqaba and then to Kadesh. "},{"num":17,"verse":"Israel sent messengers to the king of Edom. They asked, ‘Let the people of Israel go across your land.’ But the king of Edom didn’t let us. We sent the same message to the king of Moab. But he would not let us go across his land either. So the Israelites stayed at Kadesh."},{"num":18,"verse":"“Then the Israelites went into the desert. They went around the borders of the lands of Edom and Moab. Israel walked east of the land of Moab. They camped on the other side of the Arnon River. It was the border of the land of Moab. They did not cross it to go into the land of Moab."},{"num":19,"verse":"“Then Israel sent messengers to Sihon king of the Amorites. Sihon was the king of the city of Heshbon. The messengers asked Sihon, ‘Let the people of Israel pass through your land. We want to go to our land.’ "},{"num":20,"verse":"But Sihon would not let the Israelites cross his land. He gathered all of his people and camped at Jahaz. Then the Amorites fought with Israel."},{"num":21,"verse":"“But the Lord, the God of Israel, helped the Israelites to defeat Sihon and his army. All the land of the Amorites became the property of Israel. "},{"num":22,"verse":"So Israel took all the land of the Amorites. It went from the Arnon River to the Jabbok River. It also went from the desert to the Jordan River."},{"num":23,"verse":"“It was the Lord, the God of Israel, who forced out the Amorites ahead of the people of Israel. So do you think you can make the people of Israel leave this land? "},{"num":24,"verse":"Surely you can live in the land which your god Chemosh has given you. So we will live in the land the Lord our God has given us!"},{"num":25,"verse":"“Are you any better than Balak son of Zippor? He was the king of Moab. Did he ever quarrel or fight with the people of Israel? "},{"num":26,"verse":"For 300 years the Israelites have lived in Heshbon and Aroer and the towns around them. They have lived for 300 years in all the cities along the Arnon River. Why have you not taken these cities back in all that time? "},{"num":27,"verse":"I have not sinned against you. But you are sinning against me by making war on me! May the Lord, the Judge, decide whether the Israelites or Ammonites are right.”"},{"num":28,"verse":"But the king of the Ammonites ignored this message from Jephthah."},{"header":"Jephthah’s Promise"},{"num":29,"verse":"Then the Spirit of the Lord entered Jephthah. Jephthah passed through Gilead and Manasseh. He came to the city of Mizpah in Gilead. From there, Jephthah passed through to the land of the Ammonites. "},{"num":30,"verse":"Jephthah made a promise to the Lord. He said, “If you will let me defeat the Ammonites, "},{"num":31,"verse":"I will give you a burnt offering. I will sacrifice the first thing that comes out of my house to meet me when I return from the victory. It will be the Lord’s.”"},{"num":32,"verse":"Then Jephthah went over to fight the Ammonites. The Lord helped him defeat them. "},{"num":33,"verse":"Jephthah defeated them from the city of Aroer to the area of Minnith. He defeated them as far as the city of Abel Keramim. He defeated 20 cities in this area. The defeat was great. So the Ammonites were defeated by the Israelites."},{"num":34,"verse":"When Jephthah returned home to Mizpah, his daughter came out to meet him. She was playing a tambourine and dancing. She was his only child. Jephthah did not have any other sons or daughters. "},{"num":35,"verse":"When Jephthah saw his daughter, he tore his clothes to show how upset he was. He said, “My daughter! You have made me so sad! This is because I have made a promise to the Lord, and I cannot break it!”"},{"num":36,"verse":"Then his daughter said, “Father, you made a promise to the Lord. So do to me just what you promised. The Lord helped you defeat your enemies, the Ammonites.” "},{"num":37,"verse":"Then she said, “But let me do one thing. Let me be alone for two months to go to the mountains. I will never marry. So let me and my friends go and cry together.”"},{"num":38,"verse":"Jephthah said, “Go.” He sent her away for two months. She and her friends stayed in the mountains. There they cried for her because she would never marry. "},{"num":39,"verse":"After two months she returned to her father. Jephthah did to her what he promised to the Lord. Now Jephthah’s daughter had never had a husband."},{"num":40,"verse":"Every year the women of Israel would go out for four days. They did this to remember the daughter of Jephthah from Gilead."}]