[{"num":11,"verse":"And so in that time Jephthah, a man of Gilead, was a full strong man, and a fighter, the son of a woman whore, the which Jephthah was born of Gilead. (Now at that time Jephthah, a Gileadite, was a very strong man, and a fighter, the son of a whore-woman, and his father was Gilead.)"},{"num":2,"verse":"And Gilead had a wife, of whom he had sons, which after that they increased (and after they had grown up), casted out Jephthah, and said, Thou mayest not be (an) heir in the house of our father, for thou art born of another mother."},{"num":3,"verse":"And (so) he fled (from) his brethren, and eschewed them, and dwelled in the land of Tob; and poor men were gathered to him, and followed him as a prince."},{"num":4,"verse":"(And) In those days the sons of Ammon fought against Israel;"},{"num":5,"verse":"and when they continued sharply (their enmities), the greater men in birth of Gilead, went to take into the help of themselves Jephthah from the land of Tob; (and when they continued their sharp enmities, the men of great age, that is, the elders, of Gilead went to get Jephthah from the land of Tob to help them;)"},{"num":6,"verse":"and they said to him, Come thou, and be our prince, and fight against the sons of Ammon."},{"num":7,"verse":"To which he answered, Whether not ye it be, that hated me, and threw me out of the house of my father, and now ye have come to me, and were compelled by need? (To whom he answered, Was it not ye, who hated me, and threw me out of my father’s house? but now ye have come to me, yea, compelled by need!)"},{"num":8,"verse":"And the princes of Gilead said to Jephthah, Therefore for this cause we came now to thee, that thou go with us, and fight against the sons of Ammon; and that thou be the duke of all men that dwell in Gilead. (And the leaders of Gilead said to Jephthah, Yea, for this reason we have now come to thee, so that thou go with us, and fight against the Ammonites; and that thou be the leader of all who live in Gilead.)"},{"num":9,"verse":"And Jephthah said to them, Whether ye came verily, or without fraud, to me, that I fight for you against the sons of Ammon, and if the Lord shall betake them into mine hands, shall I be your prince? (And Jephthah said to them, Did ye come truthfully, or without deception, to me, so that if I fight for you against the Ammonites, and if the Lord shall deliver them into my hands, then I shall be your leader?)"},{"num":10,"verse":"The which answered to him, The Lord himself, that heareth these things, is mediator and witness, that we shall fulfill our promises to thee. (And they answered to him, The Lord himself, who heareth these things, is our mediator and witness, that we shall fulfill our promises to thee.) "},{"num":11,"verse":"And so Jephthah went with the princes of Gilead, and all the people made him their prince; and Jephthah spake all his words (again) before the Lord in Mizpeh."},{"num":12,"verse":"And he sent messengers to the king of the sons of Ammon, which messengers should say of his person (which messengers were to say for him), What is to me and to thee, for thou hast come against me to waste my land?"},{"num":13,"verse":"To the which messengers the king answered, For Israel, when he ascended from Egypt, took away my land, from the coasts of Arnon unto Jabbok, and to (the) Jordan, now therefore yield it to me again with peace. (To which messengers the king answered, For Israel, when they came up from Egypt, took away my land, from the Arnon River unto the Jabbok River, and unto the Jordan River; and so now peacefully, or without any need for fighting, return thou these lands to me.)"},{"num":14,"verse":"By the which messengers Jephthah sent again, and commanded to them, that they should say to the king of Ammon,"},{"num":15,"verse":"Jephthah saith these things, Israel took not the land of Moab, neither the land of the sons of Ammon; (Jephthah saith these things, Nay! Israel did not take the land of Moab, nor the land of the Ammonites;)"},{"num":16,"verse":"but when they went up from Egypt, Israel went by the wilderness unto the Red Sea, and came into Kadesh;"},{"num":17,"verse":"and he sent messengers to the king of Edom, and said, Suffer thou me, that I go through thy land (and they sent messengers to the king of Edom, saying, Allow us to go through thy land); the which king would not assent to the prayers of Israel. Also Israel sent to the king of Moab, and he despised to give Israel passage; and so Israel dwelled in Kadesh,"},{"num":18,"verse":"and he compassed by the side the land of Edom, and the land of Moab; and he came to the east coast of the land of Moab, and setted tents beyond Arnon, neither he would enter into the terms of Moab; for Arnon is the end of the land of Moab. (and they went around by the borders of the land of Edom, and the land of Moab; and they came to the east side of the land of Moab, and pitched their tents on the other side of the Arnon River, for they would not enter into the land of Moab; for the Arnon River is the border of the land of Moab.)"},{"num":19,"verse":"And so Israel sent messengers to Sihon, king of Amorites, that dwelled in Heshbon; and they said to him, Suffer thou, that I pass through thy land unto the river. (And so Israel sent messengers to Sihon, the king of the Amorites, who lived in Heshbon; and they said to him, Allow us to pass through thy land to the river.)"},{"num":20,"verse":"And he despised the words of Israel, and suffered not him (to) pass by his terms, but with a multitude without number gathered together, Sihon went out against Israel (at Jahaz), and against-stood him strongly. (But he scorned Israel’s request, and would not allow them to pass through his land; and with a multitude without number gathered together, Sihon went out against the people of Israel at Jahaz, and strongly stood against them.)"},{"num":21,"verse":"And the Lord betook Sihon with all his host into the hands of Israel; and Israel smote him, and had in possession all the land of Amorites, the dweller(s) of that country, (And the Lord delivered Sihon with all his army into the hands of Israel; and Israel struck them down, and had in possession all the land of the Amorites, the inhabitants of that country,)"},{"num":22,"verse":"and all the coasts thereof, from (the) Arnon unto (the) Jabbok, and from the wilderness unto (the) Jordan."},{"num":23,"verse":"Therefore the Lord God of Israel destroyed Amorites, fighting against him for his people Israel. And wilt thou now have in possession his land? (And so the Lord God of Israel destroyed the Amorites, fighting against them for his people Israel. And now wilt thou take possession of their land?)"},{"num":24,"verse":"Whether not those things which Chemosh, thy god, had in possession, be due to thee by right? Soothly those things which the Lord our God (the) overcomer hath gotten, shall fall into our possession; (Be not those things which Chemosh, thy god, had in possession, by rights be due to thee? And likewise, those things which the Lord our God the Overcomer hath taken, they shall be ours;)"},{"num":25,"verse":"but in hap thou art better than Balak, the son of Zippor, king of Moab, either thou mayest say, that Balak strived against Israel, and fought against him, (but perhaps thou art better than Balak, the son of Zippor, the king of Moab, or thou mayest say, that Balak contended against Israel, and fought against them,)"},{"num":26,"verse":"when Israel dwelled in Heshbon, and in towns thereof, and in Aroer, and in towns thereof, and in all cities beyond (the) Jordan, by three hundred years. Why in so much time assayed ye nothing on this asking again? (when Israel lived in Heshbon, and its towns, and in Aroer, and its towns, and in all the cities on the eastern side of the Jordan River, for three hundred years. Why have ye done nothing to try to take them back in all this time?)"},{"num":27,"verse":"Therefore not I do sin against thee, but thou doest evil against me, and bringest in battles not just to me; the Lord, (the) judge of this day, deem betwixt the sons of Israel and betwixt the sons of Ammon. (And so I do not sin against thee, but thou doest evil against me, and bringest in battles not just, or fair, to me; the Lord is the judge, and he shall judge this very day between the Israelites and the Ammonites.)"},{"num":28,"verse":"And the king of the sons of Ammon would not assent to the words of Jephthah, which he sent by the messengers."},{"num":29,"verse":"Therefore the spirit of the Lord was made upon Jephthah, and he compassed Gilead, and Manasseh, Mizpeh and Gilead (and then back to Mizpeh of Gilead); and he passed (over) from thence to the sons of Ammon,"},{"num":30,"verse":"and he made a vow to the Lord, and said, If thou shalt betake the sons of Ammon into mine hands,"},{"num":31,"verse":"whoever goeth out first of the doors of mine house, and cometh against me turning again with peace from the sons of Ammon, I shall offer him (up as a) burnt sacrifice to the Lord. (whoever first goeth out of the doors of my house, and cometh to meet me when I return in victory over the Ammonites, I shall offer him up as a burnt sacrifice to the Lord.)"},{"num":32,"verse":"And Jephthah went to the sons of Ammon, to fight against them, which the Lord betook into his hands;"},{"num":33,"verse":"and he smote from Aroer till that he came into Minnith, (yea,) twenty cities, and (even) unto Abel, which is set about with vineries, with full great vengeance; and the sons of Ammon were made low of the sons of Israel. (and he struck down, or overcame, from Aroer until that he came unto Minnith, twenty cities, and even unto Abelkeramim, with very great vengeance; and the Ammonites were made low before the Israelites.)"},{"num":34,"verse":"And when Jephthah turned again into Mizpeh, (to) his house, his one begotten daughter came to meet him with tympans, and crowds dancing; for he had not other free children. (And when Jephthah returned to Mizpeh, to his house, his only daughter came to meet him with tambourines, and people dancing; and he had no other children.)"},{"num":35,"verse":"And when he saw her, he rent his clothes, and said, Alas! my daughter, thou hast troubled me, and thou art troubled; for I opened my mouth to the Lord, and I may do none other thing. (And when he saw her, he tore his clothes, and said, Alas! my daughter, thou hast brought woe upon me, and woe upon thyself; for I opened my mouth to the Lord, and I may do no other thing.)"},{"num":36,"verse":"To whom she answered, My father, if thou openedest thy mouth to the Lord, do to me whatever thing thou promisedest, while vengeance and victory of thine enemies be granted to thee (for vengeance and victory over thy enemies have been granted to thee by the Lord)."},{"num":37,"verse":"And she said to her father, Give thou to me only this thing, which I beseech; suffer thou me that in two months I compass [the] hills (allow me for two months to go about the hills), and bewail my maidenhood with my fellows."},{"num":38,"verse":"To whom he answered, Go thou. And he suffered her in two months (And he allowed her to go away for two months). And when she had gone forth with her fellows, and her play-frères, she bewept her maidenhood in the hills."},{"num":39,"verse":"And when two months were fulfilled, she turned again to her father, and he did to her as he (had) avowed; and she knew no man fleshly, (that is, she died a virgin). From that time a custom came in Israel, and that custom is kept (to this day),"},{"num":40,"verse":"that after the end of the year the daughters of Israel come together, and bewail the daughter of Jephthah of Gilead (for) four days."}]