[{"num":4,"verse":"The wife of one of the guild prophets complained to Elisha. “Your servant my husband died,” she said, “and you know that he feared Adonai. Now a creditor has come to take my two children as his slaves.” "},{"num":2,"verse":"Elisha asked her, “What should I do for you? Tell me, what do you have in the house?” She answered, “Your servant has nothing in the house but a flask of oil.” "},{"num":3,"verse":"Then he said, “Go, and borrow containers from all your neighbors, empty containers; and don’t borrow just a few! "},{"num":4,"verse":"Then go in; shut the door, with you and your sons inside; and pour oil into all those containers; and as they are filled, put them aside.” "},{"num":5,"verse":"So she left him and shut the door on herself and her sons. They brought her the containers while she poured. "},{"num":6,"verse":"When the containers were full, she said to her son, “Bring me another container”; but he answered, “There isn’t another container.” Then the oil stopped flowing. "},{"num":7,"verse":"She came and told the man of God; and he said, “Go, sell the oil, and pay your debt; then you and your sons can live on what’s left.”"},{"num":8,"verse":"One day Elisha visited Shunem, and a well-to-do woman living there pressed him to stay and eat a meal. After this, whenever he came through, he stopped there for a meal. "},{"num":9,"verse":"She said to her husband, “I can see that this is a holy man of God who keeps stopping at our place. "},{"num":10,"verse":"Please, let’s build him a little room on the roof. We’ll put a bed and a table in it for him, and a stool and a candlestick. Then, whenever he comes to visit us, he can stay there.”"},{"num":11,"verse":"One day Elisha came to visit there, and he went into the upper room to lie down. "},{"num":12,"verse":"He said to Geichazi his servant, “Call this Shunamit.” He called her; and when she arrived, "},{"num":13,"verse":"he said to him, “Tell her this: ‘You have shown us so much hospitality! What can I do to show my appreciation? Do you want me to say anything to the king for you? or to the commander of the army?” She answered, “I’m happy living as I do, among my own people.” "},{"num":14,"verse":"He said, “What, then, is to be done for her?” Geichazi answered, “There’s one thing — she doesn’t have a son; and her husband is old. "},{"num":15,"verse":"Elisha said, “Call her.” After he called her, she stood in the doorway. "},{"num":16,"verse":"He said, “Next year, when the season comes around, you will be holding a son.” “No, my lord,” she answered. “Man of God, don’t lie to your servant!” "},{"num":17,"verse":"But the woman conceived and gave birth to a son the following year when the season came around, just as Elisha had said to her."},{"num":18,"verse":"When the child was old enough, he went out one day to be with his father, who was with the reapers. "},{"num":19,"verse":"Suddenly he cried out to his father, “My head! My head hurts!” He said to his servant, “Carry him back to his mother.” "},{"num":20,"verse":"When he had taken him and brought him to his mother, he lay on her lap until noon; and then he died. "},{"num":21,"verse":"She went up and laid him on the bed of the man of God, shut the door on him and went out. "},{"num":22,"verse":"She called to her husband and said, “Please send me one of the servants with a donkey. I must get to the man of God as fast as I can; I’ll come straight back.” "},{"num":23,"verse":"He asked, “Why are you going to him today? It isn’t Rosh-Hodesh and it isn’t Shabbat.” She said, “It’s all right.” "},{"num":24,"verse":"Then she saddled the donkey and ordered her servant, “Drive as fast as you can; don’t slow down for me unless I say so.”"},{"num":25,"verse":"She set out and came to the man of God on Mount Karmel. When the man of God saw her in the distance, he said to Geichazi his servant, “Look, here comes that Shunamit. "},{"num":26,"verse":"Run now to meet her, and ask her, “Is everything all right with you? with your husband? with the child?” She answered, “Everything is all right.” "},{"num":27,"verse":"But when she reached the man of God on the hill, she grabbed his feet. Geichazi came up to push her away, but the man of God said, “Leave her alone. She is in great distress, but Adonai has hidden from me what it is, he hasn’t told me.” "},{"num":28,"verse":"Then she said, “Did I ask my lord for a son? Didn’t I say not to deceive me?” "},{"num":29,"verse":"Then Elisha said to Geichazi, “Get dressed for action, take my staff in your hand, and be on your way. If you meet anyone, don’t greet him; if anyone greets you, don’t answer; and lay my staff on the child’s face.” "},{"num":30,"verse":"The mother of the child said, “As Adonai lives, and as you live, I will not leave you. He got up and followed her. "},{"num":31,"verse":"Geichazi went on ahead of them and laid the staff on the child’s face, but there was no sound or sign of life. So he went back to Elisha and told him, “The child didn’t wake up.”"},{"num":32,"verse":"When Elisha reached the house, there the child was, dead and laid on the bed. "},{"num":33,"verse":"He went in, shut the door on the two of them and prayed to Adonai. "},{"num":34,"verse":"Then he got up on the bed and lay on top of the child, putting his mouth on his mouth, his eyes on his eyes and his hands on his hands. As he stretched himself out on the child, its flesh began to grow warm. "},{"num":35,"verse":"Then he went down, walked around in the house awhile, went back up and stretched himself out on the child again. The child sneezed seven times, then opened his eyes. "},{"num":36,"verse":"Elisha called Geichazi and said, “Call this Shunamit.” So he called her; and when she came in to him, he said, “Pick up your son.” "},{"num":37,"verse":"She entered, fell at his feet and prostrated herself on the floor. Then she picked up her son and went out."},{"num":38,"verse":"Elisha went back to Gilgal. At the time, there was a famine in the land. The guild prophets were sitting before him, and he said to his servant, “Put the big pot on the fire, and boil some soup for the prophets.” "},{"num":39,"verse":"One of them went out to the field to gather vegetables and came upon a wild vine, from which he filled the front of his cloak with wild squash. On returning he cut them up and put them into the stew; they didn’t know what they were. "},{"num":40,"verse":"Then they poured it out for the men to eat; but on tasting it, they cried, “Man of God! There’s death in that pot!” And they couldn’t eat it. "},{"num":41,"verse":"But he said, “Bring some flour.” He threw it in the pot, then said, “Pour it out for the people to eat.” This time there was nothing harmful in the pot."},{"num":42,"verse":"A man came from Ba‘al-Shalishah bringing the man of God twenty loaves of bread made from the barley firstfruits and fresh ears of grain in his sack. Elisha said, “Give this to the people to eat.” "},{"num":43,"verse":"His servant said, “How am I to serve this to a hundred men?” But he said, “Give it to the people to eat; for Adonai says that they will eat and have some left over.” "},{"num":44,"verse":"So he served them, and they ate and had some left over, as Adonai had said."}]