[{"header":"Elisha and the Widow’s Oil"},{"num":4,"verse":"Now the wife of one of the sons of the prophets cried to Eli′sha, “Your servant my husband is dead; and you know that your servant feared the Lord, but the creditor has come to take my two children to be his slaves.” "},{"num":2,"verse":"And Eli′sha said to her, “What shall I do for you? Tell me; what have you in the house?” And she said, “Your maidservant has nothing in the house, except a jar of oil.” "},{"num":3,"verse":"Then he said, “Go outside, borrow vessels of all your neighbors, empty vessels and not too few. "},{"num":4,"verse":"Then go in, and shut the door upon yourself and your sons, and pour into all these vessels; and when one is full, set it aside.” "},{"num":5,"verse":"So she went from him and shut the door upon herself and her sons; and as she poured they brought the vessels to her. "},{"num":6,"verse":"When the vessels were full, she said to her son, “Bring me another vessel.” And he said to her, “There is not another.” Then the oil stopped flowing. "},{"num":7,"verse":"She came and told the man of God, and he said, “Go, sell the oil and pay your debts, and you and your sons can live on the rest.”"},{"header":"Elisha Raises the Shunammite’s Son"},{"num":8,"verse":"One day Eli′sha went on to Shunem, where a wealthy woman lived, who urged him to eat some food. So whenever he passed that way, he would turn in there to eat food. "},{"num":9,"verse":"And she said to her husband, “Behold now, I perceive that this is a holy man of God, who is continually passing our way. "},{"num":10,"verse":"Let us make a small roof chamber with walls, and put there for him a bed, a table, a chair, and a lamp, so that whenever he comes to us, he can go in there.”"},{"num":11,"verse":"One day he came there, and he turned into the chamber and rested there. "},{"num":12,"verse":"And he said to Geha′zi his servant, “Call this Shu′nammite.” When he had called her, she stood before him. "},{"num":13,"verse":"And he said to him, “Say now to her, See, you have taken all this trouble for us; what is to be done for you? Would you have a word spoken on your behalf to the king or to the commander of the army?” She answered, “I dwell among my own people.” "},{"num":14,"verse":"And he said, “What then is to be done for her?” Geha′zi answered, “Well, she has no son, and her husband is old.” "},{"num":15,"verse":"He said, “Call her.” And when he had called her, she stood in the doorway. "},{"num":16,"verse":"And he said, “At this season, when the time comes round, you shall embrace a son.” And she said, “No, my lord, O man of God; do not lie to your maidservant.” "},{"num":17,"verse":"But the woman conceived, and she bore a son about that time the following spring, as Eli′sha had said to her."},{"num":18,"verse":"When the child had grown, he went out one day to his father among the reapers. "},{"num":19,"verse":"And he said to his father, “Oh, my head, my head!” The father said to his servant, “Carry him to his mother.” "},{"num":20,"verse":"And when he had lifted him, and brought him to his mother, the child sat on her lap till noon, and then he died. "},{"num":21,"verse":"And she went up and laid him on the bed of the man of God, and shut the door upon him, and went out. "},{"num":22,"verse":"Then she called to her husband, and said, “Send me one of the servants and one of the asses, that I may quickly go to the man of God, and come back again.” "},{"num":23,"verse":"And he said, “Why will you go to him today? It is neither new moon nor sabbath.” She said, “It will be well.” "},{"num":24,"verse":"Then she saddled the ass, and she said to her servant, “Urge the beast on; do not slacken the pace for me unless I tell you.” "},{"num":25,"verse":"So she set out, and came to the man of God at Mount Carmel."},{"num":26,"verse":"run at once to meet her, and say to her, Is it well with you? Is it well with your husband? Is it well with the child?” And she answered, “It is well.” "},{"num":27,"verse":"And when she came to the mountain to the man of God, she caught hold of his feet. And Geha′zi came to thrust her away. But the man of God said, “Let her alone, for she is in bitter distress; and the Lord has hidden it from me, and has not told me.” "},{"num":28,"verse":"Then she said, “Did I ask my lord for a son? Did I not say, Do not deceive me?” "},{"num":29,"verse":"He said to Geha′zi, “Gird up your loins, and take my staff in your hand, and go. If you meet any one, do not salute him; and if any one salutes you, do not reply; and lay my staff upon the face of the child.” "},{"num":30,"verse":"Then the mother of the child said, “As the Lord lives, and as you yourself live, I will not leave you.” So he arose and followed her. "},{"num":31,"verse":"Geha′zi went on ahead and laid the staff upon the face of the child, but there was no sound or sign of life. Therefore he returned to meet him, and told him, “The child has not awaked.”"},{"num":32,"verse":"When Eli′sha came into the house, he saw the child lying dead on his bed. "},{"num":33,"verse":"So he went in and shut the door upon the two of them, and prayed to the Lord. "},{"num":34,"verse":"Then he went up and lay upon the child, putting his mouth upon his mouth, his eyes upon his eyes, and his hands upon his hands; and as he stretched himself upon him, the flesh of the child became warm. "},{"num":35,"verse":"Then he got up again, and walked once to and fro in the house, and went up, and stretched himself upon him; the child sneezed seven times, and the child opened his eyes. "},{"num":36,"verse":"Then he summoned Geha′zi and said, “Call this Shu′nammite.” So he called her. And when she came to him, he said, “Take up your son.” "},{"num":37,"verse":"She came and fell at his feet, bowing to the ground; then she took up her son and went out."},{"header":"Elisha Purifies the Pot of Stew"},{"num":38,"verse":"And Eli′sha came again to Gilgal when there was a famine in the land. And as the sons of the prophets were sitting before him, he said to his servant, “Set on the great pot, and boil pottage for the sons of the prophets.” "},{"num":39,"verse":"One of them went out into the field to gather herbs, and found a wild vine and gathered from it his lap full of wild gourds, and came and cut them up into the pot of pottage, not knowing what they were. "},{"num":40,"verse":"And they poured out for the men to eat. But while they were eating of the pottage, they cried out, “O man of God, there is death in the pot!” And they could not eat it. "},{"num":41,"verse":"He said, “Then bring meal.” And he threw it into the pot, and said, “Pour out for the men, that they may eat.” And there was no harm in the pot."},{"header":"Elisha Feeds One Hundred Men"},{"num":42,"verse":"A man came from Ba′al-shal′ishah, bringing the man of God bread of the first fruits, twenty loaves of barley, and fresh ears of grain in his sack. And Eli′sha said, “Give to the men, that they may eat.” "},{"num":43,"verse":"But his servant said, “How am I to set this before a hundred men?”So he repeated, “Give them to the men, that they may eat, for thus says the Lord, ‘They shall eat and have some left.’” "},{"num":44,"verse":"So he set it before them. And they ate, and had some left, according to the word of the Lord."}]