[{"num":4,"verse":"One day the wife of one of the seminary students came to Elisha to tell him of her husband’s death. He was a man who had loved God, she said. But he had owed some money when he died, and now the creditor was demanding it back. If she didn’t pay, he said he would take her two sons as his slaves."},{"num":2,"verse":"“What shall I do?” Elisha asked. “How much food do you have in the house?”"},{"num":3,"verse":"“Then borrow many pots and pans from your friends and neighbors!” he instructed. "},{"num":4,"verse":"“Go into your house with your sons and shut the door behind you. Then pour olive oil from your jar into the pots and pans, setting them aside as they are filled!”"},{"num":5,"verse":"So she did. Her sons brought the pots and pans to her, and she filled one after another! "},{"num":6,"verse":"Soon every container was full to the brim!"},{"num":7,"verse":"When she told the prophet what had happened, he said to her, “Go and sell the oil and pay your debt, and there will be enough money left for you and your sons to live on!”"},{"num":8,"verse":"One day Elisha went to Shunem. A prominent woman of the city invited him in to eat, and afterwards, whenever he passed that way, he stopped for dinner."},{"num":9,"verse":"She said to her husband, “I’m sure this man who stops in from time to time is a holy prophet. "},{"num":10,"verse":"Let’s make a little room for him on the roof; we can put in a bed, a table, a chair, and a lamp, and he will have a place to stay whenever he comes by.”"},{"num":11,"verse":"Once when he was resting in the room he said to his servant Gehazi, “Tell the woman I want to speak to her.”"},{"num":13,"verse":"he said to Gehazi, “Tell her that we appreciate her kindness to us. Now ask her what we can do for her. Does she want me to put in a good word for her to the king or to the general of the army?”"},{"num":14,"verse":"“What can we do for her?” he asked Gehazi afterwards."},{"num":15,"verse":"“Call her back again,” Elisha told him."},{"num":17,"verse":"But it was true; the woman soon conceived and had a baby boy the following year, just as Elisha had predicted."},{"num":18,"verse":"One day when her child was older, he went out to visit his father, who was working with the reapers. "},{"num":19,"verse":"He complained about a headache and soon was moaning in pain. His father said to one of the servants, “Carry him home to his mother.”"},{"num":20,"verse":"So he took him home, and his mother held him on her lap; but around noontime he died. "},{"num":21,"verse":"She carried him up to the bed of the prophet and shut the door; "},{"num":22,"verse":"then she sent a message to her husband: “Send one of the servants and a donkey so that I can hurry to the prophet and come right back.”"},{"num":23,"verse":"“Why today?” he asked. “This isn’t a religious holiday.”"},{"num":24,"verse":"So she saddled the donkey and said to the servant, “Hurry! Don’t slow down for my comfort unless I tell you to.”"},{"num":25,"verse":"As she approached Mount Carmel, Elisha saw her in the distance and said to Gehazi, “Look, that woman from Shunem is coming. "},{"num":26,"verse":"Run and meet her and ask her what the trouble is. See if her husband is all right and if the child is well.”"},{"num":27,"verse":"But when she came to Elisha at the mountain she fell to the ground before him and caught hold of his feet. Gehazi began to push her away, but the prophet said, “Leave her alone; something is deeply troubling her and the Lord hasn’t told me what it is.”"},{"num":28,"verse":"Then she said, “It was you who said I’d have a son. And I begged you not to lie to me!”"},{"num":29,"verse":"Then he said to Gehazi, “Quick, take my staff! Don’t talk to anyone along the way. Hurry! Lay the staff upon the child’s face.”"},{"num":30,"verse":"But the boy’s mother said, “I swear to God that I won’t go home without you.” So Elisha returned with her."},{"num":31,"verse":"Gehazi went on ahead and laid the staff upon the child’s face, but nothing happened. There was no sign of life. He returned to meet Elisha and told him, “The child is still dead.”"},{"num":32,"verse":"When Elisha arrived, the child was indeed dead, lying there upon the prophet’s bed. "},{"num":33,"verse":"He went in and shut the door behind him and prayed to the Lord. "},{"num":34,"verse":"Then he lay upon the child’s body, placing his mouth upon the child’s mouth, and his eyes upon the child’s eyes, and his hands upon the child’s hands. And the child’s body began to grow warm again! "},{"num":35,"verse":"Then the prophet went down and walked back and forth in the house a few times; returning upstairs, he stretched himself again upon the child. This time the little boy sneezed seven times and opened his eyes!"},{"num":36,"verse":"Then the prophet summoned Gehazi. “Call her!” he said. And when she came in, he said, “Here’s your son!”"},{"num":37,"verse":"She fell to the floor at his feet and then picked up her son and went out."},{"num":38,"verse":"Elisha now returned to Gilgal, but there was a famine in the land. One day as he was teaching the young prophets, he said to Gehazi, “Make some stew for supper for these men.”"},{"num":39,"verse":"One of the young men went out into the field to gather vegetables and came back with some wild gourds. He shredded them and put them into a kettle without realizing that they were poisonous. "},{"num":40,"verse":"But after the men had eaten a bite or two they cried out, “Oh, sir, there’s poison in this stew!”"},{"num":41,"verse":"“Bring me some meal,” Elisha said. He threw it into the kettle and said, “Now it’s all right! Go ahead and eat!” And then it didn’t harm them."},{"num":42,"verse":"One day a man from Baal-shalishah brought Elisha a sack of fresh corn and twenty individual loaves of barley bread made from the first grain of his harvest. Elisha told Gehazi to use it to feed the young prophets."},{"num":43,"verse":"“What?” Gehazi exclaimed. “Feed one hundred men with only this?”"},{"num":44,"verse":"And sure enough, there was, just as the Lord had said!"}]