[[],[{"type":"header","content":"Territory of Simeon"},{"type":"prose","content":"Then the second lot fell to Simeon, to the tribe of the sons of Simeon according to their families (clans), and their inheritance was within the inheritance of the sons of Judah. "}],[{"type":"prose","content":"So they had as their inheritance Beersheba or Sheba and Moladah, "}],[{"type":"prose","content":"and Hazar-shual and Balah and Ezem, "}],[{"type":"prose","content":"and Eltolad and Bethul and Hormah, "}],[{"type":"prose","content":"and Ziklag and Beth-marcaboth and Hazar-susah, "}],[{"type":"prose","content":"and Beth-lebaoth and Sharuhen; thirteen cities with their villages; "}],[{"type":"prose","content":"Ain, Rimmon and Ether and Ashan; four cities with their villages; "}],[{"type":"prose","content":"and all the villages which were around these cities as far as Baalath-beer, Ramah of the Negev (South country). This was the inheritance of the tribe of the sons of Simeon according to their families. "}],[{"type":"prose","content":"The inheritance of the sons of Simeon  from the portion of the sons of Judah, for the share of the sons of Judah was too large for them; so the sons of Simeon received an inheritance within Judah’s inheritance."},{"type":"header","content":"Territory of Zebulun"}],[{"type":"prose","content":"The third lot came up for [the tribe of] the sons of Zebulun according to their families. The territory of their inheritance extended to Sarid. "}],[{"type":"prose","content":"Then its border went up westward and on to Maralah, and reached to Dabbesheth and reached to the brook east of Jokneam. "}],[{"type":"prose","content":"Then it turned from Sarid east toward the sunrise as far as the border of Chisloth-tabor, and it proceeded to Daberath and on up to Japhia. "}],[{"type":"prose","content":"From there it continued east toward the sunrise to Gath-hepher and to Eth-kazin, and proceeded to Rimmon which turns toward Neah. "}],[{"type":"prose","content":"The border circled it on the north to Hannathon, ending at the Valley of Iphtahel. "}],[{"type":"prose","content":"Included were Kattah and Nahalal and Shimron and Idalah and Bethlehem; twelve cities with their villages. "}],[{"type":"prose","content":"This was the inheritance of the sons of Zebulun according to their families, these cities with their villages."},{"type":"header","content":"Territory of Issachar"}],[{"type":"prose","content":"The fourth lot fell to [the tribe of] Issachar, to the sons of Issachar according to their families. "}],[{"type":"prose","content":"Their territory included: Jezreel and Chesulloth and Shunem, "}],[{"type":"prose","content":"and Hapharaim and Shion and Anaharath, "}],[{"type":"prose","content":"and Rabbith and Kishion and Ebez, "}],[{"type":"prose","content":"and Remeth and En-gannim and En-haddah and Beth-pazzez. "}],[{"type":"prose","content":"The border reached to Tabor and Shahazumah and Beth-shemesh, and their border ended at the Jordan; sixteen cities with their villages. "}],[{"type":"prose","content":"This was the inheritance of the tribe of the sons of Issachar according to their families, the cities and their villages."},{"type":"header","content":"Territory of Asher"}],[{"type":"prose","content":"The fifth lot fell to the tribe of the sons of Asher according to their families. "}],[{"type":"prose","content":"Their territory was Helkath and Hali and Beten and Achshaph, "}],[{"type":"prose","content":"and Allammelech and Amad and Mishal; and on the west it reached to Carmel and to Shihor-libnath. "}],[{"type":"prose","content":"Then it turned eastward to Beth-dagon and reached Zebulun and the Valley of Iphtahel northward to Beth-emek and Neiel, and continued in the north to Cabul, "}],[{"type":"prose","content":"and Ebron and Rehob and Hammon and Kanah, as far as Great Sidon. "}],[{"type":"prose","content":"Then the border turned to Ramah, [reaching] to the fortified city of Tyre; and it turned to Hosah, and it ended at the [Mediterranean] sea at the region of Achzib. "}],[{"type":"prose","content":"Included were Ummah, and Aphek and Rehob; twenty-two cities with their villages. "}],[{"type":"prose","content":"This was the inheritance of the tribe of the sons of Asher according to their families, these cities with their villages."},{"type":"header","content":"Territory of Naphtali"}],[{"type":"prose","content":"The sixth lot fell to [the tribe of] the sons of Naphtali according to their families. "}],[{"type":"prose","content":"Their border ran from Heleph, from the oak in Zaanannim and Adami-nekeb and Jabneel, as far as Lakkum, and it ended at the Jordan. "}],[{"type":"prose","content":"Then the border turned westward to Aznoth-tabor and went from there to Hukkok; and it reached Zebulun on the south and reached Asher on the west, and to Judah toward the east at the Jordan. "}],[{"type":"prose","content":"The fortified cities were Ziddim, Zer, and Hammath, Rakkath and Chinnereth, "}],[{"type":"prose","content":"and Adamah and Ramah and Hazor, "}],[{"type":"prose","content":"and Kedesh and Edrei and En-hazor, "}],[{"type":"prose","content":"and Yiron and Migdal-el, Horem and Beth-anath and Beth-shemesh; nineteen cities with their villages. "}],[{"type":"prose","content":"This was the inheritance of the tribe of the sons of Naphtali according to their families, the cities and their villages."},{"type":"header","content":"Territory of Dan"}],[{"type":"prose","content":"The seventh lot fell to the tribe of the sons of Dan according to their families. "}],[{"type":"prose","content":"The territory of their inheritance included Zorah and Eshtaol and Ir-shemesh, "}],[{"type":"prose","content":"and Shaalabbin and Aijalon and Ithlah, "}],[{"type":"prose","content":"and Elon and Timnah and Ekron, "}],[{"type":"prose","content":"and Eltekeh and Gibbethon and Baalath, "}],[{"type":"prose","content":"and Jehud and Bene-berak and Gath-rimmon, "}],[{"type":"prose","content":"and Me-jarkon and Rakkon, with the territory opposite Joppa. "}],[{"type":"prose","content":"The territory of the sons of Dan went beyond these; so the sons of Dan went up to fight against Leshem (Laish) and captured it. Then they struck it with the edge of the sword and took possession of it and settled there [between the tribes of Naphtali and Manasseh]; they renamed Leshem, Dan, after the name of their father (ancestor) Dan. "}],[{"type":"prose","content":"This was the inheritance of the tribe of the sons of Dan according to their families (clans), these cities with their villages."}],[{"type":"prose","content":"When they had finished dividing the land for inheritance by its borders, the Israelites gave an inheritance among them to Joshua the son of Nun. "}],[{"type":"prose","content":"According to the command of the  they gave him the city for which he asked—Timnath-serah in the hill country of Ephraim. So he built the city and settled in it."}],[{"type":"prose","content":"These are the inheritances which Eleazar the priest, Joshua the son of Nun, and the heads of the households of the tribes of the sons of Israel distributed by lot in Shiloh before the  at the doorway of the Tent of Meeting. So they finished dividing the land."}]]