[{"header":"Simeon’s Land"},{"num":19,"verse":"The second lot was drawn for the families of the tribe of Simeon. Their inheritance was within Judah. "},{"num":2,"verse":"In their inheritance they received 13 cities and their villages: Beersheba (Sheba), Moladah, "},{"num":3,"verse":"Hazar Shual, Balah, Ezem, "},{"num":4,"verse":"Eltolad, Bethul, Hormah, "},{"num":5,"verse":"Ziklag, Beth Marcaboth, Hazar Susah, "},{"num":6,"verse":"Beth Lebaoth, and Sharuhen. "},{"num":7,"verse":"There were four other cities with their villages: Ain, Rimmon, Ether, and Ashan. "},{"num":8,"verse":"All the villages around these cities as far as Baalath Beer and Ramath Negev were also included. This is the inheritance of the tribe of Simeon for its families. "},{"num":9,"verse":"Simeon’s inheritance was a part of Judah’s because Judah had more land than it needed. So Simeon received its inheritance inside Judah’s borders."},{"header":"Zebulun’s Land"},{"num":10,"verse":"The third lot was drawn for the families descended from Zebulun. The border of their inheritance goes as far as Sarid. "},{"num":11,"verse":"Toward the west the border ascends to Maralah and touches Dabbesheth and the river near Jokneam. "},{"num":12,"verse":"But from Sarid it turns directly east toward the border of Chisloth Tabor, on to Daberath, and then ascends toward Japhia. "},{"num":13,"verse":"From there it goes directly east to Gath Hepher, Eth Kazin, and Rimmon, where it turns to Neah. "},{"num":14,"verse":"There the border turns north to Hannathon and ends at the valley of Iphtah El. "},{"num":15,"verse":"This also includes Kattath, Nahalal, Shimron, Idalah, and Bethlehem. There were 12 cities with their villages. "},{"num":16,"verse":"These cities with their villages are the inheritance given to the families descended from Zebulun."},{"header":"Issachar’s Land"},{"num":17,"verse":"The fourth lot was drawn for the families descended from Issachar. "},{"num":18,"verse":"Their territory included Jezreel, Chesulloth, Shunem, "},{"num":19,"verse":"Hapharaim, Shion, Anaharath, "},{"num":20,"verse":"Rabbith, Kishion, Ebez, "},{"num":21,"verse":"Remeth, En Gannim, En Haddah, and Beth Pazzez. "},{"num":22,"verse":"The border touches Tabor, Shahazimah, and Beth Shemesh and ends at the Jordan River. There were 16 cities with their villages. "},{"num":23,"verse":"These cities with their villages are the inheritance for the families of the tribe of Issachar."},{"header":"Asher’s Land"},{"num":24,"verse":"The fifth lot was drawn for the families of the tribe of Asher. "},{"num":25,"verse":"Their territory included Helkath, Hali, Beten, Achshaph, "},{"num":26,"verse":"Allammelech, Amad, and Mishal. The border touches Carmel and Shihor Libnath in the west. "},{"num":27,"verse":"Then it turns east to Beth Dagon and touches Zebulun and the valley of Iphtah El in the north and goes to Beth Emek and Neiel. From there it goes northward to Cabul, "},{"num":28,"verse":"Abdon, Rehob, Hammon, Kanah, and as far as Great Sidon. "},{"num":29,"verse":"Then it turns at Ramah and goes on to the fortified city of Tyre. The border then turns to Hosah and ends at the Mediterranean Sea. The territory includes Meheleb, Achzib, "},{"num":30,"verse":"Umma, Acco, Aphek, and Rehob. There were 22 cities with their villages. "},{"num":31,"verse":"These cities with their villages are the inheritance for the families of the tribe of Asher."},{"header":"Naphtali’s Land"},{"num":32,"verse":"The sixth lot was drawn for the families descended from the tribe of Naphtali. "},{"num":33,"verse":"Their border starts from Heleph at the oak tree at Zaanannim. It continues to Adami Nekeb, Jabneel, to Lakkum, and ends at the Jordan River. "},{"num":34,"verse":"The border turns west to Aznoth Tabor, and from there to Hukok. It touches Zebulun in the south, Asher in the west, and Judah in the east at the Jordan. "},{"num":35,"verse":"The fortified cities were Ziddim, Zer, Hammath, Rakkath, Chinnereth, "},{"num":36,"verse":"Adamah, Ramah, Hazor, "},{"num":37,"verse":"Kedesh, Edrei, En Hazor, "},{"num":38,"verse":"Yiron, Migdal El, Horem, Beth Anath, and Beth Shemeth. There were 19 cities with their villages. "},{"num":39,"verse":"These cities with their villages are the inheritance for the families of the tribe of Naphtali."},{"header":"Dan’s Land"},{"num":40,"verse":"The seventh lot was drawn for the families of the tribe of Dan. "},{"num":41,"verse":"The territory of their inheritance included Zorah, Eshtaol, Ir Shemesh, "},{"num":42,"verse":"Shaalabbin, Aijalon, Ithlah, "},{"num":43,"verse":"Elon, Timnah, Ekron, "},{"num":44,"verse":"Eltekeh, Gibbethon, Baalath, "},{"num":45,"verse":"Jehud, Bene Berak, Gath Rimmon, "},{"num":46,"verse":"Me Jarkon, and Rakkon, with the border passing in front of Joppa. "},{"num":47,"verse":"The border of Dan extended beyond them. Dan’s descendants went up and attacked Leshem, captured it, and killed everyone there. They took it, settled there, and renamed the city Dan after their ancestor Dan. "},{"num":48,"verse":"These cities with their villages are the inheritance for the families of the tribe of Dan."},{"header":"Special Land for Joshua"},{"num":49,"verse":"When they all had finally received the land they were to inherit, the people of Israel also gave land within their territory as an inheritance to Joshua, son of Nun. "},{"num":50,"verse":"They gave him the city he asked for, as the Lord had instructed them to do. It was Timnath Serah in the mountains of Ephraim. He rebuilt the city and lived there."},{"num":51,"verse":"This is the land that the tribes of Israel drew by lot. The priest Eleazar, Joshua son of Nun, and the leaders of the families divided the land by drawing lots. They did this in Shiloh in the presence of the Lord at the entrance of the tent of meeting. So they finished dividing the land."}]