[[],[],[{"type":"header","content":"Simeon"},{"type":"prose","content":"The second lot went to Simeon for its clans. Their inheritance was within the territory of Judah. In their inheritance they had:"}],[{"type":"prose","content":"This is the inheritance of the tribe of Simeon according to its clans. The inheritance of Simeon came out of the share of Judah, because Judah’s portion turned out to be more than they needed. That’s how the people of Simeon came to get their lot from within Judah’s portion."}],[{"type":"header","content":"Zebulun"},{"type":"prose","content":"The third lot went to Zebulun, clan by clan:The border of their inheritance went all the way to Sarid. It ran west to Maralah, met Dabbesheth, and then went to the brook opposite Jokneam. In the other direction from Sarid, the border ran east; it followed the sunrise to the border of Kisloth Tabor, on to Daberath and up to Japhia. It continued east to Gath Hepher and Eth Kazin, came out at Rimmon, and turned toward Neah. There the border went around on the north to Hannathon and ran out into the Valley of Iphtah El. It included Kattath, Nahalal, Shimron, Idalah, and Bethlehem—twelve cities with their villages."}],[{"type":"prose","content":"This is the inheritance of the people of Zebulun for their clans—these towns and their villages."}],[{"type":"header","content":"Issachar"},{"type":"prose","content":"The fourth lot went to Issachar, clan by clan. Their territory included:"}],[{"type":"prose","content":"The boundary touched Tabor, Shahazumah, and Beth Shemesh and ended at the Jordan—sixteen towns and their villages."}],[{"type":"prose","content":"These towns with their villages were the inheritance of the tribe of Issachar, clan by clan."}],[{"type":"header","content":"Asher"},{"type":"prose","content":"The fifth lot went to the tribe of Asher, clan by clan:"}],[{"type":"prose","content":"Their territory included Helkath, Hali, Beten, Acshaph, Allammelech, Amad, and Mishal. The western border touched Carmel and Shihor Libnath, then turned east toward Beth Dagon, touched Zebulun and the Valley of Iphtah El, and went north to Beth Emek and Neiel, skirting Cabul on the left. It went on to Abdon, Rehob, Hammon, and Kanah, all the way to Greater Sidon. The border circled back toward Ramah, extended to the fort city of Tyre, turned toward Hosah, and came out at the Sea in the region of Aczib, Ummah, Aphek, and Rehob—twenty-two towns and their villages."}],[{"type":"prose","content":"These towns and villages were the inheritance of the tribe of Asher, clan by clan."}],[{"type":"header","content":"Naphtali"},{"type":"prose","content":"The sixth lot came to Naphtali and its clans."}],[{"type":"prose","content":"Their border ran from Heleph, from the oak at Zaanannim, passing Adami Nekeb and Jabneel to Lakkum and ending at the Jordan."}],[{"type":"prose","content":"The border returned on the west at Aznoth Tabor and came out at Hukkok, meeting Zebulun on the south, Asher on the west, and the Jordan on the east.The fort cities were:"}],[{"type":"prose","content":"This is the inheritance of the tribe of Naphtali, the cities and their villages, clan by clan."}],[{"type":"header","content":"Dan"},{"type":"prose","content":"The seventh lot fell to Dan. The territory of their inheritance included:"}],[{"type":"prose","content":"But the people of Dan failed to get rid of the Westerners (Amorites), who pushed them back into the hills. The Westerners kept them out of the plain and they didn’t have enough room. So the people of Dan marched up and attacked Leshem. They took it, killed the inhabitants, and settled in. They renamed it Leshem Dan after the name of Dan their ancestor."}],[{"type":"prose","content":"This is the inheritance of the tribe of Dan, according to its clans, these towns with their villages.* * *"}],[{"type":"prose","content":"They completed the dividing of the land as inheritance and the setting of its boundaries. The People of Israel then gave an inheritance among them to Joshua son of Nun. In obedience to ’s word, they gave him the city which he had requested, Timnath Serah in the hill country of Ephraim. He rebuilt the city and settled there."}],[{"type":"prose","content":"These are the inheritances which Eleazar the priest and Joshua son of Nun and the ancestral leaders assigned by lot to the tribes of Israel at Shiloh in the presence of  at the entrance of the Tent of Meeting. They completed the dividing of the land."}]]