[{"header":"Simeon’s Tribal Lands"},{"num":19,"verse":"The second lot belonged to the tribe of Simeon by its clans. Their assigned land was in the middle of Judah’s assigned land. "},{"num":2,"verse":"Their assigned land included Beer Sheba, Moladah, "},{"num":3,"verse":"Hazar Shual, Balah, Ezem, "},{"num":4,"verse":"Eltolad, Bethul, Hormah, "},{"num":5,"verse":"Ziklag, Beth Marcaboth, Hazar Susah, "},{"num":6,"verse":"Beth Lebaoth, and Sharuhen—a total of thirteen cities and their towns, "},{"num":7,"verse":"Ain, Rimmon, Ether, and Ashan—a total of four cities and their towns, "},{"num":8,"verse":"as well as all the towns around these cities as far as Baalath Beer (Ramah of the Negev). This was the land assigned to the tribe of Simeon by its clans. "},{"num":9,"verse":"Simeon’s assigned land was taken from Judah’s allotted portion, for Judah’s territory was too large for them; so Simeon was assigned land within Judah."},{"header":"Zebulun’s Tribal Lands"},{"num":10,"verse":"The third lot belonged to the tribe of Zebulun by its clans. The border of their territory extended to Sarid. "},{"num":11,"verse":"Their border went up westward to Maralah and touched Dabbesheth and the valley near Jokneam. "},{"num":12,"verse":"From Sarid it turned eastward to the territory of Kisloth Tabor, extended to Daberath, and went up to Japhia. "},{"num":13,"verse":"From there it crossed eastward to Gath Hepher and Eth Kazin and extended to Rimmon, turning toward Neah. "},{"num":14,"verse":"It then turned on the north to Hannathon and ended at the Valley of Iphtah El. "},{"num":15,"verse":"Their territory included Kattah, Nahalal, Shimron, Idalah, and Bethlehem; in all they had twelve cities and their towns. "},{"num":16,"verse":"This was the land assigned to the tribe of Zebulun by its clans, including these cities and their towns."},{"header":"Issachar’s Tribal Lands"},{"num":17,"verse":"The fourth lot belonged to the tribe of Issachar by its clans. "},{"num":18,"verse":"Their assigned land included Jezreel, Kesulloth, Shunem, "},{"num":19,"verse":"Hapharaim, Shion, Anaharath, "},{"num":20,"verse":"Rabbith, Kishion, Ebez, "},{"num":21,"verse":"Remeth, En Gannim, En Haddah and Beth Pazzez. "},{"num":22,"verse":"Their border touched Tabor, Shahazumah, and Beth Shemesh, and ended at the Jordan. They had sixteen cities and their towns. "},{"num":23,"verse":"This was the land assigned to the tribe of Issachar by its clans, including these cities and their towns."},{"header":"Asher’s Tribal Lands"},{"num":24,"verse":"The fifth lot belonged to the tribe of Asher by its clans. "},{"num":25,"verse":"Their territory included Helkath, Hali, Beten, Acshaph, "},{"num":26,"verse":"Alammelech, Amad, and Mishal. Their border touched Carmel to the west and Shihor Libnath. "},{"num":27,"verse":"It turned eastward toward Beth Dagon, touched Zebulun and the Valley of Iphtah El to the north, as well as Beth Emek and Neiel, and extended to Cabul on the north "},{"num":28,"verse":"and on to Ebron, Rehob, Hammon, and Kanah, as far as Greater Sidon. "},{"num":29,"verse":"It then turned toward Ramah as far as the fortified city of Tyre, turned to Hosah, and ended at the sea near Hebel, Achzib, "},{"num":30,"verse":"Umah, Aphek, and Rehob. In all they had twenty-two cities and their towns. "},{"num":31,"verse":"This was the land assigned to the tribe of Asher by its clans, including these cities and their towns."},{"header":"Naphtali’s Tribal Lands"},{"num":32,"verse":"The sixth lot belonged to the tribe of Naphtali by its clans. "},{"num":33,"verse":"Their border started at Heleph and the oak of Zaanannim, went to Adami Nekeb, Jabneel and on to Lakkum, and ended at the Jordan River. "},{"num":34,"verse":"It turned westward to Aznoth Tabor, extended from there to Hukok, touched Zebulun on the south, Asher on the west, and the Jordan on the east. "},{"num":35,"verse":"The fortified cities included Ziddim, Zer, Hammath, Rakkath, Kinnereth, "},{"num":36,"verse":"Adamah, Ramah, Hazor, "},{"num":37,"verse":"Kedesh, Edrei, En Hazor, "},{"num":38,"verse":"Yiron, Migdal El, Horem, Beth Anath, and Beth Shemesh. In all they had nineteen cities and their towns. "},{"num":39,"verse":"This was the land assigned to the tribe of Naphtali by its clans, including these cities and their towns."},{"header":"Dan’s Tribal Lands"},{"num":40,"verse":"The seventh lot belonged to the tribe of Dan by its clans. "},{"num":41,"verse":"Their assigned land included Zorah, Eshtaol, Ir Shemesh, "},{"num":42,"verse":"Shaalabbin, Aijalon, Ithlah, "},{"num":43,"verse":"Elon, Timnah, Ekron, "},{"num":44,"verse":"Eltekeh, Gibbethon, Baalath, "},{"num":45,"verse":"Jehud, Bene Berak, Gath Rimmon, "},{"num":46,"verse":"the waters of Jarkon, and Rakkon, including the territory in front of Joppa. "},{"num":47,"verse":"(The Danites failed to conquer their territory, so they went up and fought with Leshem and captured it. They put the sword to it, took possession of it, and lived in it. They renamed it Dan after their ancestor.) "},{"num":48,"verse":"This was the land assigned to the tribe of Dan by its clans, including these cities and their towns."},{"header":"Joshua Receives Land"},{"num":49,"verse":"When they finished dividing the land into its regions, the Israelites gave Joshua son of Nun some land. "},{"num":50,"verse":"As the Lord had instructed, they gave him the city he requested—Timnath Serah in the Ephraimite hill country. He built up the city and lived in it."},{"num":51,"verse":"These are the land assignments that Eleazar the priest, Joshua son of Nun, and the Israelite tribal leaders made by drawing lots in Shiloh before the Lord at the entrance of the tent of meeting. So they finished dividing up the land."}]