[[],[{"type":"prose","content":"Also these are Proverbs of Solomon, that men of Hezekiah king of Judah transcribed: --"}],[{"type":"prose","content":"The honour of God [is] to hide a thing, And the honour of kings to search out a matter."}],[{"type":"prose","content":"The heavens for height, and the earth for depth, And the heart of kings -- [are] unsearchable."}],[{"type":"prose","content":"Take away dross from silver, And a vessel for the refiner goeth forth,"}],[{"type":"prose","content":"Take away the wicked before a king, And established in righteousness is his throne."}],[{"type":"prose","content":"Honour not thyself before a king, And in the place of the great stand not."}],[{"type":"prose","content":"For better [that] he hath said to thee, `Come thou up hither,' Than [that] he humble thee before a noble, Whom thine eyes have seen."}],[{"type":"prose","content":"Go not forth to strive, haste, turn, What dost thou in its latter end, When thy neighbour causeth thee to blush?"}],[{"type":"prose","content":"Thy cause plead with thy neighbour, And the secret counsel of another reveal not,"}],[{"type":"prose","content":"Lest the hearer put thee to shame, And thine evil report turn not back."}],[{"type":"prose","content":"Apples of gold in imagery of silver, [Is] the word spoken at its fit times."}],[{"type":"prose","content":"A ring of gold, and an ornament of pure gold, [Is] the wise reprover to an attentive ear."}],[{"type":"prose","content":"As a vessel of snow in a day of harvest, [So is] a faithful ambassador to those sending him, And the soul of his masters he refresheth."}],[{"type":"prose","content":"Clouds and wind, and rain there is none, [Is] a man boasting himself in a false gift."}],[{"type":"prose","content":"By long-suffering is a ruler persuaded, And a soft tongue breaketh a bone."}],[{"type":"prose","content":"Honey thou hast found -- eat thy sufficiency, Lest thou be satiated [with] it, and hast vomited it."}],[{"type":"prose","content":"Withdraw thy foot from thy neighbour's house, Lest he be satiated [with] thee, and have hated thee."}],[{"type":"prose","content":"A maul, and a sword, and a sharp arrow, [Is] the man testifying against his neighbour a false testimony."}],[{"type":"prose","content":"A bad tooth, and a tottering foot, [Is] the confidence of the treacherous in a day of adversity."}],[{"type":"prose","content":"Whoso is taking away a garment in a cold day, [Is as] vinegar on nitre, And a singer of songs on a sad heart."}],[{"type":"prose","content":"If he who is hating thee doth hunger, cause him to eat bread, And if he thirst, cause him to drink water."}],[{"type":"prose","content":"For coals thou art putting on his head, And Jehovah giveth recompense to thee."}],[{"type":"prose","content":"A north wind bringeth forth rain, And a secret tongue -- indignant faces."}],[{"type":"prose","content":"Better to sit on a corner of a roof, Than [with] a woman of contentions, and a house of company."}],[{"type":"prose","content":"[As] cold waters for a weary soul, So [is] a good report from a far country."}],[{"type":"prose","content":"A spring troubled, and a fountain corrupt, [Is] the righteous falling before the wicked."}],[{"type":"prose","content":"The eating of much honey is not good, Nor a searching out of one's own honour -- honour."}],[{"type":"prose","content":"A city broken down without walls, [Is] a man without restraint over his spirit!"}]]