[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(44) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And shall lay thee even with the ground.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—See Note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 24:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". What is there said of the Temple, is here repeated of the city as a whole, and describes a general demolition of everything that could be demolished. So Josephus (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Wars,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " viii. 1, § 1) describes the work as being done so effectively that, with the exception of one or two towers and part of the walls, the fortifications were so laid even with the ground that there was nothing left to make those that came thither believe that that part of the city had been inhabited.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The time of thy visitation.—The phrase is not found in any other Gospel. The idea of “visitation” presents two aspects, one of pardon (Luke 1:68; Luke 1:78; Luke 7:16), the other of chastisement (1Peter 2:12). In both, however, the act of “visiting” implied looking after, caring for, and so a purpose of mercy. Modern usage—especially, perhaps, the common legal phrase of a man’s dying by the “visitation of God,” of sickness being “His visitation”—has given undue prominence to the latter thought. Here it appears to include both. The Christ had visited it first with a message of peace. Then came the discipline of suffering, and Jerusalem knew not how to make a right use of either.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "The time of thy visitation.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The phrase is not found in any other Gospel. The idea of “visitation” presents two aspects, one of pardon (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 1:68",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 1:78",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 7:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), the other of chastisement (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Peter 2:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). In both, however, the act of “visiting” implied looking after, caring for, and so a purpose of mercy. Modern usage—especially, perhaps, the common legal phrase of a man’s dying by the “visitation of God,” of sickness being “His visitation”—has given undue prominence to the latter thought. Here it appears to include both. The Christ had visited it first with a message of peace. Then came the discipline of suffering, and Jerusalem knew not how to make a right use of either.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "19:41-48 Who can behold the holy Jesus, looking forward to the miseries that awaited his murderers, weeping over the city where his precious blood was about to be shed, without seeing that the likeness of God in the believer, consists much in good-will and compassion? Surely those cannot be right who take up any doctrines of truth, so as to be hardened towards their fellow-sinners. But let every one remember, that though Jesus wept over Jerusalem, he executed awful vengeance upon it. Though he delights not in the death of a sinner, yet he will surely bring to pass his awful threatenings on those who neglect his salvation. The Son of God did not weep vain and causeless tears, nor for a light matter, nor for himself. He knows the value of souls, the weight of guilt, and how low it will press and sink mankind. May he then come and cleanse our hearts by his Spirit, from all that defiles. May sinners, on every side, become attentive to the words of truth and salvation.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "He wept over it - Showing his compassion for the guilty city, and his strong sense of the evils that were about to come upon it. See the notes at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 23:37-39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". As he entered the city he passed over the Mount of Olives. From that mountain there was a full and magnificent view of the city. See the notes at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 21:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The view of the splendid capital - the knowledge of its crimes - the remembrance of the mercies of God toward it - the certainty that it might have been spared if it had received the prophets and himself - the knowledge that it was about to put \"him,\" their long-expected Messiah, to death, and \"for\" that to be given up to utter desolation - affected his heart, and the triumphant King and Lord of Zion wept! Amid all \"his\" prosperity, and all the acclamations of the multitude, the heart of the Redeemer of the world was turned from the tokens of rejoicing to the miseries about to come on a guilty people. Yet they \"might\" have been saved. If thou hadst known, says he, even thou, with all thy guilt, the things that make for thy peace; if thou hadst repented, had been righteous, and had received the Messiah; if thou hadst not stained thy hands with the blood of the prophets, and shouldst not with that of the Son of God, then these terrible calamities would not come upon thee. But it is too late. The national wickedness is too great; the cup is full: mercy is exhausted; and Jerusalem, with all her pride and splendor, the glory of her temple, and the pomp of her service, \"must perish!\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "For the days shall come ... - This took place under Titus, the Roman general, 70 a.d., about thirty years after this was spoken.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Cast a trench about thee - The word \"trench\" now means commonly a \"pit or ditch.\" When the Bible was translated, it meant also \"earth thrown up to defend a camp\" (Johnson's \"Dictionary\"). This is the meaning of the original here. It is not a pit or large \"ditch,\" but a pile of earth, stones, or wood thrown up to guard a camp, and to defend it from the approach of an enemy. This was done at the siege of Jerusalem. Josephus informs us that Titus, in order that he might compel the city to surrender by \"famine,\" built a wall around the whole circumference of the city. This wall was nearly 5 miles in length, and was furnished with thirteen castles or towers. This work was completed with incredible labor in ten days. The professed design of this wall was \"to keep\" the city \"in on every side.\" Never was a prophecy more strikingly accomplished.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Shall lay thee even with the ground ... - This was literally done. Titus caused a plow to pass over the place where the temple stood. See the notes at Matthew 24. All this was done, says Christ, because Jerusalem knew not the time of its visitation - that is, did not know, and \"would not\" know, that the Messiah had come. \"His coming\" was the time of their merciful visitation. That time had been predicted, and invaluable blessings promised as the result of his advent; but they would not know it. They rejected him, they put him to death, and it was just that they should be destroyed. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Shall lay thee even with the ground ... - This was literally done. Titus caused a plow to pass over the place where the temple stood. See the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". All this was done, says Christ, because Jerusalem knew not the time of its visitation - that is, did not know, and \"would not\" know, that the Messiah had come. \"His coming\" was the time of their merciful visitation. That time had been predicted, and invaluable blessings promised as the result of his advent; but they would not know it. They rejected him, they put him to death, and it was just that they should be destroyed. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "43. a trench—a rampart; first of wood, and when this was burnt, a built wall, four miles in circuit, built in three days—so determined were they. This \"cut off all hope of escape,\" and consigned the city to unparalleled horrors. (See Josephus, Wars of the Jews, 6.2; 12.3,4.) All here predicted was with dreadful literally fulfilled.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole on \"Luke 19:43\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole on \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 19:43",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And shall lay thee even with the ground,.... Beat down all the houses in it, the stately edifices, and even the temple itself; See Gill on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 24:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and thy children within thee; that is, the inhabitants of the place should be slain with the sword of the enemy, and so fall to the ground, and lie upon it; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and they shall not leave in thee one stone upon anther; such a consummate, and entire desolation shall be made, as was foretold by Daniel, Daniel 9:27",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and they shall not leave in thee one stone upon anther; such a consummate, and entire desolation shall be made, as was foretold by Daniel, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 9:27",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "because thou knowest not the time of thy visitation; in which the dayspring from on high had visited them with his personal presence, preaching among them, and working miracles; and yet they knew him not, but despised and rejected him; yea, after that they had put him to death, and he was risen again, he ordered his disciples to begin their ministry, and preach the Gospel, at Jerusalem; and they continued for some time only preaching to them, or at least rarely elsewhere, till they put away the Gospel from them. The time of the ministry of John the Baptist, of Christ, and his apostles in Judea, was the time of Jerusalem's visitation in a way of mercy; which not being taken notice of, and observed, brought another kind of visitation upon them, even in a way of wrath and vengeance. The Jews pretend to assign other causes of Jerusalem's destruction; but the true cause was their rejection of Jesus, as the Messiah. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Says Abai, Jerusalem was not destroyed, but because they profaned the sabbath, as it is said, Ezekiel 22:26 \"and have hid their eyes from my sabbaths\", &c. Says R. Abhu, Jerusalem was not destroyed, but because they ceased reading the \"Shema (hear, O Israel\", &c.) morning and evening, as it is said, Isaiah 5:11 woe to them that rise up early\", &c. Says Rab. Hamenuna, Jerusalem was not destroyed, but because there ceased in it the children of the school of Rabban, (children were not put to school,) as it is said Jeremiah 6:11 \"I will pour it out upon the children\", &c. Says Ula, Jerusalem was not destroyed, but because there was no shame among them, as it is said, Jeremiah 6:15 \"were they ashamed\", &c. Says R. Isaac, Jerusalem was not destroyed, but because small and great were put upon a level, as it is said, Isaiah 24:2 \"as with the people, so with the priest\", &c. Says R. Amram, the son of R. Simeon bar Aba, R. Chanina said, Jerusalem was not destroyed, but because they did not reprove one another, as it is said, Lamentations 1:6 \"her princes are become like harts\", &c. Says R. Judah, Jerusalem was not destroyed, but because they despised the disciples of the wise men, as it is said; 2 Chronicles 36:16 but they mocked the messengers of God\", &c. (u).'' ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"Says Abai, Jerusalem was not destroyed, but because they profaned the sabbath, as it is said, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 22:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " \"and have hid their eyes from my sabbaths\", &c. Says R. Abhu, Jerusalem was not destroyed, but because they ceased reading the \"Shema (hear, O Israel\", &c.) morning and evening, as it is said, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 5:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " woe to them that rise up early\", &c. Says Rab. Hamenuna, Jerusalem was not destroyed, but because there ceased in it the children of the school of Rabban, (children were not put to school,) as it is said ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 6:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " \"I will pour it out upon the children\", &c. Says Ula, Jerusalem was not destroyed, but because there was no shame among them, as it is said, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 6:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " \"were they ashamed\", &c. Says R. Isaac, Jerusalem was not destroyed, but because small and great were put upon a level, as it is said, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 24:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " \"as with the people, so with the priest\", &c. Says R. Amram, the son of R. Simeon bar Aba, R. Chanina said, Jerusalem was not destroyed, but because they did not reprove one another, as it is said, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Lamentations 1:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " \"her princes are become like harts\", &c. Says R. Judah, Jerusalem was not destroyed, but because they despised the disciples of the wise men, as it is said; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 36:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " but they mocked the messengers of God\", &c. (u).'' ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Thus they shifted off the true cause of their ruin, and ascribed it to other things. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(u) T. Bab. Sabbat, fol. 119. 2.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(u) T. Bab. Sabbat, fol. 119. 2.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And shall lay thee even with the ground, and thy children within thee; and they shall not leave in thee one stone upon another; because thou knewest not {m} the time of thy visitation.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And shall lay thee even with the ground, and thy children within thee; and they shall not leave in thee one stone upon another; because thou knewest not ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{m}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the time of thy visitation.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(m) That is, this very instant in which God visited you.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 19:44",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐδαφιοῦσι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": this verb (here only in N.T., Sept[155] several times) has both ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "σε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τὰ τέκνα σ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". for its objects and must have a meaning assigned to it suitable to each: (1) to raze to the ground—in reference to the city, (2) to dash to the ground—in reference to the children or population of the city. Here only in N.T., frequent in Sept[156]—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τὸν καιρὸν τ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐπισκοπῆς σ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., the season of thy gracious visitation.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐπισκοπή",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and its corresponding verb have this meaning in N.T. In Sept[157] it is a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "vox media",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and is used with reference to visitations both in mercy and in judgment.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[155] Septuagint.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[156] Septuagint.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[157] Septuagint.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "44",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall lay thee even with the ground",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Titus, if we may trust Josephus, accomplished this prophecy wholly against his will, being driven to the utter subversion and destruction of the city, by the desperate obstinacy of the Jews. Sulpicius Severus (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Hist.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ii.), who is supposed to be here incorporating a fragment of Tacitus, says, “alii et ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Titus ipse",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " evertendum templum in primis censebant quo plenius Judaeo- rum ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "et Christianorum",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " religio tolleretur.” Josephus says that it was so frightfully desolated by the siege, that any Jew coming suddenly upon it would have asked what place it was (Jos. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "B. J.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " vi. 1, §1). It was again laid waste in the rebellion under Barcochba.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and thy children within thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The siege began at the Passover, and hence it is said that nearly 3,000,000 Jews,were crowded into the city.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall not leave in thee one stone upon another",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The subsequent attempt of the Jews to rebuild the Temple was frustrated by the outburst of subterranean fires. See Gibbon, ch. xxiii. 11. 309 (ed. Milman). Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 3:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of thy visitation",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 29:2-4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 10:14-15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". For the word ‘visitation’ see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Peter 2:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Sir 18:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The ‘visitation’ which they had neglected was one of mercy, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 1:68",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 19:44",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Τὰ τέκνα σου",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thy children",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") The then existing age is denoted by this expression, extending to forty years subsequent, as in ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 23:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 24:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐν σοὶ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") The people had been collected together at the time of the Passover, when the city was encompassed.—[",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "λίθον ἐπὶ λίθῳ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a stone upon a stone",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [“one stone upon another”]) even in the very temple of the city.—V. g.]—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀνθʼ ὧν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "because",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") The Jews, as Lightfoot observes, have assigned various causes, drawn from various sins, for their city being overthrown; the true cause is in this passage indicated.—[",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οὐκ ἔγνως",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thou hast not known",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 10:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (“Did not Israel know?”); nor hast thou even wished to know, ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 13:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (How often would I have gathered thy children, etc., and ye would not!).—V. g.]",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Luke 19:44",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Lay thee even with the ground (ἐδαφιοῦσιν)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Only here in New Testament. Primarily, to beat level, like a threshing-floor or pavement. The Septuagint uses it in the sense of dashing down to the ground (Psalm 137:9, and elsewhere). So Rev., from the succeeding reference to the children, and in allusion to the Psalms.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Only here in New Testament. Primarily, to beat level, like a threshing-floor or pavement. The Septuagint uses it in the sense of dashing down to the ground (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 137:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and elsewhere). So Rev., from the succeeding reference to the children, and in allusion to the Psalms.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Visitation",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "See on 1 Peter 2:12.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Peter 2:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      }
    ]
  }
]