[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(5) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "To day I must abide at thy house.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The words gain a fresh significance, if we remember that Jericho was at this time one of the chosen cities of the priests. (See Note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 10:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) Our Lord passed over their houses, and those of the Pharisees, in order to pass the night in the house of the publican. There, we may believe, He saw an opening for a spiritual work which He did not find elsewhere.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Luke",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "MELTED BY KINDNESSLuke 19:5",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "MELTED BY KINDNESS",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 19:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " It is characteristic of Luke that only he tells the story of Zacchaeus. He always dwells with special interest on incidents bringing out the character of Christ as the Friend of outcasts. His is eminently the Gospel of forgiveness. For example, we owe to Him the three supreme parables of the lost sheep, the lost coin, and the prodigal son, as well as those of the Pharisee and the publican praying in the Temple; and of the good Samaritan. It is he that tells us that all the publicans and sinners came near to Jesus to hear Him; and he loses no opportunity of enforcing the lesson with which this incident closes, ‘The Son of Man is come to seek and to save that which was lost.’ It is because of the light that it throws upon that great thought that he tells this fascinating story of Zacchaeus. I need not repeat it. We all remember it, and the quaintness and grotesqueness of part of it fix it in people’s memories. We know how the rich tax gatherer, pocketing his dignity, and unable to see over the heads of the crowd, scrambled up into the branches of the sycamore tree that overhung the road; and there was found by the eye of love, and surprised by the words of kindness, which melted him down, and made a new man of him on the spot. The story seems to me to be full of teaching, to which I desire to turn your attention at this time.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. First, note the outcast, drawn by imperfect motives to Jesus Christ. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. First, note the outcast, drawn by imperfect motives to Jesus Christ.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "It has been supposed that this man was a Gentile, but his Jewish name establishes his origin. And, if so, the fact that he was a publican and a Jew says a good deal about his character. There are some trades which condemn, to a certain extent, the men who engage in them. You would not expect to find a man of sensitive honour acting as a professional spy; or one of earnest religious character keeping a public-house. You would not expect to find a very good Jew condescending to be the tool of the Roman Government. Zacchaeus was at the head of the revenue office in Jericho, a position of considerable importance, inasmuch as there was a large volume of trade through that city from its situation near the fords of the Jordan, and from the fertility of the plain in which it stood. He had made some money, and probably made it by very questionable means. He was the object, not undeservedly, of the execration and suspicion of his countrymen. Italians did not love Italians who took service under Austria. Irishmen did not love Irishmen who in the bad old days used to collect church cess. And so Jews had no very kind feeling towards Jews who became Caesar’s servants. That a man should be in such a position indicated that he cared more for money than for patriotism, religion, or popular approval. His motto was the motto of that Roman Emperor who said, ‘Money has no smell,’ out of whatever cesspool it may have been fished up. But the consciousness of being encompassed by universal hatred would induce the object of it to put on an extra turn of the screw, and avenge upon individuals the general hostility. So we may take it for granted that Zacchaeus, the head of the Jericho custom-house, and rich to boot, was by no means a desirable character.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " What made him want to see Jesus Christ? He said to himself, curiosity; but probably he was doing himself injustice, and there was something else working below than merely the wish to see what sort of man was this Rabbi Joshua from Galilee that everybody was talking about. Had he heard that Jesus had a soft place in His heart for his class? Or was he, perhaps, beginning to get tired of being the butt of universal hatred, and finding that money scarcely compensated for that? Or was there some reaching out towards some undefined good, and a dissatisfaction with a very defined present, though unnamed, evil? Probably so. Like some of us, he put the trivial motive uppermost because he was half ashamed of the half-conscious better one.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " I wonder if there are any here now who said to themselves that they would come out of curiosity to hear the preacher, or from some such ordinary motive, and who all the while have, lying deep below that, another reason altogether, a dim feeling that it is not all right between them and God, and that here may be the place to have it put right? At all events, from whatsoever imperfect motives little Zacchaeus was perched up in the sycamore there, he went to see Christ, and he got more than he went for. Unconsciously we may be drawn, and imperfect motives may lead us to a perfect Saviour.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " He sets us an example in another way. Do not be too punctilious about dignity in pursuing aims that you know to be good. It would be a sight to bring jeers and grins on the faces of the crowd to see the rich man of the custom-house sitting up amongst the leaves. But he did not mind about that if he got a good look at the Rabbi when He passed. People care nothing for ridicule if their hearts are set upon a thing. I wish there were more of us who did not mind being laughed at if only what we did helped us to see Jesus Christ. Do not be afraid of ridicule. It is not a test of truth; in nine cases out of ten it is the grimace of fools.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. Then, further, notice the self-invited Guest. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. Then, further, notice the self-invited Guest.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "When the little procession stopped under the sycamore tree, Zacchaeus would begin to feel uncomfortable. He may have had experience in past times of the way in which the great doctors of orthodoxy were in the habit of treating a publican, and may have begun to be afraid that this new one was going to be like all the rest, and elicit some kind of mob demonstration against him. The crowd would be waiting with intense curiosity to see what would pass between the Rabbi and the revenue collector. They would all be very much astonished. ‘Zacchaeus! make haste and come down. To-day I must abide at thy house.’ Perhaps it was the first time since he had been a child at his mother’s knee that he had heard his name pronounced in tones of kindness. There was not a ragged beggar in Jericho who would not have thought himself degraded by putting his foot across the threshold that Jesus now says He will cross.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " It is the only time in which we read that Jesus volunteered to go into any house. He never offers to go where He is not wanted, any more than He ever stays away where He is. And so the very fact of His saying ‘I will abide at thy house,’ is to me an indication that, deep down below Zacchaeus’ superficial and vulgar curiosity, there was something far more noble which our Lord fosters into life and consciousness by this offer.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Many large truths are suggested by it on which we may touch. We have in Christ’s words an illustration of His individualising knowledge. ‘Zacchaeus, come down.’ There is no sign that anybody had told Christ the name, or that He knew anything about Zacchaeus before by human knowledge. But the same eye that saw Nathanael under the fig-tree saw Zacchaeus in the sycamore; and, seeing in secret, knew without being told the names of both. Christ does not name men in vain. He generally, when He uses an individual’s name in addressing him, means either to assert His knowledge of his character, or His authority over him, or in some way or other to bespeak personal adhesion and to promise personal affection. So He named some of His disciples, weaving a bond that united each single soul to Himself by the act. This individualising knowledge and drawing love and authority are all expressed, as I think, in that one word ‘Zacchaeus.’ And these are as true about us as about him. The promises of the New Testament, the words of Jesus Christ, the great, broad, universal ‘whosoevers’ of His assurance and of His commandments are as directly meant for each of us as if they were in an envelope with our names upon them and put into our hands. We, too, are spoken to by Him by our names, and for us, too, there may be a personal bond of answering love that knits us individually to the Master, as there certainly is a bond of personal regard, compassion, affection, and purpose of salvation in His heart in regard of each single soul of all the masses of humanity. I should have done something if I should have been able to gather into a point, that blessedly pierced some heart to let the life in, the broad truths of the Gospel. ‘Whosoever will, let him come.’ Say to yourself, ‘That is me.’ ‘Whosoever cometh I will in no wise cast out.’ Say to yourself, ‘That is me.’ And in like manner with all the general declarations, and especially with that chiefest of them all, ‘God so loved the world that He gave His only begotten Son, that whosoever believeth in Him should not perish.’ Read it as you may-and you will never read it right until you do-’God so loved ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "’-John, Mary, or whatever be your name-’Jesus so loved ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that if ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " believe upon Him ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " shall not perish, but have everlasting life.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Then, note, further, how here we get the revelation, in a concrete form, of Christ’s perfect willingness and desire to make common cause, and dwell with the most degraded and outcast. I have said that this is the only instance in which He volunteered to be a guest. Pharisees asked Him, and He did not refuse. The publican’s dwelling, which was tabooed, He opened the door of by His own hand. And that is what He always does.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " This little incident may be taken to be, not merely a symbol of His whole dealings, but an illustration, in small, of the same principle which has its largest embodiment and illustration in the fact of His Incarnation and Manhood. Why did Jesus Christ take flesh and dwell among us? Because He desired to seek and to save that which is lost. Why did He go into the publican’s house, and brave the sneers of the crowd, and associate Himself with the polluted? For the same reason. Microscopic crystals and gigantic ones are due to the same forces working in the same fashion. This incident is more than a symbol; it is a little instance of the operation of the law which finds its supreme and transcendent instance in the fact that the Eternal Son of God bowed the heavens and came down ‘and dwelt among us, and we beheld His glory.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " His example is our pattern. A Christian church which does not imitate its Master in its frank and continual willingness to associate itself with the degraded and the outcast has lost one of the truest signs of its being vitalised with the life of Christ. There is much in this day in the condition of Christian communities to make men dissatisfied and fearful. But there is one thing which, though in all its developments one cannot sympathise with it, is in its essence wholly good, and that is the new and quickened consciousness that a church which does not address itself to the outcasts has no business to live; and that Christian people who are too proud of their righteousness to go amongst the unclean and the degraded are a great deal more of Pharisees than Christians, and have need to learn which be the first principles of the religion which they profess. Self-righteousness gathers up its skirts in holy horror; perfect righteousness goes cheerily and without fear amongst the outcasts, for where should the physician go but to the sick, and where should Christ be found but in the house of the publican?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Further, the saying of our Lord suggests His recognition of the great law that ruled His life. Chronology here is of much importance. We do not generally remember that the scene with Zacchaeus was within about a week of the Crucifixion. Our Lord was on that last journey to Jerusalem to die, during the whole of which there was over His demeanour a tension of holy impatience, altogether unlike His usual manner, which astonished and amazed the disciples as they followed Him. He set His face like a flint to go to Jerusalem; and strode before them on the way as if He were eager to reach the culmination of His sufferings and of His work. Thus borne on the wings of the strong desire to be perfected on the Cross, He is arrested on His path. Nothing else was able to stop Him, but ‘To-day I ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "must",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " abide in thy house.’ There was a soul to be saved; and the world’s sacrifice had to wait till the single soul was secured. Christ hurrying, if I may use the word, at all events steadfastly and without wavering, pressing towards the Cross, let His course be stopped by this need. The highest ‘must’ was obedience to the Father’s will, and parallel with that need there was the other, of rescuing the Father’s prodigal sons. So this elder Brother owned the obligation, and paused on the road to Calvary, to lodge in the house of Zacchaeus. Let us learn the sweet lesson, and take the large consolations that lie in such a thought.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Again, the utterance of this self-invited Guest suggests His over-abundant fulfilment of timid, half-conscious desires. I said at the beginning of my remarks that only curiosity was on the surface; but that the very fact that our Lord addressed Himself to the man seemed to imply that He descried in him something more than mere vulgar curiosity. And the glad leap with which Zacchaeus came down from his tree might have revealed to Zacchaeus himself, as no doubt it did to some of the bystanders, what it was that he had been dimly wishing. So with us all there are needs, longings, half-emerging wishes, that have scarcely come into the field of consciousness, but yet have power enough to modify our actions. Jesus Christ understands all about us, and reads us better than we do ourselves; and is ready to meet, and by meeting to bring into full relief, these vague feelings after an undefined good. Brethren, He is to us, if we will let Him be, all that we want; and He is to us all that we need, although we only half know that we need it, and never say to ourselves that we wish it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " There is a last thought deducible from these words of our Lord’s; and that is, His leaving a man to decide whether he will have Him or no. ‘Make haste and come down, for to-day I ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "must",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " abide at thy house. Yes! but if Zacchaeus had stuck in his tree, Christ’s ‘must’ would not have been fulfilled. He would have gone on to Jerusalem if the publican had not scrambled down in haste. He forces Himself on no man; He withholds Himself from no man. He respects that awful prerogative of being the architects of our own evil and our own good, by our own free and unconstrained choice.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Did you ever think that it was now or never with this publican; that Jesus Christ was never to go through the streets of Jericho any more; that it was Zacchaeus’ last chance; and that, if he had not made haste, he would have lost Christ for ever? And so it is yet. There may be some in this place at this moment to whom Jesus Christ is now making His last appeal. I know not; no man knows. A Rabbi said, when they asked him when a man should repent, ‘Repent on the last day of your lives.’ And they said, ‘But we do not know when that will be.’ And he said, ‘Then repent ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "now",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".’ So I say, because some of you may never hear Christ’s Gospel again, and because none of us know whether we shall or not; make sure work of it ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "now",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and do not let Jesus Christ go out of the city and up the road between the hills yonder; for if once the folds of the ravine shut Him from sight He will never be back in Jericho, or seen by Zacchaeus any more for ever.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. And so, lastly, notice the outcast melted by kindness. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. And so, lastly, notice the outcast melted by kindness.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "We do not know at what stage in our Lord’s intercourse with the publican he ‘stood and said, Half of my goods I give to the poor,’ and so on. But whensoever it was, it was the sign of the entire revolution that had been wrought upon him by the touch of that loving hand, and by the new fountain of sympathy and love that he had found in Jesus Christ.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Some people have supposed, indeed, that his words do not mark a vow for the future, but express his practice in the past. But it seems to me to be altogether incongruous that Zacchaeus should advertise his past good in order to make himself out to be not quite so bad as people thought him, and, therefore, not so unworthy of being Christ’s host. Christ’s love kindles sense of our sin, not complacent recounting of our goodness. So Zacchaeus said, ‘Lord! Thou hast loved me, and I wonder. I yield, and fling away my black past; and, so far as I can, make restitution for it.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The one transforming agency is the love of Christ received into the heart. I do not suppose that Zacchaeus knew as much about Jesus Christ even after the conversation as we do; nor did he see His love in that supreme death on the Cross as we do. But the love of the Lord made a deep dint in his heart, and revolutionised his whole nature. The thing that will alter the whole current and set of a man’s affections, that will upset his estimate of the relative value of material and spiritual, and that will turn him inside out and upside down, and make a new man of him, is the revelation of the supreme love that in Jesus Christ has come into the world, with an individualising regard to each of us, and has died on the Cross for the salvation of us all. Nothing else will do it. People had frowned on Zacchaeus, and it made him bitter. They had execrated and persecuted him; and his only response was setting his teeth more firmly and turning the screw a little tighter when he had the chance. You can drive a man into devilry by contempt. If you want to melt him into goodness, try love. The Ethiopian cannot change his skin, but Jesus Christ can change his heart, and that will change his skin by degrees. The one transforming power is faith in the love of Jesus Christ.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Further, the one test of a true reception of Him is the abandonment of past evil and restitution for it as far as possible. People say that our Gospel is unreal and sentimental, and a number of other ugly adjectives. Well! If it ever is so, it is the fault of the speakers, and not of the Gospel. For its demands from every man that accepts it are intensely practical, and nothing short of a complete turning of his back upon his old self, shown in the conclusive forsaking of former evil, however profitable or pleasant, and reparation for harm done to men, satisfies them.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " It is useless to talk about loving Jesus Christ and trusting Him, and having the sweet assurance of forgiveness, and a glorious hope of heaven, unless these have made you break off your bad habits of whatsoever sort they may be, and cast them behind your backs. Strong emotion, sweet deep feeling, assured confidence in the sense of forgiveness and the hope of heaven, are all very well. Let us see your faith by your works; and of these works the chief is-Behold the evil that I did, I do it no more: ‘Behold! Lord! the half of my goods I give to the poor.’ There was a young ruler, a chapter before this, who could not make up his mind to part with wealth in order to follow Christ. This man has so completely made up his mind to follow Christ that he does not need to be bidden to give up his worldly goods. The half given to the poor, and fourfold restoration to those whom he had wronged, would not leave much. How astonished Zacchaeus would have been if anybody had said to him that morning, ‘Zacchaeus! before this night falls you will be next door to a pauper, and you will be a happier man than you are now!’ So, dear friends, like him, all of us may, if we will, and if we need, make a sudden right-about-face that shall alter the complexion of our whole future. People tell us that sudden conversions are suspicious. So they may be in certain cases. But the moment when a man makes up his mind to change the direction in which his face is set will always be a moment, however long may be the hesitation, and the meditation, and the preparation that led up to it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Jesus Christ is standing before each of us as truly as He did before that publican, and is saying to us as truly as He said to him, ‘Let Me in.’ ‘Behold! I stand at the door and knock. If any man open . . . I will enter.’ If He comes in He will teach you what needs to be turned out if He is to stop; and will make the sacrifice blessed and not painful; and you will be a happier and a richer man with Christ and nothing than with all beside and no Christ.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Luke 19:5-8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 19:5-8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And when Jesus came to the place he looked up, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "into the tree, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and saw him ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Zaccheus came to look upon Christ, and resolved to take particular notice of him, but little thought of being noticed by Christ. That was an honour too great, and too far above his merit, for him to have any thought of. Observe, reader, how Christ prevented him with the blessings of his goodness, and outdid his expectations; and see how he encourages very weak beginnings, and helps them forward. He that desires to know Christ shall be known of him: he that only desires to see him, shall be admitted to converse with him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And said, Zaccheus, make haste and come down, for to-day, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — Jesus had never seen him before, yet he called him by his name, and by what he said intimated that he knew his house was farther on the road. What a strange mixture of passions must Zaccheus have now felt, hearing one speak as knowing both his name and his heart. Zaccheus might ask, as Nathaniel did, (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 1:48",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Whence knowest thou me? ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "But before he climbed the sycamore-tree, Christ saw him and knew him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And he made haste, &c., and received him joyfully ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Overjoyed to have such an honour put upon him and his family. And his receiving him into his house was an indication of his receiving him into his heart. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And when they saw it ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— When the multitude saw him enter the house of Zaccheus; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "they all murmured ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Were very much offended at the particular regard that Jesus showed him; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "saying, he was gone to be a guest, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "παρα αμαρτωλω ανδρι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "with a sinful man ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— And were not they themselves sinful men? and was it not Christ’s errand into the world to seek and save sinful men? But they seem to have thought that Zaccheus was a sinner above all men that dwelt in Jericho; such a sinner as was not fit to be conversed with. He, however, soon gave proof, that though he had been a sinner, he was now a penitent, and a true convert. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Zaccheus stood, and said to the Lord ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— He makes his declaration standing, not only that he might be seen and heard by those who murmured at Christ for coming to his house; but that he might show by his posture his deliberate purpose and ready mind; and express himself with solemnity, as making a vow to God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Behold, Lord, half of my goods I give to the poor — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "He does not say, I will give it by my will when I die; but I give it now. Though hitherto I have been uncharitable to the poor, now I will relieve them, and give so much the more for having neglected the duty so long. He does not expect to be justified by his works, as the Pharisee did, who boasted of what he had done, but by his good works he purposed, through the grace of God, to evidence the sincerity of his faith and repentance, and he here signifies that this was his purpose. He addresses himself to Christ, in making this declaration, and not to the people, who were not to be his judges: and he stands, as it were, at Christ’s bar. The good that we do, we must do as unto him: we must appeal to him, and approve ourselves to him in our integrity, in all our good purposes and resolutions. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "If I have taken any thing by false accusation ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Or by any kind of injurious charges, or oppressive claims, as the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "εσυκοφαντησα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", according to Heinsius, may very properly signify. He seems to have meant, by any unjust exaction of the taxes. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I restore him four-fold ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— “This was the utmost that the Jewish law required, even in cases of fraudulent concealment and conviction; (unless where an ox had been killed or sold, and so its labour lost to the owner, and the discovery rendered more difficult: ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 22:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ";) for the phrase of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "restoring seven-fold, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 6:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) seems only proverbial, to express making abundant satisfaction. But if a man, not legally convicted or accused, voluntarily discovered a fraud he had committed, besides his trespass-offering, he was to add to the principal only a fifth part, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 6:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Zaccheus therefore shows the sincerity of his repentance by such an offer. Some commentators have remarked, that oppressive publicans were by the Roman law required to restore four- fold; but this was only after judgment obtained, where they had been guilty of extorting by force; whereas, before conviction, it was enough to make restitution of what had been taken; and even after it, in common cases, all that the law required was restoring twice as much.” — Doddridge.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "19:1-10 Those who sincerely desire a sight of Christ, like Zaccheus, will break through opposition, and take pains to see him. Christ invited himself to Zaccheus' house. Wherever Christ comes he opens the heart, and inclines it to receive him. He that has a mind to know Christ, shall be known of him. Those whom Christ calls, must humble themselves, and come down. We may well receive him joyfully, who brings all good with him. Zaccheus gave proofs publicly that he was become a true convert. He does not look to be justified by his works, as the Pharisee; but by his good works he will, through the grace of God, show the sincerity of his faith and repentance. Zaccheus is declared to be a happy man, now he is turned from sin to God. Now that he is saved from his sins, from the guilt of them, from the power of them, all the benefits of salvation are his. Christ is come to his house, and where Christ comes he brings salvation with him. He came into this lost world to seek and to save it. His design was to save, when there was no salvation in any other. He seeks those that sought him not, and asked not for him.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Abide at thy house - Remain there, or put up with him. This was an honor which Zacchaeus did not expect. The utmost, it seems, which he aimed at was to see Jesus; but, instead of that, Jesus proposed to remain with him, and to give him the benefit of his personal instruction. It is but one among a thousand instances where the Saviour goes, in bestowing mercies, far beyond the desert, the desire, or the expectation of men; and it is not improper to learn from this example that solicitude to behold the Saviour will not pass unnoticed by him, but will meet with his warm approbation, and be connected with his blessing. Jesus was willing to encourage efforts to come to him, and his benevolence prompted him to gratify the desires of the man who was solicitous to see him. He does not disdain the mansions of the rich any more than he does the dwelling-places of the poor, provided there be a humble heart; and he did not suppose there was \"less\" need of his presence in order to save in the house of the rich man than among the poor. He set an example to all his ministers, and was not afraid or ashamed to proclaim his gospel amid wealth. He was not awed by external splendor or grandeur. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5, 6. looked up,—in the full knowledge of who was in the tree, and preparatory to addressing him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Zaccheus—whom he had never seen in the flesh, nor probably heard of. \"He calleth His own sheep by name and leadeth them out\" (Joh 10:3).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "make haste, and come down—to which he literally responded—\"he made haste and came down.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for to-day, &c.—Our Lord invites Himself, and in \"royal\" style, which waits not for invitations, but as the honor is done to the subject, not the sovereign, announces the purpose of royalty to partake of the subject's hospitalities. Manifestly our Lord speaks as knowing how the privilege would be appreciated.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "to-day … abide—(Compare Joh 1:39), probably over night.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " I see no ground for their opinion who think that before this time Zacchaeus’s heart was touched with any love or affection to Christ. The evangelist seemeth to represent Zacchaeus before this as a mere stranger to Christ, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he sought to see who he was.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " But Christ’s looks are healing looks, there went virtue along with them to convert Zacchaeus, though a publican, and to recover Peter, who had denied his Master; but they must be such looks as carried with them a design to do good to souls. Christ looked upon thousands to whom his looks conveyed no spiritual saving grace. He that could heal by the hem of his garment touched, could change a heart by his look. How good a thing it is to be near the place where Christ is, whatever principle brings men thither! Provided men come not as the Pharisees used to come, to execute their malice. Zacchaeus was brought to the bodily view of Christ out of mere curiosity, but being there he receiveth a saving look from him. How many have had their hearts changed by gospel sermons, who never went to hear the preachers with any such desire or design! Christ’s design may be executed in the conversion of sinners, though not ours. He is found of them that seek him not, and of those that inquire not after him. Preparatory dispositions in us are not necessary to the first grace. God can at the same time prepare and change the heart. Zacchaeus is the first man we read of to whose house Christ (not asked) invited himself, and in it did more for Zacchaeus than he expected. Oh the freeness and riches of Divine grace! Which seeketh not a worthy object, but makes the object worthy, and therefore loveth it. What a word was this, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Come down; for today I must abide at thy house!",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And when Jesus came to the place,.... Where the tree stood, in which Zacchaeus was. Christ knows where his people are, and where to find them, where they commonly dwell, or where at any time they are, he being God omniscient: besides, the bounds of their habitations are fixed by the determination and appointment of God, and were foreknown by Christ, who, before the world began, was \"rejoicing in the habitable part of his earth\", where he knew his saints would dwell, who are \"the sons of men\", with whom his delights were; and he knows where they are, when the time is come to call them: he knew Zacchaeus was in the sycamore tree, as he saw Nathanael under the fig tree, before Philip called him, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 1:48",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and Christ comes to the very place where his people are, either in person, as here; and so he came to Galilee, and to the sea there, and walked by it, and on the very spot, where he knew he should meet with Peter, and Andrew, and James, and John, whom he called to follow him, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 4:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". He came to his own city Capernaum, and to the place of receipt of custom near unto it, where Matthew was, and called him, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 9:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and he came to Samaria, and to Jacob's well, where he knew the woman of Samaria would be at such a time, in order to call her: or, though he comes not in person to others, where they are, yet by his word, and by his Spirit; and he comes to them before they come to him; and is found of them, and finds them, who sought him not; and is made manifest to them, who asked not for him; and in this he acts the part of the good shepherd, that leaves the ninety nine in the wilderness, and goes after that which is lost till he finds it; and agreeably to his character as a Saviour, and to the end of his coming into the world, which was to call sinners to repentance, and to seek, and save that which is lost, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 19:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "He looked up and saw him; he knew him, he being one of those the Father had given to him, and he had loved and undertook for, and was come into the world to seek, and to save, and now, at this time, was come hither to call by his grace. He had seen him before in the glass of his Father's purposes and decrees, he being chosen in him to grace and glory, and being a vessel of mercy, afore prepared for glory: he had seen him when he was brought into the bond of the covenant; and passed under the rod of him, that telleth all the covenant ones, as they were put into it, and given to him the Mediator of it: he had seen him among them that were lost in Adam, whom he came to recover out of the ruins of their fall in him; and now he saw him in his state of nature and unregeneracy; he saw him in his blood, and said unto him, live: this look was a look of love, grace, and mercy; he looked upon him, and loved him, and was gracious to him, and had compassion on him; and it was a distinguishing look, he looked on him, and not on others. There was a great crowd both before and behind him, and all about him; but he looked not on these, but he looked up to Zacchaeus. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And he said unto him, Zacchaeus; he knew him, and could call him by his name, as he did Saul, when he called him, and revealed himself to him. His name was written in the Lamb's book of life, and so must be known to Christ, who was present at the making of that book, and was concerned in setting down the names in it, and has it in his keeping: he was one of the sheep the Father had given him, he came to lay down his life for, and of whom he had such perfect knowledge, as to call them by name, as he does all the chosen and redeemed ones; see Isaiah 43:1. It must be very surprising to Zacchaeus to hear Christ call him by his name, who was an utter stranger to him, and whom he had never seen before; and it is a very considerable instance of the omniscience of Christ, as well as of the great condescension and affectionate regard he has to his own, and the familiar way in which he uses them. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And he said unto him, Zacchaeus; he knew him, and could call him by his name, as he did Saul, when he called him, and revealed himself to him. His name was written in the Lamb's book of life, and so must be known to Christ, who was present at the making of that book, and was concerned in setting down the names in it, and has it in his keeping: he was one of the sheep the Father had given him, he came to lay down his life for, and of whom he had such perfect knowledge, as to call them by name, as he does all the chosen and redeemed ones; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 43:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". It must be very surprising to Zacchaeus to hear Christ call him by his name, who was an utter stranger to him, and whom he had never seen before; and it is a very considerable instance of the omniscience of Christ, as well as of the great condescension and affectionate regard he has to his own, and the familiar way in which he uses them. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Make haste, and come down; from the tree. The dangerous estate and condition of a sinner requires haste; it is like that of Lot in Sodom, when it was just going to be destroyed; and like that of the manslayer, when pursued by the avenger of blood; both whom it became to escape for their lives, and flee for refuge as fast as they could: and so it became Zacchaeus to come down with all speed to Christ, who was come hither to call and save him; and the enjoyment of Christ, and his grace, calls for haste; see John 11:28. Such who come to Christ must quit all their exalted thoughts of themselves, of their riches, fulness, and self-sufficiency, and come to him as poor and needy, for such only he fills with his good things; and of their health and soundness, and come to him the great physician, as sick and diseased; and of their purity and goodness, holiness and righteousness, and come to him as sinners: but it must be mighty grace to cast down imaginations, and high things, that exalt themselves against Christ, and the knowledge of him, and to humble a proud sinner, and bring him to the feet of Jesus. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Make haste, and come down; from the tree. The dangerous estate and condition of a sinner requires haste; it is like that of Lot in Sodom, when it was just going to be destroyed; and like that of the manslayer, when pursued by the avenger of blood; both whom it became to escape for their lives, and flee for refuge as fast as they could: and so it became Zacchaeus to come down with all speed to Christ, who was come hither to call and save him; and the enjoyment of Christ, and his grace, calls for haste; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 11:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Such who come to Christ must quit all their exalted thoughts of themselves, of their riches, fulness, and self-sufficiency, and come to him as poor and needy, for such only he fills with his good things; and of their health and soundness, and come to him the great physician, as sick and diseased; and of their purity and goodness, holiness and righteousness, and come to him as sinners: but it must be mighty grace to cast down imaginations, and high things, that exalt themselves against Christ, and the knowledge of him, and to humble a proud sinner, and bring him to the feet of Jesus. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "For this day I must abide at thy house; for a little while; not so much for the sake of refreshment for himself, and his disciples, as for the good of Zacchaeus; to make known the great salvation to him, and to bestow his grace upon him, and converse with him in a spiritual way. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "For this day I must abide at thy house; for a little while; not so much for the sake of refreshment for himself, and his disciples, as for the good of Zacchaeus; to make known the great salvation to him, and to bestow his grace upon him, and converse with him in a spiritual way. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And when Jesus came to the place, he looked up, and saw him, and said unto him, Zacchaeus, make haste, and come down; for to day I must abide at thy house.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Meyer's NT Commentary",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 19:5-7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Whether Jesus had any personal knowledge of Zacchaeus, is a matter which could be decided only by circumstances unknown to us; and hence to bring in the higher knowledge of Jesus (Olshausen), as seeing him nevertheless directly in his ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "inner nature",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is in the case before us a course without sufficient justification, although Strauss, I. p. 575 f., builds thereon the view that the history is a variation of the theme of the intercourse with the publicans. According to Paulus, some one ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "named",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the man to him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "σήμερον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] emphatically, comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 19:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "This day",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is the day so important to thee, when I must abide in thy house (stay the night, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 1:39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "δεῖ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is spoken from the consciousness of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "divine appointment",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 19:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), “as if He could not dispense with Zacchaeus, whom, nevertheless, everybody else avoided as a great sinner” (Luther, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Predigt",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 19:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The murmurers (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "διεγογγ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., see on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 15:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") are Jews, who accompanied Jesus to the house of Zacchaeus, situated (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 19:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") before the city on the way towards Jerusalem, and here at the entrance, probably in the forecourt where the publican came to meet Jesus, saw how joyously he receives Him. Comp. on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 19:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "παρὰ ἁμ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀνδρί",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] belongs to ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καταλῦσαι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 19:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ζακχαῖε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": Jesus knows his name, how not indicated.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "σπεύσας",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc., uttered in cordial tone as if He were speaking to a familiar friend whom He is glad to see and with whom He means to stay that day. What a delightful surprise that salutation, and how irresistible its friendly frankness, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 19:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " shows.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "5",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Zaccheus",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "make haste",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Zacchaeus was so prominent a person in Jericho that we can see no difficulty in his being known to Jesus by name.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 19:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ζακχαῖε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Zaccheus",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Zaccheus could not but both have wondered and rejoiced at his being thus addressed by name.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "σήμερον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to-day",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 19:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "οἴκῳ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", at thy ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "house",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") See again ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 19:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "δεῖ με",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I must",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") for the sake of thy salvation. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 19:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 5.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Zacchaeus, make haste, and come down; for to-day I must abide at thy house.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Jericho was one of the cities of the priests, and yet our Lord, setting public opinion at defiance, passed over their houses, and announced his intention of lodging for the night with one whose life's occupation was so hateful to the Jewish religious world. The Master recognized in the intense eagerness of Zacchaeus to get a sight of him, and possibly a word from him, that it was in the chief publican's house where lay his Father's business for him in Jericho. Luke 19:5",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "I must abide",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Adopting the royal style which was familiar to him, and which commends the loyalty of a vassal in the most delicate manner by freely exacting his services\" (\"Ecce Homo\"). ",
        "children": []
      }
    ]
  }
]