[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(6) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Received him joyfully.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The joy is significant as implying previous yearning, a desire for communion with the new Teacher, the wish to sit at His feet and drink in the words of eternal life.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "19:1-10 Those who sincerely desire a sight of Christ, like Zaccheus, will break through opposition, and take pains to see him. Christ invited himself to Zaccheus' house. Wherever Christ comes he opens the heart, and inclines it to receive him. He that has a mind to know Christ, shall be known of him. Those whom Christ calls, must humble themselves, and come down. We may well receive him joyfully, who brings all good with him. Zaccheus gave proofs publicly that he was become a true convert. He does not look to be justified by his works, as the Pharisee; but by his good works he will, through the grace of God, show the sincerity of his faith and repentance. Zaccheus is declared to be a happy man, now he is turned from sin to God. Now that he is saved from his sins, from the guilt of them, from the power of them, all the benefits of salvation are his. Christ is come to his house, and where Christ comes he brings salvation with him. He came into this lost world to seek and to save it. His design was to save, when there was no salvation in any other. He seeks those that sought him not, and asked not for him.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Abide at thy house - Remain there, or put up with him. This was an honor which Zacchaeus did not expect. The utmost, it seems, which he aimed at was to see Jesus; but, instead of that, Jesus proposed to remain with him, and to give him the benefit of his personal instruction. It is but one among a thousand instances where the Saviour goes, in bestowing mercies, far beyond the desert, the desire, or the expectation of men; and it is not improper to learn from this example that solicitude to behold the Saviour will not pass unnoticed by him, but will meet with his warm approbation, and be connected with his blessing. Jesus was willing to encourage efforts to come to him, and his benevolence prompted him to gratify the desires of the man who was solicitous to see him. He does not disdain the mansions of the rich any more than he does the dwelling-places of the poor, provided there be a humble heart; and he did not suppose there was \"less\" need of his presence in order to save in the house of the rich man than among the poor. He set an example to all his ministers, and was not afraid or ashamed to proclaim his gospel amid wealth. He was not awed by external splendor or grandeur. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6. joyfully—Whence this so sudden \"joy\" in the cold bosom of an avaricious publican? The internal revolution was as perfect as instantaneous. \"He spake and it was done.\" \"Then shall the lame man leap as an hart, and the tongue of the dumb sing\" (Isa 35:6).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Curiosity carried Zacchaeus up, but love to Christ bringeth him down; he therefore makes haste to come down, and he receiveth Christ joyfully, glad to entertain such a guest. When Christ cometh to any soul, he never brings any sorrow to it, nor any thing but glad tidings. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And he made haste,.... Such power went along with the words of Christ, that they immediately reached his heart, awakened his conscience, affected his mind, and drew his soul to Christ, and knit him to him, that be made all imaginable haste to be with him. So souls sensible of their dangerous state and condition by nature, and apprehensive of impending ruin and destruction, and having some intimation of safety and happiness in Christ, and being filled with love to him, and a liking of him flee with all haste to him for refuge, for righteousness, peace, pardon, life, and salvation: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and came down; from the tree he had climbed, merely to indulge his curiosity, little thinking that he should be called by name by him; that he should have him a guest at his house, and have such a knowledge of him, and familiar acquaintance with him: so souls, when called by Christ, and made sensible of their need of him, and the worth there is in him, quit their former post and place, part with their carnal lusts and sinful companions, and renounce their own righteousness and works, and come as sinners, humble and lowly, and venture upon Christ: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and received him joyfully; not only into his house, but into his arms and heart: Christ was a welcome guest to him, as he is to every sensible sinner, who by faith receives him, as the Father's free gift; as the alone Saviour and Redeemer; as the great Mediator, in all his offices, of prophet, priest, and king; and in every relation and character he bears; and embraces his doctrines, and submits to his ordinances, and that with, the greatest joy; as there is reason for it, since with him, he receives the free and full forgiveness of his sins, a justifying righteousness, an abundance of grace, and a right unto, and meetness for heaven. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and received him joyfully; not only into his house, but into his arms and heart: Christ was a welcome guest to him, as he is to every sensible sinner, who by faith receives him, as the Father's free gift; as the alone Saviour and Redeemer; as the great Mediator, in all his offices, of prophet, priest, and king; and in every relation and character he bears; and embraces his doctrines, and submits to his ordinances, and that with, the greatest joy; as there is reason for it, since with him, he receives the free and full forgiveness of his sins, a justifying righteousness, an abundance of grace, and a right unto, and meetness for heaven. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And he made haste, and came down, and received him joyfully.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "joyfully",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] This public honour done by the Messiah to one so despised by all classes of his countrymen, ennobled him with a new feeling of happiness and self-respect.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Luke 19:6",
        "children": []
      }
    ]
  }
]