[{"header":"Ahaz, King of Judah"},{"num":28,"verse":"Ahaz was 20 years old when he became king. He ruled 16 years in Jerusalem. He did not live right, as David his ancestor had done. Ahaz did not do what the Lord wanted him to do."},{"num":2,"verse":"He followed the bad example of the kings of Israel. He used molds to make idols to worship the Baal gods."},{"num":3,"verse":"He burned incense in the Valley of Ben Hinnom and sacrificed his own sons by burning them in the fire. He did the same terrible sins that the peoples living in that land did. The Lord had forced them out when the Israelites entered that land."},{"num":4,"verse":"Ahaz offered sacrifices and burned incense in the high places, on the hills, and under every green tree."},{"num":5,"verse":"Because Ahaz did these things, the Lord his God let the king of Aram defeat him. The king and his army defeated Ahaz and took many people of Judah as prisoners to the city of Damascus. Ahaz also suffered a terrible defeat by the king of Israel, Pekah son of Remaliah. Pekah and his army killed 120,000 of the bravest soldiers in Judah in one day. All this happened because the people of Judah had turned away from the Lord, the God their ancestors worshiped."},{"num":7,"verse":"Zicri was a brave soldier from Ephraim. He killed the king’s son Maaseiah. He also killed Azrikam, the officer in charge of the king’s palace, and Elkanah, who was second in command to the king."},{"num":8,"verse":"The Israelite army captured 200,000 of their own relatives living in Judah. They took women, children, and many valuable things from Judah and carried them back to Samaria."},{"num":9,"verse":"But one of the Lord’s prophets named Oded was there. Oded met the Israelite army that came back to Samaria. He said to the Israelite army, “The Lord, the God your ancestors worshiped, let you defeat the people of Judah because he was angry with them. But now he is angry with you, because he has seen how cruel you were in killing them."},{"num":10,"verse":"And now you plan to keep the people of Judah and Jerusalem as slaves. But you are as guilty as they are for sinning against the Lord your God."},{"num":11,"verse":"Now listen to me. Send back all those you captured, your own brothers and sisters, because the Lord’s terrible anger is against you.”"},{"num":12,"verse":"Then some of the leaders in Ephraim saw the Israelite soldiers coming home from war. They met the Israelite soldiers and warned them. The leaders were Azariah son of Jehohanan, Berekiah son of Meshillemoth, Jehizkiah son of Shallum, and Amasa son of Hadlai."},{"num":13,"verse":"They said to the Israelite soldiers, “Don’t bring the prisoners from Judah here. If you do that, it will add to our sin against the Lord. It will make our sin and guilt before him even worse than it is now, and he is already very angry with Israel!”"},{"num":14,"verse":"So the soldiers gave the prisoners and valuable things to the leaders and to the people."},{"num":15,"verse":"The leaders (Azariah, Berekiah, Jehizkiah, and Amasa) stood up and helped the prisoners. These four men got the clothes that the Israelite army took and gave them to the people who were naked. The leaders also gave them sandals. They gave the prisoners from Judah something to eat and drink. They rubbed oil on them to soften and heal their wounds. Then the leaders from Ephraim put the weak prisoners on donkeys and took them back home to their families in Jericho, the city of palm trees. Then the four leaders went back home to Samaria."},{"num":16,"verse":"At that same time the people from Edom came again and defeated the people of Judah. The Edomites captured people and took them away as prisoners. So King Ahaz asked the king of Assyria to help him."},{"num":18,"verse":"The Philistines also attacked the towns in the hills and in south Judah. The Philistines captured the towns of Beth Shemesh, Aijalon, Gederoth, Soco, Timnah, and Gimzo. They also captured the villages near these towns. Then the Philistines lived in them."},{"num":19,"verse":"The Lord gave troubles to Judah because King Ahaz of Judah encouraged the people of Judah to sin. He was very unfaithful to the Lord."},{"num":20,"verse":"King Tiglath Pileser of Assyria came and gave Ahaz trouble instead of helping him."},{"num":21,"verse":"Ahaz took some valuable things from the Lord’s Temple and from the king’s palace and from the prince’s house. Ahaz gave them to the king of Assyria, but that didn’t help him."},{"num":22,"verse":"In Ahaz’s troubles, he sinned worse and became more unfaithful to the Lord."},{"num":23,"verse":"He offered sacrifices to the gods the people of Damascus worshiped. The people of Damascus had defeated Ahaz. So he thought to himself, “The gods the people of Aram worship helped them. So if I offer sacrifices to them, maybe they will help me also.” Ahaz worshiped these gods. In this way he sinned, and he made the people of Israel sin."},{"num":24,"verse":"Ahaz gathered the things from God’s Temple and broke them to pieces. Then he closed the doors of the Lord’s Temple. He made altars and put them on every street corner in Jerusalem."},{"num":25,"verse":"In every town in Judah Ahaz made high places for burning incense to worship other gods. Ahaz made the Lord, the God his ancestors obeyed, very angry."},{"num":26,"verse":"Everything else Ahaz did, from the beginning to the end, is written in the book, The History of the Kings of Judah and Israel."},{"num":27,"verse":"Ahaz died and was buried with his ancestors. The people buried him in the city of Jerusalem. But they didn’t bury him in the same burial place where the kings of Israel were buried. Ahaz’s son Hezekiah became the new king in his place."}]