[{"header":"Instructions about slaves"},{"num":21,"verse":"These are the case laws that you should set before them:"},{"num":2,"verse":"When you buy a male Hebrew slave, he will serve you for six years. But in the seventh year, he will go free without any payment."},{"num":3,"verse":"If he came in single, he will leave single. If he came in married, then his wife will leave with him."},{"num":4,"verse":"If his master gave him a wife and she bore him sons or daughters, the wife and her children will belong to her master. He will leave single."},{"num":5,"verse":"However, if the slave clearly states, “I love my master, my wife, and my children, and I don’t want to go free,”"},{"num":6,"verse":"then his master will bring him before God. He will bring him to the door or the doorpost. There his master will pierce his ear with a pointed tool, and he will serve him as his slave for life."},{"num":7,"verse":"When a man sells his daughter as a slave, she shouldn’t be set free in the same way as male slaves are set free."},{"num":8,"verse":"If she doesn’t please her master who chose her for himself, then her master must let her be bought back by her family. He has no right to sell her to a foreign people since he has treated her unfairly."},{"num":9,"verse":"If he assigns her to his son, he must give her the rights of a daughter."},{"num":10,"verse":"If he takes another woman for himself, he may not reduce her food, clothing, or marital rights."},{"num":11,"verse":"If he doesn’t do these three things for her, she will go free without any payment, for no money."},{"header":"Instructions about human violence"},{"num":12,"verse":"Anyone who hits and kills someone should be put to death."},{"num":13,"verse":"If the killing wasn’t on purpose but an accident allowed by God, then I will designate a place to which the killer can run away."},{"num":14,"verse":"But if someone plots and kills another person on purpose, you should remove the killer from my altar and put him to death."},{"num":15,"verse":"Anyone who violently hits their father or mother should be put to death."},{"num":16,"verse":"Anyone who kidnaps a person, whether they have been sold or are still being held, should be put to death."},{"num":17,"verse":"Anyone who curses their father or mother should be put to death."},{"num":18,"verse":"When two people are fighting and one hits the other with a stone or with his fist so that he is in bed for a while but doesn’t die—"},{"num":19,"verse":"if he recovers and is able to walk around outside with a cane, then the one who hit him shouldn’t be punished, except to pay for the loss of time from work and to pay for his full recovery."},{"num":20,"verse":"When a slave owner hits a male or female slave with a rod and the slave dies immediately, the owner should be punished."},{"num":21,"verse":"But if the slave gets up after a day or two, the slave owner shouldn’t be punished because the slave is the owner’s property."},{"num":22,"verse":"When people who are fighting injure a pregnant woman so that she has a miscarriage but no other injury occurs, then the guilty party will be fined what the woman’s husband demands, as negotiated with the judges."},{"num":23,"verse":"If there is further injury, then you will give a life for a life,"},{"num":24,"verse":"an eye for an eye, a tooth for a tooth, a hand for a hand, a foot for a foot,"},{"num":25,"verse":"a burn for a burn, a bruise for a bruise, a wound for a wound."},{"num":26,"verse":"When a slave owner hits and blinds the eye of a male or female slave, he should let the slave go free on account of the eye."},{"num":27,"verse":"If he knocks out a tooth of a male or female slave, he should let the slave go free on account of the tooth."},{"header":"Instructions about animals and property"},{"num":28,"verse":"When an ox gores a man or a woman to death, the ox should be stoned to death, and the meat of the ox shouldn’t be eaten. But the owner of the ox shouldn’t be punished."},{"num":29,"verse":"However, if the ox had gored people in the past and its owner had been warned but didn’t watch out for it, and the ox ends up killing a man or a woman, then the ox should be stoned to death, and its owner should also be put to death."},{"num":30,"verse":"If the owner has to pay compensation instead, he must pay the agreed amount to save his life."},{"num":31,"verse":"If the ox gores a boy or a girl, this same case law applies to the owner."},{"num":32,"verse":"If the ox gores a male or female slave, the owner will pay thirty silver shekels to the slave’s owner, and the ox will be stoned to death."},{"num":33,"verse":"When someone leaves a pit open or digs a pit and doesn’t cover it and an ox or a donkey falls into the pit,"},{"num":34,"verse":"the owner of the pit must make good on the loss. He should pay money to the ox’s owner, but he may keep the dead animal."},{"num":35,"verse":"When someone’s ox hurts someone else’s ox and it dies, then they should sell the live ox and divide its price. They should also divide the dead animal between them."},{"num":36,"verse":"But if the ox was known for goring in the past and its owner hadn’t watched out for it, the owner must make good the loss, an ox for an ox, but may keep the dead animal."}]