[{"num":21,"verse":"“These are the rulings you are to present to them:"},{"num":2,"verse":"“If you purchase a Hebrew slave, he is to work six years; but in the seventh, he is to be given his freedom without having to pay anything. "},{"num":3,"verse":"If he came single, he is to leave single; if he was married when he came, his wife is to go with him when he leaves. "},{"num":4,"verse":"But if his master gave him a wife, and she bore him sons or daughters, then the wife and her children will belong to her master, and he will leave by himself. "},{"num":5,"verse":"Nevertheless, if the slave declares, ‘I love my master, my wife and my children, so I don’t want to go free,’ "},{"num":6,"verse":"then his master is to bring him before God; and there at the door or doorpost, his master is to pierce his ear with an awl; and the man will be his slave for life."},{"num":7,"verse":"“If a man sells his daughter as a slave, she is not to go free like the men-slaves. "},{"num":8,"verse":"If her master married her but decides she no longer pleases him, then he is to allow her to be redeemed. He is not allowed to sell her to a foreign people, because he has treated her unfairly. "},{"num":9,"verse":"If he has her marry his son, then he is to treat her like a daughter. "},{"num":10,"verse":"If he marries another wife, he is not to reduce her food, clothing or marital rights. "},{"num":11,"verse":"If he fails to provide her with these three things, she is to be given her freedom without having to pay anything."},{"num":12,"verse":"“Whoever attacks a person and causes his death must be put to death. "},{"num":13,"verse":"If it was not premeditated but an act of God, then I will designate for you a place to which he can flee. "},{"num":14,"verse":"But if someone willfully kills another after deliberate planning, you are to take him even from my altar and put him to death."},{"num":15,"verse":"“Whoever attacks his father or mother must be put to death."},{"num":16,"verse":"“Whoever kidnaps someone must be put to death, regardless of whether he has already sold him or the person is found still in his possession."},{"num":17,"verse":"“Whoever curses his father or mother must be put to death."},{"num":18,"verse":"“If two people fight, and one hits the other with a stone or with his fist, and the injured party doesn’t die but is confined to his bed; "},{"num":19,"verse":"then, if he recovers enough to be able to walk around outside, even if with a cane, the attacker will be free of liability, except to compensate him for his loss of time and take responsibility for his care until his recovery is complete."},{"num":20,"verse":"(ii) “If a person beats his male or female slave with a stick so severely that he dies, he is to be punished; "},{"num":21,"verse":"except that if the slave lives for a day or two, he is not to be punished, since the slave is his property."},{"num":22,"verse":"“If people are fighting with each other and happen to hurt a pregnant woman so badly that her unborn child dies, then, even if no other harm follows, he must be fined. He must pay the amount set by the woman’s husband and confirmed by judges. "},{"num":23,"verse":"But if any harm follows, then you are to give life for life, "},{"num":24,"verse":"eye for eye, tooth for tooth, hand for hand, foot for foot, "},{"num":25,"verse":"burn for burn, wound for wound and bruise for bruise."},{"num":26,"verse":"“If a person hits his male or female slave’s eye and destroys it, he must let him go free in compensation for his eye. "},{"num":27,"verse":"If he knocks out his male or female slave’s tooth, he must let him go free in compensation for his tooth."},{"num":28,"verse":"“If an ox gores a man or a woman to death, the ox is to be stoned and its flesh not eaten, but the owner of the ox will have no further liability. "},{"num":29,"verse":"However, if the ox was in the habit of goring in the past, and the owner was warned but did not confine it, so that it ended up killing a man or a woman; then the ox is to be stoned, and its owner too is to be put to death. "},{"num":30,"verse":"However, a ransom may be imposed on him; and the death penalty will be commuted if he pays the amount imposed. "},{"num":31,"verse":"If the ox gores a son or daughter, the same rule applies. "},{"num":32,"verse":"If the ox gores a male or female slave, its owner must give their master twelve ounces of silver; and the ox is to be stoned to death."},{"num":33,"verse":"“If someone removes the cover from a cistern or digs one and fails to cover it, and an ox or donkey falls in, "},{"num":34,"verse":"the owner of the cistern must make good the loss by compensating the animal’s owner; but the dead animal will be his."},{"num":35,"verse":"“If one person’s ox hurts another’s, so that it dies, they are to sell the live ox and divide the revenue from the sale; and they are also to divide the dead animal. "},{"num":36,"verse":"But if it is known that the ox was in the habit of goring in the past, and the owner did not confine it; he must pay ox for ox, but the dead animal will be his."},{"num":22,"verse":"“If someone steals an ox or a sheep and slaughters or sells it, he is to pay five oxen for an ox and four sheep for a sheep."}]