[{"header":"Other Laws and Commands"},{"num":21,"verse":"Then God said to Moses, “These are the other laws that you will give to the people:"},{"num":2,"verse":"“If you buy a Hebrew slave, then that slave will serve for only six years. After six years, he will be free, and he will have to pay nothing."},{"num":3,"verse":"If he is not married when he becomes your slave, when he becomes free, he will leave without a wife. But if the man is married when he becomes your slave, then he will keep his wife at the time he is made free."},{"num":4,"verse":"If the slave is not married, the master can give him a wife. If that wife gives birth to sons or daughters, she and her children will belong to the master. After the slave is finished with his years of service, he will be made free."},{"num":5,"verse":"“But if the slave decides that he wants to stay with the master, he must say, ‘I love my master. I love my wife and my children. I will not become free—I will stay.’"},{"num":6,"verse":"If this happens, the master will bring the slave before God. The master will take the slave to a door or the wooden frame around the door and pierce the slave’s ear using a sharp tool to show that the slave will serve that master for all his life."},{"num":7,"verse":"“A man might decide to sell his daughter as a slave. If this happens, the rules for making her free are not the same as the rules for making the men slaves free."},{"num":8,"verse":"If the master who chose her for himself is not pleased with her, then he can sell the woman back to her father. If the master broke his promise to marry her, he loses the right to sell her to other people."},{"num":9,"verse":"If the master promised to let the slave woman marry his son, he must treat her like a daughter, not like a slave."},{"num":10,"verse":"“If the master marries another woman, he must not give less food or clothing to the first wife. And he must continue to give her what she has a right to have in marriage."},{"num":11,"verse":"The man must do these three things for her. If he does not, the woman is made free, and it will cost her nothing. She owes no money to the man."},{"num":12,"verse":"“Whoever hits and kills someone must be killed too."},{"num":13,"verse":"But if an accident happens, and a person kills someone without planning it, then God allowed that thing to happen. I will choose some special places where people can run to for safety. So that person can run to one of those places."},{"num":14,"verse":"But whoever plans to kill someone out of anger or hatred must be punished. Take them away from my altar and kill them."},{"num":15,"verse":"“Whoever hits their father or their mother must be killed."},{"num":16,"verse":"“Whoever steals someone to sell them as a slave or to keep them for their own slave must be killed."},{"num":17,"verse":"“Whoever curses their father or mother must be killed."},{"num":18,"verse":"“Two men might argue and one might hit the other with a rock or with his fist. If the man who was hurt is not killed, the man who hurt him should not be killed."},{"num":19,"verse":"If the man was hurt and must stay in bed for some time, the man who hurt him must support him. The man who hurt him must pay for the loss of his time. He must support him until he is completely healed."},{"num":20,"verse":"“Sometimes people beat their slaves. If the slave dies after being beaten, the killer must be punished."},{"num":21,"verse":"But if the slave gets up after a few days, then the master will not be punished. That is because someone paid their money for the slave, and the slave belongs to them."},{"num":22,"verse":"“Two men might be fighting and hurt a pregnant woman. This might make the woman give birth to her baby before its time. If the woman was not hurt badly, the man who hurt her must pay a fine. The woman’s husband will decide how much the man must pay. The judges will help the man decide how much the fine will be."},{"num":23,"verse":"But if the woman was hurt badly, then the man who hurt her must be punished. The punishment must fit the crime. You must trade one life for another life."},{"num":24,"verse":"You must trade an eye for an eye, a tooth for a tooth, a hand for a hand, a foot for a foot,"},{"num":25,"verse":"a burn for a burn, a bruise for a bruise, a cut for a cut."},{"num":26,"verse":"“If a man hits a slave in the eye, and the slave is blinded in that eye, then the slave will be allowed to go free. His eye is the payment for his freedom. This is the same for a man or a woman slave."},{"num":27,"verse":"If a master hits his slave in the mouth, and the slave loses a tooth, then the slave will be allowed to go free. The slave’s tooth is payment for the slave’s freedom. This is the same for a man or a woman slave."},{"num":28,"verse":"“If a man’s bull kills a man or woman, then you should use stones and kill that bull. You should not eat the bull. The owner of the bull is not guilty."},{"num":29,"verse":"But if the bull had hurt people in the past, and if the owner was warned, then the owner is guilty. That is because he did not keep the bull tied or locked in its place. So if the bull is allowed to be free and kills someone, the owner is guilty. You should kill the bull with stones and also kill the owner."},{"num":30,"verse":"But the family of the dead man may accept money. If they accept money, the man who owned the bull should not be killed. But he must pay as much money as the judge decides."},{"num":31,"verse":"“This same law must be followed if the bull kills someone’s son or daughter."},{"num":32,"verse":"But if the bull kills a slave, the owner of the animal must pay the master 30 pieces of silver. And the bull must also be killed with stones. This law will be the same for men and women slaves."},{"num":33,"verse":"“A man might take a cover off a well or dig a hole and not cover it. If another man’s animal comes and falls into that hole, the man who owns the hole is guilty."},{"num":34,"verse":"The man who owns the hole must pay for the animal. But after he pays for the animal, he will be allowed to keep the body of that animal."},{"num":35,"verse":"“If one man’s bull kills another man’s bull, they should sell the bull that is alive. Both men will get half of the money that comes from selling the bull, and both men will also get half of the bull that was killed."},{"num":36,"verse":"But if a man’s bull has hurt other animals in the past, that owner is responsible for his bull. If his bull kills another bull, he is guilty because he allowed the bull to be free. That man must pay bull for bull. He must trade his bull for the bull that was killed."}]