[{"header":"Chapter 21"},{"num":1,"verse":"Laws Concerning Slaves. “These are the decrees that you will set before them."},{"num":2,"verse":"“When you buy a Hebrew slave, he will serve you for six years and in the seventh year he will go free, without paying anything."},{"num":3,"verse":"If he entered into slavery unmarried, he will go out alone. If he is married, then his wife will go with him."},{"num":4,"verse":"If his master has given him a wife and she has had sons or daughters, the woman and her children will be the property of the master and he will go out alone."},{"num":5,"verse":"“If the slave says, ‘I love my master, my wife, and my children, and I do not want to go free,’"},{"num":6,"verse":"then the master will bring him before God. He will bring him to a door or a doorpost and will bore a hole in his ear with an awl. He will be his slave forever."},{"num":7,"verse":"“When a man sells his daughter as a slave, she will not go free as the male slaves do."},{"num":8,"verse":"If she does not please her master who has taken her as a concubine, she will be allowed to be redeemed. But he cannot sell her to foreigners, for he has acted faithlessly to her."},{"num":9,"verse":"If he wishes to give her as a concubine to his own son, he will treat her like a daughter."},{"num":10,"verse":"If he takes another for himself, he will not withhold her food, her clothes, or her marriage rights."},{"num":11,"verse":"If he does not give her these things, then she can go away without having to pay the price of her redemption."},{"num":12,"verse":"Different Cases of the Penalty of Death.“Whoever strikes a man causing his death will be put to death."},{"num":13,"verse":"However, if the man did not lie in wait, but he met him by chance, there will be a place where he can flee for refuge."},{"num":14,"verse":"“But when a person kills a neighbor with premeditation, he shall be dragged away from my altar to be put to death."},{"num":15,"verse":"“Whoever strikes a mother or a father will be put to death."},{"num":16,"verse":"“Whoever kidnaps a man and either sells him or has him still in his possession, shall be put to death."},{"num":17,"verse":"“Whoever curses his father or his mother shall be put to death."},{"num":18,"verse":"Punishments for Personal Injury.“When people are fighting and one of them injures the other with a stone or with a fist, and this does not kill the other but causes a serious injury,"},{"num":19,"verse":"and yet the injured party is able to walk around with a staff, then the one who struck the blow shall be held to be innocent. He must, however, pay the victim for the time he lost on account of the injury and he must pay for his medical care."},{"num":20,"verse":"“When a man strikes his male or female slave with a staff and kills that slave, he shall surely be punished."},{"num":21,"verse":"But if the slave lives for a day or two, the slave-owner shall not be punished, for the slave is his property."},{"num":22,"verse":"“When some men fight and injure a pregnant woman so that she loses her child, but there is no other damage, they will be fined as much as the husband of the woman decides. They will pay in the presence of a judge."},{"num":23,"verse":"But if further harm results, they will pay a life for a life,"},{"num":24,"verse":"an eye for an eye, a tooth for a tooth, a hand for a hand, a foot for a foot,"},{"num":25,"verse":"a burning for a burning, a wound for a wound, a bruise for a bruise."},{"num":26,"verse":"“When a man strikes the eye of his male slave or his female slave and blinds the slave, he will free the slave because of the eye."},{"num":27,"verse":"If he breaks a tooth of his male slave or his female slave, he will free the slave to compensate for the tooth."},{"num":28,"verse":"Animals: Injuries and Thefts.“If an ox gores a man or a woman and that person dies, the ox is to be stoned and its meat is not to be eaten, but the owner of the ox will be considered to be innocent."},{"num":29,"verse":"However, if the ox had already gored someone before and the owner had been warned, yet failed to keep it penned up, and if the ox gores another man or a woman and that person dies, then the ox is to be stoned and the owner is to be put to death."},{"num":30,"verse":"“If, however, a fine is imposed, he can pay it to redeem his life, as much as has been required."},{"num":31,"verse":"This will also be the procedure if a son or a daughter is gored."},{"num":32,"verse":"“If an ox gores a male or female slave, the master of the slave will be paid thirty shekels of silver, and the ox is to be stoned."},{"num":33,"verse":"“If someone leaves a cistern uncovered or digs a cistern and does not cover it, and an ox or a donkey falls into it,"},{"num":34,"verse":"the owner of the cistern must make restitution and pay the owner of the animal. The dead animal will be his."},{"num":35,"verse":"“If someone’s ox gores another person’s ox and that ox dies, then they will sell the live ox and divide its price between them, and they will also divide the dead ox."},{"num":36,"verse":"But if it is known that the ox had already gored others and its owner had not confined it, then he must pay ox for ox, and the dead animal will be his."},{"num":37,"verse":"“If a man steals an ox or a sheep and then kills it or sells it, he shall pay back five oxen for an ox and four sheep for a sheep."}]