[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(44-50) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "If thy people goout.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The prayer here returns once more to invoke God’s aid against earthly enemies. It is characteristic of the foreboding tone of sadness, which runs through the whole prayer, that it touches but lightly on the first petition, for God’s blessing on the arms of Israel, so often granted in days gone by, and enlarges on the second petition, for mercy and deliverance in the event of defeat and captivity. The spirit, and in the confession of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Kings 8:47",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the very words, of this prayer of Solomon are strikingly reproduced in the solemn supplication of Daniel, when the close of the Babylonish captivity drew near (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 9:4-15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").There we find a confession of sin, perverseness, and wickedness, literally the same; we find also a similar pleading with God, as “keeping covenant and mercy,” a similar reference to the deliverance from Egypt, and a similar emphasis on the consecration of the city and its people by God’s “great name.” There is a striking pathos of circumstance in the fact, that over “the sanctuary that was desolate” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 9:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), with “his windows open towards Jerusalem,” Daniel utters the same prayer, which had marked the day of its consecration in all magnificence and prosperity.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1 Kings 8:44-45",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 8:44-45",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "If thy people go out to battle — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "In a just cause, and by thy warrant and commission. This is the next case recommended by Solomon to the divine favour. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Whithersoever thou shalt send them — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "In this is implied, that it was unlawful for them to undertake any war merely for their own pleasure or profit, or the gratification of their own worldly or ambitious desires; or to enlarge their empire beyond its due bounds; and that they could not, with a good conscience, pray to God for his blessing on such a war. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And shall pray unto the Lord — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Whereby he instructs them that they should not trust either to the strength or justice of their arms, but only to God’s help and blessing, for which they were to pray. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Toward the city which thou hast chosen — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "For thy dwelling-place, and the seat of thy temple. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Toward the house which I have built — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "For to it they were to turn their faces in prayer; to profess themselves worshippers of the true God, in opposition to idols; and to strengthen their faith in God’s promises and covenant, the tables whereof were contained in that house. Soldiers in the field must not think it enough that others pray for them; they must pray for themselves; and they are here encouraged to expect a gracious answer. Praying should always go along with fighting. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Maintain their cause — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Declare the justice of their cause by giving them the victory.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8:22-53 In this excellent prayer, Solomon does as we should do in every prayer; he gives glory to God. Fresh experiences of the truth of God's promises call for larger praises. He sues for grace and favour from God. The experiences we have of God's performing his promises, should encourage us to depend upon them, and to plead them with him; and those who expect further mercies, must be thankful for former mercies. God's promises must be the guide of our desires, and the ground of our hopes and expectations in prayer. The sacrifices, the incense, and the whole service of the temple, were all typical of the Redeemer's offices, oblation, and intercession. The temple, therefore, was continually to be remembered. Under one word, forgive, Solomon expressed all that he could ask in behalf of his people. For, as all misery springs from sin, forgiveness of sin prepares the way for the removal of every evil, and the receiving of every good. Without it, no deliverance can prove a blessing. In addition to the teaching of the word of God, Solomon entreated the Lord himself to teach the people to profit by all, even by their chastisements. They shall know every man the plague of his own heart, what it is that pains him; and shall spread their hands in prayer toward this house; whether the trouble be of body or mind, they shall represent it before God. Inward burdens seem especially meant. Sin is the plague of our own hearts; our in-dwelling corruptions are our spiritual diseases: every true Israelite endeavours to know these, that he may mortify them, and watch against the risings of them. These drive him to his knees; lamenting these, he spreads forth his hands in prayer. After many particulars, Solomon concludes with the general request, that God would hearken to his praying people. No place, now, under the gospel, can add to the prayers made in or towards it. The substance is Christ; whatever we ask in his name, it shall be given us. In this manner the Israel of God is established and sanctified, the backslider is recovered and healed. In this manner the stranger is brought nigh, the mourner is comforted, the name of God is glorified. Sin is the cause of all our troubles; repentance and forgiveness lead to all human happiness.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "That all people of the earth may know thy name, to fear thee - Solomon prays that the result of Yahweh's hearing the prayers of pagans addressed toward the temple may be the general conversion of the world to the worship of Him. Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 96:1-13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 98:1-9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This house ... - literally, as in the margin. In Scripture, when God's Name is said to be \"called upon\" persons or things, it seems to be meant that God is really present in them, upholding them and sanctifying them. This passage therefore means, that the pagan, when their prayers, directed toward the temple, are granted, will have a full assurance that God is present in the building in some very special way. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "This house ... - literally, as in the margin. In Scripture, when God's Name is said to be \"called upon\" persons or things, it seems to be meant that God is really present in them, upholding them and sanctifying them. This passage therefore means, that the pagan, when their prayers, directed toward the temple, are granted, will have a full assurance that God is present in the building in some very special way. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1Ki 8:22-61. His Prayer.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "22. Solomon stood before the altar—This position was in the court of the people, on a brazen scaffold erected for the occasion (2Ch 6:13), fronting the altar of burnt offering, and surrounded by a mighty concourse of people. Assuming the attitude of a suppliant, kneeling (1Ki 8:54; compare 2Ch 6:24) and with uplifted hands, he performed the solemn act of consecration—an act remarkable, among other circumstances, for this, that it was done, not by the high priest or any member of the Aaronic family, but by the king in person, who might minister about, though not in, holy things. This sublime prayer [1Ki 8:22-35], which breathes sentiments of the loftiest piety blended with the deepest humility, naturally bore a reference to the national blessing and curse contained in the law—and the burden of it—after an ascription of praise to the Lord for the bestowment of the former, was an earnest supplication for deliverance from the latter. He specifies seven cases in which the merciful interposition of God would be required; and he earnestly bespeaks it on the condition of people praying towards that holy place. The blessing addressed to the people at the close is substantially a brief recapitulation of the preceding prayer [1Ki 8:56-61].",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Withersoever thou shalt send them, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. in a just cause, and by thy warrant or commission; whereby he implies that it was unlawful for them to undertake any war merely for their own glory or lust, or to enlarge their empire beyond its due bounds; and that they could not with safe conscience pray to God for his blessing upon such a war. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And shall pray unto the Lord; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " whereby he instructs them that they should not trust either to the strength or justice of their arms, but only to God’s help and blessing, which they were to pray for. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The city which thou hast chosen, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to wit, for thy dwelling-place, and the seat of thy temple. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Toward the house that I have built for thy name; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for to it they were to turn their faces in prayer; partly thereby to profess themselves to be the worshippers of the true God, in opposition to idols; and that they sought help from him, and from no other; and partly to strengthen faith in God’s promises and covenant, the tables whereof were contained in that house. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "If thy people go out to battle against their enemy,.... In a foreign country, threatening to invade them, or having trespassed on their borders, or some way or other infringed on their liberties and privileges, and so given them just occasion to go to war with them: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "whithersoever thou shalt send them; this case supposes their asking counsel of God, or having a direction and commission from him by a prophet, or some other way, to engage in war with the enemy: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and shall pray unto the Lord toward the city which thou hast chosen, and toward the house I have built for thy name: for, notwithstanding the justness of their cause, and having a warrant from God to go to war, yet they were to pray to him for success when at a distance, even in a foreign land, and about to engage the enemy; and this they were to do, turning their faces towards the city of Jerusalem, and the temple there; declaring thereby that their dependence was upon the Lord that dwelt there, and their expectation of victory was only from him. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and shall pray unto the Lord toward the city which thou hast chosen, and toward the house I have built for thy name: for, notwithstanding the justness of their cause, and having a warrant from God to go to war, yet they were to pray to him for success when at a distance, even in a foreign land, and about to engage the enemy; and this they were to do, turning their faces towards the city of Jerusalem, and the temple there; declaring thereby that their dependence was upon the Lord that dwelt there, and their expectation of victory was only from him. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "If thy people go out to battle against their enemy, whithersoever thou shalt send them, and shall pray unto the LORD toward the city which thou hast chosen, and toward the house that I have built for thy name:",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "44",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "If thy people go out to battle",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The case here is of a war undertaken by God’s direction, and therefore in a righteous cause. Under such circumstances the people may trust in Him for support.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall pray unto the Lord toward the city",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Not only the Jews but other people were wont to turn their faces toward some sacred spot when praying in a distant land, as Daniel did in Babylon (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 6:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Thus the Mohammedans turn towards Mecca, and the early Christians inherited from the Jews the custom of turning to the east when they prayed. Cf. Tert. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Apol.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " 16.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 44.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "If thy people go out to battle against their enemy, whithersoever",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "in the way which",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "thou shalt send them",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [These words clearly imply that the war, whether defensive or offensive (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", for the chastisement of other nations), is one which had God's sanction, and indeed was waged by His appointment], ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "and shall pray unto the Lord toward",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "in the way of",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Same expression as above. The repetition is significant. \"They have gone in God's way. They may therefore look the way of God's house for help.\" Executing God's commission, they might justly expect His blessing] ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "the city which thou hast chosen, and toward the house that I have built for thy name.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " 1 Kings 8:44",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Finally, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 8:44-50",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Solomon also asks, that when prayers are directed towards the temple by those who are far away both from Jerusalem and the temple, they may be heard. The sixth case, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 8:44",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 8:45",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is, if Israel should be engaged in war with an enemy by the appointment of God; and the seventh, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 8:46-50",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is, if it should be carried away by enemies on account of its sins.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Bertheau (on Chron.) has already proved that there is no force in the arguments by which Thenius attempts to show, on doctrinal grounds, that 1 Kings 8:44-51 are an interpolated addition. As he correctly observes, \"it is, on the contrary, quite in harmony with the original plan, that the two cases are also anticipated, in which the prayers of Israelites who are at a distance from the seat of the sanctuary are directed towards the temple, since it is perfectly appropriate that the prayers of the Israelites at the place of the sanctuary are mentioned first, then the prayers of foreigners at the same place, and lastly the prayers of Israelites, who, because they are not in Jerusalem, are obliged to content themselves with turning their faces towards the temple. We might also point to the fact that it is probably intentional that exactly seven cases are enumerated, inasmuch as in enumerations of this kind, which are not restricted by the nature of the case to any definite measure, such a number as seven easily furnishes an outward limit,\" - or more correctly: because seven as a sacred or covenant number was more appropriate than any other to embrace all prayers addressed to God.)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: Bertheau (on Chron.) has already proved that there is no force in the arguments by which Thenius attempts to show, on doctrinal grounds, that ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 8:44-51",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " are an interpolated addition. As he correctly observes, \"it is, on the contrary, quite in harmony with the original plan, that the two cases are also anticipated, in which the prayers of Israelites who are at a distance from the seat of the sanctuary are directed towards the temple, since it is perfectly appropriate that the prayers of the Israelites at the place of the sanctuary are mentioned first, then the prayers of foreigners at the same place, and lastly the prayers of Israelites, who, because they are not in Jerusalem, are obliged to content themselves with turning their faces towards the temple. We might also point to the fact that it is probably intentional that exactly seven cases are enumerated, inasmuch as in enumerations of this kind, which are not restricted by the nature of the case to any definite measure, such a number as seven easily furnishes an outward limit,\" - or more correctly: because seven as a sacred or covenant number was more appropriate than any other to embrace all prayers addressed to God.)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "By the expression in 1 Kings 8:44, \"in the way which Thou sendest them,\" the war is described as one undertaken by the direction of God, whether wages against an enemy who has invaded the land, or outside the land of Canaan for the chastisement of the heathen dwelling around them. \"And shall pray וגו העיר דּרך:\" i.e., in the direction towards the chosen city and the temple, namely, in faith in the actual presence of the covenant God in the temple. יהוה אל, \"to Jehovah,\" instead of \"to Thee,\" is probably introduced for the sake of greater clearness. משׁפּטם ועשׂית, and secure them justice (cf. Deuteronomy 10:18; Psalm 9:5, etc.).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "By the expression in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 8:44",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"in the way which Thou sendest them,\" the war is described as one undertaken by the direction of God, whether wages against an enemy who has invaded the land, or outside the land of Canaan for the chastisement of the heathen dwelling around them. \"And shall pray וגו העיר דּרך:\" i.e., in the direction towards the chosen city and the temple, namely, in faith in the actual presence of the covenant God in the temple. יהוה אל, \"to Jehovah,\" instead of \"to Thee,\" is probably introduced for the sake of greater clearness. משׁפּטם ועשׂית, and secure them justice (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 10:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 9:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", etc.).",
            "children": []
          }
        ]
      }
    ]
  }
]