[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8:1-11 The bringing in the ark, is the end which must crown the work: this was done with great solemnity. The ark was fixed in the place appointed for its rest in the inner part of the house, whence they expected God to speak to them, even in the most holy place. The staves of the ark were drawn out, so as to direct the high priest to the mercy-seat over the ark, when he went in, once a year, to sprinkle the blood there; so that they continued of use, though there was no longer occasion to carry it by them. The glory of God appearing in a cloud may signify, 1. The darkness of that dispensation, in comparison with the light of the gospel, by which, with open face, we behold, as in a glass, the glory of the Lord. 2. The darkness of our present state, in comparison with the sight of God, which will be the happiness of heaven, where the Divine glory is unveiled.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the tabernacle of the congregation - Not the tented structure erected for the ark on Mount Zion ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 6:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " by David, but the original tabernacle made by Moses, which had hitherto remained at Gibeon (margin reference). The tabernacle and its holy vessels were probably placed in the treasury. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2-6. at the feast in the month Ethanim—The public and formal inauguration of this national place of worship did not take place till eleven months after the completion of the edifice. The delay, most probably, originated in Solomon's wish to choose the most fitting opportunity when there should be a general rendezvous of the people in Jerusalem (1Ki 8:2); and that was not till the next year. That was a jubilee year, and he resolved on commencing the solemn ceremonial a few days before the feast of tabernacles, which was the most appropriate of all seasons. That annual festival had been instituted in commemoration of the Israelites dwelling in booths during their stay in the wilderness, as well as of the tabernacle, which was then erected, in which God promised to meet and dwell with His people, sanctifying it with His glory. As the tabernacle was to be superseded by the temple, there was admirable propriety in choosing the feast of tabernacles as the period for dedicating the new place of worship, and praying that the same distinguished privileges might be continued to it in the manifestation of the divine presence and glory. At the time appointed for the inauguration, the king issued orders for all the heads and representatives of the nation to repair to Jerusalem and take part in the august procession [1Ki 8:1]. The lead was taken by the king and elders of the people, whose march must have been slow, as priests were stationed to offer an immense number of sacrifices at various points in the line of road through which the procession was to go. Then came the priests bearing the ark and the tabernacle—the old Mosaic tabernacle which was brought from Gibeon. Lastly, the Levites followed, carrying the vessels and ornaments belonging to the old, for lodgment in the new, house of the Lord. There was a slight deviation in this procedure from the order of march established in the wilderness (Nu 3:31; 4:15); but the spirit of the arrangement was duly observed. The ark was deposited in the oracle; that is, the most holy place, under the wings of the cherubim—not the Mosaic cherubim, which were firmly attached to the ark (Ex 37:7, 8), but those made by Solomon, which were far larger and more expanded.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "For the cherubim spread forth their two wings over the place of the ark,.... The most holy place where the ark stood, even from wall to wall: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the cherubim covered the ark, and the staves thereof above; so that neither could be seen. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and the cherubim covered the ark, and the staves thereof above; so that neither could be seen. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "For the cherubim spread forth their two wings over the place of the ark, and the cherubim covered the ark and the staves thereof above.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "covered the ark and the staves thereof above",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The ark appears to have been placed lengthwise, (the length was two cubits and a half,) beneath the wings of the cherubim. Thus the staves also would lie along in the rings and so be overshadowed by the wings.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1 Kings 8:7",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "After this sacrificing was ended, the priests carried the ark to its place, into the back-room of the house, into the Most Holy under the wings of the cherubim (already described in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 6:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".). The latter statement is explained in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 8:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"For the cherubim were spreading out wings towards the place of the ark, and so covered (lit., threw a shade) over the ark and over its poles from above.\" If the outspread wings of the great cherubic figures threw a shade not only over the ark of the covenant, but also over its poles, the ark was probably so placed that the poles ran from north to south, and not from east to west, as they are sketched in my Archologie.",
        "children": []
      }
    ]
  }
]