[{"header":"The Devil Tempts Jesus(A)"},{"num":4,"verse":"Yeshua was filled with the Holy Spirit as he left the Jordan River. The Spirit led him while he was in the desert, "},{"num":2,"verse":"where he was tempted by the devil for 40 days. During those days Yeshua ate nothing, so when they were over, he was hungry."},{"num":3,"verse":"The devil said to him, “If you are the Son of God, tell this stone to become a loaf of bread.”"},{"num":4,"verse":"Yeshua answered him, “Scripture says, ‘A person cannot live on bread alone.’”"},{"num":5,"verse":"The devil took him to a high place and showed him all the kingdoms of the world in an instant. "},{"num":6,"verse":"The devil said to him, “I will give you all the power and glory of these kingdoms. All of it has been given to me, and I give it to anyone I please. "},{"num":7,"verse":"So if you will worship me, all this will be yours.”"},{"num":8,"verse":"Yeshua answered him, “Scripture says, ‘Worship the Lord your God and serve only him.’”"},{"num":9,"verse":"Then the devil took him into Jerusalem and had him stand on the highest part of the temple. He said to Yeshua, “If you are the Son of God, jump from here! "},{"num":10,"verse":"Scripture says, ‘He will put his angels in charge of you to watch over you carefully. "},{"num":11,"verse":"They will carry you in their hands so that you never hit your foot against a rock.’”"},{"num":12,"verse":"Yeshua answered him, “It has been said, ‘Never tempt the Lord your God.’”"},{"num":13,"verse":"After the devil had finished tempting Yeshua in every possible way, the devil left him until another time."},{"header":"Nazareth Rejects Jesus(B)"},{"num":14,"verse":"Yeshua returned to Galilee. The power of the Spirit was with him, and the news about him spread throughout the surrounding country. "},{"num":15,"verse":"He taught in the synagogues, and everyone praised him."},{"num":16,"verse":"Then Yeshua came to Nazareth, where he had been brought up. As usual he went into the synagogue on the day of worship. He stood up to read the lesson. "},{"num":17,"verse":"The attendant gave him the book of the prophet Isaiah. He opened it and found the place where it read:"},{"num":20,"verse":"Yeshua closed the book, gave it back to the attendant, and sat down. Everyone in the synagogue watched him closely. "},{"num":21,"verse":"Then he said to them, “This passage came true today when you heard me read it.”"},{"num":22,"verse":"All the people spoke well of him. They were amazed to hear the gracious words flowing from his lips. They said, “Isn’t this Joseph’s son?”"},{"num":23,"verse":"So he said to them, “You’ll probably quote this proverb to me, ‘Doctor, cure yourself!’ and then say to me, ‘Do all the things in your hometown that we’ve heard you’ve done in Capernaum.’” "},{"num":24,"verse":"Then Yeshua added, “I can guarantee this truth: A prophet isn’t accepted in his hometown."},{"num":25,"verse":"“I can guarantee this truth: There were many widows in Israel in Elijah’s time. It had not rained for three-and-a-half years, and the famine was severe everywhere in the country. "},{"num":26,"verse":"But God didn’t send Elijah to anyone except a widow at Zarephath in the territory of Sidon. "},{"num":27,"verse":"There were also many people with skin diseases in Israel in the prophet Elisha’s time. But God cured no one except Naaman from Syria.”"},{"num":28,"verse":"Everyone in the synagogue became furious when they heard this. "},{"num":29,"verse":"Their city was built on a hill with a cliff. So they got up, forced Yeshua out of the city, and led him to the cliff. They intended to throw him off of it. "},{"num":30,"verse":"But Yeshua walked right by them and went away."},{"header":"Jesus Forces an Evil Spirit out of a Man(C)"},{"num":31,"verse":"Yeshua went to Capernaum, a city in Galilee, and taught them on a day of worship. "},{"num":32,"verse":"The people were amazed at his teachings because he spoke with authority."},{"num":33,"verse":"In the synagogue was a man possessed by a spirit, an evil demon. He shouted very loudly, "},{"num":34,"verse":"“Oh, no! What do you want with us, Yeshua from Nazareth? Have you come to destroy us? I know who you are—the Holy One of God!”"},{"num":35,"verse":"Yeshua ordered the spirit, “Keep quiet, and come out of him!” The demon threw the man down in the middle of the synagogue and came out without hurting him."},{"num":36,"verse":"Everyone was stunned. They said to one another, “What kind of command is this? With authority and power he gives orders to evil spirits, and they come out.”"},{"num":37,"verse":"So news about him spread to every place throughout the surrounding region."},{"header":"Jesus Cures Simon’s Mother-in-Law and Many Others(D)"},{"num":38,"verse":"Yeshua left the synagogue and went to Simon’s house. Simon’s mother-in-law was sick with a high fever. They asked Yeshua to help her. "},{"num":39,"verse":"He bent over her, ordered the fever to leave, and it went away. She got up immediately and prepared a meal for them."},{"num":40,"verse":"When the sun was setting, everyone who had friends suffering from various diseases brought them to him. He placed his hands on each of them and cured them. "},{"num":41,"verse":"Demons came out of many people, shouting, “You are the Son of God!” But Yeshua ordered them not to speak. After all, they knew he was the Messiah."},{"header":"Spreading the Good News(E)"},{"num":42,"verse":"In the morning he went to a place where he could be alone. The crowds searched for him. When they came to him, they tried to keep him from leaving. "},{"num":43,"verse":"But he said to them, “I have to tell the Good News about the kingdom of God in other cities also. That’s what I was sent to do.”"},{"num":44,"verse":"So he spread his message in the synagogues of Judea."}]