[{"header":"Jesus faces temptation"},{"num":1,"verse":"Jesus returned from the Jordan full of the Holy Spirit and he was led by the Spirit to spend forty days in the desert, where he was tempted by the devil. He ate nothing during that time and afterwards he felt very hungry."},{"num":3,"verse":"“If you really are the Son of God,” the devil said to him, “tell this stone to turn into a loaf.”"},{"num":4,"verse":"Jesus answered, “The scripture says, ‘Man shall not live by bread alone, but by every word of God’.”"},{"num":5,"verse":"Then the devil took him up and showed him all the kingdoms of mankind in a sudden vision, and said to him, “I will give you all this power and magnificence, for it belongs to me and I can give it to anyone I please. It shall all be yours if you will fall down and worship me.”"},{"num":8,"verse":"To this Jesus replied, “It is written, ‘You shall worship the Lord your God, and him only you shall serve’.”"},{"num":9,"verse":"Then the devil took him to Jerusalem and set him on the highest ledge of the Temple. “If you really are the Son of God,” he said, “throw yourself down from here, for the scripture says, ‘He shall give his angels charge over you, to keep you’, and ‘In their hands they shall bear you up, lest you dash your foot against a stone’.”"},{"num":12,"verse":"To which Jesus replied, “It is also said, ‘You shall not tempt the Lord your God’.”"},{"num":13,"verse":"And when he had exhausted every kind of temptation, the devil withdrew until his next opportunity."},{"header":"Jesus begins his ministry in Galilee"},{"num":14,"verse":"And now Jesus returned to Galilee in the power of the Spirit,—and news of him spread through all the surrounding district. He taught in their synagogues, to everyone’s admiration."},{"num":16,"verse":"Then he came to Nazareth where he had been brought up and, according to his custom, went to the synagogue on the Sabbath day. He stood up to read the scriptures and the book of the prophet Isaiah was handed to him. He opened the book and found the place where these words are written—‘The Spirit of the Lord is upon me, because he has anointed me to preach the Gospel to the poor. He has sent me to heal the brokenhearted, to preach deliverance to the captives and recovery of sight to the blind, to set at liberty those who are oppressed, to preach the acceptable year of the Lord’."},{"num":20,"verse":"Then he shut the book, handed it back to the attendant and resumed his seat. Every eye in the synagogue was fixed upon him and he began to tell them, “This very day this scripture has been fulfilled, while you were listening to it!”"},{"num":22,"verse":"Everybody noticed what he said and was amazed at the beautiful words that came from his lips, and they kept saying, “Isn’t this Joseph’s son?”"},{"num":23,"verse":"So he said to them, “I expect you will quote this proverb to me, ‘Cure yourself, doctor!’ Let us see you do in your own country all that we have heard that you did in Capernaum!” Then he added, “I assure you that no prophet is ever welcomed in his own country. I tell you the plain fact that in Elijah’s time, when the heavens were shut up for three and a half years and there was a great famine through the whole country, there were plenty of widows in Israel, but Elijah was not sent to any of them. But he was sent to Sarepta, to a widow in the country of Sidon. In the time of Elisha the prophet, there were a great many lepers in Israel, but not one of them was healed—only Naaman, the Syrian.”"},{"num":28,"verse":"But when they heard this, everyone in the synagogue was furiously angry. They sprang to their feet and drove him right out of the town, taking him to the brow of the hill on which it was built, intending to hurl him down bodily. But he walked straight through the whole crowd and went on his way."},{"header":"Jesus heals in Capernaum"},{"num":31,"verse":"So he came down to Capernaum, a town in Galilee, and taught them on the Sabbath day. They were astonished at his teaching, for his words had the ring of authority."},{"num":33,"verse":"There was a man in the synagogue under the influence of some evil spirit and he yelled at the top of his voice, “Hi! What have you got to do with us, Jesus, you Nazarene—have you come to kill us? I know who you are all right, you’re God’s holy one!”"},{"num":35,"verse":"Jesus cut him short and spoke sharply, “Be quiet! Get out of him!” And after throwing the man down in front of them, the devil did come out of him without hurting him in the slightest. At this everybody present was amazed and they kept saying to each other, “What sort of words are these? He speaks to these evil spirits with authority and power and out they come.”"},{"num":37,"verse":"And his reputation spread over the whole surrounding district."},{"num":38,"verse":"When Jesus got up and left the synagogue he went into Simon’s house. Simon’s mother-in-law was suffering from a high fever, and they asked Jesus about her. He stood over her as she lay in bed, brought the fever under control and it left her. At once she got up and began to see to their needs."},{"num":40,"verse":"Then, as the sun was setting, all those who had friends suffering from every kind of disease brought them to Jesus and he laid his hands on each one of them separately and healed them. Evil spirits came out of many of these people, shouting, “You are the Son of God!” But he spoke sharply to them and would not allow them to say any more, for they knew perfectly well that he was Christ."},{"header":"Jesus attempts to be alone—in vain"},{"num":42,"verse":"At daybreak, he went off to a deserted place, but the crowds tried to find him and when they did discover him, tried to prevent him from leaving them. But he told them, “I must tell the good news of the kingdom of God to other towns as well—that is my mission.”"},{"num":44,"verse":"And he continued proclaiming his message in the synagogues of Judea."}]