[{"num":18,"verse":"This song of David was written at a time when the Lord had delivered him from his many enemies, including Saul."},{"num":2,"verse":"The Lord is my fort where I can enter and be safe; no one can follow me in and slay me. He is a rugged mountain where I hide; he is my Savior, a rock where none can reach me, and a tower of safety. He is my shield. He is like the strong horn of a mighty fighting bull. "},{"num":3,"verse":"All I need to do is cry to him—oh, praise the Lord—and I am saved from all my enemies!"},{"num":4,"verse":"Death bound me with chains, and the floods of ungodliness mounted a massive attack against me. "},{"num":5,"verse":"Trapped and helpless, I struggled against the ropes that drew me on to death."},{"num":6,"verse":"In my distress I screamed to the Lord for his help. And he heard me from heaven; my cry reached his ears. "},{"num":7,"verse":"Then the earth rocked and reeled, and mountains shook and trembled. How they quaked! For he was angry. "},{"num":8,"verse":"Fierce flames leaped from his mouth, setting fire to the earth; smoke blew from his nostrils. "},{"num":9,"verse":"He bent the heavens down and came to my defense; thick darkness was beneath his feet. "},{"num":10,"verse":"Mounted on a mighty angel, he sped swiftly to my aid with wings of wind. "},{"num":11,"verse":"He enshrouded himself with darkness, veiling his approach with dense clouds dark as murky waters. "},{"num":12,"verse":"Suddenly the brilliance of his presence broke through the clouds with lightning and a mighty storm of hail."},{"num":13,"verse":"The Lord thundered in the heavens; the God above all gods has spoken—oh, the hailstones; oh, the fire! "},{"num":14,"verse":"He flashed his fearful arrows of lightning and routed all my enemies. See how they run! "},{"num":15,"verse":"Then at your command, O Lord, the sea receded from the shore. At the blast of your breath the depths were laid bare."},{"num":16,"verse":"He reached down from heaven and took me and drew me out of my great trials. He rescued me from deep waters. "},{"num":17,"verse":"He delivered me from my strong enemy, from those who hated me—I who was helpless in their hands."},{"num":18,"verse":"On the day when I was weakest, they attacked. But the Lord held me steady. "},{"num":19,"verse":"He led me to a place of safety, for he delights in me."},{"num":20,"verse":"The Lord rewarded me for doing right and being pure. "},{"num":21,"verse":"For I have followed his commands and have not sinned by turning back from following him. "},{"num":22,"verse":"I kept close watch on all his laws; I did not refuse a single one. "},{"num":23,"verse":"I did my best to keep them all, holding myself back from doing wrong. "},{"num":24,"verse":"And so the Lord has paid me with his blessings, for I have done what is right, and I am pure of heart. This he knows, for he watches my every step."},{"num":25,"verse":"Lord, how merciful you are to those who are merciful. And you do not punish those who run from evil. "},{"num":26,"verse":"You give blessings to the pure but pain to those who leave your paths. "},{"num":27,"verse":"You deliver the humble but condemn the proud and haughty ones. "},{"num":28,"verse":"You have turned on my light! The Lord my God has made my darkness turn to light. "},{"num":29,"verse":"Now in your strength I can scale any wall, attack any troop."},{"num":30,"verse":"What a God he is! How perfect in every way! All his promises prove true. He is a shield for everyone who hides behind him. "},{"num":31,"verse":"For who is God except our Lord? Who but he is as a rock?"},{"num":32,"verse":"He fills me with strength and protects me wherever I go. "},{"num":33,"verse":"He gives me the surefootedness of a mountain goat upon the crags. He leads me safely along the top of the cliffs. "},{"num":34,"verse":"He prepares me for battle and gives me strength to draw an iron bow!"},{"num":35,"verse":"You have given me your salvation as my shield. Your right hand, O Lord, supports me; your gentleness has made me great. "},{"num":36,"verse":"You have made wide steps beneath my feet so that I need never slip. "},{"num":37,"verse":"I chased my enemies; I caught up with them and did not turn back until all were conquered. "},{"num":38,"verse":"I pinned them to the ground; all were helpless before me. I placed my feet upon their necks. "},{"num":39,"verse":"For you have armed me with strong armor for the battle. My enemies quail before me and fall defeated at my feet. "},{"num":40,"verse":"You made them turn and run; I destroyed all who hated me. "},{"num":41,"verse":"They shouted for help, but no one dared to rescue them; they cried to the Lord, but he refused to answer them. "},{"num":42,"verse":"So I crushed them fine as dust and cast them to the wind. I threw them away like sweepings from the floor. "},{"num":43,"verse":"You gave me victory in every battle. The nations came and served me. Even those I didn’t know before come now and bow before me. Foreigners who have never seen me submit instantly. They come trembling from their strongholds."},{"num":46,"verse":"God is alive! Praise him who is the great rock of protection. "},{"num":47,"verse":"He is the God who pays back those who harm me and subdues the nations before me."},{"num":48,"verse":"He rescues me from my enemies; he holds me safely out of their reach and saves me from these powerful opponents. "},{"num":49,"verse":"For this, O Lord, I will praise you among the nations. "},{"num":50,"verse":"Many times you have miraculously rescued me, the king you appointed. You have been loving and kind to me and will be to my descendants."}]