[{"num":22,"verse":"“You are not to watch your brother’s ox or sheep straying and behave as if you hadn’t seen it; you must bring them back to your brother. "},{"num":2,"verse":"If your brother is not close by, or you don’t know who the owner is, you are to bring it home to your house; and it will remain with you until your brother asks for it; then you are to give it back to him. "},{"num":3,"verse":"You are to do the same with his donkey, his coat or anything else of your brother’s that he loses. If you find something he lost, you must not ignore it."},{"num":4,"verse":"“If you see your brother’s donkey or ox collapsed on the road, you may not behave as if you hadn’t seen it; you must help him get them up on their feet again."},{"num":5,"verse":"“A woman is not to wear men’s clothing, and a man is not to put on women’s clothing, for whoever does these things is detestable to Adonai your God."},{"num":6,"verse":"“If, as you are walking along, you happen to see a bird’s nest in a tree or on the ground with chicks or eggs, and the mother bird is sitting on the chicks or the eggs, you are not to take the mother with the chicks. "},{"num":7,"verse":"You must let the mother go, but you may take the chicks for yourself; so that things will go well with you, and you will prolong your life."},{"num":8,"verse":"(iii) “When you build a new house, you must build a low wall around your roof; otherwise someone may fall from it, and you will be responsible for his death."},{"num":9,"verse":"“You are not to sow two kinds of seed between your rows of vines; if you do, both the two harvested crops and the yield from the vines must be forfeited. "},{"num":10,"verse":"You are not to plow with an ox and a donkey together. "},{"num":11,"verse":"You are not to wear clothing woven with two kinds of thread, wool and linen together."},{"num":12,"verse":"“You are to make for yourself twisted cords on the four corners of the garment you wrap around yourself."},{"num":13,"verse":"“If a man marries a woman, has sexual relations with her and then, having come to dislike her, "},{"num":14,"verse":"brings false charges against her and defames her character by saying, ‘I married this woman, but when I had intercourse with her I did not find evidence that she was a virgin’; "},{"num":15,"verse":"then the girl’s father and mother are to take the evidence of the girl’s virginity to the leaders of the town at the gate. "},{"num":16,"verse":"The girl’s father will say to the leaders, ‘I let my daughter marry this man, but he hates her, "},{"num":18,"verse":"so he has brought false charges that he didn’t find evidence of her virginity; yet here is the evidence of my daughter’s virginity’ — and they will lay the cloth before the town leaders. "},{"num":19,"verse":"The leaders of that town are to take the man, punish him, "},{"num":19,"verse":"and fine him two-and-a-half pounds of silver shekels, which they will give to the girl’s father, because he has publicly defamed a virgin of Isra’el. She will remain his wife, and he is forbidden from divorcing her as long as he lives."},{"num":20,"verse":"“But if the charge is substantiated that evidence for the girl’s virginity could not be found; "},{"num":21,"verse":"then they are to lead the girl to the door of her father’s house, and the men of her town will stone her to death, because she has committed in Isra’el the disgraceful act of being a prostitute while still in her father’s house. In this way you will put an end to such wickedness among you."},{"num":22,"verse":"“If a man is found sleeping with a woman who has a husband, both of them must die — the man who went to bed with the woman and the woman too. In this way you will expel such wickedness from Isra’el."},{"num":23,"verse":"“If a girl who is a virgin is engaged to a man, and another man comes upon her in the town and has sexual relations with her; "},{"num":24,"verse":"you are to bring them both out to the gate of the city and stone them to death — the girl because she didn’t cry out for help, there in the city, and the man because he has humiliated his neighbor’s wife. In this way you will put an end to such wickedness among you."},{"num":25,"verse":"“But if the man comes upon the engaged girl out in the countryside, and the man grabs her and has sexual relations with her, then only the man who had intercourse with her is to die. "},{"num":26,"verse":"You will do nothing to the girl, because she has done nothing deserving of death. The situation is like the case of the man who attacks his neighbor and kills him. "},{"num":27,"verse":"For he found her in the countryside, and the engaged girl cried out, but there was no one to save her."},{"num":28,"verse":"“If a man comes upon a girl who is a virgin but who is not engaged, and he grabs her and has sexual relations with her, and they are caught in the act, "},{"num":29,"verse":"then the man who had intercourse with her must give to the girl’s father one-and-a-quarter pounds of silver shekels, and she will become his wife, because he humiliated her; he may not divorce her as long as he lives."}]