[[],[{"type":"prose","content":"You shall not watch your neighbor’s ox or sheep straying away and ignore them; you shall take them back to their owner. "}],[{"type":"prose","content":"If the owner does not reside near you or you do not know who the owner is, you shall bring it to your own house, and it shall remain with you until the owner claims it; then you shall return it. "}],[{"type":"prose","content":"You shall do the same with a neighbor’s donkey; you shall do the same with a neighbor’s garment; and you shall do the same with anything else that your neighbor loses and you find. You may not withhold your help."}],[{"type":"prose","content":"You shall not see your neighbor’s donkey or ox fallen on the road and ignore it; you shall help to lift it up."}],[{"type":"prose","content":"A woman shall not wear a man’s apparel, nor shall a man put on a woman’s garment; for whoever does such things is abhorrent to the LORD your God."}],[{"type":"prose","content":"If you come on a bird’s nest, in any tree or on the ground, with fledglings or eggs, with the mother sitting on the fledglings or on the eggs, you shall not take the mother with the young. "}],[{"type":"prose","content":"Let the mother go, taking only the young for yourself, in order that it may go well with you and you may live long."}],[{"type":"prose","content":"When you build a new house, you shall make a parapet for your roof; otherwise you might have bloodguilt on your house, if anyone should fall from it."}],[{"type":"prose","content":"You shall not sow your vineyard with a second kind of seed, or the whole yield will have to be forfeited, both the crop that you have sown and the yield of the vineyard itself."}],[{"type":"prose","content":"You shall not plow with an ox and a donkey yoked together."}],[{"type":"prose","content":"You shall not wear clothes made of wool and linen woven together."}],[{"type":"prose","content":"You shall make tassels on the four corners of the cloak with which you cover yourself."}],[{"type":"header","content":"Laws concerning Sexual Relations"},{"type":"prose","content":"Suppose a man marries a woman, but after going in to her, he dislikes her "}],[{"type":"prose","content":"and makes up charges against her, slandering her by saying, “I married this woman; but when I lay with her, I did not find evidence of her virginity.” "}],[{"type":"prose","content":"The father of the young woman and her mother shall then submit the evidence of the young woman’s virginity to the elders of the city at the gate. "}],[{"type":"prose","content":"The father of the young woman shall say to the elders: “I gave my daughter in marriage to this man but he dislikes her; "}],[{"type":"prose","content":"now he has made up charges against her, saying, ‘I did not find evidence of your daughter’s virginity.’ But here is the evidence of my daughter’s virginity.” Then they shall spread out the cloth before the elders of the town. "}],[{"type":"prose","content":"The elders of that town shall take the man and punish him; "}],[{"type":"prose","content":"they shall fine him one hundred shekels of silver (which they shall give to the young woman’s father) because he has slandered a virgin of Israel. She shall remain his wife; he shall not be permitted to divorce her as long as he lives."}],[{"type":"prose","content":"If, however, this charge is true, that evidence of the young woman’s virginity was not found, "}],[{"type":"prose","content":"then they shall bring the young woman out to the entrance of her father’s house and the men of her town shall stone her to death, because she committed a disgraceful act in Israel by prostituting herself in her father’s house. So you shall purge the evil from your midst."}],[{"type":"prose","content":"If a man is caught lying with the wife of another man, both of them shall die, the man who lay with the woman as well as the woman. So you shall purge the evil from Israel."}],[{"type":"prose","content":"If there is a young woman, a virgin already engaged to be married, and a man meets her in the town and lies with her, "}],[{"type":"prose","content":"you shall bring both of them to the gate of that town and stone them to death, the young woman because she did not cry for help in the town and the man because he violated his neighbor’s wife. So you shall purge the evil from your midst."}],[{"type":"prose","content":"But if the man meets the engaged woman in the open country, and the man seizes her and lies with her, then only the man who lay with her shall die. "}],[{"type":"prose","content":"You shall do nothing to the young woman; the young woman has not committed an offense punishable by death, because this case is like that of someone who attacks and murders a neighbor. "}],[{"type":"prose","content":"Since he found her in the open country, the engaged woman may have cried for help, but there was no one to rescue her."}],[{"type":"prose","content":"If a man meets a virgin who is not engaged, and seizes her and lies with her, and they are caught in the act, "}],[{"type":"prose","content":"the man who lay with her shall give fifty shekels of silver to the young woman’s father, and she shall become his wife. Because he violated her he shall not be permitted to divorce her as long as he lives."}],[{"type":"prose","content":" A man shall not marry his father’s wife, thereby violating his father’s rights."}]]