[{"header":"Chapter 29"},{"num":1,"verse":"Hezekiah’s Reforms. Hezekiah was twenty-five years old when he became king, and he reigned twenty-nine years in Jerusalem. His mother’s name was Abijah, daughter of Zechariah. "},{"num":2,"verse":"He did what was right in the Lord’s sight, just as David his father had done. "},{"num":3,"verse":"In the first month of the first year of his reign, he opened the doors of the Lord’s house and repaired them. "},{"num":4,"verse":"He summoned the priests and Levites, gathering them in the open space to the east, "},{"num":5,"verse":"and said to them: “Listen to me, you Levites! Sanctify yourselves now and sanctify the house of the Lord, the God of your ancestors, and clean out the filth from the sanctuary. "},{"num":6,"verse":"Our ancestors acted treacherously and did what was evil in the eyes of the Lord, our God. They abandoned him, turned away their faces from the Lord’s dwelling, and turned their backs on him. "},{"num":7,"verse":"They also closed the doors of the vestibule, extinguished the lamps, and failed to burn incense and sacrifice burnt offerings in the sanctuary to the God of Israel. "},{"num":8,"verse":"Therefore the anger of the Lord has come upon Judah and Jerusalem; he has made them an object of terror, horror, and hissing, as you see with your own eyes. "},{"num":9,"verse":"For our ancestors fell by the sword, and our sons, our daughters, and our wives have been taken captive because of this. "},{"num":10,"verse":"Now, I intend to make a covenant with the Lord, the God of Israel, that his burning anger may turn away from us. "},{"num":11,"verse":"My sons, do not be negligent any longer, for it is you whom the Lord has chosen to stand before him, to minister to him, to be his ministers and to offer incense.”"},{"num":12,"verse":"Then the Levites arose: Mahath, son of Amasai, and Joel, son of Azariah, of the Kohathites; of the descendants of Merari: Kish, son of Abdi, and Azariah, son of Jehallel; of the Gershonites: Joah, son of Zimmah, and Eden, son of Joah; "},{"num":13,"verse":"of the sons of Elizaphan: Shimri and Jeuel; of the sons of Asaph: Zechariah and Mattaniah; "},{"num":14,"verse":"of the sons of Heman: Jehuel and Shimei; of the sons of Jeduthun: Shemiah and Uzziel. "},{"num":15,"verse":"They gathered their kinfolk together and sanctified themselves; then they came as the king had ordered, in keeping with the words of the Lord, to cleanse the Lord’s house."},{"num":16,"verse":"The priests entered the interior of the Lord’s house to cleanse it. Whatever they found in the Lord’s temple that was unclean they brought out to the court of the Lord’s house, where the Levites took it from them and carried it out to the Wadi Kidron. "},{"num":17,"verse":"They began the work of consecration on the first day of the first month, and on the eighth day of the month they reached the vestibule of the Lord; they consecrated the Lord’s house over an eight-day period, and on the sixteenth day of the first month, they had finished."},{"num":18,"verse":"Then they went inside to King Hezekiah and said: “We have cleansed the entire house of the Lord, the altar for burnt offerings with all its utensils, and the table for the showbread with all its utensils. "},{"num":19,"verse":"We have restored and consecrated all the articles which King Ahaz had thrown away during his reign because of his treachery; they are now before the Lord’s altar.”"},{"num":20,"verse":"The Rite of Expiation. Then King Hezekiah hastened to convoke the princes of the city and went up to the Lord’s house. "},{"num":21,"verse":"Seven bulls, seven rams, seven lambs, and seven he-goats were presented as a purification offering for the kingdom, for the sanctuary, and for Judah. Hezekiah ordered the sons of Aaron, the priests, to offer them on the altar of the Lord. "},{"num":22,"verse":"They slaughtered the bulls, and the priests collected the blood and splashed it on the altar. Then they slaughtered the rams and splashed the blood on the altar; then they slaughtered the lambs and splashed the blood on the altar. "},{"num":23,"verse":"Then the he-goats for the purification offering were led before the king and the assembly, who laid their hands upon them. "},{"num":24,"verse":"The priests then slaughtered them and offered their blood on the altar to atone for the sin of all Israel. For the king had said, “The burnt offering and the purification offering are for all Israel.”"},{"num":25,"verse":"He stationed the Levites in the Lord’s house with cymbals, harps, and lyres, according to the command of David, of Gad the king’s seer, and of Nathan the prophet; for this command was from the Lord through his prophets. "},{"num":26,"verse":"The Levites were stationed with the instruments of David, and the priests with the trumpets. "},{"num":27,"verse":"Then Hezekiah ordered the burnt offering to be sacrificed on the altar. At the very moment the burnt offering began, they also began the song of the Lord, to the accompaniment of the trumpets and the instruments of David, king of Israel. "},{"num":28,"verse":"The entire assembly bowed down, and the song was sung and the trumpets sounded until the burnt offering had been completed. "},{"num":29,"verse":"Once the burnt offering was completed, the king and all who were with him knelt and worshiped. "},{"num":30,"verse":"King Hezekiah and the princes then told the Levites to sing the praises of the Lord in the words of David and of Asaph the seer. They sang praises till their joy was full, then fell down and worshiped."},{"num":31,"verse":"Hezekiah then said: “You have dedicated yourselves to the Lord. Approach, and bring forward the sacrifices and thank offerings for the house of the Lord.” Then the assembly brought forward the sacrifices and thank offerings and all their voluntary burnt offerings. "},{"num":32,"verse":"The number of burnt offerings that the assembly brought forward was seventy oxen, one hundred rams, and two hundred lambs: all of these as a burnt offering to the Lord. "},{"num":33,"verse":"As consecrated gifts there were six hundred oxen and three thousand sheep. "},{"num":34,"verse":"Since there were too few priests to skin all the victims for the burnt offerings, their fellow Levites assisted them until the task was completed and the priests had sanctified themselves. The Levites, in fact, were more careful than the priests to sanctify themselves. "},{"num":35,"verse":"The burnt offerings were indeed many, along with the fat of the communion offerings and the libations for the burnt offerings. Thus the service of the house of the Lord was re-established. "},{"num":36,"verse":"Hezekiah and all the people rejoiced over what God had re-established for the people, and at how suddenly this had been done."}]