[{"num":2,"verse":"Shlomo enlisted 70,000 men who carried loads, another 80,000 men who were stonecutters in the hills and 3,600 supervising them. "},{"num":3,"verse":"Then Shlomo sent this message to Huram the king of Tzor: “[Deal with me] as you dealt with David my father when you sent him cedar logs, so that he could build himself a palace to live in. "},{"num":4,"verse":"Here, I am about to build a house for the name of Adonai my God, to dedicate it to him, and to burn before Him incense made of sweet spices; the house will also be for the continuing showbread and for the burnt offerings presented every morning and evening, on the shabbats, at every Rosh-Hodesh, and at the designated times of Adonai our God. This is a perpetual regulation for Isra’el. "},{"num":5,"verse":"The house I will build will be great, because our God is greater than all gods. "},{"num":6,"verse":"But who is equal to building him a house? Why, heaven itself, even the heaven of heavens, cannot contain him; so who am I to build him a house, except to offer sacrifices before him?"},{"num":7,"verse":"“Now, therefore, send me a man skilled at working with gold, silver, bronze and iron; dealing with purple, crimson, and blue dyed materials; and capable of doing all kinds of engraving. He will be with the skilled craftsmen I have with me in Y’hudah and Yerushalayim, whom David my father provided. "},{"num":8,"verse":"Also send me cedar, cypress and sandalwood logs from the L’vanon; for I know that your servants are skilled in cutting timber in the L’vanon. I will have my servants work together with your servants "},{"num":9,"verse":"to prepare me an abundant supply of timber, for the house I am about to build must be magnificent and wonderful. "},{"num":10,"verse":"I will give your servants, the woodcutters who cut the timber, 100,000 bushels of cracked wheat, 100,000 bushels of barley, 100,000 gallons of wine, and 100,000 gallons of olive oil.”"},{"num":11,"verse":"Huram the king of Tzor wrote this answer and sent it to Shlomo: “Because the Lord loves his people, he has made you king over them.” "},{"num":12,"verse":"Huram continued, “Blessed be Adonai, the God of Isra’el, who made heaven and earth, who has given David the king a wise, knowledgeable son with common sense to build a house for Adonai and a royal palace for himself. "},{"num":13,"verse":"Now I am sending a man of skill and understanding, my master craftsman Huram, "},{"num":14,"verse":"the son of a woman who was one of the daughters of Dan, while his father was a man from Tzor. He is skilled in working gold, silver, bronze, iron, stone, and timber, as well as purple and blue dyed materials, fine linen and crimson material; he can do any kind of engraving; and he can make all the equipment necessary to accomplish any task assigned to him, with the help of your craftsmen and those of my lord David your father. "},{"num":15,"verse":"Therefore let my lord send his servants the wheat, barley, oil and wine he has spoken of; "},{"num":16,"verse":"and we will cut wood from the L’vanon, as much as you need; we will float it to you as rafts by sea to Yafo, and you will take it up to Yerushalayim.”"},{"num":17,"verse":"Shlomo took a census of all the foreigners in the land of Isra’el, following the pattern of the census of David his father; they were found to number 153,600. "},{"num":18,"verse":"He appointed 70,000 of them to carry loads, 80,000 to be stonecutters in the hills and 3,600 as supervisors to assign the people their work."}]