[{"num":2,"verse":"Solomon recruited 70,000 men as carriers, 80,000 as stonecutters in the mountains and 3,600 supervisors over them."},{"num":2,"verse":"Then Solomon sent word to Huram the king of Tyre saying, “Deal with me as you did with my father David when you sent him cedars to build a house to dwell in. "},{"num":3,"verse":"Behold, I am about to build a House for the Name of Adonai my God and to dedicate it to Him for burning fragrant incense before Him, for regular arrangement of the Bread of the Presence and for burnt offerings every morning and evening as well as on Shabbatot, New Moons and moadim of Adonai Eloheinu. Upon Israel this is forever."},{"num":4,"verse":"“The House that I am about to build will be great, because our God is greater than all the gods. "},{"num":5,"verse":"But who is able to build Him a House, since the heavens, even the highest heavens, cannot contain Him? Who then am I that I should build Him a House—except to burn incense before Him?"},{"num":6,"verse":"“So now, send me a man skilled to work in gold and silver, bronze and iron, and in purple, crimson and blue yarn, and experienced in engraving, to work in Judah and Jerusalem with the skilled men who are with me, whom my father David provided. "},{"num":7,"verse":"Send me also cedar, evergreen and algum logs from Lebanon, for I know that your servants are skilled in cutting timber in Lebanon. Indeed my servants will work with yours "},{"num":8,"verse":"to prepare an abundance of timber for me, because the House that I am about to build will be large and magnificent. "},{"num":9,"verse":"Now, behold, I will give to your servants, the woodsmen who cut the timber, 20,000 measures of ground wheat, 20,000 measures of barley, 20,000 vats of wine and 20,000 vats of oil.”"},{"num":10,"verse":"Then King Huram of Tyre, replied in a letter that he sent to Solomon, “Because Adonai loves His people, He has made you king over them.” "},{"num":11,"verse":"Then Huram continued, “Blessed be Adonai, the God of Israel, who made heaven and earth. He gave King David a wise son, endowed with insight and understanding, who will build a House for Adonai and a royal house for himself. "},{"num":12,"verse":"So now I am sending Huram-abi—a skilled man endowed with understanding "},{"num":13,"verse":"who is the son of a woman from the daughters of Dan and whose father was a man from Tyre—a man skilled to work in gold and silver, bronze and iron, stone and wood, in purple and blue, fine linen and crimson, and to engrave all kinds of engraving, and who can execute any design given to him. He will work with your skilled men and with the skilled men of my lord David your father. "},{"num":14,"verse":"Now let my lord send to his servants the wheat and barley, the oil and wine he has promised "},{"num":15,"verse":"and we will cut as many logs from Lebanon as much as you need, and float them in rafts by sea to Jaffa. You can then take them up to Jerusalem.”"},{"num":16,"verse":"Solomon counted all the foreign men in the land of Israel, like the census that his father David had taken, and 153,600 were found. "},{"num":17,"verse":"He appointed 70,000 of them to carry loads, 80,000 to quarry stones in the mountains, and 3,600 overseers to supervise the people working."}]