[{"num":2,"verse":"Forsooth Solomon deemed, or purposed, to build an house to the name of the Lord, and a palace to himself. (And Solomon decided to build a House in honour of the name of the Lord, and a palace for himself.)"},{"num":2,"verse":"And he numbered seventy thousand of men bearing (burdens) in shoulders, and fourscore thousand that should cut, or hew, stones in hills; and the sovereigns of them were three thousand and six hundred. (And he called up seventy thousand men who would carry burdens on their shoulders, and eighty thousand who would cut stones in the hills; and they had three thousand and six hundred rulers, or overseers.)"},{"num":3,"verse":"And Solomon sent to Hiram, the king of Tyre, and said, As thou didest with my father David, and sentest him trees of cedar, that he should build to him an house, in which also he dwelled; so do thou with me, (And Solomon sent word to Hiram, the king of Tyre, and said, As thou didest with my father David, and sentest cedar wood to him, so that he could build a house for himself, in which he would live, so do thou also with me;)"},{"num":4,"verse":"that I build an house to the name of the Lord my God, and that I hallow it, to burn incense before him, and to make odour of sweet smelling spiceries, and to [the] everlasting setting forth of loaves, and to [the] burnt sacrifices in the morrowtide and eventide, and in [the] sabbaths, and (on) new moons, that is, (at) feasts in the beginnings of months, and in solemnities of the Lord our God into without end, which observances and hallowings be commanded to Israel. (so that I can build a House in honour of the name of the Lord my God, and I shall consecrate it, so that I can burn incense before him, to make the odour of sweet smelling spices, and for the everlasting setting forth of loaves, and for burnt sacrifices in the morning and in the evening, and on sabbaths, and on new moons, that is, at feasts at the beginning of the month, and at the solemn, or annual, Feasts of the Lord our God forevermore, which observances and consecrations be commanded to Israel.)"},{"num":5,"verse":"For the house which I covet to build is great; forsooth the Lord our God is great over all gods."},{"num":6,"verse":"Who therefore may have might to build a worthy house to him? For if heaven and heavens of heavens may not take, or hold, him, how great am I, that I may build an house to him, but to this thing only, that incense be burnt there before him? (And so who is able to build a House worthy of him? For if heaven and the heavens of heavens cannot hold him, who am I, that I build him a House, but only for this, so that incense can be burned there before him?)"},{"num":7,"verse":"Therefore send thou to me a learned man, that can work in gold, and in silver, in brass, and iron, in purple, and in red silk, and in jacinth; and that can grave graving with these craftsmen, which I have with me in Judah and in Jerusalem, the which men David, my father, before made ready. (And so send thou to me a learned man, who knoweth how to work with gold, and silver, and bronze, and iron, and purple, and red silk, and jacinth; one who knoweth how to engrave engravings with these craftsmen who I have with me in Judah and in Jerusalem, which men my father David provided.)"},{"num":8,"verse":"But also send thou to me cedar trees, and pine trees, and thyine trees of the Lebanon; for I know, that thy servants can cut trees of the Lebanon; and my servants shall be with thy servants, (And also send thou to me cedar, and pine, and algum timber from Lebanon; for I know, that thy servants know how to cut down the trees of Lebanon; and my servants shall be with thy servants,)"},{"num":9,"verse":"that full many trees be made ready to me (so that a great deal of timber can be prepared for me); for the house which I covet to build is full great and noble."},{"num":10,"verse":"Furthermore to thy servants, workmen that shall cut trees, I shall give into meats twenty thousand cors of wheat, and so many cors of barley, and twenty thousand measures of oil, that be called baths. (And for thy servants, the workmen who shall cut down the trees, I shall give for food twenty thousand cors of wheat, and as many cors of barley, and twenty thousand measures of oil, that be called baths.)"},{"num":11,"verse":"And Hiram, king of Tyre, said by letters which he sent to Solomon, For the Lord [hath] loved his people, therefore he hath made thee to reign upon it (and so he hath made thee to reign upon them)."},{"num":12,"verse":"And Hiram added to (that), saying, Blessed be the Lord God of Israel, that made heaven and earth, which hath given to king David a wise son, and learned, and witting, and prudent, that he should build an house to the Lord, and a palace to himself. (And Hiram added to that, saying, Blessed be the Lord God of Israel, who made heaven and earth, and who hath given to King David a wise and learned son, knowledgeable and prudent, who shall build a House for the Lord, and a palace for himself.)"},{"num":13,"verse":"Therefore I have sent to thee a prudent man and most knowing, Hiram, my father, (And so I am sending to thee a prudent and most knowledgeable man, Hiram, my master craftsman,)"},{"num":14,"verse":"the son of a woman of the lineage of Dan, whose father was a man of Tyre; the which Hiram can work in gold, and silver, in brass, and in iron, and in marble, and in trees, also in purple, and jacinth, and bis, and in red silk; and the which Hiram can grave in all graving, and can find prudently, whatever thing is needful in work with thy craftsmen, and with the craftsmen of my lord David, thy father. (the son of a woman of the tribe of Dan, whose father was a man of Tyre; this Hiram knoweth how to work with gold, and silver, and bronze, and iron, and marble, and wood, and purple, and jacinth, and fine linen, and red silk; and this Hiram knoweth how to engrave in all manner of engraving, and knoweth how to prudently do whatever is needed to work with thy craftsmen, and with the craftsmen of thy father, my lord David.)"},{"num":15,"verse":"Therefore, my lord, send thou to (us) thy servants the wheat, and barley, and oil, and wine, which thou hast promised."},{"num":16,"verse":"And we shall cut (down) trees of the Lebanon, how many ever thou hast need of; and we shall bring those trees in ships by the sea into Joppa; and it shall be thine doing to lead those over into Jerusalem."},{"num":17,"verse":"Then Solomon numbered all men converted from heathenness, that were in the land of Israel, after the numbering that David, his father, had numbered; and an hundred thousand and three and fifty thousand and six hundred were found of them. (Then Solomon counted all the men converted from heathenness who were in the land of Israel, like in the census that his father David had taken; and a hundred and fifty-three thousand and six hundred were found of them.)"},{"num":18,"verse":"And he made of them seventy thousand, that should bear burdens on their shoulders, and fourscore thousand, that should cut, or hew, stones in hills; and he made three thousand and six hundred sovereigns of [the] works of the people. (And he ordained seventy thousand of them, who would carry burdens on their shoulders, and eighty thousand, who would cut stones in the hills; and he made three thousand and six hundred to be the rulers, or the overseers, who would make these people work.)"}]