[{"header":"The Beginning of Solomon’s Reign"},{"num":3,"verse":"Solomon had made a marriage alliance with Pharaoh king of Egypt. He married Pharaoh’s daughter and brought her into the City of David until he had finished building his own house, the Lord’s house, and the wall around Jerusalem."},{"num":2,"verse":"The people were still offering sacrifices at the high places because a house for the Name of the Lord had not yet been built in those days. "},{"num":3,"verse":"Solomon loved the Lord, so he followed the instructions of his father David, though he was still offering sacrifices and burning incense at the high places."},{"header":"Solomon Asks for Wisdom"},{"num":4,"verse":"So the king went to Gibeon to sacrifice there, because it was the most important high place. Solomon offered one thousand whole burnt offerings on that altar. "},{"num":5,"verse":"The Lord appeared to Solomon in Gibeon in a dream at night."},{"num":6,"verse":"Solomon said, “You have shown great mercy and faithfulness to your servant, my father David, just as he walked before you in truth, righteousness, and uprightness of heart toward you. You have shown this great mercy and faithfulness to him and have given him a son who is seated on his throne to this very day. "},{"num":7,"verse":"O Lord my God, now you have made your servant king in the place of my father David, but I am a little child. I do not know how to go out or come in. "},{"num":8,"verse":"And I, your servant, am among your people whom you have chosen, a great people, who cannot be counted or numbered because they are so many. "},{"num":9,"verse":"Now give to your servant a perceptive heart to judge your people, to distinguish between good and evil, for who is able to judge this great people of yours?”"},{"num":10,"verse":"In the eyes of the Lord, Solomon’s request was good. "},{"num":11,"verse":"So God said to him, “Because you have asked for this, and you have not asked for a long life, nor have you asked for riches, nor have you asked for the lives of your enemies, but you have asked for discernment to reach just verdicts, "},{"num":12,"verse":"therefore I will act according to your words. Yes, I will give you a wise and discerning heart, so that there will never have been anyone like you before you, nor will anyone like you rise up after you. "},{"num":13,"verse":"In addition, I will give you what you have not asked for: such riches and honor that there will not be anyone like you among the other kings throughout all your days. "},{"num":14,"verse":"If you walk in my ways by keeping my statutes and commands just as your father David did, then I will give you a long life.”"},{"num":15,"verse":"Then Solomon woke up and realized it was a dream. So Solomon went to Jerusalem and stood before the Ark of the Covenant of the Lord. He offered whole burnt offerings and fellowship offerings, and he made a feast for all his officials."},{"header":"Solomon Demonstrates God’s Wisdom"},{"num":16,"verse":"Later, two prostitutes came and stood before the king."},{"num":17,"verse":"One woman said, “Hear me, my lord! This woman and I live in the same house. While she was living in the house, I gave birth. "},{"num":18,"verse":"Three days after I gave birth, this woman also gave birth. We were together. There was no one else in the house with us. Only the two of us were there. "},{"num":19,"verse":"One night this woman’s son died because she lay on top of him. "},{"num":20,"verse":"Then she got up in the middle of the night and took my son from beside me while I, your servant, was sleeping. She laid him next to her, and her dead son she laid next to me. "},{"num":21,"verse":"When I got up in the morning to nurse my son, there he was—dead! But when I examined him closely in the morning, I saw it was not my son, to whom I had given birth!”"},{"num":22,"verse":"But the other woman said, “No! The living child is really my son, and your son is the dead one!”"},{"num":23,"verse":"The king said, “This woman says, ‘My son is the living one, and your son is the dead one.’ But this other woman says, ‘No, your son is really the dead one, and my son is the living one.’” "},{"num":24,"verse":"So the king said, “Bring me a sword.” So they brought a sword to the king."},{"num":25,"verse":"Then the king said, “Cut the living child in two, and give half to this woman and half to that woman.”"},{"num":26,"verse":"But the woman to whom the living child belonged spoke up, because her feelings for her son were very strong. She said, “Listen to me, my lord. Give her the living child. Please don’t kill him.”"},{"num":27,"verse":"The king answered, “Give the living child to the first woman, and do not kill him. She is his mother.”"},{"num":28,"verse":"All Israel heard about the judgment which the king had rendered. They were filled with awe in his presence, because they saw that God’s wisdom was in him to administer justice."}]