[{"header":"Solomon Asks for Wisdom"},{"num":3,"verse":"Solomon made a peace treaty with Pharaoh, the king of Egypt, by marrying his daughter. Solomon brought her to the City of David. This was when Solomon was still building his palace, the Temple of the Lord, and the wall around Jerusalem."},{"num":2,"verse":"The Temple to honor the Lord had not yet been finished, so people were still making animal sacrifices on altars at the high places."},{"num":3,"verse":"Solomon showed that he loved the Lord by obeying everything his father David told him to do, except that Solomon continued to go to the high places to offer sacrifices and to burn incense."},{"num":4,"verse":"King Solomon went to Gibeon to offer a sacrifice because that was the most important high place. He offered a thousand burnt offerings on that altar."},{"num":5,"verse":"While Solomon was at Gibeon, the Lord came to him at night in a dream. God said, “Solomon, ask me what you want me to give you.”"},{"num":6,"verse":"Solomon answered, “You were very kind and loyal to your servant, my father David. He was faithful to you and lived a good, honest life. And you showed him the greatest kindness when you let his son take his place as king."},{"num":7,"verse":"Lord my God, you have made me the king in my father’s place, but I am like a small child. I don’t have the wisdom I need to do what I must do."},{"num":8,"verse":"I am your servant here among your chosen people. There are so many that they cannot be counted."},{"num":9,"verse":"So I ask you to give me the wisdom to rule and judge them well and to help me know the difference between right and wrong. Without such great wisdom, it would be impossible to rule this great nation.”"},{"num":10,"verse":"The Lord was happy that Solomon asked for wisdom."},{"num":11,"verse":"So God said to him, “You did not ask for long life and riches for yourself. You did not ask for the death of your enemies. You asked for the wisdom to listen and make the right decisions."},{"num":12,"verse":"So I will give you what you asked for. I will make you wise and intelligent. I will make you wiser than anyone who ever lived or ever will live."},{"num":13,"verse":"And I will also give you what you did not ask for. You will have riches and honor all your life. There will be no other king in the world as great as you."},{"num":14,"verse":"And I will give you a long life if you follow me and obey my laws and commands as your father David did.”"},{"num":15,"verse":"Solomon woke up and knew that God had spoken to him in the dream. Then Solomon went to Jerusalem and stood before the Box of the Lord’s Agreement. He offered a burnt offering and fellowship offerings to the Lord and then gave a party for all of his officials."},{"header":"Proof of Solomon’s Wisdom"},{"num":16,"verse":"One day two prostitutes came to Solomon and stood before the king."},{"num":17,"verse":"One of the women said, “Sir, this woman and I live in the same house. We were both pregnant and ready to give birth to our babies. I had my baby while she was there with me."},{"num":18,"verse":"Three days later she also gave birth to her baby. There was no one else in the house with us, just the two of us."},{"num":19,"verse":"One night while this woman was asleep with her baby, the baby died."},{"num":20,"verse":"That night while I was asleep, she took my son from my bed and carried him to her bed. Then she put the dead baby in my bed."},{"num":21,"verse":"In the morning I woke up and was about to feed the baby when I saw he was dead. When I looked at him more closely, I saw that he was not my baby.”"},{"num":22,"verse":"But the other woman said, “No! The dead baby is yours, and the one still alive is mine!”"},{"num":23,"verse":"Then King Solomon said, “Each of you says that the living baby is your own and that the dead baby belongs to the other woman.”"},{"num":24,"verse":"Then King Solomon sent his servant to get a sword."},{"num":25,"verse":"He told the servant, “Cut the living baby in two and give one half of the baby to each woman.”"},{"num":26,"verse":"The second woman said, “Yes, cut him in two. Then neither of us will have him.” But the first woman, the real mother, loved her son and said to the king, “Please, sir, don’t kill the baby! Give him to her.”"},{"num":27,"verse":"Then King Solomon said, “Stop, don’t kill the baby. Give him to this woman. She is the real mother.”"},{"num":28,"verse":"The people of Israel respected the king when they heard about this decision. They saw he had the wisdom of God to make the right decisions."}]