[{"num":3,"verse":"and (then) by affinity, either alliance, he was joined to Pharaoh, king of Egypt; for he took the daughter of Pharaoh, and brought (her) into the city of David, till he [ful]filled building his house, and the house of the Lord, and the wall of Jerusalem by compass."},{"num":2,"verse":"Nevertheless the people offered in high places; for the temple was not builded to the name of the Lord till into that day. (But the people still offered at the hill shrines; for the Temple was not yet built in honour of the name of the Lord unto that day.)"},{"num":3,"verse":"Soothly Solomon loved the Lord, and went in the behests of David, his father, except that Solomon offered in high places and burnt incense. (And Solomon loved the Lord, and followed his father David’s commands, except that Solomon offered sacrifices and burned incense at the hill shrines.)"},{"num":4,"verse":"And so Solomon went into Gibeon, to offer there; for that was the most high place (for that was the most important, or the most famous, hill shrine). Solomon offered upon that altar in Gibeon a thousand offerings into burnt sacrifice."},{"num":5,"verse":"Soothly the Lord appeared to Solomon by sleep in the night, and said, Ask thou that, that thou wilt, that I give it to thee."},{"num":6,"verse":"And Solomon said, Thou hast done great mercy with thy servant David, my father, as he went in thy sight, in truth, and [in] rightwiseness, and in rightful heart with thee; thou hast kept to him thy great mercy (thou hast shown him thy great love), and hast given to him a son, sitting on his throne, as it is today."},{"num":7,"verse":"And now, Lord God, thou hast made thy servant to reign for David, my father; forsooth I am a little child (but I am like a little child), and not knowing mine out-going and mine in-coming."},{"num":8,"verse":"And thy servant is in the midst of the people, which thou hast chosen, of [a] people without number, that may not be numbered and reckoned, for multitude. (And thy servant is in the midst of the people, whom thou hast chosen, of a people without number, who cannot be counted, or reckoned, for their multitude.)"},{"num":9,"verse":"Therefore thou shalt give to thy servant an heart able to be taught, that is, enlightened of thee, that he may deem thy people, and judge betwixt good and evil; for who may deem this people, thy people, this much people? (And so give thou to thy servant a heart able to be taught, that is, able to be enlightened by thee, so that he can judge, or rule, thy people, and judge between good and evil; for who can judge, or rule, this people, this great people of thine?)"},{"num":10,"verse":"Therefore the word pleased before the Lord, that Solomon had asked (for) such a thing."},{"num":11,"verse":"And the Lord said to Solomon, For thou askedest this word, and askedest not to thee many days, neither riches, neither the lives of thine enemies, but thou askedest to thee wisdom to deem doom, (And the Lord said to Solomon, For thou askedest for this thing, and askedest not for many days for thyself, nor riches, nor the lives of thy enemies, but thou askedest for wisdom to judge justly, or wisely,)"},{"num":12,"verse":"lo! I have done to thee after thy words, and I have given to thee a wise heart and an understanding (one), in so much that no man before thee was like thee, neither shall rise (up) after thee."},{"num":13,"verse":"But also I have given to thee these things, which thou askedest not, that is, riches, and glory, that no man be like thee in kings in all times afterward (so that there shall not be any man like thee among the kings in all thy days)."},{"num":14,"verse":"Forsooth if thou goest in my ways, and keepest my biddings and [my] commandments, as thy father went in them, (then) I shall make thy days long."},{"num":15,"verse":"Therefore Solomon waked, and understood what the sweven was. And when he had come to Jerusalem, he stood before the ark of [the] bond of peace of the Lord, and he offered burnt sacrifices, and made peaceable sacrifices, and (made) a great feast to all his household/to all his menials. (And so Solomon awoke, and understood the dream. And when he had come to Jerusalem, he stood before the Ark of the Covenant of the Lord, and he offered burnt sacrifices, and made peace offerings, and made a great feast for all his household/for all his menials.)"},{"num":16,"verse":"Then two women whores came to the king, and stood before him;"},{"num":17,"verse":"of which one said, My lord, I beseech, I and this woman dwelled in one house, and I childed at her in a couch (and I brought forth my child in a bed when she was there)."},{"num":18,"verse":"And in the third day after that I had childed, also this woman childed (And on the third day after that I had given birth, this woman also gave birth); and we were together in the house, and none other was (there) with us in the house, except us twain."},{"num":19,"verse":"And the son of this woman was dead in the night, for she slept, and over-lay him; (And this woman’s son died in the night, for while she was sleeping, she rolled over, and laid upon him;)"},{"num":20,"verse":"and she rose up in the fourth part of the night in silence, and took my son from the side of me, (while) thine handmaid (was) sleeping, and she laid it in her bosom; and she putted in my bosom her son, that was dead."},{"num":21,"verse":"And when I had risen early, to give milk to my son, he appeared dead; whom I beheld more diligently by clear light, and I perceived, that he was not mine, whom I had engendered (whom I had begat)."},{"num":22,"verse":"The tother woman answered, It is not as thou sayest, but thy son is dead; forsooth my son liveth. The contrary, she said, Thou liest (But the other woman said, Thou liest); for my son liveth, and thy son is dead. And by this manner they strove before the king."},{"num":23,"verse":"Then the king said, This woman saith, My son liveth, and thy son is dead; and this woman answereth, Nay, but thy son is dead, and my son liveth."},{"num":24,"verse":"Therefore the king said, Bring ye to me a sword. And when they had brought a sword before the king,"},{"num":25,"verse":"he said, Part ye the quick young child in two parts (Divide ye, or cut ye, the young living child in two), and give ye the half part to the one, and the half part to the tother."},{"num":26,"verse":"And the woman, whose son was quick, said to the king; for her entrails were moved on her son; Lord, I beseech, give ye to her the quick child, and do not ye slay him. The contrary, she said, Be he neither to me, neither to thee, but be he parted. (And the woman, whose son was living, said to the king; for she was moved with love for her son; Lord, I beseech thee, give ye to her the child alive, and do not ye kill him. But the other woman said, Be he neither to me, nor to thee, but be he divided, or cut in two.)"},{"num":27,"verse":"The king answered, and said, Give ye to this (first) woman the young child quick, and be he not slain (Give ye this first woman the young child alive, and do not kill him); forsooth this is his mother."},{"num":28,"verse":"Therefore all Israel heard the doom, which the king had deemed; and they dreaded the king, and saw, that the wisdom of God was in him, to make doom. (And so all Israel heard the judgement, which the king had decreed; and they revered the king, and saw, that God’s wisdom was in him, to make judgements, or justice.)"}]