[{"header":"The Teaching of the Ancestors(A)"},{"num":7,"verse":"Some Pharisees and teachers of the Law who had come from Jerusalem gathered around Jesus. "},{"num":2,"verse":"They noticed that some of his disciples were eating their food with hands that were ritually unclean—that is, they had not washed them in the way the Pharisees said people should."},{"num":3,"verse":"(For the Pharisees, as well as the rest of the Jews, follow the teaching they received from their ancestors: they do not eat unless they wash their hands in the proper way; "},{"num":4,"verse":"nor do they eat anything that comes from the market unless they wash it first. And they follow many other rules which they have received, such as the proper way to wash cups, pots, copper bowls, and beds.)"},{"num":5,"verse":"So the Pharisees and the teachers of the Law asked Jesus, “Why is it that your disciples do not follow the teaching handed down by our ancestors, but instead eat with ritually unclean hands?”"},{"num":6,"verse":"Jesus answered them, “How right Isaiah was when he prophesied about you! You are hypocrites, just as he wrote:"},{"num":8,"verse":"“You put aside God's command and obey human teachings.”"},{"num":9,"verse":"And Jesus continued, “You have a clever way of rejecting God's law in order to uphold your own teaching. "},{"num":10,"verse":"For Moses commanded, ‘Respect your father and your mother,’ and, ‘If you curse your father or your mother, you are to be put to death.’ "},{"num":11,"verse":"But you teach that if people have something they could use to help their father or mother, but say, ‘This is Corban’ (which means, it belongs to God), "},{"num":12,"verse":"they are excused from helping their father or mother. "},{"num":13,"verse":"In this way the teaching you pass on to others cancels out the word of God. And there are many other things like this that you do.”"},{"header":"The Things That Make a Person Unclean(D)"},{"num":14,"verse":"Then Jesus called the crowd to him once more and said to them, “Listen to me, all of you, and understand. "},{"num":15,"verse":"There is nothing that goes into you from the outside which can make you ritually unclean. Rather, it is what comes out of you that makes you unclean.”"},{"num":16,"verse":""},{"num":17,"verse":"When he left the crowd and went into the house, his disciples asked him to explain this saying. "},{"num":18,"verse":"“You are no more intelligent than the others,” Jesus said to them. “Don't you understand? Nothing that goes into you from the outside can really make you unclean, "},{"num":19,"verse":"because it does not go into your heart but into your stomach and then goes on out of the body.” (In saying this, Jesus declared that all foods are fit to be eaten.)"},{"num":20,"verse":"And he went on to say, “It is what comes out of you that makes you unclean. "},{"num":21,"verse":"For from the inside, from your heart, come the evil ideas which lead you to do immoral things, to rob, kill, "},{"num":22,"verse":"commit adultery, be greedy, and do all sorts of evil things; deceit, indecency, jealousy, slander, pride, and folly— "},{"num":23,"verse":"all these evil things come from inside you and make you unclean.”"},{"header":"A Woman's Faith(E)"},{"num":24,"verse":"Then Jesus left and went away to the territory near the city of Tyre. He went into a house and did not want anyone to know he was there, but he could not stay hidden. "},{"num":25,"verse":"A woman, whose daughter had an evil spirit in her, heard about Jesus and came to him at once and fell at his feet. "},{"num":26,"verse":"The woman was a Gentile, born in the region of Phoenicia in Syria. She begged Jesus to drive the demon out of her daughter. "},{"num":27,"verse":"But Jesus answered, “Let us first feed the children. It isn't right to take the children's food and throw it to the dogs.”"},{"num":28,"verse":"“Sir,” she answered, “even the dogs under the table eat the children's leftovers!”"},{"num":29,"verse":"So Jesus said to her, “Because of that answer, go back home, where you will find that the demon has gone out of your daughter!”"},{"num":30,"verse":"She went home and found her child lying on the bed; the demon had indeed gone out of her."},{"header":"Jesus Heals a Deaf-Mute"},{"num":31,"verse":"Jesus then left the neighborhood of Tyre and went on through Sidon to Lake Galilee, going by way of the territory of the Ten Towns. "},{"num":32,"verse":"Some people brought him a man who was deaf and could hardly speak, and they begged Jesus to place his hands on him. "},{"num":33,"verse":"So Jesus took him off alone, away from the crowd, put his fingers in the man's ears, spat, and touched the man's tongue. "},{"num":34,"verse":"Then Jesus looked up to heaven, gave a deep groan, and said to the man,  “Ephphatha,” which means, “Open up!”"},{"num":35,"verse":"At once the man was able to hear, his speech impediment was removed, and he began to talk without any trouble. "},{"num":36,"verse":"Then Jesus ordered the people not to speak of it to anyone; but the more he ordered them not to, the more they told it. "},{"num":37,"verse":"And all who heard were completely amazed. “How well he does everything!” they exclaimed. “He even causes the deaf to hear and the dumb to speak!”"}]