[{"num":7,"verse":"· kai The ho Pharisees Pharisaios and kai some tis of  the ho scribes grammateus who  had  come erchomai from apo Jerusalem Hierosolyma gathered synagō around pros Jesus autos"},{"num":2,"verse":"and kai noticed  that hoti some tis of ho his autos disciples mathētēs were  eating esthiō the ho loaves artos with  hands cheir that were  defiled koinos,  that houtos is eimi,  unwashed aniptos. "},{"num":3,"verse":"( For gar the ho Pharisees Pharisaios and kai all pas the ho Jews Ioudaios do esthiō not ou eat esthiō unless ean mē they  ceremonially pygmē wash niptō their ho hands cheir,  thus  maintaining krateō the ho tradition paradosis of  the ho elders presbyteros. "},{"num":4,"verse":"· kai They  do esthiō not ou eat esthiō anything  from apo the  marketplace agora unless ean mē it  is  purified baptizō by  washing .  And kai there  are eimi many polys other allos customs  that hos they  have  received paralambanō as  tradition  to  keep krateō, like the  washing baptismos of  cups potērion,  · kai pots xestēs,  · kai copper chalkion bowls ,  and kai dining klinē couches .) "},{"num":5,"verse":"And kai the ho Pharisees Pharisaios and kai · ho scribes grammateus asked eperōtaō him autos, “ Why dia tis do  your sy disciples mathētēs not ou walk peripateō · ho according kata to  the ho tradition paradosis of  the ho elders presbyteros,  but alla eat esthiō their ho bread artos with  defiled koinos hands cheir?” "},{"num":6,"verse":"And de he ho said legō to  them autos, “ Isaiah ēsaias prophesied prophēteuō accurately kalōs about peri you hymeis · ho hypocrites hypokritēs,  as hōs it  is  written graphō: ‘ This houtos · ho people laos honors timaō me egō with  their ho lips cheilos,  · ho but de their autos heart kardia is apechō far porrō from apo me egō. "},{"num":7,"verse":"In  vain matēn · de do  they  worship sebō me egō,  teaching didaskō as  doctrines didaskalia the  precepts entalma of  men anthrōpos.’ "},{"num":8,"verse":"Neglecting aphiēmi the ho command entolē of ho God theos,  you  maintain krateō the ho tradition paradosis of ho men anthrōpos.” "},{"num":9,"verse":"And kai he  said legō to  them autos, “You are  clever kalōs at  setting atheteō aside  the ho command entolē of ho God theos in  order hina to  · ho establish histēmi your  own hymeis tradition paradosis. "},{"num":10,"verse":"For gar Moses Mōysēs said legō, ‘ Honor timaō · ho your sy father patēr and kai · ho your sy mother mētēr,’  and kai, ‘ Whoever ho speaks kakologeō evil  of  father patēr or ē mother mētēr must  be  put teleutaō to  death thanatos.’ "},{"num":11,"verse":"But de you hymeis say legō, ‘ If ean a  man anthrōpos says legō to  his ho father patēr or ē · ho mother mētēr, “ Whatever hos ean help  you  might  have  received ōpheleō from ek me egō is  Corban korban” ( that hos is eimi,  given dōron to God), "},{"num":12,"verse":"then  you  no ouketi longer  allow aphiēmi him autos to  do poieō anything oudeis for  his ho father patēr or ē · ho mother mētēr. "},{"num":13,"verse":"Thus  you  invalidate akyroō the ho word logos of ho God theos with ho your hymeis tradition paradosis that hos you  have  handed paradidōmi down .  And kai you  do poieō many polys similar paromoios things toioutos.” "},{"num":14,"verse":"· kai Calling proskaleō the ho crowd ochlos to  him  again palin,  he  said legō to  them autos, “ Listen akouō to  me egō,  everyone pas,  and kai understand syniēmi. "},{"num":15,"verse":"There  is eimi nothing oudeis from  outside exōthen a ho man anthrōpos that  enters eisporeuomai him autos that hos is  able dynamai to  defile koinoō him autos.  Rather alla the ho things  that  come  out ekporeuomai of ek a ho man anthrōpos are eimi the ho things  that  defile koinoō · ho him anthrōpos.” "},{"num":17,"verse":"And kai when hote Jesus  entered eiserchomai eis the  house oikos away apo from  the ho crowd ochlos,  his autos disciples mathētēs asked eperōtaō him autos · ho about  the ho parable parabolē. "},{"num":18,"verse":"So kai he  said legō to  them autos, “ Are eimi you hymeis too kai so houtōs lacking asynetos in  understanding ?  Do  you  not ou know noeō that hoti whatever pas comes eisporeuomai into eis a  man anthrōpos · ho from  outside exōthen · ho is  not ou able dynamai to  defile koinoō him autos, "},{"num":19,"verse":"because hoti it  does  not ou enter eisporeuomai his autos · ho heart kardia,  but alla his ho stomach koilia,  and kai goes  out ekporeuomai into eis the ho latrine aphedrōn?” ( Thus  he  declared katharizō all pas · ho foods brōma clean .) "},{"num":20,"verse":"And de he  said legō, “ What ho comes  out ekporeuomai of ek a ho person anthrōpos,  that ekeinos is  what  defiles koinoō · ho him anthrōpos. "},{"num":21,"verse":"For gar from  within esōthen,  from ek the ho heart kardia of ho a  person anthrōpos,  come ekporeuomai evil kakos · ho plots dialogismos,  · ho immoralities porneia,  thefts klopē,  murders phonos, "},{"num":22,"verse":"adulteries moicheia,  greedy pleonexia actions ,  wicked ponēria deeds ,  deceit dolos,  sensuality aselgeia,  selfishness ophthalmos,  slander blasphēmia,  arrogance hyperēphania,  lack  of  moral  sense aphrosynē. "},{"num":23,"verse":"All pas these houtos · ho evil ponēros things  come ekporeuomai from  within esōthen,  and kai they  defile koinoō a ho person anthrōpos.” "},{"num":24,"verse":"From  there ekeithen · de Jesus  arose anistēmi and  went aperchomai to eis the ho region horion of  Tyre Tyros.  · kai He  entered eiserchomai a  house oikia and  wanted thelō no oudeis one  to  know ginōskō about  it,  yet kai he  was  not ou able dynamai to  escape  attention lanthanō. "},{"num":25,"verse":"But alla immediately  after  hearing akouō of peri him autos, a  woman gynē whose hos daughter thugatrion had echō · ho an  unclean akathartos spirit pneuma came erchomai and  fell prospiptō at pros · ho his autos feet pous. "},{"num":26,"verse":"The ho · de woman gynē was eimi a  Greek Hellēnis, a  Syrophoenician Syrophoinikissa by ho birth genos.  · kai She  begged erōtaō Jesus autos to hina drive  out ekballō the ho demon daimonion from ek · ho her autos daughter thugatēr. "},{"num":27,"verse":"· kai He  said legō to  her autos, “ Let aphiēmi the ho children teknon first prōton be  fed chortazō,  for gar it  is eimi not ou right kalos to  take lambanō the ho children’ s teknon bread artos · ho and kai throw ballō it  to  the ho dogs kynarion.” "},{"num":28,"verse":"· ho But de she  answered apokrinomai him autos,  · kai saying legō, “ Lord kyrios,  even kai the ho dogs kynarion under hypokatō the ho table trapeza feed esthiō from apo the ho children’ s paidion crumbs psichion.”  · ho"},{"num":29,"verse":"And kai he  said legō to  her autos, “ Because dia of  this houtos · ho reply logos,  you  may  go hypagō;  the ho demon daimonion has  left exerchomai · ho your sy daughter thugatēr.” "},{"num":30,"verse":"And kai when  she  arrived aperchomai at eis · ho her autos house oikos,  she  found heuriskō the ho child paidion lying ballō on epi the ho bed klinē,  · kai the ho demon daimonion having  departed exerchomai. "},{"num":31,"verse":"· kai Departing exerchomai again palin from ek the ho region horion of  Tyre Tyros, Jesus  went erchomai through dia Sidon Sidōn to eis the ho Sea thalassa of ho Galilee Galilaia,  in ana the  midst mesos of  the ho region horion of  the  Decapolis Dekapolis. "},{"num":32,"verse":"And kai they  brought pherō to  him autos a  deaf kōphos man  · kai who  could  hardly  speak mogilalos,  and kai they  begged parakaleō him autos to hina lay epitithēmi his ho hand cheir on  him autos. "},{"num":33,"verse":"· kai Taking apolambanō him autos aside  from apo the ho crowd ochlos privately kata idios, Jesus  put ballō · ho his autos fingers daktylos into eis the ho man’ s autos ears ous,  and kai after  spitting ptyō,  he  touched haptō · ho his autos tongue glōssa. "},{"num":34,"verse":"· kai Looking anablepō up  to eis · ho heaven ouranos,  he  gave  a  deep  sigh stenazō and kai said legō to  him autos, “ Ephphatha ephphatha!” ( that hos is eimi, “ Be  opened dianoigō”). "},{"num":35,"verse":"And kai immediately eutheōs the man’ s autos ears akoē were  opened anoigō,  · ho · kai that ho which  bound desmos his autos tongue glōssa was  loosened lyō,  · ho and kai he  began  to  speak laleō clearly orthōs. "},{"num":36,"verse":"· kai Jesus  ordered diastellō them autos to hina tell legō no  one mēdeis,  but de the  more hosos he  ordered diastellō them autos, the  more perissoteros they autos spread kēryssō the  news . "},{"num":37,"verse":"· kai They  were  absolutely hyperperissōs astonished ekplēssō,  saying legō, “ He  has  done poieō all  things pas well kalōs.  · kai He  makes poieō the ho deaf kōphos to  hear akouō and kai the ho mute alalos to  speak laleō!” "}]