[{"num":5,"verse":"And Deborah and Barak, the son of Abinoam, sang in that day, and said,"},{"num":2,"verse":"Ye men of Israel, that have willfully offered your lives to peril (who have willingly offered your lives to peril), bless ye the Lord."},{"num":3,"verse":"Ye kings, hear; ye princes, perceive with ears (ye princes, listen!); I am, I am the woman, that shall sing to the Lord; I shall sing to the Lord God of Israel."},{"num":4,"verse":"Lord, when thou wentest out from Seir, and passedest by the countries of Edom (and passedest by the countryside of Edom), the earth was moved, and (the) heavens and (the) clouds dropped with waters;"},{"num":5,"verse":"(the) hills flowed from the face of the Lord, and Sinai from the face of the Lord God of Israel."},{"num":6,"verse":"In the days of Shamgar, the son of Anath, in the days of Jael, [the] paths rested (the ways were empty), and they that entered by those (ways), went [away] by paths out of the way."},{"num":7,"verse":"Strong men in Israel ceased, and rested, till Deborah (a)rose, a mother in Israel."},{"num":8,"verse":"The Lord chose new battles, and he destroyed the gates of (their) enemies; shield and spear appeared not in forty thousand of Israel. (They chose new gods, and then there was war at the gates; but shields and spears did not appear among the forty thousand of Israel.)"},{"num":9,"verse":"Mine heart loveth the princes of Israel; ye that offered you(rselves) to peril by your own will, bless ye the Lord; (My heart loveth the leaders of Israel; ye who willingly offered yourselves to peril, bless ye the Lord;)"},{"num":10,"verse":"speak ye, that ascend on shining asses, and sit above in doom, and go in the way. (speak ye, who ride on shining donkeys, and sit in judgement, and go on the way.)"},{"num":11,"verse":"Where the chariots were hurled down (al)together, and the host of [the] enemy’s was strangled, there the Lord’s rightwiseness be told out, and his mercy among the strong men of Israel; then the Lord’s people came down to the gates, and got the princehood. (Where the chariots were altogether hurled down, and the enemy’s army was strangled, there the Lord’s righteousness be told out, and his mercy among the strong men of Israel; then the Lord’s people came down to the gates, and got the victory.)"},{"num":12,"verse":"Rise, rise thou, Deborah, rise thou, and speak a song; rise thou, Barak, and thou, son of Abinoam, take thy prisoners. (Rise, rise thou, Deborah, rise thou up, and sing a song; rise thou up, Barak, thou son of Abinoam, and take thy prisoners.)"},{"num":13,"verse":"The remnants of the people be saved; the Lord fought against strong men of Ephraim. (The remnant of the people were saved; the Lord’s people fought against the strong men.)"},{"num":14,"verse":"He did away them into Amalek, and after him from Benjamin into thy peoples, thou Amalek. Princes of Machir and of Zebulun went down, that led the host to fight. (From out of Ephraim, they came into the valley, behind the tribe of Benjamin and its people. The leaders of Machir and of Zebulun went down, they who led the army to fight.)"},{"num":15,"verse":"The dukes of Issachar were with Deborah, and followed the steps of Barak, that gave himself to peril, as into a ditch headlong, and into hell (like headlong into a ditch, and down into hell). (Yea,) While Reuben was parted against himself; the strife of great hearted men was found."},{"num":16,"verse":"Why dwellest thou betwixt twain ends (Why stayest thou by the stalls), (so) that thou (mayest) hear the hissings of (the) flocks? (Yea,) While Reuben was parted against himself, the strife of great hearted men was found."},{"num":17,"verse":"Gilead rested beyond (the) Jordan, and Dan gave attention to ships. Asher dwelled in the brink of the sea, and dwelled in havens (Asher stayed by the seashore, and lived in safe coves)."},{"num":18,"verse":"And Zebulun and Naphtali offered their lives to the death, in the country of Meromei, that is interpreted, high. (And Zebulun and Naphtali offered their lives unto the death, in the high places of the countryside.)"},{"num":19,"verse":"Kings came, and fought; kings of Canaan fought in Taanach, beside the waters of Megiddo; and nevertheless they took nothing by prey (but they took nothing of prey)."},{"num":20,"verse":"From heaven, it was fought against them (They fought against them from the heavens); (the) stars dwelled in their order, and in their course, and they fought against Sisera."},{"num":21,"verse":"The strand of Kishon drew (away) their dead bodies, the strand of Kedumim, the strand of Kishon. My soul, tread thou (down the) strong men. (The Kishon River drew away their dead bodies, yea, the ancient river, the Kishon River. My soul, tread thou forth with strength.)"},{"num":22,"verse":"The horsehoofs fell away, while the strongest of enemies fled with rush (while the strongest of the enemies fled away with haste), and (then) felled headlong."},{"num":23,"verse":"Curse ye the land of Meroz, said the angel of the Lord, curse ye the dwellers of him, for they came not to the help of the Lord, into the help of the strongest of him. (Curse ye the land of Meroz, said the angel of the Lord, curse ye its inhabitants, for they came not to the Lord’s help, nor to the help of his strongest men.)"},{"num":24,"verse":"Blessed among women be Jael, the wife of Heber (the) Kenite; blessed be she in her tabernacle (blessed be she in her tent)."},{"num":25,"verse":"To Sisera asking (for) water she gave milk, and in a basin of princes she gave him butter."},{"num":26,"verse":"She put the left hand to the nail, and her right hand to the smith’s hammer; and she smote Sisera, and sought in his head a place of wound, and she pierced strongly his temple. (Then she put a tent peg in her left hand, and the smith’s hammer in her right hand; and she sought a place on his head for the wound, and then she struck down Sisera, when she strongly pierced his temple.)"},{"num":27,"verse":"He felled betwixt her feet, (and) he failed, and died; he was weltered before her feet, and he lay without life, and wretchedful."},{"num":28,"verse":"His mother beheld by a window, and yelled (out); and she spake from the solar, Why tarrieth his chariot to come again? Why tarry the feet of his four-horsed carts?"},{"num":29,"verse":"One wiser than [the] other wives of him answered these words to the mother of her husband,"},{"num":30,"verse":"In hap now he parteth spoils, and the fairest of women is chosen to him; clothes of diverse colours be given to Sisera into prey, and diverse array of household is gathered to adorn necks. (Perhaps now he parteth the spoils, and the fairest of the women be chosen for him; yea, clothes of diverse colours be given to Sisera for prey, and a diverse array of things be gathered to adorn the victor’s neck.)"},{"num":31,"verse":"Lord, all thine enemies perish so; soothly, they that love thee, shine so, as the sun shineth in his strength. And the land rested forty years. (Lord, may all thy enemies so perish; and may they who love thee, shine like the sun shineth in its strength. And then the land rested for forty years.)"}]