[{"num":3,"verse":"And the Lord showed to me the great priest Joshua, standing before the angel of the Lord; and Satan stood on his right half, that he should be adversary to him. (And the Lord showed me Joshua, the High Priest, standing before the angel of the Lord; and Satan stood at his right hand/and the Adversary stood at his right hand, so that he could accuse him, or so that he could be adverse, or hostile, to him.)"},{"num":2,"verse":"And the Lord said to Satan, The Lord blame in thee, Satan, and the Lord that chose Jerusalem, blame in thee. Whether this is not a dead brand ravished from the fire? (And the Lord said to Satan/And the Lord said to the Adversary, The Lord rebuketh thee, Satan, yea, the Lord who chose Jerusalem, rebuketh thee. Is not this man like a firebrand snatched from the fire?)"},{"num":3,"verse":"And Joshua was clothed with foul clothes, and stood before the face of the angel. (And Joshua was clothed with filthy clothes, and stood before the angel.)"},{"num":4,"verse":"Which answered, and said to them that stood before him, and he said, Do ye away foul clothes from him. And he said to him, Lo! I have done away from thee thy wickedness, and I have clothed thee with changing (of) clothes. (Who answered, and said to those who stood before him, and he said, Do ye away his filthy clothes. And then he said to him, Lo! I have done away thy wickedness from thee, and I have clothed thee with a change of clothing/and I have clothed thee with clean clothes.)"},{"num":5,"verse":"And he said, Put ye a clean mitre on his head. And they putted a clean mitre on his head, and clothed him with clothes. And the angel of the Lord stood, (And he said, Put ye a clean turban upon his head. And they put a clean turban upon his head, and clothed him with clean clothes. And the angel of the Lord stood by,)"},{"num":6,"verse":"and the angel of the Lord witnessed to Joshua, and said,"},{"num":7,"verse":"The Lord of hosts saith these things, If thou shalt go in my ways, and shalt keep my keeping, also and thou shalt deem mine house, and shalt keep my porches; and I shall give to thee goers, of these that now here stand nigh. (The Lord of hosts saith these things, If thou shalt go in my ways, and shalt perform your duties, then thou shalt judge, or thou shalt rule, my House, and shalt keep charge of my courtyards, and I shall give thee the right to come and go amongst those who now stand here nearby.)"},{"num":8,"verse":"Hear thou, Joshua, great priest, thou and thy friends that dwell before thee, for they be men signifying thing[s] to coming. Lo! soothly I shall bring my servant springing up, either Christ born. (Hear thou, Joshua, the High Priest, thou and thy friends who be seated before thee, for they signify the things to come. Lo! truly I shall bring forth my servant, The Branch.)"},{"num":9,"verse":"For lo! the stone which I gave before Joshua, on one stone be seven eyes; and lo! I shall grave the graving thereof, saith the Lord of hosts, and I shall do away the wickedness of that land in one day. (For lo! the stone which I put before Joshua, and on that one stone be seven eyes, or seven facets; and lo! I shall engrave its engraving, or its inscription, saith the Lord of hosts, and I shall do away the wickedness of that land in one day.)"},{"num":10,"verse":"In that day, saith the Lord of hosts, a man shall call his friend under a vine, and under a fig tree. (On that day, saith the Lord of hosts, a man shall call his friends to come, and sit down, and rest under a vine, and under a fig tree.)"}]