[[],[{"type":"header","content":"The Lord Commissions Joshua"},{"type":"prose","content":"After Moses the LORD’s servant died, the LORD said to Joshua son of Nun, Moses’ assistant: "}],[{"type":"prose","content":"“Moses my servant is dead. Get ready! Cross the Jordan River. Lead these people into the land that I am ready to hand over to them. "}],[{"type":"prose","content":"I am handing over to you every place you set foot, as I promised Moses. "}],[{"type":"prose","content":"Your territory will extend from the desert in the south to Lebanon in the north. It will extend all the way to the great River Euphrates in the east (including all Syria) and all the way to the Mediterranean Sea in the west. "}],[{"type":"prose","content":"No one will be able to resist you all the days of your life. As I was with Moses, so I will be with you. I will not abandon you or leave you alone. "}],[{"type":"prose","content":"Be strong and brave! You must lead these people in the conquest of this land that I solemnly promised their ancestors I would hand over to them. "}],[{"type":"prose","content":"Make sure you are very strong and brave! Carefully obey all the law my servant Moses charged you to keep. Do not swerve from it to the right or to the left, so that you may be successful in all you do. "}],[{"type":"prose","content":"This law scroll must not leave your lips. You must memorize it day and night so you can carefully obey all that is written in it. Then you will prosper and be successful. "}],[{"type":"prose","content":"I repeat, be strong and brave! Don’t be afraid and don’t panic, for I, the LORD your God, am with you in all you do.”"}],[{"type":"header","content":"Joshua Prepares for the Invasion"},{"type":"prose","content":"Joshua instructed the leaders of the people: "}],[{"type":"prose","content":"“Go through the camp and command the people, ‘Prepare your supplies, for within three days you will cross the Jordan River and begin the conquest of the land the LORD your God is ready to hand over to you.’”"}],[{"type":"prose","content":"Joshua told the Reubenites, the Gadites, and the half-tribe of Manasseh: "}],[{"type":"prose","content":"“Remember what Moses the LORD’s servant commanded you. The LORD your God is giving you a place to settle and is handing this land over to you. "}],[{"type":"prose","content":"Your wives, children, and cattle may stay in the land that Moses assigned to you east of the Jordan River. But all of you warriors must cross over armed for battle ahead of your brothers. You must help them "}],[{"type":"prose","content":"until the LORD gives your brothers a place like yours to settle and they conquer the land the LORD your God is ready to hand over to them. Then you may go back to your allotted land and occupy the land Moses the LORD’s servant assigned you east of the Jordan.”"}],[{"type":"prose","content":"They told Joshua, “We will do everything you say. We will go wherever you send us. "}],[{"type":"prose","content":"Just as we obeyed Moses, so we will obey you. But may the LORD your God be with you as he was with Moses. "}],[{"type":"prose","content":"Any man who rebels against what you say and does not obey all your commands will be executed. But be strong and brave!”"}]]