[{"num":37,"verse":"And when King Hezekiah heard it, he rent his clothes and covered himself with sackcloth and went into the house of the Lord."},{"num":2,"verse":"And he sent Eliakim, who was over the [royal] household, and Shebna the secretary, and the older priests, clothed with sackcloth, to Isaiah the prophet, the son of Amoz."},{"num":3,"verse":"And they said to him, Thus says Hezekiah: This day is a day of trouble and distress and of rebuke and of disgrace; for children have come to the birth, and there is no strength to bring them forth."},{"num":4,"verse":"It may be that the Lord your God will hear the words of the Rabshakeh, whom the king of Assyria, his master, has sent to mock, reproach, insult, and defy the living God, and will rebuke the words which the Lord your God has heard. Therefore lift up your prayer for the remnant [of His people] that is left."},{"num":5,"verse":"So the servants of King Hezekiah came to Isaiah."},{"num":6,"verse":"And Isaiah said to them, You shall say to your master, Thus says the Lord: Do not be afraid because of the words which you have heard, with which the servants of the king of Assyria have reviled and blasphemed Me."},{"num":7,"verse":"Behold, I will put a spirit in him so that he will hear a rumor and return to his own land, and I will cause him to fall by the sword in his own land."},{"num":8,"verse":"So the Rabshakeh returned and found the king of Assyria fighting against Libnah [a fortified city of Judah]; for he had heard that the king had departed from Lachish."},{"num":9,"verse":"And [Sennacherib king of Assyria] heard concerning Tirhakah king of Ethiopia, He has come forth to make war with you. And when he heard it, he sent messengers to Hezekiah, saying,"},{"num":10,"verse":"Thus shall you speak to Hezekiah king of Judah: Let not your God in Whom you trust deceive you by saying, Jerusalem shall not be given into the hand of the king of Assyria."},{"num":11,"verse":"Behold, you have heard what the kings of Assyria have done to all lands, destroying them utterly. And shall you be delivered?"},{"num":12,"verse":"Have the gods of the nations delivered those whom my predecessors have destroyed, as Gozan, Haran [of Mesopotamia], Rezeph, and the children of Eden who were in Telassar?"},{"num":13,"verse":"Where is the king of Hamath, and the king of Arpad [of northern Syria], and the king of the city of Sepharvaim, the king of Hena, or the king of Ivvah?"},{"num":14,"verse":"And Hezekiah received the letter from the hand of the messengers and read it. And Hezekiah went up to the house of the Lord and spread it before the Lord."},{"num":15,"verse":"And Hezekiah prayed to the Lord:"},{"num":16,"verse":"O Lord of hosts, God of Israel, Who [in symbol] are enthroned above the cherubim [of the ark in the temple], You are the God, You alone, of all the kingdoms of the earth. You have made heaven and earth."},{"num":17,"verse":"Incline Your ear, O Lord, and hear; open Your eyes, O Lord, and see; and hear all the words of Sennacherib which he has sent to mock, reproach, insult, and defy the living God."},{"num":18,"verse":"It is true, Lord, that the kings of Assyria have laid waste all the nations and their lands"},{"num":19,"verse":"And have cast the gods of those peoples into the fire, for they were not gods but the work of men’s hands, wood and stone. Therefore they have destroyed them."},{"num":20,"verse":"Now therefore, O Lord our God, save us from his hand, that all the kingdoms of the earth may know (understand and realize) that You are the Lord, even You only."},{"num":21,"verse":"Then Isaiah son of Amoz sent to Hezekiah, saying, Thus says the Lord, the God of Israel: Because you have prayed to Me against Sennacherib king of Assyria,"},{"num":22,"verse":"This is the word which the Lord has spoken concerning him: The Virgin Daughter of Zion has despised you and laughed you to scorn; the Daughter of Jerusalem has shaken her head behind you."},{"num":23,"verse":"Whom have you mocked and reviled [insulted and blasphemed]? And against Whom have you raised your voice and haughtily lifted your eyes? Against the Holy One of Israel!"},{"num":24,"verse":"By your servants you have mocked, reproached, insulted, and defied the Lord, and you have said, With my many chariots I have gone up to the height of the mountains, to the inner recesses of Lebanon. I cut down its tallest cedars and its choicest cypress trees; I came to its remotest height, its most luxuriant and dense forest;"},{"num":25,"verse":"I dug wells and drank foreign waters, and with the sole of my feet I have dried up all the rivers [the Nile streams] of Egypt."},{"num":26,"verse":"[But, says the God of Israel] have you not heard that I purposed to do it long ago, that I planned it in ancient times? Now I have brought it to pass, that you [king of Assyria] should [be My instrument to] lay waste fortified cities, making them ruinous heaps."},{"num":27,"verse":"Therefore their inhabitants had little power, they were dismayed and confounded; they were like the grass of the field and like the green herb, like the grass on the housetops and like a field of grain blasted before it is grown or is in stalk."},{"num":28,"verse":"But I [the Lord] know your sitting down and your going out and your coming in and your raging against Me."},{"num":29,"verse":"Because your raging against Me and your arrogance and careless ease have come to My ears, therefore will I put My hook in your nose and My bridle in your lips, and I will turn you back by the way you came."},{"num":30,"verse":"And [now, Hezekiah, says the Lord] this shall be the sign [of these things] to you: you shall eat this year what grows of itself, and in the second year that which springs from the same. And in the third year sow and reap, and plant vineyards and eat the fruit of them."},{"num":31,"verse":"And the remnant that has survived of the house of Judah shall again take root downward and bear fruit upward."},{"num":32,"verse":"For out of Jerusalem will go forth a remnant, and a band that survives out of Mount Zion. The zeal of the Lord of hosts will perform this."},{"num":33,"verse":"Therefore thus says the Lord concerning the king of Assyria: He shall not come into this city or shoot an arrow here or come before it with shield or cast up a siege mound against it."},{"num":34,"verse":"By the way that he came, by the same way he shall return, and he shall not come into this city, says the Lord."},{"num":35,"verse":"For I will defend this city to save it, for My own sake and for the sake of My servant David."},{"num":36,"verse":"And the Angel of the Lord went forth, and slew 185,000 in the camp of the Assyrians; and when [the living] arose early in the morning, behold, all these were dead bodies."},{"num":37,"verse":"So Sennacherib king of Assyria departed and returned and dwelt at Nineveh."},{"num":38,"verse":"And as he was worshiping in the house of Nisroch his god, Adrammelech and Sharezer his sons killed him with the sword, and they escaped into the land of Armenia or Ararat. And Esarhaddon his son reigned in his stead."}]