[{"num":22,"verse":"After these events, God tested and proved Abraham and said to him, Abraham! And he said, Here I am."},{"num":2,"verse":"[God] said, Take now your son, your only son Isaac, whom you love, and go to the region of Moriah; and offer him there as a burnt offering upon one of the mountains of which I will tell you."},{"num":3,"verse":"So Abraham rose early in the morning, saddled his donkey, and took two of his young men with him and his son Isaac; and he split the wood for the burnt offering, and then began the trip to the place of which God had told him."},{"num":4,"verse":"On the third day Abraham looked up and saw the place in the distance."},{"num":5,"verse":"And Abraham said to his servants, Settle down and stay here with the donkey, and I and the young man will go yonder and worship and come again to you."},{"num":6,"verse":"Then Abraham took the wood for the burnt offering and laid it on [the shoulders of] Isaac his son, and he took the fire (the firepot) in his own hand, and a knife; and the two of them went on together."},{"num":7,"verse":"And Isaac said to Abraham, My father! And he said, Here I am, my son. [Isaac] said, See, here are the fire and the wood, but where is the lamb for the burnt sacrifice?"},{"num":8,"verse":"Abraham said, My son, God Himself will provide a lamb for the burnt offering. So the two went on together."},{"num":9,"verse":"When they came to the place of which God had told him, Abraham built an altar there; then he laid the wood in order and bound Isaac his son and laid him on the altar on the wood."},{"num":10,"verse":"And Abraham stretched forth his hand and took hold of the knife to slay his son."},{"num":11,"verse":"But the Angel of the Lord called to him from heaven and said, Abraham, Abraham! He answered, Here I am."},{"num":12,"verse":"And He said, Do not lay your hand on the lad or do anything to him; for now I know that you fear and revere God, since you have not held back from Me or begrudged giving Me your son, your only son."},{"num":13,"verse":"Then Abraham looked up and glanced around, and behold, behind him was a ram caught in a thicket by his horns. And Abraham went and took the ram and offered it up for a burnt offering and an ascending sacrifice instead of his son!"},{"num":14,"verse":"So Abraham called the name of that place The Lord Will Provide. And it is said to this day, On the mount of the Lord it will be provided."},{"num":15,"verse":"The Angel of the Lord called to Abraham from heaven a second time"},{"num":16,"verse":"And said, I have sworn by Myself, says the Lord, that since you have done this and have not withheld [from Me] or begrudged [giving Me] your son, your only son,"},{"num":17,"verse":"In blessing I will bless you and in multiplying I will multiply your descendants like the stars of the heavens and like the sand on the seashore. And your Seed (Heir) will possess the gate of His enemies,"},{"num":18,"verse":"And in your Seed [Christ] shall all the nations of the earth be blessed and [by Him] bless themselves, because you have heard and obeyed My voice."},{"num":19,"verse":"So Abraham returned to his servants, and they rose up and went with him to Beersheba; there Abraham lived."},{"num":20,"verse":"Now after these things, it was told Abraham, Milcah has also borne children to your brother Nahor:"},{"num":21,"verse":"Uz the firstborn, Buz his brother, Kemuel the father of Aram,"},{"num":22,"verse":"Chesed, Hazo, Pildash, Jidlaph, and Bethuel."},{"num":23,"verse":"Bethuel became the father of Rebekah. These eight Milcah bore to Nahor, Abraham’s brother."},{"num":24,"verse":"And his concubine, whose name was Reumah, bore Tebah, Gaham, Tahash, and Maacah."}]