[{"num":22,"verse":"And after that these things were done, God assayed Abraham, and said to him, Abraham! Abraham! He answered, I am present (I am here)."},{"num":2,"verse":"God said to him, Take thine one begotten son, whom thou lovest, Isaac; and go into the land of vision, and offer thou him there into burnt sacrifice on one of the hills which I shall show to thee. (And God said to him, Take Isaac, thy only son, whom thou lovest, and go into the land of Moriah; and there thou shalt offer him as a burnt sacrifice on one of the hills which I shall show to thee.)"},{"num":3,"verse":"Therefore Abraham rose by night, and saddled his ass, and led with him two young men, and Isaac his son; and when he had hewn trees into burnt sacrifice, he went to the place which God had commanded to him. (And so Abraham rose up early in the morning, and saddled his donkey, and took with him two of his young men, and his son Isaac; and when he had cut the wood for the burnt sacrifice, he went to the place to which God had commanded him to go.)"},{"num":4,"verse":"Forsooth in the third day (And on the third day), he raised [up] his eyes, and saw a place afar (off);"},{"num":5,"verse":"and he said to his young men, Abide ye here with the ass, I and the child shall go thither; and after that we have worshipped, we shall turn again to you. (and he said to his young men, Wait ye here with the donkey, while I and the boy go over there; and after we have worshipped, we shall return to you.)"},{"num":6,"verse":"And he took the wood of burnt sacrifice, and laid (it) on Isaac his son; forsooth he bare fire, and a sword in his hands. And when they twain went together, (And he took the wood for the burnt sacrifice, and laid it on his son Isaac; and he carried the fire, and a knife in his hands. And as the two of them went together,)"},{"num":7,"verse":"Isaac said to his father, My father! And he answered, What wilt thou, (my) son? (And) He said, Lo! fire and wood, where is the beast of burnt sacrifice? (but where is the beast for the burnt sacrifice?)"},{"num":8,"verse":"Abraham said, My son, God shall purvey to him the beast of burnt sacrifice. Therefore they went together, (And Abraham said, My son, God himself shall provide the beast for the burnt sacrifice. And so they went together,)"},{"num":9,"verse":"and came to the place which God had showed to him; in which place Abraham builded an altar, and dressed [the] wood above; and when he had bound (al)together Isaac, his son (and when he had bound up his son Isaac), he laid Isaac on the altar, upon the heap of wood."},{"num":10,"verse":"And he held forth his hand, and took the sword to sacrifice his son. (And he stretched forth his hand, and took the knife to sacrifice his son.)"},{"num":11,"verse":"And lo! the angel of the Lord cried from heaven, and said, Abraham! Abraham! Which answered, I am present (I am here)."},{"num":12,"verse":"And the angel said to him, Hold thou not forth thine hand on the child, neither do thou anything (of harm) to him; now I know that thou dreadest God, and sparedest not thine one begotten son for me. (And the angel said to him, Do not thou raise thy hand against the boy, nor do thou any harm to him; for now I know that thou fearest God, for thou hast not withheld thy only son from me.)"},{"num":13,"verse":"Abraham raised [up] his eyes, and he saw behind him a ram cleaving by the horns among (the) briars, which he took, and offered (as a) burnt sacrifice for the son. (And Abraham raised up his eyes, and he saw behind him a ram caught by his horns among the briars, and he took the ram, and offered it as a burnt sacrifice in place of his son.)"},{"num":14,"verse":"And he called the name of that place The Lord seeth; wherefore it is said, till to this day, The Lord shall see in the hill. (And he called the name of that place Jehovahjireh; and so it is said, unto this day, In the hill of the Lord it shall be provided/it shall be seen.)"},{"num":15,"verse":"Forsooth the angel of the Lord called (to) Abraham the second time from heaven,"},{"num":16,"verse":"and said, The Lord saith, I have sworn by myself, for thou hast done this thing, and hast not spared thine one begotten son for me, (and said, The Lord saith, I swear by myself, because thou hast done this thing, and thou hast not withheld thy only son from me,)"},{"num":17,"verse":"I shall bless thee, and I shall multiply thy seed as the stars of heaven, and as the gravel, either sand, which is in the brink of the sea; thy seed shall wield the gates of his enemies; (I shall bless thee, and I shall multiply thy descendants like the stars of the heavens, and like the gravel, or the sand, which is at the seashore; and thy descendants shall control the gates of their enemies;)"},{"num":18,"verse":"and all the folks of [the] earth shall be blessed in thy seed (and all the nations of the earth shall pray to be blessed as thy descendants be blessed/and through thy descendants I shall bless all the nations of the earth), for thou obeyedest to my voice."},{"num":19,"verse":"Abraham turned again to his young men (And Abraham returned to his young men), and they went to Beersheba together, and he dwelled there."},{"num":20,"verse":"And so when these things were done, it was told to Abraham that also Milcah had borne sons to Nahor his brother; (And after these things were done, it was told to Abraham that Milcah had borne sons to his brother Nahor;)"},{"num":21,"verse":"Huz the first begotten (Huz the first-born), and Buz his brother, and Kemuel the father of Aram,"},{"num":22,"verse":"and Chesed, and Hazo, and Pildash, and Jidlaph, and Bethuel,"},{"num":23,"verse":"of whom Rebecca was born; Milcah childed these eight to Nahor, the brother of Abraham."},{"num":24,"verse":"Forsooth his concubine, or secondary wife, Reumah by name, childed Tebah, and Gaham, and Thahash, and Maachah."}]