[{"header":"Against Egypt"},{"num":29,"verse":"In the tenth year, on the twelfth day of the tenth month, the Lord’s word came to me:"},{"num":2,"verse":"Human one, face Pharaoh, Egypt’s king, and prophesy against him and against all of Egypt."},{"num":3,"verse":"Speak and say, The Lord God proclaims:"},{"num":7,"verse":"when they took you in hand, you would splinter and make their shoulders sore; when they leaned on you, you would break, bringing them to their knees—"},{"num":8,"verse":"now the Lord God proclaims: I’m bringing a sword against you, and I will cut off from you human and beast."},{"num":9,"verse":"The land of Egypt will be turned into a wasteland and ruins. Then they will know that I am the Lord."},{"num":10,"verse":"I’m against you and against the Nile’s canals. I will make the land of Egypt into an utter ruin, a wasteland, from Migdol to Syene and as far as its boundary with Cush."},{"num":11,"verse":"No foot, animal or human, will walk across it, and it won’t be inhabited for forty years."},{"num":12,"verse":"I will make the land of Egypt the most desolate of wastelands and its cities the most devastated of ruined cities. It will be a wasteland for forty years, and the Egyptians will be scattered among the nations and dispersed throughout the lands."},{"num":13,"verse":"The Lord God proclaims: At the end of forty years, I will gather the Egyptians from among the nations where they are scattered."},{"num":14,"verse":"I will improve their circumstances and bring them back to the land of Pathros, the land of their origin. Egypt will be a lowly kingdom there."},{"num":15,"verse":"Out of all the kingdoms, it will be the lowliest. It will never again exalt itself over the nations, and I will make it small to keep it from ruling the nations."},{"num":16,"verse":"The house of Israel will never again bring guilt on itself by faithlessly turning to Egypt for help, for they will know that I am the Lord God."},{"num":17,"verse":"In the twenty-seventh year, on the first day of the first month, the Lord’s word came to me:"},{"num":18,"verse":"Human one, Babylon’s King Nebuchadrezzar made his army labor very hard against Tyre. Every head was scraped bald, and every shoulder was rubbed raw, yet he got nothing from Tyre for himself or for his army for any of his efforts against it."},{"num":19,"verse":"So now the Lord God proclaims: I’m going to give the land of Egypt to Babylon’s King Nebuchadrezzar. He will carry off its wealth, he will plunder and loot it, and it will be the wages for his army."},{"num":20,"verse":"I will give him the land of Egypt as payment for his laboring for me. This is what the Lord God says."},{"num":21,"verse":"On that day I will give new strength to the house of Israel, and I will open your mouth among them. Then they will know that I am the Lord."}]