[{"header":"Chapter 29"},{"num":1,"verse":"Against Egypt. In the tenth year, on the twelfth day of the tenth month, this word of the Lord came to me:"},{"num":2,"verse":"Son of man set your face against Pharaoh, king of Egypt, and prophesy against him and against the whole of Egypt."},{"num":3,"verse":"Speak to him and say: Thus says the Lord:"},{"num":8,"verse":"Therefore, thus says the Lord God: I will bring a sword against you and cut off from your presence both man and animal."},{"num":9,"verse":"The land of Egypt will become a desolate waste, and the inhabitants will know that I am the Lord."},{"num":13,"verse":"However, thus says the Lord God: After forty years have passed, I will gather the Egyptians back from the peoples among whom they were scattered."},{"num":14,"verse":"I shall restore the fortunes of Egypt and resettle her people in the land of Pathros, the land of their origin, and there they will become a lowly kingdom."},{"num":15,"verse":"Egypt will be the most insignificant of kingdoms and never again will exalt itself above the nations. I will make them few in number so that it will never again rule over the nations."},{"num":16,"verse":"Egypt will no longer be a nation for the house of Israel to trust in, but will rather be for Israel a reminder of its guilt when they turned to Egypt for help. Thus they will know that I am the Lord God."},{"num":17,"verse":"Nebuchadnezzar’s Payment. In the twenty-seventh year, on the first day of the first month, this word of the Lord came to me:"},{"num":18,"verse":"Son of man, Nebuchadnezzar, the king of Babylon, has led his army in an exhausting campaign against Tyre. Everyone’s head was rubbed bare and the skin of every shoulder was raw, yet neither he nor his army derived any profit from the campaign he led against Tyre."},{"num":19,"verse":"Therefore, thus says the Lord God: I now intend to hand over the land of Egypt to Nebuchadnezzar, the king of Babylon. He shall carry off its wealth, despoil and plunder it, and amass the wages for his army."},{"num":20,"verse":"As regards payment for his toil, I have given him the land of Egypt because he and his army did it for me, says the Lord God."},{"num":21,"verse":"On that day, I will make a horn sprout up for the house of Israel, and I will empower you to speak out in their midst. Then they will know that I am the Lord."}]