[{"num":5,"verse":"Therefore, imitate God like dearly loved children."},{"num":2,"verse":"Live your life with love, following the example of Christ, who loved us and gave himself for us. He was a sacrificial offering that smelled sweet to God."},{"num":3,"verse":"Sexual immorality, and any kind of impurity or greed, shouldn’t even be mentioned among you, which is right for holy persons."},{"num":4,"verse":"Obscene language, silly talk, or vulgar jokes aren’t acceptable for believers. Instead, there should be thanksgiving."},{"num":5,"verse":"Because you know for sure that persons who are sexually immoral, impure, or greedy—which happens when things become gods—those persons won’t inherit the kingdom of Christ and God."},{"header":"Be children of light"},{"num":6,"verse":"Nobody should deceive you with stupid ideas. God’s anger comes down on those who are disobedient because of this kind of thing."},{"num":7,"verse":"So you shouldn’t have anything to do with them."},{"num":8,"verse":"You were once darkness, but now you are light in the Lord, so live your life as children of light."},{"num":9,"verse":"Light produces fruit that consists of every sort of goodness, justice, and truth."},{"num":10,"verse":"Therefore, test everything to see what’s pleasing to the Lord,"},{"num":11,"verse":"and don’t participate in the unfruitful actions of darkness. Instead, you should reveal the truth about them."},{"num":12,"verse":"It’s embarrassing to even talk about what certain persons do in secret."},{"num":13,"verse":"But everything exposed to the light is revealed by the light."},{"num":14,"verse":"Everything that is revealed by the light is light. Therefore, it says, Wake up, sleeper! Get up from the dead, and Christ will shine on you."},{"header":"Be filled with the Spirit"},{"num":15,"verse":"So be careful to live your life wisely, not foolishly."},{"num":16,"verse":"Take advantage of every opportunity because these are evil times."},{"num":17,"verse":"Because of this, don’t be ignorant, but understand the Lord’s will."},{"num":18,"verse":"Don’t get drunk on wine, which produces depravity. Instead, be filled with the Spirit in the following ways:"},{"num":19,"verse":"speak to each other with psalms, hymns, and spiritual songs; sing and make music to the Lord in your hearts;"},{"num":20,"verse":"always give thanks to God the Father for everything in the name of our Lord Jesus Christ;"},{"num":21,"verse":"and submit to each other out of respect for Christ."},{"num":22,"verse":"For example, wives should submit to their husbands as if to the Lord."},{"num":23,"verse":"A husband is the head of his wife like Christ is head of the church, that is, the savior of the body."},{"num":24,"verse":"So wives submit to their husbands in everything like the church submits to Christ."},{"num":25,"verse":"As for husbands, love your wives just like Christ loved the church and gave himself for her."},{"num":26,"verse":"He did this to make her holy by washing her in a bath of water with the word."},{"num":27,"verse":"He did this to present himself with a splendid church, one without any sort of stain or wrinkle on her clothes, but rather one that is holy and blameless."},{"num":28,"verse":"That’s how husbands ought to love their wives—in the same way as they do their own bodies. Anyone who loves his wife loves himself."},{"num":29,"verse":"No one ever hates his own body, but feeds it and takes care of it just like Christ does for the church"},{"num":30,"verse":"because we are parts of his body."},{"num":31,"verse":"This is why a man will leave his father and mother and be united with his wife, and the two of them will be one body."},{"num":32,"verse":"Marriage is a significant allegory, and I’m applying it to Christ and the church."},{"num":33,"verse":"In any case, as for you individually, each one of you should love his wife as himself, and wives should respect their husbands."}]