[{"header":"Live in Love"},{"num":5,"verse":"Therefore, be imitators of God as dearly loved children "},{"num":2,"verse":"and live in love, just as Christ also loved us and gave himself for us, a sacrificial and fragrant offering to God. "},{"num":3,"verse":"But among you there must not be either sexual immorality, impurity of any kind, or greed, as these are not fitting for the saints. "},{"num":4,"verse":"Neither should there be vulgar speech, foolish talk, or coarse jesting—all of which are out of character—but rather thanksgiving. "},{"num":5,"verse":"For you can be confident of this one thing: that no person who is immoral, impure, or greedy (such a person is an idolater) has any inheritance in the kingdom of Christ and God."},{"header":"Live in the Light"},{"num":6,"verse":"Let nobody deceive you with empty words, for because of these things God’s wrath comes on the sons of disobedience. "},{"num":7,"verse":"Therefore do not be sharers with them, "},{"num":8,"verse":"for you were at one time darkness, but now you are light in the Lord. Live like children of light—"},{"num":9,"verse":"for the fruit of the light consists in all goodness, righteousness, and truth—"},{"num":10,"verse":"trying to learn what is pleasing to the Lord. "},{"num":11,"verse":"Do not participate in the unfruitful deeds of darkness, but rather expose them. "},{"num":12,"verse":"For the things they do in secret are shameful even to mention. "},{"num":13,"verse":"But all things being exposed by the light are made visible. "},{"num":14,"verse":"For everything made visible is light, and for this reason it says:"},{"header":"Live Wisely"},{"num":15,"verse":"Therefore consider carefully how you live—not as unwise but as wise, "},{"num":16,"verse":"taking advantage of every opportunity, because the days are evil. "},{"num":17,"verse":"For this reason do not be foolish, but be wise by understanding what the Lord’s will is. "},{"num":18,"verse":"And do not get drunk with wine, which is debauchery, but be filled by the Spirit, "},{"num":19,"verse":"speaking to one another in psalms, hymns, and spiritual songs, singing and making music in your hearts to the Lord, "},{"num":20,"verse":"always giving thanks to God the Father for all things in the name of our Lord Jesus Christ, "},{"num":21,"verse":"and submitting to one another out of reverence for Christ."},{"header":"Exhortations to Households"},{"num":22,"verse":" Wives, submit to your husbands as to the Lord, "},{"num":23,"verse":"because the husband is the head of the wife as also Christ is the head of the church (he himself being the savior of the body). "},{"num":24,"verse":"But as the church submits to Christ, so also wives should submit to their husbands in everything. "},{"num":25,"verse":"Husbands, love your wives just as Christ loved the church and gave himself for her "},{"num":26,"verse":"to sanctify her by cleansing her with the washing of the water by the word, "},{"num":27,"verse":"so that he may present the church to himself as glorious—not having a stain or wrinkle, or any such blemish, but holy and blameless. "},{"num":28,"verse":"In the same way husbands ought to love their wives as their own bodies. He who loves his wife loves himself. "},{"num":29,"verse":"For no one has ever hated his own body, but he feeds it and takes care of it, just as Christ also does the church, "},{"num":30,"verse":"because we are members of his body. "},{"num":31,"verse":"For this reason a man will leave his father and mother and will be joined to his wife, and the two will become one flesh. "},{"num":32,"verse":"This mystery is great—but I am actually speaking with reference to Christ and the church. "},{"num":33,"verse":"Nevertheless, each one of you must also love his own wife as he loves himself, and the wife must respect her husband."}]