[{"num":5,"verse":"Be followers of God as dear children, "},{"num":2,"verse":"and walk in love, even as Christ loved us and gave himself for us, an offering and a sacrifice of a sweet savour to God."},{"num":3,"verse":"As for fornication and all uncleanness or covetousness, let them not be once named among you, as it becomes saints. "},{"num":4,"verse":"Nor should there be coarseness, or foolish talking, or jestings which are not fitting, but rather giving of thanks. "},{"num":5,"verse":"For this you know, that no whoremonger or unclean person, or covetous person (who is an idolater), has any inheritance in the kingdom of Christ and of God."},{"num":6,"verse":"Let no person deceive you with vain words. For through such things comes the wrath of God upon the children of unbelief. "},{"num":7,"verse":"Therefore do not be companions with them. "},{"num":8,"verse":"You were once darkness, but are now light in the Lord. Walk as children of light. "},{"num":9,"verse":"For the fruit of the Spirit is in all goodness, righteousness, and truth.  "},{"num":10,"verse":"Accept that which is pleasing to the Lord, "},{"num":11,"verse":"and have no fellowship with the unfruitful works of darkness, but rather rebuke them. "},{"num":12,"verse":"For it is shameful even to name those things that are done by them in secret. "},{"num":13,"verse":"But all things, when they are rebuked by the light, are manifest. For whatsoever is manifest, that same is light. "},{"num":14,"verse":"Therefore he says, Awake, you who sleep, and stand up from death, and Christ will give you light."},{"num":15,"verse":"Take heed therefore that you walk circumspectly – not as fools, but as wise, "},{"num":16,"verse":"redeeming the time. For the days are evil. "},{"num":17,"verse":"Therefore be not unwise, but understand what the will of the Lord is. "},{"num":18,"verse":"And be not drunk with wine, wherein is excess, but be fulfilled with the Spirit, "},{"num":19,"verse":"speaking to yourselves in psalms and hymns and spiritual songs, singing and making melody to the Lord in your hearts, "},{"num":20,"verse":"giving thanks always for all things to God the Father in the name of our Lord Jesus Christ, "},{"num":21,"verse":"and submitting yourselves to one another in the fear of God."},{"num":22,"verse":"Women, submit yourselves to your own husbands, as to the Lord. "},{"num":23,"verse":"For the husband is the head of the wife, even as Christ is the head of the congregation, and he is the saviour of the body. "},{"num":24,"verse":"Therefore as the congregation is subject to Christ, so also let the wives be subject to their husbands in all things."},{"num":25,"verse":"Husbands, love your wives, even as Christ loved the congregation and gave himself for it "},{"num":26,"verse":"to sanctify it, and cleansed it in the fountain of water through the word, "},{"num":27,"verse":"to make it for himself a glorious congregation, without spot or wrinkle or any such thing, but to be holy and without blame. "},{"num":28,"verse":"This is how men ought to love their wives: as their own bodies."},{"num":29,"verse":"For no man ever yet hated his own flesh, but cares for and cherishes it, even as the Lord does the congregation. "},{"num":30,"verse":"For we are members of his body, of his flesh and of his bones. "},{"num":31,"verse":"On this account must a man leave father and mother and continue with his wife, and the two will be made one flesh. "},{"num":32,"verse":"This is a great mystery, but I speak as between Christ and the congregation. "},{"num":33,"verse":"Nevertheless, see to it that every one of you loves his wife truly, even as himself. And let the wife see that she fears her husband."}]