[{"num":5,"verse":"Become, then, followers of God, as children beloved,"},{"num":2,"verse":"and walk in love, as also the Christ did love us, and did give himself for us, an offering and a sacrifice to God for an odour of a sweet smell,"},{"num":3,"verse":"and whoredom, and all uncleanness, or covetousness, let it not even be named among you, as becometh saints;"},{"num":4,"verse":"also filthiness, and foolish talking, or jesting, -- the things not fit -- but rather thanksgiving;"},{"num":5,"verse":"for this ye know, that every whoremonger, or unclean, or covetous person, who is an idolater, hath no inheritance in the reign of the Christ and God."},{"num":6,"verse":"Let no one deceive you with vain words, for because of these things cometh the anger of God upon the sons of the disobedience,"},{"num":7,"verse":"become not, then, partakers with them,"},{"num":8,"verse":"for ye were once darkness, and now light in the Lord; as children of light walk ye,"},{"num":9,"verse":"for the fruit of the Spirit [is] in all goodness, and righteousness, and truth,"},{"num":10,"verse":"proving what is well-pleasing to the Lord,"},{"num":11,"verse":"and have no fellowship with the unfruitful works of the darkness and rather even convict,"},{"num":12,"verse":"for the things in secret done by them it is a shame even to speak of,"},{"num":13,"verse":"and all the things reproved by the light are manifested, for everything that is manifested is light;"},{"num":14,"verse":"wherefore he saith, `Arouse thyself, thou who art sleeping, and arise out of the dead, and the Christ shall shine upon thee.'"},{"num":15,"verse":"See, then, how exactly ye walk, not as unwise, but as wise,"},{"num":16,"verse":"redeeming the time, because the days are evil;"},{"num":17,"verse":"because of this become not fools, but -- understanding what [is] the will of the Lord,"},{"num":18,"verse":"and be not drunk with wine, in which is dissoluteness, but be filled in the Spirit,"},{"num":19,"verse":"speaking to yourselves in psalms and hymns and spiritual songs, singing and making melody in your heart to the Lord,"},{"num":20,"verse":"giving thanks always for all things, in the name of our Lord Jesus Christ, to the God and Father;"},{"num":21,"verse":"subjecting yourselves to one another in the fear of God."},{"num":22,"verse":"The wives! to your own husbands subject yourselves, as to the Lord,"},{"num":23,"verse":"because the husband is head of the wife, as also the Christ [is] head of the assembly, and he is saviour of the body,"},{"num":24,"verse":"but even as the assembly is subject to Christ, so also [are] the wives to their own husbands in everything."},{"num":25,"verse":"The husbands! love your own wives, as also the Christ did love the assembly, and did give himself for it,"},{"num":26,"verse":"that he might sanctify it, having cleansed [it] with the bathing of the water in the saying,"},{"num":27,"verse":"that he might present it to himself the assembly in glory, not having spot or wrinkle, or any of such things, but that it may be holy and unblemished;"},{"num":28,"verse":"so ought the husbands to love their own wives as their own bodies: he who is loving his own wife -- himself he doth love;"},{"num":29,"verse":"for no one ever his own flesh did hate, but doth nourish and cherish it, as also the Lord -- the assembly,"},{"num":30,"verse":"because members we are of his body, of his flesh, and of his bones;"},{"num":31,"verse":"`for this cause shall a man leave his father and mother, and shall be joined to his wife, and they shall be -- the two -- for one flesh;'"},{"num":32,"verse":"this secret is great, and I speak in regard to Christ and to the assembly;"},{"num":33,"verse":"but ye also, every one in particular -- let each his own wife so love as himself, and the wife -- that she may reverence the husband."}]