[{"header":"The ancestry of Jesus Christ"},{"num":1,"verse":"This is the record of the ancestry of Jesus Christ who was the descendant of both David and Abraham: Abraham was the father of Isaac, who was the father of Jacob, who was the father of Judah and his brothers, who was the father of Perez and Zerah (whose mother was Tamar). Perez was the father of Hezron, who was the father of Ram, who was the father of Amminadab, who was the father of Nahshon, who was the father of Salmon, who was the father of Boaz (whose mother was Rahab). Boaz was the father of Obed (whose mother was Ruth), and Obed was the father of Jesse, who was the father of King David, who was the father of Solomon (whose mother was Uriah’s wife). Solomon was the father of Rehoboam, who was the father of Abijah, who was the father of Asa, who was the father of Jehoshaphat, who was the father of Joram, who was the father of Uzziah, who was the father of Jotham, who was the father of Ahaz, who was the father of Hezekiah, who was the father of Manasseh, who was the father of Amon, who was the father of Josiah, who was the father of Jechoniah and his brothers, at the time of the deportation to Babylon."},{"num":12,"verse":"After the Babylonian exile Jechoniah was the father of Shealtiel, who was the father of Zerubbabel, who was the father of Abiud, who was the father of Eliakim, who was the father of Azor, who was the father of Sadoc, who was the father of Achim, who was the father of Eliud, who was the father of Eleazar, who was the father of Matthan, who was the father of Jacob, who was the father of Joseph, who was the husband of Mary, the mother of Jesus Christ."},{"num":17,"verse":"The genealogy of Jesus Christ may thus be traced for fourteen generations from Abraham to David, fourteen from David to the deportation to Babylon, and fourteen from the deportation to Christ himself."},{"header":"His birth in human history"},{"num":18,"verse":"The birth of Jesus Christ happened like this. When Mary was engaged to Joseph, just before their marriage, she was discovered to be pregnant—by the Holy Spirit. Whereupon Joseph, her future husband, who was a good man and did not want to see her disgraced, planned to break off the engagement quietly. But while he was turning the matter over in his mind an angel of the Lord appeared to him in a dream and said, “Joseph, son of David, do not be afraid to take Mary as your wife! What she has conceived is conceived through the Holy Spirit, and she will give birth to a son, whom you will call Jesus (‘the Saviour’) for it is he who will save his people from their sins.”"},{"num":22,"verse":"All this happened to fulfil what the Lord had said through the prophet—‘Behold, a virgin shall be with child, and bear a son, and they shall call his name Immanuel’. (“Immanuel” means “God with us.”)"},{"num":24,"verse":"When Joseph woke up he did what the angel had told him. He married Mary, but had no intercourse with her until she had given birth to a son. Then he gave him the name Jesus."}]