[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Ecclesiastes 12:8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ecclesiastes 12:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Vanity of vanities ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— This sentence, wherewith he began this book, he here repeats in the end of it, as that which he had proved in all the foregoing discourse, and that which naturally followed from both the branches of the assertion laid down, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ecclesiastes 12:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12:8-14 Solomon repeats his text, VANITY OF VANITIES, ALL IS VANITY. These are the words of one that could speak by dear-bought experience of the vanity of the world, which can do nothing to ease men of the burden of sin. As he considered the worth of souls, he gave good heed to what he spake and wrote; words of truth will always be acceptable words. The truths of God are as goads to such as are dull and draw back, and nails to such as are wandering and draw aside; means to establish the heart, that we may never sit loose to our duty, nor be taken from it. The Shepherd of Israel is the Giver of inspired wisdom. Teachers and guides all receive their communications from him. The title is applied in Scripture to the Lord Jesus Christ, the Son of God. The prophets sought diligently, what, or what manner of time, the Spirit of Christ in them did signify, when it testified beforehand the sufferings of Christ, and the glory that should follow. To write many books was not suited to the shortness of human life, and would be weariness to the writer, and to the reader; and then was much more so to both than it is now. All things would be vanity and vexation, except they led to this conclusion, That to fear God, and keep his commandments, is the whole of man. The fear of God includes in it all the affections of the soul towards him, which are produced by the Holy Spirit. There may be terror where there is no love, nay, where there is hatred. But this is different from the gracious fear of God, as the feelings of an affectionate child. The fear of God, is often put for the whole of true religion in the heart, and includes its practical results in the life. Let us attend to the one thing needful, and now come to him as a merciful Saviour, who will soon come as an almighty Judge, when he will bring to light the things of darkness, and manifest the counsels of all hearts. Why does God record in his word, that ALL IS VANITY, but to keep us from deceiving ourselves to our ruin? He makes our duty to be our interest. May it be graven in all our hearts. Fear God, and keep his commandments, for this is all that concerns man.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "This passage is properly regarded as the Epilogue of the whole book; a kind of apology for the obscurity of many of its sayings. The passage serves therefore to make the book more intelligible and more acceptable.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Here, as in the beginning of the book Ecclesiastes 1:1-2, the Preacher speaks of himself Ecclesiastes 12:8-10 in the third person. He first repeats Ecclesiastes 12:8 the mournful, perplexing theme with which his musings began Ecclesiastes 1:2; and then states the encouraging practical conclusion Ecclesiastes 12:13-14 to which they have led him. It has been pointed out that the Epilogue assumes the identity of the Preacher with the writer of the Book of Proverbs.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Here, as in the beginning of the book ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ecclesiastes 1:1-2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the Preacher speaks of himself ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ecclesiastes 12:8-10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " in the third person. He first repeats ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ecclesiastes 12:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the mournful, perplexing theme with which his musings began ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ecclesiastes 1:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and then states the encouraging practical conclusion ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ecclesiastes 12:13-14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " to which they have led him. It has been pointed out that the Epilogue assumes the identity of the Preacher with the writer of the Book of Proverbs.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8-12. A summary of the first part.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Vanity, &c.—Resumption of the sentiment with which the book began (Ec 1:2; 1Jo 2:17).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " This sentence, wherewith he began this book, he here repeateth in the end of it partly as that which he had proved in all the foregoing discourse, and partly as that which naturally and necessarily followed from both the branches of the assertion now laid down, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ecclesiastes 12:7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ecclesiastes 12:7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Vanity of vanities, saith the preacher,.... The wise man, or preacher, set out in the beginning of the book with this doctrine, or proposition, which he undertook to prove; and now having proved it by an induction of particulars, instanced in the wisdom, wealth, honours, pleasures, and profit of men, and shown the vanity of them, and that the happiness of men lies not in these things, but in the knowledge and fear of God; he repeats it, and most strongly asserts it, as an undoubted truth beyond all dispute and contradiction, that all things under the sun are not only vain, but vanity itself, extremely vain, vain in the superlative degree; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "all is vanity; all things in the world are vain; all creatures are subject to vanity; man in every state, and in his best estate, is altogether vanity: this the wise man might with great confidence affirm, after he had shown that not only childhood and youth are vanity, but even old age; the infirmities, sorrows, and distresses of which he had just exposed, and observed that all issue in death, the last end of man, when his body returns to the earth, and his soul to God the giver of it. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "all is vanity; all things in the world are vain; all creatures are subject to vanity; man in every state, and in his best estate, is altogether vanity: this the wise man might with great confidence affirm, after he had shown that not only childhood and youth are vanity, but even old age; the infirmities, sorrows, and distresses of which he had just exposed, and observed that all issue in death, the last end of man, when his body returns to the earth, and his soul to God the giver of it. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Vanity of vanities, saith the preacher; all is vanity.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Vanity of vanities, saith the preacher; all is vanity",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The recurrence at the close of the book, and after words which, taken as we have taken them, suggest a nobler view of life, of the same sad burden with which it opened, has a strange melancholy ring in it. To those who see in the preceding verse nothing more than the materialist’s thoughts of death as echoed by Epicurean poets, it seems a confirmation of what they have read into it, or inferred from it. The ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Debater",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " seems to them, looking on life from the closing scene of death, to fall back into a hopeless pessimism. It may be rightly answered however that the view that all that belongs to the earthly life is “vanity of vanities” is one not only compatible with the recognition of the higher life, with all its infinite possibilities, which opens before man at death, but is the natural outcome of that recognition as at the hour of death, or during the process of decay which precedes and anticipates death. The “things that are seen and are temporal” are dwarfed, as into an infinite littleness, in the presence of those which are “not seen and are eternal” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Corinthians 4:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). And there would be, we may add, even a singular impressiveness in the utterance of the same judgment, at the close of the great argument, and from the higher standpoint of faith which the ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Debater",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " had at last reached, as that with which he had started in his despondent scepticism. It is, in this light, not without significance that these very words form the opening sentence of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "De Imitatione Christi",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of à Kempis.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "There remain, however, two previous questions to be discussed. (1) Are the words before us the conclusion of the main body of the treatise, or the beginning of what we may call its epilogue? and (2) is that epilogue the work of the author of the book or an addition by some later hand? The paragraph printing of the Authorised Version points in the case of (1) to the latter of the two conclusions, and it may be noted as confirming this view that the words occur in their full form at the beginning of the whole book, and might therefore reasonably be expected at the beginning of that which is, as it were, its summing-up and completion. In regard to the second question, the contents of the epilogue tend, it is believed, to the conclusion that they occupy a position analogous to that of the close of St John’s Gospel (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 21:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") and are, as it were, of the nature of a commendatory attestation. It would scarcely be natural for a writer to end with words of self-praise like those of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ecclesiastes 12:9-10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The directly didactic form of the Teacher addressing his reader as “my Son” after the fashion of the Book of Proverbs (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ecclesiastes 1:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ecclesiastes 2:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ecclesiastes 3:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ecclesiastes 3:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ecclesiastes 3:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") has no parallel in the rest of the book. The tone of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ecclesiastes 12:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is rather that of one who takes a survey of the book as one of the many forms of wisdom, each of which had its place in the education of mankind, than of the thinker who speaks of what he himself has contributed to that store. On the whole, then, there seems sufficient reason for resting in the conclusion adopted by many commentators that the book itself ended with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ecclesiastes 12:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and that we have in what follows, an epilogue addressed to the reader; justifying its admission into the Canon of Scripture and pointing out to him what, in the midst of apparent perplexities and inconsistencies, was the true moral of its preaching. The circumstances which were connected with that admission (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Introduction",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", chs. ii., iii., iv.) may well have made such a justification appear desirable.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 8.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - It has been much questioned whether this verse is the conclusion of the treatise or the commencement of the epilogue. For the latter conclusion it is contended that it is only natural that the beginning of the final summing-up should start with the same words as the opening of the book (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ecclesiastes 1:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); and that thus the conjunction \"and,\" with which ver. 9 begins, is readily explained. But the treatise is more artistically completed by regarding this solemn utterance as the conclusion of the whole, ending with the same burden with which it began - the nothingness of earthly things. Koheleth has labored to show this, he has pursued the thought from beginning to end, through all circumstances and conditions, and he can only re-echo his melancholy refrain. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Vanity of vanities, saith the Preacher.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " He does not follow the destiny of the immortal spirit; it is not his purpose to do so; his theme is the fragility of mortal things, their unsatisfying nature, the impossibility of their securing man's happiness: so his voyage lands him at the point whence he set forth, though he has learned and taught faith in the interval. If all is vanity, there is behind and above all a God of inflexible justice, who must do right, and to whom we may safely trust our cares and perplexities. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Koheleth,\" Preacher",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",\" here has the article, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "the Koheleth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as if some special reference was made to the meaning of the name - he who has been debating, or haranguing, or gathering together, utters finally his careful verdict. This is the sentence of the ideal Solomon, who has given his experiences in the preceding pages. Ecclesiastes 12:8",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "\"O vanity of vanities, saith Koheleth, all is vain.\" If we here look back to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ecclesiastes 12:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", that which is there said of the spirit can be no consolation. With right, Hofmann in his Schriftbeweis, I 490, says: \"That it is the personal spirit of a man which returns to God; and that it returns to God without losing its consciousness, is an idea foreign to this proverb.\" Also, Psychol. p. 410, it is willingly conceded that the author wished here to express, first, only the fact, in itself comfortless, that the component parts of the human body return whence they came. But the comfortless averse of the proverb is yet not without a consoling reverse. For what the author, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ecclesiastes 3:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", represents as an unsettled possibility, that the spirit of a dying man does not downwards like that of a beast, but upwards, he here affirms as an actual truth.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: In the Rig-Veda that which is immortal in man is called manas; the later language calls it âtman; vid., Muir in the Asiatic Journal, 1865, p. 305.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "From this, that he thus finally decides the question as an advantage to a man above a beast, it follows of necessity that the return of the spirit to God cannot be thought of as a resumption of the spirit into the essence of God (resorption or emanation), as the cessation of his independent existence, although, as also at Job 34:14; Psalm 104:29, the nearest object of the expression is directed to the ruin of the soul-corporeal life of man which directly follows the return of the spirit to God. The same conclusion arises from this, that the idea of the return of the spirit to God, in which the author at last finds rest, cannot yet stand in a subordinate place with reference to the idea of Hades, above which it raises itself; with the latter the spirit remains indestructible, although it has sunk into a silent, inactive life. And in the third place, that conclusion flows from the fact that the author is forced by the present contradiction between human experience and the righteousness of God to the postulate of a judgment finally settling these contradictions, Ecclesiastes 3:17; Ecclesiastes 11:9, cf. Ecclesiastes 12:14, whence it immediately follows that the continued existence of the spirit is thought of as a well-known truth (Psychol. p. 127). The Targ. translates, not against the spirit of the book: \"the spirit will return to stand in judgment before God, who gave it to thee.\" In this connection of thoughts Koheleth says more than what Lucretius says (ii. 998 ss.):",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "From this, that he thus finally decides the question as an advantage to a man above a beast, it follows of necessity that the return of the spirit to God cannot be thought of as a resumption of the spirit into the essence of God (resorption or emanation), as the cessation of his independent existence, although, as also at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 34:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 104:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the nearest object of the expression is directed to the ruin of the soul-corporeal life of man which directly follows the return of the spirit to God. The same conclusion arises from this, that the idea of the return of the spirit to God, in which the author at last finds rest, cannot yet stand in a subordinate place with reference to the idea of Hades, above which it raises itself; with the latter the spirit remains indestructible, although it has sunk into a silent, inactive life. And in the third place, that conclusion flows from the fact that the author is forced by the present contradiction between human experience and the righteousness of God to the postulate of a judgment finally settling these contradictions, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ecclesiastes 3:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ecclesiastes 11:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ecclesiastes 12:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", whence it immediately follows that the continued existence of the spirit is thought of as a well-known truth (Psychol. p. 127). The Targ. translates, not against the spirit of the book: \"the spirit will return to stand in judgment before God, who gave it to thee.\" In this connection of thoughts Koheleth says more than what Lucretius says (ii. 998 ss.):",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Cedit item retro, de terra quod fuit ante,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In terras, et quod missum est ex aetheris oris",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Id rursum caeli rellatum templa receptant.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "A comforting thought lies in the words נתנהּ אשׁר. The gifts of God are on His side ἀμεταμέλητα (Romans 11:29). When He receives back that which was given, He receives it back to restore it again in another manner. Such thoughts connect themselves with the reference to God the Giv. Meanwhile the author next aims at showing the vanity of man, viz., of man as living here. Body and spirit are separated, and depart each in its own direction. Not only the world and the labours by which man is encompassed are \"vain,\" and not only is that which man has and does and experiences \"vain,\" but also man himself as such is vain, and thus - this is the facit - all is הבל, \"vain.\" ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "A comforting thought lies in the words נתנהּ אשׁר. The gifts of God are on His side ἀμεταμέλητα (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 11:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). When He receives back that which was given, He receives it back to restore it again in another manner. Such thoughts connect themselves with the reference to God the Giv. Meanwhile the author next aims at showing the vanity of man, viz., of man as living here. Body and spirit are separated, and depart each in its own direction. Not only the world and the labours by which man is encompassed are \"vain,\" and not only is that which man has and does and experiences \"vain,\" but also man himself as such is vain, and thus - this is the facit - all is הבל, \"vain.\" ",
            "children": []
          }
        ]
      }
    ]
  }
]