[{"num":31,"verse":"Lord, I trust in you alone. Don’t let my enemies defeat me. Rescue me because you are the God who always does what is right. "},{"num":2,"verse":"Answer quickly when I cry to you; bend low and hear my whispered plea. Be for me a great Rock of safety from my foes. "},{"num":3,"verse":"Yes, you are my Rock and my fortress; honor your name by leading me out of this peril. "},{"num":4,"verse":"Pull me from the trap my enemies have set for me. For you alone are strong enough. "},{"num":5,"verse":"Into your hand I commit my spirit."},{"num":7,"verse":"I am radiant with joy because of your mercy, for you have listened to my troubles and have seen the crisis in my soul. "},{"num":8,"verse":"You have not handed me over to my enemy but have given me open ground in which to maneuver."},{"num":9,"verse":"O Lord, have mercy on me in my anguish. My eyes are red from weeping; my health is broken from sorrow. I am pining away with grief; my years are shortened, drained away because of sadness. My sins have sapped my strength; I stoop with sorrow and with shame. "},{"num":11,"verse":"I am scorned by all my enemies and even more by my neighbors and friends. They dread meeting me and look the other way when I go by. "},{"num":12,"verse":"I am forgotten like a dead man, like a broken and discarded pot. "},{"num":13,"verse":"I heard the lies about me, the slanders of my enemies. Everywhere I looked I was afraid, for they were plotting against my life."},{"num":14,"verse":"But I am trusting you, O Lord. I said, “You alone are my God; my times are in your hands. Rescue me from those who hunt me down relentlessly. "},{"num":16,"verse":"Let your favor shine again upon your servant; save me just because you are so kind! "},{"num":17,"verse":"Don’t disgrace me, Lord, by not replying when I call to you for aid. But let the wicked be shamed by what they trust in; let them lie silently in their graves, "},{"num":18,"verse":"their lying lips quieted at last—the lips of these arrogant men who are accusing honest men of evil deeds.”"},{"num":19,"verse":"Oh, how great is your goodness to those who publicly declare that you will rescue them. For you have stored up great blessings for those who trust and reverence you."},{"num":20,"verse":"Hide your loved ones in the shelter of your presence, safe beneath your hand, safe from all conspiring men. "},{"num":21,"verse":"Blessed is the Lord, for he has shown me that his never-failing love protects me like the walls of a fort! "},{"num":22,"verse":"I spoke too hastily when I said, “The Lord has deserted me,” for you listened to my plea and answered me."},{"num":23,"verse":"Oh, love the Lord, all of you who are his people; for the Lord protects those who are loyal to him, but harshly punishes all who haughtily reject him. "},{"num":24,"verse":"So cheer up! Take courage if you are depending on the Lord."}]