[{"header":"God’s Judgements Justified"},{"num":14,"verse":"Certain elders of Israel came to me and sat down before me. "},{"num":2,"verse":"And the word of the Lord came to me: "},{"num":3,"verse":"Mortal, these men have taken their idols into their hearts, and placed their iniquity as a stumbling-block before them; shall I let myself be consulted by them? "},{"num":4,"verse":"Therefore speak to them, and say to them, Thus says the Lord God: Any of those of the house of Israel who take their idols into their hearts and place their iniquity as a stumbling-block before them, and yet come to the prophet—I the Lord will answer those who come with the multitude of their idols, "},{"num":5,"verse":"in order that I may take hold of the hearts of the house of Israel, all of whom are estranged from me through their idols."},{"num":6,"verse":"Therefore say to the house of Israel, Thus says the Lord God: Repent and turn away from your idols; and turn away your faces from all your abominations. "},{"num":7,"verse":"For any of those of the house of Israel, or of the aliens who reside in Israel, who separate themselves from me, taking their idols into their hearts and placing their iniquity as a stumbling-block before them, and yet come to a prophet to inquire of me by him, I the Lord will answer them myself. "},{"num":8,"verse":"I will set my face against them; I will make them a sign and a byword and cut them off from the midst of my people; and you shall know that I am the Lord."},{"num":9,"verse":"If a prophet is deceived and speaks a word, I, the Lord, have deceived that prophet, and I will stretch out my hand against him, and will destroy him from the midst of my people Israel. "},{"num":10,"verse":"And they shall bear their punishment—the punishment of the inquirer and the punishment of the prophet shall be the same— "},{"num":11,"verse":"so that the house of Israel may no longer go astray from me, nor defile themselves any more with all their transgressions. Then they shall be my people, and I will be their God, says the Lord God."},{"num":12,"verse":"The word of the Lord came to me: "},{"num":13,"verse":"Mortal, when a land sins against me by acting faithlessly, and I stretch out my hand against it, and break its staff of bread and send famine upon it, and cut off from it human beings and animals, "},{"num":14,"verse":"even if Noah, Daniel, and Job, these three, were in it, they would save only their own lives by their righteousness, says the Lord God. "},{"num":15,"verse":"If I send wild animals through the land to ravage it, so that it is made desolate, and no one may pass through because of the animals; "},{"num":16,"verse":"even if these three men were in it, as I live, says the Lord God, they would save neither sons nor daughters; they alone would be saved, but the land would be desolate. "},{"num":17,"verse":"Or if I bring a sword upon that land and say, ‘Let a sword pass through the land’, and I cut off human beings and animals from it; "},{"num":18,"verse":"though these three men were in it, as I live, says the Lord God, they would save neither sons nor daughters, but they alone would be saved. "},{"num":19,"verse":"Or if I send a pestilence into that land, and pour out my wrath upon it with blood, to cut off humans and animals from it; "},{"num":20,"verse":"even if Noah, Daniel, and Job were in it, as I live, says the Lord God, they would save neither son nor daughter; they would save only their own lives by their righteousness."},{"num":21,"verse":"For thus says the Lord God: How much more when I send upon Jerusalem my four deadly acts of judgement, sword, famine, wild animals, and pestilence, to cut off humans and animals from it! "},{"num":22,"verse":"Yet, survivors shall be left in it, sons and daughters who will be brought out; they will come out to you. When you see their ways and their deeds, you will be consoled for the evil that I have brought upon Jerusalem, for all that I have brought upon it. "},{"num":23,"verse":"They shall console you, when you see their ways and their deeds; and you shall know that it was not without cause that I did all that I have done in it, says the Lord God."}]