[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(8) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Shall see me no more.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—That is, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thine own eyes shall look for me, but I shall be no more. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "So LXX. and Vulg.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "7:7-16 Plain truths as to the shortness and vanity of man's life, and the certainty of death, do us good, when we think and speak of them with application to ourselves. Dying is done but once, and therefore it had need be well done. An error here is past retrieve. Other clouds arise, but the same cloud never returns: so a new generation of men is raised up, but the former generation vanishes away. Glorified saints shall return no more to the cares and sorrows of their houses; nor condemned sinners to the gaieties and pleasures of their houses. It concerns us to secure a better place when we die. From these reasons Job might have drawn a better conclusion than this, I will complain. When we have but a few breaths to draw, we should spend them in the holy, gracious breathings of faith and prayer; not in the noisome, noxious breathings of sin and corruption. We have much reason to pray, that He who keeps Israel, and neither slumbers nor sleeps, may keep us when we slumber and sleep. Job covets to rest in his grave. Doubtless, this was his infirmity; for though a good man would choose death rather than sin, yet he should be content to live as long as God pleases, because life is our opportunity of glorifying him, and preparing for heaven.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The eye of him that hath seen me shall see me no more - I shall be cut off from all my friends - one of the things which most distresses people when they come to die.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Thine eyes are upon me, and I am not - see Job 7:21. Dr. Good renders this, \"let thine eye be upon me, and I am nothing.\" Herder, \"thine eye will seek me, but I am no more.\" According to this the sense is, that he was soon to be removed from the place where he had dwelt, and that should he be sought there he could not be found. He would seem to represent God as looking for him, and not finding him; see Job 7:21. The margin has,\" I can live no longer.\" It may be possible that this is the meaning, that God had fixed an intense gaze upon him, and that he could not survive it. If this is the sense, then it accords with the descriptions given of the majesty of God everywhere in the Scriptures - that nothing could endure His presence, that even the earth trembles, and the mountains melt away, at his touch. Thus, in Psalm 104:32 :",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Thine eyes are upon me, and I am not - see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 7:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Dr. Good renders this, \"let thine eye be upon me, and I am nothing.\" Herder, \"thine eye will seek me, but I am no more.\" According to this the sense is, that he was soon to be removed from the place where he had dwelt, and that should he be sought there he could not be found. He would seem to represent God as looking for him, and not finding him; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 7:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The margin has,\" I can live no longer.\" It may be possible that this is the meaning, that God had fixed an intense gaze upon him, and that he could not survive it. If this is the sense, then it accords with the descriptions given of the majesty of God everywhere in the Scriptures - that nothing could endure His presence, that even the earth trembles, and the mountains melt away, at his touch. Thus, in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 104:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " :",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "He looketh on the earth, and it trembleth;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "He toucheth the hills, and they smoke.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Compare the representation of the power of the eye in Job 16:9 :",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Compare the representation of the power of the eye in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 16:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " :",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "He teareth me in his wrath who hateth me;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "He gnasheth upon me with his teeth",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Mine enemy sharpeneth his eyes upon me.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "On the whole, I think it probable that this is the sense here. There is an energy in the original which is greatly enfeebled in the common translation. God had fixed his eyes upon Job, and he at once disappeared; compare Revelation 20:11 : \"And I saw a great white throne, and him that sat upon it, from whose face the earth and the heaven fled away, and there was found no place for them.\" ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "On the whole, I think it probable that this is the sense here. There is an energy in the original which is greatly enfeebled in the common translation. God had fixed his eyes upon Job, and he at once disappeared; compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 20:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : \"And I saw a great white throne, and him that sat upon it, from whose face the earth and the heaven fled away, and there was found no place for them.\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8. The eye of him who beholds me (present, not past), that is, in the very act of beholding me, seeth me no more.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Thine eyes are upon me, and I am not—He disappears, even while God is looking upon him. Job cannot survive the gaze of Jehovah (Ps 104:32; Re 20:11). Not, \"Thine eyes seek me and I am not to be found\"; for God's eye penetrates even to the unseen world (Ps 139:8). Umbreit unnaturally takes \"thine\" to refer to one of the three friends.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Shall see me no more",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in this mortal state; I shall never return to this life again. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Thine eyes are upon me, and I am not:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " either, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. If thou dost but east one angry look upon me, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I am not",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", i.e. I am a dead man. So that phrase is used ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 5:24 42:13 44:20 Psa 103 16 Jer 31:15",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 5:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 42:13 44:20 Psa 103 16 Jer 31:15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "When thine eyes shall be upon me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (i.e. when thou shalt look for me to do me good, thou wilt find that) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I am not",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", that I am dead and gone, and uncapable of that bounty and goodness which thou givest to men in this world. Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Job 7:21 Psalm 10:15 Jeremiah 50:20",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 7:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 10:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 50:20",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The eye of him that hath seen me shall see me no more,.... Or \"the eye of sight\" (e); the seeing eye, the most acute and quick sighted eye; so Mr. Broughton renders it, \"the quick eye\" (f): this is to be understood as \"after\" (g) death, that then the sharpest eye should not see him, he would be out of the reach of it; which must be taken with a limitation; for men after death are seen by the eyes of the omniscient God, their souls, be they in heaven or in hell, and their bodies in the grave; and as for good men, such as Job, they are at once with him in his immediate presence, beholding and beheld by him; and they are seen by angels, whose care and charge their souls become immediately upon death, and are carried by them into heaven, where they are fellow worshippers with them; and they are seen by glorified saints, to whose company they are joined; for if the rich man in hell could see Abraham, and Lazarus in his bosom, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 16:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", then much more do the saints see one another: but the meaning is, that when a man is dead, he is seen no more by men on earth, by his relations, friends, and acquaintance; the consideration of which is a cutting stroke at parting, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 20:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; the state of the dead is an invisible state, and therefore called in the Greek tongue \"Hades\", \"unseen\"; so the dead will remain, with respect to the inhabitants of this world, till the resurrection, and then they shall see and be seen again in the same bodies they now have; for this is no denial of the resurrection of the dead, as some Jewish writers charge Job with, and infer from this and some following passages: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "thine eyes are upon me, and I am not; am a dead man, a phrase expressive of death, and of being in the state of the dead, or however of being no more in this world, see Genesis 5:24; not that the dead are nonentities, or are reduced to nothing; this is not true of them, either with respect to soul or body; their souls are immaterial and immoral, and exist in a separate state after death, and their bodies, though reduced to dust, are not annihilated; they return to earth and dust, from whence they came; but still they are something, they are earth and dust, unless these can be thought to be nothing; and this dust is taken care of and preserved, and will be gathered together, and moulded, and framed, and fashioned into bodies again, which will endure for ever: nor is the meaning, that they are nowhere; the spirits of just men made perfect are in heaven, in paradise, in a state of life, immortality, and bliss; and the souls of the wicked are in their own place, in the prison of hell, reserved with devils, to the judgment of the great day; and the bodies of both are in the graves till the day of the resurrection; but they are not, and no more, in the land of the living, in their houses and families, in their shops and business, and places of trade and merchandise, or in the house of God serving him there, according to their different stations. And this Job ascribes to God, \"thine eyes are upon me\": meaning not his eyes of love, favour, and kindness, which had respect unto him; and yet, notwithstanding this, as it did not secure him from afflictions, so neither would it from death itself; for \"though his eyes were upon him\" in such sense, yet he \"would not be\" (a), or should die; but rather his angry eyes, the frowns of his countenance, which were now upon him, and might be discerned in the dispensations of his providence towards him, by reason of which he \"was not\" as he was before; not fit for anything, as Sephorno understands it; or should he frown upon him, one angry look would sink him into the state of the dead, and he should be no more, who \"looks on the earth, and it trembles\", Psalm 104:32. Mr. Broughton renders it as a petition, \"let thine eyes be upon me, that I be no more\"; that is, let me die, the same request he made in Job 6:8; but it seems best to interpret it or the eyes of God's omnipresence and providence, which are on men in every state and place; and the sense be, either as granting, that though the eyes of men should not see him after death, yet the eyes of God would be upon him when he was not, or in the state of the fiend; or else, that should he long defer doing him good, it would be too late, he should soon die, and then, though he should look after him, and seek for him, he should not be in the land of the living, according to Job 7:21; or this may denote the suddenness of death, which comes to a man in a moment, as Bar Tzemach observes, in the twinkling of an eye; nay, as soon as the eye of God is upon a man, that is, as soon almost as a man appears in the world, and the eye of Divine Providence is upon him, he is out of it again, and is no more; see Ecclesiastes 3:2. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "thine eyes are upon me, and I am not; am a dead man, a phrase expressive of death, and of being in the state of the dead, or however of being no more in this world, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 5:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; not that the dead are nonentities, or are reduced to nothing; this is not true of them, either with respect to soul or body; their souls are immaterial and immoral, and exist in a separate state after death, and their bodies, though reduced to dust, are not annihilated; they return to earth and dust, from whence they came; but still they are something, they are earth and dust, unless these can be thought to be nothing; and this dust is taken care of and preserved, and will be gathered together, and moulded, and framed, and fashioned into bodies again, which will endure for ever: nor is the meaning, that they are nowhere; the spirits of just men made perfect are in heaven, in paradise, in a state of life, immortality, and bliss; and the souls of the wicked are in their own place, in the prison of hell, reserved with devils, to the judgment of the great day; and the bodies of both are in the graves till the day of the resurrection; but they are not, and no more, in the land of the living, in their houses and families, in their shops and business, and places of trade and merchandise, or in the house of God serving him there, according to their different stations. And this Job ascribes to God, \"thine eyes are upon me\": meaning not his eyes of love, favour, and kindness, which had respect unto him; and yet, notwithstanding this, as it did not secure him from afflictions, so neither would it from death itself; for \"though his eyes were upon him\" in such sense, yet he \"would not be\" (a), or should die; but rather his angry eyes, the frowns of his countenance, which were now upon him, and might be discerned in the dispensations of his providence towards him, by reason of which he \"was not\" as he was before; not fit for anything, as Sephorno understands it; or should he frown upon him, one angry look would sink him into the state of the dead, and he should be no more, who \"looks on the earth, and it trembles\", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 104:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Mr. Broughton renders it as a petition, \"let thine eyes be upon me, that I be no more\"; that is, let me die, the same request he made in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 6:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; but it seems best to interpret it or the eyes of God's omnipresence and providence, which are on men in every state and place; and the sense be, either as granting, that though the eyes of men should not see him after death, yet the eyes of God would be upon him when he was not, or in the state of the fiend; or else, that should he long defer doing him good, it would be too late, he should soon die, and then, though he should look after him, and seek for him, he should not be in the land of the living, according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 7:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; or this may denote the suddenness of death, which comes to a man in a moment, as Bar Tzemach observes, in the twinkling of an eye; nay, as soon as the eye of God is upon a man, that is, as soon almost as a man appears in the world, and the eye of Divine Providence is upon him, he is out of it again, and is no more; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ecclesiastes 3:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(e)  Heb. \"oculus visus\", Drusius, Piscator; \"aspectus\", Mercerus; so Simeon Bar Tzemach. (f) \"Ocuium perspicacissimum\", Junius & Tremellius, Piscator. (g) Posthac, Tigurine version. (a) \"Etiam oculis tuis ad me respicientibus, me non fore amplius\", Junius & Tremellius, Piscator. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(e)  Heb. \"oculus visus\", Drusius, Piscator; \"aspectus\", Mercerus; so Simeon Bar Tzemach. (f) \"Ocuium perspicacissimum\", Junius & Tremellius, Piscator. (g) Posthac, Tigurine version. (a) \"Etiam oculis tuis ad me respicientibus, me non fore amplius\", Junius & Tremellius, Piscator. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "The eye of him that hath seen me shall see me no more: thine eyes are upon me, and I am not.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "are upon me, and I am not",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Perhaps rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "shall be upon me and I shall not be",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; God will look for him, enquiring, it may be, after the work of His hands, but he shall be gone; cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Job 7:21",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 7:21",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 8.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The eye of him that hath seen me shall see me no more",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; that is, I shall go down to the grave, and be no more seen upon earth. Neither friend nor enemy shall behold me after that. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Thine eyes",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". God's eyes. God still sees him and watches him; this is a certain consolation; but will it last? Are upon me, and I am not. I am on the point of disappearing. Even now I scarcely exist. Job 7:8",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "  7  Remember that my life is a breath,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "That my eye will never again look on prosperity.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "  8  The eye that looketh upon me seeth me no more;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Thine eyes look for me, - I am no more!",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "  9  The clouds are vanished and passed away,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "So he that goeth down to Shel cometh not up.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "10  He returneth no more to his house,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And his place knoweth him no more.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "11  Therefore I will not curb my mouth;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I will speak in the anguish of my spirit;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I will complain in the bitterness of my soul.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "We see good, i.e., prosperity and joy, only in the present life. It ends with death. שׁוּב with ל infin. is a synonym of הוסיף, Job 20:9. No eye (עין femin.) which now sees me (prop. eye of my seer, as Genesis 16:13, comp. Job 20:7; Psalm 31:12, for ראני, Isaiah 29:15, or ראני, Isaiah 47:10; according to another reading, ראי: no eye of seeing, i.e., no eye with the power of seeing, from ראי, vision) sees me again, even if thy eyes should be directed towards me to help me; my life is gone, so that I can no more be the subject of help. For from Shel there is no return, no resurrection (comp. Psalm 103:16 for the expression); therefore will I at least give free course to my thoughts and feelings (comp. Psalm 77:4; Isaiah 38:15, for the expression). The גּם, Job 7:11, is the so-called גם talionis; the parallels cited by Michalis are to the point, Ezekiel 16:43; Malachi 2:9; Psalm 52:7. Here we first meet with the name of the lower world; and in the book of Job we learn the ancient Israelitish conception of it more exactly than anywhere else. We have here only to do with the name in connection with the grammatical exposition. שׁאול (usually gen. fem.) is now almost universally derived from שׁאל  equals  שׁעל, to be hollow, to be deepened; and aptly so, for they imagined the Sheôl as under ground, as Numbers 16:30, Numbers 16:33 alone shows, on which account even here, as from Genesis 37:35 onwards, שׁאולה ירד is everywhere used. It is, however, open to question whether this derivation is correct: at least passages like Isaiah 5:14; Habakkuk 2:5; Proverbs 30:15., show that in the later usage of the language, שׁאל, to demand, was thought of in connection with it; derived from which Sheôl signifies (1) the appointed inevitable and inexorable demanding of everything earthly (an infinitive noun like אלוהּ, פּקוד); (2) conceived of as space, the place of shadowy duration whither everything on earth is demanded; (3) conceived of according to its nature, the divinely appointed fury which gathers in and engulfs everything on the earth. Job knows nothing of a demanding back, a redemption from Sheôl. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "We see good, i.e., prosperity and joy, only in the present life. It ends with death. שׁוּב with ל infin. is a synonym of הוסיף, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 20:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". No eye (עין femin.) which now sees me (prop. eye of my seer, as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 16:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 20:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 31:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", for ראני, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 29:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", or ראני, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 47:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; according to another reading, ראי: no eye of seeing, i.e., no eye with the power of seeing, from ראי, vision) sees me again, even if thy eyes should be directed towards me to help me; my life is gone, so that I can no more be the subject of help. For from Shel there is no return, no resurrection (comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 103:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " for the expression); therefore will I at least give free course to my thoughts and feelings (comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 77:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 38:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", for the expression). The גּם, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 7:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", is the so-called גם talionis; the parallels cited by Michalis are to the point, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 16:43",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Malachi 2:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 52:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Here we first meet with the name of the lower world; and in the book of Job we learn the ancient Israelitish conception of it more exactly than anywhere else. We have here only to do with the name in connection with the grammatical exposition. שׁאול (usually gen. fem.) is now almost universally derived from שׁאל  equals  שׁעל, to be hollow, to be deepened; and aptly so, for they imagined the Sheôl as under ground, as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 16:30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 16:33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " alone shows, on which account even here, as from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 37:35",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " onwards, שׁאולה ירד is everywhere used. It is, however, open to question whether this derivation is correct: at least passages like ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 5:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 2:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 30:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "., show that in the later usage of the language, שׁאל, to demand, was thought of in connection with it; derived from which Sheôl signifies (1) the appointed inevitable and inexorable demanding of everything earthly (an infinitive noun like אלוהּ, פּקוד); (2) conceived of as space, the place of shadowy duration whither everything on earth is demanded; (3) conceived of according to its nature, the divinely appointed fury which gathers in and engulfs everything on the earth. Job knows nothing of a demanding back, a redemption from Sheôl. ",
            "children": []
          }
        ]
      }
    ]
  }
]