[{"num":8,"verse":"¶ And the men of Ephraim said unto him, Why hast thou served us thus that thou didst not call us when thou didst go to fight against Midian? And they chided with him sharply."},{"num":2,"verse":"And he replied unto them, What have I done now in comparison with you? Is not the gleaning of the grapes of Ephraim better than the vintage of Abiezer?"},{"num":3,"verse":"God has delivered into your hands the princes of Midian, Oreb and Zeeb, and what was I able to do in comparison with you? Then their anger was abated toward him when he spoke that word."},{"num":4,"verse":"¶ And Gideon came to pass the Jordan, he and the three hundred men that were with him, faint from the pursuit."},{"num":5,"verse":"And he said unto those of Succoth, Give, I pray you, loaves of bread unto the people that follow me; for they are faint that I may pursue after Zebah and Zalmunna, kings of Midian."},{"num":6,"verse":"And the principals of Succoth said, Are the hands of Zebah and Zalmunna now in thy hand that we should give bread unto thy army?"},{"num":7,"verse":"And Gideon said, Therefore when the LORD has delivered Zebah and Zalmunna into my hand, then I will tear your flesh with the thorns and the briers of the wilderness."},{"num":8,"verse":"And he went up from there to Penuel and spoke unto them likewise; and those of Penuel answered him as the men of Succoth had answered him."},{"num":9,"verse":"And he spoke also unto the men of Penuel, saying, When I come again in peace, I will break down this tower."},{"num":10,"verse":"Now Zebah and Zalmunna were in Karkor and their hosts with them, about fifteen thousand men, all that were left of all the hosts of the sons of the east, for one hundred and twenty thousand men that drew sword had been slain."},{"num":11,"verse":"And Gideon went up by the way of those that dwelt in tents on the east of Nobah and Jogbehah and smote the camp, for the camp was secure."},{"num":12,"verse":"And as Zebah and Zalmunna fled, he pursued after them and took the two kings of Midian, Zebah and Zalmunna and terrified all the host."},{"num":13,"verse":"And Gideon, the son of Joash, returned from the battle before the sun was up"},{"num":14,"verse":"and caught a young man of the men of Succoth and enquired of him; and he described unto him the principals of Succoth and the elders thereof, seventy-seven men."},{"num":15,"verse":"And he came unto the men of Succoth and said, Behold Zebah and Zalmunna, with whom ye did upbraid me, saying, Are the hands of Zebah and Zalmunna now in thy hand, that we should give bread unto thy men that are weary?"},{"num":16,"verse":"And he took the elders of the city and thorns and briars of the wilderness, and with them he taught the men of Succoth."},{"num":17,"verse":"Likewise he beat down the tower of Penuel and slew the men of the city."},{"num":18,"verse":"¶ Then he said unto Zebah and Zalmunna, What manner of men were those whom ye slew at Tabor? And they answered, As thou art, so were they; each one resembled the sons of a king."},{"num":19,"verse":"And he said, They were my brethren, the sons of my mother; as the LORD lives, if ye had saved them alive, I would not slay you."},{"num":20,"verse":"And he said unto Jether his firstborn, Rise up and slay them. But the youth did not draw his sword, for he feared because he was yet a youth."},{"num":21,"verse":"Then Zebah and Zalmunna said, Rise thou and fall upon us, for as the man is, so is his strength. And Gideon arose, and slew Zebah and Zalmunna and took away the ornaments that were on their camels’ necks."},{"num":22,"verse":"¶ Then the men of Israel said unto Gideon, Rule thou over us, both thou and thy son and thy son’s son also, for thou hast delivered us from the hand of Midian."},{"num":23,"verse":"But Gideon replied, I will not rule over you, neither shall my son rule over you; the LORD shall rule over you."},{"num":24,"verse":"And Gideon said unto them, I desire to make a request of you that ye each one would give me the earrings of his prey. (For they had golden earrings because they were Ishmaelites.)"},{"num":25,"verse":"And they answered, We will willingly give them. And they spread a garment, and each one cast therein the earrings of his prey."},{"num":26,"verse":"And the weight of the golden earrings that he requested was a thousand seven hundred shekels of gold, without the ornaments and collars and purple clothing that was on the kings of Midian and without the chains that were about their camels’ necks."},{"num":27,"verse":"And Gideon made an ephod of them and kept it in his city of Ophrah, and all Israel fornicated after it in that place, and it became a snare unto Gideon and to his house."},{"num":28,"verse":"Thus Midian was broken before the sons of Israel so that they lifted up their heads no more. And the land rested forty years in the days of Gideon."},{"num":29,"verse":"¶ And Jerubbaal, the son of Joash, went and dwelt in his own house."},{"num":30,"verse":"And Gideon had seventy sons that came out of his loins, for he had many wives."},{"num":31,"verse":"And his concubine that was in Shechem, she also bore him a son, whose name he called Abimelech."},{"num":32,"verse":"And Gideon, the son of Joash, died in a good old age and was buried in the sepulchre of Joash, his father, in Ophrah of the Abiezrites."},{"num":33,"verse":"And it came to pass as soon as Gideon was dead that the sons of Israel turned again and fornicated after the Baalim and made Baalberith their god."},{"num":34,"verse":"And the sons of Israel did not remember the LORD their God, who had delivered them out of the hands of all their enemies on every side,"},{"num":35,"verse":"neither were they merciful with the house of Jerubbaal, namely, Gideon, according to all the good which he had done unto Israel."}]