[{"num":8,"verse":"But the tribal leaders of Ephraim were violently angry with Gideon."},{"num":2,"verse":"But Gideon replied, “God let you capture Oreb and Zeeb, the generals of the army of Midian! What have I done in comparison with that? Your actions at the end of the battle were more important than ours at the beginning!” So they calmed down."},{"num":4,"verse":"Gideon now crossed the Jordan River with his three hundred men. They were very tired, but still chasing the enemy. "},{"num":5,"verse":"He asked the men of Succoth for food. “We are weary from chasing after Zebah and Zalmunna, the kings of Midian,” he said."},{"num":6,"verse":"But the leaders of Succoth replied, “You haven’t caught them yet! If we feed you and you fail, they’ll return and destroy us.”"},{"num":7,"verse":"Then Gideon warned them, “When the Lord has delivered them to us, I will return and tear your flesh with the thorns and briars of the wilderness.”"},{"num":8,"verse":"Then he went up to Penuel and asked for food there, but got the same answer. "},{"num":9,"verse":"And he said to them also, “When this is all over, I will return and break down this tower.”"},{"num":10,"verse":"By this time King Zebah and King Zalmunna with a remnant of fifteen thousand troops were in Karkor. That was all that was left of the allied armies of the east; for one hundred twenty thousand had already been killed. "},{"num":11,"verse":"Then Gideon circled around by the caravan route east of Nobah and Jogbehah, striking at the Midianite army in surprise raids. "},{"num":12,"verse":"The two kings fled, but Gideon chased and captured them, routing their entire force. "},{"num":13,"verse":"Later, Gideon returned by way of Heres Pass. "},{"num":14,"verse":"There he captured a young fellow from Succoth and demanded that he write down the names of all the seventy-seven political and religious leaders of the city."},{"num":15,"verse":"He then returned to Succoth. “You taunted me that I would never catch King Zebah and King Zalmunna, and you refused to give us food when we were tired and hungry,” he said. “Well, here they are!”"},{"num":16,"verse":"Then he took the leaders of the city and scraped them to death with wild thorns and briars. "},{"num":17,"verse":"He also went to Penuel and knocked down the city tower and killed the entire male population."},{"num":18,"verse":"Then Gideon asked King Zebah and King Zalmunna, “The men you killed at Tabor—what were they like?”"},{"num":19,"verse":"“They must have been my brothers!” Gideon exclaimed. “I swear that if you hadn’t killed them I wouldn’t kill you.”"},{"num":20,"verse":"Then, turning to Jether, his oldest son, he instructed him to kill them. But the boy was only a lad and was afraid to."},{"num":21,"verse":"Then Zebah and Zalmunna said to Gideon, “You do it; we’d rather be killed by a man!” So Gideon killed them and took the ornaments from their camels’ necks."},{"num":22,"verse":"Now the men of Israel said to Gideon, “Be our king! You and your sons and all your descendants shall be our rulers, for you have saved us from Midian.”"},{"num":23,"verse":"But Gideon replied, “I will not be your king, nor shall my son; the Lord is your King! However, I have one request. Give me all the earrings collected from your fallen foes”—for the troops of Midian, being Ishmaelites, all wore gold earrings."},{"num":25,"verse":"“Gladly!” they replied, and spread out a sheet for everyone to throw in the gold earrings he had gathered. "},{"num":26,"verse":"Their value was estimated at $25,000, not including the crescents and pendants, or the royal clothing of the kings, or the chains around the camels’ necks. "},{"num":27,"verse":"Gideon made an ephod from the gold and put it in Ophrah, his hometown. But all Israel soon began worshiping it, so it became an evil deed that Gideon and his family did."},{"num":28,"verse":"That is the true account of how Midian was subdued by Israel. Midian never recovered, and the land was at peace for forty years—all during Gideon’s lifetime. "},{"num":29,"verse":"He returned home "},{"num":30,"verse":"and eventually had seventy sons, for he married many wives. "},{"num":31,"verse":"He also had a concubine in Shechem, who presented him with a son named Abimelech. "},{"num":32,"verse":"Gideon finally died, an old, old man, and was buried in the sepulcher of his father, Joash, in Ophrah, in the land of the Abiezrites."},{"num":33,"verse":"But as soon as Gideon was dead, the Israelis began to worship the idols Baal and Baal-berith. "},{"num":34,"verse":"They no longer considered the Lord as their God, though he had rescued them from all their enemies on every side. "},{"num":35,"verse":"Nor did they show any kindness to the family of Gideon despite all he had done for them."}]