[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(9) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And if it bear fruit.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Some of the better MSS. have, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "if it bear fruit in the time to come",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " . . . With either reading the sentence is elliptical, and the insertion of “well,” as in the English, is needed to convey its meaning.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13:6-9 This parable of the barren fig-tree is intended to enforce the warning given just before: the barren tree, except it brings forth fruit, will be cut down. This parable in the first place refers to the nation and people of the Jews. Yet it is, without doubt, for awakening all that enjoy the means of grace, and the privileges of the visible church. When God has borne long, we may hope that he will bear with us yet a little longer, but we cannot expect that he will bear always.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The dresser of his vineyard - The man whose duty it was to trim the vines and take care of his vineyard.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "These three years - These words are not to be referred to the time which Christ had been preaching the gospel, as if he meant to specify the exact period. They mean, as applicable to the vineyard, that the owner had been \"a long time\" expecting fruit on the tree. For three successive years he had been disappointed. In his view it was long enough to show that the tree was barren and would yield no fruit, and that therefore it should be cut down.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Why cumbereth it the ground? - The word \"cumber\" here means to render \"barren\" or \"sterile.\" By taking up the juices of the earth, this useless tree rendered the ground sterile, and prevented the growth of the neighboring vines. It was not merely \"useless,\" but was doing mischief, which may be said of all sinners and all hypocritical professors of religion. Dr. Thomson (\"The Land and the Book,\" vol. i. p. 539) says of the barren fig-tree: \"There are many such trees now; and if the ground is not properly cultivated, especially when the trees are young - as the one of the parable was, for only \"three\" years are mentioned they do not bear at all; and even when full grown they quickly fail, and wither away if neglected. Those who expect to gather good crops of well-flavored figs are particularly attentive to their culture - not only plow and dig about them frequently, and manure them plentifully, but they carefully gather out the stones from the orchards, contrary to their general slovenly habits.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This parable is to be taken in connection with what goes before, and with our Saviour's calling the Jewish nation to repentance. It was spoken to illustrate the dealings of God with them, and their own wickedness under all his kindness, and we may understand the different parts of the parable as designed to represent:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. God, by the man who owned the vineyard.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "2. The vineyard as the Jewish people.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "3. The coming of the owner for fruit, the desire of God that they should produce good works.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "4. The barrenness of the tree, the wickedness of the people.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "5. The dresser was perhaps intended to denote the Saviour and the other messengers of God, pleading that God would spare the Jews, and save them from their enemies that stood ready to destroy them, as soon as God should permit.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "6. His waiting denotes the delay of vengeance, to give them an opportunity of repentance. And,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "7. The remark of the dresser that he might \"then\" cut it down, denotes the acquiescence of all in the belief that such a judgment would be just.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "We may also remark that God treats sinners in this manner now; that he spares them long; that he gives them opportunities of repentance; that many live but to cumber the ground; that they are not only useless to the church, but pernicious to the world; that in due time, when they are fairly tried, they shall be cut down; and that the universe will bow to the awful decree of God, and say that their damnation is just. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "We may also remark that God treats sinners in this manner now; that he spares them long; that he gives them opportunities of repentance; that many live but to cumber the ground; that they are not only useless to the church, but pernicious to the world; that in due time, when they are fairly tried, they shall be cut down; and that the universe will bow to the awful decree of God, and say that their damnation is just. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9. if … fruit, well—Genuine repentance, however late, avails to save (Lu 23:42, 43).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "after that, &c.—The final perdition of such as, after the utmost limits of reasonable forbearance, are found fruitless, will be pre-eminently and confessedly just (Pr 1:24-31; Eze 24:13).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole on \"Luke 13:6\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole on \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 13:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And if it bear fruit, well,.... If hereby barren professors, as the Jews, become fruitful, it is well, a good thing is done; it is well for themselves, they shall eat the fruit of their doings; it is well for the churches where they are, for good works are profitable to men; and it is well for the owner of the vineyard, and the dresser of it too, for when Christ has his fruit from his churches, his ministers have theirs also: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and if not, then ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "after that; \"for the time to come\", as the Vulgate Latin; or \"year following\", as the Persic version renders it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "thou shall cut it down; do with it as thou pleasest, nothing more will be said or pleaded in its behalf; full consent shall be given, and no more intercession used: any trees might not be cut down, only barren ones; there is a law in Deuteronomy 20:19 about cutting down trees, and which the Jews explain thus (m); ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "thou shall cut it down; do with it as thou pleasest, nothing more will be said or pleaded in its behalf; full consent shall be given, and no more intercession used: any trees might not be cut down, only barren ones; there is a law in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 20:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " about cutting down trees, and which the Jews explain thus (m); ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"they may not cut down trees for meat without the city, nor withhold from them the course of water, that so they may become dry; as it is said, \"thou shall not destroy the trees\"; and whoever cuts any down is to be beaten, and not in a siege only, but in any place: whoever cuts down a tree for meat, by way of destroying it, is to be beaten; but they may cut it down if it hurts other trees, or because it hurts in the field others, or because its price is dear; the law does not forbid, but by way of destroying. Every barren tree it is lawful to cut down, even though a man hath no need of it; and so a tree for meat, which does hurt, and does not produce but little fruit, and it is not worth while to labour about it, it is lawful to cut it down: and how much may an olive tree produce, and it may not be cut down? the fourth part of a \"Kab\" of olives; and a palm tree which yields a \"Kab\" of dates, may not be cut down.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Much such a parable as this is formed by the Jews, upon Moses's intercession for the people of Israel (n). ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Says R. Abin, in the name of R. Simeon ben Josedech, a parable, to what is it like? to a king that hath an uncultivated field; he says to his gardener, go and manure it, and make it a vineyard: the gardener went and manured that field, and planted it a vineyard; the vineyard grew, and produced wine, and it turned to vinegar; when the king saw that the wine turned to vinegar, he said to the gardener, go, , \"and cut it down\", why should I seek after a vineyard that brings forth that which is sour? the gardener replied, my lord, the king, what expense hast thou been at with this vineyard before it was raised? and now thou seekest to cut it down; and shouldst thou say because its wine turns sour; the reason is, because it is young, therefore its wine turns sour, and it does not produce good wine: so when Israel did that work (of the golden calf), the holy blessed God sought to consume them; said Moses, Lord of the world, hast thou not brought them out of Egypt from a place of idolatry, and now they are young, or children, as it is said, Hosea 11:1 wait a little for them, and go with them, and they will do good works in thy presence.'' ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"Says R. Abin, in the name of R. Simeon ben Josedech, a parable, to what is it like? to a king that hath an uncultivated field; he says to his gardener, go and manure it, and make it a vineyard: the gardener went and manured that field, and planted it a vineyard; the vineyard grew, and produced wine, and it turned to vinegar; when the king saw that the wine turned to vinegar, he said to the gardener, go, , \"and cut it down\", why should I seek after a vineyard that brings forth that which is sour? the gardener replied, my lord, the king, what expense hast thou been at with this vineyard before it was raised? and now thou seekest to cut it down; and shouldst thou say because its wine turns sour; the reason is, because it is young, therefore its wine turns sour, and it does not produce good wine: so when Israel did that work (of the golden calf), the holy blessed God sought to consume them; said Moses, Lord of the world, hast thou not brought them out of Egypt from a place of idolatry, and now they are young, or children, as it is said, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 11:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " wait a little for them, and go with them, and they will do good works in thy presence.'' ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(m) Maimon. Hilch. Melacim, c. 6. sect. 8, 9. (n) Shemot Rabba, sect. 43. fol. 141. 2.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(m) Maimon. Hilch. Melacim, c. 6. sect. 8, 9. (n) Shemot Rabba, sect. 43. fol. 141. 2.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And if it bear fruit, well: and if not, then after that thou shalt cut it down.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 13:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "εἰς τὸ μέλλον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": if it bear ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the coming year",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—well (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "εὖ ἔχει",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " understood).—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐκκόψεις",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", if not, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thou shalt cut it down",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—thou, not I. It depends on the master, though the vinedresser tacitly recognises that the decision will be just. He sympathises with the master’s desire for fruit. Of course when the barren tree is removed another will be planted in its place. The parable points to the truth taught in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 13:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "if it bear fruit",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "well",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘well",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "’ is not in the original, the idiom being a common but striking ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "aposiopesis:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. the conclusion of the sentence is left to the speaker’s imagination. The phrase implies, If, as is at least possible, it bears fruit; but if not, as thou supposest, then, &c.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 13:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Κἂν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and if",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") The Apodosis is to be understood: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "It is well",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I will leave it to stand",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; or else, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "let it bear fruit",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It comes to the same.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐκκόψεις",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thou shalt cut it off",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [down]) The ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Vine-dresser",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " does not say, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I will cut it off",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (down); comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 13:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but refers the whole case to the Lord of the vineyard: however, He ceases to intercede for the fig-tree, that it should be spared.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "μέλλον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") viz. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἔτος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in the year to come",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in antithesis to ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "this year",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τοῦτο τὸ ἔτος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 13:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Luke 13:9",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And if it bear fruit, well; and if not, then after that",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Join afar that with bear fruit. \"If it bear fruit for the future (εἰς τὸ μέλλον, Rev., thenceforth), well; but if not, thou shalt cut it down.\" Trench (\"Parables\") cites an Arabian writer's receipt for curing a palm-tree of barrenness. \"Thou must take a hatchet, and go to the tree with a friend, unto whom thou sayest, 'I will cut down this tree, for it is unfruitful.' He answers, 'Do not so, this year it will certainly bear fruit.' But the other says, 'It must needs be - it must be hewn down;' and gives the stem of the tree three blows with the back of the hatchet. But the other restrains him, crying, 'Nay, do it not, thou wilt certainly have fruit from it this year, only have patience with it, and be not overhasty in cutting it down; if it still refuses to bear fruit, then cut it down.' Then will the tree that year be certainly fruitful and bear abundantly.\" Trench adds that this story appears to be widely spread in the East.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Thou shalt cut it down",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The vine-dresser does not say, \"I will cut,\" but refers that to the master. ",
        "children": []
      }
    ]
  }
]