[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "XXXI.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "THE APPOINTMENT OF BEZALEEL AND AHOLIAB.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1-11) The instructions needed for the making of the tabernacle, its furniture, and the priests’ dresses, were now complete. Moses was sufficiently informed, by what he had heard and seen, both as to the “Tent of Meeting” itself, and as to all its appurtenances and paraphernalia. But Moses was not himself an artist. Among the branches of knowledge comprised in his Egyptian education the skill of the artistic constructor had not been included. (See Excursus B. at the end of the Book.) It was therefore necessary that the manual work of carrying out the instructions given him should be entrusted to others. We might have expected that it would have been left to Moses to select the individuals from among the thousands of artificers who had accompanied him out of Egypt. But God saw fit to mark the importance of the work by taking the direct appointment of the persons to be employed upon Himself. He knew what was in man. He knew to whom he had given the highest artistic power, and who at the same time that they possessed it would work in the most religious spirit. He accordingly named two persons, Bezaleel and Aholiab, as those to whom the superintendence of the whole business should be given. Bezaleel was to be leader and chief, Aholiab assistant. Bezaleel’s task was to be general, Aholiab’s, apparently, special (Exodus 38:23). Both, however, were to receive the special assistance of God’s Holy Spirit for the due execution of their respective tasks (Exodus 31:3-6), and both, as chosen instruments of God, and faithful workers in His service, had their names equally commemorated in His Holy Book, and were thus upheld as examples to future ages.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(1-11) The instructions needed for the making of the tabernacle, its furniture, and the priests’ dresses, were now complete. Moses was sufficiently informed, by what he had heard and seen, both as to the “Tent of Meeting” itself, and as to all its appurtenances and paraphernalia. But Moses was not himself an artist. Among the branches of knowledge comprised in his Egyptian education the skill of the artistic constructor had not been included. (See ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Excursus ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "B. at the end of the Book.) It was therefore necessary that the manual work of carrying out the instructions given him should be entrusted to others. We might have expected that it would have been left to Moses to select the individuals from among the thousands of artificers who had accompanied him out of Egypt. But God saw fit to mark the importance of the work by taking the direct appointment of the persons to be employed upon Himself. He knew what was in man. He knew to whom he had given the highest artistic power, and who at the same time that they possessed it would work in the most religious spirit. He accordingly named two persons, Bezaleel and Aholiab, as those to whom the superintendence of the whole business should be given. Bezaleel was to be leader and chief, Aholiab assistant. Bezaleel’s task was to be general, Aholiab’s, apparently, special (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 38:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Both, however, were to receive the special assistance of God’s Holy Spirit for the due execution of their respective tasks (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 31:3-6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and both, as chosen instruments of God, and faithful workers in His service, had their names equally commemorated in His Holy Book, and were thus upheld as examples to future ages.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Exodus 31:1-2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 31:1-2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "See, I have called Bezaleel — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The grandson of Hur, probably that Hur who had helped to hold up Moses’s hands, chap. 17., and was at this time in commission with Aaron for the government of the people in the absence of Moses. Aholiab, of the tribe of Dan, is appointed next to Bezaleel, and partner with him. Hiram, who was the head workman in the building of Solomon’s temple, was also of the tribe of Dan, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 2:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "31:1-11 The Israelites, who had been masons and bricklayers in Egypt, were not qualified for curious workmanship; but the Spirit who gave the apostles utterance in divers tongues, miraculously gave Bezaleel and Aholiab the skill that was wanting. The honour which comes from God, is always attended with a work to be done; to be employed for God is high honour. Those whom God calls to any service, he will find or make fit for it. The Lord gives different gifts to different persons; let each mind his proper work, diligently remembering that whatever wisdom any one possesses, the Lord put it in the heart, to do his commandments.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 35:30-35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This solemn call of Bezaleel and Aholiab is full of instruction. Their work was to be only that of handicraftsmen. Still it was Yahweh Himself who called them by name to their tasks, and the powers which they were now called upon to exercise in their respective crafts, were declared to have been given them by the Holy Spirit. Thus is every effort of skill, every sort of well-ordered labor, when directed to a right end, brought into the very highest sphere of association.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "There appears to be sufficient reason for identifying Hur, the grandfather of Bezaleel, with the Hur who assisted Aaron in supporting the hands of Moses during the battle with Amalek at Rephidim Exodus 17:10, and who was associated with Aaron in the charge of the people while Moses was on the mountain Exodus 24:14. Josephus says that he was the husband of Miriam. It is thus probable that Bezaleel was related to Moses. He was the chief artificer in metal, stone, and wood; he had also to perform the apothecary's work in the composition of the anointing oil and the incense Exodus 37:29. He had precedence of all the artificers, but Aholiab appears to have had the entire charge of the textile work Exodus 35:35; Exodus 38:23.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "There appears to be sufficient reason for identifying Hur, the grandfather of Bezaleel, with the Hur who assisted Aaron in supporting the hands of Moses during the battle with Amalek at Rephidim ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 17:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and who was associated with Aaron in the charge of the people while Moses was on the mountain ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 24:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Josephus says that he was the husband of Miriam. It is thus probable that Bezaleel was related to Moses. He was the chief artificer in metal, stone, and wood; he had also to perform the apothecary's work in the composition of the anointing oil and the incense ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 37:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". He had precedence of all the artificers, but Aholiab appears to have had the entire charge of the textile work ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 35:35",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 38:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "CHAPTER 31",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ex 31:1-18. Bezaleel and Aholiab.Bezaleel and Aholiab are called for the work of the tabernacle,  Exodus 31:1-7. The table and candlestick,  Exodus 31:8. The altar,  Exodus 31:9. Hallowing of the sabbath is commanded again,  Exodus 31:12-17. Moses receiveth the two tables of the law,  Exodus 31:18.  No text from Poole on this verse. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Ex 31:1-18. Bezaleel and Aholiab.Bezaleel and Aholiab are called for the work of the tabernacle, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bldvs",
            "text": " Exodus 31:1-7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The table and candlestick, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bldvs",
            "text": " Exodus 31:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The altar, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bldvs",
            "text": " Exodus 31:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Hallowing of the sabbath is commanded again, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bldvs",
            "text": " Exodus 31:12-17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Moses receiveth the two tables of the law, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bldvs",
            "text": " Exodus 31:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " No text from Poole on this verse. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the Lord spake unto Moses,.... After the Lord had given Moses instructions about building a tabernacle, the model of which he had shown him, and what should be the furniture of it, who should minister in it, and what clothes they should wear, he acquaints him that he had provided artificers for this service; which would prevent doubts and objections that might rise up in the mind of Moses, how and by whom all this should be done; since the children of Israel had not been brought up, nor used to any curious work in Egypt, out of which they were but just come: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "saying; as follows: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "saying; as follows: ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And the LORD spake unto Moses, saying,",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1–6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The nomination of Bĕẓal’çl and Oholiab.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 1-11.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - THE CALL OF BEZALEEL AND AHOLIAB. The directions for the construction of the tabernacle and its furniture being now complete, and the composition of the holy oil and the holy incense having been laid down minutely, it only remained to designate the persons to whom the oversight of the work was to be especially entrusted. These were to be two - Bezaleel, of the tribe of Judah, as head and chief; Aholiab, of the tribe of Dan, as his assistant. There can be no doubt that they were selected, primarily, as already possessing superior artistic powers and acquirements; but in appointing them God promised an infusion of special wisdom and knowledge, so that they were at once naturally and supernaturally fitted for their task. It is important to note that artistic ability is thus distinctly recognised as being quite as much a gift of God as any other, and indeed as coming to man through the Spirit of God (ver. 3). Artistic excellence is not a thing to be despised. It is very capable of abuse; but in itself it is a high gift, bestowed by God on a few only, with the special intent that it should be used to his honour and glory - not indeed in his direct service only - but always so as to improve, elevate, refine mankind, and thus help towards the advancement of God's kingdom Exodus 31:1",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The Builders (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 35:30-36:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). - After having given directions for the construction of the sanctuary, and all the things required for the worship, Jehovah pointed out the builders, whom He had called to carry out the work, and had filled with His Spirit for that purpose. To \"call by name\" is to choose or appoint by name for a particular work (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 45:3-4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Bezaleel was a grandson of Hur, of the tribe of Judah, who is mentioned in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 17:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 24:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and was called to be the master-builder, to superintend the whole of the building and carry out the artistic work; consequently he is not only invariably mentioned first (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 35:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 36:1-2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), but in the accounts of the execution of the separate portions he is mentioned alone (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 37:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 38:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Filling with the Spirit of God signifies the communication of an extraordinary and supernatural endowment and qualification, \"in wisdom,\" etc., i.e., consisting of wisdom, understanding, knowledge, and every kind of workmanship, that is to say, for the performance of every kind of work. This did not preclude either natural capacity or acquired skill, but rather presupposed them; for in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 31:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it is expressly stated in relation to his assistants, that God had put wisdom into all that were wise-hearted (see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 28:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Being thus endowed with a supernaturally exalted gift, Bezaleel was qualified \"to think out inventions,\" i.e., ideas or artistic designs. Although everything had been minutely described by Jehovah, designs and plans were still needed in carrying out the work, so that the result should correspond to the divine instructions. ",
        "children": []
      }
    ]
  }
]