[{"header":"Malta’s Hospitality"},{"num":28,"verse":"Once ashore, we then learned that the island was called Malta. "},{"num":2,"verse":"The local people showed us extraordinary kindness, for they lit a fire and took us all in, since it was raining and cold. "},{"num":3,"verse":"As Paul gathered a bundle of brushwood and put it on the fire, a viper came out because of the heat and fastened itself to his hand. "},{"num":4,"verse":"When the local people saw the creature hanging from his hand, they said to one another, “This man is probably a murderer, and though he has escaped the sea, Justice does not allow him to live!” "},{"num":5,"verse":"However, he shook the creature off into the fire and suffered no harm. "},{"num":6,"verse":"They expected that he would swell up or suddenly drop dead. But after they waited a long time and saw nothing unusual happen to him, they changed their minds and said he was a god."},{"header":"Ministry in Malta"},{"num":7,"verse":"Now in the area around that place was an estate belonging to the leading man of the island, named Publius, who welcomed us and entertained us hospitably for three days. "},{"num":8,"verse":"Publius’s father was in bed suffering from fever and dysentery. Paul went to him, and praying and laying his hands on him, he healed him. "},{"num":9,"verse":"After this, the rest of those on the island who had diseases also came and were cured. "},{"num":10,"verse":"So they heaped many honors on us, and when we sailed, they gave us what we needed."},{"header":"Rome at Last"},{"num":11,"verse":"After three months we set sail in an Alexandrian ship that had wintered at the island, with the Twin Brothers as its figurehead. "},{"num":12,"verse":"Putting in at Syracuse, we stayed three days. "},{"num":13,"verse":"From there, after making a circuit along the coast, we reached Rhegium. After one day a south wind sprang up, and the second day we came to Puteoli. "},{"num":14,"verse":"There we found believers and were invited to stay with them for seven days."},{"num":15,"verse":"Now the believers from there had heard the news about us and had come to meet us as far as the Forum of Appius and the Three Taverns. When Paul saw them, he thanked God and took courage. "},{"num":16,"verse":"When we entered Rome, Paul was permitted to stay by himself with the soldier who guarded him."},{"header":"Paul’s First Interview with Roman Jews"},{"num":17,"verse":"After three days he called together the leaders of the Jews. When they had gathered he said to them: “Brothers, although I have done nothing against our people or the customs of our ancestors, I was delivered as a prisoner from Jerusalem into the hands of the Romans. "},{"num":18,"verse":"After they examined me, they wanted to release me, since I had not committed a capital offense. "},{"num":19,"verse":"Because the Jews objected, I was compelled to appeal to Caesar; it was not as though I had any accusation against my nation. "},{"num":20,"verse":"For this reason I’ve asked to see you and speak to you. In fact, it is for the hope of Israel that I’m wearing this chain.”"},{"num":21,"verse":"Then they said to him, “We haven’t received any letters about you from Judea. None of the brothers has come and reported or spoken anything evil about you. "},{"num":22,"verse":"But we would like to hear from you what you think. For concerning this sect, we are aware that it is spoken against everywhere.”"},{"header":"The Response to Paul’s Message"},{"num":23,"verse":"After arranging a day with him, many came to him at his lodging. From dawn to dusk he expounded and witnessed about the kingdom of God. He tried to persuade them concerning Jesus from both the Law of Moses and the Prophets. "},{"num":24,"verse":"Some were persuaded by what he said, but others did not believe."},{"num":25,"verse":"Disagreeing among themselves, they began to leave after Paul made one statement: “The Holy Spirit correctly spoke through the prophet Isaiah to your ancestors "},{"num":26,"verse":"when He said,"},{"num":28,"verse":"Therefore, let it be known to you that this saving work of God has been sent to the Gentiles; they will listen!” "},{"num":29,"verse":"[After he said these things, the Jews departed, while engaging in a prolonged debate among themselves.]"},{"header":"Paul’s Ministry Unhindered"},{"num":30,"verse":"Then he stayed two whole years in his own rented house. And he welcomed all who visited him, "},{"num":31,"verse":"proclaiming the kingdom of God and teaching the things concerning the Lord Jesus Christ with full boldness and without hindrance."}]