[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(3) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Trumpet.—",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Heb., ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shôphar. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 81:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 98:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". LXX., ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "σάλπιγξ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) It was the crooked horn, sometimes also called ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "keren. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Bïble Educator, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "2:231.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psaltery and harp.—See Note, Psalm 33:2.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Psaltery and harp.—",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "See Note, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 33:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 150:3-5",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 150:3-5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Praise him with the sound of the trumpet, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — “It is impossible for us to distinguish,” says Dr. Horne, “and describe the several sorts of musical instruments here mentioned, as the Hebrews themselves acknowledge their ignorance in this particular. Thus much is clear, that the people of God were enjoined to use all the various kinds of them in the performance of their divine services.” “And why,” adds he, “should they not be so used under the gospel? We read of sacred music before the law, in the instance of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Miriam, the prophetess, the sister of Aaron, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "who, to celebrate the deliverance from Pharaoh and the Egyptians, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "took a timbrel in her hand, and the ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "women ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "went out after her with timbrels and dances, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 15:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The custom, therefore, was not introduced by the law, nor abolished with it. Well-regulated music, if ever it had the power of calming the passions, if ever it enlivened and exalted the affections of men in the worship of God, (purposes for which it was formerly employed,) doubtless hath still the same power, and can still afford the same aids to devotion. When the beloved disciple was, in spirit, admitted into the celestial choir, he not only heard them ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "singing ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "hymns of praise, but he heard likewise ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the voice of harpers, harping upon their harps, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 14:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And why that which saints are represented as doing in heaven, should not be done, according to their skill, by saints upon earth; or why instrumental music should be abolished as a legal ceremony, and vocal music, which was as much so, should be retained, no good reason can be assigned. Sacred music, under proper regulations, removes the hinderances of our devotion, cures the distraction of our thoughts, and banishes weariness from our minds. It adds solemnity to the public service, raises all the devout passions of the soul, and causes our duty to become our delight. ‘Of the pleasures of heaven,’ says the eloquent and elegant Bishop Atterbury, ‘nothing further is revealed to us, than that they consist in the practice of holy music and holy love; the joint enjoyment of which, we are told, is to be the happy lot of all pious souls to endless ages.’ It may be added, that there is no better method of combating the mischievous effects flowing from the abuse of music than by applying it to its true and proper use. If the worshippers of Baal join in a chorus to celebrate the praises of their idol, the servants of Jehovah should drown it by one that is stronger and more powerful, in praise of Him who made heaven and earth. If the men of the world rejoice in the object of their adoration, let the children of Zion be joyful in their King.” The best music, however, in God’s ears, is that of devout and pious affections. We must praise God with a strong faith, and with a holy love and delight; with entire confidence in Christ, and a believing triumph over the powers of darkness; with earnest desire toward him, and full satisfaction in him. We must praise him by a universal respect to all his commands, and a cheerful submission to all his dispensations; by rejoicing in his love, and solacing ourselves in his great goodness; by promoting the interest of the kingdom of his grace, and by enjoying and maintaining a lively hope and expectation of the kingdom of his glory. Without these, and such like devout and pious affections and dispositions, the best and most perfect harmony and melody of musical sounds, whether from voices or instruments, is as insignificant before God, as the harsh and discordant noises of a sounding brass or tinkling cymbal.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "150:1-6 A psalm of praise. - We are here stirred up to praise God. Praise God for his sanctuary, and the privileges we enjoy by having it among us; praise him because of his power and glory in the firmament. Those who praise the Lord in heaven, behold displays of his power and glory which we cannot now conceive. But the greatest of all his mighty acts is known in his earthly sanctuary. The holiness and the love of our God are more displayed in man's redemption, than in all his other works. Let us praise our God and Saviour for it. We need not care to know what instruments of music are mentioned. Hereby is meant that in serving God we should spare no cost or pains. Praise God with strong faith; praise him with holy love and delight; praise him with entire confidence in Christ; praise him with believing triumph over the powers of darkness; praise him by universal respect to all his commands; praise him by cheerful submission to all his disposals; praise him by rejoicing in his love, and comforting ourselves in his goodness; praise him by promoting the interests of the kingdom of his grace; praise him by lively hope and expectation of the kingdom of his glory. Since we must shortly breathe our last, while we have breath let us praise the Lord; then we shall breathe our last with comfort. Let every thing that hath breath praise the Lord. Praise ye the Lord. Such is the very suitable end of a book inspired by the Spirit of God, written for the work of praise; a book which has supplied the songs of the church for more than three thousand years; a book which is quoted more frequently than any other by Christ and his apostles; a book which presents the loftiest ideas of God and his government, which is fitted to every state of human life, which sets forth every state of religious experience, and which bears simple and clear marks of its Divine origin.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Praise him with the sound of the trumpet - Margin, cornet. In this verse and the verses following there is an allusion to the instruments of music which were commonly employed in Hebrew worship. The idea is, that all these - all that could properly express praise - should be used to celebrate the praises of God. Each one, with its own distinct note, and all combined in harmony, should be employed for this purpose. Most of these instruments, and many more, are now combined in the organ, where the instruments, instead of being played on by separate performers, are so united that they can be supplied with wind from one source - the bellows - and all played by one performer. Thus one mind directs the performance, securing, if skillfully done, perfect unity and harmony. This instrument was unknown to the Hebrews. Among them, each instrument had its own performer. The trumpet was principally used to call the people together, but it was also an important instrument among those used by the bands of musicians that performed in the temple, as its tones are now important ones in the organ.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Praise him with the psaltery and harp - Hebrew, the נבל  nebel and כנור  kinnôr. See these instruments described in the notes at Isaiah 5:12. The word here rendered psaltery is there rendered viol - \"And the harp and the viol,\" etc. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Praise him with the psaltery and harp - Hebrew, the נבל  nebel and כנור  kinnôr. See these instruments described in the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 5:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The word here rendered psaltery is there rendered viol - \"And the harp and the viol,\" etc. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3, 4. trumpet—used to call religious assemblies;",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Praise him with the sound of the trumpet,.... Which was used in calling the assembly together, for worship and on other occasions; and at the feast of blowing of trumpets, and in the year of jubilee, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 10:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and by the priests in temple service, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 16:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and was typical of the Gospel, which gives a certain and joyful sound, and is the cause and means of praising God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 27:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "praise him with the psaltery; to which psalms were sung; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and harp; which were instruments of music, both used in divine worship under the former dispensation; and in which David was well skilled and delighted, and appointed proper persons to praise with them, 1 Chronicles 15:20. They were typical of the spiritual melody made in the hearts of God's people, while they are praising him in psalms, hymns, and spiritual songs, under the Gospel, Ephesians 5:19. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and harp; which were instruments of music, both used in divine worship under the former dispensation; and in which David was well skilled and delighted, and appointed proper persons to praise with them, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 15:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". They were typical of the spiritual melody made in the hearts of God's people, while they are praising him in psalms, hymns, and spiritual songs, under the Gospel, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ephesians 5:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Praise him with the sound of the {c} trumpet: praise him with the psaltery and harp.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Praise him with the sound of the ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{c}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " trumpet: praise him with the psaltery and harp.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) Exhorting the people only to rejoice in praising God, he makes mention of those instruments which by God's commandment were appointed in the old law. (Ed.)",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "with the sound of the trumpet",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] With blast of cornet. The ‘cornet,’ originally a ram’s or cow’s horn, perhaps in later times a metal instrument of the same shape, was mainly employed for secular purposes, while the instrument generally used in religious ceremonies was the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "chatsôtserâh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or straight metal trumpet. Cp. however ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 47:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 81:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 98:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It was ordinarily the work of the priests to blow the trumpet (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 15:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nehemiah 12:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nehemiah 12:41",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and often); Levites are often described as playing psalteries and harps and cymbals (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 25:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 25:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nehemiah 12:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); tambourines were beaten by women as they danced (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 68:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); the terms used for stringed instruments and pipes are not elsewhere connected with religious ceremonies. Thus the call to praise is addressed to priests, Levites, and people; and every kind of instrument is to be enlisted in the service.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "psaltery and harp",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "harp and lyre",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "nçbhel",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "kinnôr",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " were both stringed instruments, but the precise distinction between them is unknown. There are some reasons for thinking that the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "nçbhel",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (A.V. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "psaltery",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in the Historical Books and Psalms[92], ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "viol",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in the Prophets) was the larger and more elaborate instrument. See Driver’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Joel and Amos",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", p. 234; and for illustrations of ancient lyres and harps, see Stainer, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Music of the Bible",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Chaps. i, ii.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[92] These books were in the hands of the Westminster and Cambridge companies, and the Westminster company consisted mainly of Cambridge scholars, while the Prophets were in the hands of an Oxford company. In the Apocrypha also, which was revised by a Cambridge company, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "psaltery",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is used, but not ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "viol",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 3.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Praise him with the sound of the trumpet",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", (On the use of the trumpet in Divine service, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 23:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 25:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 10:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 6:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 13:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 15:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 16:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 5:12, 13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 7:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 29:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 81:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 98:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Praise him with the psaltery and harp",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 57:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 81:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 108:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 15:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 5:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.). Psalm 150:3",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The Synagogue reckons up thirteen divine attributes according to ex. Psa 34:6. (שׁלשׁ עשׂרה מדּות), to which, according to an observation of Kimchi, correspond the thirteen הלּל of this Psalm. It is, however, more probable that in the mind of the poet the tenfold halaluw encompassed by Hallelujah's is significative; for ten is the number of rounding off, completeness, exclusiveness, and of the extreme of exhaustibleness. The local definitions in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 150:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " are related attributively to God, and designate that which is heavenly, belonging to the other world, as an object of praise. קדשוּ (the possible local meaning of which is proved by the קדשׁ and קדשׁ קדשׁים of the Tabernacle and of the Temple) is in this passage the heavenly היכל; and רקיע עזּו is the firmament spread out by God's omnipotence and testifying of God's omnipotence (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 68:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), not according to its front side, which is turned towards the earth, but according to the reverse or inner side, which is turned towards the celestial world, and which marks it off from the earthly world. The third and fourth hălalu give as the object of the praise that which is at the same time the ground of the praise: the tokens of His גּבוּרה, i.e., of His all-subduing strength, and the plenitude of His greatness (גּדלו  equals  גּדלו), i.e., His absolute, infinite greatness. The fifth and sixth hălalu bring into the concert in praise of God the ram's horn, שׁופר, the name of which came to be improperly used as the name also of the metallic חצצרה (vid., on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 81:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and the two kinds of stringed instruments (vid., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 33:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), viz., the nabla (i.e., the harp and lyre) and the kinnor (the cithern), the ψαλτήριον and the κιθάρα (κινύρα). The seventh hălalu invites to the festive dance, of which the chief instrumental accompaniment is the תּף (Arabic duff, Spanish adufe, derived from the Moorish) or tambourine. The eighth hălalu brings on the stringed instruments in their widest compass, מנּים (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 45:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") from מן, Syriac menı̂n, and the shepherd's pipe, עגב (with the Gimel raphe  equals  עוּגב); and the ninth and tenth, the two kinds of castanets (צלצלי, construct form of צלצלים, singular צלצל), viz., the smaller clear-sounding, and the larger deeper-toned, more noisy kinds (cf. κύμβαλον ἀλαλάζον, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 13:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), as צלצלי שׁמע (pausal form of שׁמע  equals  שׁמע, like סתר in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 27:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and frequently, from סתר  equals  סתר) and צלצלי תרוּעה are, with Schlultens, Pfeifer, Burk, Kster, and others, to be distinguished. ",
        "children": []
      }
    ]
  }
]