[{"header":"Jesus appears again to the disciples"},{"num":21,"verse":"Later, Jesus himself appeared again to his disciples at the Sea of Tiberias. This is how it happened:"},{"num":2,"verse":"Simon Peter, Thomas (called Didymus), Nathanael from Cana in Galilee, Zebedee’s sons, and two other disciples were together."},{"num":3,"verse":"Simon Peter told them, “I’m going fishing.”"},{"num":4,"verse":"Early in the morning, Jesus stood on the shore, but the disciples didn’t realize it was Jesus."},{"num":5,"verse":"Jesus called to them, “Children, have you caught anything to eat?”"},{"num":6,"verse":"He said, “Cast your net on the right side of the boat and you will find some.”"},{"num":7,"verse":"Then the disciple whom Jesus loved said to Peter, “It’s the Lord!” When Simon Peter heard it was the Lord, he wrapped his coat around himself (for he was naked) and jumped into the water."},{"num":8,"verse":"The other disciples followed in the boat, dragging the net full of fish, for they weren’t far from shore, only about one hundred yards."},{"num":9,"verse":"When they landed, they saw a fire there, with fish on it, and some bread."},{"num":10,"verse":"Jesus said to them, “Bring some of the fish that you’ve just caught.”"},{"num":11,"verse":"Simon Peter got up and pulled the net to shore. It was full of large fish, one hundred fifty-three of them. Yet the net hadn’t torn, even with so many fish."},{"num":12,"verse":"Jesus said to them, “Come and have breakfast.” None of the disciples could bring themselves to ask him, “Who are you?” They knew it was the Lord."},{"num":13,"verse":"Jesus came, took the bread, and gave it to them. He did the same with the fish."},{"num":14,"verse":"This was now the third time Jesus appeared to his disciples after he was raised from the dead."},{"header":"Jesus and Peter"},{"num":15,"verse":"When they finished eating, Jesus asked Simon Peter, “Simon son of John, do you love me more than these?”"},{"num":16,"verse":"Jesus asked a second time, “Simon son of John, do you love me?”"},{"num":17,"verse":"He asked a third time, “Simon son of John, do you love me?”"},{"num":18,"verse":"I assure you that when you were younger you tied your own belt and walked around wherever you wanted. When you grow old, you will stretch out your hands and another will tie your belt and lead you where you don’t want to go.”"},{"num":19,"verse":"He said this to show the kind of death by which Peter would glorify God. After saying this, Jesus said to Peter, “Follow me.”"},{"header":"Jesus and the disciple whom he loved"},{"num":20,"verse":"Peter turned around and saw the disciple whom Jesus loved following them. This was the one who had leaned against Jesus at the meal and asked him, “Lord, who is going to betray you?”"},{"num":21,"verse":"When Peter saw this disciple, he said to Jesus, “Lord, what about him?”"},{"num":22,"verse":"Jesus replied, “If I want him to remain until I come, what difference does that make to you? You must follow me.”"},{"num":23,"verse":"Therefore, the word spread among the brothers and sisters that this disciple wouldn’t die. However, Jesus didn’t say he wouldn’t die, but only, “If I want him to remain until I come, what difference does that make to you?”"},{"num":24,"verse":"This is the disciple who testifies concerning these things and who wrote them down. We know that his testimony is true."},{"num":25,"verse":"Jesus did many other things as well. If all of them were recorded, I imagine the world itself wouldn’t have enough room for the scrolls that would be written."}]