[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(22) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "A little one shall become a thousand.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The noun is probably to be taken not in its merely numerical value, but, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 6:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Samuel 23:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 5:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", for a clan or sub-division of a tribe.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "60:15-22 We must look for the full accomplishment in times and things, exceeding those of the Old Testament church. The nations and their kings shall lay themselves out for the good of the church. Such a salvation, such a redemption, shall be wrought out for thee, as discovers itself to be the work of the Lord. Every thing shall be changed for the better. In thy land shall no more be heard threats of those that do violence, nor complaints of those that suffer violence. Thy walls shall be means of safety, thy gates shall be written upon with praises to God. In the close of this chapter are images and expressions used in the description of the New Jerusalem, Re 21:23; 22:5. Nothing can answer to this but some future glorious state of the church on earth, or the state of the church triumphant in heaven. Those that make God their only light, shall have him their all-sufficient light. And the happiness shall know no change or alloy. No people on earth are all righteous; but there are no mixtures in heaven. They shall be wholly righteous. The spirits of just men shall there be made perfect. The glory of the church shall be to the honour of God. When it shall be finished, it will appear a work of wonder. It may seem too difficult to be brought about, but the God of almighty power has undertaken it. It may seem to be delayed and put off; but the Lord will hasten it in the time appointed by his wisdom, though not in the time prescribed by our folly. Let this hope cheer us under all difficulties, and stir us up to all diligence, that we may have an abundant entrance into this everlasting kingdom of our Lord and Saviour Jesus Christ.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "A little one shall become a thousand - There shall be a great increase, as if one, and that the smallest, should be multiplied to a thousand. The idea is, that the people, then small in number, would be greatly increased by the accession of the Gentile world. Lowth and Noyes render this, 'The little one.' Grotius, 'The least one.' So the Septuagint, Ο ὀλιγιστὸς  Ho oligistos.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I the Lord will hasten it in his time - Noyes, 'Its time.' Lowth 'Due time.' Septuagint, 'I will do it in the proper time' (κατα καιρὸν  kata kairon). The sense is, that this would be done at the proper time - called, in Galatians 4:4, 'the fullness of time.' There was a proper season when this was to be accomplished. There were important preparations to be made before it could be done. The nations, under the divine arrangement, were to be put into a proper position to receive the Messiah. He was not to come until:",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I the Lord will hasten it in his time - Noyes, 'Its time.' Lowth 'Due time.' Septuagint, 'I will do it in the proper time' (κατα καιρὸν  kata kairon). The sense is, that this would be done at the proper time - called, in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Galatians 4:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", 'the fullness of time.' There was a proper season when this was to be accomplished. There were important preparations to be made before it could be done. The nations, under the divine arrangement, were to be put into a proper position to receive the Messiah. He was not to come until:",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "1. The experiment had been fairly made to show how weak and feeble man was without a rerelation - to show that philosophy, and learning, and the policy of statesmen, could do nothing effectual for the salvation of men.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "2. He was not to come until the world should be at peace, and until there would be facilities for the rapid propagation of religion in all lands.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "3. Or was he to come until all that had been said in prophecy should be fulfilled - until all the circumstances should combine, which had been foretold as favorable to the introduction of the reign of the Messiah. But when that period should arrive, then the Lord would 'hasten' it.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "There would be no unnecessary delay; none which the circumstances of the case did not call for. So it will be in the universal spread of the gospel referred to in this chapter. When the world shall be moulded into a proper state to welcome it; when the nations are prepared to receive it and profit by it; then the universal propagation shall be hastened, and a nation shall be born in a day (see the notes at Isaiah 66:8). Meantime, for the coming of that day we should pray and labor. By the diffusion of truth: by schools; by the spread of the Bible; by preaching; by the translation of the Word of God into every language: by establishing the press in all the strong points of Pagan influence; by placing missionaries in all the holds of power in the pagan world; and by training up many to enter into the harvest, the Christian world should prepare for the universal conversion of the world to God. In due time it shall be hastened. and 'he that shall come, will come, and will not tarry' Hebrews 10:37. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "There would be no unnecessary delay; none which the circumstances of the case did not call for. So it will be in the universal spread of the gospel referred to in this chapter. When the world shall be moulded into a proper state to welcome it; when the nations are prepared to receive it and profit by it; then the universal propagation shall be hastened, and a nation shall be born in a day (see the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 66:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Meantime, for the coming of that day we should pray and labor. By the diffusion of truth: by schools; by the spread of the Bible; by preaching; by the translation of the Word of God into every language: by establishing the press in all the strong points of Pagan influence; by placing missionaries in all the holds of power in the pagan world; and by training up many to enter into the harvest, the Christian world should prepare for the universal conversion of the world to God. In due time it shall be hastened. and 'he that shall come, will come, and will not tarry' ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 10:37",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "22. little one—Even one, and that the smallest in number and rank, shall be multiplied a thousandfold in both respects (Mic 5:2; Mt 13:31, 32).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "his time—not our time; we might wish to hasten it, but it will come in due time, as in the case of Jesus' first coming (Ga 4:4); so in that of the restoration of Israel and the conversion of the world (Isa 66:8; Hab 2:3; Ac 1:7; Heb 10:37).   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "A little one shall become a thousand; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " though of very small beginning, and contemptible, yet shall greatly multiply. Though the church at first will be but a very few, yet will it increase into many thousands; this plant or seed will spring up to many. Some understand it, that many shall be converted, and brought into the church, by men of very few, low, and mean parts; however, these things seem to agree better to some state of the church here, than to the state of the church triumphant. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "A small one a strong nation:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " if this signify, not the same with the other, as probably it may, the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "strong",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " signifying numerous, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Joel 1:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joel 1:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", then we may understand it, that as the former respected ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "their number",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", so this their ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "strength",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Will hasten it in his time, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " viz. in due time, the time that I have appointed: q.d. Let not this be doubted, because I have undertaken it, to whom nothing is difficult. When the time of the promise comes, he will make haste, it will be done speedily; or as soon as it begins it shall hasten apace, as it did in Peter’s sermon, three thousand in one day, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ac 2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and five thousand in another, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ac 4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and so soon filled the whole world, and one Paul planted whole churches, as the people in Egypt increased from seventy persons to a vast multitude. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "A little one shall become a thousand,.... A small family, a little handful of people in all ages, scattered up and down in the world, of no esteem and account in it, being all gathered together, that ever were in the world, will appear to be thousands and millions, and such a number as no man can number, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 7:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and a small one a strong nation; a company of weak persons, persecuted by their enemies, and unable to resist them, as in the present state: now there will be a nation of them strong and mighty; the feeble among them shall be as David, and the house of David as God, as the Angel of the Lord, Zechariah 12:8, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and a small one a strong nation; a company of weak persons, persecuted by their enemies, and unable to resist them, as in the present state: now there will be a nation of them strong and mighty; the feeble among them shall be as David, and the house of David as God, as the Angel of the Lord, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 12:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "I the Lord will hasten it in his time: as there was a fixed appointed time for Christ's first coming, so there is for his second coming, when this state and dispensation of things will commence; and when that time comes, it will be deferred no longer; as soon as ever it is up, the Lord will hasten the accomplishment of what he has promised, and who is able also to perform; see 1 Timothy 6:15. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I the Lord will hasten it in his time: as there was a fixed appointed time for Christ's first coming, so there is for his second coming, when this state and dispensation of things will commence; and when that time comes, it will be deferred no longer; as soon as ever it is up, the Lord will hasten the accomplishment of what he has promised, and who is able also to perform; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Timothy 6:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "A little one shall become a {x} thousand, and a small one a strong nation: I the LORD will hasten it in its time.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "A little one shall become a ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{x}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " thousand, and a small one a strong nation: I the LORD will hasten it in its time.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(x) Meaning, that the Church would be miraculously multiplied.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "A little one … a small one",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Better perhaps: ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The least … the smallest",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The word for “thousand” (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "’éleph",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") means also a larger or smaller group of families,—“clan” or ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "tribe",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This is doubtless the sense in which it is employed here: comp. the parallel “nation” in the next line.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "will hasten it in his time",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The fulfilment shall be instantaneous when once the appointed time has arrived. The reference is to the whole of the preceding prophecy.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 22.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "A little one",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the \"little flock\" of our Lord's own time on earth (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 12:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), will become a ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "strong nation - a",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " countless multitude (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 7:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). In his time; rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "in its time",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", when the time fixed in God's counsels for the final establishment of Christ's kingdom arrives. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Isaiah 60:22",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The life of this church, which is newly created, new-born, through judgment and grace, gradually expands from the most unassuming centre in ever widening circles until it has attained the broadest dimensions. \"The smallest one will become thousands, and the meanest one a powerful nation.\" \"The small and mean one,\" or, as the idea is a relative one, \"the smallest and meanest one\" (Ges. 119, 2), is either a childless one, or one blessed with very few children. At the same time, the reference is not exclusively to growth through the blessing of children, but also to growth through the extension of fellowship. We have a similar expression in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 4:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cf., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 5:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), where 'eleph is employed, just as it is here, in the sense of לאלף, \"to thousands (or chiliads).\" ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The whole of the prophetic address is now sealed with this declaration: \"I Jehovah, will hasten it in His time.\" The neuter נּה (as in Isaiah 43:13; Isaiah 46:11) refers to everything that has been predicted from Isaiah 60:1 downwards. Jehovah will fulfil it rapidly, when the point of time (καιρός) which He has fixed for it shall have arrived. As this point of time is known to Him only, the predicted glory will burst all at once with startling suddenness upon the eyes of those who have waited believingly for Him. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The whole of the prophetic address is now sealed with this declaration: \"I Jehovah, will hasten it in His time.\" The neuter נּה (as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 43:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 46:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") refers to everything that has been predicted from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 60:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " downwards. Jehovah will fulfil it rapidly, when the point of time (καιρός) which He has fixed for it shall have arrived. As this point of time is known to Him only, the predicted glory will burst all at once with startling suddenness upon the eyes of those who have waited believingly for Him. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "This chapter forms a connected and self-contained whole, as we may see very clearly from the address to Zion-Jerusalem, which is sustained throughout. If we compare together such passages as Isaiah 51:17-23 (\"Awake, awake, stand up, O Jerusalem\"), Isaiah 52:1-2 (\"Awake, awake, put on thy strength, O Zion\"), and chapter 54 (\"Sing, O barren\"), which are all closely related so far as their contents are concerned, we shall find that these addresses to Zion form an ascending series, chapter 60 being the summit to which they rise, and that the whole is a complete counterpart to the address to the daughter of Babylon in Isaiah 47:1-15. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "This chapter forms a connected and self-contained whole, as we may see very clearly from the address to Zion-Jerusalem, which is sustained throughout. If we compare together such passages as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 51:17-23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (\"Awake, awake, stand up, O Jerusalem\"), ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 52:1-2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (\"Awake, awake, put on thy strength, O Zion\"), and chapter 54 (\"Sing, O barren\"), which are all closely related so far as their contents are concerned, we shall find that these addresses to Zion form an ascending series, chapter 60 being the summit to which they rise, and that the whole is a complete counterpart to the address to the daughter of Babylon in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 47:1-15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      }
    ]
  }
]