[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(8) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Who are these . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The vision of the prophet brings before him the cloud-like sails of the ships that. are bringing back the exiles over the Mediterrauear and the Red Seas, hastening to their home like doves to their dove-cote. (Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 11:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 60:8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 60:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Who are these that fly as a cloud — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "These metaphors import the number, as well as speed, of those that should be begotten by the apostles’ doctrine. “By this new crowd of believers hastening to the church,” Vitringa understands “the Greeks and Asiatics, and those of the west groaning under the Ottoman empire, who, having long sat in a state of ignorance and superstition, at this period shall be freed from their yoke, and hasten to the enlightened church in multitudes, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "like a cloud, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and with zeal and impetuosity, (like doves to their cotes or holes,) when once made acquainted with the wonderful change of things, and the mighty works wrought by God for the deliverance of his people. The flight of doves, especially when they return to their cotes, is remarkably swift and precipitate.” ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "60:1-8 As far as we have the knowledge of God in us, and the favour of God towards us, our light is come. And if God's glory is seen upon us to our honour, we ought, not only with our lips, but in our lives, to return its praise. We meet with nothing in the history of the Jews which can be deemed a fulfilment of the prophecy in this chapter; we must conclude it relates principally to future events. It predicts the purity and enlargement of the church. The conversion of souls is here described. They fly to Christ, to the church, to the word and ordinances, as doves to their own home; thither they fly for refuge and shelter, thither they fly for rest. What a pleasant sight to see poor souls hastening to Christ!",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Who are these that fly as a cloud? - In multitudes so numerous, that they appear as a dense cloud. The prophet, in vision, sees a vast multitude coming to Jerusalem, or hastening to embrace the true religion - so numerous as to excite surprise, and to lead to the question, Who can they be? (compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 49:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) It is not uncommon to compare a multitude of persons to a cloud. Thus Livy (xxxv. 49), Rex contra peditum equitumque nubes jactat. Thus in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 12:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the number of witnesses who are said to encompass Christians is compared to a cloud (νέφος μαρτύρων  nephos marturōn). So Virgil (Geor. iv. 60) compares a swarm of bees to a cloud - obscuramque trahi vento mirabere nubem. The Chaldee understands this of swift clouds, and takes the point of the comparison to be the velocity with which they would come. 'Who are these that come publicly (בגלי  bigelay) as swift clouds?' But the comparison relates probably to the number, rather than to the swiftness with which they would come. Converts would be multiplied in such numbers, that they would seem to be like dense clouds making their way to Zion. This strikingly expresses the fact of the numerous conversions among the Gentiles, and is a most beautiful description of a revival of religion.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And as the doves to their windows - Lowth renders this, 'Like doves upon the wing' - supposing with Houbigant, that there is a slight error in the Hebrew text. The Septuagint renders it, Σὺν νοσσοῖς  Sun nossois - 'With their young.' But the true idea is contained in the common version. Doves fly to their houses, or to their windows, in an approaching storm. In like manner converts would hasten to Zion from the pagan world. They would come in great numbers, and would feel that if there they would be safe. Morier, in his \"Second Journey,\" p. 140, has well illustrated this passage - 'In the environs of the city' (Ispahan), says he, 'to the westward, near Zainderood, are many pigeon-houses, erected at a distance from habitations, for the purpose of collecting pigeon's dung for manure; They are large, round towers, rather broader at the bottom than at the top, crowned by conical spiracles, through which the pigeons descend. Their interior resembles a honey-comb, pierced with a thousand holes, each of which forms a snug retreat for a nest. The extraordinary flights of pigeons which I have seen upon one of these buildings affords, perhaps, a good illustration of Isaiah 60:8. Their great numbers, and the compactness of their mass, literally looked like a cloud at a distance, and obscured the sun in their passage.' The prediction here has already, in part at least, been fulfilled. The rapid conversions in file time of the apostles accorded with this prediction. In numerous revivals of religion, also, has there been a fulfillment of it; and we are yet to anticipate a far more striking and glorious completion of it in the conversion of the pagan world to the Christian faith. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And as the doves to their windows - Lowth renders this, 'Like doves upon the wing' - supposing with Houbigant, that there is a slight error in the Hebrew text. The Septuagint renders it, Σὺν νοσσοῖς  Sun nossois - 'With their young.' But the true idea is contained in the common version. Doves fly to their houses, or to their windows, in an approaching storm. In like manner converts would hasten to Zion from the pagan world. They would come in great numbers, and would feel that if there they would be safe. Morier, in his \"Second Journey,\" p. 140, has well illustrated this passage - 'In the environs of the city' (Ispahan), says he, 'to the westward, near Zainderood, are many pigeon-houses, erected at a distance from habitations, for the purpose of collecting pigeon's dung for manure; They are large, round towers, rather broader at the bottom than at the top, crowned by conical spiracles, through which the pigeons descend. Their interior resembles a honey-comb, pierced with a thousand holes, each of which forms a snug retreat for a nest. The extraordinary flights of pigeons which I have seen upon one of these buildings affords, perhaps, a good illustration of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 60:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Their great numbers, and the compactness of their mass, literally looked like a cloud at a distance, and obscured the sun in their passage.' The prediction here has already, in part at least, been fulfilled. The rapid conversions in file time of the apostles accorded with this prediction. In numerous revivals of religion, also, has there been a fulfillment of it; and we are yet to anticipate a far more striking and glorious completion of it in the conversion of the pagan world to the Christian faith. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8. The prophet, seeing in vision new hosts approaching quickly like a cloud of doves, asks who they are.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " In the 4th verse he spake to them as upon some high watch tower, whereby they might behold as in a circle all the parts of the world. Now espying from all parts, he brings them in calling out with admiration, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Who are these?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " partly with reference to the number, or partly with reference to the persons; so the Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "What are these",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "? they being not Jews, but strangers, and so directly intimating the Gentiles flocking into the church, that come so swiftly, and in so great flocks: the same thing still. The former metaphor of clouds imports their number as well as their speed, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ezekiel 38:9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 38:9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ": thus abundance of witnesses is called a cloud of witnesses, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Hebrews 12:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 12:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ": the scope is to note the great confluence of people that should come into the church, that should be begotten by the apostles’ doctrine; which the LXX. translation seems to point at, who render it as ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "doves with their young ones unto me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and by ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "flying",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " may be noted their spiritual state, being elevated above the world, . as the clouds above the earth, and doves when upon the wing. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Who are these that fly as a cloud,.... Referring to the vast number of converts before mentioned, who are compared to a \"cloud\" for the number of them, covering Judea as the clouds do the heavens; and for their elevation and situation, being raised from an earthly to a heavenly state; called with a high calling, and made partakers of an heavenly one; and for their being filled with the grace of God, as clouds with water; and for their unanimity, their coming together in a body, making as it were one cloud, and that openly and publicly, professing Christ, and joining themselves to his church, in the face of the world; and so the Targum, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"who are these that come publicly as the swift clouds?'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and chiefly are they compared to a cloud for their swiftness in motion to Christ and his church; sinners; sensible of danger from the avenging justice of God, from his law, and from his wrath and displeasure, and eternal death, and being apprized of salvation and safety in Christ, make haste and flee to him as swiftly as a cloud driven by the winds; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and as the doves to their windows; or \"dove houses\", or \"lockers and holes\" (c); through which they enter, and to which they bend their course with great swiftness, when pursued by birds of prey, or through an eager desire after their young: converted persons may be compared to doves for their being a clean and cleanly creature; for their being amiable and lovely, chaste and loving; harmless and inoffensive, meek and humble, weak and timorous; mournful and disconsolate when they have lost their mate; and what dove houses are to these, Christ and his church are to converted persons, whither they flee for rest and shelter, and where they have both: the ordinances of Christ may be particularly meant by these holes or windows that doves make unto; by which, especially baptism, they enter into the church, and by means of which light is let into them, and through which Christ shows himself to them, Sol 2:9, what engages them to flee hither is their love to Christ, in order to have communion with him, and food for their faith; and when he causes them to come, or draws them by his grace, nothing can hinder; not the reproaches of the world, nor the temptations of Satan; nor objections from their own unworthiness. These words are said by the church, by way of admiration wondering at their numbers and swiftness in coming to her; see Isaiah 49:21. The Targum is ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and as the doves to their windows; or \"dove houses\", or \"lockers and holes\" (c); through which they enter, and to which they bend their course with great swiftness, when pursued by birds of prey, or through an eager desire after their young: converted persons may be compared to doves for their being a clean and cleanly creature; for their being amiable and lovely, chaste and loving; harmless and inoffensive, meek and humble, weak and timorous; mournful and disconsolate when they have lost their mate; and what dove houses are to these, Christ and his church are to converted persons, whither they flee for rest and shelter, and where they have both: the ordinances of Christ may be particularly meant by these holes or windows that doves make unto; by which, especially baptism, they enter into the church, and by means of which light is let into them, and through which Christ shows himself to them, Sol 2:9, what engages them to flee hither is their love to Christ, in order to have communion with him, and food for their faith; and when he causes them to come, or draws them by his grace, nothing can hinder; not the reproaches of the world, nor the temptations of Satan; nor objections from their own unworthiness. These words are said by the church, by way of admiration wondering at their numbers and swiftness in coming to her; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 49:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The Targum is ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"the, captivity of Israel, who are gathered together, and come to their own land, as doves that return to their dove houses.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(c)  \"ad columbaria sua\", Montanus, Vitringa; \"in suis forulis\", Castalio Gataker. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(c)  \"ad columbaria sua\", Montanus, Vitringa; \"in suis forulis\", Castalio Gataker. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Who are these {i} that fly as a cloud, and as doves to their windows?",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Who ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "are",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " these ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{i}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "that",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " fly as a cloud, and as doves to their windows?",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(i) Showing what great number will come to the Church, and with what great diligence and zeal.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "as doves to their windows",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 8:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The point of comparison is rather the swiftness of the flight, than the whiteness of the wings and sails.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "8, 9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". From the East the prophet turns to the West, and describes the ships of the Mediterranean “like white doves upon the wing” converging on Jerusalem. These also bring from afar the exiled sons of Zion, as well as rich treasures from the nations.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 8.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Who are",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "these,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " etc.? The prophet beholds the waters of the Mediterranean Sea covered with numerous ships, whose sails remind him of white clouds moving across the blue expanse of heaven, and again of doves wending their way homewards to their accustomed dove-cotes. The \"windows\" of the dove-cotes are the openings through which the birds pass into the towers where they breed. Isaiah 60:8",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "From the mainland, over which caravans and flocks are coming, the prophet now turns his eyes to the sea. \"Who are these who fly hither as a cloud, and like the doves to their windows? Yea, the islands wait for me; and the ships of Tarshish come first, to bring thy children from far, their silver and gold with them, to the name of thy God, and to the holy One of Israel, because He hath ornamented thee.\" Upon the sea there appear first of all enigmatical shapes, driving along as swiftly as if they were light clouds flying before the wind (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 19:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 45:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), or like doves flying to their dovecots (celeres cavis se turribus abdunt, as Ovid says), i.e., to the round towers with their numerous pigeon-holes, which are provided for their shelter. The question is addressed to Zion, and the answer may easily be anticipated - namely, that this swarm of swiftly flying figures are hurrying to a house which they long to reach, as much as pigeons do to reach their pigeon-house. The kı̄ which follows is explanatory: this hurrying presents itself to thine eyes, because the isles wait for me. The reason for all this haste is to be found in the faith of those who are hurrying on. The Old Testament generally speaks of faith as hope (ל קוּה as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 51:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 42:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); not that faith is the same as hope, but it is the support of hope, just as hope is the comfort of faith. In the Old Testament, when the true salvation existed only in promise, this epithet, for which there were many synonyms in the language, was the most appropriate one. The faith of the distant lands of the west is now beginning to work. The object of all this activity is expressed in the word להביא. The things thus flying along like clouds and doves are ships; with the Tartessus ships, which come from the farthest extremity of the European insular quarter of the globe, at their head (בּראשׁנה with munach instead of metheg, in the same sense as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 10:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; lxx ἐν πρώτοις; Jerome, in principio, in the foremost rank), i.e., acting as the leaders of the fleet which is sailing to Zion and bringing Zion's children from afar, and along with them the gold and silver of the owners of the vessels themselves, to the name (לשׁם, to the name, dative, not equivalent to למען; lxx διὰ, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 55:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") of thy God, whom they adore, and to the Holy One of Israel, because He hath ornamented thee, and thereby inspired them with reverence and love to thee (פארך for פארך, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 54:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where it even stands out of pause). ",
        "children": []
      }
    ]
  }
]