[{"header":"Apostles of Christ Jesus"},{"num":4,"verse":"You should think of us as servants of Christ, the ones God has trusted to do the work of making known his secret truths."},{"num":2,"verse":"Those who are trusted with such an important work must show that they are worthy of that trust."},{"num":3,"verse":"But I don’t consider your judgment on this point to be worth anything. Even an opinion from a court of law would mean nothing. I don’t even trust my own judgment."},{"num":4,"verse":"I don’t know of any wrong I have done, but that does not make me right. The Lord is the one who must decide if I have done well or not."},{"num":5,"verse":"So don’t judge anyone now. The time for judging will be when the Lord comes. He will shine light on everything that is now hidden in darkness. He will make known the secret purposes of our hearts. Then the praise each person should get will come from God."},{"num":6,"verse":"Brothers and sisters, I have used Apollos and myself as examples for you. I did this so that you could learn from us the meaning of the words, “Follow what the Scriptures say.” Then you will not brag about one person and criticize another."},{"num":7,"verse":"Who do you think you are? Everything you have was given to you. So, if everything you have was given to you, why do you act as if you got it all by your own power?"},{"num":8,"verse":"You think you have everything you need. You think you are rich. You think you have become kings without us. I wish you really were kings. Then we could rule together with you."},{"num":9,"verse":"But it seems to me that God has given me and the other apostles the last place. We are like prisoners condemned to die, led in a parade for the whole world to see—not just people but angels too."},{"num":10,"verse":"We are fools for Christ, but you think you are so wise in Christ. We are weak, but you think you are so strong. People give you honor, but they don’t honor us."},{"num":11,"verse":"Even now we still don’t have enough to eat or drink, and we don’t have enough clothes. We often get beatings. We have no homes."},{"num":12,"verse":"We work hard with our own hands to feed ourselves. When people insult us, we ask God to bless them. When people treat us badly, we accept it."},{"num":13,"verse":"When people say bad things about us, we try to say something that will help them. But people still treat us like the world’s garbage—everyone’s trash."},{"num":14,"verse":"I am not trying to make you feel ashamed, but I am writing this to counsel you as my own dear children."},{"num":15,"verse":"You may have ten thousand teachers in Christ, but you don’t have many fathers. Through the Good News I became your father in Christ Jesus."},{"num":16,"verse":"So I beg you to be like me."},{"num":17,"verse":"That is why I am sending Timothy to you. He is my son in the Lord. I love him and trust him. He will help you remember the way I live in Christ Jesus—a way of life that I teach in every meeting of the church wherever I am."},{"num":18,"verse":"Some of you are acting so proud, it seems as though you think I won’t be coming there again."},{"num":19,"verse":"But I will come to you very soon, the Lord willing. Then I will see if these proud talkers have the power to do anything more than talk."},{"num":20,"verse":"God’s kingdom is not seen in talk but in power."},{"num":21,"verse":"Which do you want: that I come to you with punishment, or that I come with love and gentleness?"}]