[{"num":6,"verse":"¶ In the year that king Uzziah died I saw the Lord sitting upon a throne, high and lifted up, and his train filled the temple."},{"num":2,"verse":"Above it stood the seraphims; each one had six wings; with two he covered his face, and with two he covered his feet, and with two he flew."},{"num":3,"verse":"And one cried out unto another and said, Holy, holy, holy is the LORD of the hosts; the whole earth is full of his glory."},{"num":4,"verse":"And the posts of the door moved at the voice of him that cried out, and the house was filled with smoke."},{"num":5,"verse":"¶ Then I said, Woe is me! for I am dead because I am a man of unclean lips, and I dwell in the midst of a people of unclean lips; for mine eyes have seen the King, the LORD of the hosts."},{"num":6,"verse":"Then one of the seraphim flew unto me, having a live coal in his hand which he had taken with the tongs from off the altar:"},{"num":7,"verse":"And he laid it upon my mouth and said, Behold, this has touched thy lips; and it shall take away thy guilt, and thy sin shall be cleansed."},{"num":8,"verse":"After this, I heard the voice of the Lord saying, Whom shall I send, and who will go for us? Then I answered, Here am I; send me."},{"num":9,"verse":"¶ Then he said, Go and tell this people, Hear indeed, but do not understand; and see indeed, but do not perceive."},{"num":10,"verse":"Make the heart of this people fat and make their ears heavy and blind their eyes that they not see with their eyes, nor hear with their ears, nor understand with their heart, nor convert and there be healing for him."},{"num":11,"verse":"And I said, Lord, how long? And he answered, Until the cities are wasted without inhabitant and not a man in the houses, and the land is turned into desert,"},{"num":12,"verse":"until the LORD has removed men far away, and there is great solitude in the midst of the land."},{"num":13,"verse":"But yet in it shall remain a tenth, and it shall return and shall be razed; as the teil tree and as the oak, of which the stump remains alive when they are cut down, likewise in these his stump shall remain holy seed."}]