[{"num":6,"verse":"In the year in which the king Uzziah was dead, I saw the Lord sitting on an high seat, and raised [up]; and the house (of the Lord) was full of his majesty, and those things that were under him filled the temple. (In the year when King Uzziah died, I saw the Lord sitting on his throne, high and exalted; and the House of the Lord was full of his majesty, and his robe filled the Temple.)"},{"num":2,"verse":"Seraphim stood on it, six wings were to one, and six wings to the other; with two wings they covered the face of him, and with two wings they covered the feet of him, and with two wings they flew. (Seraphim stood all around him, and each had six wings; with two wings they covered their face, and with two wings they covered their feet, and with two wings they flew.)"},{"num":3,"verse":"And they cried the one to the tother, and said, Holy, holy, holy is the Lord God of hosts; all [the] earth is full of his glory."},{"num":4,"verse":"And the lintels above of the hinges were moved together of the voice of the crier, and the house (of the Lord) was filled with smoke. (And the lintels above the hinges were shaken by the voices of the criers, and the Temple was filled with smoke.)"},{"num":5,"verse":"And I said, Woe to me, for I was still; for I am a man defouled in lips, and I dwell in the midst of the people having defouled lips, and I saw with mine eyes the King, (the) Lord of hosts. (And I said, Woe to me, for I am lost; for I am a man who hath defiled lips, and I live in the midst of a people who have defiled lips, and yet I saw with my own eyes the King, the Lord of hosts.)"},{"num":6,"verse":"And one of [the] seraphim flew to me, and a burning coal was in his hand, which coal he had taken with a (pair of) tong(s) from the altar."},{"num":7,"verse":"And he touched my mouth, and said, Lo! I have touched thy lips with this coal, and thy wickedness shall be done away, and thy sin shall be cleansed."},{"num":8,"verse":"And I heard the voice of the Lord, saying, Whom shall I send, and who shall go to you? And I said, Lo! I; send thou me."},{"num":9,"verse":"And he said, Go thou, and thou shalt say to this people, Ye hearing hear, and ye do not understand; and see ye the prophesy, and do not ye know. (And he said, Go thou, and thou shalt say to this people, Hearing ye may hear, but ye shall not understand; and ye may see the prophesy, but ye shall not know, or not understand, its meaning.)"},{"num":10,"verse":"Make thou blind the heart of this people, and aggrieve thou the ears thereof, and close thou the eyes thereof; lest peradventure it see with his eyes, and hear with his ears, and understand with his heart, and it be converted, and I make it whole. (Make thou blind the hearts of these people, and make thou deaf their ears, and close thou their eyes; lest peradventure they see with their eyes, and hear with their ears, and understand with their hearts, and they turn, or be converted, and I make them whole/and they be healed.)"},{"num":11,"verse":"And I said, Lord, how long? And he said, Till [the] cities be made desolate, without dweller, and houses without man. And the land shall be left desert, (And I said, Lord, how long? And he said, Until the cities be made desolate, yea, without any inhabitants, and the houses be left empty, yea, without anyone. And the land shall be left deserted,)"},{"num":12,"verse":"and the Lord shall make men afar (and the Lord shall send the people far away). And that that was forsaken in the middle of [the] earth, shall be multiplied,"},{"num":13,"verse":"and yet the tithing, either tenth part, shall be therein; and it shall be converted, and it shall be into showing, as a terebinth is, and as an oak, that spreadeth abroad his boughs; that shall be holy seed, that shall stand therein. (and even if but a tenth part of these people shall remain there, they shall all be destroyed, like a terebinth, or like an oak, that spreadeth abroad its boughs, and then is cut down; such shall be the fate of the holy generation, who shall be there.)"}]