[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6:2,3 Christ's church is a garden, enclosed, and separated from the world; he takes care of it, delights in it, and visits it. Those who would find Christ, must attend him in his ordinances, the word, sacraments, and prayer. When Christ comes to his church, it is to entertain his friends. And to take believers to himself: he picks the lilies one by one; and at the great day he will send forth his angels to gather all his lilies, that he may be for ever admired in them. The death of a believer is not more than the owner of a garden plucking a favourite flower; and He will preserve it from withering, yea, cause it to flourish for ever, with increasing beauty. If our own hearts can witness for us that we are Christ's, question not his being ours, for the covenant never breaks on his side. It is the comfort of the church, that he feeds among the lilies, that he takes delight in his people.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The question put by the chorus, and the answer it receives from the bride, show that the loss and seeking are not to be taken too seriously. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3. In speaking of Jesus Christ to others, she regains her own assurance. Literally, \"I am for my beloved … for me.\" Reverse order from So 2:16. She now, after the season of darkness, grounds her convictions on His love towards her, more than on hers towards Him (De 33:3). There, it was the young believer concluding that she was His, from the sensible assurance that He was hers.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "I am my beloved's, and my beloved is mine,.... Expressive of interest in Christ, and union to him, and of her faith therein; which still continued, notwithstanding her unbecoming behavior toward Christ, and her many infirmities, Sol 5:2. Aben Ezra connects the words with the preceding, \"my beloved is gone\", &c. but though he is, and I am left alone, I know I am his, and he is mine; which throws a beauty upon the words, and declares the excellency and strength of her faith; for herein lies the glory and excellency of faith, to believe in an unseen Christ: though it may be the Shechinah was with her, as the Targum has it; or Christ had now appeared to her, and was found by her, and therefore, like Thomas, says, \"my Lord and my God\"; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "he feedeth among the lilies; See Gill on Sol 2:16. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "he feedeth among the lilies; See Gill on Sol 2:16. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "I am my beloved's, and my beloved is mine: he feedeth among the lilies.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Here she expresses her jealous feeling. They are not to search for him with her. That is her business alone, they have no claim to be even thus interested in him. She fears she has overshot the mark in the praises she has uttered concerning her beloved. She has held him up for their admiration, but seeing how great it is, she snatches him back as it were, lest she should lose him. ‘I alone am his and he is mine, he who is feeding his flock among the lilies.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Song of Solomon 6:3",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3 I am my beloved's, and my beloved is mine,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "   Who feeds among the lilies,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Shulamith farther proceeds, followed by the daughters of Jerusalem, to seek her friend lost through her own fault. She always says, not אישׁי, but דּודי and רעי; for love, although a passion common to mind and body, is in this Song of Songs viewed as much as possible apart from its basis in the animal nature. Also, that the description hovers between that of the clothed and the unclothed, gives to it an ideality favourable to the mystical interpretation. Nakedness is ערוה. But at the cross nakedness appears transported from the sphere of sense to that of the supersensuous. ",
        "children": []
      }
    ]
  }
]