[{"header":"Ezra Reads the Law of Moses"},{"num":8,"verse":"When the seventh month came and the Israelites were in their cities, all the people gathered together at the public square that is in front of the Water Gate. They told Ezra the scribe to bring the Book of the Law of Moses, which the Lord had commanded Israel. "},{"num":2,"verse":"So on the first day of the seventh month, Ezra the priest brought the Law before the congregation, both men and women and all who were able to understand what they heard. "},{"num":3,"verse":"From dawn until midday in front of the public square in front of the Water Gate, he read from the scroll, while facing the men, the women, and those who could understand. All the people listened attentively to the Book of the Law. "},{"num":4,"verse":"Ezra the scribe stood on a wooden platform that was made for the occasion. Beside him stood Mattithiah, Shema, Anaiah, Uriah, Hilkiah, and Ma’aseiah on his right, and on his left were Pedaiah, Mishael, Malkijah, Hashum, Hashbaddanah, Zechariah, and Meshullam."},{"num":5,"verse":"All the people could see Ezra as he opened the scroll, because he was elevated above all the people. As he opened the scroll, all the people stood. "},{"num":6,"verse":"Then Ezra blessed the Lord, the great God, and all the people answered, “Amen! Amen!” while they lifted up their hands and then knelt and bowed down with their faces to the ground."},{"num":7,"verse":"Jeshua and Bani and Sherebiah, Jamin, Akkub, Shabbethai, Hodiah, Ma’aseiah, Kelita, Azariah, Jozabad, Hanan, Pelaiah, and the rest of the Levites helped the people understand the Law, while the people remained standing in their places. "},{"num":8,"verse":"So they read from the Book of the Law of God clearly and interpreted it, and the people understood what was read."},{"num":9,"verse":"Then Nehemiah the governor, Ezra the priest and scribe, and the Levites, who helped the people understand, said to all the people, “Today is holy to the Lord your God. Do not mourn or cry!” because all the people were crying as they heard the words of the Law. "},{"num":10,"verse":"Nehemiah said to them, “Go, eat rich food and drink sweet drinks and send portions to those who have nothing prepared, because today is holy to our Lord. Do not grieve, because the joy of the Lord is your strength.”"},{"num":11,"verse":"Then the Levites silenced all the people, saying, “Hush! Today is holy. Do not grieve.”"},{"num":12,"verse":"All the people went to eat and drink and to send portions to others and to celebrate with great joy, because they understood the words that had been made known to them."},{"header":"Ezra Leads the Study of the Law of Moses"},{"num":13,"verse":"Now on the second day, the heads of the families of all the people, the priests, and the Levites were gathered around Ezra the scribe to study the words of the Law. "},{"num":14,"verse":"They found written in the Law, which the Lord had commanded by the hand of Moses, that the Israelites should dwell in temporary shelters during the festival of the seventh month, "},{"num":15,"verse":"and that they should proclaim this and make this announcement in all their cities and in Jerusalem: “Go out to the mountains and bring branches from olive trees, wild olive trees, myrtle bushes, date palms, and leafy trees to make shelters, as it is written.”"},{"num":16,"verse":"So the people went out and brought branches and made shelters for themselves. Each man made a shelter on his roof. They also made shelters in their courtyards, in the courtyards of the house of God, in the square by the Water Gate, and in the square by the Ephraim Gate. "},{"num":17,"verse":"The entire congregation that had returned from the captivity made shelters and stayed in the shelters. From the days of Joshua son of Nun until that day, the Israelites had not celebrated in this way, because there was very great joy. "},{"num":18,"verse":"Ezra also read from the Book of the Law of God every day of the festival, from the first day to the last day. They celebrated the festival for seven days, and on the eighth day they held an assembly according to the ordinance."}]