[{"num":8,"verse":"2 Ezra gathereth together the people, and readeth to them the Law. 12 They rejoice in Israel for the knowledge of the word of God. 15 They keep the feast of Tabernacles or booths."},{"num":1,"verse":"And all the people assembled themselves together, in the street that was before the water gate, and they spake unto Ezra the Scribe, that he would bring the book of the Law of Moses, which the Lord had commanded to Israel."},{"num":2,"verse":"And Ezra the Priest brought the Law before the Congregation both of men and women, and of all that could hear and understand it, in the first day of the seventh month,"},{"num":3,"verse":"And he read therein in the street that was before the water gate (from the morning until the midday) before men and women, and them that understood it, and the ears of all the people hearkened unto the book of the Law."},{"num":4,"verse":"And Ezra the Scribe stood upon a pulpit of wood which he had made for the preaching, and beside him stood Mattithiah, and Shema, and Anaiah, and Urijah, and Hilkiah, and Maaseiah on his right hand, and on his left hand Pedaiah, and Mishael, and Malchijah, and Hashum, and Hashbadana, Zechariah, and Meshullam."},{"num":5,"verse":"And Ezra opened the book before all the people: for he was above all the people: and when he opened it, all the people stood up."},{"num":6,"verse":"And Ezra praised the Lord the great God, and all the people answered, Amen, Amen, with lifting up their hands: and they bowed themselves, and worshipped the Lord with their faces toward the ground."},{"num":7,"verse":"Also Jeshua, and Bani, and Sherebiah, Jamin, Akkub, Shabbethai, Hodijah, Maaseiah, Kelita, Azariah, Jozabad, Hanan, Pelaiah, and the Levites caused the people to understand the Law, and the people stood in their place."},{"num":8,"verse":"And they read in the book of the Law of God distinctly, and gave the sense, and caused them to understand the reading."},{"num":9,"verse":"Then Nehemiah (which is Tirshatha) and Ezra the Priest and Scribe, and the Levites that instructed the people, said unto all the people, This day is holy unto the Lord your God: mourn not, neither weep: for all the people wept, when they heard the words of the Law."},{"num":10,"verse":"He said also unto them, Go and eat of the fat, and drink the sweet, and send part unto them, for whom none is prepared: for this day is holy unto our Lord: be ye not sorry therefore: for the joy of the Lord is your strength."},{"num":11,"verse":"And the Levites made silence throughout all the people, saying, Hold your peace: for the day is holy, be not sad therefore."},{"num":12,"verse":"Then all the people went to eat and to drink, and to send away part, and to make great joy, because they had understood the words that they had taught them."},{"num":13,"verse":"And on the second day the chief fathers of all the people, the Priests and the Levites were gathered unto Ezra the Scribe, that he also might instruct them in the words of the Law."},{"num":14,"verse":"And they found written in the Law, (that the Lord had commanded Moses) that the children of Israel should dwell in booths in the feast of the seventh month,"},{"num":15,"verse":"And that they should cause it to be declared and proclaimed in all their cities, and in Jerusalem, saying, Go forth unto the mount, and bring olive branches, and pine branches, and branches of myrtle, and palm branches, and branches of thick trees, to make booths, as it is written."},{"num":16,"verse":"So the people went forth and brought them, and made them booths, every one upon the roof of his house, and in their courts, and in the courts of the house of God, and in the street by the water gate, and in the street of the gate of Ephraim."},{"num":17,"verse":"And all the Congregation of them that were come again out of the captivity, made booths, and sat under the booths: for since the time of Jeshua the son of Nun unto this day, had not the children of Israel done so, and there was very great joy."},{"num":18,"verse":"And he read in the book of the Law of God every day, from the first day unto the last day. And they kept the feast seven days, and on the eighth day a solemn assembly, according unto the manner."}]