[{"num":5,"verse":"Thus all the work that Shlomo did for the house of Adonai was finished. Then Shlomo brought in the gifts which David his father had consecrated — the silver, the gold and all the utensils — and put them in the treasuries of the house of God."},{"num":2,"verse":"Shlomo assembled all the leaders of Isra’el and all the heads of the tribes and the chiefs of the paternal clans of the people of Isra’el, to Yerushalayim, to bring the ark for the covenant of Adonai out of the City of David, also known as Tziyon. "},{"num":3,"verse":"All the people of Isra’el assembled before the king at the festival in the seventh month. "},{"num":4,"verse":"All the leaders of Isra’el came. The L’vi’im took the ark "},{"num":5,"verse":"and brought up the ark, the tent of meeting and all the holy utensils that were in the tent; these are what the cohanim and L’vi’im brought up. "},{"num":6,"verse":"King Shlomo and the whole community of Isra’el who had assembled in his presence were in front of the ark, sacrificing sheep and oxen in numbers beyond counting or recording. "},{"num":7,"verse":"The cohanim brought the ark for the covenant of Adonai in to its place inside the sanctuary of the house, to the Especially Holy Place, under the wings of the k’ruvim. "},{"num":8,"verse":"For the k’ruvim spread out their wings over the place for the ark, covering the ark and its poles from above. "},{"num":9,"verse":"The poles were so long that their ends could be seen [extending] from the ark into the sanctuary, but they could not be seen from outside; they are there to this day. "},{"num":10,"verse":"There was nothing in the ark except the two tablets Moshe put there at Horev, when Adonai made the covenant with the people of Isra’el at the time of their leaving Egypt."},{"num":11,"verse":"When the cohanim came out of the Holy Place (for all the cohanim who were present had consecrated themselves; they didn’t keep to their divisions; "},{"num":12,"verse":"also the L’vi’im who were the singers, all of them — Asaf, Heman, Y’dutun and their sons and relatives — dressed in fine linen, with cymbals, lutes and lyres, stood on the east side of the altar; and with them 120 cohanim sounding trumpets), "},{"num":13,"verse":"then, when the trumpeters and singers were playing in concord, to be heard harmoniously praising and thanking Adonai, and they lifted their voices together with the trumpets, cymbals and other musical instruments to praise Adonai: “for he is good, for his grace continues forever” — then, the house, the house of Adonai, was filled with a cloud; "},{"num":14,"verse":"so that because of the cloud, the cohanim could not stand up to perform their service; for the glory of Adonai filled the house of God."}]