[{"num":5,"verse":"Thus all the work that Solomon did for the house of the Lord was finished. And Solomon brought in the things that David his father had dedicated: the silver and the gold and all the furnishings in the treasury of the house of God."},{"header":"The Ark Brought to the Temple(A)"},{"num":2,"verse":"Then Solomon assembled the elders of Israel and all the heads of the tribes and the leaders of the houses of the fathers among the sons of Israel to bring up the ark of the covenant of the Lord from the City of David, which is Zion. "},{"num":3,"verse":"And all the men of Israel were assembled before the king at the feast, which is the seventh month."},{"num":4,"verse":"All the elders of Israel came, and the Levites carried the ark. "},{"num":5,"verse":"Then they brought up the ark, and the tent of meeting, and all the holy vessels that were in the tent. So the Levitical priests brought them up. "},{"num":6,"verse":"And King Solomon and all the congregation of Israel, who were assembled with him before the ark, were sacrificing so many sheep and oxen that they could not be counted or numbered."},{"num":7,"verse":"The priests brought the ark of the covenant of the Lord to its place—to the inner sanctuary of the temple, into the Most Holy Place, under the wings of the cherubim. "},{"num":8,"verse":"Then the cherubim wings were spread out over the place of the ark so that the cherubim covered the ark and its poles. "},{"num":9,"verse":"The poles were extended so that the ends of the poles of the ark were seen in front of the Most Holy Place, but they were not seen outside; and they are still there to this day. "},{"num":10,"verse":"In the ark there was nothing except the two tablets that Moses had given at Mount Horeb where the Lord made a covenant with the sons of Israel when they went out from Egypt."},{"num":11,"verse":"When the priests came out from the Most Holy Place—for all the priests who were present had consecrated themselves, without keeping separate divisions— "},{"num":12,"verse":"and all the Levitical singers, Asaph, Heman, and Jeduthun, with their sons and relatives, all clothed in fine linen, with cymbals, harps, and lyres, stood to the east of the altar, and with them one hundred and twenty priests who were sounding with trumpets, "},{"num":13,"verse":"it happened, when the trumpet players and singers made one sound to praise and give thanks to the Lord, and when they lifted up their voice with the trumpets and cymbals and all the instruments of music and praised the Lord saying,"},{"num":14,"verse":"And the priests were not able to stand in order to serve because of the cloud, for the glory of the Lord had filled the house of God."}]