[{"num":5,"verse":"Solomon finished all the work for the Lord’s temple. Then he brought in the things his father David had set apart for the Lord. They included the silver and gold and all the objects for God’s temple. Solomon placed them there with the other treasures."},{"header":"The Ark Is Brought to the Temple"},{"num":2,"verse":"Then Solomon sent for the elders of Israel. He told them to come to Jerusalem. They included all the leaders of the tribes. They also included the chiefs of the families of Israel. Solomon wanted them to bring up the ark of the Lord’s covenant from Zion. Zion was the City of David. "},{"num":3,"verse":"All the Israelites came together to where the king was. It was at the time of the Feast of Booths. The feast was held in the seventh month."},{"num":4,"verse":"All the elders of Israel arrived. Then the Levites picked up the ark and carried it. "},{"num":5,"verse":"They brought up the ark. They also brought up the tent of meeting and all the sacred things in the tent. The priests, who were Levites, carried up everything. "},{"num":6,"verse":"The entire community of Israel had gathered around King Solomon. All of them were in front of the ark. They sacrificed huge numbers of sheep and cattle. There were so many animals that they couldn’t be recorded. In fact, they couldn’t even be counted."},{"num":7,"verse":"The priests brought the ark of the Lord’s covenant to its place in the Most Holy Room of the temple. They put it under the wings of the cherubim. "},{"num":8,"verse":"The cherubim’s wings were spread out over the place where the ark was. They covered the ark. They also covered the poles used to carry it. "},{"num":9,"verse":"The poles reached out from the ark. They were so long that their ends could be seen from in front of the Most Holy Room. But they couldn’t be seen from outside the Holy Room. They are still there to this day. "},{"num":10,"verse":"There wasn’t anything in the ark except the two tablets. Moses had placed them in it at Mount Horeb. That’s where the Lord had made a covenant with the Israelites. He made it after they came out of Egypt."},{"num":11,"verse":"The priests left the Holy Room. All the priests who were there had set themselves apart to the Lord. It didn’t matter what group they were in. "},{"num":12,"verse":"All the Levites who played music stood near the east side of the altar. They included Asaph, Heman, Jeduthun and their sons and relatives. They were dressed in fine linen. They were playing cymbals, harps and lyres. They were joined by 120 priests who were blowing trumpets. "},{"num":13,"verse":"The trumpet players and other musicians played their instruments together. They praised the Lord and gave thanks to him. The singers sang to the music of the trumpets, cymbals and other instruments. They sang in praise to the Lord,"},{"num":14,"verse":"The priests couldn’t do their work. That’s because the cloud of the Lord’s glory filled God’s temple."}]