[{"header":"Paul Has Some Final Things to Say"},{"num":16,"verse":"I want you to know that you can trust our sister in Christ, Phoebe. She is a special servant of the church in Cenchrea."},{"num":2,"verse":"I ask you to accept her in the Lord. Accept her the way God’s people should. Help her with anything she needs from you. She has helped me very much, and she has helped many others too."},{"num":17,"verse":"Brothers and sisters, I want you to be very careful of those who cause arguments and hurt people’s faith by teaching things that are against what you learned. Stay away from them."},{"num":18,"verse":"People like that are not serving our Lord Christ. They are only pleasing themselves. They use fancy talk and say nice things to fool those who don’t know about evil."},{"num":19,"verse":"Everyone has heard that you do what you were taught, and I am very happy about that. But I want you to be wise about what is good and to know nothing about what is evil."},{"num":20,"verse":"The God who brings peace will soon defeat Satan and give you power over him."},{"num":21,"verse":"Timothy, a worker together with me, sends you his greetings. Also Lucius, Jason, and Sosipater (these are my relatives) send their greetings."},{"num":22,"verse":"I am Tertius, the one writing this letter for Paul. I send you my own greetings as one who belongs to the Lord."},{"num":23,"verse":"Gaius is letting me and the whole church here use his home. He sends his greetings to you. Erastus and our brother Quartus also send their greetings. Erastus is the city treasurer here."},{"num":24,"verse":""},{"num":25,"verse":"Praise God! He is the one who can make you strong in faith. He can use the Good News that I teach to make you strong. It is the message about Jesus Christ that I tell people. That message is the secret truth that was hidden for ages and ages but has been made known."},{"num":26,"verse":"It has now been shown to us. It was made known by what the prophets wrote, as God commanded. And it has now been made known to all people so that they can believe and obey God, who lives forever."},{"num":27,"verse":"Glory forever to the only wise God through Jesus Christ. Amen."}]