[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "XLIX.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) Listen, O isles . . .—The argument against idolatry has been brought to its close, and a new section opens, and with it there is a new speaker, the mysterious “Servant of the Lord,” (Isaiah 42:1), at once identified with Israel (Isaiah 49:3), in fulfilling its ideal, and yet distinguished from it, as its Restorer and Redeemer. “Isles” as before stand vaguely for “far off countries.” The invitation is addressed to the heathen far and wide.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(1) ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Listen, O isles . . .",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The argument against idolatry has been brought to its close, and a new section opens, and with it there is a new speaker, the mysterious “Servant of the Lord,” (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 42:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), at once identified with Israel (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 49:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), in fulfilling its ideal, and yet distinguished from it, as its Restorer and Redeemer. “Isles” as before stand vaguely for “far off countries.” The invitation is addressed to the heathen far and wide.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The Lord hath called me from the womb.—The words indicate a predestined vocation. (Comp. Jeremiah 1:5; Luke 1:15; Luke 1:41; Galatians 1:15.) Admitting the thought of a Divine order working in human history, the idea of such a vocation follows in inevitable sequence.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "The Lord hath called me from the womb.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The words indicate a predestined vocation. (Comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 1:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 1:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 1:41",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Galatians 1:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".) Admitting the thought of a Divine order working in human history, the idea of such a vocation follows in inevitable sequence.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 49:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 49:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Listen, O isles, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — “Hitherto the subject of the prophecy has been chiefly confined to the redemption from the captivity of Babylon, with strong intimations of a more important deliverance sometimes thrown in; to the refutation of idolatry, and the demonstration of the infinite power, wisdom, and foreknowledge of God. The character and office of the Messiah were exhibited in general terms, at the beginning of chap. 42., but here he is introduced in person, declaring the full extent of his commission; which is not only to restore the Israelites, and reconcile them to their Lord and Father, from whom they had so often revolted, but to be a light to lighten the Gentiles, to call them to the knowledge and obedience of the true God, and to bring them to be one church, together with the Israelites, and to partake with them of the same common salvation procured for all, by the great Redeemer and Reconciler of man to God.” — Bishop Lowth. By ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the isles ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "here, and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the people from far, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "the Gentiles are meant, who are frequently addressed by the appellation of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "isles, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and who, in general, lived in countries far remote from Judea, now the only place of God’s special presence and worship. The person who addresses them is the Messiah, as evidently appears from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 49:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and several other passages of this chapter. If the character here exhibited can, in any sense, as some think it may, belong to the prophet, “yet, in some parts,” as Bishop Lowth justly observes, “it must belong exclusively to Christ; and in all parts to him in a much fuller and more proper sense.” God having, in the last words of the preceding chapter, intimated by his prophet, that many of the Jews, notwithstanding the glorious deliverance from Babylon vouchsafed them, would be wicked, and foreknowing that he would cast them off for their wickedness, the Messiah here addresses his speech to the Gentiles, and invites them to hearken to those counsels and doctrines which he foresaw the Jews would reject. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The Lord hath called me from the womb ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— This, or the like expression, is used of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 1:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and of Paul, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Galatians 1:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but it was far more eminently true of Christ, who, as he was chosen to this great office of redemption from eternity, so he was separated and called to it before he was born, being both conceived and sanctified by the Holy Ghost in his mother’s womb, and sent into the world upon this errand.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "49:1-6 The great Author of redemption shows the authority for his work. The sword of his word slays the lusts of his people, and all at enmity with them. His sharp arrows wound the conscience; but all these wounds will be healed, when the sinner prays to him for mercy. But even the Redeemer, who spake as never man spake in his personal ministry, often seemed to labour in vain. And if Jacob will not be brought back to God, and Israel will not be gathered, still Christ will be glorious. This promise is in part fulfilled in the calling of the Gentiles. Men perish in darkness. But Christ enlightens men, and so makes them holy and happy.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Listen - This is the exordium, or introduction. According to the interpretation which refers it to the Messiah, it is to be regarded as the voice of the Redeemer calling the distant parts of the earth to give a respectful attention to the statement of his qualifications for his work, and to the assurances that his salvation would be extended to them (compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 41:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The Redeemer here is to be regarded as having already come in the flesh, and as having been rejected and despised by the Jews (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 49:4-5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and as now turning to the Gentile world, and proffering salvation to them. The time when this is supposed to occur, therefore, as seen by the prophet, is when the Messiah had preached in vain to his own countrymen, and when there was a manifest fitness and propriety in his extending the offer of salvation to the pagan world.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "O isles - Ye distant lands (see the note at Isaiah 41:1). The word is used here, as it is there, in the sense of countries beyond sea; distant, unknown regions; the dark, pagan world.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "O isles - Ye distant lands (see the note at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 41:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The word is used here, as it is there, in the sense of countries beyond sea; distant, unknown regions; the dark, pagan world.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Ye people from far - The reason why the Messiah thus addresses them is stated in Isaiah 49:6. It is because he was appointed to be a light to them, and because, having been rejected by the Jewish nation, it was resolved to extend the offers and the blessings of salvation to other lands.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Ye people from far - The reason why the Messiah thus addresses them is stated in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 49:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". It is because he was appointed to be a light to them, and because, having been rejected by the Jewish nation, it was resolved to extend the offers and the blessings of salvation to other lands.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The Lord hath called me from the womb - Yahweh hath set me apart to this office from my very birth. The stress here is laid on the fact that he was thus called, and not on the particular time when it was done. The idea is, that he had not presumptuously assumed this office; he had not entered on it without being appointed to it; he had been designated to it even before he was born (see Isaiah 49:5). A similar expression is used in respect to Jeremiah Jer 1:5 : 'Before I formed thee in the belly, I knew thee; and before thou camest forth out of the womb I sanctified thee; and I ordained thee a prophet unto the nations.' Paul also uses a similar expression respecting himself Galatians 1:15 : 'But when it pleased God, who separated me from my mother's womb.' That this actually occurred in regard to the Redeemer, it is not needful to pause here to show (see Luke 1:31).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The Lord hath called me from the womb - Yahweh hath set me apart to this office from my very birth. The stress here is laid on the fact that he was thus called, and not on the particular time when it was done. The idea is, that he had not presumptuously assumed this office; he had not entered on it without being appointed to it; he had been designated to it even before he was born (see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 49:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). A similar expression is used in respect to Jeremiah Jer 1:5 : 'Before I formed thee in the belly, I knew thee; and before thou camest forth out of the womb I sanctified thee; and I ordained thee a prophet unto the nations.' Paul also uses a similar expression respecting himself ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Galatians 1:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : 'But when it pleased God, who separated me from my mother's womb.' That this actually occurred in regard to the Redeemer, it is not needful to pause here to show (see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 1:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "From the bowels of my mother hath he made mention of my name - This is another form of stating the fact that he had been designated to this office from his very infancy. Many have supposed that the reference here is to the fact that Mary was commanded by the angel, before his birth, to call his name Jesus Luke 1:31. The same command was also repeated to Joseph in a dream Matthew 1:21. So Jerome, Vitringa, Michaelis, and some others understand it. By others it has been supposed that the phrase 'he hath made mention of my name is the same as to call. The Hebrew is literally, 'He has caused my name to be remembered from the bowels of my mother.' The Septuagint renders it, 'He hath called my name.' Grotius renders it, 'He has given to me a beautiful name, by which salvation is signified as about to come from the Lord.' I see no objection to the supposition that this refers to the fact that his name was actually designated before he was born. The phrase seems obviously to imply more than merely to call to an office; and as his name was thus actually designated by God, and as he designed that there should be special significancy and applicability in the name, there can be no impropriety in supposing that this refers to that fact. If so, the idea is, that he was not only appointed to the work of the Messiah from his birth, but that he actually had a name given him by God before he was born, which expressed the fact that he would save people, and which constituted a reason why the distant pagan lands should hearken to his voice. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "From the bowels of my mother hath he made mention of my name - This is another form of stating the fact that he had been designated to this office from his very infancy. Many have supposed that the reference here is to the fact that Mary was commanded by the angel, before his birth, to call his name Jesus ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 1:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The same command was also repeated to Joseph in a dream ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 1:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". So Jerome, Vitringa, Michaelis, and some others understand it. By others it has been supposed that the phrase 'he hath made mention of my name is the same as to call. The Hebrew is literally, 'He has caused my name to be remembered from the bowels of my mother.' The Septuagint renders it, 'He hath called my name.' Grotius renders it, 'He has given to me a beautiful name, by which salvation is signified as about to come from the Lord.' I see no objection to the supposition that this refers to the fact that his name was actually designated before he was born. The phrase seems obviously to imply more than merely to call to an office; and as his name was thus actually designated by God, and as he designed that there should be special significancy and applicability in the name, there can be no impropriety in supposing that this refers to that fact. If so, the idea is, that he was not only appointed to the work of the Messiah from his birth, but that he actually had a name given him by God before he was born, which expressed the fact that he would save people, and which constituted a reason why the distant pagan lands should hearken to his voice. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "CHAPTER 49",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Isa 49:1-26. Similar to Chapter 42:1-7 (Isa 49:1-9).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Messiah, as the ideal Israel (Isa 49:3), states the object of His mission, His want of success for a time, yet His certainty of ultimate success.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. O isles—Messiah is here regarded as having been rejected by the Jews (Isa 49:4, 5), and as now turning to the Gentiles, to whom the Father hath given Him \"for a light and salvation.\" \"Isles\" mean all regions beyond sea.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "from the womb—(Isa 44:2; Lu 1:31; Joh 10:36).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "from … bowels … mention of my name—His name \"Jesus\" (that is, God-Saviour) was designated by God before His birth (Mt 1:21).Christ, being sent to the Jews, complaineth of them, Isaiah 49:1-4. He is sent to the Gentiles with.gracious promises, Isaiah 49:5-12. God’s love to his church perpetual, Isaiah 49:13-17. The ample restoration of the church, and its enlargement, Isaiah 49:18-23, Powerful deliverance out of captivity, Isaiah 49:24-26.  Listen, O isles. God having in the last words secretly signified the wickedness of the Jewish nation, after so glorious a deliverance, and foreseeing that, for their wickedness, he should cast them off, he here turneth his speech to the nations of the Gentiles, who are frequently described in this prophecy and elsewhere under the title of isles, as hath been formerly noted, and inviteth them to hearken to those counsels and doctrines which the Jews would reject. Unto me;  unto Christ; for it is apparent from Isaiah 49:6, and other passages of this chapter, that Isaiah speaks these words ill the name of Christ, by whose Spirit they were dictated to him, 1 Peter 1:11, and unto whom alone they belong, as we shall see. So this chapter is a prophecy of Christ, which also is very proper and seasonable in this place. The prophet having at large prophesied of the deliverance of the Jews out of Babylon, he now proceeds further, and prophesieth of the redemption of the world by Christ, of which that deliverance out of Babylon was a type and forerunner. Hearken, ye people, from far;  which live in countries far from Judea, now the only place of God’s special presence and worship. It is evident from the foregoing clause, and many other passages following, that he speaks of distance of place, not of time. The Lord hath called me from the womb: this or the like expression is used of Jeremiah, Isaiah 1:5, and of Paul, Galatians 1:15; but it was far more eminently true of Christ, who, as he was chosen to this great office of redemption from eternity, so he was separated and called to it before he was born, being both conceived and sanctified by the Holy Ghost in his mother’s womb, and sent into the world upon this errand; of which see Matthew 1:21 Luke 1:31, &c.; it. 11, &c. Made mention of my name;  called by my name, and by such a name as signified my office and work, in the places now mentioned. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "from … bowels … mention of my name—His name \"Jesus\" (that is, God-Saviour) was designated by God before His birth (Mt 1:21).Christ, being sent to the Jews, complaineth of them, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Isaiah 49:1-4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". He is sent to the Gentiles with.gracious promises, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Isaiah 49:5-12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". God’s love to his church perpetual, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Isaiah 49:13-17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The ample restoration of the church, and its enlargement, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Isaiah 49:18-23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", Powerful deliverance out of captivity, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Isaiah 49:24-26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Listen, O isles.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " God having in the last words secretly signified the wickedness of the Jewish nation, after so glorious a deliverance, and foreseeing that, for their wickedness, he should cast them off, he here turneth his speech to the nations of the Gentiles, who are frequently described in this prophecy and elsewhere under the title of ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "isles",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", as hath been formerly noted, and inviteth them to hearken to those counsels and doctrines which the Jews would reject. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Unto me; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " unto Christ; for it is apparent from ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Isaiah 49:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and other passages of this chapter, that Isaiah speaks these words ill the name of Christ, by whose Spirit they were dictated to him, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "1 Peter 1:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and unto whom alone they belong, as we shall see. So this chapter is a prophecy of Christ, which also is very proper and seasonable in this place. The prophet having at large prophesied of the deliverance of the Jews out of Babylon, he now proceeds further, and prophesieth of the redemption of the world by Christ, of which that deliverance out of Babylon was a type and forerunner. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Hearken, ye people, from far; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " which live in countries far from Judea, now the only place of God’s special presence and worship. It is evident from the foregoing clause, and many other passages following, that he speaks of distance of place, not of time. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "The Lord hath called me from the womb:",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " this or the like expression is used of Jeremiah, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Isaiah 1:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and of Paul, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Galatians 1:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; but it was far more eminently true of Christ, who, as he was chosen to this great office of redemption from eternity, so he was separated and called to it before he was born, being both conceived and sanctified by the Holy Ghost in his mother’s womb, and sent into the world upon this errand; of which see ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Matthew 1:21 Luke 1:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", &c.; it. 11, &c. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Made mention of my name; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " called by my name, and by such a name as signified my office and work, in the places now mentioned. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Listen, O isles, unto me,.... These are not the words of Cyrus, as Lyra mentions; nor of the Prophet Isaiah, as Aben Ezra, Kimchi, and other Jewish writers think; but of Christ, calling upon the inhabitants of the isles to hearken to him; by whom are meant the inhabitants of islands properly so called, as ours of Great Britain, and may be chiefly designed, being a place where the Gospel of Christ came early, and has been long; or all such that dwell in countries beyond the sea, it being usual with the Jews to call all such countries isles that were beyond sea to them; Christ is the great Prophet of his church, and is alone to be hearkened unto, and in all things, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 17:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and hearken, ye people, from far; that were afar off from the land of Judea, as well as afar off from God and Christ, and the knowledge of him, and of righteousness and salvation by him; the Gentile nations are meant; see Ephesians 2:12, for this is to be understood of kingdoms afar off, as the Targum paraphrases it; and not of distant and future things, to be accomplished hereafter, as Aben Ezra; taking this to be the subject they are required to hearken to, and not as descriptive of persons that are to hearken: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and hearken, ye people, from far; that were afar off from the land of Judea, as well as afar off from God and Christ, and the knowledge of him, and of righteousness and salvation by him; the Gentile nations are meant; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ephesians 2:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", for this is to be understood of kingdoms afar off, as the Targum paraphrases it; and not of distant and future things, to be accomplished hereafter, as Aben Ezra; taking this to be the subject they are required to hearken to, and not as descriptive of persons that are to hearken: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "the Lord hath called me from the womb; to the office of a Mediator; to be Prophet, Priest, and King; to be the Saviour and Redeemer of men; he did not assume this to himself, but was called of God his Father, Hebrews 5:4, and that not only from the womb of his mother Mary, or as soon as he was conceived and born of her; but from the womb of eternity, from the womb of eternal purposes and decrees; for he was set forth, or foreordained in the purposes of God, to be the propitiation for sin; and was predestinated to be the Redeemer before the foundation of the world, even before he had a being in this world as man. So the Targum, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "the Lord hath called me from the womb; to the office of a Mediator; to be Prophet, Priest, and King; to be the Saviour and Redeemer of men; he did not assume this to himself, but was called of God his Father, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 5:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and that not only from the womb of his mother Mary, or as soon as he was conceived and born of her; but from the womb of eternity, from the womb of eternal purposes and decrees; for he was set forth, or foreordained in the purposes of God, to be the propitiation for sin; and was predestinated to be the Redeemer before the foundation of the world, even before he had a being in this world as man. So the Targum, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"the Lord, before I was, appointed me;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "he prepared a body for him, and appointed him to be his salvation. The Syriac version join, the words \"from far\" to this clause, as do the Septuagint and Arabic versions, contrary to the accents, and renders them, \"of a long time the Lord hath called me, from the womb\"; even from eternity: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "from the bowels of my mother hath he made mention of my name; Jarchi interprets this of Isaiah, whose name was fixed and given him by the Lord, while he was in his mother's bowels, signifying that he should prophesy of salvation and comfort; but it is much better to understand it of Christ, whose name Jesus, a Saviour, was made mention of by the Lord, while he was in his mother's womb, and before he was born, Matthew 1:20, for the words may be rendered, \"before the womb, and before the bowels of my mother\" (r); that is, before he was in them. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "from the bowels of my mother hath he made mention of my name; Jarchi interprets this of Isaiah, whose name was fixed and given him by the Lord, while he was in his mother's bowels, signifying that he should prophesy of salvation and comfort; but it is much better to understand it of Christ, whose name Jesus, a Saviour, was made mention of by the Lord, while he was in his mother's womb, and before he was born, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 1:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", for the words may be rendered, \"before the womb, and before the bowels of my mother\" (r); that is, before he was in them. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(r)  \"ante uterum----ante viscera matris meae\", h. e. \"antequam essem in utero, et in visceribus matris meae\", Vitringa. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(r)  \"ante uterum----ante viscera matris meae\", h. e. \"antequam essem in utero, et in visceribus matris meae\", Vitringa. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Listen, to me O isles; and hearken, ye people, from far; The LORD hath called {a} me from {b} the womb; from the body of my mother hath he made mention of my name.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Listen, to me O isles; and hearken, ye people, from far; The LORD hath called ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{a}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " me from ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{b}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the womb; from the body of my mother hath he made mention of my name.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) This is spoken in the person of Christ, to assure the faithful that these promises should come to pass: for they were all made in him and in him would be performed.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) This is meant of the time that Christ would be manifested to the world, as in Ps 2:7.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1–3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The call and equipment of the Servant by Jehovah. The nations of the world are addressed, because the great announcement that the speaker has to make (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 49:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 49:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ") concerns them. Although Jeremiah had already been conscious of being a “prophet to the nations” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 1:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), the self-consciousness here attributed to the Servant is too great to be that of any private individual, whether prophet or teacher.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "O isles",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] see on ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 41:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". For ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "people",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " render ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "peoples",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (R.V.).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the Lord hath called me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 42:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " &c.) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "from the womb",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Cf. ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 44:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 44:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 46:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where the same metaphor is used of the beginning of the nation’s history. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "made mention of my name",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 43:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1–6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Servant’s address to the nations. The passage forms the natural sequel to ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 42:1-4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and adds some fresh features to the portrait there presented. (1) The Servant, speaking now in his own name, expresses his consciousness of the mission entrusted to him by Jehovah (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 49:1-3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 49:1-3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "). (2) He records his failure in the past, and the sense of disappointment caused in him by the apparent fruitlessness of his labour; yet his faith in his mission remains constant (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 49:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 49:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "). (3) But now his doubts have been removed by a revelation of the great purpose for which Jehovah has raised him up; viz., to be the organ of His salvation to the ends of the earth (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 49:5-6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 49:5-6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "It still remains the most probable view that Israel is here spoken of under the name of the Servant of Jehovah; although two objections are raised in addition to those suggested by ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 42:1-4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") The Servant is described as one who has a history and an experience behind him, as well as a mission to fulfil. Now this experience is not that of the nation, which was conscious of no unique religious mission, and therefore had no such sense of defeat as is described in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 49:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 49:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". And if we say that it is not the actual but the ideal Israel that is meant, we are asked to explain how an ideal can have a history, or when the ideal Israel was born, or before whom Jehovah mentioned its name (Duhm). (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "b",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") Another difficulty is created by the fact that the Servant is here expressly distinguished from Israel when it is said that the restoration of the nation is to be effected by his activity. These objections are perhaps sufficiently met by the consideration that the ideal represented by the Servant is one that has been partially realised in the experience of the best part of the nation. Since the beginning of prophecy there had been a section of the people that had laboured for the conversion of Israel, and there were doubtless many among the exiles whose feelings of disappointment are truthfully reflected by the language put into the mouth of the Servant. There is nothing unnatural in the supposition that this party should be regarded as embodying the true genius of Israel, or that their experience should be transferred to the ideal figure by which the prophet sets forth his inspired interpretation of Israel’s history. Nor is there any great difficulty in the further thought that the ideal Servant, as represented by this minority, laboured for the reunion and upbuilding of the future Israel. This also corresponds to a fact of history, for nothing is more certain than that but for the influence of the prophetic teaching the Israelitish nationality would have perished during the Captivity. The prophet’s conception of Israel’s unique position is singularly profound as well as elevated; but it does not appear that any feature thus far introduced into the portrait of Jehovah’s Servant violates the conditions of a natural personification. (See further Introduction, pp. xxxiii f.; and Appendix, Note I.)",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 49:1-13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Servant of Jehovah: His Fidelity amidst Discouragements, and the ultimate Success of His Mission",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The beginning of ch. 49 seems to mark a distinct advance in the development of the prophet’s conceptions. “The controversial tone, the repeated comparisons between Jehovah and the idols, with the arguments based upon them, disappear; the prophet feels that, as regards these points, he has made his position sufficiently secure. For the same reason, allusions to Cyrus and his conquest of Babylon cease also; that, likewise, is now taken for granted” (Driver, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", pp. 148 f.). In the remaining discourses (ch. 49–55) the author concentrates his attention almost exclusively on his central message of consolation, and the glorious future in store for Israel. His treatment of this theme moves along two lines, which alternate with each other as the manner of the writer is. The first is represented by the idea of the Servant of the Lord, the second by the figure of Zion, both being personifications, although in very different senses, of the people of Israel (see on ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 40:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The Servant represents the ideal Israel as Jehovah’s instrument, first, in restoring the unity and prosperity of the nation, and second, in extending the knowledge of God to the nations of the world. Zion, on the other hand, is the representative of Israel in its passive aspect, as deserted and humbled in the present, but at the same time the recipient of the blessings which accrue from the work and sufferings of the Lord’s Servant.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The opening section consists of:—",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "i. A new description of the mission and experience of the Servant of Jehovah (cf. ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 42:1-4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") in the form of an address by the Servant to the nations (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 49:1-6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 49:1-6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "). These verses form the second of the four “Servant-passages” which occur in the book.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "ii. A promise of speedy restoration to Israel, obviously based on the preceding description (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 49:7-12",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 49:7-12",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "iii. A hymn of gratitude to Jehovah, called forth as usual by the prospect of deliverance (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 49:13",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 49:13",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 1-12.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - JEHOVAH'S ATTESTATION OF HIS SERVANT'S MISSION. Jehovah called his Servant from the womb; mentioned him by name; made his mouth a sharp sword; held him in his hand; caused him to be a polished weapon; appointed him his Servant; assured him of a right and a recompense; appointed him, not only to restore and recover Israel, but to be a Light to the Gentiles, and to give salvation to the ends of the world (vers. 1-6); chose him (ver. 7); will help him (ver. 8); through him will both deliver the captive everywhere (ver. 9), and cause joy to break out in every part of heaven and earth (vers. 11-13). It is quite impossible that these things can be said of aught but a person, or of any person other than him in whom all the nations of the earth were to be blessed (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 22:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 1.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Listen, O isles",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 41:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 42:1, 4, 6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Since the beginning of ch. 43. Israel alone has been addressed. Now that the mission of the Servant of Jehovah is to be treated of, all the world must be summoned to hear, for all the world is directly interested. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Ye people",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "ye peoples",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "ye nations. The Lord hath called me from the womb",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "ye nations. ",
            "children": []
          },
          {
            "element": "span",
            "class": "cmt_word",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "The Lord hath called me from the womb",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". Isaiah could not have said this of himself, for his \"call\" took place when he was of mature age. But Christ was designated for his office from the womb (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 1:31-33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). He was also still \"in the womb of his mother\" when the name of Jesus was given to him (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 1:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 1:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Isaiah 49:1",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The very same person who was introduced by Jehovah in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 42:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". here speaks for himself, commencing thus in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 49:1-3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : \"Listen, O isles, unto me; and hearken, ye nations afar off: Jehovah hath called me from the womb; from my mother's lap hath He remembered my name. And He made my mouth like a sharp sword; in the shadow of His hand hath He hid me, and made me into a polished shaft; in His quiver hath He concealed me. And He said to me, Thou art my servant, O Israel, thou in whom I glorify myself.\" Although the speaker is called Israel in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 49:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", he must not be regarded as either a collective person representing all Israel, or as the collective personality of the kernel of Israel, which answered to its true idea. It is not the former, because in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 49:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " he is expressly distinguished from the nation itself, which is the immediate object of his special work as restorer and (according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 49:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 42:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") covenant-mediator also; not the latter, because the nation, whose restoration he effects, according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 49:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", was not something distinct from the collective personality of the \"servant of Jehovah\" in a national sense, but rather the entire body of the \"servants of Jehovah\" or remnant of Israel (see, for example, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 65:8-16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Moreover, it cannot be either of these, because what he affirms of himself is expressed in such terms of individuality, that they cannot be understood as employed in a collective sense at all, more especially where he speaks of his mother's womb. In every other case in which Israel is spoken of in this way, we find only \"from the womb\" (mibbeten, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 44:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 44:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 56:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", along with minnı̄-racham; also ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 48:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), without the addition of אם (mother), which is quite unsuitable to the collective body of the nation (except in such allegorical connections as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 51:1-2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 16:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Is it then possibly the prophet, who is here speaking of himself and refers in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 49:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to his own mother (compare אמּי in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 15:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 20:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 20:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")? This is very improbable, if only because the prophet, who is the medium of the word of God in these prophecies, has never placed himself in the foreground before. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 40:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " he merely speaks of himself indirectly; in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 44:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", even if he refer to himself at all (which we greatly doubt), it is only objectively; and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 48:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the other person, into whose words the words of Jehovah pass, cannot be the prophet, for the simple reason that the transition of the words of Jehovah into those of His messenger is essentially different in this instance from the otherwise frequent interchange of the words of Jehovah and those of His prophet, and also because the messenger of Jehovah speaks of himself there, after the \"former things\" have come to pass, as the mediator (either in word or deed) of the \"new things\" which were never heard of before, but are to be expected now; whereas the author of these addresses was also the prophet of the \"former things,\" and therefore the messenger referred to rises up within the course of sacred history predicted by the author of these prophecies. Moreover, what the speaker in this case (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 49:1-2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") says of himself is so unique, so glorious, that it reaches far beyond the vocation and performance of any single prophet, or, in fact, of any individual man subject to the limitations of human life and human strength.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "There is nothing else left, therefore, than to suppose that the idea implied in the expression \"servant of Jehovah\" is condensed in this instance, as in Isaiah 42:1., into that of a single person. When it is expanded to its widest circumference, the \"servant of Jehovah\" is all Israel; when it only covers its smaller and inner circle, it is the true people of Jehovah contained within the entire nation, like the kernel in the shell (see the definition of this at Isaiah 51:7; Isaiah 65:10; Psalm 24:6; Psalm 73:15); but here it goes back to its very centre. The \"servant of Jehovah,\" in this central sense, is the heart of Israel. From this heart of Israel the stream of salvation flows out, first of all through the veins of the people of God, and thence through the veins of the nations generally. Just as Cyrus is the world-power in person, as made subservient to the people of God, so the servant of Jehovah, who is speaking here, is Israel in person, as promoting the glorification of Jehovah in all Israel, and in all the world of nations: in other words, it is He in whom the true nature of Israel is concentrated like a sun, in whom the history of Israel is coiled up as into a knot for a further and final development, in whom Israel's world-wide calling to be the Saviour of mankind, including Israel itself, is fully carried out; the very same who took up the word of Jehovah in Isaiah 48:16, in the full consciousness of His fellowship with Him, declaring Himself to be His messenger who had now appeared. It must not be forgotten, moreover, that throughout these prophecies the breaking forth of salvation, not for Israel only, but for all mankind, is regarded as bound up with the termination of the captivity; and from this its basis, the restoration of the people who were then in exile, it is never separated. This fact is of great importance in relation to the question of authorship, and favours the conclusion that they emanated from a prophet who lived before the captivity, and not in the midst of it. Just as in chapter 7 Isaiah sees the son of the virgin grow up in the time of the Assyrian oppressions, and then sees his kingdom rising up on the ruins of the Assyrian; so does he here behold the servant of Jehovah rising up in the second half of the captivity, as if born in exile, in the midst of the punishment borne by his people, to effect the restoration of Israel. At the present time, when he begins to speak, coming forward without any further introduction, and speaking in his own name (a unique instance of dramatic style, which goes beyond even Psalm 2:1-12), he has already left behind him the commencement of his work, which was directed towards the salvation of mankind. His appeal is addressed to the \"isles,\" which had been frequently mentioned already when the evangelization of the heathen was spoken of (Isaiah 42:4, Isaiah 42:10, Isaiah 42:12; cf., Isaiah 24:15), and to the \"nations from afar,\" i.e., the distant nations (as in Isaiah 5:26; compare, on the other hand, Jeremiah 23:23). They are to hear what he says, not merely what he says in the words that follow, but what he says generally. What follows is rather a vindication of his right to demand a hearing and obedience, then the discourse itself, which is to be received with the obedience of faith; at the same time, the two are most intimately connected. Jehovah has called him ab utero, has thought of his name from the bowels of his mother (מעי as in Psalm 71:6), i.e., even before he was born; ever since his conception has Jehovah assigned to him his calling, viz., his saving calling. We call to mind here Jeremiah 1:5; Luke 1:41; Galatians 1:15, but above all the name Immanuel, which is given by anticipation to the Coming One in Isaiah 7:14, and the name Jesus, which God appointed through the mouth of angels, when the human life of Him who was to bear that name was still ripening in the womb of the Virgin (Matthew 1:20-23). It is worthy of notice, however, that the great Coming One, though he is described in the Old Testament as one who is to be looked for \"from the seed of David,\" is also spoken of as \"born of a woman,\" whenever his entrance into the world is directly referred to. In the Protevangelium he is called, though not in an individual sense, \"the seed of the woman;\" Isaiah, in the time of Ahaz, mentions \"the virgin\" as his mother; Micah (Micah 5:2) speaks of his יולדה; even the typical psalms, as in Psalm 22:10-11, give prominence to the mother. And is not this a sign that prophecy is a work of the Spirit, who searches out the deep things of the counsel of God? ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "There is nothing else left, therefore, than to suppose that the idea implied in the expression \"servant of Jehovah\" is condensed in this instance, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 42:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "., into that of a single person. When it is expanded to its widest circumference, the \"servant of Jehovah\" is all Israel; when it only covers its smaller and inner circle, it is the true people of Jehovah contained within the entire nation, like the kernel in the shell (see the definition of this at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 51:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 65:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 24:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 73:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); but here it goes back to its very centre. The \"servant of Jehovah,\" in this central sense, is the heart of Israel. From this heart of Israel the stream of salvation flows out, first of all through the veins of the people of God, and thence through the veins of the nations generally. Just as Cyrus is the world-power in person, as made subservient to the people of God, so the servant of Jehovah, who is speaking here, is Israel in person, as promoting the glorification of Jehovah in all Israel, and in all the world of nations: in other words, it is He in whom the true nature of Israel is concentrated like a sun, in whom the history of Israel is coiled up as into a knot for a further and final development, in whom Israel's world-wide calling to be the Saviour of mankind, including Israel itself, is fully carried out; the very same who took up the word of Jehovah in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 48:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", in the full consciousness of His fellowship with Him, declaring Himself to be His messenger who had now appeared. It must not be forgotten, moreover, that throughout these prophecies the breaking forth of salvation, not for Israel only, but for all mankind, is regarded as bound up with the termination of the captivity; and from this its basis, the restoration of the people who were then in exile, it is never separated. This fact is of great importance in relation to the question of authorship, and favours the conclusion that they emanated from a prophet who lived before the captivity, and not in the midst of it. Just as in chapter 7 Isaiah sees the son of the virgin grow up in the time of the Assyrian oppressions, and then sees his kingdom rising up on the ruins of the Assyrian; so does he here behold the servant of Jehovah rising up in the second half of the captivity, as if born in exile, in the midst of the punishment borne by his people, to effect the restoration of Israel. At the present time, when he begins to speak, coming forward without any further introduction, and speaking in his own name (a unique instance of dramatic style, which goes beyond even ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 2:1-12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), he has already left behind him the commencement of his work, which was directed towards the salvation of mankind. His appeal is addressed to the \"isles,\" which had been frequently mentioned already when the evangelization of the heathen was spoken of (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 42:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 42:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 42:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; cf., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 24:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and to the \"nations from afar,\" i.e., the distant nations (as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 5:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; compare, on the other hand, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 23:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). They are to hear what he says, not merely what he says in the words that follow, but what he says generally. What follows is rather a vindication of his right to demand a hearing and obedience, then the discourse itself, which is to be received with the obedience of faith; at the same time, the two are most intimately connected. Jehovah has called him ab utero, has thought of his name from the bowels of his mother (מעי as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 71:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), i.e., even before he was born; ever since his conception has Jehovah assigned to him his calling, viz., his saving calling. We call to mind here ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 1:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 1:41",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Galatians 1:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", but above all the name Immanuel, which is given by anticipation to the Coming One in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 7:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and the name Jesus, which God appointed through the mouth of angels, when the human life of Him who was to bear that name was still ripening in the womb of the Virgin (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 1:20-23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). It is worthy of notice, however, that the great Coming One, though he is described in the Old Testament as one who is to be looked for \"from the seed of David,\" is also spoken of as \"born of a woman,\" whenever his entrance into the world is directly referred to. In the Protevangelium he is called, though not in an individual sense, \"the seed of the woman;\" Isaiah, in the time of Ahaz, mentions \"the virgin\" as his mother; Micah (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 5:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") speaks of his יולדה; even the typical psalms, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 22:10-11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", give prominence to the mother. And is not this a sign that prophecy is a work of the Spirit, who searches out the deep things of the counsel of God? ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "In Isaiah 49:2 the speaker says still further, that Jehovah has made his mouth kecherebh chaddâh (like a sharp sword), namely, that he may overcome everything that resists him as if with a sharp sword, and sever asunder things that are bound up together in a pernicious bond (Isaiah 11:4; Revelation 1:16; Hebrews 4:12); also that He has made him into chēts bârūr (not βέλος εκλεκτόν, lxx, but, as in Jeremiah 51:11, cleaned,",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 49:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the speaker says still further, that Jehovah has made his mouth kecherebh chaddâh (like a sharp sword), namely, that he may overcome everything that resists him as if with a sharp sword, and sever asunder things that are bound up together in a pernicious bond (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 11:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 1:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 4:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); also that He has made him into chēts bârūr (not βέλος εκλεκτόν, lxx, but, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 51:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", cleaned,",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: The comparison to purus is one that naturally suggests itself; but this, like putus, is derived from a root pū.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "polished, sharpened, pointed), namely, to pierce the hearts (Psalm 45:6), and inflict upon them the most wholesome wounds; and again, that Jehovah has hidden him under the shadow of His almighty hand, and kept him concealed in the quiver of His loving counsel, just girt as men keep their swords and arrows in sheaths and quivers ready for the time when they want to use them, in order that in the fulness of time He might draw out this His sword, and put this His arrow to the bow. The question whether the allusion here is to the time preceding the foreknown period of his coming, or whether it is to eternity that the words refer, does not present any great dilemma; at the same time, the prophecy in this instance only traces back the being of the person, who now appears, to the remotest point of his historical coming. Isaiah 49:3 describes, without any figure, what Jehovah has made him. He has said to him (cf., Psalm 2:7): Thou art my servant; thou art Israel, in whom (in quo, as in Isaiah 44:23) I glorify myself. Schenkel's exposition is grammatically impossible: \"(It is) in Israel that I will glorify myself through thee.\" The servant himself is called Israel. We call to mind here the expression in Matthew 16:18, \"Thou art Peter;\" and the use of the name \"Israel,\" as the individuation of a generic name, reminds us of the fact that the kings of a nation are sometimes called by the name of the nation itself (e.g., Asshur, Isaiah 10:5.). But Israel was from the very first the God-given name of an individual. Just as the name Israel was first of all given to a man, and then after that to a nation, so the name which sprang from a personal root has also a personal crown. The servant of Jehovah is Israel in person, inasmuch as the purpose of mercy, upon the basis of which and for the accomplishment of which Jehovah made Jacob the father of the twelve-tribed nation, is brought by him into full and final realization. We have already seen that Israel, as an entire nation, formed the basis of the idea contained in the term \"servant of Jehovah;\" Israel, regarded as a people faithful to its calling, the centre; and the personal servant of Jehovah its apex. In the present instance, where he is called distinctly \"Israel,\" the fact is clearly expressed, that the servant of Jehovah in these prophecies is regarded as the kernel of the kernel of Israel, as Israel's inmost centre, as Israel's highest head. He it is in whom (i.e., on whom and through whom) Jehovah glorifies Himself, inasmuch as He carried out through him the counsels of His love, which are the self-glorification of His holy love, its glory and its triumph. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "polished, sharpened, pointed), namely, to pierce the hearts (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 45:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and inflict upon them the most wholesome wounds; and again, that Jehovah has hidden him under the shadow of His almighty hand, and kept him concealed in the quiver of His loving counsel, just girt as men keep their swords and arrows in sheaths and quivers ready for the time when they want to use them, in order that in the fulness of time He might draw out this His sword, and put this His arrow to the bow. The question whether the allusion here is to the time preceding the foreknown period of his coming, or whether it is to eternity that the words refer, does not present any great dilemma; at the same time, the prophecy in this instance only traces back the being of the person, who now appears, to the remotest point of his historical coming. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 49:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " describes, without any figure, what Jehovah has made him. He has said to him (cf., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 2:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "): Thou art my servant; thou art Israel, in whom (in quo, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 44:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") I glorify myself. Schenkel's exposition is grammatically impossible: \"(It is) in Israel that I will glorify myself through thee.\" The servant himself is called Israel. We call to mind here the expression in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 16:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"Thou art Peter;\" and the use of the name \"Israel,\" as the individuation of a generic name, reminds us of the fact that the kings of a nation are sometimes called by the name of the nation itself (e.g., Asshur, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 10:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".). But Israel was from the very first the God-given name of an individual. Just as the name Israel was first of all given to a man, and then after that to a nation, so the name which sprang from a personal root has also a personal crown. The servant of Jehovah is Israel in person, inasmuch as the purpose of mercy, upon the basis of which and for the accomplishment of which Jehovah made Jacob the father of the twelve-tribed nation, is brought by him into full and final realization. We have already seen that Israel, as an entire nation, formed the basis of the idea contained in the term \"servant of Jehovah;\" Israel, regarded as a people faithful to its calling, the centre; and the personal servant of Jehovah its apex. In the present instance, where he is called distinctly \"Israel,\" the fact is clearly expressed, that the servant of Jehovah in these prophecies is regarded as the kernel of the kernel of Israel, as Israel's inmost centre, as Israel's highest head. He it is in whom (i.e., on whom and through whom) Jehovah glorifies Himself, inasmuch as He carried out through him the counsels of His love, which are the self-glorification of His holy love, its glory and its triumph. ",
            "children": []
          }
        ]
      }
    ]
  }
]