[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(23) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Kings shall be thy nursing fathers . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—As a rule kings gave their children to be brought up by their nobles (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Kings 10:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Zion should have kings themselves and their queens to rear her children. They shall bow down to her, the true Israel, the true ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ecclesia, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "as the dwelling-place of Jehovah.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "49:18-23 Zion is addressed as an afflicted widow, bereaved of her children. Numbers flock to her, and she is assured that they come to be a comfort to her. There are times when the church is desolate and few in number; yet its desolations shall not last for ever, and God will repair them. God can raise up friends for returning Israelites, even among Gentiles. They shall bring their children, and make them thy children. Let all deal tenderly and carefully with young converts and beginners in religion. Princes shall protect the church. It shall appear that God is the sovereign Lord of all. And those who in the exercise of faith, hope, and patience, wait on God for the fulfilment of his promises, shall never be confounded.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And kings shall be thy nursing fathers - Margin, 'Nourishers.' That is, they would patronize the church of God; they would protect it by their laws, and foster it by their influence and become the personal advocates of the cause of Zion. The idea is properly that of guarding, educating, and proriding for children; and the sense is that kings and princes would evince the same tender care for the interests of the people of God which a parent or a nurse does for a child. It is needless to say that this has been already to a considerable extent fulfilled, and that many princes and monarchs have been the patrons of the church, though doubtless it is destined to a more ample fulfillment still in the brighter days of this world's history, when the gospel shall spread everywhere. It is remarkable that, in the Sandwich and South Sea Islands, the Christian religion has been uniformly, almost, taken under the protection of the kings and chiefs since its first introduction there, and has been carried forward and extended under their direct authority.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "They shall bow down to thee with their face toward the earth - A posture indicating the profoundest reverence. This is the common posture of showing great respect in the East.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And lick up the dust of thy feet - An act denoting the utmost possible respect and veneration for the church and people of God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "For they shall not be ashamed that wait for me - They who worship me shall not be ashamed of the act requiring the deepest self-abasement, to show their reverence for me. Even those of most elevated rank shall be willing to humble themselves with the profoundest expressions of adoration. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "For they shall not be ashamed that wait for me - They who worship me shall not be ashamed of the act requiring the deepest self-abasement, to show their reverence for me. Even those of most elevated rank shall be willing to humble themselves with the profoundest expressions of adoration. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "23. lick … dust—that is, kiss thy feet in token of humble submission.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for they … not … ashamed … wait for me—The restoration of Israel shall be in answer to their prayerful waiting on the Lord (Isa 30:18, 19; Ps 102:16, 17; Zec 12:10; 14:3).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Kings shall be thy nursing fathers, and their queens thy nursing mothers; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " kings and queens shall have a sincere affection and tender regard unto thee and thy children, which was in some sort fulfilled by Cyrus, Ahasuerus, and some few others of the Persian kings or queens, but much more truly and fully by those many kings and emperors of the Gentile world, which after Christ’s time did both themselves embrace the true religion, and also set it up in their several dominions. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "They shall bow down to thee with their face toward the earth, and lick up the dust of thy feet; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " they shall highly reverence and honour thee, and shall most humbly and readily submit themselves unto thee, which was not verified in any of the Persian kings, but only in these kings who were converted to the Christian faith and church. The expressions are borrowed from the practice of the Eastern people in their prostrations and adorations, when they bowed so low as to touch and kiss the ground, whereby they did or might seem to lick up the very dust of the ground which was about or under the feet of those whom they adored. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "They shall not be ashamed that wait for me; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " their hopes and expectations shall not be disappointed, but abundantly satisfied. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And kings shall be thy nursing fathers, and their queens thy nursing mothers,.... Who shall show favour and respect to the church and people of God, grant them liberty, and protect and defend them in their religious privileges: for this is to be understood not figuratively of apostles and apostolical men, as Jerom, who are kings and priests unto God, and who feed the church with the milk of the word, and the breasts of ordinances; but literally of the kings and queens of the earth; and is thought to have had its fulfilment, at least in part, in Cyrus, Ahasuerus, Esther, and others; but more so in Christian kings and queens, as Constantine and Helena, Theodosius and Placilla, and others; and will have a far greater accomplishment in the latter day glory; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 60:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "they shall bow down toward thee with their faces toward the earth; which expresses the great veneration and respect these great personages shall have for the church of God, and their entire submission and subjection to the Gospel of Christ, and the ordinances of it, and to the laws and discipline of his house; for they shall now become members of the Christian church, and be entirely under the government of it, as to religious things; see Revelation 3:9. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "they shall bow down toward thee with their faces toward the earth; which expresses the great veneration and respect these great personages shall have for the church of God, and their entire submission and subjection to the Gospel of Christ, and the ordinances of it, and to the laws and discipline of his house; for they shall now become members of the Christian church, and be entirely under the government of it, as to religious things; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 3:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and lick up the dust of thy feet; the allusion is to the eastern nations, especially the Persians, who, in the adoration of their kings, used to kiss the ground they stood on, and seemed to lick, if they did not, the dust that was about them; and it expresses the very low submission of kings and princes to the church, and their high veneration of it; their willingness to do the meanest office for the good of it, and their great regard and affection for the meanest of its members, the dust of Zion; see Psalm 72:9, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and lick up the dust of thy feet; the allusion is to the eastern nations, especially the Persians, who, in the adoration of their kings, used to kiss the ground they stood on, and seemed to lick, if they did not, the dust that was about them; and it expresses the very low submission of kings and princes to the church, and their high veneration of it; their willingness to do the meanest office for the good of it, and their great regard and affection for the meanest of its members, the dust of Zion; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 72:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and thou shalt know that I am the Lord; the King of kings, and Lord of lords, who has the hearts of all men, even of kings, in his hands, and can turn them, and bring them to a thorough submission to his will; and who is able to accomplish all his promises, and is true and faithful to them; this will be known and owned by the church, when the above things have their accomplishment: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for they shall not be ashamed that wait for me; or for my salvation, as the Targum; for favours from him; for the light of his countenance; for the discoveries and application of pardoning grace; for the performance of promises; for answers of prayer; for his spiritual coming, and for eternal glory and happiness; these shall not be ashamed of him for whom they wait, nor of their hope and expectation of him, nor at his coming. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "for they shall not be ashamed that wait for me; or for my salvation, as the Targum; for favours from him; for the light of his countenance; for the discoveries and application of pardoning grace; for the performance of promises; for answers of prayer; for his spiritual coming, and for eternal glory and happiness; these shall not be ashamed of him for whom they wait, nor of their hope and expectation of him, nor at his coming. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And kings {b} shall be thy nursing fathers, and their queens thy nursing mothers: they shall bow to thee with their face toward the earth, and lick up the {c} dust of thy feet; and thou shalt know that I am the LORD: for they shall not be ashamed that wait for me.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And kings ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{b}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " shall be thy nursing fathers, and their queens thy nursing mothers: they shall bow to thee with ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "their",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " face toward the earth, and lick up the ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{c}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " dust of thy feet; and thou shalt know that I ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "am",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the LORD: for they shall not be ashamed that wait for me.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) Meaning, that kings will be converted to the gospel, and bestow their power and authority for the preservation of the Church.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) Being joined with the Church, they will humble themselves to Christ their head, and give him all honour.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thy nursing fathers",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "thy guardians",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; i.e. of course, the guardians of her children (in spite of ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 60:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 11:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 10:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Esther 2:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " &c. The figure appears to express the permanent relation of the kingdoms of the world to the glorified people of God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "lick up the dust of thy feet",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] An extravagant, but thoroughly Oriental, metaphor for abject self-humiliation (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 7:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 72:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Gesenius quotes from a Persian poem the following sentiment of a prince to his conqueror: “When I shall have the good fortune to kiss the dust of thy feet, then I shall believe that fortune flatters me,” &c. Comp. ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 45:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 60:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for they shall not be ashamed &c.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Strictly a relative sentence, “they that wait on Whom shall not be ashamed”; which is perhaps hardly English. Render as R.V. ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "and they that wait for me shall not be ashamed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 23.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Kings shall be thy nursing fathers, and their queens thy nursing",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "mothers;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "thy foster-fathers",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "...  ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "thy foster-mothers.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Kings and queens (sultanas) shall put themselves at the disposal of the Church, to nourish and cherish such of the Church's children as may be entrusted to their care. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "They shall bow down",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". They shall not seek to lord it over the Church, but shall acknowledge in the officers of the Church a spiritual authority superior to their own, before which they shall \"bow down,\" as Theodosius did. They shall even be willing, when they are conscious of guilt, to \"lick the dust\" under the Church's feet, or subject themselves to deep humiliation, that they may be restored. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "They shall not be ashamed that wait for me.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Such as wait patiently and trust in the fulfilment of all these gracious promises shall escape shame, for the promises will assuredly be fulfilled. Isaiah 49:23",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Such affectionate treatment does the church receive, which is assembling once more upon its native soil, whilst kings and their consorts hasten to serve the re-assembled community. \"And kings become thy foster-fathers, and their princesses they nurses: they bow down their face to thee to the earth, and they lick the dust of thy feet; and thou learnest that I am Jehovah, He whose hoping ones are not put to shame.\" As foster-fathers devote all their strength and care to those entrusted to them, and nurses nourish children from the very marrow of their own life, so will kings become the shelterers of Zion, and princesses the sustainers of her growth. All that is true in the regal headship of the church will be realized, and all that is false in regal territorialism will condemn itself: \"vultu in terram demisso adorabunt te et pulverem pedum tuorum lingent\" (Jerome). They do homage to the church, and kiss the ground upon which she stands and walks. According to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 45:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", this adoration belongs to the God who is present in the church, and points the church itself away from all thought of her own merits to Jehovah, the God of salvation, cui qui confidunt non pudefient (וידעתּ with an auxiliary pathach, like יגעתּ in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 47:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; Ges. 65, 2: אשׁר with the first person made into a relative as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 41:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; Ges. 123, 1, Anm. 1). Observe, however, that the state will not be swallowed up by the church - a thing which never will occur, and is never meant to occur; but by the state becoming serviceable to the church, there is realized a prelude of the perfected kingdom of God, in which the dualism of the state and the church is entirely abolished. ",
        "children": []
      }
    ]
  }
]