[{"num":10,"verse":"Dead flies cause the ointment of the perfumer to putrefy [and] send forth a vile odor; so does a little folly [in him who is valued for wisdom] outweigh wisdom and honor."},{"num":2,"verse":"A wise man’s heart turns him toward his right hand, but a fool’s heart toward his left."},{"num":3,"verse":"Even when he who is a fool walks along the road, his heart and understanding fail him, and he says of everyone and to everyone that he is a fool."},{"num":4,"verse":"If the temper of the ruler rises up against you, do not leave your place [or show a resisting spirit]; for gentleness and calmness prevent or put a stop to great offenses."},{"num":5,"verse":"There is an evil which I have seen under the sun, like an error which proceeds from the ruler:"},{"num":6,"verse":"Folly is set in great dignity and in high places, and the rich sit in low places."},{"num":7,"verse":"I have seen slaves on horses, and princes walking like slaves on the earth."},{"num":8,"verse":"He who digs a pit [for others] will fall into it, and whoever breaks through a fence or a [stone] wall, a serpent will bite him."},{"num":9,"verse":"Whoever removes [landmark] stones or hews out [new ones with similar intent] will be hurt with them, and he who fells trees will be endangered by them."},{"num":10,"verse":"If the ax is dull and the man does not whet the edge, he must put forth more strength; but wisdom helps him to succeed."},{"num":11,"verse":"If the serpent bites before it is charmed, then it is no use to call a charmer [and the slanderer is no better than the uncharmed snake]."},{"num":12,"verse":"The words of a wise man’s mouth are gracious and win him favor, but the lips of a fool consume him."},{"num":13,"verse":"The beginning of the words of his mouth is foolishness, and the end of his talk is wicked madness."},{"num":14,"verse":"A fool also multiplies words, though no man can tell what will be—and what will happen after he is gone, who can tell him?"},{"num":15,"verse":"The labor of fools wearies every one of them, because [he is so ignorant of the ordinary matters that] he does not even know how to get to town."},{"num":16,"verse":"Woe to you, O land, when your king is a child or a servant and when your officials feast in the morning!"},{"num":17,"verse":"Happy (fortunate and to be envied) are you, O land, when your king is a free man and of noble birth and character and when your officials feast at the proper time—for strength and not for drunkenness!"},{"num":18,"verse":"Through indolence the rafters [of state affairs] decay and the roof sinks in, and through idleness of the hands the house leaks."},{"num":19,"verse":"[Instead of repairing the breaches, the officials] make a feast for laughter, serve wine to cheer life, and [depend on tax] money to answer for all of it."},{"num":20,"verse":"Curse not the king, no, not even in your thoughts, and curse not the rich in your bedchamber, for a bird of the air will carry the voice, and a winged creature will tell the matter."}]