[{"num":10,"verse":"¶ Dead flies cause the ointment of the apothecary to send forth a stinking savour: likewise a small act of folly unto him that is esteemed for wisdom and honour."},{"num":2,"verse":"A wise man’s heart is at his right hand, but a fool’s heart at his left."},{"num":3,"verse":"Even when the fool walks by the way, he lacks prudence, and he says unto every one that he is a fool."},{"num":4,"verse":"¶ If the spirit of the ruler rises up against thee, do not leave thy place; for meekness pacifies great sins."},{"num":5,"verse":"There is another evil which I have seen under the sun, as an error which proceeds from the ruler:"},{"num":6,"verse":"Folly is set in great dignity, and the rich are seated in a low place."},{"num":7,"verse":"I saw slaves upon horses, and princes walking as slaves upon the earth."},{"num":8,"verse":"He that digs a pit shall fall into it, and whosoever breaks a hedge, a serpent shall bite him."},{"num":9,"verse":"Whosoever moves the stones shall have tribulation along with it, and he that cuts the firewood shall be endangered by it."},{"num":10,"verse":"If the iron is blunt, and he does not whet the edge, then he must put forth more strength, but the advantages of wisdom excel."},{"num":11,"verse":"If the serpent bites without being enchanted, then the babbler is no more."},{"num":12,"verse":"¶ The words from the mouth of the wise man are grace, but the lips of the fool will swallow up himself."},{"num":13,"verse":"The beginning of the words of his mouth is foolishness, and the end of his talk is mischievous madness."},{"num":14,"verse":"The fool multiplies words and says, Man cannot tell what shall be, and what shall be after him, who can tell him?"},{"num":15,"verse":"The labour of the foolish wearies all of them because they do not know how to go to the city."},{"num":16,"verse":"¶ Woe to thee, O land, when thy king is a child, and thy princes banquet in the morning!"},{"num":17,"verse":"Blessed art thou, O land, when thy king is the son of nobles, and thy princes eat in due season for strength, and not for drunkenness!"},{"num":18,"verse":"By much slothfulness the building decays, and through idleness of the hands the rain drips throughout the house."},{"num":19,"verse":"The banquet is made for pleasure, and wine makes merry; but money answers all things."},{"num":20,"verse":"Do not curse the king, not even in thy thought; and do not curse the rich even in the secret place of thy bedchamber; for the birds of the air shall carry the voice, and those who have wings shall tell the matter."}]