[{"num":10,"verse":"Dead flies cause the ointment of the apothecary to send forth a stinking savor; so doth a little folly in him that hath a reputation for wisdom and honor."},{"num":2,"verse":"A wise man’s heart is at his right hand, but a fool’s heart at his left."},{"num":3,"verse":"Yea also, when he that is a fool walketh along the way, his wisdom faileth him, and he saith to everyone that he is a fool."},{"num":4,"verse":"If the ire of the ruler rise up against thee, leave not thy station; for yielding pacifieth great offenses."},{"num":5,"verse":"There is an evil which I have seen under the sun as an error which proceedeth from the ruler:"},{"num":6,"verse":"folly is set in great dignity, and the rich sit in lowly places."},{"num":7,"verse":"I have seen servants upon horses, and princes walking as servants upon the earth."},{"num":8,"verse":"He that diggeth a pit shall fall into it; and whoso breaketh through a hedge, a serpent shall bite him."},{"num":9,"verse":"Whoso removeth out stones shall be hurt therewith; and he that cleaveth wood shall be endangered thereby."},{"num":10,"verse":"If the ax be blunt and one does not whet the edge, then must he put to it more strength; but wisdom is profitable to direct him."},{"num":11,"verse":"Surely the serpent will bite if not charmed, and a babbler is no better."},{"num":12,"verse":"The words of a wise man’s mouth are gracious, but the lips of a fool will swallow himself up;"},{"num":13,"verse":"the beginning of the words of his mouth is foolishness, and the end of his talk is mischievous madness."},{"num":14,"verse":"A fool also is full of words: A man cannot tell what shall be; and what shall be after him — who can tell him?"},{"num":15,"verse":"The labor of the foolish wearieth every one of them, because he knoweth not how to go to the city."},{"num":16,"verse":"Woe to thee, O land, when thy king is a child and thy princes feast in the morning!"},{"num":17,"verse":"Blessed art thou, O land, when thy king is the son of nobles, and thy princes eat in due season, for strength and not for drunkenness!"},{"num":18,"verse":"By much slothfulness the building decayeth, and through idleness of the hands the house leaks."},{"num":19,"verse":"A feast is made for laughter, and wine maketh merry; but money answereth all things."},{"num":20,"verse":"Curse not the king, no, not even in thy thoughts, and curse not the rich in thy bedchamber; for a bird of the air shall carry thy voice, and that which hath wings shall tell the matter."}]