[{"header":"Isaac Sends Jacob Away"},{"num":28,"verse":"Isaac called for Jacob and blessed him. Then he commanded him, “You are not to marry any of the Canaanite women. "},{"num":2,"verse":"Quick! Go to Paddan Aram. Go to the home of Bethuel, your mother’s father, and get yourself a wife from there from the daughters of your uncle Laban. "},{"num":3,"verse":"May God Almighty bless you, make you fertile, and increase the number of your descendants so that you will become a community of people. "},{"num":4,"verse":"May he give to you and your descendants the blessing of Abraham so that you may take possession of the land where you are now living, the land that God gave to Abraham.”"},{"num":5,"verse":"Isaac sent Jacob to Paddan Aram. Jacob went to live with Laban, son of Bethuel the Aramean and brother of Rebekah. She was the mother of Jacob and Esau."},{"num":6,"verse":"Esau learned that Isaac had blessed Jacob and had sent him away to Paddan Aram to get a wife from there. He learned that Isaac had blessed Jacob and had commanded him not to marry any of the Canaanite women. "},{"num":7,"verse":"He also learned that Jacob had obeyed his father and mother and had left for Paddan Aram. "},{"num":8,"verse":"Esau realized that his father Isaac disapproved of Canaanite women. "},{"num":9,"verse":"So he went to Ishmael and married Mahalath, daughter of Abraham’s son Ishmael and sister of Nebaioth, in addition to the wives he had."},{"header":"Jacob’s First Encounter with God"},{"num":10,"verse":"Jacob left Beersheba and traveled toward Haran. "},{"num":11,"verse":"When he came to a certain place, he stopped for the night because the sun had gone down. He took one of the stones from that place, put it under his head, and lay down there. "},{"num":12,"verse":"He had a dream in which he saw a stairway set up on the earth with its top reaching up to heaven. He saw the angels of God going up and coming down on it. "},{"num":13,"verse":"The Lord was standing above it, saying, “I am the Lord, the God of your grandfather Abraham and the God of Isaac. I will give the land on which you are lying to you and your descendants. "},{"num":14,"verse":"Your descendants will be like the dust on the earth. You will spread out to the west and to the east, to the north and to the south. Through you and through your descendant every family on earth will be blessed. "},{"num":15,"verse":"Remember, I am with you and will watch over you wherever you go. I will also bring you back to this land because I will not leave you until I do what I’ve promised you.”"},{"num":16,"verse":"Then Jacob woke up from his sleep and exclaimed, “Certainly, the Lord is in this place, and I didn’t know it!” "},{"num":17,"verse":"Filled with awe, he said, “How awe-inspiring this place is! Certainly, this is the house of God and the gateway to heaven!”"},{"num":18,"verse":"Early the next morning Jacob took the stone he had put under his head. He set it up as a marker and poured olive oil on top of it. "},{"num":19,"verse":"He named that place Bethel [House of God]. Previously, the name of the city was Luz."},{"num":20,"verse":"Then Jacob made a vow: “If God will be with me and will watch over me on my trip and give me food to eat and clothes to wear, "},{"num":21,"verse":"and if I return safely to my father’s home, then the Lord will be my God. "},{"num":22,"verse":"This stone that I have set up as a marker will be the house of God, and I will surely give you a tenth of everything you give me.”"}]