[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(16) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "There is no cause.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The Hebrew is elliptical and difficult; various interpretations are suggested, among which that given in the Authorised Version expresses very well the sense, although not an accurate translation. Amnon was now doing her a greater wrong than at first, because he was now bound, in consequence of that, to protect and comfort her.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13:1-20 From henceforward David was followed with one trouble after another. Adultery and murder were David's sins, the like sins among his children were the beginnings of his punishment: he was too indulgent to his children. Thus David might trace the sins of his children to his own misconduct, which must have made the anguish of the chastisement worse. Let no one ever expect good treatment from those who are capable of attempting their seduction; but it is better to suffer the greatest wrong than to commit the least sin.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The sense of the passage probably is, \"And she spake with him on account of this great wrong in sending me away, greater than the other wrong which thou hast done me (said she), but he hearkened not unto her.\" The Hebrew text is probably corrupt, and the writer blends Tamar's words with his own narrative. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "15. Then Amnon hated her exceedingly—It is not unusual for persons instigated by violent and irregular passions to go from one extreme to another. In Amnon's case the sudden revulsion is easily accounted for; the atrocity of his conduct, with all the feelings of shame, remorse, and dread of exposure and punishment, now burst upon his mind, rendering the presence of Tamar intolerably painful to him.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "There is no cause, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to wit, given thee by me. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "This evil is greater than the other:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " this she might truly say, because though the other was in itself a greater sin, yet this was an act of greater inhumanity and barbarous cruelty, and a greater wrong and calamity to her, (which she means by evil,) because it exposed her to public infamy and contempt, as if she had been an impudent strumpet, and had either enticed him to the sin, or at least consented to it; and besides, it turned a private offence into a public scandal, to the great dishonour of God and of his people Israel, and especially of all the royal family, and was likely to cause direful passions, and breaches, and mischiefs among them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And she said unto him, there is no cause,.... For such treatment as this: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "this evil in sending me away is greater than the other that thou didst unto me; not that this was a greater sin, but it was a greater evil or injury to her, that being done secretly, this openly; being turned out in that open manner, it might look as if she was the aggressor, and had drawn her brother into this sin, or however had consented to it; had it been kept a secret, she would not have been exposed to public shame and disgrace, and she might have been disposed of in marriage to another; it would not have been known to the grief of her father, to the revenge of Absalom, and to the dishonour of religion; besides, the sin of Amnon might have been more easily excused, if any excuse could be made for it, as that it arose from the force of lust, and a strong impure affection, but this from barbarity and inhumanity: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "but he would not hearken unto her; but insisted upon her immediate departure. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "but he would not hearken unto her; but insisted upon her immediate departure. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And she said unto him, There is no cause: this evil in sending me away is greater than the other that thou didst unto me. But he would not hearken unto her.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". There is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "no cause",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The Heb. text cannot be so translated, and is certainly corrupt. The Sept. is also confused, but its original reading as indicated by the Old Latin Version gives an excellent sense, thus; “",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And she said unto him, Nay, my brother, for greater will be this latter wrong, in sending me away, than the former that thou didst unto me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 16.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - There is ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "no cause",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This is certainly not a possible translation of the Hebrew, which is probably corrupt; and though Tamar's words may have been broken and hysterical, we cannot suppose that the narrator intended to represent her sobs. The text is rendered by Philippsohn, \"And she said to him respecting the evil deed, Greater is this than the other.\" Similarly Cahen renders it, \"au sujet de ce mal.\" Flat as this is, no better rendering is possible; but the Vatican copy of the Septuagint has a reading which suggests the line of probable emendation: \"Nay, my brother, this evil is greater than the other.\" It was greater because it east the reproach upon her, refused her the solace of his affection, and made her feel that she had been humbled, not because he loved her, but for mere phantasy. He has had his will, and, careless of her sorrow, he scuds her contemptuously away, indifferent to the wrong he has done her, and piqued and mortified at her indignant resistance. However much we may disapprove of Absalom's conduct, Amnon richly deserved his punishment.  2 Samuel 13:16",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Tamar replied, \"Do not become the cause of this great evil, (which is) greater than another that thou hast done to me, to thrust me away,\" i.e., do not add to the great wrong which thou hast done me the still greater one of thrusting me away. This is apparently the only admissible explanation of the difficult expression אל־אדות, as nothing more is needed than to supply תּהי. Tamar calls his sending her away a greater evil than the one already done to her, because it would inevitably be supposed that she had been guilty of some shameful conduct herself, that the seduction had come from her; whereas she was perfectly innocent, and had done nothing but what affection towards a sick brother dictated, whilst it was impossible for her to call for help (as prescribed in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 22:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), because Amnon had sent the servants away, and Tamar could not in any case expect assistance from them.",
        "children": []
      }
    ]
  }
]