[{"num":24,"verse":"As Yeshua left the Temple and was going away, his talmidim came and called his attention to its buildings. "},{"num":2,"verse":"But he answered them, “You see all these? Yes! I tell you, they will be totally destroyed — not a single stone will be left standing!”"},{"num":3,"verse":"When he was sitting on the Mount of Olives, the talmidim came to him privately. “Tell us,” they said, “when will these things happen? And what will be the sign that you are coming, and that the ‘olam hazeh is ending?”"},{"num":4,"verse":"Yeshua replied: “Watch out! Don’t let anyone fool you! "},{"num":5,"verse":"For many will come in my name, saying, ‘I am the Messiah!’ and they will lead many astray. "},{"num":6,"verse":"You will hear the noise of wars nearby and the news of wars far off; see to it that you don’t become frightened. Such things must happen, but the end is yet to come. "},{"num":7,"verse":"For peoples will fight each other, nations will fight each other, and there will be famines and earthquakes in various parts of the world; "},{"num":8,"verse":"all this is but the beginning of the ‘birth-pains.’ "},{"num":9,"verse":"At that time you will be arrested and handed over to be punished and put to death, and all peoples will hate you because of me. "},{"num":10,"verse":"At that time many will be trapped into betraying and hating each other, "},{"num":11,"verse":"many false prophets will appear and fool many people; "},{"num":12,"verse":"and many people’s love will grow cold because of increased distance from Torah. "},{"num":13,"verse":"But whoever holds out till the end will be delivered. "},{"num":14,"verse":"And this Good News about the Kingdom will be announced throughout the whole world as a witness to all the Goyim. It is then that the end will come."},{"num":15,"verse":"“So when you see the abomination that causes devastation spoken about through the prophet Dani’el standing in the Holy Place” (let the reader understand the allusion), "},{"num":16,"verse":"“that will be the time for those in Y’hudah to escape to the hills. "},{"num":17,"verse":"If someone is on the roof, he must not go down to gather his belongings from his house; "},{"num":18,"verse":"if someone is in the field, he must not turn back to get his coat. "},{"num":19,"verse":"What a terrible time it will be for pregnant women and nursing mothers! "},{"num":20,"verse":"Pray that you will not have to escape in winter or on Shabbat. "},{"num":21,"verse":"For there will be trouble then worse than there has ever been from the beginning of the world until now, and there will be nothing like it again! "},{"num":22,"verse":"Indeed, if the length of this time had not been limited, no one would survive; but for the sake of those who have been chosen, its length will be limited."},{"num":23,"verse":"“At that time, if someone says to you, ‘Look! Here’s the Messiah!’ or, ‘There he is!’ don’t believe him. "},{"num":24,"verse":"For there will appear false Messiahs and false prophets performing great miracles — amazing things! — so as to fool even the chosen, if possible. "},{"num":25,"verse":"There! I have told you in advance! "},{"num":26,"verse":"So if people say to you, ‘Listen! He’s out in the desert!’ don’t go; or, ‘Look! He’s hidden away in a secret room!’ don’t believe it. "},{"num":27,"verse":"For when the Son of Man does come, it will be like lightning that flashes out of the east and fills the sky to the western horizon. "},{"num":28,"verse":"Wherever there’s a dead body, that’s where you find the vultures."},{"num":29,"verse":"“But immediately following the trouble of those times,"},{"num":30,"verse":"“Then the sign of the Son of Man will appear in the sky, all the tribes of the Land will mourn, and they will see the Son of Man coming on the clouds of heaven with tremendous power and glory. "},{"num":31,"verse":"He will send out his angels with a great shofar; and they will gather together his chosen people from the four winds, from one end of heaven to the other."},{"num":32,"verse":"“Now let the fig tree teach you its lesson: when its branches begin to sprout and leaves appear, you know that summer is approaching. "},{"num":33,"verse":"In the same way, when you see all these things, you are to know that the time is near, right at the door. "},{"num":34,"verse":"Yes! I tell you that this people will certainly not pass away before all these things happen. "},{"num":35,"verse":"Heaven and earth will pass away, but my words will never pass away."},{"num":36,"verse":"“But when that day and hour will come, no one knows — not the angels in heaven, not the Son, only the Father. "},{"num":37,"verse":"For the Son of Man’s coming will be just as it was in the days of Noach. "},{"num":38,"verse":"Back then, before the Flood, people went on eating and drinking, taking wives and becoming wives, right up till the day Noach entered the ark; "},{"num":39,"verse":"and they didn’t know what was happening until the Flood came and swept them all away. It will be just like that when the Son of Man comes. "},{"num":40,"verse":"Then there will be two men in a field — one will be taken and the other left behind. "},{"num":41,"verse":"There will be two women grinding flour at the mill — one will be taken and the other left behind. "},{"num":42,"verse":"So stay alert, because you don’t know on what day your Lord will come. "},{"num":43,"verse":"But you do know this: had the owner of the house known when the thief was coming, he would have stayed awake and not allowed his house to be broken into. "},{"num":44,"verse":"Therefore you too must always be ready, for the Son of Man will come when you are not expecting him."},{"num":45,"verse":"“Who is the faithful and sensible servant whose master puts him in charge of the household staff, to give them their food at the proper time? "},{"num":46,"verse":"It will go well with that servant if he is found doing his job when his master comes. "},{"num":47,"verse":"Yes, I tell you that he will put him in charge of all he owns. "},{"num":48,"verse":"But if that servant is wicked and says to himself, ‘My master is taking his time’; "},{"num":49,"verse":"and he starts beating up his fellow servants and spends his time eating and drinking with drunkards; "},{"num":50,"verse":"then his master will come on a day the servant does not expect, at a time he doesn’t know; "},{"num":51,"verse":"and he will cut him in two and put him with the hypocrites, where people will wail and grind their teeth!"}]