[{"num":24,"verse":"And having exited from the Beis Hamikdash, Rebbe, Melech HaMoshiach departed, and his talmidim approached to show him the buildings of the Beis Hamikdash."},{"num":2,"verse":"But he said in reply to them, Do you not see all these things? Omein, I say to you, by no means will be left here one stone upon another, for all will be demolished."},{"num":3,"verse":"And while Rebbe, Melech HaMoshiach was sitting upon the Mount of Olives, his talmidim approached him in a yechidus, saying, Tell us ad mosai (how much longer), when will these things be and what about the ot (sign) of the Bias Moshiach, of your Coming, and the Ketz HaOlam Hazeh?"},{"num":4,"verse":"And Rebbe, Melech HaMoshiach said in reply to them, See to it that someone does not deceive you."},{"num":5,"verse":"For many will come in my Name, saying, I am the Rebbe, Melech HaMoshiach. And they will deceive many."},{"num":6,"verse":"But you are about to hear about milchamot (wars) and rumors of milchamot. See to it that you are not alarmed, for it is necessary for this to happen, but it is not yet HaKetz (the End)."},{"num":7,"verse":"For there will be an intifada of ethnic group against ethnic group, and malchut against malchut. There will be famines, earthquakes in place after place."},{"num":8,"verse":"But all these things are but the beginning of the Chevlei [Moshiach]."},{"num":9,"verse":"Then they will hand you over to tzoros and they will kill you and you will be hated by all the ethnic groups on account of the Name of me (Rebbe, Melech HaMoshiach Yehoshua, Yeshua)."},{"num":10,"verse":"And then many will be led into chet (sin), and others they will hand over, and they will hate others."},{"num":11,"verse":"And many neviei sheker (false prophets) will arise and will deceive many."},{"num":12,"verse":"And because of the increased mufkarut (lawlessness, anarchy—Mt 7:23), the agape (love) of many will become cold."},{"num":13,"verse":"But the one having endured to HaKetz (the End), this one will receive Yeshuat Eloheinu."},{"num":14,"verse":"And this Besuras HaGeulah of the Malchut will be announced in kol haOlam (all the world) as an edut to all the Goyim, and then will come HaKetz (the End)."},{"num":15,"verse":"Therefore, when you see the SHIKUTS MESHOMEM [Mk 13:14] (Abomination of Desolation), the thing spoken through Daniel HaNavi, having stood in the Makom Kadosh (Holy Place, i.e., the Beis Hamikdash)—let the reader understand!"},{"num":16,"verse":"Then the ones in Yehudah, let them flee to the mountains."},{"num":17,"verse":"The one upon the roof, let him not come down to carry away the things from his bais (house)."},{"num":18,"verse":"And the one in the field, let him not turn back to get his kaftan."},{"num":19,"verse":"But oy to the ones with child and the ones with nursing infants in those days."},{"num":20,"verse":"But offer tefillos that your escape may not be in winter or on Shabbos."},{"num":21,"verse":"For then will be Tzarah Gedolah (Great Tribulation) such as has not been from Reshit HaOlam (Beginning of the World) until now nor will it by any means happen again."},{"num":22,"verse":"And if those days were not cut short, kol basar (all flesh) would not be saved. But, on account of the Kadoshim, the Bechirim (Chosen Ones), those days will be cut short."},{"num":23,"verse":"Then, if someone says to you, Hinei, here is the Rebbe, Melech HaMoshiach!, Or, Hinei! Here! Do not have emunah (faith) [in that]."},{"num":24,"verse":"For meshichei sheker (false Moshiachs) will arise, and neviei sheker (false prophets), and they will give otot gedolim (great signs) and moftim (wonders), so as to deceive, if possible, even the Bechirim (Chosen ones)."},{"num":25,"verse":"Hinei! I have told you beforehand!"},{"num":26,"verse":"If, therefore, they say to you, Hinei! He [Moshiach] is in the desert! Do not go out [there]. Hinei! [Moshiach] is in the secret cheder (room)! Do not have emunah [in that]."},{"num":27,"verse":"For as lightning goes out from the mizrach (east) and shines to as far as the maarav (west), thus will be the Bias HaMoshiach (coming of the Messiah, the Ben HaAdam, Son of Man‖DANIEL 7:13)."},{"num":28,"verse":"Wherever the place of the Geviya (Corpse) is, there will be gathered together the nesharim (vultures, eagles [popularly])."},{"num":29,"verse":"Immediately after the Tzarah (Tribulation Mt 24:21) of those days, the shemesh will be darkened, and the levanah will not give its light. And the kokhavim will fall from Shomayim, and the powers of the heavens will be shaken."},{"num":30,"verse":"And then will appear the Ot Ben Adam (the Sign of the Son of Man) in Shomayim. All the tribes of kol haaretz (all the earth) will see the Ben HaAdam Moshiach and his Bias, his Coming, on the ananim of Shomayim (clouds of glory of Heaven) with gevurah (power) and great kavod (glory)."},{"num":31,"verse":"Moshiach will send his malachim with a loud blast of the Shofar, and the malachim will gather together Moshiach’s Bechirim from the four winds, from one end of Shomayim to the other."},{"num":32,"verse":"And from the etz teenah (fig tree), learn its parabolic lesson: when its branch has become tender already and sprouts leaves, you know that Kayitz (Summer) is near;"},{"num":33,"verse":"thus also you, when you see all these things, know that it is near, at the very doors."},{"num":34,"verse":"Omein, I say to you, that this dor (generation) will by no means pass away until all these things come about."},{"num":35,"verse":"Shomayim vHaAretz will pass away, but my Dvar will by no means pass away."},{"num":36,"verse":"But concerning that day and hour, no one has daas, not the malachim of Shomayim, but only HaAv (the Father) of me."},{"num":37,"verse":"For as in the days of Noach, thus will be the Bias HaMoshiach, the Coming of the Ben HaAdam."},{"num":38,"verse":"For as they were in those days before HaMabbul (the Flood), eating and drinking, marrying and being given in marriage, until the day when Noach entered the Tevah,"},{"num":39,"verse":"and they did not have daas until HaMabbul came and took away everything‖thus also will be the Bias HaMoshiach, the Coming of the Ben HaAdam."},{"num":40,"verse":"Then two men will be in the field, one is snatched away, and one is left behind (not retained)."},{"num":41,"verse":"Two women are grinding in the mill house, one is snatched away, one is left behind."},{"num":42,"verse":"So be shomer, be on your guard, because you do not have daas on which day will be the Bias of [Moshiach] Adoneichem (your L-rd)."},{"num":43,"verse":"But understand this: if the Baal Bayit had known in which watch the ganav is coming, he would have stayed awake and would not have allowed his bais to be dug through."},{"num":44,"verse":"For this reason also you be shomer, for in the hour when you do not think, then will be the Bias HaMoshiach (the Coming of the Ben HaAdam, DANIEL 7:13)."},{"num":45,"verse":"Who then is the faithful and wise eved (servant), whom the Adon appointed over the household servants to give the other servants their okhel at the prescribed time?"},{"num":46,"verse":"Ashrey (happy) is that eved whom, when his Adon comes, finds him so doing."},{"num":47,"verse":"Omein, I say to you, the Adon will ordain him to oversee all his possessions."},{"num":48,"verse":"But if that wicked slave says in his heart, Adoni (My Master) is dragging his feet,"},{"num":49,"verse":"and that slave begins to beat his fellow avadim (slaves), and he eats and drinks with the ones getting drunk,"},{"num":50,"verse":"the Adon of that slave will come on a day which he does not expect and at an hour of which he does not have daas."},{"num":51,"verse":"And the Adon will cut in two that slave, and the slave’s portion he will put with the tzevuim (hypocrites). There will be weeping and grinding of teeth."}]