[{"header":"Jesus Prophesies the Destruction of the Temple"},{"num":24,"verse":"As Jesus was leaving the temple courts, his disciples came to him and pointed out the beautiful architecture of the temple. "},{"num":2,"verse":"And Jesus turned to them and said, “Take a good look at all these things, for I’m telling you, there will not be one stone left upon another. It will all be leveled!”"},{"num":3,"verse":"Later, when they arrived at the Mount of Olives, his disciples came privately to where he was sitting and said, “Tell us, when will these things happen? And what sign should we expect to signal your coming and the completion of this age?”"},{"num":4,"verse":"Jesus answered, “At that time deception will run rampant. So beware that you are not fooled! "},{"num":5,"verse":"For many will appear on the scene claiming my authority or saying about themselves, ‘I am the Anointed One,’ and they will lead many astray."},{"num":6,"verse":"“You will hear of wars and revolutions on every side, with more rumors of wars to come. Don’t panic or give in to your fears, for the breaking apart of the world’s systems is destined to happen. But it won’t yet be the end; it will still be unfolding."},{"num":7,"verse":"“Nations will go to war against nations and kingdoms against kingdoms. And there will be terrible earthquakes, horrible epidemics, and famines in place after place. "},{"num":8,"verse":"This is how the birth pains of the new age will begin!”"},{"header":"Persecution of Believers"},{"num":9,"verse":"“You can expect to be persecuted, even killed; for you will be hated by all the nations because of your love for me. "},{"num":10,"verse":"Then many will stop following me and fall away, and they will betray one another and hate one another. "},{"num":11,"verse":"And many lying prophets will arise, deceiving multitudes and leading them away from the path of truth. "},{"num":12,"verse":"There will be such an increase of the sin of lawlessness that those whose hearts once burned with passion for God and others will grow cold. "},{"num":13,"verse":"But hold your hope firmly to the end and you will experience life and deliverance."},{"num":14,"verse":"“Yet through it all, the good news of heaven’s kingdom will be proclaimed all over the world, providing every nation with a demonstration of the reality of God. And after that the end of this age will arrive.”"},{"header":"The Detestable Idol That Brings Misery"},{"num":15,"verse":"“When you witness what Daniel prophesied, ‘the disgusting destroyer,’ taking its stand in the Holy Place [let the reader learn], "},{"num":16,"verse":"then those in the land of Judah must escape to the higher ground. "},{"num":17,"verse":"On that day, if you happen to be outside, don’t go back inside to gather belongings. "},{"num":18,"verse":"And if you’re working out in the field, don’t run back home to get a coat. "},{"num":19,"verse":"It will be especially hard for pregnant women and for those nursing their babies in those days. "},{"num":20,"verse":"So pray that your escape will not be during the winter months or on a Sabbath. "},{"num":21,"verse":"For this will be a time of great misery beyond the magnitude of anything the world has ever seen or ever will see. Unless God limited those days, no one would escape. "},{"num":22,"verse":"But because of his love for those chosen to be his, he will shorten that time of trouble."},{"num":23,"verse":"“And you will hear reports from some, saying, ‘Look, he has returned,’ ‘The Messiah is over here,’ or ‘The Messiah is over there!’ Don’t believe it. "},{"num":24,"verse":"For there will be imposters falsely claiming to be God’s ‘Anointed One,’ and false prophets will arise to perform miracle signs to lead astray, if possible, those God has chosen to be his. "},{"num":25,"verse":"Remember this, for I prophesy it will happen! "},{"num":26,"verse":"So if someone says to you, ‘Look, the Anointed One has returned! He’s in the desert,’ don’t go chasing after him. Or if they say to you, ‘Look, he’s here in our house,’ don’t believe it. "},{"num":27,"verse":"The appearing of the Son of Man will burst forth with the brightness of lightning shining from the eastern sky to the west. "},{"num":28,"verse":"How do birds of prey know where the dead body is? They just know instinctively, and so you will know when I appear.”"},{"header":"The Appearing of the Son of Man"},{"num":29,"verse":"“Then immediately this is what will take place: ‘The sun will be darkened and the moon give no light. The stars will fall from the sky and all the cosmic powers will be shaken.’ "},{"num":30,"verse":"Then the sign announcing the Son of Man will appear in the sky, and all the nations of the earth will mourn over him. And they will see the Son of Man appearing in the clouds of heaven, revealed with mighty power, great splendor, and glory. "},{"num":31,"verse":"And he will send his messengers with the loud blast of the trumpet, and with a great voice they will gather his beloved chosen ones from the four winds, from one end of heaven to the other!”"},{"header":"A Parable of the Fig Tree"},{"num":32,"verse":"“Now learn the lesson from the parable of the fig tree. When spring arrives and it sends out its tender branches and sprouts leaves, you know that summer is near. "},{"num":33,"verse":"So it will be with you, for when you observe all these things taking place, you will know that he is near, even at the door! "},{"num":34,"verse":"I assure you, the end of this age will not come until all I have spoken comes to pass. "},{"num":35,"verse":"The earth and sky will wear out and fade away before one word I speak loses its power or fails to accomplish its purpose.”"},{"header":"Live Always Ready for His Appearing"},{"num":36,"verse":"“Concerning that day and exact hour, no one knows when it will arrive, not even the angels of heaven—only the Father knows. "},{"num":37,"verse":"For it will be like it was in the days of Noah when the Son of Man appears. "},{"num":38,"verse":"Before the flood, people lived their lives eating, drinking, marrying, and having children. "},{"num":39,"verse":"They didn’t realize the end was near until Noah entered the ark, and then suddenly, the flood came and took them all away in judgment. It will happen the same way when the Son of Man appears. "},{"num":40,"verse":"At that time, two men will be working on the farm; one will be taken away in judgment, the other left. "},{"num":41,"verse":"Two women will be grinding grain; one will be taken away in judgment, the other left. "},{"num":42,"verse":"This is why you must stay alert: because no one knows the day your Lord will come."},{"num":43,"verse":"“But realize this: If a homeowner had known what time of night the burglar would come to rob his house, he would have been alert and ready, and not let his house be robbed. "},{"num":44,"verse":"So always be ready, alert, and prepared, because at an hour when you’re not expecting him, the Son of Man will come.”"},{"header":"The Wise and Faithful Servant"},{"num":45,"verse":"“What would qualify a servant to manage his master’s house? He would be a wise servant who is both faithful and dependable. The master would commission him to oversee others, for he would lead them well and give them food at the right time. "},{"num":46,"verse":"What joy and blessing will come to that faithful servant when the master comes home to find him serving with excellence! "},{"num":47,"verse":"I can promise you, the master will raise him up and put him in charge of all that he owns."},{"num":48,"verse":"“But the evil servant says in his heart, ‘My master delays his coming, and who knows when he will return?’ And because of the delay, the servant mistreats those in his master’s household. Instead of caring for the ones he was appointed to serve, "},{"num":49,"verse":"he abuses the other servants and begins to party with drunkards. "},{"num":50,"verse":"Let me tell you what will happen to him. His master will suddenly return unexpectedly, and he will remove the abusive, selfish servant from his position of trust. "},{"num":51,"verse":"And the master will cut him in two and assign him to the place of great sorrow and anguish along with all the other hypocrites.”"}]