[{"num":24,"verse":"Jesus left the temple and was going away. His disciples came to him. They wanted to show him the different buildings that were a part of the temple."},{"num":2,"verse":"But Jesus answered them, `Do you see these buildings? I tell you the truth. Not one stone here will be left on top of another stone. They will all be thrown down!'"},{"num":3,"verse":"Jesus was sitting on the hill called the Mount of Olives. The disciples came to him alone. They said, `Tell us, when will this happen? What will be the sign to show you are coming and that it is the end of this world?'"},{"num":4,"verse":"Jesus answered them, `Take care. Do not let anyone fool you."},{"num":5,"verse":"Many men will come in my name. They will say, \"I am the Christ\". They will fool many people."},{"num":6,"verse":"You will hear about wars. You will hear that war is coming. But do not fear. These things must happen, but that is not yet the end."},{"num":7,"verse":"One tribe will fight against another tribe. And one country will fight against another country. The people will have no food to eat. Many people will be sick. The earth will shake in many different places."},{"num":8,"verse":"All these troubles are only the beginning of troubles that will come."},{"num":9,"verse":"`Then people will trouble you and kill you. All nations will hate you because you are true to me."},{"num":10,"verse":"Then many people will stop believing. They will give one another over to trouble. They will hate one another."},{"num":11,"verse":"Many people will come and say they are prophets of God. But they will not be true. They will fool many people."},{"num":12,"verse":"People will do more and more wrong things and many people will stop loving me."},{"num":13,"verse":"But the person who keeps on being true to me until the end, that one will be saved."},{"num":14,"verse":"This good news about the kingdom will be told in all the world. The people in all countries must know about it. And then the end will come.'"},{"num":15,"verse":"`Daniel the prophet said that people would put something very bad in the temple.' (Let the one who reads this understand it.)"},{"num":16,"verse":"`When that happens, the people in Judea must go quickly to the hills."},{"num":17,"verse":"A person who is on the top of a house must not go down into the house to get things from the house."},{"num":18,"verse":"A person who is working in the fields must not go back home to get his coat."},{"num":19,"verse":"In those days it will be very hard for women who are to have a child. It will be very hard for mothers who have a baby."},{"num":20,"verse":"Ask God that you may not have to go in the cold time of the year or on the Sabbath day."},{"num":21,"verse":"The trouble then will be bigger than any other trouble since God made the world. And there never will be any trouble as big as that."},{"num":22,"verse":"No person would be saved if the Lord did not cut the time of trouble shorter. He will cut it shorter for the sake of his chosen people."},{"num":23,"verse":"`If anyone says to you then, \"Look, here is the Christ!\" or \"There he is!\" do not believe it."},{"num":24,"verse":"People will come and say they are the Christ. People will come and say they are prophets. But they are not true. They will show big signs and do wonderful things to fool people. They will fool God's chosen people if they can."},{"num":25,"verse":"Watch! I have told you these things before they happen."},{"num":26,"verse":"So if people say to you, \"He is in the wilderness,\" do not go there. If they say, \"He is hiding somewhere,\" do not believe it."},{"num":27,"verse":"When lightning shines in the east, it can be seen in the west. It will be like that when the Son of Man comes."},{"num":28,"verse":"The big birds that eat meat will all go to the place where the dead body is.'"},{"num":29,"verse":"`Right after that time of trouble, the sun will be dark. The moon will not shine. The stars will fall from the sky. And the powers in the sky will be shaken."},{"num":30,"verse":"Then people will see the sign of the Son of Man in the sky. Then all the people of the earth will cry. They will see the Son of Man coming on the clouds in the sky. He will have much power and will be very great."},{"num":31,"verse":"He will send his angels to call with a loud trumpet or horn. They will gather his chosen people from everywhere all over the earth.'"},{"num":32,"verse":"`Learn a lesson from the fig tree. As soon as its branches begin to grow and the leaves come, then you know it will soon be the warm time of the year."},{"num":33,"verse":"It is the same when you see all these things. You will know that the time is very near, right at the door."},{"num":34,"verse":"I tell you the truth. The people who are living then, will not die before all these things happen."},{"num":35,"verse":"The sky and the earth will pass away, but my words will not pass away.'"},{"num":36,"verse":"`But no one knows the day and the hour when the Son of Man will come. Even the angels in heaven and the Son do not know. Only the Father knows."},{"num":37,"verse":"When the Son of Man comes, it will be as it was in the time of Noah."},{"num":38,"verse":"In the days before the water covered the earth, people ate and drank. They married and gave their daughters to be married. Then one day Noah went into his house built on a boat."},{"num":39,"verse":"The people did not know until much water came and killed them all. When the Son of Man comes, it will be like that."},{"num":40,"verse":"Two men will be working together in the field. One will be taken and the other will be left."},{"num":41,"verse":"Two women will be making flour together. One woman will be taken away and one woman will be left."},{"num":42,"verse":"So watch! You do not know what day your Lord will come."},{"num":43,"verse":"And remember this. The owner of the house does not know at what time of the night a man will come to steal something. If he knew, he would watch and not let the man break into his house."},{"num":44,"verse":"So, be ready! The Son of Man will come at a time when you are not looking for him."},{"num":45,"verse":"`Who is like a wise servant who can be trusted? His master will put him in charge of his other servants. He gives them their food at the right time."},{"num":46,"verse":"The servant who is doing this when his master comes, will be blessed."},{"num":47,"verse":"I tell you the truth. His master will put him in charge of all that he has."},{"num":48,"verse":"But if the servant is bad, he will say to himself, \"My master will not come just now.\""},{"num":49,"verse":"Then he will begin to beat the other servants. He will eat and drink with men who are drunk."},{"num":50,"verse":"The master of that servant will come on a day the servant is not looking for him. He will not know the time he is coming home."},{"num":51,"verse":"The master will punish him and lock him in with people who are not true. People there will cry and grind [make a noise with] their teeth.'"}]