[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "THE ZEAL OF THE PEOPLE IN OFFERING AND ASSISTING IN THE WORK.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(21) They came, every one whose heart stirred him up.—All classes came, “men and women” (Exodus 35:22), rich and poor, “rulers” (Exodus 35:27), and those whose only skill was to “spin with their hands” (Exodus 35:25). And the great majority gave freely—to the utmost of their power. Still it is implied, both here and in Exodus 35:22; Exodus 35:29, that there were some whose hearts did not stir them up. Enough and to spare, was, however, contributed, and at last the people had to be “restrained from bringing” (Exodus 36:8).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(21) ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "They came, every one whose heart stirred him up.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—All classes came, “men and women” (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 35:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), rich and poor, “rulers” (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 35:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and those whose only skill was to “spin with their hands” (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 35:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). And the great majority gave freely—to the utmost of their power. Still it is implied, both here and in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 35:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 35:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", that there were some whose hearts did not stir them up. Enough and to spare, was, however, contributed, and at last the people had to be “restrained from bringing” (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 36:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The Lord’s offering—i.e., “their offering to Jehovah.”",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The Lord’s offering—",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "i.e., ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "“their offering to Jehovah.”",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Exodus",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "AN OLD SUBSCRIPTION LISTExodus 35:21",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "AN OLD SUBSCRIPTION LIST",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 35:21",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " This is the beginning of the catalogue of contributions towards the erection of the Tabernacle in the wilderness. It emphasises the purely spontaneous and voluntary character of the gifts. There was plenty of compulsory work, of statutory contribution, in the Old Testament system of worship. Sacrifices and tithes and other things were imperative, but the Tabernacle was constructed by means of undemanded offerings, and there were parts of the standing ritual which were left to the promptings of the worshipper’s own spirit. There was always a door through which the impulses of devout hearts could come in, to animate what else would have become dead, mechanical compliance with prescribed obligations. That spontaneous surrender of precious things, not because a man must give them, but because he delights in letting his love come to the surface and find utterance in giving which is still more blessed than receiving, had but a narrow and subordinate sphere of action assigned to it in the legal system of the Old Covenant, but it fills the whole sphere of Christianity, and becomes the only kind of offering which corresponds to its genius and is acceptable to Christ. We may look, then, not merely at the words of our text, but at the whole section of which they form the introduction, and find large lessons for ourselves, not only in regard to the one form of Christian service which is pecuniary liberality, but in reference to all which we have to do for Jesus Christ, in the picture which it gives us of that eager crowd of willing givers, flocking to the presence of the lawgiver, with hands laden with gifts so various in kind and value, but all precious because freely and delightedly brought, and all needed for the structure of God’s house.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. We have set forth here the true motive of acceptable service. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. We have set forth here the true motive of acceptable service.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘They came, every one whose heart stirred him up, and every one whom his spirit made willing.’ There is a striking metaphor in that last word. Wherever the spirit is touched with the sweet influences of God’s love, and loves and gives back again, that spirit is buoyant, lifted, raised above the low, flat levels where selfishness feeds fat and then rots. The spirit is raised by any great and unselfish emotion. There is buoyancy and glad consciousness of elevation in all the self-sacrifice of love, which dilates and lifts the spirit as the light gas smoothes out the limp folds of silk in a balloon, and sends it heavenwards, a full sphere. Only service or surrender, which is thus cheerful because it is the natural expression of love, is true service in God’s sight. Whosoever, then, had his spirit raised and made buoyant by a great glad resolve to give up some precious thing for God’s sanctuary, came with his gift in his hand, and he and it were accepted. That trusting of men’s giving to spontaneous liberality was exceptional under the law. It is normal under the Gospel, and has filled the whole field, and driven out the other principle of statutory and constrained service and sacrifice altogether. We have its feeble beginnings in this incident. It is sovereign in Christ’s Church. There are no pressed men on board Christ’s ship. None but volunteers make up His army. ‘Thy people shall be willing in the day of Thy might.’ He cares nothing for any service but such as it would be pain to keep back; nothing for any service which is not given with a smile of glad thankfulness that we are able to give it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And for the true acceptableness of Christian service, that motive of thankful love must be actually present in each deed. It is not enough that we should determine on and begin a course of sacrifice or work under the influence of that great motive, unless we renew it at each step. We cannot hallow a row of actions in that wholesale fashion by baptizing the first of them with the cleansing waters of true consecration, while the rest are done from lower motives. Each deed must be sanctified by the presence of the true motive, if it is to be worthy of Christ’s acceptance. But there is a constant tendency in all Christian work to slide off its only right foundation, and having been begun ‘in the spirit,’ to be carried on ‘in the flesh.’ Constant watchfulness is needed to resist this tendency, which, if yielded to, destroys the worth and power, and changes the inmost nature, of apparently devoted and earnest service.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Not the least subtle and dangerous of these spurious motives which steal in surreptitiously to mar our work for Christ is habit. Service done from custom, and representing no present impulse of thankful devotion, may pass muster with us, but does it do so with God? No doubt a habit of godly service is, in some aspects, a good, and it is well to enlist that tremendous power of custom which sways so much of our lives, on the side of godliness. But it is not good, but, on the contrary, pure loss, when habit becomes mechanical, and, instead of making it easier to call up the true motive, excludes that motive, and makes it easy to do the deed without it. I am afraid that if such thoughts were applied as a sieve to sift the abundant so-called Christian work of the present day, there would be an alarming and, to the workers, astonishing quantity of refuse that would not pass the meshes.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Let us, then, try to bring every act of service nominally done for Christ into conscious relation with the motive which ought to be its parent; for only the work that is done because our spirits lift us up, and our hearts are willing, is work that is accepted by Him, and is blessed to us.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And how is that to be secured? How is that glad temper of spontaneous and cheerful consecration to be attained and maintained? I know of but one way. ‘Brethren,’ said the Apostle, when he was talking about a very little matter-some small collection for a handful of poor people-’ye know the grace of our Lord Jesus Christ, how that, though He was rich, yet for our sakes He became poor, that we, through His poverty, might become rich.’ Let us keep our eyes fixed upon that great pattern of and motive for surrender; and our hearts will become willing, touched with the fire that flamed in His. There is only one method of securing the gladness and spontaneousness of devotion and of service, and that is, living very near to Jesus Christ, and drinking in for ourselves, as the very wine that turns to blood and life in our veins, the spirit of that dear Master. Every one whose heart is lifted up will have it lifted up because it holds on by Him who hath ascended up, and who, being ‘lifted up, draws all men to Him.’ The secret of consecration is communion with Jesus Christ.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The appeal to lower motives is often tempting, but always a mistake. Continual contact with Jesus Christ, and realisation of what He has done for us, are sure to open the deep fountains of the heart, and to secure abundant streams. If we can tap these perennial reservoirs they will yield like artesian wells, and need no creaking machinery to pump a scanty and intermittent supply. We cannot trust this deepest motive too much, nor appeal to it too exclusively.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Let me remind you, too, that Christ’s appeal to this motive leaves no loophole for selfishness or laziness. Responsibility is all the greater because we are left to assess ourselves. The blank form is sent to us, and He leaves it to our honour to fill it up. Do not tamper with the paper, for remember there is a Returning Officer that will examine your schedule, who knows all about your possessions. So, when He says, ‘Give as you like; and I do not want anything that you do not like,’ remember that ‘Give as you like’ ought to mean, ‘Give as you, who have received everything from Me, are bound to give.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. We get here the measure of acceptable work. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. We get here the measure of acceptable work.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "We have a long catalogue, very interesting in many respects, of the various gifts that the people brought. Such sentences as these occur over and over again-’And every man with whom was found’ so-and-so ‘brought it’; ‘And all the women did spin with their hands, and brought that which they had spun’; ‘And the rulers brought’ so-and-so. Such statements embody the very plain truism that what we have settles what we are bound to give. Or, to put it into grander words, capacity is the measure of duty. Our work is cut out for us by the faculties and opportunities that God has given us.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " That is a very easy thing to say, but it is an uncommonly hard thing honestly to apply. For there are plenty of people that are smitten with very unusual humility whenever you begin to talk to them about work. ‘It is not in my way,’ ‘I am not capable of that kind of service,’ and so on, and so on. One would believe in the genuineness of the excuse more readily if there were anything about which such people said, ‘Well, I ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "can",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " do that, at all events’; but such an all-round modesty, which is mostly observable when service is called for, is suspicious. It might be well for some of these retiring and idle Christians to remember the homely wisdom of ‘You never know what you can do till you try.’ On the other hand, there are many Christians who, for want of honest looking into their own power, for want of what I call sanctified originality, are content to run in the ruts that other people’s vehicles have made, without asking themselves whether that is the gauge that their wheels are fit for. Both these sets of people flagrantly neglect the plain law that what we have settles what we should give.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The form as well as the measure of our service is determined thereby. ‘She hath done what she could,’ said Jesus Christ about Mary. We often read that, as if it were a kind of apology for a sentimental and useless gift, because it was the best that she could bestow. I do not hear that tone in the words at all. I hear, rather, this, that duty is settled by faculty, and that nobody else has any business to interfere with that which a Christian soul, all aflame with the love of God, finds to be the spontaneous and natural expression of its devotion to the Master. The words are the vindication of the form of loving service; but let us not forget that they are also a very stringent requirement as to its measure, if it is to please Christ. ‘What she could’; the engine must be worked up to the last ounce of pressure that it will stand. All must be got out of it that can be got out of it. Is that the case about us? We talk about hard work for Christ. Have any of us ever, worked up to the edge of our capacity? I am afraid that if the principles that lie in this catalogue were applied to us, whether about our gold and silver, or about our more precious spiritual and mental possessions, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "we",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " could not say, ‘Every man with whom was found’ this, that, and the other, ‘brought it for the work.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Notice, again, how in this list of offerings there comes out the great thought of the infinite variety of forms of service and offering, which are all equally needful and equally acceptable.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The list begins with ‘bracelets, and earrings, and rings, and tablets, all jewels of gold.’ And then it goes on to ‘blue, and purple, and scarlet, and fine linen, and red skins of rams, and badgers’ skins, and shittim wood.’ And then we read that the ‘women did spin with their hands, and brought that which they had spun’-namely, the same things as have been already catalogued, ‘the blue, and purple, and scarlet, and fine linen.’ That looks as if the richer gave the raw material, and the women gave the labour. Poor women! they could not give, but they could spin. They had no stores, but they had ten fingers and a distaff, and if some neighbour found the stuff, the ten fingers joyfully set the distaff twirling, and spun the yarn for the weavers. Then there were others who willingly undertook the rougher work of spinning, not dainty thread for the rich soft stuffs whose colours were to glow in the sanctuary, but the coarse black goat’s hair which was to be made into the heavy covering of the roof of the tabernacle. No doubt it was less pleasant labour than the other, but it got done by willing hands. And then, at the end of the whole enumeration, there comes, ‘And the rulers brought precious stones, and spices, and oil,’ and all the expensive things that were needed. The large subscriptions are at the bottom of the list, and the smaller ones are in the place of honour. All this just teaches us this-what a host of things of all degrees of preciousness in men’s eyes go to make God’s great building!",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So various were the requirements of the work on hand. Each man’s gift was needed, and each in its place was equally necessary. The jewels on the high-priest’s breastplate were no more nor less essential than the wood that made some peg for a curtain, or than the cheap goat’ s-hair yarn that was woven into the coarse cloth flung over the roof of the Tabernacle to keep the wet out. All had equal consecration, because all made one whole. All was equally precious, if all was given with the same spirit. So there is room for all sorts of work in Christ’s great house, where there are not only ‘vessels of gold and of silver, but also of wood and of earth,’ and all ‘unto honour . . .meet for the Master’s use.’ The smallest deed that co-operates to a great end is great. ‘The more feeble are necessary.’ Every one may find a corner where his special possession will work into the general design. If I have no jewels to give, I can perhaps find some shittim wood, or, if I cannot manage even that, I can at least spin some other person’s yarn, even though I have only a distaff, and not a loom to weave it in. Many of us can do work only when associated with others, and can render best service by helping some more highly endowed. But all are needed, and welcomed, and honoured, and rewarded. The owner of all the slaves sets one to be a water-carrier, and another to be his steward. It is of little consequence whether the servant be Paul or Timothy, the Apostle or the Apostle’s helper. ‘He worketh the work of the Lord, as I also do,’ said the former about the latter. All who are associated in the same service are on one level.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " I remember once being in the treasury of a royal palace. There was a long gallery in which the Crown valuables were stored. In one compartment there was a great display of emeralds, and diamonds, and rubies, and I know not what, that had been looted from some Indian rajah or other. And in the next case there lay a common quill pen, and beside it a little bit of discoloured coarse serge. The pen had signed some important treaty, and the serge was a fragment of a flag that had been borne triumphant from a field where a nation’s destinies had been sealed. The two together were worth a farthing at the outside, but they held their own among the jewels, because they spoke of brain-work and bloodshed in the service of the king. Many strangely conjoined things lie side by side in God’s jewel-cases. Things which people vulgarly call large and valuable, and what people still more vulgarly call small and worthless, have a way of getting together there. For in that place the arrangement is not according to what the thing would fetch if it were sold, but what was the thought in the mind and the emotion in the heart which gave it. Jewels and camel’s hair yarn and gold and silver are all massed together. Wood is wanted for the Temple quite as much as gold and silver and precious stones.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So, whatever we have, let us bring that; and whatever we are, let us bring that. If we be poor and our work small, and our natures limited, and our faculties confined, it does not matter. A man is accepted ‘according to that he hath, and not according to that he hath not.’ God does not ask how much we have given or done, if we have given or done what we could. But He does ask how much we have kept back, and takes strict account of the unsurrendered possessions, the unimproved opportunities, the unused powers. He gives much who gives all, though his all be little; he gives little who gives a part, though the part be much. The motive sanctifies the act, and the completeness of the consecration magnifies it. ‘Great’ and ‘small’ are not words for God’s Kingdom, in which the standard is not quantity but quality, and quality is settled by the purity of the love which prompts the deed, and the consequent thoroughness of self-surrender which it expresses. Whoever serves God with a whole heart will render to Him a whole strength, and will thus bring Him the gifts which He most desires.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Exodus 35:21-22",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 35:21-22",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Every one whom his spirit made willing — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "What they did they did cheerfully. They were willing; and it was not any external inducement that made them so, but their spirits. It was from a principle of love to God and his service; a desire of his presence with them by his ordinances, gratitude for the great things he had done for them, and faith in his promises of what he would do further.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "35:20-29 Without a willing mind, costly offerings would be abhorred; with it, the smallest will be accepted. Our hearts are willing, when we cheerfully assist in promoting the cause of God. Those who are diligent and contented in employments considered mean, are as much accepted of God as those engaged in splendid services. The women who spun the goats' hair were wise-hearted, because they did it heartily to the Lord. Thus the labourer, mechanic, or servant who attends to his work in the faith and fear of God, may be as wise, for his place, as the most useful minister, and he equally accepted of the Lord. Our wisdom and duty consist in giving God the glory and use of our talents, be they many or few.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The cloths of service to do service in the holy place - Rather; the garments of office to do service in the sanctuary, etc. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 31:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "21. they came, every one whose heart stirred him up—One powerful element doubtless of this extraordinary open-hearted liberality was the remembrance of their recent transgression, which made them \"zealous of good works\" (compare 2Co 7:11). But along with this motive, there were others of a higher and nobler kind—a principle of love to God and devotedness to His service, an anxious desire to secure the benefit of His presence, and gratitude for the tokens of His divine favor: it was under the combined influence of these considerations that the people were so willing and ready to pour their contributions into that exchequer of the sanctuary.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "every one whom his spirit made willing—Human nature is always the same, and it is implied that while an extraordinary spirit of pious liberality reigned in the bosoms of the people at large, there were exceptions—some who were too fond of the world, who loved their possessions more than their God, and who could not part with these; no, not for the service of the tabernacle.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Whose heart stirred him up",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", i.e. whose heart being desirous and ready to serve God, engaged his hand to offer what he had to his service. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And they came everyone whose heart stirred him up,.... Who felt an impulse upon his mind, a strong inclination in him: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and everyone whom his spirit made willing; or was endowed with a free and liberal spirit, and was heartily willing to bear a part, and cheerfully contribute to this service; otherwise the willing mind, as well as the ability, were given them of God; see 1 Chronicles 29:14, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and everyone whom his spirit made willing; or was endowed with a free and liberal spirit, and was heartily willing to bear a part, and cheerfully contribute to this service; otherwise the willing mind, as well as the ability, were given them of God; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 29:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and they brought the Lord's offering; an offering to him, and such as he directed and disposed them to bring, and which was for his worship and service, and the honour of his name, and was acceptable to him: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "to the work of the tabernacle of the congregation; for the making of that, the several parts of it, and all things in it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and for all his service; either the service of God, or of his tabernacle, which is the same: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and for the holy garments; that is, of Aaron and his sons. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and for the holy garments; that is, of Aaron and his sons. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And they came, every one whose heart stirred him up, and every one whom his spirit made willing, and they brought the LORD's offering to the work of the tabernacle of the congregation, and for all his service, and for the holy garments.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "stirred",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " … ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "up",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] lit. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "lifted up",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": so ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "v.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " 26, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 36:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "made willing",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] cf. on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 25:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "offering",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "contribution",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": see on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 25:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "all the service thereof",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] i.e., as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 30:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the daily worship, especially for the candlestick and the Altar of incense, the materials for which are mentioned in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "v.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " 28. ‘All’ must not be pressed; materials for the morning and evening daily burnt-offering, and for the Presence-bread (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 29:38",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff.; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 25:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), not being included in the sequel.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 21-29.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - THE ZEAL OF THE PEOPLE IN OFFERING. Moses dismissed the people; but they soon began to return, bringing their offerings with them. There was a general, if not a universal, willingness Men and women alike \"brought bracelets (brooches?), and earrings, and rings, and armlets - all articles of gold,\" and offered them to the Lord (ver. 22). Others brought blue and purple and scalier and fine linen, and goats' hair and rams' skins dyed red, and badger (or rather, seal) skins (ver. 23). Silver and bronze and shittimwood were contributed by others (ver. 24). The women, who were the only spinners, brought their spun yarn of blue and purple and scarlet and fine linen, and their yarn of goats' hair (vers. 25, 26); while the richest class of all - \"the rulers\" - gave, as their contribution, the onyx stones for the ephod, the jewels for the high-priest's breastplate, and the oil needed for the light, together with rare spices for the anointing ointment and the incense (vers. 27, 28). Subsequently, we are told that what was contributed was \"much more than enough\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 36:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and that the people had to be \"restrained from bringing\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "ibid.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " 6). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 21.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The Lord's offering",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"their offering to Jehovah.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "For all",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "his service",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The use of \"his\" for \"its\" causes an unfortunate ambiguity here. The antecedent to the pronoun is not the Lord, but the tabernacle. Exodus 35:21",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Preliminaries to the Work. - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 35:1-29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". After the restoration of the covenant, Moses announced to the people the divine commands with reference to the holy place of the tabernacle which was to be built. He repeated first of all (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 35:1-3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") the law of the Sabbath according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 31:13-17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and strengthened it by the announcement, that on the Sabbath no fire was to be kindled in their dwelling, because this rule was to be observed even in connection with the work to be done for the tabernacle. (For a fuller comment, see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 20:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".). Then, in accordance with the command of Jehovah, he first of all summoned the whole nation to present freewill-offerings for the holy things to be prepared (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 35:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 35:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), mentioning one by one all the materials that would be required (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 35:5-9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 25:3-7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); and after that he called upon those who were endowed with understanding to prepare the different articles, as prescribed in ch. 25-30, mentioning these also one by one (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 35:11-19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), even down to the pegs of the dwelling and court (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 27:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and \"their cords,\" i.e., the cords required to fasten the tent and the hangings round the court to the pegs that were driven into the ground, which had not been mentioned before, being altogether subordinate things. (On the \"cloths of service,\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 35:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 31:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 35:20-29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " we have an account of the fulfilment of this command. The people went from Moses, i.e., from the place where they were assembled round Moses, away to their tents, and willingly offered the things required as a heave-offering for Jehovah; every one \"whom his heart lifted up,\" i.e., who felt himself inclined and stirred up in his heart to do this. The men along with (על as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 32:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; see Ewald, 217) the women brought with a willing heart all kinds of golden rings and jewellery: chak, lit., hook, here a clasp or ring; nezem, an ear or nose-ring (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 35:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 24:47",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); tabbaath, a finger-ring; cumaz, globulus aureus, probably little golden balls strung together like beads, which were worn by the Israelites and Midianites (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 31:50",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") as an ornament round the wrist and neck, as Diod. Sic. relates that they were by the Arabians (3, 44). \"All kinds of golden jewellery, and every one who had waved (dedicated) a wave (offering) of gold to Jehovah,\" sc., offered it for the work of the tabernacle. The meaning is, that in addition to the many varieties of golden ornaments, which were willingly offered for the work to be performed, every one brought whatever gold he had set apart as a wave-offering (a sacrificial gift) for Jehovah. הניף to wave, lit., to swing or move to and fro, is used in connection with the sacrificial ritual to denote a peculiar ceremony, through which certain portions of a sacrifice, which were not intended for burning upon the altar, but for the maintenance of the priests (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 18:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), were consecrated to the Lord, or given up to Him in a symbolical manner (see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 7:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Tenuphah, the wave-offering, accordingly denoted primarily those portions of the sacrificial animal which were allotted to the priests as their share of the sacrifices; and then, in a more general sense, every gift or offering that was consecrated to the Lord for the establishment and maintenance of the sanctuary and its worship. In this wider sense the term tenuphah (wave-offering) is applied both here and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 38:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 38:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to the gold and copper presented by the congregation for the building of the tabernacle. So that it does not really differ from terumah, a lift of heave-offering, as every gift intended for the erection and maintenance of the sanctuary was called, inasmuch as the offerer lifted it off from his own property, to dedicate it to the Lord for the purposes of His worship. Accordingly, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 35:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the freewill-offerings of the people in silver and gold for the erection of the tabernacle are called terumah; and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 36:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", all the gifts of metal, wood, leather, and woven materials, presented by the people for the erection of the tabernacle, are called קדשׁ תּרוּמת. (On heaving and the heave-offering, see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 25:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 2:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) ",
        "children": []
      }
    ]
  }
]