[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Psalms",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "THE PSALMIST’S REMONSTRANCE WITH HIS SOULPsalm 43:5",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "THE PSALMIST’S REMONSTRANCE WITH HIS SOUL",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 43:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " This verse, which closes this psalm, occurs twice in the previous one. It is a kind of refrain. Obviously this little psalm, of which my text is a part, was originally united with the preceding one. That the two made one is clear to anybody that will read them, by reason of structure, and tone, and similarity of the singer’s situation, and the recurrence of many phrases, and especially of these significant words of my text.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The Psalmist is in circumstances of trouble and sorrow. We need not enter upon them particularly, but the thing that I desire to point out is that three times does the Psalmist take himself to task and question himself as to the reasonableness of the emotions that are surging in his soul, and checks these by higher considerations. Thrice he does it; twice in vain, for the trouble and anxiety come rolling back upon him in spite of the moment’s respite, but the third time he triumphs.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. We note, then, first, that moods and emotions should be examined and governed by a higher self. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. We note, then, first, that moods and emotions should be examined and governed by a higher self.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "In the Psalmist’s case, his gloom and despondency, which could plead good reasons for their existence, had everything their own way at first, and swept over his soul like the first rush of waters which have burst their bounds. But, presently, the ruling part of his nature wakes, and brings the feebler lower soul to its tribunal, and says, in effect, ‘Now! now that I am here, what hast thou to say about these sorrows that thou hast been complaining about? ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Why",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " art thou cast down, O my soul? Why art thou disquieted? . . . Hope in God!’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " I shall have a word or two to say presently about the details of this remonstrance, but the main point that I make, to begin with, is just this, that however strong and reasonably occasioned by circumstances a man’s emotions and feelings, either of the bright or the dark kind, may be, they are not to be indulged, unless they have passed muster and examination by that higher and better self. It is necessary to keep a very tight hand upon ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "all",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " our feelings, whether they be the natural desires of the sensuous part of our nature, or whether they be the sentiments of sadness, or doubt, or anxiety, or perplexity, which are the natural results of outward circumstances of trial; or whether, on the contrary, they be the bright and buoyant ones which come, like angels, along with prosperous hours. But that necessity, commonplace as it is of all morals and all religion, is yet a thing which, day by day, we so forget that we need to be ever and anon reminded of it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " There are hosts of people who, making profession of being Christians, do not habitually put the brake on their moods and tempers, and who seem to think that it is a sufficient vindication of gloom and sadness to say that things are going badly with them in the outer world, and who act as if they supposed that no joy can be too exuberant and no elation too lofty if, on the other hand, things are going rightly. It is a miserable travesty of the Christian faith to suppose that its prime purpose is anything else than to put into our hands the power of ruling ourselves because we let Christ rule us.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And so, dear brethren! though it be the A B C of Christian teaching, suffer this word of exhortation. It is only ‘milk for babes,’ but it is milk that the babes are very unwilling to take. Learn from this verse before us the solemn duty of rigid control, by the higher self, of the tremulous, emotional lower self which responds so completely to every change of temperature or circumstances in the world without. And remember that there should be a central heat which keeps the temperature substantially the same, whatever be the weather outside. As the wheel-house, and the steering gear, and the rudder of the ship proclaim their purpose of guidance and direction, so eloquently and unmistakably does the make of our inward selves tell us that emotions and moods and tempers are meant to be governed, often to be crushed, always to be moderated, by sovereign will and reason. In the Psalmist’s language, ‘My soul’ has to give account of its tremors and flutterings to ‘Me,’ the ruling Self, who should be Lord of temperament, and control the fluctuations of feeling.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. Note that there are two ways of looking at causes of dejection and disquiet. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. Note that there are two ways of looking at causes of dejection and disquiet.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The whole preceding parts of both the psalms, before this refrain, are an answer to the question which my text puts. ‘Why art thou cast down, O my soul?’ ‘My soul’ has been talking two whole psalms, to explain why it is cast down. And after all the eloquent torrent of words to vindicate and explain its reasons for sadness-separation from the sanctuary, bitter remembrances of bright days, which the poet tells us are ‘a sorrow’s crown of sorrow,’ taunts of enemies and the like-after all these have been said over and over again, the Psalmist says to himself: ‘Come now, let us hear it all once more. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Why",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " art thou cast down? Why art thou disquieted within me? Thou hast been telling the reasons abundantly. Speak them once again, and let us have a look at them.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " There is a court of appeal in each man, which tests and tries his reasons for his moods; and these, which look very sufficient to the flesh, turn out to be very insufficient when investigated and tested by the higher spirit or self. We should ‘appeal from Philip drunk to Philip sober.’ And if a man will be honest with himself, and tell himself why he is in such a pucker of terror, or why he is in such a rapture of joy, nine times out of ten the attempt to tell the reasons will be the condemnation of the mood which they are supposed to justify. If men would only bring the causes or occasions of the tempers and feelings which they allow to direct them, to the bar of common sense, to say nothing of religious faith, half the furious boilings in their hearts would stop their ebullition. It would be like pouring cold water into a kettle on the fire. It would end its bubbling. Everything has two handles. The aspect of any event depends largely on the beholder’s point of view. ‘There’s nothing either good or bad, but thinking makes it so.’ ‘Why art thou cast down, O my soul? and why art thou disquieted within me?’ The answer is often very hard to give; the question is always very salutary to ask.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. Note that no reasons for being cast down are so strong as those for elation and calm hope. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. Note that no reasons for being cast down are so strong as those for elation and calm hope.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘Hope thou in God, for I shall yet praise Him, who is the health of my countenance and my God.’ I need not deal here with the fact that the first of the three occurrences of this refrain is, in our Bible, a little different from the other two. That is probably a mistake in the text. In all three cases the words ought to stand the same.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Try to realise what God is to yourselves-’My God’ and ‘the health of my countenance.’ That will stimulate sluggish feeling; that will calm disturbed emotion. He that can say ‘My God!’ and in that possession can repose, will not be easily moved, by the trivialities and transitorinesses of this life, to excessive disquiet, whether of the exuberant or of the woful sort. There is a wonderful calming power in realising our possession of God as our portion-not stagnating, but quieting. I am quite sure that the troubles of our lives, and the gladnesses of our lives, which often distract, would be far less operative in disturbing, if we felt more that God was ours and that we were God’s.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Brethren! ‘there is no joy but calm.’ To be at rest is better than rapture. And there is no way of getting and keeping a fixed temper of still tranquillity unless we go into that deep and hidden chamber, in the secret place of the Most High, where we cannot ‘hear the loud winds when they call,’ but dwell in security, whatever storms harass the land. ‘Why art thou cast down,’ or lifted ‘up,’ and, in either case, ‘disquieted’? ‘Hope in God,’ and be at rest.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "IV. Note that the effort to lay hold on the truth which calms is to be repeated in spite of failures. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "IV. Note that the effort to lay hold on the truth which calms is to be repeated in spite of failures.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The words of our text are thrice repeated in these two psalms. In the two former instances they are followed by a fresh burst of pained feeling. A moment of tranquillity interrupts the agitation of the Psalmist’s soul, but is soon followed by the recurrence of ‘the horrible storm’ that ‘begins afresh.’ A tiny island of blue appears in his sky, and then the pale, ugly, grey rack drives across it once more. But the guiding self keeps the hand firm on the tiller, notwithstanding the wash of the water and the rolling of the ship, and the dominant will conquers at last, and at the third time the yielding soul obeys and is quiet, because the Psalmist’s will resolved that it should be quiet, and it hopes in God because He, by a dead lift of effort, lifts it up to hope.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " No effort at tranquillising our hearts is wholly lost; and no attempt to lay hold upon God is wholly in vain. Men build a dam to keep out the sea, and the winter storms make a breach in it, but it is not washed away altogether, and next season they will not need to begin to build from quite so low down; but there will be a bit of the former left, to put the new structure upon, and so by degrees it will rise above the tide, and at last will keep it out.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Did you ever see a child upon a swing, or a gymnast upon a trapeze? Each oscillation goes a little higher; each starts from the same lowest point, but the elevation on either side increases with each renewed effort, until at last the destined height is reached and the daring athlete leaps on to a solid platform. So we may, if I might say so, by degrees, by reiterated efforts, swing ourselves up to that steadfast floor on which we may stand high above all that breeds agitation and gloom. It is possible, in the midst of change and circumstances that excite sad emotions, anxieties, and fears-it is possible to have this calmness of hope in God. The rainbow that spans the cataract rises steadfast above the white, tortured water beneath, and persists whilst all is hurrying change below, and there are flowers on the grim black rocks by the side of the fall, whose verdure is made greener and whose brightness is made brighter, by the freshening of the spray of the waterfall. So we may be ‘as sorrowful, yet always rejoicing,’ and may bid dejected and disquieted souls to hope in God and be still.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "43:6-11 The way to forget our miseries, is to remember the God of our mercies. David saw troubles coming from God's wrath, and that discouraged him. But if one trouble follow hard after another, if all seem to combine for our ruin, let us remember they are all appointed and overruled by the Lord. David regards the Divine favour as the fountain of all the good he looked for. In the Saviour's name let us hope and pray. One word from him will calm every storm, and turn midnight darkness into the light of noon, the bitterest complaints into joyful praises. Our believing expectation of mercy must quicken our prayers for it. At length, is faith came off conqueror, by encouraging him to trust in the name of the Lord, and to stay himself upon his God. He adds, And my God; this thought enabled him to triumph over all his griefs and fears. Let us never think that the God of our life, and the Rock of our salvation, has forgotten us, if we have made his mercy, truth, and power, our refuge. Thus the psalmist strove against his despondency: at last his faith and hope obtained the victory. Let us learn to check all unbelieving doubts and fears. Apply the promise first to ourselves, and then plead it to God.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Why art thou cast down?... - See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 42:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", note; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 42:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", note. The sameness of this verse with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 42:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 42:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " proves, as has been already remarked, that this psalm was composed by the same writer, and with reference to the same subject as the former. The doctrine which is taught is the same - that we should not be dejected or cast down in the troubles of life, but should hope in God, and look forward to better times, if not in this world, certainly in the world to come. If we are his children, we shall \"yet praise him;\" we shall acknowledge him as the \"health\" or the salvation (Hebrew) of our countenance; as one who by giving \"salvation\" diffuses joy over our countenance; as one who will manifest himself as our God. He who has an eternity of blessedness before him - he who is to dwell forever in a world of peace and joy - he who is soon to enter an abode where there will be no sin, no sadness, no tears, no death - he who is to commence a career of glory which is never to terminate and never to change - should not be cast down - should not be overwhelmed with sorrow. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "4. the altar—as the chief place of worship. The mention of the harp suggests the prominence of praise in his offering.   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No notes from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Why art thou cast down, O my soul?.... See Gill on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 42:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and See Gill on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 42:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Why art thou cast down, O my soul? and why art thou disquieted within me? {e} hope in God: for I shall yet praise him, who is the health of my countenance, and my God.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Why art thou cast down, O my soul? and why art thou disquieted within me? ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{e}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " hope in God: for I shall yet praise him, ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "who is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the health of my countenance, and my God.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) By which he admonishes the faithful not to relent but constantly to wait on the Lord, though their troubles are long and great.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The refrain is once more repeated, and now, we may believe, with a still more unwavering faith and certain hope that his prayer will be answered.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 5.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Why art thou cast down, O my soul? and why art thou disquieted within me? hope in God: for I shall yet praise him, who is",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "the health of my countenance, and my God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The refrain of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 42:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is here repeated ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "totidem verbis",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and the plaint of the exiled monarch is brought to an end. The burden of the refrain is hope and confidence. Notwithstanding the woes of the present, the writer has no doubt in respect of the future; he will yet have occasion to \"praise\" God, whom he feels to be \"",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "his",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " God  - his Health and Salvation. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Psalm 43:5",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The poet, in anticipation, revels in the thought of that which he has prayed for, and calls upon his timorous soul to hope confidently for it. The cohortatives in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 43:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " are, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 39:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and frequently, an apodosis to the petition. The poet knows no joy like that which proceeds from God, and the joy which proceeds from Him he accounts as the very highest; hence he calls God אל שׂמחת גּילי, and therefore he knows no higher aim for his longing than again to be where the fountainhead of this exultant joy is (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 9:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and where it flows forth in streams (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 36:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Removed back thither, he will give thanks to Him with the cithern (Beth instrum.). He calls Him אלהים אלהי, an expression which, in the Elohim-Psalms, is equivalent to יהוה אלהי in the Jahve-Psalms. The hope expressed in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 43:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " casts its rays into the prayer in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 43:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 43:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the spirit having taken courage in God, holds this picture drawn by hope before the distressed soul, that she may therewith comfort herself. Instead of wthmy, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 42:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the expression here used, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 42:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is וּמה־תּהמי. Variations like these are not opposed to a unity of authorship. ",
        "children": []
      }
    ]
  }
]