[{"num":31,"verse":"4 Saul killeth himself. 6 His children are slain in the battle. 12 The men of Jabesh took down his body, which was hanged on the wall."},{"num":1,"verse":"Now the Philistines fought against Israel, and the men of Israel fled away from the Philistines, and they fell down wounded in mount Gilboa."},{"num":2,"verse":"And the Philistines pressed sore upon Saul and his sons, and slew Jonathan, and Abinadab, and Malchishua Saul’s sons."},{"num":3,"verse":"And when the battle went sore against Saul, the archers and bowmen hit him, and he was sore wounded of the archers."},{"num":4,"verse":"Then said Saul unto his armor bearer, Draw out thy sword, and thrust me through therewith, lest the uncircumcised come and thrust me through and mock me: but his armor bearer would not, for he was sore afraid. Therefore Saul took a sword and fell upon it."},{"num":5,"verse":"And when his armor bearer saw that Saul was dead, he fell likewise upon his sword, and died with him."},{"num":6,"verse":"So Saul died, and his three sons, and his armor bearer, and all his men that same day together."},{"num":7,"verse":"¶ And when the men of Israel that were on the other side of the valley, and they of the other side Jordan saw that the men of Israel were put to flight, and that Saul and his sons were dead, then they left the cities, and ran away: and the Philistines came and dwelt in them."},{"num":8,"verse":"¶ And on the morrow when the Philistines were come to spoil them that were slain, they found Saul and his three sons lying in mount Gilboa,"},{"num":9,"verse":"And they cut off his head, and stripped him out of his armor, and sent into the land of the Philistines on every side, that they should publish it in the temple of their idols, and among the people."},{"num":10,"verse":"And they laid up his armor in the house of Ashtoreth, but they hanged up his body on the wall of Beth Shan."},{"num":11,"verse":"¶ When the inhabitants of Jabesh Gilead heard what the Philistines had done to Saul,"},{"num":12,"verse":"Then they arose (as many as were strong men) and went all night, and took the body of Saul, and the bodies of his sons, from the wall of Beth Shan, and came to Jabesh, and burnt them there,"},{"num":13,"verse":"And took their bones and buried them under a tree at Jabesh, and fasted seven days."}]