[{"num":3,"verse":"Christian brothers, I could not speak to you as to full-grown Christians. I spoke to you as men who have not obeyed the things you have been taught. I spoke to you as if you were baby Christians. "},{"num":2,"verse":"My teaching was as if I were giving you milk to drink. I could not give you meat because you were not ready for it. Even yet you are not able to have anything but milk. "},{"num":3,"verse":"You still live as men who are not Christians. When you are jealous and fight with each other, you are still living in sin and acting like sinful men in the world. "},{"num":4,"verse":"When one says, “I am a follower of Paul,” and another says, “I am a follower of Apollos,” does not this sound like the talk of baby Christians? "},{"num":5,"verse":"Who is Apollos? Who is Paul? We are only servants owned by God. He gave us gifts to preach His Word. And because of that, you put your trust in Christ. "},{"num":6,"verse":"I planted the seed. Apollos watered it, but it was God Who kept it growing. "},{"num":7,"verse":"This shows that the one who plants or the one who waters is not the important one. God is the important One. He makes it grow. "},{"num":8,"verse":"The one who plants and the one who waters are alike. Each one will receive his own reward. "},{"num":9,"verse":"For we work together with God. You are God’s field."},{"num":10,"verse":"Through God’s loving-favor to me, I laid the stones on which the building was to be built. I did it like one who knew what he was doing. Now another person is building on it. Each person who builds must be careful how he builds on it. "},{"num":11,"verse":"Jesus Christ is the Stone on which other stones for the building must be laid. It can be only Christ. "},{"num":12,"verse":"Now if a man builds on the Stone with gold or silver or beautiful stones, or if he builds with wood or grass or straw, "},{"num":13,"verse":"each man’s work will become known. There will be a day when it will be tested by fire. The fire will show what kind of work it is. "},{"num":14,"verse":"If a man builds on work that lasts, he will receive his reward. "},{"num":15,"verse":"If his work is burned up, he will lose it. Yet he himself will be saved as if he were going through a fire."},{"num":16,"verse":"Do you not know that you are a house of God and that the Holy Spirit lives in you? "},{"num":17,"verse":"If any man destroys the house of God, God will destroy him. God’s house is holy. You are the place where He lives."},{"num":18,"verse":"Do not fool yourself. If anyone thinks he knows a lot about the things of this world, he had better become a fool. Then he may become wise. "},{"num":19,"verse":"The wisdom of this world is foolish to God. The Holy Writings say, “He is the One Who gets them in a trap when they use their own wisdom.”  "},{"num":20,"verse":"They also say, “The Lord knows how the wise man thinks. His thinking is worth nothing.”  "},{"num":21,"verse":"As a Christian, do not be proud of men and of what they can do. All things belong to you. "},{"num":22,"verse":"Paul and Apollos and Peter belong to you. The world and life and death belong to you. Things now and things to come belong to you. "},{"num":23,"verse":"You belong to Christ, and Christ belongs to God."}]