[{"num":3,"verse":"And I could not speak to you brethren as to spiritual people, but as to carnal; even, as it were, to babes in Christ. "},{"num":2,"verse":"I gave you milk to drink, and not meat. For you were not strong then, no, neither are you yet. "},{"num":3,"verse":"For you are yet carnal. For as long as there is among you envying, strife, and dissension, are you not carnal, and walking after the manner of men? "},{"num":4,"verse":"As long as one says, I hold to Paul, and another, I’m for Apollos, are you not carnal? "},{"num":5,"verse":"What is Paul? What is Apollos? Only ministers they are, by whom you believed, even as the Lord gave grace to each one. "},{"num":6,"verse":"I have planted, Apollos watered, but God gave the increase. "},{"num":7,"verse":"So then, neither is he who plants anything, nor he who waters, but God who gives the increase. "},{"num":8,"verse":"He who plants and he who waters are neither better than the other. Each will receive his reward according to his labours."},{"num":9,"verse":"We are God’s labourers. You are God’s husbandry, you are God’s building. "},{"num":10,"verse":"By the grace of God given to me, as a wise builder I have laid the foundation, and another built on it. But let everyone take heed how he builds upon it. "},{"num":11,"verse":"For no other foundation can anyone lay than that which is laid, which is Jesus Christ. "},{"num":12,"verse":"And whether anyone builds on this foundation gold, silver, precious stones, wood, hay, or stubble, "},{"num":13,"verse":"his work will be seen for what it is. For the day will reveal it, and it will be shown in fire. And the fire shall try every person’s work, what it is. "},{"num":14,"verse":"If what someone has built remains, he will receive a reward. "},{"num":15,"verse":"If anyone’s work burns, he will suffer loss; but he will be saved himself, nevertheless yet as it were through fire."},{"num":16,"verse":"Are you not aware that you are the temple of God, and that the Spirit of God dwells in you? "},{"num":17,"verse":"If anyone defiles the temple of God, God will destroy him. For the temple of God is holy, which temple you are. "},{"num":18,"verse":"Let no one deceive himself."},{"num":19,"verse":"For the wisdom of this world is foolishness with God. For it is written: He compasses the wise in their craftiness. "},{"num":20,"verse":"And again: God knows the thoughts of the wise, that they are vain."},{"num":21,"verse":"Therefore let no one glory in men. For all things are yours – "},{"num":22,"verse":"whether it be Paul or Apollos or Cephas, whether it be the world or life or death, whether they be things present or things to come. All are yours, "},{"num":23,"verse":"and you are Christ’s, and Christ is God’s."}]