[{"header":"A Call to Spiritual Maturity"},{"num":3,"verse":"Brothers and sisters, when I was with you I found it impossible to speak to you as those who are spiritually mature people, for you are still dominated by the mind-set of the flesh. And because you are immature infants in Christ, "},{"num":2,"verse":"I had to nurse you and feed you with “milk,” not with the solid food of more advanced teachings, because you weren’t ready for it. In fact, you are still not ready to be fed solid food, "},{"num":3,"verse":"for you are living your lives dominated by the mind-set of the flesh. Ask yourselves: Is there jealousy among you? Do you compare yourselves with others? Do you quarrel like children and end up taking sides? If so, this proves that you are living your lives centered on yourselves, dominated by the mind-set of the flesh, and behaving like unbelievers. "},{"num":4,"verse":"For when you divide yourselves up in groups—a “Paul group” and an “Apollos group”—you’re acting like people without the Spirit’s influence."},{"num":5,"verse":"Who is Apollos, really? Or who is Paul? Aren’t we both just servants through whom you believed our message? Aren’t each of us doing the ministry the Lord has assigned to us? "},{"num":6,"verse":"I planted the church, and Apollos came and cared for it, but it was God who caused it to grow. "},{"num":7,"verse":"This means the one who plants is not anybody special, nor the one who waters, for God is the one who brings the supernatural growth."},{"num":8,"verse":"Now, the one who plants and the one who waters are equally important and on the same team, but each will be rewarded for his own work. "},{"num":9,"verse":"We are coworkers with God and you are God’s cultivated garden, the house he is building. "},{"num":10,"verse":"God has given me unique gifts as a skilled master builder who lays a good foundation. Afterward another craftsman comes and builds on it. So builders beware! Let every builder do his work carefully, according to God’s standards. "},{"num":11,"verse":"For no one is empowered to lay an alternative foundation other than the good foundation that exists, which is Jesus Christ!"},{"num":12,"verse":"The quality of materials used by anyone building on this foundation will soon be made apparent, whether it has been built with gold, silver, and costly stones, or wood, hay, and straw. Their work will soon become evident, for the Day will make it clear, because it will be revealed by blazing fire! And the fire will test and prove the workmanship of each builder. "},{"num":14,"verse":"If his work stands the test of fire, he will be rewarded. "},{"num":15,"verse":"If his work is consumed by the fire, he will suffer great loss. Yet he himself will barely escape destruction, like one being rescued out of a burning house."},{"header":"The Church, God’s Inner Sanctuary"},{"num":16,"verse":"Don’t you realize that together you have become God’s inner sanctuary and that the Spirit of God makes his permanent home in you? "},{"num":17,"verse":"Now, if someone desecrates God’s inner sanctuary, God will desecrate him, for God’s inner sanctuary is holy, and that is exactly who you are."},{"header":"True Wisdom"},{"num":18,"verse":"So why fool yourself and live under an illusion? Make no mistake about it, if anyone thinks he is wise by the world’s standards, he will be made wiser by being a fool for God! "},{"num":19,"verse":"For what the world says is wisdom is actually foolishness in God’s eyes. As it is written:"},{"num":20,"verse":"And again:"},{"num":21,"verse":"So don’t be proud of your allegiance to any human leader. For actually, you already have everything! It has all been given for your benefit, "},{"num":22,"verse":"whether it is Paul or Apollos or Peter the Rock, or whether it’s the world or life or death, or whether it’s the present or the future—everything belongs to you! "},{"num":23,"verse":"And now you are joined to the Messiah, who is joined to God."}]