[{"num":3,"verse":"My brothers, I could not talk to you at first as to people who have the Spirit of God. But I talked to you as people who have the spirit of this world. I talked to you as people who are very new-born, baby Christians."},{"num":2,"verse":"I gave you milk to drink, not food to eat. You were not ready for food. And even now you are not ready for it."},{"num":3,"verse":"You still have the spirit of this world in you. You are jealous of each other and you are quarrelling. The spirit of this world is still in you and you live like people of this world."},{"num":4,"verse":"One says, `I belong to Paul.' Another says, `I belong to Apollos.' Does not that show that you have the spirit of this world?"},{"num":5,"verse":"After all, who is Apollos? And who is Paul? We both work for God. You believed because of the work we did. The Lord gave each of us our work to do."},{"num":6,"verse":"I planted the seed. Apollos put water on the seed. But God made the seed grow."},{"num":7,"verse":"So then the man who plants is nothing and the man who waters is nothing. God alone makes the seed grow."},{"num":8,"verse":"The man who plants and the man who waters are equal. Each one will be paid for his own work."},{"num":9,"verse":"We work together for God. You are God's farm. You are God's house."},{"num":10,"verse":"I built the lower walls of the house because God showed me the best way to do it. Now another man builds on top of this foundation. Each man must take care how he builds on it."},{"num":11,"verse":"Jesus Christ himself is the foundation. No one can make another one."},{"num":12,"verse":"People build with gold, silver, very fine stones, wood, grass, or straw on top of the foundation."},{"num":13,"verse":"But the day will come when everyone's work can be seen. Their work will be tested by fire and the fire will show what kind of work each one did."},{"num":14,"verse":"If the work a man did is not burned up in the fire, he will be paid for his work."},{"num":15,"verse":"But if a man's work is burned up, he will lose everything. He himself will be saved, like a man pulled out of the fire."},{"num":16,"verse":"You know that you are God's house. The spirit of God lives in you."},{"num":17,"verse":"God will punish anyone who spoils his house. His house is holy, and you are the house."},{"num":18,"verse":"Do not be fooled. If any one of you thinks that he is wise in the things of this world, he should count himself as not being wise. Then he would really be wise."},{"num":19,"verse":"The things that look wise to the people of this world look foolish to God. The holy writings say, `He catches the wise people in their own tricks.'"},{"num":20,"verse":"It also says, `The Lord knows that the wise men's thoughts are good for nothing.'"},{"num":21,"verse":"So do not be proud of men. Everything belongs to you."},{"num":22,"verse":"Paul, Apollos, Peter, the world, life, death, the things which are now, and the things which are to come, everything is yours!"},{"num":23,"verse":"And you belong to Christ and Christ belongs to God!"}]