[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Job 8:13",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 8:13",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "So are the paths of all that forget God ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Of wicked men, who are often described by this character; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 9:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 50:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; or, of hypocrites, as the next words explain it, whose first and fundamental error is, that they ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "forget, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "that is, neglect, forsake, and despise God, his presence, commands, worship, and providence; and, therefore, break out into manifold sins. But, by their ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "paths, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "he does not intend their manner of living, but the events which befall them, God’s manner of dealing with them. Now this may be accommodated to the foregoing similitude in this manner, namely, Such is the prosperity of wicked men; because it wants the solid foundation of piety, and of God’s promise and blessing consequent thereupon, it quickly vanishes into nothing. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The hypocrite’s hope shall perish — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That is, the object of his hope, his riches, his friends, his honours, and other such like things, on which he founded his expectations; for, when these are lost, hope may be said to perish, because that from which it arose is no more.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8:8-19 Bildad discourses well of hypocrites and evil-doers, and the fatal end of all their hopes and joys. He proves this truth of the destruction of the hopes and joys of hypocrites, by an appeal to former times. Bildad refers to the testimony of the ancients. Those teach best that utter words out of their heart, that speak from an experience of spiritual and divine things. A rush growing in fenny ground, looking very green, but withering in dry weather, represents the hypocrite's profession, which is maintained only in times of prosperity. The spider's web, spun with great skill, but easily swept away, represents a man's pretensions to religion when without the grace of God in his heart. A formal professor flatters himself in his own eyes, doubts not of his salvation, is secure, and cheats the world with his vain confidences. The flourishing of the tree, planted in the garden, striking root to the rock, yet after a time cut down and thrown aside, represents wicked men, when most firmly established, suddenly thrown down and forgotten. This doctrine of the vanity of a hypocrite's confidence, or the prosperity of a wicked man, is sound; but it was not applicable to the case of Job, if confined to the present world.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "So are the paths of all that forget God - This is clearly a part of the quotation from the sayings of the ancients. The word \"paths\" here means ways, acts, doings. They who forget God are like the paper-reed. They seem to flourish, but they have nothing that is firm and substantial. As the paper-reed soon dies, as the flag withers away before any other herb, so it will be with the wicked, though apparently prosperous.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And the hypocrite's hope shall perish - This important sentiment, it seems, was known in the earliest periods of the world; and if the supposition above be correct, that this is a fragment of a poem which had come down from far distant times, it was probably known before the flood. The passage requires no particular philological explanation, but it is exceedingly important. We may remark on it,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) That there were hypocrites even in that early age of the world. They are confined to no period, or country, or religious denomination, or profession. There are hypocrites in religion - and so there are in politics, and in business, and in friendship, and in morals. There arc pretended friends, and pretended patriots, and pretended lovers of virtue, whose hearts are false and hol ow, just as there are pretended friends of religion. Wherever there is genuine coin, it will be likely to be counterfeited; and the fact of a counterfeit is always a tribute to the intrinsic worth of the coin - for who would be at the pains to counterfeit that which is worthless? The fact that there are hypocrites in the church, is an involuntary tribute to the excellency of religion.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(2) The hypocrite has a hope of eternal life. This hope is founded on various things. It may be on his own morality; it may be on the expectation that he will be able to practice a deception; it may be on some wholly false and unfounded view of the character and plans of God. Or taking the word \"hypocrite\" in a larger sense to denote anyone who pretends to religion and who has none, this hope may be founded on some change of feeling which he has had, and which he mistook for religion; on some supposed vision which he had of the cross or of the Redeemer, or on the mere subsiding of the alarm which an awakened sinner experiences, and the comparative peace consequent on that. The mere cessation of fear produces a kind of peace - as the ocean is calm and beautiful after a storm - no matter what may be the cause, whether it be true religion or any other cause. Many a sinner, who has lost his convictions for sin in any way, mistakes the temporary calm which succeeds for true religion, and embraces the hope of the hypocrite.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(3) That hope will perish. This may occur in various ways.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) It may die away insensibly, and leave the man to be a mere professor of religion - a formalist, without comfort, usefulness, or peace.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) It may be taken away in some calamity by which God tries the soul, and where the man will see that he has no religion to sustain him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) It may occur under the preaching of the gospel, when the hypocrite may be convinced that he is destitute of vital piety, and has no true love to God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(d) It may be on a bed of death - when God comes to take away the soul, and when the judgment-seat appears in view.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) Or it will be at the bar of God. Then the hope of the hypocrite will certainly be destroyed. Then it will be seen that he had no true religion, and then he will be consigned to the awful doom of him who in the most solemn circumstances lived to deceive, and who assumed the appearance of that which he had the strongest reason to believe he never possessed. Oh! how important it is for every professor of religion to examine himself, that he may know what is the foundation of his hope of heaven! ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(e) Or it will be at the bar of God. Then the hope of the hypocrite will certainly be destroyed. Then it will be seen that he had no true religion, and then he will be consigned to the awful doom of him who in the most solemn circumstances lived to deceive, and who assumed the appearance of that which he had the strongest reason to believe he never possessed. Oh! how important it is for every professor of religion to examine himself, that he may know what is the foundation of his hope of heaven! ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13. paths—so \"ways\" (Pr 1:19).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "all that forget God—the distinguishing trait of the godless (Ps 9:17; 50:22).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Of all that forget God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. of wicked men, who are branded with this same character, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 9:17 50:22",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 9:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 50:22",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; or hypocrites, as the next words explain it, who are described by their first and fundamental miscarriage, which is, that they ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "forget",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", i.e. neglect, forsake, and despise, (for so this phrase is commonly understood, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Deu 6:12 8:11 32:18 Jeremiah 2:32 23:27",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deu 6:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 8:11 32:18 ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 2:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 23:27",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", i.e. his presence, and commands, and worship, and providence; and therefore break forth into manifold sins. But by their paths he doth not understand the course of their actions, or manner of their living; but the events which befall them, called their paths objectively, because they are the paths of God, or the methods of his providence, or manner of his dealing with them. Now this may be accommodated to the foregoing similitude in this manner: Such is the prosperity of wicked men, because it wants the solid foundation of their piety, and of God’s promise and blessing consequent thereupon, it quickly vanisheth into nothing. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The hypocrite’s hope shall perish, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. he shall lose what he hoped for (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "hope",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " being oft put for its object,) even uninterrupted and abiding felicity, and with it all hope of restitution. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "So are the paths of all that forget God,.... Who forget that there is a God; he is not in all, and scarce in any of their thoughts, and they live without him in the world; who forget the works of God, of creation and providence, in which there is a glorious display of his being and perfections; who forget the benefits and blessings of his goodness they are every day partakers of, and are not thankful for them; and who forget the word, worship, and ordinances of God, and follow after and observe lying vanities, idols, and the works of men's hands, and worship them, being unmindful of the rock of their salvation: now such men, as well as the hypocrites in the next clause, are like bulrushes and flags, or sedge, being unfruitful, useless, and unprofitable; and, for their sensuality and worldly mindedness, standing in the mire and clay of an unregenerate state, and of carnal and worldly lusts; and though, especially the latter, may carry their heads high in a profession of religion, and make a fair show in the flesh while it is a time of outward prosperity with them, but when tribulation arises on the account of religion, they are presently offended, and apostatize; being destitute of the true grace of God, and having the root of the matter in them, they wither of themselves; they soon drop their profession in the view of all good men, comparable to herbs and green grass, which abide in their verdure, when the other are gone and are seen no more: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the hypocrite's hope shall perish; who are either the same with those before described, who, being in prosperous circumstances, forget the God of their mercies they make a profession of, like Jeshurun of old, or different persons, as Bar Tzemach thinks, the former designing open profane sinners, these secret ones, under the appearance of good men: an \"hypocrite\" is one whose inside is not as his outside, as the Jews say; who is outwardly righteous, but inwardly wicked; has a form of godliness, but not the power of it; a name to live, but dead; that makes a show of religion and devotion, attending the worship and ordinances of God in an external way, as if he had great delight in him and them, when his heart is removed far from him: and such have their \"hope\", for the present, of being in the favour of God, and of future happiness, which is founded on their outward prosperity their esteem among men, and more especially their external righteousness, and profession of religion; but this will \"perish\", even both the ground of their hope, the riches and righteousness, which come to nothing, and the hope that is built thereupon sinks into despair; if not in life, as it sometimes does, yet always at death, see Job 11:20; Bildad seems to have Job in view here, whom he esteemed an hypocrite. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and the hypocrite's hope shall perish; who are either the same with those before described, who, being in prosperous circumstances, forget the God of their mercies they make a profession of, like Jeshurun of old, or different persons, as Bar Tzemach thinks, the former designing open profane sinners, these secret ones, under the appearance of good men: an \"hypocrite\" is one whose inside is not as his outside, as the Jews say; who is outwardly righteous, but inwardly wicked; has a form of godliness, but not the power of it; a name to live, but dead; that makes a show of religion and devotion, attending the worship and ordinances of God in an external way, as if he had great delight in him and them, when his heart is removed far from him: and such have their \"hope\", for the present, of being in the favour of God, and of future happiness, which is founded on their outward prosperity their esteem among men, and more especially their external righteousness, and profession of religion; but this will \"perish\", even both the ground of their hope, the riches and righteousness, which come to nothing, and the hope that is built thereupon sinks into despair; if not in life, as it sometimes does, yet always at death, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 11:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; Bildad seems to have Job in view here, whom he esteemed an hypocrite. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "So are the paths of all that forget God; and the hypocrite's hope shall perish:",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Application of the simile. When men forget God, and His sustaining grace is withdrawn from them, they sink down suddenly and perish like the luxuriant water-reed.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the hypocrite",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] This word is difficult to translate, it means rather ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "godless",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "profane",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 23:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; hypocrisy in the ordinary sense is not at all the idea of the term. The verb is rendered in the English Version mostly “defile” or “pollute,” but “profane” would suit most of the passages.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 13.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "So are the paths of all that forget God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". So, that is, do those proceed on their way by whom God has been forgotten,  They spring up in apparent strength and lusty force; they flourish for a brief space; then, untouched by man's hand, they suddenly fade, fall, and disappear, before the mass of their contemporaries. Job is, of course, glanced at in the expression, \"all that forget God,\" though it is the last thing that he had done. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And the hypocrite's hope shall perish",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; or, the hope ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "of the ungodly man shall perish",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 13:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 15:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 17:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where the LXX. translates by ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἀσεβὴς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "παράνομος",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Job 8:13",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11  Doth papyrus grow up without mire?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Doth the reed shoot up without water?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "12  It is still in luxuriant verdure, when it is not cut off,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Then before all other grass it with",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "13  So is the way of all forgetters of God,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And the hope of the ungodly perisheth,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "14  Because his hope is cut off,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And his trust is a spider's house:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "15  He leaneth upon his house and it standeth not,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "He holdeth fast to it and it endureth not.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Bildad likens the deceitful ground on which the prosperity of the godless stands to the dry ground on which, only for a time, the papyrus or reed finds water, and grows up rapidly: shooting up quickly, it withers as quickly; as the papyrus plant, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Vid., Champollion-Figeac, Aegypten, German translation, pp. 47f.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "if it has no perpetual water, though the finest of grasses, withers off when most luxuriantly green, before it attains maturity. גּמא, which, excepting here, is found only in connection with Egypt (Exodus 2:3; Isaiah 18:2; and Isaiah 35:7, with the general קנה as specific name for reed), is the proper papyrus plant (Cypeerus papyyrus, L.): this name for it is suitably derived in the Hebrew from גּמא, to suck up (comp. Lucan, iv. 136: conseritur bibul Memphytis cymba papyro); but is at the same time Egyptian, since Coptic kam, cham, signifies the reed, and 'gôm, 'gōme, a book (like liber, from the bark of a tree).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "if it has no perpetual water, though the finest of grasses, withers off when most luxuriantly green, before it attains maturity. גּמא, which, excepting here, is found only in connection with Egypt (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 2:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 18:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 35:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", with the general קנה as specific name for reed), is the proper papyrus plant (Cypeerus papyyrus, L.): this name for it is suitably derived in the Hebrew from גּמא, to suck up (comp. Lucan, iv. 136: conseritur bibul Memphytis cymba papyro); but is at the same time Egyptian, since Coptic kam, cham, signifies the reed, and 'gôm, 'gōme, a book (like liber, from the bark of a tree).",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Comp. the Book of the Dead (Todtenbuch), ch. 162: \"Chapter on the creation of warmth at the back of the head of the deceased. Words over a young cow finished in pure gold. Put them on the neck of the dead, and paint them also on a new papyrus,\" etc. Papyrus is here cama: the word is determined by papyrus-roll, fastening and writing, and its first consonant corresponds to the Coptic aspirated g. Moreover, we cannot omit to mention that this cama  equals  gôme also signifies a garment, as in a prayer: \"O my mother Isis, come and veil me in thy cama.\" Perhaps both ideas are represented in volumen, involucrum; it is, however, also possible that goome is to be etymologically separated from kam, cham  equals  גמא.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...",
        "children": []
      }
    ]
  }
]