[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Job 8:19",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 8:19",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Behold, this is the joy of his way — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Or, rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "This is the way of his joy: ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "it all ends in this: this is the issue of his flourishing state. He falls into heavy calamities, from which he can never deliver himself again. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And out of the earth shall others grow — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Out of the same earth or place shall other trees arise. Heath reads the verse, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Behold him now; destruction is his path; and strangers out of the dust shall spring up in his room. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "In other words, The wicked come speedily to an end, and strangers with whom they had no affinity come in to possess what they had gathered up, in expectation of making their name and family endure a long time.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8:8-19 Bildad discourses well of hypocrites and evil-doers, and the fatal end of all their hopes and joys. He proves this truth of the destruction of the hopes and joys of hypocrites, by an appeal to former times. Bildad refers to the testimony of the ancients. Those teach best that utter words out of their heart, that speak from an experience of spiritual and divine things. A rush growing in fenny ground, looking very green, but withering in dry weather, represents the hypocrite's profession, which is maintained only in times of prosperity. The spider's web, spun with great skill, but easily swept away, represents a man's pretensions to religion when without the grace of God in his heart. A formal professor flatters himself in his own eyes, doubts not of his salvation, is secure, and cheats the world with his vain confidences. The flourishing of the tree, planted in the garden, striking root to the rock, yet after a time cut down and thrown aside, represents wicked men, when most firmly established, suddenly thrown down and forgotten. This doctrine of the vanity of a hypocrite's confidence, or the prosperity of a wicked man, is sound; but it was not applicable to the case of Job, if confined to the present world.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Behold, this is the joy of his way - This is evidently sarcastic. \"Lo! such is the joy of his course! He boasts of joy, as all hypocrites do, but his joy endures only for a little time. This is the end of it. He is cut down and removed, and the earth and the heavens disown him!\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And out of the earth shall others grow - This image is still derived from the tree or plant. The meaning is, that such a plant would be taken away, and that others would spring up in its place which the earth would not be ashamed of. So the hypocrite is removed to make way for others who will be sincere, and who will be useful. Hypocrites and useless people in the church are removed to make way for others who will be active and devoted to the cause of the Redeemer. A similar sentiment occurs in Job 27:16-17. This closes, as I suppose, the quotation which Bildad makes from the poets of the former age, and in the remainder of the chapter he states another truth pertaining to the righteous. This fragment is one of the most interesting that can be found any where. As a relic of the earliest times it is exceedingly valuable; as an illustration of the argument in hand; and of the course of events in this world, it is eminently beautiful. It is as true now as it was when uttered before the flood, and may be used now as describing the doom of the hypocrite, with as much propriety as then, and it may be regarded as one of the way-marks in human affairs, showing that the government of God, and the manner of his dispensations, are always substantially the same. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And out of the earth shall others grow - This image is still derived from the tree or plant. The meaning is, that such a plant would be taken away, and that others would spring up in its place which the earth would not be ashamed of. So the hypocrite is removed to make way for others who will be sincere, and who will be useful. Hypocrites and useless people in the church are removed to make way for others who will be active and devoted to the cause of the Redeemer. A similar sentiment occurs in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 27:16-17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". This closes, as I suppose, the quotation which Bildad makes from the poets of the former age, and in the remainder of the chapter he states another truth pertaining to the righteous. This fragment is one of the most interesting that can be found any where. As a relic of the earliest times it is exceedingly valuable; as an illustration of the argument in hand; and of the course of events in this world, it is eminently beautiful. It is as true now as it was when uttered before the flood, and may be used now as describing the doom of the hypocrite, with as much propriety as then, and it may be regarded as one of the way-marks in human affairs, showing that the government of God, and the manner of his dispensations, are always substantially the same. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "19. Bitter irony. The hypocrite boasts of joy. This then is his \"joy\" at the last.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and out of the earth—others immediately, who take the place of the man thus punished; not godly men (Mt 3:9). For the place of the weeds is among stones, where the gardener wishes no plants. But, ungodly; a fresh crop of weeds always springs up in the place of those torn up: there is no end of hypocrites on earth [Umbreit].",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " This is the joyful and happy issue of the flourishing course, state, and condition (which is frequently called a way) of this tree, or of the hypocrite, manifestly represented by it, and expressed ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Job 8:13",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 8:13",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". It is a sarcasm or irony, and is to be understood contrariwise of his sad and unhappy end. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Out of the earth shall others grow, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. out of the same earth or place shall another tree grow; which could not be if there had been but a stump of it left, though under ground. So it notes the total extirpation of the tree, and of the hypocrite, that his person and all his children and family shall be utterly extinct, and so a stranger shall come into his place, and enjoy the fruit of his labours. But the words are and may be otherwise rendered very agreeably to the Hebrew text, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and out of other ground they",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (i.e. plants or trees, of which he is here speaking) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall grow",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or others ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall grow",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "plants shall grow",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; the noun being contained in the verb. So the sense is, This tree shall be rooted up, and the very ground of it so cursed, that nothing shall grow or thrive in it; but other ground shall be fruitful, and other trees that stood round about it shall stand still and flourish in their places. His design in all this is to prove Job to be a hypocrite, because he meets with their lot, which is total destruction. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Behold, this is the joy of his way,.... Of the state and condition of the hypocrite, who, while he is in outward prosperity, exults and rejoices, but his joy is but short, it is but for a moment, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 20:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and this is what it comes to at last, and issues in, even entire destruction from his place; which, because it may seem strange and wonderful, and is worthy of notice and consideration, as well as to express a certainty of it, the word \"behold\" is prefixed; though this also is understood, by some, of good men who have much spiritual joy in their present state and condition, be it what it will; they have joy and peace in believing, even joy unspeakable, and full of glory; they have joy in the Lord, and in his ways in which they walk, when they have trouble in the world; they rejoice and even glory in tribulation, and are cheerful be they where they will, though removed from their native place and country; and especially this will be their case when they are transplanted from earth to heaven, the better and heavenly country: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and out of the earth shall others grow; in their room and stead; where the tall flourishing tree once stood, but now utterly destroyed, other trees should grow; signifying, either the children of the hypocrites and wicked men, that should spring up in their place and imitate them, and come to the same end; or rather such as were strangers to them, that should inherit their substance and estates; and it may be good men that should succeed them, and come into the possession of all their wealth, even such as were before in mean circumstances, and so may be said to come \"out of the earth\": it may be rendered, \"out of another dust\" or \"earth shall they grow\" (q); signifying, that the wicked should be utterly destroyed, they and theirs; and that such as were of another family, and as it were of another earth and country, should stand in their place; see Job 27:16; this may be interpreted of good men, who, though they die, others are raised up in their stead; God will have a seed to serve him as long as the sun and moon endure; though they are forced to fly from their native place, being persecuted, to strange cities, or removed into the heavenly regions, yet God raises up others to till up their places, and oftentimes out of other families, even of the ungodly, to support his cause and interest; and understanding the whole of truly righteous persons seems best to connect the sense with the following words. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and out of the earth shall others grow; in their room and stead; where the tall flourishing tree once stood, but now utterly destroyed, other trees should grow; signifying, either the children of the hypocrites and wicked men, that should spring up in their place and imitate them, and come to the same end; or rather such as were strangers to them, that should inherit their substance and estates; and it may be good men that should succeed them, and come into the possession of all their wealth, even such as were before in mean circumstances, and so may be said to come \"out of the earth\": it may be rendered, \"out of another dust\" or \"earth shall they grow\" (q); signifying, that the wicked should be utterly destroyed, they and theirs; and that such as were of another family, and as it were of another earth and country, should stand in their place; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 27:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; this may be interpreted of good men, who, though they die, others are raised up in their stead; God will have a seed to serve him as long as the sun and moon endure; though they are forced to fly from their native place, being persecuted, to strange cities, or removed into the heavenly regions, yet God raises up others to till up their places, and oftentimes out of other families, even of the ungodly, to support his cause and interest; and understanding the whole of truly righteous persons seems best to connect the sense with the following words. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(q)  \"de pulvere alio\", Montanus, Bolducius, Cocceius; so the Targum; \"de terra alia\", Pagninus, Mercerus. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(q)  \"de pulvere alio\", Montanus, Bolducius, Cocceius; so the Targum; \"de terra alia\", Pagninus, Mercerus. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Behold, this is the joy {l} of his way, and out of the earth shall others grow.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Behold, this ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the joy ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{l}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " of his way, and out of the earth shall others grow.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(l) To be planted in another place, where it may grow as it pleases.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "joy of his way",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "way",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " may be “fate,” as often, and the words would be ironical; or “way” may be “course of life”—so ends what was to him the joy of his course of life.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall others grow",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "do others grow",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Who the others are or what quality they are of is not the point, which is that his place is occupied by others as if he had never been. He leaves no trace, no blank, and no memory.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 19.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Behold, this is the joy of his way",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Bitterly ironical - This is what his rapid and rampant greenery comes to; this is how his triumphant career ends! Utter destruction, disappearance, obliteration! And out of the earth shall others grow. The destruction leaves room for something better to follow - a sounder, healthier, and less short-lived growth. Job 8:19",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "16  He dwells with sap in the sunshine,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And his branch spreads itself over his garden.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "17  His roots intertwine over heaps of stone,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "He looks upon a house of stones.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "18  If He casts him away from his place,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "It shall deny him: I have not seen thee.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "19  Behold, thus endeth his blissful course,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And others spring forth from the dust.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The subject throughout is not the creeping-plant directly, but the ungodly, who is likened to it. Accordingly the expression of the thought is in part figurative and in part literal, יחזה אבנים בּית (Job 8:17). As the creeper has stones before it, and by its interwindings, as it were, so rules them that it may call them its own (v. Gerlach: the exuberant growth twines itself about the walls, and looks proudly down upon the stony structure); so the ungodly regards his fortune as a solid structure, which he has quickly caused to spring up, and which seems to him imperishable. Ewald translates: he separates one stone from another; בּית, according to 217, g, he considers equivalent to בּינת, and signifies apart from one another; but although חזה  equals  חזז, according to its radical idea, may signify to split, pierce through, still בּית, when used as a preposition, can signify nothing else but, within. Others, e.g., Rosenmller, translate: he marks a place of stones, i.e., meets with a layer of stones, against which he strikes himself; for this also בּית will not do. He who casts away (Job 8:18) is not the house of stone, but God. He who has been hitherto prosperous, becomes now as strange to the place in which he flourished so luxuriantly, as if it had never seen him. Behold, that is the delight of his way (course of life), i.e., so fashioned, so perishable is it, so it ends. From the ground above which he sprouts forth, others grow up whose fate, when they have no better ground of confidence than he, is the same. After he has placed before Job both the blessed gain of him who trusts, and the sudden destruction of him who forgets, God, as the result of the whole, Bildad recapitulates: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The subject throughout is not the creeping-plant directly, but the ungodly, who is likened to it. Accordingly the expression of the thought is in part figurative and in part literal, יחזה אבנים בּית (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 8:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). As the creeper has stones before it, and by its interwindings, as it were, so rules them that it may call them its own (v. Gerlach: the exuberant growth twines itself about the walls, and looks proudly down upon the stony structure); so the ungodly regards his fortune as a solid structure, which he has quickly caused to spring up, and which seems to him imperishable. Ewald translates: he separates one stone from another; בּית, according to 217, g, he considers equivalent to בּינת, and signifies apart from one another; but although חזה  equals  חזז, according to its radical idea, may signify to split, pierce through, still בּית, when used as a preposition, can signify nothing else but, within. Others, e.g., Rosenmller, translate: he marks a place of stones, i.e., meets with a layer of stones, against which he strikes himself; for this also בּית will not do. He who casts away (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 8:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") is not the house of stone, but God. He who has been hitherto prosperous, becomes now as strange to the place in which he flourished so luxuriantly, as if it had never seen him. Behold, that is the delight of his way (course of life), i.e., so fashioned, so perishable is it, so it ends. From the ground above which he sprouts forth, others grow up whose fate, when they have no better ground of confidence than he, is the same. After he has placed before Job both the blessed gain of him who trusts, and the sudden destruction of him who forgets, God, as the result of the whole, Bildad recapitulates: ",
            "children": []
          }
        ]
      }
    ]
  }
]