[{"header":"Hannah Asks the Lord for a Child"},{"num":1,"verse":"Elkanah lived in Ramah, a town in the hill country of Ephraim. His great-great-grandfather was Zuph, so Elkanah was a member of the Zuph clan of the Ephraim tribe. Elkanah’s father was Jeroham, his grandfather was Elihu, and his great-grandfather was Tohu."},{"num":2,"verse":"Elkanah had two wives, Hannah and Peninnah. Although Peninnah had children, Hannah did not have any."},{"num":3,"verse":"Once a year Elkanah traveled from his hometown to Shiloh, where he worshiped the Lord All-Powerful and offered sacrifices. Eli was the Lord’s priest there, and his two sons Hophni and Phinehas served with him as priests."},{"num":4,"verse":"Whenever Elkanah offered a sacrifice, he gave some of the meat to Peninnah and some to each of her sons and daughters. "},{"num":5,"verse":"But he gave Hannah even more, because he loved Hannah very much, even though the Lord had kept her from having children of her own."},{"num":6,"verse":"Peninnah liked to make Hannah feel miserable about not having any children, "},{"num":7,"verse":"especially when the family went to the house of the Lord each year."},{"num":8,"verse":"So Elkanah asked, “Hannah, why are you crying? Why won’t you eat? Why do you feel so bad? Don’t I mean more to you than ten sons?”"},{"num":9,"verse":"When the sacrifice had been offered, and they had eaten the meal, Hannah got up and went to pray. Eli was sitting in his chair near the door to the place of worship. "},{"num":10,"verse":"Hannah was brokenhearted and was crying as she prayed, "},{"num":11,"verse":"“Lord All-Powerful, I am your servant, but I am so miserable! Please let me have a son. I will give him to you for as long as he lives, and his hair will never be cut.”"},{"num":12,"verse":"Hannah prayed silently to the Lord for a long time. But her lips were moving, and Eli thought she was drunk. "},{"num":14,"verse":"“How long are you going to stay drunk?” he asked. “Sober up!”"},{"num":15,"verse":"“Sir, please don’t think I’m no good!” Hannah answered. “I’m not drunk, and I haven’t been drinking. But I do feel miserable and terribly upset. I’ve been praying all this time, telling the Lord about my problems.”"},{"num":17,"verse":"Eli replied, “You may go home now and stop worrying. I’m sure the God of Israel will answer your prayer.”"},{"num":18,"verse":"“Sir, thank you for being so kind to me,” Hannah said. Then she left, and after eating something, she felt much better."},{"header":"Samuel Is Born"},{"num":19,"verse":"Elkanah and his family got up early the next morning and worshiped the Lord. Then they went back home to Ramah. Later the Lord blessed Elkanah and Hannah "},{"num":20,"verse":"with a son. She named him Samuel because she had asked the Lord for him."},{"header":"Hannah Gives Samuel to the Lord"},{"num":21,"verse":"The next time Elkanah and his family went to offer their yearly sacrifice, he took along a gift that he had promised to give to the Lord. "},{"num":22,"verse":"But Hannah stayed home, because she had told Elkanah, “Samuel and I won’t go until he’s old enough for me to stop nursing him. Then I’ll give him to the Lord, and he can stay there at Shiloh for the rest of his life.”"},{"num":23,"verse":"“You know what’s best,” Elkanah said. “Stay here until it’s time to stop nursing him. I’m sure the Lord will help you do what you have promised.” Hannah did not go to Shiloh until she stopped nursing Samuel."},{"num":24,"verse":"When it was the time of year to go to Shiloh again, Hannah and Elkanah took Samuel to the Lord’s house. They brought along a three-year-old bull, a twenty-pound sack of flour, and a clay jar full of wine. Hannah and Elkanah offered the bull as a sacrifice, then brought the little boy to Eli."},{"num":26,"verse":"“Sir,” Hannah said, “a few years ago I stood here beside you and asked the Lord "},{"num":27,"verse":"to give me a child. Here he is! The Lord gave me just what I asked for. "},{"num":28,"verse":"Now I am giving him to the Lord, and he will be the Lord’s servant for as long as he lives.”"},{"header":"Hannah Prays"}]