[{"header":"Chapter 1[b]"},{"num":1,"verse":"Elkanah’s Pilgrimage to Shiloh. There was a certain man from Ramathaim-zophim, from the hill country of Ephraim, whose name was Elkanah, the son of Jeroham, the son of Elihu, the son of Tohu, the son of Zuph, an Ephraimite."},{"num":2,"verse":"He had two wives. The name of one of them was Hannah, and the name of the other was Peninnah. Peninnah had children, but Hannah did not have any children."},{"num":3,"verse":"This man would travel from his city yearly to worship and to sacrifice to the Lord of hosts in Shiloh. The two sons of Eli, Hophni and Phinehas, were priests there."},{"num":4,"verse":"When Elkanah performed his sacrifice, he would give a portion of it to Peninnah his wife and a portion each to all of her sons and daughters,"},{"num":5,"verse":"but he would give a double portion to Hannah, for he loved her although the Lord had left her barren."},{"num":6,"verse":"Her rival provoked her and made her miserable because the Lord had left her barren."},{"num":7,"verse":"This went on year after year. Whenever she went up to the house of the Lord, she provoked her. This made her weep, and she refused to eat."},{"num":8,"verse":"Elkanah, her husband, said to her, “Hannah, why do you weep? Why are you not eating? Why are you so downhearted? Am I not worth more than ten sons to you?”"},{"num":9,"verse":"Hannah’s Prayer. Once, when they had finished eating and drinking in Shiloh, Hannah stood up. Now Eli the priest was sitting upon a chair by the doorpost of the temple of the Lord."},{"num":10,"verse":"She was greatly distressed and she prayed to the Lord, weeping bitterly."},{"num":11,"verse":"She made a vow saying, “O Lord of hosts, if you will regard the troubles of your handmaid and will remember me, and not forget your handmaid, and you will give your handmaid a son, then I will dedicate him to the Lord for his entire life, and no razor will ever touch his head.”"},{"num":12,"verse":"As she continued to pray to the Lord, Eli watched her mouth."},{"num":13,"verse":"Hannah was praying in her heart so that only her lips were moving, her voice could not be heard. Eli, therefore, thought that she was drunk."},{"num":14,"verse":"He said to her, “How long are you going to stay drunk? Get rid of your wine!”"},{"num":15,"verse":"Hannah answered, “Oh no, my lord! I am a woman who is deeply troubled. I have not been drinking either wine or liquor. I have been pouring out my soul to the Lord."},{"num":16,"verse":"Do not account your handmaid to be a daughter of Belial. I have been speaking out of the abundance of my difficulties and my grief.”"},{"num":17,"verse":"Then Eli answered, “Go in peace. The God of Israel grant the request you have made of him.”"},{"num":18,"verse":"She said, “Let your handmaid find favor in your sight.” The woman then went her way and ate, and she was not downcast anymore."},{"num":19,"verse":"They arose early the next morning and worshiped before the Lord. They then went their way and came to their home in Ramah. Elkanah slept with Hannah, and the Lord remembered her."},{"num":20,"verse":"The Birth of Samuel. In time it came to pass that Hannah conceived and bore a son whom she named Samuel, saying, “For I have asked the Lord for him.”"},{"num":21,"verse":"When Elkanah and his household went up to offer the annual sacrifice to the Lord and to fulfill his vow,"},{"num":22,"verse":"Hannah did not go. She said to her husband, “After the boy is weaned, I will take him and present him before the Lord, and he will dwell there forever.”"},{"num":23,"verse":"Elkanah, her husband, said to her, “Do what you think is best. Stay here until you have weaned him, only may the Lord bring his word to fulfillment.” So the woman stayed there and nursed her son until she weaned him."},{"num":24,"verse":"Samuel’s Consecration. When she had weaned him, she took him with herself along with a three-year-old bull, an ephah of flour, and a skin of wine. She brought him to the house of the Lord in Shiloh, although the child was still young."},{"num":25,"verse":"After they sacrificed the bull, they brought the child to Eli."},{"num":26,"verse":"She said, “Oh my lord, as my soul lives, I am the woman who stood beside you praying to the Lord."},{"num":27,"verse":"I prayed for this child, and the Lord has granted the request that I made of him."},{"num":28,"verse":"Therefore, I have dedicated him to the Lord. As long as he lives, he shall be dedicated to the Lord.” So they worshiped the Lord there."}]