[{"num":8,"verse":"God remembered Noach, every living thing and all the livestock with him in the ark; so God caused a wind to pass over the earth, and the water began to go down. "},{"num":2,"verse":"Also the fountains of the deep and the windows of the sky were stopped, the rain from the sky was restrained, "},{"num":3,"verse":"and the water came back from completely covering the earth. It was after 150 days that the water went down. "},{"num":4,"verse":"On the seventeenth day of the seventh month the ark came to rest on the mountains of Ararat. "},{"num":5,"verse":"The water kept going down until the tenth month; on the first day of the tenth month the tops of the mountains were seen."},{"num":6,"verse":"After forty days Noach opened the window of the ark which he had built; "},{"num":7,"verse":"and he sent out a raven, which flew back and forth until the water had dried up from the earth. "},{"num":8,"verse":"Then he sent out a dove, to see if the water had gone from the surface of the ground. "},{"num":9,"verse":"But the dove found no place for her feet to rest, so she returned to him in the ark, because the water still covered the whole earth. He put out his hand, took her and brought her in to him in the ark. "},{"num":10,"verse":"He waited another seven days and again sent the dove out from the ark. "},{"num":11,"verse":"The dove came in to him in the evening, and there in her mouth was a freshly plucked olive leaf, so Noach knew that the water had cleared from the earth. "},{"num":12,"verse":"He waited yet another seven days and sent out the dove, and she didn’t return to him any more."},{"num":13,"verse":"By the first day of the first month of the 601st year the water had dried up from off the earth; so Noach removed the covering of the ark and looked; and, yes, the surface of the ground was dry. "},{"num":14,"verse":"It was on the twenty-seventh day of the second month that the earth was dry."},{"num":15,"verse":"(iv) God said to Noach, "},{"num":16,"verse":"“Go out from the ark, you, your wife, your sons and your son’s wives with you. "},{"num":17,"verse":"Bring out with you every living thing you have with you — birds, livestock and every animal that creeps on the earth — so that they can swarm on the earth, be fruitful and multiply on the earth.” "},{"num":18,"verse":"So Noach went out with his sons, his wife and his sons’ wives; "},{"num":19,"verse":"every animal, every creeping thing and every bird, whatever moves on the earth, according to their families, went out of the ark."},{"num":20,"verse":"Noach built an altar to Adonai. Then he took from every clean animal and every clean bird, and he offered burnt offerings on the altar. "},{"num":21,"verse":"Adonai smelled the sweet aroma, and Adonai said in his heart, “I will never again curse the ground because of humankind, since the imaginings of a person’s heart are evil from his youth; nor will I ever again destroy all living things, as I have done. "},{"num":22,"verse":"So long as the earth exists, sowing time and harvest, cold and heat, summer and winter, and day and night will not cease.”"}]