[[],[{"type":"header","content":"The Flood Recedes"},{"type":"prose","content":"But God remembered Noah and all the wild animals and livestock with him in the boat. He sent a wind to blow across the earth, and the floodwaters began to recede."}],[{"type":"prose","content":"The underground waters stopped flowing, and the torrential rains from the sky were stopped."}],[{"type":"prose","content":"So the floodwaters gradually receded from the earth. After 150 days,"}],[{"type":"prose","content":"exactly five months from the time the flood began, the boat came to rest on the mountains of Ararat."}],[{"type":"prose","content":"Two and a half months later, as the waters continued to go down, other mountain peaks became visible."}],[{"type":"prose","content":"After another forty days, Noah opened the window he had made in the boat"}],[{"type":"prose","content":"and released a raven. The bird flew back and forth until the floodwaters on the earth had dried up."}],[{"type":"prose","content":"He also released a dove to see if the water had receded and it could find dry ground."}],[{"type":"prose","content":"But the dove could find no place to land because the water still covered the ground. So it returned to the boat, and Noah held out his hand and drew the dove back inside."}],[{"type":"prose","content":"After waiting another seven days, Noah released the dove again."}],[{"type":"prose","content":"This time the dove returned to him in the evening with a fresh olive leaf in its beak. Then Noah knew that the floodwaters were almost gone."}],[{"type":"prose","content":"He waited another seven days and then released the dove again. This time it did not come back."}],[{"type":"prose","content":"Noah was now 601 years old. On the first day of the new year, ten and a half months after the flood began, the floodwaters had almost dried up from the earth. Noah lifted back the covering of the boat and saw that the surface of the ground was drying."}],[{"type":"prose","content":"Two more months went by, and at last the earth was dry!"}],[{"type":"prose","content":"Then God said to Noah,"}],[{"type":"prose","content":"“Leave the boat, all of you—you and your wife, and your sons and their wives."}],[{"type":"prose","content":"Release all the animals—the birds, the livestock, and the small animals that scurry along the ground—so they can be fruitful and multiply throughout the earth.”"}],[{"type":"prose","content":"So Noah, his wife, and his sons and their wives left the boat."}],[{"type":"prose","content":"And all of the large and small animals and birds came out of the boat, pair by pair."}],[{"type":"prose","content":"Then Noah built an altar to the , and there he sacrificed as burnt offerings the animals and birds that had been approved for that purpose."}],[{"type":"prose","content":"And the  was pleased with the aroma of the sacrifice and said to himself, “I will never again curse the ground because of the human race, even though everything they think or imagine is bent toward evil from childhood. I will never again destroy all living things."}],[{"type":"prose","content":"As long as the earth remains, there will be planting and harvest, cold and heat, summer and winter, day and night.”"}]]