[{"num":1,"verse":"At about this time Jeroboam’s son Abijah came down sick. Jeroboam said to his wife, “Do something. Disguise yourself so no one will know you are the queen and go to Shiloh. Ahijah the prophet lives there, the same Ahijah who told me I’d be king over this people. Take along ten loaves of bread, some sweet rolls, and a jug of honey. Make a visit to him and he’ll tell you what’s going on with our boy.”"},{"num":4,"verse":"Jeroboam’s wife did as she was told; she went straight to Shiloh and to Ahijah’s house. Ahijah was an old man at this time, and blind, but God had warned Ahijah, “Jeroboam’s wife is on her way to consult with you regarding her sick son; tell her this and this and this.”"},{"num":5,"verse":"When she came in she was disguised. Ahijah heard her come through the door and said, “Welcome, wife of Jeroboam! But why the deception? I’ve got bad news for you. Go and deliver this message I received firsthand from God, the God of Israel, to Jeroboam: I raised you up from obscurity and made you the leader of my people Israel. I ripped the kingdom from the hands of David’s family and gave it to you, but you weren’t at all like my servant David who did what I told him and lived from his undivided heart, pleasing me. Instead you’ve set a new record in works of evil by making alien gods—tin gods! Pushing me aside and turning your back—you’ve made me mighty angry."},{"num":10,"verse":"“And I’ll not put up with it: I’m bringing doom on the household of Jeroboam, killing the lot of them right down to the last male wretch in Israel, whether slave or free. They’ve become nothing but garbage and I’m getting rid of them. The ones who die in the city will be eaten by stray dogs; the ones who die out in the country will be eaten by carrion crows. God’s decree!"},{"num":12,"verse":"“And that’s it. Go on home—the minute you step foot in town, the boy will die. Everyone will come to his burial, mourning his death. He is the only one in Jeroboam’s family who will get a decent burial; he’s the only one for whom God, the God of Israel, has a good word to say."},{"num":14,"verse":"“Then God will appoint a king over Israel who will wipe out Jeroboam’s family, wipe them right off the map—doomsday for Jeroboam! He will hit Israel hard, as a storm slaps reeds about; he’ll pull them up by the roots from this good land of their inheritance, weeding them out, and then scatter them to the four winds. And why? Because they made God so angry with Asherah sex-and-religion shrines. He’ll wash his hands of Israel because of Jeroboam’s sins, which have led Israel into a life of sin.”"},{"num":17,"verse":"Jeroboam’s wife left and went home to Tirzah. The moment she stepped through the door, the boy died. They buried him and everyone mourned his death, just as God had said through his servant the prophet Ahijah."},{"num":19,"verse":"The rest of Jeroboam’s life, the wars he fought and the way he ruled, is written in The Chronicles of the Kings of Israel. He ruled for twenty-two years. He died and was buried with his ancestors. Nadab his son was king after him."},{"num":21,"verse":"Rehoboam son of Solomon was king in Judah. He was forty-one years old when he took the throne and was king for seventeen years in Jerusalem, the city God selected from all the tribes of Israel for the worship of his Name. Rehoboam’s mother was Naamah, an Ammonite. Judah was openly wicked before God, making him very angry. They set new records in sin, surpassing anything their ancestors had done. They built Asherah sex-and-religion shrines and set up sacred stones all over the place—on hills, under trees, wherever you looked. Worse, they had male sacred prostitutes, polluting the country outrageously—all the stuff that God had gotten rid of when he brought Israel into the land."},{"num":25,"verse":"In the fifth year of King Rehoboam’s rule, Shishak king of Egypt made war against Jerusalem. He plundered The Temple of God and the royal palace of their treasures, cleaned them out—even the gold shields that Solomon had made. King Rehoboam replaced them with bronze shields and outfitted the royal palace guards with them. Whenever the king went to God’s Temple, the guards carried the shields but always returned them to the guardroom."},{"num":29,"verse":"The rest of Rehoboam’s life, what he said and did, is all written in The Chronicles of the Kings of Judah. There was war between Rehoboam and Jeroboam the whole time. Rehoboam died and was buried with his ancestors in the City of David. His mother was Naamah, an Ammonite. His son Abijah ruled after him."}]