[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(27, 28) In these verses is recorded the adoption of the fatal policy which has caused Jeroboam to be handed down in the sacred record as “the son of Nebat, who made Israel to sin.” Hitherto his new royalty had been inaugurated under a Divine sanction, both as receiving distinct promise of permanence and blessing (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Kings 11:37-38",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and as protected by open prophetic interference, at the critical moment when its ill-consolidated force might have been crushed. Nor is it unlikely that it may have been supported by a wholesome reaction against the idolatry, as well as against the despotism, of Solomon. Now, unsatisfied with these securities of his kingdom, and desirous to strengthen it by a bold stroke of policy, he takes the step which mars the bright promise of his accession. Yet the policy was exceedingly natural. In Israel, beyond all other nations, civil and religious allegiance were indissolubly united; it was almost impossible to see how separate national existence could have been sustained without the creation, or (as it might seem) the revival, of local sanctuaries to rival the sacredness of Jerusalem. Nor was the breach of Divine law apparently a serious one. The worship at Dan and Bethel was not the bloody and sensual worship of false gods, but the worship of the Lord Jehovah under the form of a visible emblem, meant to be a substitute for the ark and the overshadowing cherubim. It might have been plausibly urged that, to wean Israel from all temptation to the abominations which Solomon had introduced, it was necessary to give their faith the visible support of these great local sanctuaries, and the lesser “high places” which would naturally follow. But the occasion was the critical moment of choice between a worldly policy—“doing evil that good might come”—and the higher and more arduous path of simple faith in God’s promise, and obedience to the command designed to protect the purity and spirituality of His worship. The step, once taken, was never retraced. Eminently successful in its immediate object of making the separation irreparable, it purchased success at the price, first, of destruction of all religious unity in Israel, and next, of a natural corruption, opening the door at once to idolatry, and hereafter to the grosser apostasy, against which it professed to guard. It needed the faith of David—as shown, for example, in the patient acquiescence in the prohibition of the erection of a Temple to be the spiritual glory of his kingdom—to secure the promise of “a sure house, as for David.” That promise was now forfeited for ever.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1 Kings 12:27",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 12:27",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "If this people go up to do sacrifice at Jerusalem, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — All the people of Israel being bound, at the three great feasts, to go up to Jerusalem; and on other solemn occasions devout persons being used to go thither to offer gifts and sacrifices; he was afraid lest, if they should continue to go, they should be so taken with the magnificence of the temple and the royal city, and should so recall to mind the famous acts of David and Solomon who were buried there, as, by degrees, to be alienated from him, and brought back to their former allegiance to the family of David. And he the rather feared this, because their going to Jerusalem, and attending divine worship there, would have afforded to Rehoboam many occasions of showing them kindness and winning their affections; and to the priests and Levites, the sure and faithful friends of David’s house, many opportunities of soliciting them to unite themselves again to Judah, which tribe must have appeared to them to have the better cause, because it had the temple in possession in which God dwelt. But whatever reasons there might have been for his conjectures and apprehensions, and whatever prudence and policy may appear in his contrivance, considering the providence of God, by which the hearts of all men, and the affairs of all kingdoms are governed, and of which he had lately seen so eminent an instance, the course he took was foolish as well as wicked.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12:25-33 Jeroboam distrusted the providence of God; he would contrive ways and means, and sinful ones too, for his own safety. A practical disbelief of God's all-sufficiency is at the bottom of all our departures from him. Though it is probable he meant his worship for Jehovah the God of Israel, it was contrary to the Divine law, and dishonourable to the Divine majesty to be thus represented. The people might be less shocked at worshipping the God of Israel under an image, than if they had at once been asked to worship Baal; but it made way for that idolatry. Blessed Lord, give us grace to reverence thy temple, thine ordinances, thine house of prayer, thy sabbaths, and never more, like Jeroboam, to set up in our hearts any idol of abomination. Be thou to us every thing precious; do thou reign and rule in our hearts, the hope of glory.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Kill me - In case his subjects desired a reconciliation with Rehoboam, Jeroboam's death would at once facilitate the re-establishment of a single kingdom, and obtain favor with the legitimate monarch. (Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 4:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "26-32. Jeroboam said in his heart, Now shall the kingdom return to the house of David—Having received the kingdom from God, he should have relied on the divine protection. But he did not. With a view to withdraw the people from the temple and destroy the sacred associations connected with Jerusalem, he made serious and unwarranted innovations on the religious observances of the country, on pretext of saving the people the trouble and expense of a distant journey. First, he erected two golden calves—the young bulls, Apis and Mnevis, as symbols (in the Egyptian fashion) of the true God, and the nearest, according to his fancy, to the figures of the cherubim. The one was placed at Dan, in the northern part of his kingdom; the other at Beth-el, the southern extremity, in sight of Jerusalem, and in which place he probably thought God was as likely to manifest Himself as at Jerusalem (Ge 32:1-32; 2Ki 2:2). The latter place was the most frequented—for the words (1Ki 12:30) should be rendered, \"the people even to Dan went to worship before the one\" (Jer 48:13; Am 4:4, 5; 5:5; Ho 5:8; 10:8). The innovation was a sin because it was setting up the worship of God by symbols and images and departing from the place where He had chosen to put His name. Secondly, he changed the feast of tabernacles from the fifteenth of the seventh to the fifteenth of the eighth month. The ostensible reason might be, that the ingathering or harvest was later in the northern parts of the kingdom; but the real reason was to eradicate the old association with this, the most welcome and joyous festival of the year.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " This in itself might seem a prudent conjecture; for this would give Rehoboam, and the priests and Levites, the sure and faithful friends of David’s house, many opportunities of alienating their minds from him, and of reducing them to their former allegiance. But considering God’s providence, by which the hearts of all men, and the affairs of all kings and kingdoms, are governed, and of which he had lately seen so eminent an instance, it was a foolish as well as wicked course. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "If this people go up to do sacrifice in the house of the Lord at Jerusalem,.... In the temple there, three times in the year, which all the males were obliged to, besides other times, when they had occasion to offer sacrifice, which they might do nowhere else: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "then shall the heart of this people turn again unto their Lord, even unto Rehoboam king of Judah; being drawn by the magnificence of the temple, the beauty and order of worship in it, the holiness of the place, and the grandeur of the royal court, and the persuasions of the priests and prophets of the Lord, both to keep to the service of the Lord, and to obey their lawful sovereign; and besides, they might be in fear they should be taken up and punished as traitors, and therefore would choose to submit to Rehoboam, that they might have the liberty of sacrificing without fear; Jeroboam seems conscious himself that Rehoboam was their liege lord and lawful king: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and they shall kill me, and go again to Rehoboam king of Judah; his fears ran so high, that he should not only lose his kingdom, but his life, unless some step was taken to make an alteration in religious worship. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and they shall kill me, and go again to Rehoboam king of Judah; his fears ran so high, that he should not only lose his kingdom, but his life, unless some step was taken to make an alteration in religious worship. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "If this people go up to do sacrifice in the house of the LORD {l} at Jerusalem, then shall the heart of this people turn again unto their lord, even unto Rehoboam king of Judah, and they shall kill me, and go again to Rehoboam king of Judah.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "If this people go up to do sacrifice in the house of the LORD ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{l}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " at Jerusalem, then shall the heart of this people turn again unto their lord, ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "even",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " unto Rehoboam king of Judah, and they shall kill me, and go again to Rehoboam king of Judah.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(l) He feared least his people should have by this means been enticed to rebel against him.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "if this people go up to do sacrifice",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] There appears to have been no thought in the popular mind that the choice of a different ruler for the ten tribes would break their connexion with the worship at the Temple. So that we must judge the Temple to have now become the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "one",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " recognised place for worship. The R.V. represents the Hebrew more closely by rendering ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "to offer sacrifices",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "then shall the heart of this people turn",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] After the first excitement of the revolt was over, and Jeroboam had begun to exercise lordship in his turn, the attraction of the Temple, and the prestige of the older family, and especially the glories attaching to the house of David would begin to reassert their power. Jeroboam expresses this feeling when he still calls Rehoboam ‘their lord.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "they shall kill me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] When they have begun to repent of the step which they have taken at my leading. Such reaction of feeling is more common in Eastern than in Western minds.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and go again to Rehoboam king of Judah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The LXX. omits these words. The title ‘king of Judah’ is first used in this chapter, here and above in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 12:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 27.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "If this people go up to do sacrifice",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "sacrifices",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "in the house of the Lord at Jerusalem",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [as the law of Moses ordained (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 12:11, 14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 16:6, 11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")], ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "then shall the heart of this people turn again unto their lord",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [The Syriac omits this word. The LXX. has ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "πρὸς Κύριον κὰι κύριον αὐτῶν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "]",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": ", even unto Rehoboam king of Judah",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "cmt_word",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "even unto Rehoboam king of Judah",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " [When Wordsworth remarks that Jeroboam \"here acknowledges Rehoboam as the 'lord' of the people,\" he surely forgets that these are not the actual ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "words",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of Jeroboam, but the thoughts which the historian supposes him to have had (ver. 26) ], ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "and they shall kill me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [as they would do, if they wished to return to Rehoboam's rule. Their first offering would be the head of the usurper, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 20:20, 21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 4:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "], and go again [lit., ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "turn",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "again",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", same word as above] to Rehoboam king of Judah. 1 Kings 12:27",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In order also to give internal strength to his kingdom, Jeroboam resolved to provide for his subjects a substitute for the sacrificial worship in the temple by establishing new sacra, and thus to take away all occasion for making festal journeys to Jerusalem, from which he apprehended, and that probably not without reason, a return of the people to the house of David and consequently further danger for his own life. \"If this people go up to perform sacrifice in the house of Jehovah at Jerusalem, their heart will turn to their lord, king Rehoboam,\" etc.",
        "children": []
      }
    ]
  }
]