[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12:1-15 The tribes complained not to Rehoboam of his father's idolatry, and revolt from God. That which was the greatest grievance, was none to them; so careless were they in matters of religion, if they might live at case, and pay no taxes. Factious spirits will never want something to complain of. And when we see the Scripture account of Solomon's reign; the peace, wealth, and prosperity Israel then enjoyed; we cannot doubt but that their charges were false, or far beyond the truth. Rehoboam answered the people according to the counsel of the young men. Never was man more blinded by pride, and desire of arbitrary power, than which nothing is more fatal. God's counsels were hereby fulfilled. He left Rehoboam to his own folly, and hid from his eyes the things which belonged to his peace, that the kingdom might be rent from him. God serves his own wise and righteous purposes by the imprudences and sins of men. Those that lose the kingdom of heaven, throw it away, as Rehoboam, by wilfulness and folly.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The complaint was probably twofold. The Israelites no doubt complained in part of the heavy weight of taxation laid upon them for the maintenance of the monarch and his court ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 4:19-23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". But their chief grievance was the forced labor to which they had been subjected ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 5:13-14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 11:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Forced labor has been among the causes leading to insurrection in many ages and countries. It helped to bring about the French Revolution, and it was for many years one of the principal grievances of the Russian serfs. Jeroboam's position as superintendent of the forced labors of the tribe of Ephraim ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 11:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " revealed to him the large amount of dissatisfaction which Solomon's system had produced, and his contemplated rebellion in Solomon's reign may have been connected with this standing grievance. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5-8. he said … Depart yet for three days—It was prudent to take the people's demand into calm and deliberate consideration. Whether, had the advice of the sage and experienced counsellors been followed, any good result would have followed, it is impossible to say. It would at least have removed all pretext for the separation. [See on [312]2Ch 10:7.] But he preferred the counsel of his young companions (not in age, for they were all about forty-one, but inexperienced), who recommended prompt and decisive measures to quell the malcontents.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Give me that time for deliberation and advice. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And he said unto them, depart yet for three days, then come again to me,.... Suggesting that he would consider of their proposal and inquire into the merits of it and as things should appear to him he would give them an answer in three days time; which at first sight may seem a point of prudence in him, to take time for deliberation and counsel in this affair, but in his case and circumstance it was very imprudent; for he might easily see there was discontent among the people, and a faction forming against him, and, by taking time to himself, he gave them time to take their measures, and hasten and ripen them for a revolt; for, by giving them such an answer, they might plainly perceive he was not inclined to give them satisfaction; it would have been the most advisable in him to have promised them at once that he would make them easy: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the people departed; to their quarters, and there remained to the third day. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and the people departed; to their quarters, and there remained to the third day. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And he said unto them, Depart yet for three days, then come again to me. And the people departed.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 5.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And he said unto them, Depart yet for three days",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [so as to afford time for  counsel and deliberation. It has been assumed that both the old and young advisers of Rehoboam had been taken by him, as part of his retinue, to Shechem (Bahr). But it is quite as likely that some of them were summoned from Jerusalem to advise him, and that the three days' delay was in order to give time for their attendance. It is a long day's journey (12 hours) from Nablus to Jerusalem. Three days, consequently, would just afford sufficient time for the purpose] ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "then come again to me, And the people departed.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [The peaceable departure, like the respect-tiff demand, contradicts the idea of a settled purpose to rebel.] 1 Kings 12:5",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In order that the request of the tribes might be maturely weighed, Rehoboam directed them to appear before him again in three days, and in the meantime discussed the matter with the older counsellors,who had served his father.",
        "children": []
      }
    ]
  }
]