[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(12) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Isaac sowed in that land.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—When Abraham planted a tamarisk-tree at Beer-sheba (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 21:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") it showed that he regarded the place as a permanent residence, which it was worth his while to adorn, and to provide for its increasing pleasantness. Isaac and Jacob took a still further step in advance towards a settled life when they began to cultivate plots of ground. At first, however, Isaac did no more than the Bedaween do at present; for they often sow a piece of land, wait till the crop is ripe, and then resume their roving habits. Permanently to till the soil is with them a mark of inferiority (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 25:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). But the tendency, both with Abraham and Isaac, had long been to remain in the region about Beer-sheba. Isaac had been driven thence by the famine, by which he had probably lost much of his cattle, and many even of his people. Apparently he was even so weakened thereby as to be no match for the Philistines of Gerar. His large harvest recouped him for his losses, and made him once more a prosperous man; and in due time Beer-sheba was again his home, and with settled habits agriculture was·sure to begin.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "An hundredfold.—The Heb. is, a hundred measures, but the word is unknown elsewhere, and the LXX. and Syriac read, a hundred of barley, measures being understood, as in Ruth 3:15. Herodotus (Book i. 193) mentions two—and even three—hundredfold as possible in Babylonia; but our Lord seems to give one hundredfold as the extreme measure of productiveness in Palestine (Matthew 13:8). Such a return, like Isaac’s, would be rare and extraordinary.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "An hundredfold.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The Heb. is, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "a hundred measures, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "but the word is unknown elsewhere, and the LXX. and Syriac read, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "a hundred of barley, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "measures being understood, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ruth 3:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Herodotus (Book i. 193) mentions two—and even three—hundredfold as possible in Babylonia; but our Lord seems to give one hundredfold as the extreme measure of productiveness in Palestine (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 13:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Such a return, like Isaac’s, would be rare and extraordinary.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Genesis",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "THE FIRST APOSTLE OF PEACE AT ANY PRICEGenesis 26:12 - Genesis 26:25",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "THE FIRST APOSTLE OF PEACE AT ANY PRICE",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 26:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 26:25",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The salient feature of Isaac’s life is that it has no salient features. He lived out his hundred and eighty years in quiet, with little to make history. Few details of his story are given, and some of these are not very creditable. He seems never to have wandered far from the neighbourhood of Beersheba. These quiet, rolling stretches of thinly peopled land contented him, and gave pasture for his flocks, as well as fields for his cultivation. Like many of the tribes of that district still, he had passed from the purely nomad and pastoral life, such as Abraham led, and had begun to ‘sow in that land.’ That marks a stage in progress. His father’s life had been like a midsummer day, with bursts of splendour and heavy thunder-clouds; his was liker a calm day in autumn, windless and unchanging from morning till serene evening. The world thinks little of such lives, but they are fruitful.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Our text begins with a sweet little picture of peaceful industry, blessed by God, and therefore prospering. Travellers tell us that the land where Isaac dwelt is still marvellously fertile, even to rude farming. But to be merely a successful farmer and sheep-owner might have seemed poor work to the heir of such glowing promises, and the prospect of a high destiny often disgusts its possessor with lowly duties. ‘But if we hope for that which we see not, then do we with patience wait for it,’ and the best way to fit ourselves for great things in the future is to bend our backs and wills to humble toil in the present. Peter expected every day to see the risen Lord, when he said, ‘I go a-fishing.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The Philistines’ envy was very natural, since Isaac was an alien, and, in some sense, an intruder. Their stopping of the wells was a common act of hostility, and an effectual one in that land, where everything lives where water comes, and dies if it is cut off. Abimelech’s reason for ‘extraditing’ Isaac might have provoked a more pugnacious person to stay and defy the Philistines to expel him. ‘Thou art much mightier than we,’ and so he could have said, ‘Try to put me out, then,’ and the result might have been that Abimelech and his Philistines would have been the ones to go. But the same spirit was in the man as had been in the lad, when he let his father bind him and lay him on the altar without a struggle or a word, and he quietly went, leaving his fields and pastures. ‘Very poor-spirited,’ says the world; what does Christ say?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Isaac was not ‘original.’ He cleaned out the wells which his father had digged, and with filial piety gave them again the old names ‘which his father had called them.’ Some of us nowadays get credit for being ‘advanced and liberal thinkers,’ because we regard our fathers’ wells as much too choked with rubbish to be worth clearing out, and the last thing we should dream of would be to revive the old names. But the old wells were not enough for the new time, and so fresh ones were added. Isaac and his servants did not say, ‘We will have no water but what is drawn from Abraham’s wells. What was enough for him is enough for us.’ So, like all wise men, they were conservatively progressive and progressively conservative. The Gerar shepherds were sharp lawyers. They took strong ground in saying, ‘The ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "water",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is ours; you have dug wells, but we are ground-owners, and what is below the surface, as well as what is on it, is our property.’ Again Isaac fielded, moved on a little way, and tried again. A second well was claimed, and given up, and all that Isaac did was to name the two ‘Contention’ and ‘Enmity,’ as a gentle rebuke and memorial. Then, as is generally the result, gentleness wearied violence out, and the Philistines tired of annoying before Isaac tired of yielding. So he came into a quiet harbour at last, and traced his repose to God, naming his last well ‘Broad Places,’ because the Lord had made room for him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Such a quiet spirit, strong in non-resistance, and ready to yield rather than quarrel, was strangely out of place in these wild days and lands. He obeyed the Sermon on the Mount millenniums before it was spoken. Whether from temperament or from faith, he is the first instance of the Christian type of excellence in the Old Testament. For there ought to be no question that the spirit of meekness, which will not meet violence by violence, is the Christian spirit. Christian morals alter the perspective of moral excellences, and exalt meekness above the ‘heroic virtues’ admired by the world. The violets and lilies in Christ’s garden outshine voluptuous roses and flaunting sunflowers. In this day, when there is a recrudescence of militarism, and we are tempted to canonise the soldier, we need more than ever to insist that the highest type is ‘the Lamb of God,’ who was ‘as a sheep before her shearers.’ To fight for my rights is not the Christian ideal, nor is it the best way to secure them. Isaac will generally weary out the Philistines, and get his well at last, and will have escaped much friction and many evil passions.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘Tis safer being meek than fierce.’ ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "‘Tis safer being meek than fierce.’",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Isaac won the friendship of his opponents by his patience, as the verses after the text tell. Their consciences and hearts were touched, and they ‘saw plainly that the Lord was with him,’ and sued him for alliance. It is better to turn enemies into friends than to beat them and have them as enemies still. ‘I’ll knock you down unless you love me’ does not sound a very hopeful way of cementing peaceful relations. But ‘when a man’s ways please the Lord, he maketh even his enemies to be at peace with him.’ But Isaac won more than the Philistines’ favour by his meek peacefulness, for ‘the Lord appeared unto him,’ and assured him that, undefended and unresisting as he was, he had a strong defence, and need not be afraid: ‘Fear not, for I am with thee.’ The ornament of a meek and quiet spirit is, in the sight of God, of great price, and that not only for ‘a woman’; and it brings visions of God, and assurances of tranquil safety to him who cherishes it. The Spirit of God comes down in the likeness of a dove, and that bird of peace sits ‘brooding \"only\" on the charmed wave’ of a heart stilled from strife and wrath, like a quiet summer’s sea.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Isaac’s new home at Beersheba, having been thus hallowed by the appearance of the Lord, was consecrated by the building of an altar. We should hallow by grateful remembrance the spots where God has made Himself known to us. The best beginning of a new undertaking is to rear an altar. It is well when new settlers begin their work by calling on the name of the Lord. Beersheba and Plymouth Rock are a pair. First comes the altar, then the tent can be trustfully pitched, but ‘except the Lord build the house, they labour in vain that build it.’ And if the house is built in faith, a well will not be lacking; for they who ‘seek first the kingdom of God’ will have all needful ‘things added unto them.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 26:12",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 26:12",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaac sowed in that land — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Either in grounds which he had hired of the right owners, or in some which lay neglected, and therefore were free to the first occupier. That this should be the case, in that age of the world, is not strange, considering how few the inhabitants, even of Canaan, then were, in comparison of what they were three hundred years after, when the Israelites came out of Egypt. He ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "received a hundred-fold — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "A hundred times as much as he sowed. The same degree of increase is spoken of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 13:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and affirmed sometimes of other places by heathen writers. But then it was in a better soil and season than this was; for this was in a time of famine. Accordingly an emphasis is laid upon the time; it was the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "same year ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "when there was a famine in the land; while others scarce reaped at all, he reaped thus plentifully, through the divine blessing.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "26:12-17 God blessed Isaac. Be it observed, for the encouragement of poor tenants who occupy other people's lands, and are honest and industrious, that God blessed him with a great increase. The Philistines envied Isaac. It is an instance of the vanity of the world; for the more men have of it, the more they are envied, and exposed to censure and injury. Also of the corruption of nature; for that is an ill principle indeed, which makes men grieve at the good of others. They made Isaac go out of their country. That wisdom which is from above, will teach us to give up our right, and to draw back from contentions. If we are wrongfully driven from one place, the Lord will make room for us in another.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The growing prosperity of Isaac. \"And Isaac sowed in that land.\" This does not imply a fixed property in the soil, but only an annual tenancy. \"A hundred-fold.\" The rates of increase vary from thirty to a hundred. Sixty-fold is very good, and was not unusual in Palestine. A hundred-fold was rare, and only in spots of extraordinary fertility. Babylonia, however, yielded two hundred and even three hundred-fold, according to Herodotus (I. 193). Thus, the Lord began to \"bless him.\" The amazing growth of the stranger's wealth in flocks and herds and servants awakens the envy of the inhabitants. The digging of the well was an enterprise of great interest in rural affairs. It conferred a sort of ownership on the digger, especially in a country where water was precious. And in a primeval state of society the well was the scene of youthful maidens drawing water for domestic use, and of young men and sometimes maidens watering the bleating flocks and lowing herds, and therefore the gathering center of settled life. Hence, the envious Philistines were afraid that from a sojourner he would go on to be a settler, and acquire rights of property. They accordingly took the most effectual means of making his abiding place uncomfortable, when they stopped up the wells. At length the sovereign advised a separation, if he did not enjoin the departure of Isaac.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12. Then Isaac sowed in that land—During his sojourn in that district he farmed a piece of land, which, by the blessing of God on his skill and industry, was very productive (Isa 65:13; Ps 37:19); and by his plentiful returns he increased so rapidly in wealth and influence that the Philistines, afraid or envious of his prosperity, obliged him to leave the place (Pr 27:4; Ec 4:4). This may receive illustration from the fact that many Syrian shepherds at this day settle for a year or two in a place, rent some ground, in the produce of which they trade with the neighboring market, till the owners, through jealousy of their growing substance, refuse to renew their lease and compel them to remove elsewhere.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Isaac sowed in that land; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " either in the grounds which he had hired of the right owners, or in some grounds which lay neglected, and therefore were free to the first occupier; which was not strange in that age of the world, when the inhabitants of countries were not so numerous as afterward. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "An hundredfold, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. a hundred times as much as he sowed. The same degree of increase is intimated ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Matthew 13:8",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 13:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and affirmed sometimes of other places by heathen writers; but then it was in a better soil and season than this was, for this was a time of famine or scarcity. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then, Isaac sowed in that land,.... In the land of Gerar; after matters were settled between him and Abimelech, and he had ordered his servants to do him no hurt, he sowed wheat or barley, or some such grain: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and received in the same year an hundred fold; in which he sowed it, and which many take to be a year of famine; and so it was the more extraordinary, that there should be such a plentiful crop produced on Isaac's ground, when there was such barrenness elsewhere: but it does not seem likely that it should be the same year of famine in which Isaac came to Gerar, since he is said to have been them a \"long time\", Genesis 26:8; before this sowing and plenty upon it were. This increase is far from being incredible; for Pliny (d), besides instances he gives of an hundred fold, says, that in a field at Byzacium in Africa one bushel produced one hundred and fifty bushels; and from the same place, the deputy of Augustus there sent him from one grain very few less than four hundred, and to Nero three hundred stalks from, one grain. Herodotus (e) speaks of a country, near to the place where the Euphrates runs into the Tigris, on which the city Ninus was, which nowhere failed of producing two hundred fold, and the better sort of it even three hundred; see Matthew 13:23, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and received in the same year an hundred fold; in which he sowed it, and which many take to be a year of famine; and so it was the more extraordinary, that there should be such a plentiful crop produced on Isaac's ground, when there was such barrenness elsewhere: but it does not seem likely that it should be the same year of famine in which Isaac came to Gerar, since he is said to have been them a \"long time\", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 26:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; before this sowing and plenty upon it were. This increase is far from being incredible; for Pliny (d), besides instances he gives of an hundred fold, says, that in a field at Byzacium in Africa one bushel produced one hundred and fifty bushels; and from the same place, the deputy of Augustus there sent him from one grain very few less than four hundred, and to Nero three hundred stalks from, one grain. Herodotus (e) speaks of a country, near to the place where the Euphrates runs into the Tigris, on which the city Ninus was, which nowhere failed of producing two hundred fold, and the better sort of it even three hundred; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 13:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and the Lord blessed him; and prospered and succeeded all his endeavours; and this was the true reason of the fertility of the land he manured and sowed. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(d) Nat. Hist. l. 11. c. 10. (e) Clio sive, l. 1. c. 193. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(d) Nat. Hist. l. 11. c. 10. (e) Clio sive, l. 1. c. 193. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Then Isaac sowed in that land, and received in the same year an hundredfold: and the LORD blessed him.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12–17 (J). Isaac’s Prosperity",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "an hundredfold",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Lit. “a hundred measures.” LXX ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἑκατοστεύουσαν κριθήν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " = “barley bearing a hundredfold,” mistaking the Hebrew word for “measure,” and confusing it with that for “barley.” So also the Syriac Pesh. “An hundredfold,” i.e. one hundred for one.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Isaac’s agricultural pursuits offer a contrast to the roaming life of a nomad. But see, in Jacob’s career, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 30:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 37:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "blessed him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] See ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Genesis 26:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 26:3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 24:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 24:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 12.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Then Isaac sowed in that land",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", - viz., Philistia. Though a distinct advance on the purely nomadic life pursued by Abraham, this did not imply fixed property in, or even permanent settlement on, the soil, \"but only annual tenancy\" thereof. Robinson (1. 77) mentions a colony of the Tawarah Arabs, about fifty families, living near Abu Zabel, in Egypt, who cultivated the soil and yet dwelt in tents. \"The Biblical patriarchs were not mere Bedawin wanderers, like those who now occupy the Eastern deserts. They had large herds of cattle, which genuine Bedawins have not; they tilled the ground, which these robbers never do; and they accommodated themselves, without difficulty or reluctance, to town and city when necessary, which wild Arabs cannot endure\" ('Land and Book,' p. 296) - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "and received in the same year an hundred-fold",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "an hundred measures",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "e",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". for each measure of that which he sowed; an exceptional return even for Philistia, though \"the country is no less fertile than the very best of the Mississippi Valley\" ('Land and Book,' p. 557); and Arab grain stores at ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Nuttar-abu-Sumar",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "in",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the vicinity of Gaza, still proclaim the remunerative yield of its harvests (Robinson, vol. 1. p. 292). Herodotus (1. 193) speaks of two and three hundred-fold as having been reaped on the plain of Babylonia; but in Palestine the usual rate of increase was from thirty to a hundred-fold (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "vide",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 13:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The reading \"an hundred of barley\" (LXX., Syriac, Michaelis) is not to be preferred to that in the Textus Receptus. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And the Lord blessed him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - as he had promised (ver. 3). Genesis 26:12",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Isaac's Increasing Wealth. - As Isaac had experienced the promised protection (\"I will be with thee,\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 26:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") in the safety of his wife, so did he received while in Gerar the promised blessing. He sowed and received in that year \"a hundred measures,\" i.e., a hundred-fold return. This was an unusual blessing, as the yield even in very fertile regions is not generally greater than from twenty-five to fifty-fold (Niebuhr and Burckhardt), and it is only in the Ruhbe, that small and most fruitful plain of Syria, that wheat yields on an average eighty, and barley a hundred-fold. Agriculture is still practised by the Bedouins, as well as grazing (Robinson, Pal. i. 77, and Seetzen); so that Isaac's sowing was no proof that he had been stimulated by the promise of Jehovah to take up a settled abode in the promised land.",
        "children": []
      }
    ]
  }
]