[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(27) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Wherefore come ye to me?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Isaac’s return had brought matters to a crisis, and the king must now decide whether there was to be peace or war.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "26:26-33 When a man's ways please the Lord, he maketh even his enemies to be at peace with him, Pr 16:7. Kings' hearts are in his hands, and when he pleases, he can turn them to favour his people. It is not wrong to stand upon our guard in dealing with those who have acted unfairly. But Isaac did not insist on the unkindnesses they had done him; he freely entered into friendship with them. Religion teaches us to be neighbourly, and, as much as in us lies, to live peaceable with all men. Providence smiled upon what Isaac did; God blessed his labours.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The treaty with Abimelek. This is an interview similar to what Abraham had with the king of Gerar; and its object is a renewal of the former league between the parties. Besides Phikol, the commander-in-chief, he is now accompanied by Ahuzzath, his privy counsellor. Isaac upbraids him with his unkindness in sending him away, and his inconsistency in again seeking a conference with him. \"We clearly saw.\" His prosperity was such as to be a manifest token of the Lord's favor. Hence, they desired the security of a treaty with him by an oath of execration on the transgressor. \"Do us no hurt.\" The covenant is one-sided, as expressed by Abimelek. \"As we have not touched thee.\" This implies the other side of the covenant. \"Thou art now blessed of Yahweh.\" This explains the one-sidedness of the covenant. Isaac needed no guarantee from them, as the Lord was with him. Abimelek is familiar with the use of the name Yahweh. Isaac hospitably entertains and lodges the royal party, and on the morrow, after having sworn to the treaty, parts with them in peace. On the same day Isaac's servants report concerning the well they had digged ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 26:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that they had found water. This well he calls Sheba, \"an oath,\" and hence the town is called Beer-sheba, \"the well of the oath.\" Now the writer was aware that this place had received the same name on a former occasion ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 21:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". But a second well has now been dug in like circumstances in the same locality. This gives occasion for a new application of the name in the memories of the people. This is another illustration of the principle explained at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 25:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Two wells still exist at this place to attest the correctness of the record.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "26-33. Then Abimelech went to him—As there was a lapse of ninety years between the visit of Abraham and of Isaac, the Abimelech and Phichol spoken of must have been different persons' official titles. Here is another proof of the promise (Ge 12:2) being fulfilled, in an overture of peace being made to him by the king of Gerar. By whatever motive the proposal was dictated—whether fear of his growing power, or regret for the bad usage they had given him, the king and two of his courtiers paid a visit to the tent of Isaac (Pr 16:7). His timid and passive temper had submitted to the annoyances of his rude neighbors; but now that they wish to renew the covenant, he evinces deep feeling at their conduct, and astonishment at their assurance, or artifice, in coming near him. Being, however, of a pacific disposition, Isaac forgave their offense, accepted their proposals, and treated them to the banquet by which the ratification of a covenant was usually crowned.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Isaac said unto them, wherefore come ye to me,.... What is the meaning of this visit? what has brought you hither? it cannot be from affection and friendship to me: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "seeing ye hate me, and have sent me away from you? the latter he mentions as a proof of the former; they envied his prosperity, and hated him on that account, and therefore expelled him their country, or at least would not suffer him to dwell among them; and still more glaring proofs were given of the hatred of the men of Gerar to him, not only by stopping up his father's wells, but by striving and contending with him about those he dug in the valley after he was gone from them; one of which he called \"Sitnah\", from their hatred of him. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "seeing ye hate me, and have sent me away from you? the latter he mentions as a proof of the former; they envied his prosperity, and hated him on that account, and therefore expelled him their country, or at least would not suffer him to dwell among them; and still more glaring proofs were given of the hatred of the men of Gerar to him, not only by stopping up his father's wells, but by striving and contending with him about those he dug in the valley after he was gone from them; one of which he called \"Sitnah\", from their hatred of him. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Isaac said unto them, Wherefore come ye to me, seeing ye hate me, and have sent me away from you?",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 27.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And Isaac said unto them, Wherefore",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "מַדּוּעַ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", contr, from ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "מָה יָדוּעַ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", what is taught? - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "for what reason",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "τί μαθών",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "-",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "come ye to me, seeing",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (literally, and) ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "ye hate me, and have sent me away from you?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " While animadverting to the personal hostility to which he had been subjected, Isaac says nothing about the wells of which he had been deprived: a second point of difference between this and the preceding narrative of Abraham's covenant with the Philistine king. Genesis 26:27",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Abimelech's Treaty with Isaac. - The conclusion of this alliance was substantially only a repetition of renewal of the alliance entered into with Abraham; but the renewal itself arose so completely out of the circumstances, that there is no ground whatever for denying that it occurred, or for the hypothesis that our account is merely another form of the earlier alliance; to say nothing of the fact, that besides the agreement in the leading event itself, the attendant circumstances are altogether peculiar, and correspond to the events which preceded. Abimelech not only brought his chief captain Phicol (supposed to be the same as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 21:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", if Phicol is not also an official name), but his מרע \"friend,\" i.e., his privy councillor, Ahuzzath. Isaac referred to the hostility they had shown; to which Abimelech replied, that they (he and his people) did not smite him (נגע), i.e., drive him away by force, but let him depart in peace, and expressed a wish that there might be an oath between them. אלה the oath, as an act of self-imprecation, was to form the basis of the covenant to be made. From this אלה came also to be used for a covenant sanctioned by an oath (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 29:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 29:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). תּעשׂה אם \"that thou do not:\" אם a particle of negation used in an oath (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 14:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.). (On the verb with zere, see Ges. 75, Anm. 17; Ewald, 224.) - The same day Isaac's servants informed him of the well which they had dug; and Isaac gave it the name Shebah (שׁבעה, oath), in commemoration of the treaty made on oath. \"Therefore the city was called Beersheba.\" This derivation of the name does not shut the other (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 21:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") out, but seems to confirm it. As the treaty made on oath between Abimelech and Isaac was only a renewal of his covenant concluded before with Abraham, so the name Beersheba was also renewed by the well Shebah. The reality of the occurrence is supported by the fact that the two wells are in existence still (vid., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 21:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      }
    ]
  }
]