[{"num":3,"verse":"To every thing there is a zeman (time), and an et (season) for every matter under Shomayim;"},{"num":2,"verse":"An et (season) to be born, and an et (season) to die; an et (season) to plant, and an et (season) to uproot that which is planted;"},{"num":3,"verse":"An et (season) to kill, and an et (season) to heal; an et (season) to tear down, and an et (season) to build up;"},{"num":4,"verse":"An et (season) to weep, and an et (season) to laugh; an et (season) to mourn, and an et (season) to dance;"},{"num":5,"verse":"An et (season) to throw stones away, and an et (season) to gather stones together; an et (season) to embrace, and an et (season) to refrain from embracing;"},{"num":6,"verse":"An et (season) to look for, and an et (season) to lose; an et (season) to keep, and an et (season) to throw away;"},{"num":7,"verse":"An et (season) to tear, and an et (season) to mend; an et (season) to keep silent, and an et (season) to speak;"},{"num":8,"verse":"An et (season) to love, and an et (season) to hate; an et (season) of milchamah, and an et (season) of shalom."},{"num":9,"verse":"What profit hath the worker from his amal (labor)?"},{"num":10,"verse":"I have seen the occupation, which Elohim hath given to the bnei HaAdam to keep them occupied."},{"num":11,"verse":"Hashem hath made every thing yafeh in its et (season); also He hath set HaOlam in their lev, yet so that no adam can find out the ma’aseh that HaElohim hath done from the beginning to the end."},{"num":12,"verse":"I have da’as that there is nothing better for adam, than that they have simchah and do tov while they live."},{"num":13,"verse":"And also that kol haAdam should eat and drink, and enjoy the good of all his amal. This is a gift of Elohim."},{"num":14,"verse":"I have da’as that, all that HaElohim doeth will endure l’olam; nothing can be added to it, nor any thing taken from it; HaElohim doeth it, that men should fear before Him."},{"num":15,"verse":"That which is hath been already; and that which is to be hath already been; and HaElohim will call that which is past to account."},{"num":16,"verse":"And moreover I saw under the shemesh that in the Mekom Mishpat (place of judgment) resha (wickedness) was there; and in the Mekom Tzedek, resha (wickedness) was there."},{"num":17,"verse":"I said in mine lev, HaElohim shall judge the tzaddik and the resha (wicked); for an et (season) for every matter and for every ma’aseh is there."},{"num":18,"verse":"I said in mine lev, As for bnei haAdam, HaElohim tests them, that they might see that they themselves are like beheimah."},{"num":19,"verse":"For bnei haAdam and beheimah share one and same mikreh (fortune); as the one dieth, so dieth the other; yea, they have all one breath; so that the adam hath no advantage above the beheimah; for all is hevel."},{"num":20,"verse":"All go unto mekom echad; all are of the afahr (dust), and all return to the afahr again."},{"num":21,"verse":"Who hath da’as of the ruach bnei haAdam that goeth upward, and the ruach habeheimah that goeth downward to ha’aretz [see 12:7]?"},{"num":22,"verse":"Wherefore I perceive that there is nothing better than that the adam find simchah in his ma’asim; for that is his chelek; for who shall bring him to see what shall be after him?"}]