[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(25) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And when they were come down.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—After the public sacrificial meal at which such signal honours had been shown to the Benjamite stranger and his servant, the prophet-judge detained Saul from continuing his journey homewards, and persuaded him to remain as his guest that night at Ramah. He conducted him to the flat roof of his house, often the favourite locality in the East for quiet conversation or rest, and where frequently the honoured guest was lodged for the night: there the prophet had a long interview with his young guest, The conversation that evening probably did not turn upon the royal dignity, so soon to be conferred on Saul; of that Samuel spoke at length, we know, on the following morning. The solemn words of the old man that evening on the house-top in “Ramah of the Watchers” referred, no doubt, to the sad religious and political decline of the people of God, from which he (Samuel) had laboured, not unsuccessfully, to rescue them, “to the opposition of the heathen nations, the causes of the impotency of Israel to oppose their enemies, the necessity of a religious change in the people, and of a leader thoroughly obedient to the Lord.”—Otto von Gerlach, quoted in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Lange. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "It has been suggested that this conversation was the connecting link between that on the height (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Samuel 9:19-20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") and the communication which Samuel made to Saul the following morning. The LXX. reads here, instead of “communed with Saul on the top of the house,” “they strewed a couch for Saul on the top of the house, and he lay down.” But the Chaldee and Syriac Versions agree with the Hebrew text. The strange LXX. variation is apparently a correction. These Greek translators could not understand a conversation of the prophet and Saul taking place in the evening, when the announcement of the crown was made so formally on the following morning. Why did Samuel not tell Saul of God’s intention during that evening spent together?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1 Samuel 9:25",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 9:25",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Samuel communed with Saul — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Concerning the kingdom designed for him by God, and his administration of the government; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "upon the top of the house — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "For coolness in the evening, and privacy. The Vulgate adds here, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Saul prepared him a bed on the top of the house, and slept, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "an addition which Houbigant approves, accounting very plausibly for the deficiency of the Hebrew. The Seventy also understood the passage in a similar way, translating it, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And they spread a bed for Saul on the top of the house, and he slept.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9:18-27 Samuel, that good prophet, was so far from envying Saul, or bearing him any ill-will, that he was the first and most forward to do him honour. Both that evening and early the next morning, Samuel communed with Saul upon the flat roof of the house. We may suppose Samuel now convinced Saul that he was the person God had fixed upon for the government, and of his own willingness to resign. How different are the purposes of the Lord for us, from our intentions for ourselves! Perhaps Saul was the only one who ever went out to seek asses, and literally found a kingdom; but many have set out and moved their dwellings to seek riches and pleasures, who have been guided to places where they found salvation for their souls. Thus they have met with those who addressed them as if aware of the secrets of their lives and hearts, and have been led seriously to regard the word of the Lord. If this has been our case, though our worldly plans have not prospered, let us not care for that; the Lord has given us, or has prepared us for, what is far better.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The shoulder and its appurtenances - would give the sense accurately. The right shoulder was the priest's portion in the Levitical sacrifices. Probably it was Samuel's own portion in this case, and he gave it to Saul as a mark of the highest honor. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "25-27. Samuel communed with Saul upon the top of the house—Saul was taken to lodge with the prophet for that night. Before retiring to rest, they communed on the flat roof of the house, the couch being laid there (Jos 2:6), when, doubtless, Samuel revealed the secret and described the peculiar duties of a monarch in a nation so related to the Divine King as Israel. Next morning early, Samuel roused his guest, and conveying him on his way towards the skirts of the city, sought, before parting, a private interview—the object of which is narrated in the next chapter.   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Samuel communed with Saul, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " concerning the kingdom designed to him by God, and his duty to expect it patiently, till God actually called him to it; and to administer it piously, and justly, and valiantly. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The top of the house",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " was flat, after the manner, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Deu 22:8",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deu 22:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; and so fit for walking, and for secret prayers, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Daniel 6:10 Acts 10:9",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 6:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 10:9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", or any private and familiar discourses among friends. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And when they came down from the high place into the city,.... After the feast was ended; and though Ramah itself was situated on an eminence, yet it seems this high place was higher than that, being without the city upon an hill, and therefore they are said to come down from the one to the other; or they came down from the high place, and then ascended the hill to the city: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Samuel communed with Saul upon the top of the house: of Samuel's house; when they were come thither, Samuel took Saul up to the roof of his house, which was flat, as the roofs of houses in this country were; see Deuteronomy 22:8 on which they could walk to and fro, and converse together; hence you read of preaching and praying on housetops, Matthew 10:27 what they communed about is not said, but may be guessed at, that it was about Saul's being made king; of the certainty of it, by divine designation; of the manner of executing that office wisely and justly; about the objections Saul had made of the smallness of his tribe and family; and of Samuel's willingness to resign the government to him, with other things of the like kind. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Samuel communed with Saul upon the top of the house: of Samuel's house; when they were come thither, Samuel took Saul up to the roof of his house, which was flat, as the roofs of houses in this country were; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 22:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " on which they could walk to and fro, and converse together; hence you read of preaching and praying on housetops, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 10:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " what they communed about is not said, but may be guessed at, that it was about Saul's being made king; of the certainty of it, by divine designation; of the manner of executing that office wisely and justly; about the objections Saul had made of the smallness of his tribe and family; and of Samuel's willingness to resign the government to him, with other things of the like kind. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And when they were come down from the high place into the city, Samuel communed with Saul upon the top of the house.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "25–10:8. Saul anointed by Samuel and promised three signs in confirmation of his call",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "25, 26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Samuel communed with Saul",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Preparing him for the announcement which he was going to make next morning. On the housetop they would be open to the public view so that all could see the honour Samuel shewed his guest, while they would have opportunity for undisturbed conversation. The Sept. however reads, “And he came down from the high place into the city: and they prepared a bed for Saul on the housetop and he slept. And it came to pass, &c.” This may perhaps represent the original text, for it seems strange to say first “they arose early,” and then proceed to describe Samuel’s calling Saul. The flat roof of an oriental house is still “resorted to for business, relaxation, or for sleeping … During a large part of he year it is the most agreeable place about the establishment, especially in the morning and evening.” See Thomson’s ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Land and the Book",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", p. 39 ff.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 25.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - When the feast was over they went down from the high place, and, having entered the city, proceeded to Samuel's dwelling, where he ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "communed with Saul upon the top of the house.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The Septuagint has a very probable reading, namely, \"And they spread a bed for Saul upon the roof, and he lay down;\" but the Syriac and Chaldee agree with the Hebrew. Without communicating to Saul that he was to be king, which was not revealed to him till the next day (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 10:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), Samuel might be anxious to impress on Saul's mind the great principles of the theocratic government, and also the nature of the remedies necessary for Israel's recovery from its present misery. 1 Samuel 9:25",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "When the sacrificial meal was over, Samuel and Saul went down from the high place into the town, and he (Samuel) talked with him upon the roof (of the house into which Samuel had entered). The flat roofs of the East were used as placed of retirement for private conversation (see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 22:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). This conversation did not refer of course to the call of Samuel to the royal dignity, for that was not made known to him as a word of Jehovah till the following day (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 9:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); but it was intended to prepare him for that announcement: so that O. v. Gerlach's conjecture is probably the correct one, viz., that Samuel \"talked with Saul concerning the deep religious and political degradation of the people of God, the oppression of the heathen, the causes of the inability of the Israelites to stand against these foes, the necessity for a conversion of the people, and the want of a leader who was entirely devoted to the Lord.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: For הגּג על עם־שׁאוּל וידבּר the lxx have καὶ διέστρωσαν τῷ Σαοὺλ ἐπι τῷ δώματι καὶ ἐκοιμήθη, \"they prepared Saul a bed upon the house, and he slept,\" from which Clericus conjectured that these translators had read לשאול וירבדו (וירבּדוּ or ויּרבּדוּ); and Ewald and Thenius propose to alter the Hebrew text in this way. But although וגו ויּשׁכּימוּ (1 Samuel 9:26) no doubt presupposes that Saul had slept in Samuel's house, and in fact upon the roof, the remark of Thenius, \"that the private conversation upon the roof (1 Samuel 9:25) comes too early, as Saul did not yet know, and was not to learn till the following day, what was about to take place,\" does not supply any valid objection to the correctness of the Masoretic text, or any argument in favour of the Septuagint rendering or interpretation, since it rests upon an altogether unfounded and erroneous assumption, viz., that Samuel had talked with Saul about his call to the throne. Moreover, \"the strangeness\" of the statement in 1 Samuel 9:26, \"they rose up early,\" and then \"when the morning dawned, Samuel called,\" etc., cannot possibly throw any suspicion upon the integrity of the Hebrew text, as this \"strangeness\" vanishes when we take וגו כּעלות ויהי as a more precise definition of ויּשׁכּימוּ. The Septuagint translators evidently held the same opinion as their modern defenders. They took offence at Samuel's private conversation with Saul, because he did not make known to him the word of God concerning his call to the throne till the next morning; and, on the other hand, as their rising the next morning is mentioned in 1 Samuel 9:26, they felt the absence of any allusion to their sleeping, and consequently not only interpreted ידבר by a conjectural emendation as standing for ירבד rof, because מרבדּים רבד is used in Proverbs 7:16 to signify the spreading of mats or carpets for a bed, but also identified וישׁכמו with ישׁכבו, and rendered it ἐκοιμήθη. At the same time, they did not reflect that the preparation of the bed and their sleeping during the night were both of them matters of course, and there was consequently no necessity to mention them; whereas Samuel's talking with Saul upon the roof was a matter of importance in relation to the whole affair, and one which could not be passed over in silence. Moreover, the correctness of the Hebrew text is confirmed by all the other ancient versions. Not only do the Chaldee, Syriac, and Arabic follow the Masoretic text, but Jerome does the same in the rendering adopted by him, \"Et locutus est cum Saule in solario. Cumque mane surrexissent;\" though the words \"stravitque Saul in solario et dormivit\" have been interpolated probably from the Itala into the text of the Vulgate which has come down to us.)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: For הגּג על עם־שׁאוּל וידבּר the lxx have καὶ διέστρωσαν τῷ Σαοὺλ ἐπι τῷ δώματι καὶ ἐκοιμήθη, \"they prepared Saul a bed upon the house, and he slept,\" from which Clericus conjectured that these translators had read לשאול וירבדו (וירבּדוּ or ויּרבּדוּ); and Ewald and Thenius propose to alter the Hebrew text in this way. But although וגו ויּשׁכּימוּ (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 9:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") no doubt presupposes that Saul had slept in Samuel's house, and in fact upon the roof, the remark of Thenius, \"that the private conversation upon the roof (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 9:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") comes too early, as Saul did not yet know, and was not to learn till the following day, what was about to take place,\" does not supply any valid objection to the correctness of the Masoretic text, or any argument in favour of the Septuagint rendering or interpretation, since it rests upon an altogether unfounded and erroneous assumption, viz., that Samuel had talked with Saul about his call to the throne. Moreover, \"the strangeness\" of the statement in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 9:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"they rose up early,\" and then \"when the morning dawned, Samuel called,\" etc., cannot possibly throw any suspicion upon the integrity of the Hebrew text, as this \"strangeness\" vanishes when we take וגו כּעלות ויהי as a more precise definition of ויּשׁכּימוּ. The Septuagint translators evidently held the same opinion as their modern defenders. They took offence at Samuel's private conversation with Saul, because he did not make known to him the word of God concerning his call to the throne till the next morning; and, on the other hand, as their rising the next morning is mentioned in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 9:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", they felt the absence of any allusion to their sleeping, and consequently not only interpreted ידבר by a conjectural emendation as standing for ירבד rof, because מרבדּים רבד is used in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 7:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " to signify the spreading of mats or carpets for a bed, but also identified וישׁכמו with ישׁכבו, and rendered it ἐκοιμήθη. At the same time, they did not reflect that the preparation of the bed and their sleeping during the night were both of them matters of course, and there was consequently no necessity to mention them; whereas Samuel's talking with Saul upon the roof was a matter of importance in relation to the whole affair, and one which could not be passed over in silence. Moreover, the correctness of the Hebrew text is confirmed by all the other ancient versions. Not only do the Chaldee, Syriac, and Arabic follow the Masoretic text, but Jerome does the same in the rendering adopted by him, \"Et locutus est cum Saule in solario. Cumque mane surrexissent;\" though the words \"stravitque Saul in solario et dormivit\" have been interpolated probably from the Itala into the text of the Vulgate which has come down to us.)",
            "children": []
          }
        ]
      }
    ]
  }
]