[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(27) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "That I may shew thee the word of God.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The wonderment of Saul at the strange honour and distinction shown to him, a comparatively unknown Benjamite, by the famous prophet-judge, was, no doubt, increased by this proposal of Samuel to accompany him a little way on his journey homeward. The meaning of all that had happened to him on the day before was, however, now to be revealed: the gracious welcome as a distinguished guest evidently looked for, the courteous hospitality in the judge’s house; and, more than all, the long private instructions Samuel had given him in the evening on the state of Israel. The prophet now directs that the servant should be sent on alone, that he might in all solemn confidence impart to Saul “the word of God,” that is, all that the God of Israel had revealed to him, the seer, concerning Saul’s appointment.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "It would have been interesting to have learned something of Saul’s state of mind when this startling revelation of the choice of God was first made to him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The writer here is silent, but in the next chapter (1Samuel 9:6) we read that the Spirit of the Lord was specially promised to this chosen one. When new duties are imposed by God, He never forgets to bestow the gift of new powers.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The writer here is silent, but in the next chapter (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Samuel 9:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") we read that the Spirit of the Lord was specially promised to this chosen one. When new duties are imposed by God, He never forgets to bestow the gift of new powers.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1 Samuel 9:27",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 9:27",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Samuel said, Bid the servant pass on before us — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That thou and I may speak privately of the matter of the kingdom. Which Samuel hitherto endeavoured to conceal, lest he should be thought now to impose a king upon them, as before he denied one to them: and that it might appear by the lot mentioned in the next chapter, that the kingdom was given to Saul by God’s destination, and not by Samuel’s contrivance. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "That I may show thee the word of God — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That is, a message delivered to me from God, which now I shall impart to thee. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9:18-27 Samuel, that good prophet, was so far from envying Saul, or bearing him any ill-will, that he was the first and most forward to do him honour. Both that evening and early the next morning, Samuel communed with Saul upon the flat roof of the house. We may suppose Samuel now convinced Saul that he was the person God had fixed upon for the government, and of his own willingness to resign. How different are the purposes of the Lord for us, from our intentions for ourselves! Perhaps Saul was the only one who ever went out to seek asses, and literally found a kingdom; but many have set out and moved their dwellings to seek riches and pleasures, who have been guided to places where they found salvation for their souls. Thus they have met with those who addressed them as if aware of the secrets of their lives and hearts, and have been led seriously to regard the word of the Lord. If this has been our case, though our worldly plans have not prospered, let us not care for that; the Lord has given us, or has prepared us for, what is far better.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "To the top of the house - \"On the top.\" The bed on which Saul slept was on the top of the house. It is very common in the East to provide extra sleeping accommodation by placing a tent or awning on the house-top. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "25-27. Samuel communed with Saul upon the top of the house—Saul was taken to lodge with the prophet for that night. Before retiring to rest, they communed on the flat roof of the house, the couch being laid there (Jos 2:6), when, doubtless, Samuel revealed the secret and described the peculiar duties of a monarch in a nation so related to the Divine King as Israel. Next morning early, Samuel roused his guest, and conveying him on his way towards the skirts of the city, sought, before parting, a private interview—the object of which is narrated in the next chapter.   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Bid the servant pass on before us, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that thou and I may speak privately of the matter of the kingdom; which Samuel hitherto endeavoured to conceal, lest he should be thought now to impose a king upon them as before he denied one to them; and that it might appear by the lot mentioned in the next chapter, that the kingdom was given to Saul by God’s destination, and not by Samuel’s contrivance. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The word of God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. a message delivered to me from God, which now I shall impart to thee. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And as they were going down to the end of the city,.... That end of it that led the way to the place where Saul was going. As this city was built on an hill, going to the end of it was a declivity, a descent: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Samuel said to Saul, bid the servant pass on before us; being another man's servant, he did not choose of himself to bid him go on, but desired his master to order him to go before them, that he might not hear what Samuel had to say to Saul, or see what he did unto him; for as the choice of Saul to be king was to be declared by lot, as coming from the Lord, all those precautions were taken of rising early, and going abroad, and sending the servant before them, that it might not be thought that Samuel did this of himself: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and he passed on; his master bidding him: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "but stand thou still a while; that he might hear the better, and more attentively than in walking; such a posture was most fitting also for what was to be done, anointing him with oil: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that I may show thee the word of God: tell him more of the mind of God concerning his being king, and declare more fully the word, will, and decree of God about that matter, by an action which would put it out of all doubt that he was the man God designed to be king, as in the following chapter. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "that I may show thee the word of God: tell him more of the mind of God concerning his being king, and declare more fully the word, will, and decree of God about that matter, by an action which would put it out of all doubt that he was the man God designed to be king, as in the following chapter. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And as they were going down to the end of the city, Samuel said to Saul, Bid the servant pass on before us,(and he passed on,) but stand thou still a while, that I may shew thee {q} the word of God.(q) God's commandment concerning you.",
        "children": [
          {
            "element": "i",
            "class": "",
            "text": "And",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " as they were going down to the end of the city, Samuel said to Saul, Bid the servant pass on before us,",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "(and he passed on,) but stand thou still a while, that I may shew thee {q} the word of God.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "(q) God's commandment concerning you.",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "\"And they rose up early in the morning: namely, when the morning dawn arose, Samuel called to Saul upon the roof (i.e., he called from below within the house up to the roof, where Saul was probably sleeping upon the balcony; cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 4:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), Get up, I will conduct thee.\" As soon as Saul had risen, \"they both (both Samuel and Saul) went out (into the street).\" And when they had gone down to the extremity of the town, Samuel said to Saul, \"Let the servant pass on before us (and he did so), and do thou remain here for the present; I will show thee a word of God.\" ",
        "children": []
      }
    ]
  }
]