[{"num":7,"verse":"And it came to pass in the fourth year of king Darius, that the word of the Lord came to Zacharias, in the fourth day of the ninth month, which is Casleu."},{"num":2,"verse":"When Sarasar, and Rogommelech, and the men that were with him, sent to the house of God, to entreat the face of the Lord:"},{"num":3,"verse":"To speak to the priests of the house of the Lord of hosts, and to the prophets, saying: Must I weep in the fifth month, or must I sanctify myself as I have now done for many years?"},{"num":4,"verse":"And the word of the Lord of hosts came to me, saying:"},{"num":5,"verse":"Speak to all the people of the land, and to the priests, saying: When you fasted, and mourned in the fifth and the seventh month for these seventy years: did you keep a fast unto me?"},{"num":6,"verse":"And when you did eat and drink, did you not eat for yourselves, and drink for yourselves?"},{"num":7,"verse":"Are not these the words which the Lord spoke by the hand of the former prophets, when Jerusalem as yet was inhabited, and was wealthy, both itself and the cities round about it, and there were inhabitants towards the south, and in the plain?"},{"num":8,"verse":"And the word of the Lord came to Zacharias, saying:"},{"num":9,"verse":"Thus saith the Lord of hosts, saying: Judge ye true judgment, and shew ye mercy and compassion every man to his brother."},{"num":10,"verse":"And oppress not the widow, and the fatherless, and the stranger, and the poor: and let not a man devise evil in his heart against his brother."},{"num":11,"verse":"But they would not hearken, and they turned away the shoulder to depart: and they stopped their ears, not to hear."},{"num":12,"verse":"And they made their heart as the adamant stone, lest they should hear the law, and the words which the Lord of hosts sent in his spirit by the hand of the former prophets: so a great indignation came from the Lord of hosts."},{"num":13,"verse":"And it came to pass that as he spoke, and they heard not: so shall they cry, and I will not hear, saith the Lord of hosts."},{"num":14,"verse":"And I dispersed them throughout all kingdoms, which they know not: and the land was left desolate behind them, so that no man passed through or returned: and they changed the delightful land into a wilderness."}]