[{"header":"A Call for Justice and Mercy"},{"num":7,"verse":"And in the fourth year of King Darius, on the fourth day of the ninth month, Kislev, the word of the Lord came to Zechariah. "},{"num":2,"verse":"Those in Bethel sent Sharezer and Regem-Melek and their men to entreat the graces of the Lord, "},{"num":3,"verse":"saying to the priests and prophets of the house of the Lord of Hosts, “Should I weep and dedicate myself during the fifth month as I have done in these many years?”"},{"num":4,"verse":"Then the word of the Lord came to me, saying: "},{"num":5,"verse":"Say to all the people in the land and to the priests: When you fasted and lamented during the fifth and seventh months for these seventy years, did you really fast for Me? "},{"num":6,"verse":"And when you eat and when you drink, do you not eat and drink for yourselves? "},{"num":7,"verse":"Were these not the very words that the former prophets proclaimed when Jerusalem dwelled with ease along with her surrounding cities, and when the Negev and the Lowland were inhabited?"},{"header":"Punishment for Rejecting God’s Demands"},{"num":8,"verse":"And the word of the Lord came to Zechariah, saying: "},{"num":9,"verse":"Thus says the Lord of Hosts: Execute true justice, show mercy and compassion, every man to his brother. "},{"num":10,"verse":"Do not oppress the widow, orphan, sojourner, or poor. And let none of you contemplate evil deeds in your hearts against his brother."},{"num":11,"verse":"But they refused to pay attention and turned a stubborn shoulder, and stopped their ears so that they should not hear. "},{"num":12,"verse":"They made their hearts hard like a diamond so as not to hear the instruction and words that the Lord of Hosts sent by His Spirit through the former prophets, and there was great anger from the Lord of Hosts."},{"num":13,"verse":"Therefore it happened that as I called, and they would not hear, so they called, and I would not hear, says the Lord of Hosts. "},{"num":14,"verse":"So I scattered them about among all the nations whom they did not know, so the land was left desolate behind them with no one coming or going. And they made a desirable land desolate."}]