[[],[{"type":"header","content":"Hypocritical Fasting Condemned"},{"type":"prose","content":"In the fourth year of King Darius, the word of the  came to Zechariah on the fourth day of the ninth month, which is Chislev. "}],[{"type":"prose","content":"Now the people of Bethel had sent Sharezer and Regem-melech and their men, to entreat the favor of the , "}],[{"type":"prose","content":"and to ask the priests of the house of the  of hosts and the prophets, “Should I mourn and practice abstinence in the fifth month, as I have done for so many years?” "}],[{"type":"prose","content":"Then the word of the  of hosts came to me: "}],[{"type":"prose","content":"Say to all the people of the land and the priests: When you fasted and lamented in the fifth month and in the seventh, for these seventy years, was it for me that you fasted? "}],[{"type":"prose","content":"And when you eat and when you drink, do you not eat and drink only for yourselves? "}],[{"type":"prose","content":"Were not these the words that the  proclaimed by the former prophets, when Jerusalem was inhabited and in prosperity, along with the towns around it, and when the Negeb and the Shephelah were inhabited?"},{"type":"header","content":"Punishment for Rejecting God’s Demands"}],[{"type":"prose","content":"The word of the  came to Zechariah, saying: "}],[{"type":"prose","content":"Thus says the  of hosts: Render true judgments, show kindness and mercy to one another; "}],[{"type":"prose","content":"do not oppress the widow, the orphan, the alien, or the poor; and do not devise evil in your hearts against one another. "}],[{"type":"prose","content":"But they refused to listen, and turned a stubborn shoulder, and stopped their ears in order not to hear. "}],[{"type":"prose","content":"They made their hearts adamant in order not to hear the law and the words that the  of hosts had sent by his spirit through the former prophets. Therefore great wrath came from the  of hosts. "}],[{"type":"prose","content":"Just as, when I called, they would not hear, so, when they called, I would not hear, says the  of hosts, "}],[{"type":"prose","content":"and I scattered them with a whirlwind among all the nations that they had not known. Thus the land they left was desolate, so that no one went to and fro, and a pleasant land was made desolate."}]]