[{"header":"A Song of Praise"},{"num":135,"verse":"Praise the Lord! Praise the name of the Lord! Praise Him, O servants of the Lord, "},{"num":2,"verse":"you who stand in the house of the Lord, within the walls of the house of our God. "},{"num":3,"verse":"Praise the Lord, for the Lord is good. Sing praises to His name, for it is sweet. "},{"num":4,"verse":"For the Lord has chosen Jacob for Himself. Israel belongs to Him."},{"num":5,"verse":"I know that the Lord is great. He is greater than all gods. "},{"num":6,"verse":"The Lord does whatever is pleasing to Him, in heaven and on earth, in the seas and in all waters. "},{"num":7,"verse":"He makes the clouds rise from the ends of the earth. He makes lightning come with the rain. He brings the wind out from where He stores His riches."},{"num":8,"verse":"He killed the first-born of Egypt, both man and animal. "},{"num":9,"verse":"He sent special things to see and did great works among you, O Egypt, against Pharaoh and all his servants. "},{"num":10,"verse":"He crushed many nations and killed powerful kings, "},{"num":11,"verse":"King Sihon of the Amorites, King Og of Bashan, and all the kings of Canaan. "},{"num":12,"verse":"And He gave their land as a gift, a gift to Israel His people. "},{"num":13,"verse":"O Lord, Your name lasts forever. O Lord, You will be remembered for all time. "},{"num":14,"verse":"For the Lord will decide in favor of His people. He will have loving-pity on His servants. "},{"num":15,"verse":"The gods of the nations are silver and gold, made by the hands of men. "},{"num":16,"verse":"They have mouths but they do not speak. They have eyes but they do not see. "},{"num":17,"verse":"They have ears but they do not hear. And there is no breath in their mouths. "},{"num":18,"verse":"Those who make them and those who trust in them will be like them."},{"num":19,"verse":"O house of Israel, give honor and thanks to the Lord. O house of Aaron, give honor and thanks to the Lord. "},{"num":20,"verse":"O house of Levi, give honor and thanks to the Lord. You who fear the Lord, give honor and thanks to the Lord. "},{"num":21,"verse":"Honor and thanks be to the Lord from Zion, Who lives in Jerusalem. Praise the Lord!"}]