[[],[{"type":"prose","content":"Praise ye Jah! Praise ye the name of Jehovah, Praise, ye servants of Jehovah,"}],[{"type":"prose","content":"Who are standing in the house of Jehovah, In the courts of the house of our God."}],[{"type":"prose","content":"Praise ye Jah! for Jehovah [is] good, Sing praise to His name, for [it is] pleasant."}],[{"type":"prose","content":"For Jacob hath Jah chosen for Himself, Israel for His peculiar treasure."}],[{"type":"prose","content":"For I have known that great [is] Jehovah, Yea, our Lord [is] above all gods."}],[{"type":"prose","content":"All that Jehovah pleased He hath done, In the heavens and in earth, In the seas and all deep places,"}],[{"type":"prose","content":"Causing vapours to ascend from the end of the earth, Lightnings for the rain He hath made, Bringing forth wind from His treasures."}],[{"type":"prose","content":"Who smote the first-born of Egypt, From man unto beast."}],[{"type":"prose","content":"He sent tokens and wonders into thy midst, O Egypt, On Pharaoh and on all his servants."}],[{"type":"prose","content":"Who smote many nations, and slew strong kings,"}],[{"type":"prose","content":"Even Sihon king of the Amorite, And Og king of Bashan, And all kingdoms of Canaan."}],[{"type":"prose","content":"And He gave their land an inheritance, An inheritance to Israel His people,"}],[{"type":"prose","content":"O Jehovah, Thy name [is] to the age, O Jehovah, Thy memorial to all generations."}],[{"type":"prose","content":"For Jehovah doth judge His people, And for His servants comforteth Himself."}],[{"type":"prose","content":"The idols of the nations [are] silver and gold, Work of the hands of man."}],[{"type":"prose","content":"A mouth they have, and they speak not, Eyes they have, and they see not,"}],[{"type":"prose","content":"Ears they have, and they give not ear, Nose -- there is no breath in their mouth!"}],[{"type":"prose","content":"Like them are their makers, Every one who is trusting in them."}],[{"type":"prose","content":"O house of Israel, bless ye Jehovah, O house of Aaron, bless ye Jehovah,"}],[{"type":"prose","content":"O house of Levi, bless ye Jehovah, Those fearing Jehovah, bless ye Jehovah."}],[{"type":"prose","content":"Blessed [is] Jehovah from Zion, Inhabiting Jerusalem -- praise ye Jah!"}]]