[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(3) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "This",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e., this with which I am charged",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—the Benjamite’s slander.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "If there be iniquity.—A comparison with 1Samuel 24:12-13, and still more 1Samuel 26:18, shows how closely this psalm is connected with the two notorious instances of David’s magnanimous and generous conduct towards Saul.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "If there be iniquity.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—A comparison with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Samuel 24:12-13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and still more ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Samuel 26:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", shows how closely this psalm is connected with the two notorious instances of David’s magnanimous and generous conduct towards Saul.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 7:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 7:3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "O Lord, if I have done this — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Which Cush and others falsely lay to my charge; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "if there be iniquity in my hands — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "In my actions, the hand being often put for actions whereof it is a great instrument: “David here makes a solemn appeal to God, the searcher of hearts, as judge of his innocence, with regard to the particular crime laid to his charge. Any person, when slandered, may do the same. But Christ only could call upon Heaven to attest his universal uprightness.” — Horne.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "7:1-9 David flees to God for succour. But Christ alone could call on Heaven to attest his uprightness in all things. All His works were wrought in righteousness; and the prince of this world found nothing whereof justly to accuse him. Yet for our sakes, submitting to be charged as guilty, he suffered all evils, but, being innocent, he triumphed over them all. The plea is, For the righteous God trieth the hearts and the reins. He knows the secret wickedness of the wicked, and how to bring it to an end; he is witness to the secret sincerity of the just, and has ways of establishing it. When a man has made peace with God about all his sins, upon the terms of grace and mercy, through the sacrifice of the Mediator, he may, in comparison with his enemies, appeal to God's justice to decide.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "O Lord my God - A solemn appeal to God as to the sincerity and truth of what he was about to say.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "If I have done this - This thing charged upon me, for it is evident that \"Cush,\" whoever he was, had accused him of some wrong thing - some wicked action. What that was can only be learned from what follows, and even this is not very specific. So far as appears, however, it would seem to be that he accused David of bringing evil, in some way, upon one who was at peace with him; that is, of wantonly and without provocation doing him wrong, and of so doing wrong that he had the avails of it in his own possession - some spoil, or plunder, or property, that he had taken from him. The charge would seem to be, that he had made a wanton and unprovoked attack on one who had not injured him, and that he had taken, and had still in his possession, something of value that properly belonged to another. Whether the accuser (Cush) in this referred to himself or to some other person, does not appear clear from the psalm; but as he was filled with rage, and as the life of David was endangered by him, it would seem most probable that the reference was to himself, and that he felt he had been personally wronged. The design of David, in the passage now before us, is to deny this charge altogether. This he does in the most explicit manner, by saying that this was so far from being true, that he had, on the contrary, delivered the life of him that was his enemy, and by adding that, if this were so, he would be willing that the injured man should persecute and oppose him, and even trample his life down to the earth.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "If there be iniquity in my hands - That is, if there is the iniquity referred to; or, in other words, if he had in his possession what had been wrongfully taken from another, to wit, as appears, from this \"Cush\" who now accused him. The word \"iniquity\" here denotes an \"unjust possession\" - a property that had been unjustly taken from another; and, as remarked above, the slanderous charge would seem to have been, that he had taken that property from some one who was at peace with him, and that he retained it contrary to justice. This charge David means peremptorily to deny. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "If there be iniquity in my hands - That is, if there is the iniquity referred to; or, in other words, if he had in his possession what had been wrongfully taken from another, to wit, as appears, from this \"Cush\" who now accused him. The word \"iniquity\" here denotes an \"unjust possession\" - a property that had been unjustly taken from another; and, as remarked above, the slanderous charge would seem to have been, that he had taken that property from some one who was at peace with him, and that he retained it contrary to justice. This charge David means peremptorily to deny. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3. if I have done this—that is, the crime charged in the \"words of Cush\" (compare 1Sa 24:9).",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "The Treasury of David",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3 O Lord my God, if I have done this; if there be iniquity in my hands;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "4 If I have rewarded evil unto him that was at peace with me; (yea, I have delivered him that without cause is mine enemy:)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "5 Let the enemy persecute my soul, and take it; yea, let him tread down my life upon the earth, and lay mine honour in the dust. Selah.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The second part of this wandering hymn contains a protestation of innocence, and an invocation of wrath upon his own head, if he were not clear from the evil imputed to him. So far from hiding treasonable intentions in his hands, or ungratefully requiting the peaceful deeds of a friend, he had even suffered his enemy to escape when he had him completely in his power. Twice had he spared Saul's life; once in the cave of Adullam, and again when he found him sleeping in the midst of his slumbering camp; he could, therefore, with a clear conscience, make his appeal to heaven. He needs not fear the curse whose soul is clear of guilt. Yet is the imprecation a most solemn one, and only justifiable through the extremity of the occasion, and the nature of the dispensation under which the Psalmist lived. We are commanded by our Lord Jesus to let our yea be yea, and our nay, nay; \"for whatsoever is more than this cometh of evil.\" If we cannot be believed on our word, we are surely not to be trusted on our oath; for to a true Christian his simple word is as binding as another man's oath. Especially beware, O unconverted men! of trifling with solemn imprecations. Remember the woman at Devizes, Who wished she might die if she had not paid her share in a joint purchase, and who fell dead there and then with the money in her hand.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Selah. David enhances the solemnity of this appeal to the dread tribunal of God by the use of the usual pause.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "From these verses we may learn that no innocence can shield a man from the calumnies of the wicked. David had been scrupulously careful to avoid any appearance of rebellion against Saul, whom he constantly styled \"the Lord's anointed;\" but all this could not protect him from lying tongues. As the shadow follows the substance, so envy pursues goodness. It is only at the tree laden with fruit that men throw stones. If we would live without being slandered we must wait till we get to heaven. Let us be very heedful not to believe the flying rumours which are always harassing gracious men. If there are no believers in lies there will be but a dull market in falsehood, and good men's characters will be safe. Ill-will never spoke well. Sinners have an ill-will to saints, and therefore, be sure they will not speak well of them. ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "If I have done this, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. that which Cush and others falsely lay to my charge. If I design or have endeavoured to take away Saul’s crown and life by violence, as Saul’s courtiers maliciously reported, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1 Samuel 24:9,10 26:19",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 24:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",10 26:19",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "In my hands, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. in my actions or carriage towards Saul. The ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "hand",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is oft put for ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "actions",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", whereof the hand is a great and common instrument, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 78:42 109:27 Jonah 3:8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 78:42",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 109:27 ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jonah 3:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". If I design or have attempted to lay violent hands upon Saul. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "O Lord my God, if I have done this. The crime which Saul and his courtiers charged him with, and which was made so public that every body knew it; and therefore it was needless particularly to mention it; namely, that he lay in wait for Saul, and sought his life to take it away, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 24:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Targum interprets it of this psalm, paraphrasing it, \"if I have made this song with an evil intention\"; to give an ill character of any, and lead them with false charges; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "if there be iniquity in my hands; not that he was without sin, he had it in his heart; nor that he lived without the actual commission of sin: but his sense is, that there was no iniquity, as not in his heart, purpose, and design, so not in his hand, nor attempted by him, of the kind he was accused of, 1 Samuel 24:11. Otherwise, we often hear him complaining of the depravity of his nature, and acknowledging his sins and transgressions, Psalm 32:5. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "if there be iniquity in my hands; not that he was without sin, he had it in his heart; nor that he lived without the actual commission of sin: but his sense is, that there was no iniquity, as not in his heart, purpose, and design, so not in his hand, nor attempted by him, of the kind he was accused of, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 24:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Otherwise, we often hear him complaining of the depravity of his nature, and acknowledging his sins and transgressions, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 32:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "O LORD my God, if I have done {b} this; if there be iniquity in my hands;",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "O LORD my God, if I have done ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{b}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " this; if there be iniquity in my hands;",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) With which Cush charges me.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "if I have done this",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ‘This’ refers to the crimes of which he was falsely accused by Cush, and is further explained in the two following lines.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "if there be iniquity in my hands",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Wrong as the opposite of right: what is crooked and distorted: a different word from that used in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Psalm 7:14",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 7:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 5:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Compare the closely similar language of David’s protest in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 24:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “Know thou and see that there is neither evil nor transgression in mine hand:” and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 26:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “What have I done? or what evil is in mine hand?”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "3–5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The appeal for help is supported by a solemn protestation of innocence. If he is guilty of the crimes laid to his charge, may he be surrendered to the utmost fury of his enemies.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 3.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "O Lord my God, if I have done this",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " \"this which is laid to my charge.\" The general charge against David in Saul's lifetime was that he \"sought the king's hurt\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 24:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Afterwards he was accused of being \"a bloody man\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 16:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") - the death of Ishbosheth, and perhaps of others, being regarded as his work. If there be iniquity in my hands. If, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", I have committed any criminal act, if any definite offence can be charged against me. Human weakness and imperfection David does not mean to deny, but, like Job, he maintains in a certain qualified sense his righteousness. Psalm 7:3",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(Heb.: 7:4-6) According to the inscription זאת points to the substance of those slanderous sayings of the Benjamite. With בּכפּי אם־ישׁ־עול one may compare David's words to Saul אין בּידי רעה   ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 24:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 26:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and from this comparison one will at once see in a small compass the difference between poetical and prose expression. שׁלמי (Targ. לבעל שׁלמי) is the name he gives (with reference to Saul) to him who stands on a peaceful, friendly footing with him, cf. the adject. שׁלום, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 55:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and אישׁ שׁלום, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 41:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The verb גּמל, cogn. גּמר, signifies originally to finish, complete, (root גם, כם ,גם t, cf. כּימה to be or to make full, to gather into a heap). One says טּוב גּמל and גּמל רע, and also without a material object גּמל עלי or גּמלני benefecit or malefecit mihi. But we join גּמלתּי with רע according to the Targum and contrary to the accentuation, and not with שׁלמי (Olsh., Bttch., Hitz.), although שׁלם beside משׁלּם, as e.g., דּבר beside מדבּר might mean \"requiting.\" The poet would then have written: אם שׁלּמתּי גּמלי רע i.e., if I have retaliated upon him that hath done evil to me. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 7:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " we do not render it according the meaning to הלּץ which is usual elsewhere: but rather I rescued... (Louis de Dieu, Ewald 345, a, and Hupfeld). Why cannot הלּץ in accordance with its primary signification expedire, exuere (according to which even the signification of rescuing, taken exactly, does not proceed from the idea of drawing out, but of making loose, exuere vinclis) signify here exuere  equals  spoliare, as it does in Aramaic? And how extremely appropriate it is as an allusion to the incident in the cave, when David did not rescue Saul, but, without indeed designing to take חליצה, exuviae, cut off the hem of his garment! As Hengstenberg observes, \"He affirms his innocence in the most general terms, thereby showing that his conduct towards Saul was not anything exceptional, but sprang from his whole disposition and mode of action.\" On the 1 pers. fut. conv. and ah, vid., on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 3:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ריקם belongs to צוררי, like ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 25:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 69:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In the apodosis, Psalm 7:6, the fut. Kal of רדף is made into three syllables, in a way altogether without example, since, by first making the Sheb audible, from ירדּף it is become ירדף (like יצחק Genesis 21:6, תּהלך Psalm 73:9; Exodus 9:23, שׁמעה Psalm 39:13), and this is then sharpened by an euphonic Dag. forte.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In the apodosis, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 7:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the fut. Kal of רדף is made into three syllables, in a way altogether without example, since, by first making the Sheb audible, from ירדּף it is become ירדף (like יצחק ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 21:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", תּהלך ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 73:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 9:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", שׁמעה ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 39:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and this is then sharpened by an euphonic Dag. forte.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: The Dag. is of the same kind as the Dag. in גּמלּים among nouns; Arabic popular dialect farassı̂ (my horse), vid., Wetzstein's Inshriften S. 366.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Other ways of explaining it, as that by Cahjg  equals  יתרדף, or by Kimchi as a mixed form from Kal and Piel,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Pinsker's view, that the pointing ירדף is designed to leave the reader at liberty to choose between the reading ירדּף and ירדּף, cannot be supported. There are no safe examples for the supposition that the variations of tradition found expression in this way.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "have been already refuted by Baer, Thorath Emeth, p. 33. This dactylic jussive form of Kal is followed by the regular jussives of Hiph. ישּׂג and ישׁכּן. The rhythm is similar so that in the primary passage Exodus 15:9, which also finds its echo in Psalm 18:38, - viz. iambic with anapaests inspersed. By its parallelism with נפשׁי and חיּי, כּבודי acquires the signification \"my soul,\" as Saadia, Gecatilia and Aben-Ezra have rendered it - a signification which is secured to it by Psalm 16:9; Psalm 30:13; Psalm 57:9; Psalm 108:2, Genesis 49:6. Man's soul is his doxa, and this it is as being the copy of the divine doxa (Bibl. Psychol. S. 98, [tr. p. 119], and frequently). Moreover, \"let him lay in the dust\" is at least quite as favourable to this sense of כבודי as to the sense of personal and official dignity (Psalm 3:4; Psalm 4:3). To lay down in the dust is equivalent to: to lay in the dust of death, Psalm 22:16. שׁכני עפר, Isaiah 26:19, are the dead. According to the biblical conception the soul is capable of being killed (Numbers 35:11), and mortal (Numbers 23:10). It binds spirit and body together and this bond is cut asunder by death. David will submit willingly to death in case he has ever acted dishonourably.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "have been already refuted by Baer, Thorath Emeth, p. 33. This dactylic jussive form of Kal is followed by the regular jussives of Hiph. ישּׂג and ישׁכּן. The rhythm is similar so that in the primary passage ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 15:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", which also finds its echo in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 18:38",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", - viz. iambic with anapaests inspersed. By its parallelism with נפשׁי and חיּי, כּבודי acquires the signification \"my soul,\" as Saadia, Gecatilia and Aben-Ezra have rendered it - a signification which is secured to it by ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 16:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 30:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 57:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 108:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 49:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Man's soul is his doxa, and this it is as being the copy of the divine doxa (Bibl. Psychol. S. 98, [tr. p. 119], and frequently). Moreover, \"let him lay in the dust\" is at least quite as favourable to this sense of כבודי as to the sense of personal and official dignity (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 3:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 4:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). To lay down in the dust is equivalent to: to lay in the dust of death, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 22:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". שׁכני עפר, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 26:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", are the dead. According to the biblical conception the soul is capable of being killed (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 35:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and mortal (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 23:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). It binds spirit and body together and this bond is cut asunder by death. David will submit willingly to death in case he has ever acted dishonourably.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Here the music is to strike up, in order to give intensity to the expression of this courageous confession. In the next strophe is affirmation of innocence rises to a challenging appeal to the judgment-seat of God and a prophetic certainty that that judgment is near at hand. ",
        "children": []
      }
    ]
  }
]