[{"num":5,"verse":"Therefore, I have a request for the elders among you. (I ask this as a fellow elder and a witness of Christ’s sufferings, and as one who shares in the glory that is about to be revealed.) I urge the elders:"},{"num":2,"verse":"Like shepherds, tend the flock of God among you. Watch over it. Don’t shepherd because you must, but do it voluntarily for God. Don’t shepherd greedily, but do it eagerly."},{"num":3,"verse":"Don’t shepherd by ruling over those entrusted to your care, but become examples to the flock."},{"num":4,"verse":"And when the chief shepherd appears, you will receive an unfading crown of glory."},{"num":5,"verse":"In the same way, I urge you who are younger: accept the authority of the elders. And everyone, clothe yourselves with humility toward each other. God stands against the proud, but he gives favor to the humble."},{"num":6,"verse":"Therefore, humble yourselves under God’s power so that he may raise you up in the last day."},{"num":7,"verse":"Throw all your anxiety onto him, because he cares about you."},{"num":8,"verse":"Be clearheaded. Keep alert. Your accuser, the devil, is on the prowl like a roaring lion, seeking someone to devour."},{"num":9,"verse":"Resist him, standing firm in the faith. Do so in the knowledge that your fellow believers are enduring the same suffering throughout the world."},{"num":10,"verse":"After you have suffered for a little while, the God of all grace, the one who called you into his eternal glory in Christ Jesus, will himself restore, empower, strengthen, and establish you."},{"num":11,"verse":"To him be power forever and always. Amen."},{"header":"Final greeting"},{"num":12,"verse":"I have written and sent these few lines to you by Silvanus. I consider him to be a faithful brother. In these lines I have urged and affirmed that this is the genuine grace of God. Stand firm in it."},{"num":13,"verse":"The fellow-elect church in Babylon greets you, and so does my son Mark."},{"num":14,"verse":"Greet each other with the kiss of love. Peace to you all who are in Christ."}]