[{"header":"The Flock of God"},{"num":5,"verse":"I, who am an elder myself, appeal to the church elders among you. I am a witness of Christ's sufferings, and I will share in the glory that will be revealed. I appeal to you "},{"num":2,"verse":"to be shepherds of the flock that God gave you and to take care of it willingly, as God wants you to, and not unwillingly. Do your work, not for mere pay, but from a real desire to serve. "},{"num":3,"verse":"Do not try to rule over those who have been put in your care, but be examples to the flock. "},{"num":4,"verse":"And when the Chief Shepherd appears, you will receive the glorious crown which will never lose its brightness."},{"num":5,"verse":"In the same way you younger people must submit yourselves to your elders. And all of you must put on the apron of humility, to serve one another; for the scripture says, “God resists the proud, but shows favor to the humble.” "},{"num":6,"verse":"Humble yourselves, then, under God's mighty hand, so that he will lift you up in his own good time. "},{"num":7,"verse":"Leave all your worries with him, because he cares for you."},{"num":8,"verse":"Be alert, be on watch! Your enemy, the Devil, roams around like a roaring lion, looking for someone to devour. "},{"num":9,"verse":"Be firm in your faith and resist him, because you know that other believers in all the world are going through the same kind of sufferings. "},{"num":10,"verse":"But after you have suffered for a little while, the God of all grace, who calls you to share his eternal glory in union with Christ, will himself perfect you and give you firmness, strength, and a sure foundation. "},{"num":11,"verse":"To him be the power forever! Amen."},{"header":"Final Greetings"},{"num":12,"verse":"I write you this brief letter with the help of Silas, whom I regard as a faithful Christian. I want to encourage you and give my testimony that this is the true grace of God. Stand firm in it."},{"num":13,"verse":"Your sister church in Babylon, also chosen by God, sends you greetings, and so does my son Mark. "},{"num":14,"verse":"Greet one another with the kiss of Christian love."}]