[{"num":5,"verse":"¶ The elders who are among you I exhort (I am also an elder with them and a witness of the afflictions of the Christ, and also a participant of the glory that shall be revealed)."},{"num":2,"verse":"Feed the flock of God which is among you, caring for her, not by force, but willingly; not for shameful lucre, but with willing desire;"},{"num":3,"verse":"and not as having lordship over the heritage of the Lord, but in such a manner as to be examples of the flock."},{"num":4,"verse":"And when the great Prince of the pastors shall appear, ye shall receive the incorruptible crown of glory."},{"num":5,"verse":"¶ Likewise, young people, be subject to the elders in such a manner that you are all subject to one another. Be clothed with humility of will, for God resists the proud and gives grace to the humble."},{"num":6,"verse":"Humble yourselves, therefore, under the mighty hand of God, that he may exalt you in due time,"},{"num":7,"verse":"casting all your cares upon him, for he cares for you."},{"num":8,"verse":"¶ Be temperate and vigilant because your adversary the devil, as a roaring lion, walks about, seeking whom he may devour,"},{"num":9,"verse":"resist him steadfast in the faith, knowing that the same afflictions are to be accomplished in the company of your brethren that are in the world."},{"num":10,"verse":"¶ But the God of all grace, who has called us unto his eternal glory by Jesus, the Christ, after ye have suffered a little while, he himself perfects, confirms, strengthens, and establishes you."},{"num":11,"verse":"To him be glory and dominion for ever and ever. Amen."},{"num":12,"verse":"By Silvanus, a faithful brother; (according to my reckoning), I have written briefly, exhorting, and testifying that this is the true grace of God in which ye stand."},{"num":13,"verse":"Those here at Babylon, chosen together with you, salute you and so does Mark, my son."},{"num":14,"verse":"Greet one another with a kiss of charity. Peace be with you all that are in Jesus, the Christ. Amen."}]