[{"header":"The Flock of God"},{"num":5,"verse":"Now I have something to say to the elders in your group. I also am an elder. I have seen Christ’s sufferings, and I will share in the glory that will be shown to us. I beg you to "},{"num":2,"verse":"shepherd God’s flock, for whom you are responsible. Watch over them because you want to, not because you are forced. That is how God wants it. Do it because you are happy to serve, not because you want money. "},{"num":3,"verse":"Do not be like a ruler over people you are responsible for, but be good examples to them. "},{"num":4,"verse":"Then when Christ, the Chief Shepherd, comes, you will get a glorious crown that will never lose its beauty."},{"num":5,"verse":"In the same way, younger people should be willing to be under older people. And all of you should be very humble with each other."},{"num":6,"verse":"Be humble under God’s powerful hand so he will lift you up when the right time comes. "},{"num":7,"verse":"Give all your worries to him, because he cares about you."},{"num":8,"verse":"Control yourselves and be careful! The devil, your enemy, goes around like a roaring lion looking for someone to eat. "},{"num":9,"verse":"Refuse to give in to him, by standing strong in your faith. You know that your Christian family all over the world is having the same kinds of suffering."},{"num":10,"verse":"And after you suffer for a short time, God, who gives all grace, will make everything right. He will make you strong and support you and keep you from falling. He called you to share in his glory in Christ, a glory that will continue forever. "},{"num":11,"verse":"All power is his forever and ever. Amen."},{"header":"Final Greetings"},{"num":12,"verse":"I wrote this short letter with the help of Silas, who I know is a faithful brother in Christ. I wrote to encourage you and to tell you that this is the true grace of God. Stand strong in that grace."},{"num":13,"verse":"The church in Babylon, who was chosen like you, sends you greetings. Mark, my son in Christ, also greets you. "},{"num":14,"verse":"Give each other a kiss of Christian love when you meet."}]