[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(14) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Was gone up",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e., was drawn up by the heat of the sun.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "A small round thing, as small as the hoar frost.—What the manna was has been much disputed. There are two natural substances, quite distinct, with which it has been compared, and by some persons identified. One is a deposit from the air, which falls indifferently on trees, stones, grass, &c, and is generally thick and sticky, like honey, but under certain circumstances is “concreted into small granular masses.” This bas been described by Aristotle (Hist. An., v. 22), Pliny (H. N., xi. 12), Avicenna(p. 212), Ǽlian (Hist. An., xv. 7), Shaw, Forskal, and others. It has been called ὰερόμελι or “air-honey” (Athen. Deipn, xi., p. 500). It is collected by the Arabs, and eaten with their unleavened cakes as a condiment. It so far resembles the manna that it comes with the dew, is spread upon the ground generally, and melts when the sun’s rays attain a certain power (Œdmann: Misc. Collect., vol. iv., p. 7). But it is never found in large quantities; it does not fall for more than two months in the year; and it is wholly unfit to serve as man’s principal food, being more like honey than anything else. The other substance is a gum which exudes from certain trees at certain seasons of the year, in consequence of the punctures made in their leaves by a small insect, the Coccus manniparus. It has been described at length by C. Niebuhr in his Description de l’ Arabie (pp. 128, 129); by Rauwolf (Travels, vol. I., p. 94); Gmelin (Travels through Russia to Persia, Part III., p. 28), and others. It is comparatively a dry substance, is readily shaken from the leaves, and consists of small yellowish – white grains, which are hard, and have been compared to coriander seed by moderns (Rauwolf, 50s.100). The name “manna” attaches in the East to this latter substance, which is employed both as a condiment, like the “air-honey,” and also as a laxative. The special points in which it differs from the manna of Scripture are its confinement to certain trees or bushes, its comparative permanency, for it “accumulates on the leaves” (Niebuhr, p. 129), and its unfitness for food. It has also, like the “air-honey,” only a short season—the months of July and August.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "A small round thing, as small as the hoar ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "frost.—What the manna was has been much disputed. There are two natural substances, quite distinct, with which it has been compared, and by some persons identified. One is a deposit from the air, which falls indifferently on trees, stones, grass, &c, and is generally thick and sticky, like honey, but under certain circumstances is “concreted into small granular masses.” This bas been described by Aristotle (",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Hist. An., v. ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "22), Pliny (",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "H. N., xi.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 12), Avicenna(p. 212), Ǽlian (",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Hist. An., xv.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 7), Shaw, Forskal, and others. It has been called ",
            "children": []
          },
          {
            "element": "span",
            "class": "greekheb",
            "text": "ὰερόμελι",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " or “air-honey” (Athen. ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Deipn, xi.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", p. 500). It is collected by the Arabs, and eaten with their unleavened cakes as a condiment. It so far resembles the manna that it comes with the dew, is spread upon the ground generally, and melts when the sun’s rays attain a certain power (Œdmann: ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Misc. Collect., ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "vol. iv., p. 7). But it is never found in large quantities; it does not fall for more than two months in the year; and it is wholly unfit to serve as man’s principal food, being more like honey than anything else. The other substance is a gum which exudes from certain trees at certain seasons of the year, in consequence of the punctures made in their leaves by a small insect, the ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Coccus manniparus. ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "It has been described at length by C. Niebuhr in his ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Description de l’ Arabie ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "(pp. 128, 129); by Rauwolf (",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Travels, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "vol. I., p. 94); Gmelin (",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Travels through Russia to Persia, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Part III., p. 28), and others. It is comparatively a dry substance, is readily shaken from the leaves, and consists of small yellowish – white grains, which are hard, and have been compared to coriander seed by moderns (Rauwolf, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "50s.100",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ")",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "The name “manna” attaches in the East to this latter substance, which is employed both as a condiment, like the “air-honey,” and also as a laxative. The special points in which it differs from the manna of Scripture are its confinement to certain trees or bushes, its comparative permanency, for it “accumulates on the leaves” (Niebuhr, p. 129), and its unfitness for food. It has also, like the “air-honey,” only a short season—the months of July and August.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The manna of Scripture in certain respects resembles the one, and in certain other respects the other of these substances, but in its most important characteristics resembles neither, and is altogether sui generis. For (1) it was adapted to be men’s principal nourishment, and served the Israelites as such for forty years; (2) it was supplied in quantities far exceeding anything that is recorded of the natural substances compared with it; (3) it continued through the whole of the year; (4) for forty years it fell regularly for six nights following, and ceased upon the seventh night; (5) it “bred worms” if kept to a second day, when gathered on five days out of the six, but when gathered on the sixth day continued good throughout the seventh, and bred no worms. The manna of Scripture must therefore be regarded as a miraculous substance, created ad hoc, and not as a natural product. It pleased the Creator, however, to proceed on the lines of Nature, so to speak, and to assimilate His new to certain of His old creations.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The manna of Scripture in certain respects resembles the one, and in certain other respects the other of these substances, but in its most important characteristics resembles neither, and is altogether ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "sui generis. ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "For (1) it was adapted to be men’s principal nourishment, and served the Israelites as such for forty years; (2) it was supplied in quantities far exceeding anything that is recorded of the natural substances compared with it; (3) it continued through the whole of the year; (4) for forty years it fell regularly for six nights following, and ceased upon the seventh night; (5) it “bred worms” if kept to a second day, when gathered on five days out of the six, but when gathered on the sixth day continued good throughout the seventh, and bred no worms. The manna of Scripture must therefore be regarded as a miraculous substance, created ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "ad hoc, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "and not as a natural product. It pleased the Creator, however, to proceed ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "on the lines ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "of Nature, so to speak, and to assimilate His new to certain of His old creations.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Exodus 16:14",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 16:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "When the dew was gone up — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "To wit, into the air; or was vanished, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "there lay a small round thing — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "According to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 11:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", there was a dew which fell before the manna; for it is said, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "when the dew fell in the night, the manna fell upon it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "But it appears here, that there was also a dew upon it, which went up when the sun rose. So that the manna lay as it were enclosed. This might be designed to keep it pure and clean.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "16:13-21 At evening the quails came up, and the people caught with ease as many as they needed. The manna came down in dew. They called it Manna, Manhu, which means, What is this? It is a portion; it is that which our God has allotted us, and we will take it, and be thankful. It was pleasant food; it was wholesome food. The manna was rained from heaven; it appeared, when the dew was gone, as a small round thing, as small as the hoar frost, like coriander seed, in colour like pearls. The manna fell only six days in the week, and in double quantity on the sixth day; it bred worms and became offensive if kept more than one day, excepting on the sabbath. The people had never seen it before. It could be ground in a mill, or beaten in a mortar, and was then made into cakes and baked. It continued the forty years the Israelites were in the wilderness, wherever they went, and ceased when they arrived in Canaan. All this shows how different it was from any thing found before, or found now. They were to gather the manna every morning. We are hereby taught, 1. To be prudent and diligent in providing food for ourselves and our households; with quietness working, and eating our own bread, not the bread of idleness or deceit. God's bounty leaves room for man's duty; it did so even when manna was rained; they must not eat till they have gathered. 2. To be content with enough. Those that have most, have for themselves but food and raiment; those that have least, generally have these; so that he who gathers much has nothing over, and he who gathers little has no lack. There is not such a disproportion between one and another in the enjoyment of the things of this life, as in the mere possession of them. 3. To depend upon Providence: let them sleep quietly, though they have no bread in their tents, nor in all their camp, trusting that God, with the following day, would bring them in their daily bread. It was surer and safer in God's storehouse than their own, and would come thence sweeter and fresher. See here the folly of hoarding. The manna laid up by some, who thought themselves wiser, and better managers, than their neighbours, and who would provide lest it should fail next day, bred worms, and became good for nothing. That will prove to be most wasted, which is covetously and distrustfully spared. Such riches are corrupted, Jas 5:2,3. The same wisdom, power, and goodness that brought food daily from above for the Israelites in the wilderness, brings food yearly out of the earth in the constant course of nature, and gives us all things richly to enjoy.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Quails - This bird migrates in immense numbers in spring from the south: it is nowhere more common than in the neighborhood of the Red Sea. In this passage we read of a single flight so dense that it covered the encampment. The miracle consisted in the precise time of the arrival and its coincidence with the announcement. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13-31. at even the quails came up, and covered the camp—This bird is of the gallinaceous kind [that is, relating to the order of heavy-bodied, largely terrestrial birds], resembling the red partridge, but not larger than the turtledove. They are found in certain seasons in the places through which the Israelites passed, being migratory birds, and they were probably brought to the camp by \"a wind from the Lord\" as on another occasion (Nu 11:31).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and in the morning … a small round thing … manna—There is a gum of the same name distilled in this desert region from the tamarisk, which is much prized by the natives, and preserved carefully by those who gather it. It is collected early in the morning, melts under the heat of the sun, and is congealed by the cold of night. In taste it is as sweet as honey, and has been supposed by distinguished travellers, from its whitish color, time, and place of its appearance, to be the manna on which the Israelites were fed: so that, according to the views of some, it was a production indigenous to the desert; according to others, there was a miracle, which consisted, however, only in the preternatural arrangements regarding its supply. But more recent and accurate examination has proved this gum of the tarfa-tree to be wanting in all the principal characteristics of the Scripture manna. It exudes only in small quantities, and not every year; it does not admit of being baked (Nu 11:8) or boiled (Ex 16:23). Though it may be exhaled by the heat and afterwards fall with the dew, it is a medicine, not food—it is well known to the natives of the desert, while the Israelites were strangers to theirs; and in taste as well as in the appearance of double quantity on Friday, none on Sabbath, and in not breeding worms, it is essentially different from the manna furnished to the Israelites.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "When the dew was gone up, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to wit, into the air; or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "was vanished",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ascend",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is used ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Jeremiah 48:15",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 48:15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And when the dew that lay was gone up,.... Exhaled by the sun upon the rising of it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "behold, upon the face of the wilderness; upon the surface of it, all around the camp of Israel: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "there lay a small round thing, as small as the hoar frost on the ground; which is what is in the next verse called \"manna\". Before the sun rose there was nothing but a dew to be seen; when that was gone off through the force of the sun, then the manna appeared; which was but a \"small thing\", and very unpromising for food, and especially for such a vast number of people; and a \"round\" thing, for which it is after compared to a coriander seed, as is thought; though the Targums of Onkelos and Jonathan do not interpret the word of the round form, but rather refer to its smallness; and which is expressed in the Vulgate Latin version,\"small, and as if beat with a pestle;''and for its white colour, as well as its smallness, it looked like hoar frost on the ground. Jarchi says there were two dews, within which it lay as something covered in a box, and he seems to be right; for it is certain from Numbers 11:9, that there was a dew which fell first, and then the manna fell upon it; and from hence it is plain also, that there was a dew over the manna, which went up from it when the sun rose: and the design of this seems to be to keep this heavenly bread pure and clean for the Israelites, that it might neither partake of the dust nor sand of the wilderness where it fell, and that nothing might light upon it until the time of gathering it came. The Jews, in memory of this, will sometimes put bread upon the table between two table cloths (n); and it is highly probable, that to this the allusion is of the \"hidden manna\" in Revelation 2:17, by which is meant our Lord Jesus Christ, the antitype of this manna, as will be observed as we pass on, in all the circumstances of it; the manna came with the dew, and was covered with it, and hid in it; Christ is the gift of God's free grace to the sons of men, and is exhibited in the word of grace, where he lies hid to men in the glory of his person and the fulness of his grace, until revealed and made known. The figure of the manna being \"round\", which is a perfect figure, may denote the perfection of Christ in his person, natures, and office; he being perfectly God and perfectly man, having all the essential perfections both of the divine and human natures in him, as well as all fulness of grace; and being made perfect through sufferings, is become a complete Saviour, and by his blood, righteousness, and sacrifice, has perfected for ever his sanctified ones: and the manna being \"small\", may signify the meanness of Christ in the eyes of men in his state of humiliation, and the unpromising appearance he made of being the Saviour and King of Israel; the white colour of it may direct to the purity of Christ, to the holiness of his natures, and the beauty of his person, being white and ruddy, the chiefest among ten thousands. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "there lay a small round thing, as small as the hoar frost on the ground; which is what is in the next verse called \"manna\". Before the sun rose there was nothing but a dew to be seen; when that was gone off through the force of the sun, then the manna appeared; which was but a \"small thing\", and very unpromising for food, and especially for such a vast number of people; and a \"round\" thing, for which it is after compared to a coriander seed, as is thought; though the Targums of Onkelos and Jonathan do not interpret the word of the round form, but rather refer to its smallness; and which is expressed in the Vulgate Latin version,\"small, and as if beat with a pestle;''and for its white colour, as well as its smallness, it looked like hoar frost on the ground. Jarchi says there were two dews, within which it lay as something covered in a box, and he seems to be right; for it is certain from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 11:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", that there was a dew which fell first, and then the manna fell upon it; and from hence it is plain also, that there was a dew over the manna, which went up from it when the sun rose: and the design of this seems to be to keep this heavenly bread pure and clean for the Israelites, that it might neither partake of the dust nor sand of the wilderness where it fell, and that nothing might light upon it until the time of gathering it came. The Jews, in memory of this, will sometimes put bread upon the table between two table cloths (n); and it is highly probable, that to this the allusion is of the \"hidden manna\" in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 2:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", by which is meant our Lord Jesus Christ, the antitype of this manna, as will be observed as we pass on, in all the circumstances of it; the manna came with the dew, and was covered with it, and hid in it; Christ is the gift of God's free grace to the sons of men, and is exhibited in the word of grace, where he lies hid to men in the glory of his person and the fulness of his grace, until revealed and made known. The figure of the manna being \"round\", which is a perfect figure, may denote the perfection of Christ in his person, natures, and office; he being perfectly God and perfectly man, having all the essential perfections both of the divine and human natures in him, as well as all fulness of grace; and being made perfect through sufferings, is become a complete Saviour, and by his blood, righteousness, and sacrifice, has perfected for ever his sanctified ones: and the manna being \"small\", may signify the meanness of Christ in the eyes of men in his state of humiliation, and the unpromising appearance he made of being the Saviour and King of Israel; the white colour of it may direct to the purity of Christ, to the holiness of his natures, and the beauty of his person, being white and ruddy, the chiefest among ten thousands. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(n) Vid. Fagium in loc. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(n) Vid. Fagium in loc. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And when the dew that lay was gone up, behold, upon the face of the wilderness there lay a small round thing, as small as the hoar frost on the ground.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Hebrews conceived dew to fall from heaven (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 33:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 33:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 3:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "al.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); and the manna falls with it (so ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 11:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "): cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "v.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " 4, where it is said to be rained ‘from heaven.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "thin flake",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (RVm.)] properly, it seems, from the Arabic, ‘a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thin scab",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "scale-like thing",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "’ (see Di., and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Lex.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The word is a peculiar one, and occurs only here: but ‘round’ (Saad., Kimchi, EVV.) has no philological support.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 14.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "When the dew that lay was gone",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "up.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The moisture which lay upon the herbage soon evaporated, drawn up by the sun; and then the miracle revealed itself. There remained upon each leaf and each blade of grass a delicate small substance, compared here to ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "hoar frost",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and elsewhere (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 11:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") to \"coriander seed,\" which was easily detached and collected in bags or baskets. The thing was altogether a novelty to the Israelites, though analogous in some degree to natural processes still occurring in the country. These processes are of two kinds. At certain times of the year there is a deposit of a glutinous substance from the air upon leaves and even upon stones, which may be scraped off, and which resembles thick honey. There is also an exudation from various trees and shrubs, especially the tamarisk, which is moderately hard, and is found both on the growing plant and on the fallen leaves beneath it, in the shape of small, round, white or greyish grains. It is this last which is the manna of commerce. The Biblical manna cannot be identified with either of these two substances.  In some points it resembled the one, in other points the other; in some, it differed from both. It came out of the air like the \"air-honey,\" and did not exude from shrubs; but it was hard, like the manna of commerce, and could be \"ground in mills\" and \"beaten in mortars,\" which the \"air-honey\" cannot. It was not a medicament, like the one, nor a condiment, like the other, but a substance suited to be a substitute for bread, and to become the main sustenance of the Israelitish people. It was produced in quantities far exceeding anything that is recorded of either manna proper, or air honey. It accompanied the Israelites wherever they went during the space of forty years, whereas the natural substances, which in certain points resemble it, are confined to certain districts, and to certain seasons of the year. During the whole space of forty years it fell regularly during six consecutive days, and then ceased on the seventh. It \"bred worms\" if kept till the morrow on all days of the week except one; on that one - the Sabbath - it bred no worms, but was sweet and good. Thus, it must be regarded as a peculiar substance, miraculously created for a special purpose, but similar in certain respects to certain known substances which are still produced in the Sinaitic region. Exodus 16:14",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The same evening (according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 16:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"between the two evenings,\" vid., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 12:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") quails came up and covered the camp. עלה: to advance, applied to great armies. השּׂלו, with the article indicating the generic word, and used in a collective sense, are quails, ὀρτυγομήτρα (lxx); i.e., the quail-king, according to Hesychius ὄρτυξ ὑπερμεγέθης, and Phot. ὄρτυξ μέγας, hence a large species of quails, ὄρτυγες (Josephus), coturnices (Vulg.). Some suppose it to be the Kat or the Arabs, a kind of partridge which is found in great abundance in Arabia, Palestine, and Syria. These fly in such dense masses that the Arab boys often kill two or three at a time, by merely striking at them with a stick as they fly (Burckhardt, Syr. p. 681). But in spring the quails also come northwards in immense masses from the interior of Africa, and return in autumn, when they sometimes arrive so exhausted, that they can be caught with the hand (cf. Diod. Sic. i. 60; v. Schubert, Reise ii. p. 361). Such a flight of quails was now brought by God, who caused them to fall in the camp of the Israelites, so that it was completely covered by them. Then in the morning there came an \"effusion of dew round about the camp; and when the effusion of dew ascended (i.e., when the mist that produced the dew had cleared away), behold there (it lay) upon the surface of the desert, fine, congealed, fine as the hoar-frost upon the ground.\" The meaning of the ἁπ. λεγ. מחספּס is uncertain. The meaning, scaled off, scaly, decorticatum, which is founded upon the Chaldee rendering מקלּף, is neither suitable to the word nor to the thing. The rendering volutatum, rotundum, is better; and better still perhaps that of Meier, \"run together, curdled.\" When the Israelites noticed this, which they had never seen before, they said to one another, הוּא מן, τί ἐστι τοῦτο (lxx), \"what is this?\" for they knew not what it was. מן for מה belongs to the popular phraseology, and has been retained in the Chaldee and Ethiopic, so that it is undoubtedly to be regarded as early Semitic. From the question, man hu, the divine bread received the name of man (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 16:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), or manna. Kimchi, however, explains it as meaning donum et portio. Luther follows him, and says, \"Mann in Hebrew means ready money, a present or a gift;\" whilst Gesenius and others trace the word to מנה, to divide, to apportion, and render הוּא מן \"what is apportioned, a gift or present.\" But the Arabic word to which appeal is made, is not early Arabic; and this explanation does not suit the connection. How could the people say \"it is apportioned,\" when they did not know what it was, and Moses had to tell them, it is the bread which Jehovah has given you for food? If they had seen at once that it was food sent them by God, there would have been no necessity for Moses to tell them so. ",
        "children": []
      }
    ]
  }
]