[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Exodus 16:17",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 16:17",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Some more, some less — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "According as their families were more or less numerous; or as the gatherers were more or less strong and active in gathering it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "16:13-21 At evening the quails came up, and the people caught with ease as many as they needed. The manna came down in dew. They called it Manna, Manhu, which means, What is this? It is a portion; it is that which our God has allotted us, and we will take it, and be thankful. It was pleasant food; it was wholesome food. The manna was rained from heaven; it appeared, when the dew was gone, as a small round thing, as small as the hoar frost, like coriander seed, in colour like pearls. The manna fell only six days in the week, and in double quantity on the sixth day; it bred worms and became offensive if kept more than one day, excepting on the sabbath. The people had never seen it before. It could be ground in a mill, or beaten in a mortar, and was then made into cakes and baked. It continued the forty years the Israelites were in the wilderness, wherever they went, and ceased when they arrived in Canaan. All this shows how different it was from any thing found before, or found now. They were to gather the manna every morning. We are hereby taught, 1. To be prudent and diligent in providing food for ourselves and our households; with quietness working, and eating our own bread, not the bread of idleness or deceit. God's bounty leaves room for man's duty; it did so even when manna was rained; they must not eat till they have gathered. 2. To be content with enough. Those that have most, have for themselves but food and raiment; those that have least, generally have these; so that he who gathers much has nothing over, and he who gathers little has no lack. There is not such a disproportion between one and another in the enjoyment of the things of this life, as in the mere possession of them. 3. To depend upon Providence: let them sleep quietly, though they have no bread in their tents, nor in all their camp, trusting that God, with the following day, would bring them in their daily bread. It was surer and safer in God's storehouse than their own, and would come thence sweeter and fresher. See here the folly of hoarding. The manna laid up by some, who thought themselves wiser, and better managers, than their neighbours, and who would provide lest it should fail next day, bred worms, and became good for nothing. That will prove to be most wasted, which is covetously and distrustfully spared. Such riches are corrupted, Jas 5:2,3. The same wisdom, power, and goodness that brought food daily from above for the Israelites in the wilderness, brings food yearly out of the earth in the constant course of nature, and gives us all things richly to enjoy.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Some more, some less - It is evidently implied that the people were in part at least disobedient and failed in this first trial. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13-31. at even the quails came up, and covered the camp—This bird is of the gallinaceous kind [that is, relating to the order of heavy-bodied, largely terrestrial birds], resembling the red partridge, but not larger than the turtledove. They are found in certain seasons in the places through which the Israelites passed, being migratory birds, and they were probably brought to the camp by \"a wind from the Lord\" as on another occasion (Nu 11:31).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and in the morning … a small round thing … manna—There is a gum of the same name distilled in this desert region from the tamarisk, which is much prized by the natives, and preserved carefully by those who gather it. It is collected early in the morning, melts under the heat of the sun, and is congealed by the cold of night. In taste it is as sweet as honey, and has been supposed by distinguished travellers, from its whitish color, time, and place of its appearance, to be the manna on which the Israelites were fed: so that, according to the views of some, it was a production indigenous to the desert; according to others, there was a miracle, which consisted, however, only in the preternatural arrangements regarding its supply. But more recent and accurate examination has proved this gum of the tarfa-tree to be wanting in all the principal characteristics of the Scripture manna. It exudes only in small quantities, and not every year; it does not admit of being baked (Nu 11:8) or boiled (Ex 16:23). Though it may be exhaled by the heat and afterwards fall with the dew, it is a medicine, not food—it is well known to the natives of the desert, while the Israelites were strangers to theirs; and in taste as well as in the appearance of double quantity on Friday, none on Sabbath, and in not breeding worms, it is essentially different from the manna furnished to the Israelites.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Either, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. According as their families were more or less numerous. Or rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. As the gatherers were more or less strong and active in gathering it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the children of Israel did so,.... They went out of the camp in the morning when it was fallen, and gathered it; which is expressive of believers going out of the camp, leaving the world, and all behind them for Christ; and of their going out of themselves to him, and of their going in and out, and finding pasture and food for their souls in him to live upon: and gathered some more, some less; some that were more robust and strong, that were more active and diligent, gathered in more than others; which may denote the different degree and exercise of faith in God's people; some are strong in it, and others weak; some attain to a greater degree of knowledge of Christ, and receive more grace from him, and have more spiritual peace, joy, and comfort in believing, and others less; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 15:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And the children of Israel did so, and gathered, some more, some less.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "some more, some less",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] according to the number in their family.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 17.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The children of Israel",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "did so",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The Israelites set themselves to obey Moses, and gathered what they supposed to be about an omer; but, as a matter of course, some of them exceeded the amount, while others fell short of it. There was no wilful disobedience thus far. Exodus 16:17",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "After explaining the object of the manna, Moses made known to them at once the directions of God about gathering it. In the first place, every one was to gather according to the necessities of his family, a bowl a head, which held, according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 16:36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the tenth part of an ephah. Accordingly they gathered, \"he that made much, and he that made little,\" i.e., he that gathered much, and he that gathered little, and measured it with the omer; and he who gathered much had no surplus, and he who gathered little had no lack: \"every one according to the measure of his eating had they gathered.\" These words are generally understood by the Rabbins as meaning, that whether they had gathered much or little, when they measured it in their tents, they had collected just as many omers as they needed for the number in their families, and therefore that no one had either superfluity or deficiency. Calvin, on the other hand, and other Christian commentators, suppose the meaning to be, that all that was gathered was placed in a heap, and then measured out in the quantity that each required. In the former case, the miraculous superintendence of God was manifested in this, that no one was able to gather either more or less than what he needed for the number in his family; in the second case, in the fact that the entire quantity gathered, amounted exactly to what the whole nation required. In both cases, the superintending care of God would be equally wonderful, but the words of the text decidedly favour the old Jewish view. ",
        "children": []
      }
    ]
  }
]