[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(18) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "When they did mete it with an omer.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Each Israelite gathered what he supposed would be about an omer for each member of his family. Some naturally made an over, some an under estimate; but whatever the quantity collected, when it came to be measured in the camp, the result was always the same—there was found to be just an omer for each. This result can only have been miraculous.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Exodus 16:18",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 16:18",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He that gathered much had nothing over — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Commentators interpret this in different ways. Some suppose that God wrought a miracle in this case, and so ordered it, that when they came to measure what they had gathered, the store of him that had gathered too much was miraculously diminished to the exact number of omers he ought to have gathered, and the store of him who had not gathered the due quantity, was miraculously increased. Houbigant, however, supposes that this was only applicable to the first time of gathering, “God admonishing them, by this event, that they should afterward do that which he himself had now perfected by his own immediate agency.” But others suppose, that had this been the case, as it was an equal miracle with any other recorded, it would have been mentioned that the Lord had done it. And they think, therefore, all that is meant is, that he who had not gathered a sufficient quantity to make an omer for every one in his family, had it made up to him out of what others had gathered, who had more than enough, and that they charitably assisted each other. This sense of the passage seems to be countenanced by St. Paul, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Corinthians 8:13-15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". If understood in the first-mentioned sense, the apostle, in the application of it as an argument to encourage charity, must be considered as signifying that God, in an extraordinary manner, in the course of his providences, will bless and prosper those who in charity assist their brethren.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "16:13-21 At evening the quails came up, and the people caught with ease as many as they needed. The manna came down in dew. They called it Manna, Manhu, which means, What is this? It is a portion; it is that which our God has allotted us, and we will take it, and be thankful. It was pleasant food; it was wholesome food. The manna was rained from heaven; it appeared, when the dew was gone, as a small round thing, as small as the hoar frost, like coriander seed, in colour like pearls. The manna fell only six days in the week, and in double quantity on the sixth day; it bred worms and became offensive if kept more than one day, excepting on the sabbath. The people had never seen it before. It could be ground in a mill, or beaten in a mortar, and was then made into cakes and baked. It continued the forty years the Israelites were in the wilderness, wherever they went, and ceased when they arrived in Canaan. All this shows how different it was from any thing found before, or found now. They were to gather the manna every morning. We are hereby taught, 1. To be prudent and diligent in providing food for ourselves and our households; with quietness working, and eating our own bread, not the bread of idleness or deceit. God's bounty leaves room for man's duty; it did so even when manna was rained; they must not eat till they have gathered. 2. To be content with enough. Those that have most, have for themselves but food and raiment; those that have least, generally have these; so that he who gathers much has nothing over, and he who gathers little has no lack. There is not such a disproportion between one and another in the enjoyment of the things of this life, as in the mere possession of them. 3. To depend upon Providence: let them sleep quietly, though they have no bread in their tents, nor in all their camp, trusting that God, with the following day, would bring them in their daily bread. It was surer and safer in God's storehouse than their own, and would come thence sweeter and fresher. See here the folly of hoarding. The manna laid up by some, who thought themselves wiser, and better managers, than their neighbours, and who would provide lest it should fail next day, bred worms, and became good for nothing. That will prove to be most wasted, which is covetously and distrustfully spared. Such riches are corrupted, Jas 5:2,3. The same wisdom, power, and goodness that brought food daily from above for the Israelites in the wilderness, brings food yearly out of the earth in the constant course of nature, and gives us all things richly to enjoy.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Had nothing over - Whatever quantity each person had gathered, when he measured it in his tent, he found that he had just as many omers as he needed for the consumption of his family. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "13-31. at even the quails came up, and covered the camp—This bird is of the gallinaceous kind [that is, relating to the order of heavy-bodied, largely terrestrial birds], resembling the red partridge, but not larger than the turtledove. They are found in certain seasons in the places through which the Israelites passed, being migratory birds, and they were probably brought to the camp by \"a wind from the Lord\" as on another occasion (Nu 11:31).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and in the morning … a small round thing … manna—There is a gum of the same name distilled in this desert region from the tamarisk, which is much prized by the natives, and preserved carefully by those who gather it. It is collected early in the morning, melts under the heat of the sun, and is congealed by the cold of night. In taste it is as sweet as honey, and has been supposed by distinguished travellers, from its whitish color, time, and place of its appearance, to be the manna on which the Israelites were fed: so that, according to the views of some, it was a production indigenous to the desert; according to others, there was a miracle, which consisted, however, only in the preternatural arrangements regarding its supply. But more recent and accurate examination has proved this gum of the tarfa-tree to be wanting in all the principal characteristics of the Scripture manna. It exudes only in small quantities, and not every year; it does not admit of being baked (Nu 11:8) or boiled (Ex 16:23). Though it may be exhaled by the heat and afterwards fall with the dew, it is a medicine, not food—it is well known to the natives of the desert, while the Israelites were strangers to theirs; and in taste as well as in the appearance of double quantity on Friday, none on Sabbath, and in not breeding worms, it is essentially different from the manna furnished to the Israelites.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " All that was gathered by the members of one family was put into a heap, and then distributed to each person an omer, neither more nor less; to which St. Paul alludes, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " 2 Corinthians 8:13",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Corinthians 8:13",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And when they did mete it with an omer,.... What was gathered in; and everyone had his measure, his omer dealt out to him by those that meted or measured it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "he that gathered much had nothing over, and he that gathered little had no lack; when their gatherings were put together in one heap, and each had his omer measured out to him; he that had gathered more than an omer had no more allotted to him, and he that gathered not so much as an omer, yet had a full one measured out to him: or he, that is, Moses, \"did not cause him to abound\" (q), that gathered much, he had no more for his share than another; nor \"suffer\" him \"to want\" (r) that gathered little, so that they all had alike; which shows, that though there may be different exercises of grace, yet it is the same grace in all; all have alike precious faith, and an equal interest in Christ, the object of it; all are equally redeemed by his precious blood, and justified by his righteousness, and have their sins forgiven on the foot of his atonement; all have the same Christ, and the same blessings of grace, and are entitled to the same eternal glory and happiness. The apostle quotes this passage, and applies it to that equality there should be among Christians in acts of beneficence and charity, that what is wanting in the one through poverty, may be made up by the riches of others, 2 Corinthians 8:14, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "he that gathered much had nothing over, and he that gathered little had no lack; when their gatherings were put together in one heap, and each had his omer measured out to him; he that had gathered more than an omer had no more allotted to him, and he that gathered not so much as an omer, yet had a full one measured out to him: or he, that is, Moses, \"did not cause him to abound\" (q), that gathered much, he had no more for his share than another; nor \"suffer\" him \"to want\" (r) that gathered little, so that they all had alike; which shows, that though there may be different exercises of grace, yet it is the same grace in all; all have alike precious faith, and an equal interest in Christ, the object of it; all are equally redeemed by his precious blood, and justified by his righteousness, and have their sins forgiven on the foot of his atonement; all have the same Christ, and the same blessings of grace, and are entitled to the same eternal glory and happiness. The apostle quotes this passage, and applies it to that equality there should be among Christians in acts of beneficence and charity, that what is wanting in the one through poverty, may be made up by the riches of others, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Corinthians 8:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "they gathered every man according to his eating; according to the number of persons he had to eat of it; there always was, upon an average, some gathering more and others less, an omer gathered and distributed to every person. Jarchi takes this to be a miracle, that nothing should ever be wanting of an omer to a man; and so Aben Ezra observes, that the ancients say this is a miracle. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(q) \"et non abundare fecit\", Montanus. (r)  \"non minoravit\", Montanus; \"non defuit\", Tigurine version. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(q) \"et non abundare fecit\", Montanus. (r)  \"non minoravit\", Montanus; \"non defuit\", Tigurine version. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And when they did mete it with an omer, he that gathered much had nothing over, and he that gathered little had no {h} lack; they gathered every man according to his eating.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And when they did mete ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "it",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " with an omer, he that gathered much had nothing over, and he that gathered little had no ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{h}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " lack; they gathered every man according to his eating.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(h) God richly feeds everyone, and no one can justly complain.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". They gathered, as well as they could judge roughly, according to the size of their families; when they afterwards measured what they had gathered, they found to their surprise that they had each gathered exactly an omer a head. The verse is quoted in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Corinthians 8:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "mete",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] An archaism for ‘measure’: ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 7:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "al.had … over",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "al.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "had … over",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "] The Heb. verb is unusual, and found only in P (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "v.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " 23, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 26:12-13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 25:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 3:46",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 3:48-49",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "†).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 18.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "When they did mete it with an omer",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". On returning to their tents, with the manna which they had collected, the Israelites proceeded to measure it with their own, or a neighbour's, omer measure, when the wonderful result appeared, that, whatever the quantity actually gathered by any one, the result of the measurement showed, exactly as many omers as there were persons in the family. Thus, he that had gathered much found that he had nothing over, and he that had gathered little found that he had no lack. Exodus 16:18",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "After explaining the object of the manna, Moses made known to them at once the directions of God about gathering it. In the first place, every one was to gather according to the necessities of his family, a bowl a head, which held, according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 16:36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the tenth part of an ephah. Accordingly they gathered, \"he that made much, and he that made little,\" i.e., he that gathered much, and he that gathered little, and measured it with the omer; and he who gathered much had no surplus, and he who gathered little had no lack: \"every one according to the measure of his eating had they gathered.\" These words are generally understood by the Rabbins as meaning, that whether they had gathered much or little, when they measured it in their tents, they had collected just as many omers as they needed for the number in their families, and therefore that no one had either superfluity or deficiency. Calvin, on the other hand, and other Christian commentators, suppose the meaning to be, that all that was gathered was placed in a heap, and then measured out in the quantity that each required. In the former case, the miraculous superintendence of God was manifested in this, that no one was able to gather either more or less than what he needed for the number in his family; in the second case, in the fact that the entire quantity gathered, amounted exactly to what the whole nation required. In both cases, the superintending care of God would be equally wonderful, but the words of the text decidedly favour the old Jewish view. ",
        "children": []
      }
    ]
  }
]