[{"header":"Chapter 21"},{"num":1,"verse":"The Poor Widow’s Offering. Looking up, Jesus saw wealthy people putting their offerings into the treasury,"},{"num":2,"verse":"and he also noticed a poor widow putting in two copper coins."},{"num":3,"verse":"He said: “Truly I tell you, this poor widow has given more than all the rest."},{"num":4,"verse":"For the others have all contributed out of their abundance, but she out of her poverty has given all that she had to live on.”"},{"header":"The Destruction of the Temple and the Return of Christ[b]"},{"num":7,"verse":"The Signs of the End. They then asked him, “Teacher, when will this happen? And what will be the sign that it is about to take place?”"},{"num":8,"verse":"He answered, “Take care not to be deceived. For many will come in my name, saying, ‘I am he,’ and ‘The time is near.’ Do not follow them."},{"num":9,"verse":"And when you hear of wars and insurrections, do not be terrified, for those things are bound to take place first, but the end will not follow immediately.”"},{"num":10,"verse":"Then he added, “Nation will rise against nation and kingdom against kingdom."},{"num":11,"verse":"There will be tremendous earthquakes, famines, and plagues in various places, as well as dreadful portents and great signs from heaven."},{"num":12,"verse":"The Coming Persecution.“But before all this happens, they will seize you and persecute you. You will be handed over to synagogues and imprisoned, and you will be brought before kings and governors because of my name."},{"num":13,"verse":"This will give you an opportunity to bear witness to me."},{"num":14,"verse":"But do not even consider preparing your defense beforehand,"},{"num":15,"verse":"for I myself will give you a depth of wisdom and eloquence that none of your adversaries will be able to resist or contradict."},{"num":16,"verse":"“You will be betrayed even by parents and brothers, relatives and friends, and some of you will be put to death."},{"num":17,"verse":"You will be hated by all because of my name,"},{"num":18,"verse":"but not a hair of your head will be lost."},{"num":19,"verse":"By standing firm you will gain life."},{"num":20,"verse":"The Great Trial.“When you see Jerusalem surrounded by armies, you may be certain that her desolation is near."},{"num":21,"verse":"Then those who are in Judea must flee to the mountains, and those who are within the city must escape from its boundaries, and those who are in country areas must not return."},{"num":22,"verse":"For those will be days of retribution when all that is written will come to pass."},{"num":23,"verse":"“Woe to those who are pregnant and those who are nursing infants in those days. For there will be great distress on the earth, and terrible wrath shall afflict this people."},{"num":24,"verse":"They will fall by the sword and be carried away as captives among all the nations, and Jerusalem will be trampled underfoot by the Gentiles until the times of the Gentiles have been fulfilled."},{"num":25,"verse":"The Coming of the Son of Man.“There will be signs in the sun, the moon, and the stars, and on earth nations will be in great distress, bewildered at the roaring of the sea and its waves."},{"num":26,"verse":"Men will grow faint with terror and apprehension at what is coming upon the earth, for the powers of the heavens will be shaken."},{"num":27,"verse":"And then they will see the Son of Man coming in a cloud with power and great glory."},{"num":28,"verse":"When these things begin to take place, look up and hold your heads high, because the time of your redemption is drawing near.”"},{"num":29,"verse":"The Parable of the Fig Tree. Then he told them this parable: “Look at the fig tree or indeed at any other tree."},{"num":30,"verse":"As soon as it begins to bud, you know that summer is already near."},{"num":31,"verse":"In the same way, when you see these things come to pass, know that the kingdom of God is near."},{"num":32,"verse":"Amen, I say to you, this generation will not pass away until all these things have taken place."},{"num":33,"verse":"Heaven and earth will pass away, but my words will never pass away."},{"num":34,"verse":"Exhortation To Be Vigilant.“Be on your guard lest your hearts be weighed down by carousing and drunkenness and the anxieties of this life and that day will catch you unawares,"},{"num":35,"verse":"like a trap. For that day will come upon everyone in the world."},{"num":36,"verse":"Be vigilant at all times, praying for the strength to survive all those things that will take place and to stand in the presence of the Son of Man.”"},{"num":37,"verse":"Jesus’ Last Days in Jerusalem. Each day Jesus was teaching in the temple, but every evening he would go forth and spend the night on the hill called the Mount of Olives."},{"num":38,"verse":"And all the people would rise early every morning to listen to him in the temple."}]