[{"num":21,"verse":"He looked up and saw rich people putting their contributions into the Temple treasury. "},{"num":2,"verse":"He also saw an impoverished widow putting in two tiny copper coins."},{"num":3,"verse":"‘I’m telling you the truth,’ he said. ‘This poor widow has put in more than all of them. "},{"num":4,"verse":"They all contributed into the collection out of their plenty, but she contributed out of her poverty, and gave her whole livelihood.’"},{"header":"Signs of the End"},{"num":5,"verse":"Some people were talking about the Temple, saying how wonderfully it was decorated, with its beautiful stones and dedicated gifts."},{"num":6,"verse":"‘but the days will come when everything you see will be torn down. Not one stone will be left standing on another.’"},{"num":7,"verse":"‘Teacher,’ they asked him, ‘when will these things happen? What will be the sign that it’s all about to take place?’"},{"num":8,"verse":"‘Watch out that nobody deceives you,’ said Jesus. ‘Yes: lots of people will come using my name, saying “I’m the one!” and “The time has come!” Don’t go following them. "},{"num":9,"verse":"When you hear about wars and rebellions, don’t be alarmed. These things have to happen first, but the end won’t come at once."},{"num":10,"verse":"‘One nation will rise against another,’ he went on, ‘and one kingdom against another. "},{"num":11,"verse":"There will be huge earthquakes, famines and plagues in various places, terrifying omens, and great signs from heaven."},{"num":12,"verse":"‘Before all this happens they will lay hands on you and persecute you. They will hand you over to the synagogues and prisons. They will drag you before kings and governors because of my name. "},{"num":13,"verse":"That will become an opportunity for you to tell your story. "},{"num":14,"verse":"So settle it in your hearts not to work out beforehand what tale to tell; "},{"num":15,"verse":"I’ll give you a mouth and wisdom, which none of your opponents will be able to resist or contradict."},{"num":16,"verse":"‘You will be betrayed by parents, brothers and sisters, relatives and friends, and they will kill some of you. "},{"num":17,"verse":"You will be hated by everyone because of my name. "},{"num":18,"verse":"But no hair of your head will be lost. "},{"num":19,"verse":"The way to keep your lives is to be patient.’"},{"header":"The Distress of Jerusalem Predicted"},{"num":20,"verse":"‘But,’ continued Jesus, ‘when you see Jerusalem surrounded by armies, then you will know that her time of desolation has arrived. "},{"num":21,"verse":"Then people in Judaea should run off to the hills, people in Jerusalem itself should get out as fast as they can, and people in the countryside shouldn’t go back into the city. "},{"num":22,"verse":"Those will be the days of severe judgment, which will fulfil all the biblical warnings. "},{"num":23,"verse":"Woe betide pregnant women, and nursing mothers, in those days! There is going to be huge distress on the earth, and divine anger against this people. "},{"num":24,"verse":"The hungry sword will eat them up; they will be taken off as prisoners to every nation; and Jerusalem will be trampled by the pagans, until the times of the pagans are done."},{"num":25,"verse":"‘There will be signs in the sun, the moon and the stars. On earth the nations will be in distress and confusion because of the roaring and swelling of the sea and its waves. "},{"num":26,"verse":"People will faint from fear, and from imagining all that’s going to happen to the world. The powers of the heavens will be shaken. "},{"num":27,"verse":"Then they will see “the son of man coming on a cloud” with power and great majesty. "},{"num":28,"verse":"When all these things start to happen, stand up and lift up your heads, because the time has come for you to be redeemed.’"},{"num":29,"verse":"He told them this parable. ‘Look at the fig tree and all the trees. "},{"num":30,"verse":"When they are well into leaf, you can see for yourselves and know that summer is upon you. "},{"num":31,"verse":"In the same way, when you see all these things happening, you will know that God’s kingdom is upon you. "},{"num":32,"verse":"I’m telling you the truth; this generation won’t be gone before all of this happens. "},{"num":33,"verse":"Heaven and earth may disappear, but these words of mine won’t disappear.’"},{"header":"Watching for the Son of Man"},{"num":34,"verse":"‘So watch out for yourselves,’ said Jesus, ‘that your hearts may not grow heavy with dissipation and drunkenness and the cares of this life, so that that day comes upon you suddenly, "},{"num":35,"verse":"like a trap. It will come, you see, on everyone who lives on the face of the earth. "},{"num":36,"verse":"Keep awake at all times, praying that you may have strength to escape all these things that will happen, and to stand before the son of man.’"},{"num":37,"verse":"Jesus was teaching in the Temple by day, but at night he went out and stayed in the place called the Mount of Olives. "},{"num":38,"verse":"And from early morning all the people flocked to him in the Temple, to hear him."}]