[{"num":24,"verse":"When Balaam saw that it pleased the Lord to bless Israel, he did not go as he had done each time before [superstitiously] to meet with omens and signs in the natural world, but he set his face toward the wilderness or desert."},{"num":2,"verse":"And Balaam lifted up his eyes and he saw Israel abiding in their tents according to their tribes. And the Spirit of God came upon him"},{"num":3,"verse":"And he took up his [figurative] discourse and said: Balaam son of Beor, the man whose eye is opened [at last, to see clearly the purposes and will of God],"},{"num":4,"verse":"He [Balaam] who hears the words of God, who sees the vision of the Almighty, falling down, but having his eyes open and uncovered, he says:"},{"num":5,"verse":"How attractive and considerable are your tents, O Jacob, and your tabernacles, O Israel!"},{"num":6,"verse":"As valleys are they spread forth, as gardens by the riverside, as [rare spice] of lignaloes which the Lord has planted, and as cedar trees beside the waters."},{"num":7,"verse":"[Israel] shall pour water out of his own buckets [have his own sources of rich blessing and plenty], and his offspring shall dwell by many waters, and his king shall be higher than Agag, and his kingdom shall be exalted."},{"num":8,"verse":"God brought [Israel] forth out of Egypt; [Israel] has strength like the wild ox; he shall eat up the nations, his enemies, crushing their bones and piercing them through with his arrows."},{"num":9,"verse":"He couched, he lay down as a lion; and as a lioness, who shall rouse him? Blessed [of God] is he who blesses you [who prays for and contributes to your welfare] and cursed [of God] is he who curses you [who in word, thought, or deed would bring harm upon you]."},{"num":10,"verse":"Then Balak’s anger was kindled against Balaam, and he smote his hands together; and Balak said to Balaam, I called you to curse my enemies, and, behold, you have done nothing but bless them these three times."},{"num":11,"verse":"Therefore now go back where you belong and do it in a hurry! I had intended to promote you to great honor, but behold, the Lord has held you back from honor."},{"num":12,"verse":"Balaam said to Balak, Did I not say to your messengers whom you sent to me,"},{"num":13,"verse":"If Balak would give me his house full of silver and gold, I cannot go beyond the command of the Lord, to do either good or bad of my own will, but what the Lord says, that will I speak?"},{"num":14,"verse":"And now, behold, I am going to my people; come, I will tell you what this people [Israel] will do to your people [Moab] in the latter days."},{"num":15,"verse":"And he took up his [figurative] discourse, and said: Balaam son of Beor speaks, the man whose eye is opened speaks,"},{"num":16,"verse":"He speaks, who heard the words of God and knew the knowledge of the Most High, who saw the vision of the Almighty, falling down, but having his eyes open and uncovered:"},{"num":17,"verse":"I see Him, but not now; I behold Him, but He is not near. A star (Star) shall come forth out of Jacob, and a scepter (Scepter) shall rise out of Israel and shall crush all the corners of Moab and break down all the sons of Sheth [Moab’s sons of tumult]."},{"num":18,"verse":"And Edom shall be [taken as] a possession, [Mount] Seir also shall be dispossessed, who were Israel’s enemies, while Israel does valiantly."},{"num":19,"verse":"Out of Jacob shall one (One) come having dominion and shall destroy the remnant from the city."},{"num":20,"verse":"[Balaam] looked at Amalek and took up his [prophetic] utterance, and said: Amalek is the foremost of the [neighboring] nations, but in his latter end he shall come to destruction."},{"num":21,"verse":"And he looked at the Kenites and took up his [prophetic] utterance, and said: Strong is your dwelling place, and you set your nest in the rock."},{"num":22,"verse":"Nevertheless the Kenites shall be wasted. How long shall Asshur (Assyria) take you away captive?"},{"num":23,"verse":"And he took up his [prophetic] speech, and said: Alas, who shall live when God does this and establishes [Assyria]?"},{"num":24,"verse":"But ships shall come from Kittim [Cyprus and the greater part of the Mediterranean’s east coast] and shall afflict Assyria and Eber [the Hebrews, certain Arabs, and descendants of Nahor], and he [the victor] also shall come to destruction."},{"num":25,"verse":"And Balaam rose up, returned to his place, and Balak also went his way."}]