[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "6:9-15 Christ saw it needful to show his disciples what must commonly be the matter and method of their prayer. Not that we are tied up to the use of this only, or of this always; yet, without doubt, it is very good to use it. It has much in a little; and it is used acceptably no further than it is used with understanding, and without being needlessly repeated. The petitions are six; the first three relate more expressly to God and his honour, the last three to our own concerns, both temporal and spiritual. This prayer teaches us to seek first the kingdom of God and his righteousness, and that all other things shall be added. After the things of God's glory, kingdom, and will, we pray for the needful supports and comforts of this present life. Every word here has a lesson in it. We ask for bread; that teaches us sobriety and temperance: and we ask only for bread; not for what we do not need. We ask for our bread; that teaches us honesty and industry: we do not ask for the bread of others, nor the bread of deceit, Pr 20:17; nor the bread of idleness, Pr 31:27, but the bread honestly gotten. We ask for our daily bread; which teaches us constantly to depend upon Divine Providence. We beg of God to give it us; not sell it us, nor lend it us, but give it. The greatest of men must be beholden to the mercy of God for their daily bread. We pray, Give it to us. This teaches us a compassion for the poor. Also that we ought to pray with our families. We pray that God would give it us this day; which teaches us to renew the desires of our souls toward God, as the wants of our bodies are renewed. As the day comes we must pray to our heavenly Father, and reckon we could as well go a day without food, as without prayer. We are taught to hate and dread sin while we hope for mercy, to distrust ourselves, to rely on the providence and grace of God to keep us from it, to be prepared to resist the tempter, and not to become tempters of others. Here is a promise, If you forgive, your heavenly Father will also forgive. We must forgive, as we hope to be forgiven. Those who desire to find mercy with God, must show mercy to their brethren. Christ came into the world as the great Peace-maker, not only to reconcile us to God, but one to another.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "For if ye forgive men their trespasses - If ye forgive others when they offend or injure you.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Your heavenly Father will also forgive you - This is constantly required in the Bible. See the notes at Matthew 6:12. Our Saviour says we should forgive even if the offence be committed seventy times seven times, Matthew 18:22. By this is meant, that when a man asks forgiveness, we are cordially and forever to pardon the offence; we are to declare our willingness to forgive him. If he does not ask forgiveness, yet we are still to treat him kindly; not to harbor malice, not to speak ill of him, to be ready to do him good, and be always prepared to declare him forgiven when he asks it, and if we are not ready and willing to forgive him; we are assured that God will not forgive us. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Your heavenly Father will also forgive you - This is constantly required in the Bible. See the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 6:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Our Saviour says we should forgive even if the offence be committed seventy times seven times, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 18:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". By this is meant, that when a man asks forgiveness, we are cordially and forever to pardon the offence; we are to declare our willingness to forgive him. If he does not ask forgiveness, yet we are still to treat him kindly; not to harbor malice, not to speak ill of him, to be ready to do him good, and be always prepared to declare him forgiven when he asks it, and if we are not ready and willing to forgive him; we are assured that God will not forgive us. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "15. But if ye forgive not, &c.—See on [1230]Mt 6:12.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Fasting (Mt 6:16-18). Having concluded His supplementary directions on the subject of prayer with this Divine Pattern, our Lord now returns to the subject of Unostentatiousness in our deeds of righteousness, in order to give one more illustration of it, in the matter of fasting.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ver. 14,15. Not that our mere forgiving our brethren the injuries done unto us is all that God requireth of us in order to the forgiveness we expect from him, the contrary is plain from several other texts, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "John 3:18,36 Ac 2:38 16:31",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 3:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",36 Ac 2:38 16:31",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " &c.; but that without this forgiveness of our brethren, God will not forgive us, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Matthew 18:35",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 18:35",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". It is one piece of that obedience which we owe to God, and also of our gratitude, without the performance of which it is vain for us to hope for forgiveness from God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But if you forgive not men their trespasses,.... On the other hand, where men are not of a forgiving temper to their fellow creatures and fellow Christians, how can they expect forgiveness at the hands of God? or what sense of pardoning grace can there be upon their minds? Had they any right apprehensions of the grace and goodness of God, in the forgiveness of their sins, this would influence their minds, and engage their hearts to forgive such who have offended them: wherefore, where this is wanting, it may be concluded of, and said to such persons, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "neither will your Father forgive your trespasses. It is a plain case, that your Father has not given you a true sense of the pardon of your sins, nor can you be certain that he will; nor have you any reason to expect it, when you are so cruel and revengeful to others. There is a considerable emphasis lies upon the word \"men\", to which \"heavenly Father\" is opposed, and the sense, according to it, is, that if men, who are upon an equal foot with each other, should not forgive one another, how should it be expected that our Father which is in heaven, who is so much above, and no ways obliged to us, should forgive us? ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "neither will your Father forgive your trespasses. It is a plain case, that your Father has not given you a true sense of the pardon of your sins, nor can you be certain that he will; nor have you any reason to expect it, when you are so cruel and revengeful to others. There is a considerable emphasis lies upon the word \"men\", to which \"heavenly Father\" is opposed, and the sense, according to it, is, that if men, who are upon an equal foot with each other, should not forgive one another, how should it be expected that our Father which is in heaven, who is so much above, and no ways obliged to us, should forgive us? ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "But if ye forgive not men their trespasses, neither will your Father forgive your trespasses.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 6:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Τὰ παραπτώματα αὐτῶν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "their trespasses",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") The copies which omit these words, elegantly intimate that the sins of men against us, if compared with our sins against the Father, will vanish away. Some Latin writers omit also the words ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τοῖς ἀνθρώποις",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "men",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Matthew 6:15",
        "children": []
      }
    ]
  }
]