[{"num":119,"verse":"ALEF Ashrei are the blameless ones in the derech, who walk in the torat Hashem."},{"num":2,"verse":"Ashrei are they that keep His edot (testimonies), and that seek Him with kol lev."},{"num":3,"verse":"They also do no iniquity; they walk in His drakhim."},{"num":4,"verse":"Thou hast commanded us to be diligently shomer over Thy pikkudim (precepts)."},{"num":5,"verse":"O that my drakhim were directed to be shomer over Thy chukkot (statutes)!"},{"num":6,"verse":"Then shall I not be ashamed, when I have respect unto all Thy mitzvot."},{"num":7,"verse":"I will praise Thee with yosher levav (uprightness of heart) when I shall have learned Thy righteous mishpatim (ordinances)."},{"num":8,"verse":"I will keep Thy chukkot; O forsake me not utterly. BEIS"},{"num":9,"verse":"How shall a na’ar cleanse his way? By being shomer thereto according to Thy Davar (Word)."},{"num":10,"verse":"With my kol lev have I sought Thee; O let me not wander from Thy mitzvot."},{"num":11,"verse":"Thy word have I hid in my lev, lema’an (so that) I might not sin against Thee."},{"num":12,"verse":"Baruch atah, Adonoi; teach me Thy chukkot."},{"num":13,"verse":"With my sfatayim (lips) have I declared all the mishpatim of Thy mouth."},{"num":14,"verse":"I have rejoiced in the derech of Thy edot (testimonies), as much as in all riches."},{"num":15,"verse":"I will meditate in Thy pikkudim, and consider Thy orkhot (paths)."},{"num":16,"verse":"I will delight myself in Thy chukkot; I will not forget Thy Davar. GIMEL"},{"num":17,"verse":"Deal bountifully with Thy eved, that I may live, and be shomer over Thy Davar."},{"num":18,"verse":"Open Thou mine eyes, that I may behold nifla’ot out of Thy torah."},{"num":19,"verse":"I am a ger on ha’aretz; hide not Thy mitzvot from me."},{"num":20,"verse":"My nefesh is shattered with ta’avah for Thy mishpatim at all times."},{"num":21,"verse":"Thou hast rebuked the zedim (arrogant ones) that are arurim (cursed ones), which do wander from Thy mitzvot."},{"num":22,"verse":"Remove from me cherpah (reproach) and contempt; for I have kept Thy edot (testimonies)."},{"num":23,"verse":"Though sarim (princes) also sit and speak slander against me, yet Thy eved meditates on Thy chukkot."},{"num":24,"verse":"Thy edot (testimonies) also are my delight and anshei atzati (my counsellors). DALET"},{"num":25,"verse":"My nefesh has deveykus unto the aphar; revive Thou me according to Thy Davar."},{"num":26,"verse":"I have recounted my drakhim, and Thou heardest me; teach me Thy chukkot."},{"num":27,"verse":"Make me to understand the derech of Thy pikkudim; so shall I meditate on Thy nifla’ot."},{"num":28,"verse":"My nefesh drops with heavy sorrow; strengthen Thou me according unto Thy Davar."},{"num":29,"verse":"Remove from me the derech sheker; and graciously grant me Thy torah."},{"num":30,"verse":"I have chosen the derech emunah; thy mishpatim have I accounted worthy."},{"num":31,"verse":"I have deveykus with Thy edot (testimonies); Hashem, let me not be ashamed."},{"num":32,"verse":"I will run the derech of Thy mitzvot, for Thou shalt set my lev free. HEH"},{"num":33,"verse":"Teach me, Hashem, the derech of Thy chukkot; and I shall keep it unto the end."},{"num":34,"verse":"Give me understanding, and I shall keep Thy torah; yes, I shall be shomer over it with my kol lev."},{"num":35,"verse":"Make me to go in the path of Thy mitzvot; for therein do I delight."},{"num":36,"verse":"Incline my lev unto Thy edot, and not to betza (covetousness, selfish gain)."},{"num":37,"verse":"Turn away mine eyes from beholding shav (vanity); and revive Thou me in Thy derech."},{"num":38,"verse":"Establish Thy word unto Thy eved, which is for the fear of Thee."},{"num":39,"verse":"Turn away my cherpah (reproach) which I fear; for Thy mishpatim are tovim."},{"num":40,"verse":"Hinei, I have longed after Thy precepts; revive me in Thy tzedakah. VAV"},{"num":41,"verse":"Let Thy chasadim come also unto me, Hashem, even Thy Teshu’ah (salvation), according to Thy word."},{"num":42,"verse":"So shall I have wherewith to answer him that reproacheth me; for I trust in Thy Davar."},{"num":43,"verse":"And take not the devar emes utterly out of my mouth; for I have hoped in Thy mishpatim."},{"num":44,"verse":"So shall I be shomer over Thy torah tamid l’olam va’ed."},{"num":45,"verse":"And I will walk freely in a wide place; for I seek Thy pikkudim."},{"num":46,"verse":"I will speak of Thy edot (testimonies) also before melachim, and will not be ashamed."},{"num":47,"verse":"And I will delight myself in Thy mitzvot, which I love."},{"num":48,"verse":"My palms also will I lift up unto Thy mitzvot, which I love; and I will meditate on Thy chukkot. ZAYIN"},{"num":49,"verse":"Remember the davar to Thy eved, on which Thou hast made me hope."},{"num":50,"verse":"This is my comfort in my oni (affliction); for Thy word hath revived me."},{"num":51,"verse":"The zedim (arrogant ones) have had me greatly in derision; yet have I not turned aside from Thy torah."},{"num":52,"verse":"I remembered Thy mishpatim from of old, Hashem; and have comforted myself."},{"num":53,"verse":"Zalafah (indignation) hath taken hold upon me because of the resha’im that forsake Thy torah."},{"num":54,"verse":"Thy chukkot have been my zemirot (songs) in the bais of my pilgrimage."},{"num":55,"verse":"I have remembered Thy Shem, Hashem, in the lailah, and have been shomer over Thy torah."},{"num":56,"verse":"Zot hayetah li, because I kept Thy pikkudim. CHET"},{"num":57,"verse":"Thou art my chelek, Hashem; I have said I would be shomer over Thy words."},{"num":58,"verse":"I sought Thy Face with my kol lev; be gracious unto me according to Thy word."},{"num":59,"verse":"I thought on my drakhim, and turned my feet unto Thy edot (testimonies)."},{"num":60,"verse":"I made haste, and delayed not to be shomer over Thy mitzvot."},{"num":61,"verse":"The ropes of the resha’im have bound me; but I have not forgotten Thy torah."},{"num":62,"verse":"At midnight I will rise to give thanks unto Thee because of Thy righteous mishpatim."},{"num":63,"verse":"I am a chaver of all them that fear Thee, and of them that are shomer over Thy pikkudim."},{"num":64,"verse":"Ha’aretz, Hashem, is full of Thy chesed; teach me Thy chukkot. TET"},{"num":65,"verse":"Thou hast dealt well with Thy eved, Hashem, according unto Thy word."},{"num":66,"verse":"Teach me good judgment and da’as; for I have believed in Thy mitzvot."},{"num":67,"verse":"Before I was afflicted I went astray; but now have I been shomer over Thy word."},{"num":68,"verse":"Thou art tov, and doest tov; teach me Thy chukkot."},{"num":69,"verse":"The zedim (arrogant ones) have forged a sheker against me; but I will keep Thy pikkudim with my kol lev."},{"num":70,"verse":"Their lev is callous like chelev; I delight in Thy torah."},{"num":71,"verse":"It is tov for me that I have been afflicted l’ma’an (in order that) I might learn Thy chukkot."},{"num":72,"verse":"The torah of Thy mouth is better unto me than thousands of zahav and kesef. ' YOD"},{"num":73,"verse":"Thy hands have made me and established me: give me understanding, that I may learn Thy mitzvot."},{"num":74,"verse":"They that fear Thee will be glad when they see me; for I have hoped in Thy Davar."},{"num":75,"verse":"I know, Hashem, Thy mishpatim are tzedek, and Thou in emunah (faithfulness) hast afflicted me."},{"num":76,"verse":"Let now Thy chesed be for my comfort, according to Thy word unto Thy eved."},{"num":77,"verse":"Let Thy rachamim come unto me, that I may live: for Thy torah is my delight."},{"num":78,"verse":"Let the zedim (arrogant ones) be ashamed; for they dealt perversely with me without a cause: but I will meditate on Thy pikkudim (percepts)."},{"num":79,"verse":"Let those that fear Thee turn unto me, and those that have known Thy edot."},{"num":80,"verse":"Let my lev be tamim (blameless, complete) in Thy chukkot; that I be not ashamed. Kaf"},{"num":81,"verse":"My nefesh fainteth for Thy salvation: but I hope in Thy davar."},{"num":82,"verse":"Mine eyes fail for Thy word saying, Mosai (when) wilt Thou comfort me?"},{"num":83,"verse":"For I am become like a wineskin in the smoke; yet do I not forget Thy chukkot."},{"num":84,"verse":"How many are the days of Thy eved? Mosai (when) wilt Thou execute mishpat on them that persecute me?"},{"num":85,"verse":"The zedim (arrogant ones) have dug pits for me, which are not in accordance with Thy torah."},{"num":86,"verse":"All Thy mitzvot are faithful: they persecute me wrongfully; help Thou me."},{"num":87,"verse":"They had almost consumed me ba’aretz; but I forsook not Thy pikkudim."},{"num":88,"verse":"Revive me after Thy chesed; so shall I be shomer over the edut of Thy mouth. Lamed"},{"num":89,"verse":"Forever, Hashem, Thy Davar is settled and stands firm in Shomayim."},{"num":90,"verse":"Thy emunah (faithfulness) is to all generations: Thou hast established eretz, and it stands enduring."},{"num":91,"verse":"They continue enduring to this day according to Thine mishpatim: for all things are Thy avadim."},{"num":92,"verse":"Unless Thy torah had been my delight, I should then have perished in mine oni."},{"num":93,"verse":"I will never forget Thy pikkudim: for with them Thou hast revived me."},{"num":94,"verse":"I am Thine, save me: for I have sought out Thy pikkudim."},{"num":95,"verse":"The resha’im have waited for me to destroy me: but I will think on Thy edot."},{"num":96,"verse":"I have seen an end of all perfection: but Thy mitzvah is boundless. Mem"},{"num":97,"verse":"O how I love Thy torah! It is my meditation kol hayom."},{"num":98,"verse":"Thou through Thy mitzvot hast made me wiser than mine enemies: for they are ever with me."},{"num":99,"verse":"I have more understanding than every melamed of mine: for Thy edot are my meditation."},{"num":100,"verse":"I understand more than the zekenim, for I keep Thy pikkudim."},{"num":101,"verse":"I have refrained my feet from every orakh rah, in order that I might be shomer over Thy Devar."},{"num":102,"verse":"I have not departed from Thy mishpatim: for Thou hast taught me."},{"num":103,"verse":"How sweet are Thy words unto my palate! Sweeter than devash to my mouth!"},{"num":104,"verse":"Through Thy pikkudim I get understanding: therefore I hate every orakh sheker. Nun"},{"num":105,"verse":"Thy word is a ner unto my feet, ohr unto my path."},{"num":106,"verse":"I have sworn a shevuah, and I will perform it, that I will keep Thy righteous mishpatim."},{"num":107,"verse":"I am afflicted very much: revive me, Hashem, according unto Thy word."},{"num":108,"verse":"Accept the nidvot of my mouth, O Hashem, and teach me Thy mishpatim."},{"num":109,"verse":"My nefesh is continually in my yad: yet do I not forget Thy torah."},{"num":110,"verse":"The resha’im have laid a pach for me: yet I erred not from Thy pikkudim."},{"num":111,"verse":"Thy edot have I taken as a heritage forever: for they are the sasson lev of me."},{"num":112,"verse":"I have inclined mine lev to perform Thy chukkot forever, even unto the end. Samech"},{"num":113,"verse":"I hate the doubleminded: but Thy torah do I love."},{"num":114,"verse":"Thou art my seter (hiding place) and my mogen: I hope in Thy Devar."},{"num":115,"verse":"Depart from me, ye evildoers: for I will keep the mitzvot of Elohai."},{"num":116,"verse":"Uphold me according unto Thy imrah, that I may live: and let me not be ashamed from my hope."},{"num":117,"verse":"Hold Thou me up, and I shall be safe: and I will have respect unto Thy chukkot continually."},{"num":118,"verse":"Thou hast rejected all them that err from Thy chukkot: for their deceitfulness is sheker (falsehood)."},{"num":119,"verse":"Thou puttest away all resha’im of eretz like dross; therefore I love Thy edot."},{"num":120,"verse":"My basar trembleth for fear of Thee; and I am afraid of Thy mishpatim. AYIN"},{"num":121,"verse":"I have done mishpat and tzedek; leave me not to mine oppressors."},{"num":122,"verse":"Be surety for Thy eved for good; let not the zedim (arrogant ones) oppress me."},{"num":123,"verse":"Mine eyes fail for Thy Yeshuah (salvation), and for the word of Thy tzedakah."},{"num":124,"verse":"Deal with Thy eved according unto Thy chesed, and teach me Thy chukkot."},{"num":125,"verse":"I am Thy eved; give me understanding, that I may know Thy edot (testimonies)."},{"num":126,"verse":"It is time for Thee, Hashem, to work; for they have made void Thy torah."},{"num":127,"verse":"Therefore I love Thy mitzvot above zahav; yes, above fine gold."},{"num":128,"verse":"Therefore I esteem right all Thy pikkudim concerning all things; and I hate every orakh sheker. PEH"},{"num":129,"verse":"Thy edot (testimonies) are wonderful; therefore doth my nefesh keep them."},{"num":130,"verse":"The petach (entrance, doorway) of Thy words giveth light; it giveth understanding unto the simple."},{"num":131,"verse":"I opened my mouth, and panted; for I longed for Thy mitzvot."},{"num":132,"verse":"Look Thou upon me, and be merciful unto me, as Thy manner is unto those that love Shimcha."},{"num":133,"verse":"Order my footsteps in Thy imrah; and let not any iniquity have dominion over me."},{"num":134,"verse":"Redeem me from the oppression of adam; so will I keep Thy pikkudim."},{"num":135,"verse":"Make Thy face to shine upon Thy eved; and teach me Thy chukkot."},{"num":136,"verse":"Rivers of waters run down mine eyes, for they are not shomer over Thy torah. TZADDI"},{"num":137,"verse":"Righteous art Thou, Hashem, and yashar are Thy mishpatim."},{"num":138,"verse":"Thy edot (testimonies) that Thou hast commanded are tzedek and emunah me’od (very faithful)."},{"num":139,"verse":"My zeal hath consumed me, because mine enemies have forgotten Thy devarim."},{"num":140,"verse":"Thy word is very tested; therefore Thy eved loveth it."},{"num":141,"verse":"I am small and despised; yet do not I forget Thy pikkudim."},{"num":142,"verse":"Thy tzedakah is tzedek l’olam, and Thy torah emes."},{"num":143,"verse":"Tzoros and anguish have taken hold on me; yet Thy mitzvot are my delight."},{"num":144,"verse":"The tzedek of Thy edot is l’olam; give me understanding, and I shall live. KOPH"},{"num":145,"verse":"I cried with my kol lev; hear me, Hashem; I will keep Thy chukkot."},{"num":146,"verse":"I cried unto Thee; save me, and I shall be shomer over Thy edot (testimonies)."},{"num":147,"verse":"I rose before the dawn, and cried out for help; I hoped in Thy Davar."},{"num":148,"verse":"Mine eyes are awake through the ashmurot (night watches), that I might meditate on Thy word."},{"num":149,"verse":"Hear my voice according unto Thy chesed; Hashem, revive me according to Thy mishpat."},{"num":150,"verse":"They draw near that follow after wicked schemes; they are far from Thy torah."},{"num":151,"verse":"Thou art karov (near), Hashem; and all Thy mitzvot are emes."},{"num":152,"verse":"Concerning Thy edot (testimonies), I have known of old that Thou hast founded them forever. RESH"},{"num":153,"verse":"Consider mine oni (affliction), and deliver me; for I do not forget Thy torah."},{"num":154,"verse":"Plead my cause; for me make go’el redemption; revive me according to Thy word."},{"num":155,"verse":"Yeshuah (salvation) is far from the resha’im, for they seek not Thy chukkot."},{"num":156,"verse":"Great are Thy rachamim, Hashem; revive me according to Thy mishpatim."},{"num":157,"verse":"Many are my persecutors and mine enemies; yet do I not turn aside from Thy edot."},{"num":158,"verse":"I beheld the bogedim, and was grieved because they were not shomer over Thy word."},{"num":159,"verse":"Consider how I love Thy pikkudim; revive me, Hashem, according to Thy chesed."},{"num":160,"verse":"Thy word is emes from the beginning; and every one of Thy righteous mishpatim endureth forever. SHIN"},{"num":161,"verse":"Sarim (princes) have persecuted me without a cause; but my lev standeth in awe of Thy Davar."},{"num":162,"verse":"I rejoice at Thy imrah (word), as one that findeth great plunder."},{"num":163,"verse":"I hate and abhor sheker; but Thy torah do I love."},{"num":164,"verse":"Shevah times a day do I praise Thee because of Thy righteous mishpatim."},{"num":165,"verse":"Great shalom have they which love Thy torah; nothing shall cause them to stumble."},{"num":166,"verse":"Hashem, I have hoped for Thy Yeshuah (salvation), and do Thy mitzvot."},{"num":167,"verse":"My nefesh is shomer over Thy edot (testimonies); and I love them exceedingly."},{"num":168,"verse":"I have kept Thy pikkudim and Thy edot; for all my ways are before Thee. TAV"},{"num":169,"verse":"Let my cry come near before Thee, Hashem; give me understanding according to Thy Davar."},{"num":170,"verse":"Let my techinnah come before Thee; deliver me according to Thy word."},{"num":171,"verse":"My lips shall utter tehillah, when Thou hast taught me Thy chukkot."},{"num":172,"verse":"My leshon shall speak of Thy word; for all Thy mitzvot are tzedek."},{"num":173,"verse":"Let Thine Yad help me; for I have chosen Thy pikkudim."},{"num":174,"verse":"I have longed for Thy Yeshuah (salvation), Hashem; and Thy torah is my delight."},{"num":175,"verse":"Let my nefesh live, and it shall praise Thee; and let Thy mishpatim sustain me."},{"num":176,"verse":"I have gone astray like a seh oved (lost sheep); seek Thy eved; for I do not forget Thy mitzvot."}]