[{"num":119,"verse":"Alleluia. [Aleph]. Blessed be men without wem in the way; that go in the law of the Lord. (Alleluia. Happy be they whose lives be without blemish, or without fault; who walk in the Law of the Lord.)"},{"num":2,"verse":"Blessed be they, that seek his witnessings; and seek him in all the heart. (Happy be they who obey his teachings, or his commands; and who seek him, or obey him, with all their heart.)"},{"num":3,"verse":"For they that work wickedness; went not in his ways. (For they who work wickedness, went not in his ways.)"},{"num":4,"verse":"Thou hast commanded; that thy behests be kept greatly. (Thou hast commanded, that thy precepts, or thy laws, be diligently kept.)"},{"num":5,"verse":"I would that my ways were (ad)dressed; to keep thy justifyings. (I desire that my ways be directed; so that I can obey thy statutes.)"},{"num":6,"verse":"Then I shall not be shamed; when I shall behold perfectly in(to) all thy behests. (Then I shall not be shamed, if I fix my eyes on thy commandments.)"},{"num":7,"verse":"I shall acknowledge to thee in the (ad)dressing of mine heart; in that that I learned the dooms of thy rightfulnesses. (I shall praise thee with my heart properly directed, when I have learned thy righteous judgements./I shall praise thee with a pure heart, when I have learned thy just decrees.)"},{"num":8,"verse":"I shall keep thy justifyings; forsake thou not me on each side. (I shall obey thy statutes; do not thou abandon me on any side/never desert thou me.)"},{"num":9,"verse":"[Beth]. In what thing amendeth a young waxing man his way? in keeping thy words. (How may a young man correct his way? by obeying thy words, or thy commands.)"},{"num":10,"verse":"In all mine heart I sought thee; put thou me not away from thy behests. (With all my heart I have sought thee; let me not stray from thy commandments.)"},{"num":11,"verse":"In mine heart I hid thy speeches; that I do not sin against thee. (I hid thy words in my heart; so that I will not sin against thee.)"},{"num":12,"verse":"Lord, thou art blessed; teach thou me thy justifyings. (Lord, blessed art thou; teach thou me thy statutes.)"},{"num":13,"verse":"In my lips I have pronounced; all the dooms of thy mouth. (With my lips I have declared, all the judgements, or the laws, from thy mouth.)"},{"num":14,"verse":"I delighted in the way of thy witnessings; (as much) as in all riches. (I delighted in the way of thy teachings, or thy commands; as much as in great riches.)"},{"num":15,"verse":"I shall be exercised, either busily occupied, in thy behests; and I shall behold thy ways. (I shall think about thy precepts; and I shall study thy ways.)"},{"num":16,"verse":"I shall bethink in thy justifyings; I shall not forget thy words. (I shall delight myself in thy statutes; I shall not forget thy words, or thy commands.)"},{"num":17,"verse":"[Gimel]. Yield to thy servant; quicken thou me, and I shall keep thy words. (Grant this to thy servant; that thou let me live, and that I obey thy commands.)"},{"num":18,"verse":"Lighten thou mine eyes; and I shall behold the marvels of thy law. (Open thou my eyes; and I shall see the marvels, or the wonders, that come forth from thy Law.)"},{"num":19,"verse":"I am a comeling in earth; hide thou not thy behests from me. (I am a newcomer, or a stranger, here on earth; hide thou not thy commandments from me.)"},{"num":20,"verse":"My soul coveted to desire thy justifyings; in all time. (My soul desireth to know thy judgements; at all times.)"},{"num":21,"verse":"Thou blamedest the proud; they be cursed, that bow away from thy behests. (Thou hast rebuked the proud; cursed be they who turn away from thy commandments.)"},{"num":22,"verse":"Do thou away from me shame and despising; for I sought thy witnessings. (Do thou away from me all shame and despising; for I have kept thy commands/for I have obeyed thy laws/for I have followed thy teachings.)"},{"num":23,"verse":"For why princes sat, and spake against me; but thy servant was exercised in thy justifyings. (For the rulers sit, and speak against me; but thy servant studied, and thought about, thy statutes/but thy servant shall study, and shall think about, thy statutes.)"},{"num":24,"verse":"For why and thy witnessings is my thinking; and my counsel is thy justifyings. (For thy teachings, or thy commands, be my delight; and they be my counsellors.)"},{"num":25,"verse":"[Daleth]. My soul cleaved to the pavement; quicken thou me by thy word. (My body lieth on the ground/lieth in the dust; grant thou me life according to thy word.)"},{"num":26,"verse":"I told out my ways, and thou heardest me; teach thou me thy justifyings. (I told thee all that I had done, and thou heardest me/and thou answeredest me; teach thou me thy statutes.)"},{"num":27,"verse":"Learn thou me the way of thy justifyings; and I shall be exercised in thy marvels. (Teach thou me the way of thy precepts; and I shall think about thy marvels, or thy wonders.)"},{"num":28,"verse":"My soul napped for, or because of, harm; confirm thou me in thy words. (I was harmed/My body was harmed, and could not sleep; strengthen thou me with thy words.)"},{"num":29,"verse":"Remove thou from me the way of wickedness; and in thy law have thou mercy on me. (Remove thou me, or keep me away, from the ways of wickedness; and in thy Law have mercy upon me.)"},{"num":30,"verse":"I chose the way of truth; I forgat not thy dooms (I did not forget thy judgements)."},{"num":31,"verse":"Lord, I cleaved to thy witnessings; do not thou shame me. (Lord, I have held fast to thy teachings, or thy commands; do not let me be shamed.)"},{"num":32,"verse":"I ran the way of thy commandments; when thou alargedest mine heart. (I shall go the way of thy commandments; for thou hast enlarged my heart.)"},{"num":33,"verse":"[He]. Lord, set thou to me a law, the way of thy justifyings; and I shall seek it ever[more]. (Lord, set thou thy Law before me, yea, the way of thy statutes; and I shall follow it forevermore.)"},{"num":34,"verse":"Give thou understanding to me, and I shall seek thy law; and I shall keep it in all mine heart. (Give thou understanding to me, and I shall follow thy Law; yea, I shall obey it with all my heart.)"},{"num":35,"verse":"Lead me forth in the path of thy behests; for I would it. (Lead me forth on the path of thy commandments; for I delight in them/for that is what I desire.)"},{"num":36,"verse":"Bow down mine heart into thy witnessings; and not into avarice. (Turn my heart to thy teachings, or thy commands; and not to greed.)"},{"num":37,"verse":"Turn thou away mine eyes, that they see not vanity; quicken thou me in thy way. (Turn thou away my eyes from the empty, and the worthless; grant thou me life in thy way.)"},{"num":38,"verse":"Ordain thy speech to thy servant; (who is) in thy dread. (Ordain thy word to thy servant; who feareth thee/who hath reverence for thee.)"},{"num":39,"verse":"Cut away my shame, which I supposed; for thy dooms be merry. (Turn away the shame, or the rebuke, which I fear; for thy judgements be good.)"},{"num":40,"verse":"Lo! I coveted thy commandments; quicken thou me in thine equity. (Lo! I desired to obey thy precepts; grant thou me life in thy righteousness.)"},{"num":41,"verse":"[Vau]. And, Lord, thy mercy come [up]on me; thine health come by thy speech. (And, Lord, let thy love come to me; let thy salvation, or thy deliverance, come according to thy word.)"},{"num":42,"verse":"And I shall answer a word to men saying shame to me; for I hoped in thy words. (And then I shall answer a word to those shaming me; for I put my trust in thy words.)"},{"num":43,"verse":"And take thou not away from my mouth the word of truth utterly; for I hoped above in thy dooms. (And never take away the word of truth from my mouth; for I put my hope in thy judgements, or in thy decrees.)"},{"num":44,"verse":"And I shall keep thy law ever[more]; into the world, and into the world of world. (And I shall obey thy Law forevermore; yea, forever and ever.)"},{"num":45,"verse":"And I went in largeness; for I sought thy commandments. (And I shall walk in freedom; for I have sought out thy commandments.)"},{"num":46,"verse":"And I spake of thy witnessings in the sight of kings; and I was not shamed. (And I shall speak of thy teachings, or thy commands, before kings; and I shall not be ashamed.)"},{"num":47,"verse":"And I bethought in thy behests; which I loved. (And I delight myself in thy commandments; which I love.)"},{"num":48,"verse":"And I raised mine hands to thy commandments, which I loved; and I shall be exercised in thy justifyings. (And I shall raise up my hands to thy commandments, which I love; and I shall think about thy statutes.)"},{"num":49,"verse":"[Zain]. Lord, have thou mind on thy word to thy servant (Lord, remember thy word to thy servant); in which word thou hast given hope to me."},{"num":50,"verse":"This comforted me in my lowness; for thy word quickened me. (This comforted me in my time of trouble; for thy word hath given me life.)"},{"num":51,"verse":"Proud men did wickedly (to me) by all things; but I bowed not away from thy law. (The proud and the boastful have scorned me in all things; but I have not turned away from thy Law.)"},{"num":52,"verse":"Lord, I was mindful of thy dooms from the world; and I was comforted. (Lord, I remember thy judgements of long ago; and I am comforted.)"},{"num":53,"verse":"Failing held me; for sinners forsaking thy law. (Anger taketh hold of me; when I think of the sinners who desert thy Law.)"},{"num":54,"verse":"Thy justifyings were delightable to me to be sung; in the place of my pilgrimage. (Thy statutes were delightful for me to sing about; here on my pilgrimage.)"},{"num":55,"verse":"Lord, I had mind of thy name by night; and I kept thy law. (Lord, I remember thy name in the night; and I obey thy Law.)"},{"num":56,"verse":"This thing was made to me; for I sought thy justifyings. (And this is true of me; that I have kept thy precepts/that I have obeyed thy commands.)"},{"num":57,"verse":"[Cheth]. Lord, my part; I said to keep thy law. (Lord, thou art my portion; I have said that I would obey thy Law.)"},{"num":58,"verse":"I besought thy face in all mine heart; have thou mercy on me by thy speech. (I sought thee out with all my heart; have thou mercy on me according to thy word.)"},{"num":59,"verse":"I bethought (on) my ways; and I turned my feet into thy witnessings. (I thought about my ways; and I have turned my feet to follow thy teachings.)"},{"num":60,"verse":"I am ready, and I am not troubled; to keep thy commandments. (I am ready, and I have not delayed, to obey thy commandments.)"},{"num":61,"verse":"The cords of sinners have embraced me; and I have not forgotten thy law. (The cords of the sinners have entangled me; but I have not forgotten thy Law.)"},{"num":62,"verse":"At midnight, I rose to acknowledge to thee; on the dooms of thy justifyings. (At midnight, I rise to give thee thanks/I rise to give thee praise; for all thy righteous judgements.)"},{"num":63,"verse":"I am partner of all that dread thee; and keep thy behests. (I am a partner of all who fear thee/I am a friend of all who revere thee; of all who obey thy precepts.)"},{"num":64,"verse":"Lord, the earth is full of thy mercy; teach thou me thy justifyings. (Lord, the earth is full of thy love; teach thou me thy statutes.)"},{"num":65,"verse":"[Teth]. Lord, thou hast done goodness with thy servant; by thy word. (Lord, thou hast been kind to thy servant; yea, according to thy word.)"},{"num":66,"verse":"Teach thou me goodness, and lore, either chastising, and knowing; for I believed to thy behests. (Teach thou me goodness, and knowledge, or discipline; for I trust in thy commandments.)"},{"num":67,"verse":"Before that I was made meek, I trespassed; therefore I kept thy speech. (Before that I was punished, I trespassed; but thereafter, I have obeyed thy word.)"},{"num":68,"verse":"Thou art good; and in thy goodness teach thou me thy justifyings. (Thou art good, and thou doest good; teach thou me thy statutes.)"},{"num":69,"verse":"The wickedness of them that be proud, is multiplied on me; but in all mine heart I shall seek thy behests. (The wicked lies of them, who be proud, be multiplied against me; but I shall follow thy precepts with all my heart.)"},{"num":70,"verse":"The heart of them is crudded, either made hard, as milk; but I bethought (on) thy law. (Their hearts be like curdled milk; but I delight in thy Law.)"},{"num":71,"verse":"It is good to me, that thou hast made me meek; that I learn thy justifyings. (It was good for me, that thou hast punished me; so that I would learn thy statutes.)"},{"num":72,"verse":"The law (out) of thy mouth is better to me; than thousands of gold and silver. (The Law from thy mouth meaneth more to me/is more valuable to me, than a fortune in gold and silver.)"},{"num":73,"verse":"[Jod]. Thine hands made me, and formed me; give thou understanding to me, that I learn thy behests. (Thy hands made me, and formed me; now give thou me understanding, so that I can learn thy commandments.)"},{"num":74,"verse":"They that dread thee shall see me, and they shall be glad; for I hoped more on thy words. (They who fear thee/They who revere thee, shall be glad when they see me; for I trust in thy words.)"},{"num":75,"verse":"Lord, I knew, that thy dooms be equity; and in thy truth thou hast made me meek. (Lord, I know, that thy judgements be just; and that thou hast punished me because of thy faithfulness.)"},{"num":76,"verse":"Thy mercy be made, that it comfort me; by thy speech to thy servant. (Let thy love comfort me; yea, according to thy word to thy servant.)"},{"num":77,"verse":"Thy merciful doings come to me, and I shall live; for thy law is my thinking. (Let thy mercy come to me, and then I shall live; for thy Law is my delight.)"},{"num":78,"verse":"They that be proud be shamed, for unjustly they did wickedness against me; but I shall be exercised in thy behests. (Let they who be proud be shamed, for unjustly, or for no reason, they did wickedly against me; but I shall think about thy precepts.)"},{"num":79,"verse":"They that dread thee be turned to me; and they that know thy witnessings. (Let they who fear thee/Let they who revere thee, turn to me; yea, all who know thy teachings.)"},{"num":80,"verse":"Mine heart be made unwemmed in thy justifyings; that I be not shamed. (Let my heart obey thy statutes, and be without blemish, or without fault; and so I shall not shamed.)"},{"num":81,"verse":"[Caph]. My soul failed into thine health; and I hoped more in thy word. (My soul fainteth waiting for thy salvation, or thy deliverance; but still I trust in thy word.)"},{"num":82,"verse":"Mine eyes failed into thy speech; saying, When shalt thou comfort me? (My eyes fail waiting for thy word; and so I ask, When shalt thou comfort me?)"},{"num":83,"verse":"For I am made as a bouget, (or a bottle,) in frost; (yet) I have not forgotten thy justifyings. (For I am shriveled up, like a wineskin in the smoke; but I have not forgotten thy statutes.)"},{"num":84,"verse":"How many be the days of thy servant; when thou shalt make doom of them that pursue me? (How many days must thy servant wait? when shalt thou bring judgement upon those who persecute me?)"},{"num":85,"verse":"Wicked men told to me janglings; but (they be) not as thy law. (The wicked gossiped about me; and they do not obey thy Law.)"},{"num":86,"verse":"All thy commandments be truth; wicked men have pursued me, help thou me. (All thy commandments be faithful/be trustworthy, and shall stand forever; the wicked persecute me, help thou me!)"},{"num":87,"verse":"Almost they ended me in [the] earth; but I forsook not thy commandments. (Yea, they almost brought me to an end here on the earth; but I did not forsake thy precepts.)"},{"num":88,"verse":"By thy mercy quicken thou me; and I shall keep the witnessings of thy mouth. (In thy mercy/In thy love, grant thou me life; so that I can obey the teachings from thy mouth.)"},{"num":89,"verse":"[Lamed]. Lord, thy word dwelleth in heaven; [into] without end. (Lord, thy word remaineth, or liveth, in heaven, forever.)"},{"num":90,"verse":"Thy truth dwelleth in generation, and into generation; thou hast founded the earth, and it dwelleth. (Thy faithfulness remaineth for all generations; thou hast founded the earth, and it still remaineth.)"},{"num":91,"verse":"The day lasteth continually by thy ordinance(s); for all things serve to thee. (All things continue to this day according to thy ordinances; for all things serve thee./Thy ordinances, or thy decrees, continue to this day; for all things serve thee.)"},{"num":92,"verse":"But for thy law was my thinking; then peradventure I had perished in my lowness. (If thy Law had not been my delight; then I would have perished in my time of trouble.)"},{"num":93,"verse":"[Into] Without end I shall not forget thy justifyings; for in those thou hast quickened me. (I shall never forget thy precepts; for through them thou hast given me life.)"},{"num":94,"verse":"I am thine, make thou me safe; for I have sought thy justifyings. (I am thine, save thou me; for I have sought out thy precepts.)"},{"num":95,"verse":"Sinners abode me, for to lose me; I understood thy witnessings. (The sinners have waited for me, to destroy me; but I shall think about thy teachings.)"},{"num":96,"verse":"I saw the end of all end; thy commandment is full large. (I have seen the end of the end/I have seen that all things must end; but thy commandment shall go on forever.)"},{"num":97,"verse":"[Mem]. Lord, how loved I thy law; all day it is my thinking. (Lord, how I love thy Law! I think about it all day long.)"},{"num":98,"verse":"Above mine enemies thou madest me prudent by thy commandment; for it is to me [into] without end. (By thy commandments, thou hast made me more prudent than all my enemies; for thy commandments shall be with me forever.)"},{"num":99,"verse":"I understood over all men teaching me; for thy witnessings is my thinking. (I have more understanding than all those who teach me; because I think about thy teachings.)"},{"num":100,"verse":"I understood above eld men; for I sought thy commandments. (I have more understanding than the old men, that is, the elders; because I have kept thy precepts.)"},{"num":101,"verse":"I forbade my feet from all evil way; that I keep thy words (so that I obey thy commands)."},{"num":102,"verse":"I bowed not from thy dooms; for thou hast set law to me. (I turned not away from thy judgements; for thou thyself hast taught me.)"},{"num":103,"verse":"Thy speeches be full sweet to my cheeks; above honey to my mouth. (Thy words be exceedingly sweet to my taste; yea, sweeter in my mouth than honey.)"},{"num":104,"verse":"I understood of thy behests; therefore I hated all the ways of wickedness. (I gained understanding through thy precepts; and now I hate all wicked ways.)"},{"num":105,"verse":"[Nun]. Thy word is a lantern to my feet; and (a) light to my paths."},{"num":106,"verse":"I swore, and purposed steadfastly; to keep the dooms of thy rightfulness. (I swore, and steadfastly purposed, to obey thy righteous judgements.)"},{"num":107,"verse":"I am made low by all things; Lord, quicken thou me by thy word. (I am brought down so very low, that is, I am greatly afflicted; Lord, grant thou me life according to thy word.)"},{"num":108,"verse":"Lord, make thou well pleasing the willful things of my mouth; and teach thou me thy dooms. (Lord, accept thou the willing offerings, or the tributes, from my mouth; and teach thou me thy judgements.)"},{"num":109,"verse":"My soul is ever[more] in mine hands; and I forgat not thy law. (My life is in my hands forevermore/My life is always in my hands; yet I never forget thy Law.)"},{"num":110,"verse":"Sinners setted a snare to me; and I erred not from thy commandments. (Sinners set a snare for me; but I did not stray from thy precepts.)"},{"num":111,"verse":"I purchased thy witnessings by heritage [into] without end; for those be the full joying of mine heart. (Thy teachings be my inheritance forever; yea, they be the full out joy of my heart.)"},{"num":112,"verse":"I bowed mine heart to do thy justifyings [into] without end; for reward. (I committed my heart to follow thy statutes; for they be my reward forever/for they shall be my reward until the day I die.)"},{"num":113,"verse":"[Samech]. I hated wicked men; and I loved thy law. (I hate the wicked; but I love thy Law.)"},{"num":114,"verse":"Thou art mine helper, and mine up-taker; and I hoped more in thy word. (Thou art my helper, and my defender; I put my hope in thy word.)"},{"num":115,"verse":"Ye wicked men, bow away from me; and I shall seek the commandments of my God. (All ye wicked people, go away from me; so that I can obey my God’s commandments.)"},{"num":116,"verse":"Up-take thou me by thy word, and I shall live; and shame thou not me for mine abiding. (Lift up thou me/Strengthen thou me according to thy word, so that I may live; and do not let me be shamed for trusting in thee.)"},{"num":117,"verse":"Help thou me, and I shall be safe; and I shall bethink ever[more] in thy justifyings. (Help thou me, and I shall be saved; and I shall think about thy statutes forevermore.)"},{"num":118,"verse":"Thou hast forsaken all men going away from thy dooms; for the thought of them is unjust. (Thou hast abandoned all who stray, or who go away, from thy statutes; for their thoughts be not just, or proper.)"},{"num":119,"verse":"I areckoned all the sinners of earth (to be) breakers of the law; therefore I loved thy witnessings. (Thou reckonest all the wicked of the earth to be but drit, or dirt; and so I love thy teachings.)"},{"num":120,"verse":"Nail thou my flesh with thy dread; for I dreaded of thy dooms. (My flesh shaketh in fear of thee; because I fear thy judgements/because I revere thy justice.)"},{"num":121,"verse":"[Ain]. I did doom and rightwiseness; betake thou not me to them that falsely challenge me. (I did what is just and right; so do not thou deliver me up to those who will oppress me.)"},{"num":122,"verse":"Take up thy servant into goodness; they that be proud challenge not me. (Yea, protect thy servant; let not those who be proud oppress me.)"},{"num":123,"verse":"Mine eyes failed into thine health; and into the speech of thy rightfulness. (My eyes fail looking for thy salvation, or for thy deliverance; and for the word of thy righteousness.)"},{"num":124,"verse":"Do thou with thy servant after thy mercy; and teach thou me thy justifyings. (Do thou with thy servant according to thy love; and teach thou me thy statutes.)"},{"num":125,"verse":"I am thy servant; give thou understanding to me, that I know thy witnessings (so that I can know thy teachings)."},{"num":126,"verse":"Lord, it is time to do; they have destroyed thy law. (Lord, it is time to act; for they have destroyed thy Law.)"},{"num":127,"verse":"Therefore I loved thy commandments; more than gold and topaz. (Truly I love thy commandments; yea, more than gold and topaz.)"},{"num":128,"verse":"Therefore I was (ad)dressed to all thy behests; I hated all wicked way. (And so I am directed, or guided, by all thy precepts; and I hate all wicked ways.)"},{"num":129,"verse":"[Pe]. Lord, thy witnessings be wonderful; therefore my soul sought those. (Lord, thy teachings be wonderful; and so my soul gladly keepeth them/and so I gladly obey them.)"},{"num":130,"verse":"Declaring of thy words lighteneth; and it giveth understanding to meek men. (The declaring, or the exposition, of thy words bringeth light, or enlightenment; and it giveth understanding even to the simple, or the untaught.)"},{"num":131,"verse":"I opened my mouth, and drew the spirit (and drew my breath, yea, I panted); for I desired thy commandments."},{"num":132,"verse":"Behold thou on me, and have mercy on me; by the doom of them that love thy name. (Look thou upon me, and have mercy on me; as thou hast decreed thou shalt do, for those who love thy name.)"},{"num":133,"verse":"(Ad)dress thou my goings by thy speech; that all unrightfulness have not lordship on me. (Direct thou my ways according to thy word; and do not let any unrighteousness have lordship, or rule, over me.)"},{"num":134,"verse":"Again-buy thou me from the false challenges of men; that I keep thy behests. (Save thou me from those who would oppress me; so that I can obey thy precepts.)"},{"num":135,"verse":"Lighten thy face on thy servant; and teach thou me thy justifyings. (Let thy face shine upon thy servant; and teach thou me thy statutes.)"},{"num":136,"verse":"Mine eyes led forth the outgoings of waters; for they kept not thy law. (My eyes stream with tears; because of those who do not obey thy Law.)"},{"num":137,"verse":"[Tzaddi]. Lord, thou art just; and thy doom is rightful. (Lord, thou art just; and thy judgements, or thy decrees, be righteous.)"},{"num":138,"verse":"Thou hast commanded rightfulness, thy witnessings; and thy truth greatly to be kept. (The teachings that thou hast commanded be right, and true; and greatly to be obeyed.)"},{"num":139,"verse":"My fervent love made me to be melted, either languished; for mine enemies forgat thy words. (My fervent love for thee made me feel greatly distressed; because my enemies did not obey thy words.)"},{"num":140,"verse":"Thy speech is set afire; and thy servant loved it. (Thy word is tried by fire; and thy servant loveth it.)"},{"num":141,"verse":"I am young, and despised; I forgat not thy justifyings. (I am young and despised; but I do not forget thy precepts.)"},{"num":142,"verse":"Lord, thy rightfulness is rightfulness [into] without end; and thy law is truth. (Lord, thy righteousness is righteousness forever; and thy Law is true forever/and thy Law is the truth forever.)"},{"num":143,"verse":"Tribulation and anguish have found me; thy behests is my thinking. (Though trouble and anguish have found me; thy commandments still be my delight.)"},{"num":144,"verse":"Thy witnessings is equity [into] without end (Thy teachings be just forever); give thou understanding to me, and I shall live."},{"num":145,"verse":"[Koph]. I cried in all mine heart, Lord, hear thou me; I shall seek thy justifyings. (I cried with all my heart, O Lord, please answer me; for I shall follow thy statutes.)"},{"num":146,"verse":"I cried to thee, make thou me safe; that I keep thy commandments. (I cried to thee, save thou me; so that I can keep thy commandments/and I shall obey thy commandments.)"},{"num":147,"verse":"I before came in ripeness, and I cried; I hoped above on thy words. (I came before thee in the morning; I have great hope in thy words.)"},{"num":148,"verse":"Mine eyes before came to thee full early; that I should bethink (on) thy speeches. (My eyes be open through the night/I lie awake all night; so that I can think about thy words.)"},{"num":149,"verse":"Lord, hear thou my voice by thy mercy; and quicken thou me by thy doom. (Lord, hear thou me in thy mercy; and grant thou me life according to thy judgement./Lord, hear thou me in thy love; and grant thou me life by thy decree.)"},{"num":150,"verse":"They that pursue me nighed to wickedness; forsooth they be made far from thy law. (They who pursue me approach near to wickedness; and they be made far from thy Law./They who wickedly pursue me come near to me; but they be made far from thy Law.)"},{"num":151,"verse":"Lord, thou art nigh; and all thy ways be truth. (Lord, thou art near; and all thy commandments be true.)"},{"num":152,"verse":"In the beginning I knew of thy witnessings; for thou hast founded those [into] without end. (Long ago I knew of thy teachings; for thou hast founded them to last forever.)"},{"num":153,"verse":"[Resh]. See thou my meekness, and deliver thou me; for I forgat not thy law. (See thou my troubles, and save thou me; for I have not forgotten thy Law.)"},{"num":154,"verse":"Deem thou my doom, and again-buy thou me; quicken me for thy speech. (Judge thou my case, and buy thou me back, that is, rescue me; yea, grant thou me life according to thy word, or thy promise.)"},{"num":155,"verse":"Health is far from sinners; for they sought not thy justifyings. (Salvation is far from sinners; for they did not search out thy statutes/for they do not obey thy laws.)"},{"num":156,"verse":"Lord, thy mercies be many; quicken thou me by thy doom. (Lord, thy constant love is great; grant thou me life according to thy judgement./Lord, thy mercy is great; grant thou me life by thy decree.)"},{"num":157,"verse":"They be many that pursue me, and do tribulation to me; I bowed not away from thy witnessings. (There be many who persecute me, and give me trouble; but I have not turned away from thy teachings.)"},{"num":158,"verse":"I saw breakers of the law, and I was melted, either languished; for they kept not thy speeches. (I saw the law-breakers, and I was greatly distressed; for they did not obey thy words, or thy commands.)"},{"num":159,"verse":"Lord, see thou, for I loved thy commandments; quicken thou me in thy mercy. (Lord, see thou, how I love thy precepts; grant thou me life according to thy love.)"},{"num":160,"verse":"The beginning of thy word is truth; all the dooms of thy rightwiseness be [into] without end. (The beginning of thy word is truth; and all thy righteous judgements be forever.)"},{"num":161,"verse":"[Schin]. Princes pursued me without cause; and my heart dreaded of thy words. (The rulers persecuted me for no reason; but my heart is in awe of thy words.)"},{"num":162,"verse":"I shall be glad on thy speeches; as he that findeth many spoils. (I shall be glad, or rejoice, in thy words; yea, like he who findeth much prey.)"},{"num":163,"verse":"I hated and loathed wickedness; forsooth I loved thy law. (I hate and loathe all lies; but I love thy Law.)"},{"num":164,"verse":"I said praisings to thee seven times in the day; on the dooms of thy rightfulness. (Seven times a day I praise thee; for thy righteous judgements/for thy rightful decrees.)"},{"num":165,"verse":"Much peace is to them that love thy law; and no cause of stumbling is to them. (There is much peace for those who love thy Law; and they have no reason to slip, or to stumble.)"},{"num":166,"verse":"Lord, I abode thine health; and I loved thy behests. (Lord, I wait for thy salvation, or thy deliverance; and I follow thy commandments.)"},{"num":167,"verse":"My soul kept thy witnessings; and loved those greatly. (I obey thy teachings; and I love them so very much.)"},{"num":168,"verse":"I kept thy commandments, and thy witnessings; for all my ways be in thy sight. (I obey thy precepts, and thy teachings; and all my ways be before thee.)"},{"num":169,"verse":"[Tau]. Lord, my beseeching come nigh in thy sight; by thy speech give thou understanding to me. (Lord, let my plea come before thee; give thou me understanding of thy word/give thou me understanding according to thy word.)"},{"num":170,"verse":"Mine asking enter into thy sight; by thy speech deliver thou me. (Let my asking come before thee; save thou me according to thy word.)"},{"num":171,"verse":"My lips shall tell out an hymn; when thou hast taught me thy justifyings. (My lips shall tell out thy praises/My lips shall praise thee; because thou hast taught me thy statutes.)"},{"num":172,"verse":"My tongue shall pronounce thy speech; for why all thy commandments be equity. (My tongue shall tell out thy word; for all thy commandments be just, or fair.)"},{"num":173,"verse":"Thine hand be made, that it save me; for I have chosen thy behests. (Let thy hand swiftly save me; for I have chosen thy precepts.)"},{"num":174,"verse":"Lord, I coveted thine health; and thy law is my thinking. (Lord, I desire thy salvation, or thy deliverance; and thy Law is my delight.)"},{"num":175,"verse":"My soul shall live, and it shall praise thee; and thy dooms shall help me. (Let me live, and I shall praise thee; and let thy judgements help me/and let thy decrees guide me.)"},{"num":176,"verse":"I erred as a sheep that perished; Lord, seek thy servant, for I forgat not thy commandments. (I have wandered about like a lost sheep; Lord, search for thy servant, for I have not forgotten thy commandments.)"}]