[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(10) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Surely.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The text of this verse as it stands is unintelligible—",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "“Surely the wrath of man shall praise Thee;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The residue of wrath Thou shalt gird Thyself with.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "But the LXX. and Vulg. suggest the necessary emendation—",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "“ Surely the wrath of man shall praise Thee,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And the residue of wraths do Thee honour,”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "where the residue of wrath, like Virgil’s reliquiœ Danaum (Æn. 1:30), means those that escape the enemies’ rage, i.e., the Israelites. Possibly we should render, “and those who remain from their wrath shall celebrate a festival,” since the suggested emendation is the word used in that sense. And we must therefore think of the escape of Israel from Egypt (see above), and the festival which was so repeatedly announced to Pharaoh, as the purpose of their exodus. (See Burgess, Notes on the Hebrew Psalms.)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "where the residue of wrath, like Virgil’s ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "reliquiœ Danaum ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "(Æ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "n. ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "1:30), means those that escape the enemies’ rage, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "i.e., ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "the Israelites. Possibly we should render, “and those who remain from their wrath shall celebrate a festival,” since the suggested emendation is the word used in that sense. And we must therefore think of the escape of Israel from Egypt (see above), and the festival which was so repeatedly announced to Pharaoh, as the purpose of their exodus. (See Burgess, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Notes on the Hebrew Psalms.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ")",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 76:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 76:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Surely the wrath of man shall praise thee — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The furious attempts and blasphemous speeches of thine enemies shall serve thy glory, and cause thy people and others to praise and magnify thee for that admirable wisdom, power, faithfulness, and goodness which thou didst discover on that occasion. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The remainder of wrath shalt thou restrain — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Thou shalt prevent and disappoint the succeeding malicious designs of thine enemies, who will meditate revenge for those shameful and terrible overthrows. Or, as the Hebrew may be properly rendered, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "with the remainder of wrath shalt thou gird thyself; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "that is, thou shalt put it on as an ornament, which the girdle was; thou shalt adorn thyself with it as a conqueror adorns himself with the spoils of his enemies.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "76:7-12 God's people are the meek of the earth, the quiet in the land, that suffer wrong, but do none. The righteous God seems to keep silence long, yet, sooner or later, he will make judgment to be heard. We live in an angry, provoking world; we often feel much, and are apt to fear more, from the wrath of man. What will not turn to his praise, shall not be suffered to break out. He can set bounds to the wrath of man, as he does to the raging sea; hitherto it shall come, and no further. Let all submit to God. Our prayers and praises, and especially our hearts, are the presents we should bring to the Lord. His name is glorious, and he is the proper object of our fear. He shall cut off the spirit of princes; he shall slip it off easily, as we slip off a flower from the stalk, or a bunch of grapes from the vine; so the word signifies. He can dispirit the most daring: since there is no contending with God, it is our wisdom, as it is our duty, to submit to him. Let us seek his favour as our portion, and commit all our concerns to him.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Surely the wrath of man shall praise thee - It shall be the occasion of praise; or, honor shall accrue to thee from it, \"as if\" it were employed in thy praise, and \"as if\" it were voluntarily engaged in promoting thy glory. The deliverance of the people by the direct interposition of God in the case referred to in the psalm, the sudden and entire overthrow of the invading forces by his power, led to this reflection. The overruling power of God was displayed. The \"wrath\" of the invading host had given occasion for this manifestation of the divine perfections; or, in other words, his character would not have been displayed in this manner if it had not been for these wicked purposes of people. It is not that there was anything in the wrath itself, or in their plans or intentions, that was in itself \"adapted\" to honor God; but that it was overruled by him, so that he took \"occasion\" from it to display his own character.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The wicked conduct of a child is an \"occasion\" for the display of the just character and the wise administration of a parent; the act of a pirate, a rebel, a murderer, furnishes an \"occasion\" for the display of the just principles of law, and the stability and power of a government. In like manner, the sins of the wicked are made an occasion for the display of the divine perfections in maintaining law; in the administering of justice; in preserving order. But there is another sense, also, in which the wrath of man is made the occasion for glorifying God. It is, that since there is such wrath, or since there are such wicked purposes, God makes use of that wrath, or of those wicked purposes, as he does of the powers of nature - of pestilence, disease, and storms, as instruments to accomplish his own designs, or to bring about great results. Thus he made use of the treasonable purpose of Judas, and the mad passions and the angry feelings of the Jews, in bringing about the work of redemption by the death of his Son; thus be made use of the purposes of Sennacherib in order to punish his own people (see the notes at Isaiah 10:5-7); thus he employed Cyrus to \"execute his counsel\" Isaiah 46:10; and thus he made use of the wrath evinced in persecuting the church to secure its permanent establishment in the world. Whether these things could be accomplished \"without\" that wrath, is a question which is too high for man to determine. It is certain, also, that the fact that God overrules the wrath of people does not justify that wrath. The purposes of people are, like the pestilence and the storm, what they are in themselves; and the nature of their conduct is not affected by any use that God may make of it. People must be judged according to their own deeds, not for what God does through their wickedness.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The wicked conduct of a child is an \"occasion\" for the display of the just character and the wise administration of a parent; the act of a pirate, a rebel, a murderer, furnishes an \"occasion\" for the display of the just principles of law, and the stability and power of a government. In like manner, the sins of the wicked are made an occasion for the display of the divine perfections in maintaining law; in the administering of justice; in preserving order. But there is another sense, also, in which the wrath of man is made the occasion for glorifying God. It is, that since there is such wrath, or since there are such wicked purposes, God makes use of that wrath, or of those wicked purposes, as he does of the powers of nature - of pestilence, disease, and storms, as instruments to accomplish his own designs, or to bring about great results. Thus he made use of the treasonable purpose of Judas, and the mad passions and the angry feelings of the Jews, in bringing about the work of redemption by the death of his Son; thus be made use of the purposes of Sennacherib in order to punish his own people (see the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 10:5-7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); thus he employed Cyrus to \"execute his counsel\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 46:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and thus he made use of the wrath evinced in persecuting the church to secure its permanent establishment in the world. Whether these things could be accomplished \"without\" that wrath, is a question which is too high for man to determine. It is certain, also, that the fact that God overrules the wrath of people does not justify that wrath. The purposes of people are, like the pestilence and the storm, what they are in themselves; and the nature of their conduct is not affected by any use that God may make of it. People must be judged according to their own deeds, not for what God does through their wickedness.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The remainder of wrath - The word \"remainder\" here - שׁארית  she'êrı̂yth - means properly \"part;\" what remains, especially after a defeat or slaughter - the \"survivors\" of a battle, Jeremiah 11:23; Jeremiah 44:14; Micah 7:18; Zephaniah 2:7. Gesenius renders it here (Lexicon) \"extreme wrath,\" retained even in extremity. The Septuagint, ἐγκατάλειμμα  engkataleimma - \"the things which are left.\" So the Vulgate, \"reliquice.\" Luther, \"When men rage against thee, thou turnest it to honor; and when they rage yet more, thou art yet prepared.\" Venema supposes that the meaning is the whole wrath. As in Arabic the word used here means \"wholeness,\" or the whole of anything; and according to this, the idea would be that it was not merely wrath in general, or in a general sense, that would be made use of, but all that there was in wrath; it would all be made use of in advancing the divine purposes. The allusion seems to be to something that had been laid up in a magazine - as provision or arms, when the soldier went forth to war - which he would make use of if necessary, so that \"all\" might be ultimately consumed or employed. The control of God was over \"this\" as well as over that which was actually employed; he could overrule that which was employed. He could restrain people from at all using this that was kept in reserve. The idea seems to be that all the \"wrath\" which is \"manifested\" among people would be made to praise God, or would be overruled for his glory - and \"all\" which would \"not\" contribute to this end he would keep back, he would check; he would prevent its being put forth - so that \"all\" should be under his control, and \"all\" disposed of as he should will. There was nothing in the heart or the purposes of man that was beyond his jurisdiction or control; man could do nothing in his wrathful plans that God could not dispose of in his own way, and for his own honor.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The remainder of wrath - The word \"remainder\" here - שׁארית  she'êrı̂yth - means properly \"part;\" what remains, especially after a defeat or slaughter - the \"survivors\" of a battle, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 11:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 44:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 7:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zephaniah 2:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Gesenius renders it here (Lexicon) \"extreme wrath,\" retained even in extremity. The Septuagint, ἐγκατάλειμμα  engkataleimma - \"the things which are left.\" So the Vulgate, \"reliquice.\" Luther, \"When men rage against thee, thou turnest it to honor; and when they rage yet more, thou art yet prepared.\" Venema supposes that the meaning is the whole wrath. As in Arabic the word used here means \"wholeness,\" or the whole of anything; and according to this, the idea would be that it was not merely wrath in general, or in a general sense, that would be made use of, but all that there was in wrath; it would all be made use of in advancing the divine purposes. The allusion seems to be to something that had been laid up in a magazine - as provision or arms, when the soldier went forth to war - which he would make use of if necessary, so that \"all\" might be ultimately consumed or employed. The control of God was over \"this\" as well as over that which was actually employed; he could overrule that which was employed. He could restrain people from at all using this that was kept in reserve. The idea seems to be that all the \"wrath\" which is \"manifested\" among people would be made to praise God, or would be overruled for his glory - and \"all\" which would \"not\" contribute to this end he would keep back, he would check; he would prevent its being put forth - so that \"all\" should be under his control, and \"all\" disposed of as he should will. There was nothing in the heart or the purposes of man that was beyond his jurisdiction or control; man could do nothing in his wrathful plans that God could not dispose of in his own way, and for his own honor.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Shalt thou restrain - The word used here - חגר  châgar - means literally to bind around; to gird; to gird up, as of a garment or sword that is girded on, 1 Samuel 17:39; 1 Samuel 25:13; Psalm 45:3; or sackcloth, Isaiah 15:3; Jeremiah 49:3. The Septuagint renders this, \"and the remainder of wrath shall make a feast to thee,\" ἐορτάσει σοί  heortasei soi - that is, it shall praise or honor thee as in a festival. So the Vulgate. Prof. Alexander renders it, \"Shalt thou gird about thee;\" that is, God would gird it on as a sword, and would make use of it as a weapon for executing his own purposes. So DeWette, \"And with the last wrath thou shalt gird thyself.\" Others render it, \"Thou restrainest the remainder of thy wrath\" - that is, punishment - \"when the wrath of man will not promote the knowledge of thyself\" It seems to me, however, that our translators have expressed the exact idea in the psalm; and the meaning is, that the whole of the wrath of man is under the control of God, and that whatever there is, or would be, in the manifestation of that wrath, or in carrying out the purposes of the heart, which could not, in the circumstances, be made to promote his glory, or which would do injury, he would check and restrain. He would suffer it to proceed no further than he chose, and would make it certain that there should be no exhibition of wrathful feelings on the part of man which would not, in some way, be made to promote his honor, and to advance his own great purposes. He has absolute control over the passions of people, as he has over the pestilence, over earthquakes, and over storms, and can make all tributary to his glory, and executioners of his will. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Shalt thou restrain - The word used here - חגר  châgar - means literally to bind around; to gird; to gird up, as of a garment or sword that is girded on, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 17:39",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 25:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 45:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; or sackcloth, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 15:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 49:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The Septuagint renders this, \"and the remainder of wrath shall make a feast to thee,\" ἐορτάσει σοί  heortasei soi - that is, it shall praise or honor thee as in a festival. So the Vulgate. Prof. Alexander renders it, \"Shalt thou gird about thee;\" that is, God would gird it on as a sword, and would make use of it as a weapon for executing his own purposes. So DeWette, \"And with the last wrath thou shalt gird thyself.\" Others render it, \"Thou restrainest the remainder of thy wrath\" - that is, punishment - \"when the wrath of man will not promote the knowledge of thyself\" It seems to me, however, that our translators have expressed the exact idea in the psalm; and the meaning is, that the whole of the wrath of man is under the control of God, and that whatever there is, or would be, in the manifestation of that wrath, or in carrying out the purposes of the heart, which could not, in the circumstances, be made to promote his glory, or which would do injury, he would check and restrain. He would suffer it to proceed no further than he chose, and would make it certain that there should be no exhibition of wrathful feelings on the part of man which would not, in some way, be made to promote his honor, and to advance his own great purposes. He has absolute control over the passions of people, as he has over the pestilence, over earthquakes, and over storms, and can make all tributary to his glory, and executioners of his will. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10. Man's wrath praises God by its futility before His power.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "restrain—or, \"gird\"; that is, Thyself, as with a sword, with which to destroy, or as an ornament to Thy praise.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The wrath of man shall praise thee; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the blasphemous speeches and furious attempts of thine enemies shall serve thy glory, and cause thy people and others to praise and magnify thee for that admirable wisdom, and power, and faithfulness, and goodness which thou shalt discover upon that occasion. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The remainder of wrath shalt thou restrain; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " thou shalt prevent and disappoint the succeeding malicious designs of thine enemies, who will meditate revenge for those shameful and terrible overthrows. Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "the remainder of wrath thou shalt gird thyself with, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. put it on as an ornament, which the girdle was; thou shalt adorn thyself with it, as a conqueror doth with the spoils of his enemies. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Surely the wrath of man shall praise thee,.... Either the wrath which comes from God, and has man for its object; and that either as it regards the people of God; so the Targum, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"when thou art angry with thy people, thou hast mercy on them, and they shall confess unto thy name;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "or praise thee; see Isaiah 12:1, they are deserving of the wrath of God, but are not appointed to it, and are delivered from it by Christ, who bore it for them as their representative; by which as the justice of God is glorified, it is matter of praise to them; when the law enters into their consciences, it works wrath there, which being removed by the application of pardoning grace, is an occasion of praise to God; and whereas, under afflictive dispensations, they apprehend and deprecate the wrath of God, when they are delivered from them their mouths are filled with songs of praise: or, as it regards wicked men, so it came forth upon the old world, and drowned it; upon Sodom and Gomorrah, and reduced them to ashes; upon Pharaoh and the Egyptians, in the plagues inflicted on them; all which turned to the praise and glory of God; of the last instance, see Romans 9:17, it came upon the wicked Jews to the uttermost in the destruction of their nation, city, and temple; and upon Rome Pagan, in the entire demolition of it as such; and so it will come upon Rome Papal, which will be attended with great joy, praise, and thanksgiving in the saints; see Revelation 11:17 or else this is to be understood of the wrath which is in man, and comes forth from him, and has him for its subject; which though it does not work the righteousness of God, yet the righteousness of God is glorified both in checking and punishing it; and the more it rages and burns against the people of God, the greater reason have they to praise the Lord when delivered from it; see Psalm 124:1, so the wrath of the Assyrian monarch, and of railing and blaspheming Rabshakeh, gave the people of the Jews a greater occasion to praise the Lord for their wonderful deliverance; so the wrath of men against Christ, his church and people, his ministers, Gospel, and ordinances, will all turn to the glory of his name, when in the issue it will be seen that these are established, overcoming all the rage and malice of men: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "or praise thee; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 12:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", they are deserving of the wrath of God, but are not appointed to it, and are delivered from it by Christ, who bore it for them as their representative; by which as the justice of God is glorified, it is matter of praise to them; when the law enters into their consciences, it works wrath there, which being removed by the application of pardoning grace, is an occasion of praise to God; and whereas, under afflictive dispensations, they apprehend and deprecate the wrath of God, when they are delivered from them their mouths are filled with songs of praise: or, as it regards wicked men, so it came forth upon the old world, and drowned it; upon Sodom and Gomorrah, and reduced them to ashes; upon Pharaoh and the Egyptians, in the plagues inflicted on them; all which turned to the praise and glory of God; of the last instance, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 9:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", it came upon the wicked Jews to the uttermost in the destruction of their nation, city, and temple; and upon Rome Pagan, in the entire demolition of it as such; and so it will come upon Rome Papal, which will be attended with great joy, praise, and thanksgiving in the saints; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 11:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " or else this is to be understood of the wrath which is in man, and comes forth from him, and has him for its subject; which though it does not work the righteousness of God, yet the righteousness of God is glorified both in checking and punishing it; and the more it rages and burns against the people of God, the greater reason have they to praise the Lord when delivered from it; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 124:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", so the wrath of the Assyrian monarch, and of railing and blaspheming Rabshakeh, gave the people of the Jews a greater occasion to praise the Lord for their wonderful deliverance; so the wrath of men against Christ, his church and people, his ministers, Gospel, and ordinances, will all turn to the glory of his name, when in the issue it will be seen that these are established, overcoming all the rage and malice of men: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "the remainder of wrath shall thou restrain: that which remains in a man's breast, he has not yet vented, God can and does keep in, that it may not break forth; this very likely was verified in Sennacherib, who might breathe revenge, and threaten the Jews with a second visit; but was prevented by a sudden and violent death. Some read the words, \"the remainder of wraths thou wilt gird\" (d); that is, those that remain, and are not destroyed through the rage and fury of men, God will gird with strength to defend themselves, and resist their enemies that may rise up against them, or with gladness, because of deliverance from them; see Psalm 18:32. Some understand this of the wrath of God, which he has in reserve and store for wicked men, and render the words thus, with the remainder of wrath wilt thou gird thyself (e); and so come forth like an armed man, clad with zeal, and arrayed with the garments of wrath and vengeance; see Isaiah 49:17. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "the remainder of wrath shall thou restrain: that which remains in a man's breast, he has not yet vented, God can and does keep in, that it may not break forth; this very likely was verified in Sennacherib, who might breathe revenge, and threaten the Jews with a second visit; but was prevented by a sudden and violent death. Some read the words, \"the remainder of wraths thou wilt gird\" (d); that is, those that remain, and are not destroyed through the rage and fury of men, God will gird with strength to defend themselves, and resist their enemies that may rise up against them, or with gladness, because of deliverance from them; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 18:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Some understand this of the wrath of God, which he has in reserve and store for wicked men, and render the words thus, with the remainder of wrath wilt thou gird thyself (e); and so come forth like an armed man, clad with zeal, and arrayed with the garments of wrath and vengeance; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 49:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(d)   \"res duum irarum accinges\", Pagninus, Montanus, Vatablus, Piscator, Gejerus. (e) \"Reliquo indignationum accinges te\", so some in Vatablus; \"residuo irarum accinges te\", Michaelis. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(d)   \"res duum irarum accinges\", Pagninus, Montanus, Vatablus, Piscator, Gejerus. (e) \"Reliquo indignationum accinges te\", so some in Vatablus; \"residuo irarum accinges te\", Michaelis. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Surely the {g} wrath of man shall praise thee: the remainder of wrath shalt thou restrain.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Surely the ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{g}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " wrath of man shall praise thee: the remainder of wrath shalt thou restrain.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(g) For the end will show that the enemy was able to bring nothing to pass: also you will bridle their rage that they will not accomplish their purpose.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the wrath of man shall praise thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] All rebellion against God’s will must in the end redound to God’s glory: it serves to set His sovereignty in a clearer light (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 9:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Excellently the P.B.V., ‘shall turn to thy praise.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the remainder of wrath shalt thou restrain",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] All that will not submit shall be subdued. The sense is good, but it is very doubtful if the verb can bear this meaning. Hence R.V., The residue of wrath shalt thou gird upon thee. But whose wrath is meant? Surely it cannot be God’s wrath, with which He girds Himself to complete the destruction of the foe, for the reference of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "wrath",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in the two clauses of the verse to different persons is awkward, and it is difficult to see what can be meant by the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "residue",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of God’s wrath. Rather it must be, as in the preceding line, man’s wrath that is meant. God girds on Himself as an ornament the last futile efforts of human wrath, turning them to His own honour: or girds them on as a sword, making the wrath of His enemies to minister to their final discomfiture. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 33:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “Your spirit (i.e. wrath) is a fire which shall devour you.” The peculiar rendering of the LXX, “shall keep festival unto thee,” may however point to a different reading, meaning, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall honour thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The P.B.V. ‘the fierceness ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of them",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "’ is a misprint for ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of other",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the original rendering of the Great Bible. See Driver, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Par. Psalter",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", p. xviii.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "10–12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The lessons of judgement.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 10.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Surely the wrath of man shall praise thee.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The sentiment is general, but no doubt there is a special reference to the recent deliverance. The \"wrath of man,\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " man's wicked fury and hostility of God and his people, shall give occasion for great deeds on God's part - deeds which will bring him praise and honour. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The remainder of wrath shalt thou restrain",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Either, \"the unexpended fury of thine enemies, that which they have not vented, thou wilt hold in check, and prevent from doing mischief;\" or else,\" with thine own unexpended wrath wilt thou gird thyself against the wicked, as with a weapon.\" (So Kay, Cheyne, and the Revised Version.) Psalm 76:10",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The fact that has just been experienced is substantiated in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 76:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " from a universal truth, which has therein become outwardly manifest. The rage of men shall praise Thee, i.e., must ultimately redound to Thy glory, inasmuch as to Thee, namely (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 76:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as to syntax like ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 73:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), there always remains a שׁארית, i.e., a still unexhausted remainder, and that not merely of חמה, but of חמת, with which Thou canst gird, i.e., arm, Thyself against such human rage, in order to quench it. שׁארית חמת is the infinite store of wrath still available to God after human rage has done its utmost. Or perhaps still better, and more fully answering to the notion of שׁארית: it is the store of the infinite fulness of wrath which still remains on the side of God after human rage (חמה) has spent itself, when God calmly, and laughing (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 2:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), allows the Titans to do as they please, and which is now being poured out. In connection with the interpretation: with the remainder of the fury (of hostile men) wilt Thou gird Thyself, i.e., it serves Thee only as an ornament (Hupfeld), the alternation of חמה and חמת is left unexplained, and תּחגּר is alienated from its martial sense (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 59:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 51:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Wisd. 5:21 [20]), which is required by the context. Ewald, like the lxx, reads תּחגּך, ἑορτάσει σοι, in connection with which, apart from the high-sounding expression, שׁארית חמת (ἐγκατάλειμμα ἐνθυμίου) must denote the remainder of malignity that is suddenly converted into its opposite; and one does not see why what ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 76:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " says concerning rage is here limited to its remainder. Such an inexhaustiveness in the divine wrath-power has been shown in what has just recently been experienced. Thus, then, are those who belong to the people of God to vow and pay, i.e., (inasmuch as the preponderance falls upon the second imperative) to pay their vows; and all who are round about Him, i.e., all the peoples dwelling round about Him and His people (כּל־סביביו, the subject to what follows, in accordance with which it is also accented), are to bring offerings (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 68:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") to God, who is מורא, i.e., the sum of all that is awe-inspiring. Thus is He called in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 8:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; the summons accords with Isaiah's prediction, according to which, in consequence of Jahve's deed of judgment upon Assyria, Aethiopia presents himself to Him as an offering (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 18:1-7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and with the fulfilment in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 32:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Just so does v. 13a resemble the language of Isaiah; cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 25:1-12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 33:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 18:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : God treats the snorting of the princes, i.e., despots, as the vine-dresser does the wild shoots or branches of the vine-stock: He lops it, He cuts it off, so that it is altogether ineffectual. It is the figure that is sketched by ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joel 3:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", then filled in by Isaiah, and embodied as a vision in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 14:17-20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which is here indicated. God puts an end to the defiant, arrogant bearing of the tyrants of the earth, and becomes at last the feared of all the kings of the earth - all kingdoms finally becomes God's and His Christ's. ",
        "children": []
      }
    ]
  }
]