[{"num":8,"verse":"¶ And it came to pass at the end of twenty years, in which Solomon had built the house of the LORD and his own house,"},{"num":2,"verse":"that Solomon rebuilt the cities which Hiram had given him and caused the sons of Israel to dwell there."},{"num":3,"verse":"Then Solomon went to Hamathzobah and prevailed against it."},{"num":4,"verse":"And he built Tadmor in the wilderness and all the store cities, which he built in the wilderness."},{"num":5,"verse":"Likewise, he rebuilt Bethhoron the upper and Bethhoron the lower, fenced cities with walls, gates, and bars;"},{"num":6,"verse":"and Baalath and all the store cities that Solomon had and all the chariot cities and the cities of the horsemen and all that Solomon desired to build in Jerusalem and in Lebanon and throughout all the land of his dominion."},{"num":7,"verse":"As for all the people that were left of the Hittites and the Amorites and the Perizzites and the Hivites and the Jebusites, which were not of Israel,"},{"num":8,"verse":"but of their sons, who were left after them in the land, whom the sons of Israel, did not consume, Solomon made them pay tribute until this day."},{"num":9,"verse":"But of the sons of Israel Solomon did not make slaves for his work, for they were men of war, and his princes and his captains, and princes of his chariots and horsemen."},{"num":10,"verse":"And King Solomon had two hundred and fifty princes of the governors, who presided over the people."},{"num":11,"verse":"And Solomon brought up the daughter of Pharaoh out of the city of David unto the house that he had built for her, for he said, My wife shall not dwell in the house of David, king of Israel, because the places are holy, unto which the ark of the LORD has come."},{"num":12,"verse":"¶ Then Solomon offered burnt offerings unto the LORD on the altar of the LORD, which he had built before the porch,"},{"num":13,"verse":"that each thing might be offered in its day, according to the commandment of Moses, on the sabbaths and on the new moons and on the feasts three times in the year, that is in the feast of unleavened bread and in the feast of weeks and in the feast of the tabernacles."},{"num":14,"verse":"And he appointed, according to the order of David his father, the courses of the priests to their service and the Levites to their charges, to praise and minister before the priests, each thing in its day; the porters also by their courses at each gate, for so had David, the man of God, commanded."},{"num":15,"verse":"And they departed not from the commandment of the king unto the priests and Levites concerning any matter or concerning the treasures."},{"num":16,"verse":"Now all the work of Solomon was prepared from the day of the foundation of the house of the LORD and until it was finished. So the house of the LORD was perfected."},{"num":17,"verse":"Then Solomon went to Eziongeber and to Eloth, at the sea side in the land of Edom."},{"num":18,"verse":"For Hiram had sent him ships by the hands of his slaves and slaves that had knowledge of the sea, and they had gone with the slaves of Solomon to Ophir and had taken from there four hundred and fifty talents of gold and brought them to King Solomon."}]