[{"num":8,"verse":"And it came to pass at the end of esrim shanah, wherein Sh’lomo had built the Beis Hashem, and his own bais (palace),"},{"num":2,"verse":"That the cities which Churam had restored to Sh’lomo, Sh’lomo rebuilt them, and caused the Bnei Yisroel to dwell there."},{"num":3,"verse":"And Sh’lomo went to Chamat Tzovah, and captured it."},{"num":4,"verse":"And he built Tadmor in the midbar, and all the storage towns, which he built in Chamat."},{"num":5,"verse":"Also he rebuilt Upper Beit Choron, and Lower Beit Choron, fortified cities, with walls, gates, and bars,"},{"num":6,"verse":"And Ba’alat, and all the storage towns that Sh’lomo had, and all the towns for the chariots, and the towns for the parashim (horsemen, cavalry) all the cheshek Sh’lomo (desire of Solomon) that he desired to build in Yerushalayim, and in the Levanon, and throughout all the eretz of his Memshalet."},{"num":7,"verse":"As for kol haAm that were left of the Chitti, and HaEmori, and the Perizzi, and the Chivi, and the Yevusi, who were not of Yisroel,"},{"num":8,"verse":"From their banim, who were left after them in HaAretz, whom the Bnei Yisroel consumed not, them did Sh’lomo conscript for forced labor until yom hazeh."},{"num":9,"verse":"But of the Bnei Yisroel did Sh’lomo make no avadim for his melachah; for they were anshei milchamah, and commanders of his officers, and commanders of his chariots and parash."},{"num":10,"verse":"And these were the chief of the officials of Sh’lomo HaMelech, even two hundred and fifty, that exercised authority over HaAm."},{"num":11,"verse":"And Sh’lomo brought up the Bat Pharaoh out of Ir Dovid unto the palace that he had built for her, for he said, Isha li (wife for me) shall not dwell in the Bais Dovid Melech Yisroel, because the places whereunto the Aron Hashem hath come are Kodesh."},{"num":12,"verse":"Then Sh’lomo offered up Olot unto Hashem on the Mizbe’ach Hashem, which he had built before the Ulam,"},{"num":13,"verse":"Even according to the requirement of each day on its day, offering according to the mitzvat Moshe, on the Shabbatot, and on Rosh Chodesh, and on the Mo’adot, three times in the year, even in the Chag HaMatzot, and in the Chag HaShavuot, and in the Chag HaSukkot."},{"num":14,"verse":"And he appointed, according to the mishpat Dovid Aviv, the machlekot (divisions) of the Kohanim to their avodah service, and the Levi’im to their mishmerot (watches), to praise and minister before the Kohanim, as the requirement of every yom required; the Sho’arim (Gatekeepers) also by their machlekot (divisions) at every sha’ar; for thus was the mitzvot Dovid Ish HaElohim."},{"num":15,"verse":"And they deviated not from the mitzvat HaMelech unto the Kohanim and Levi’im concerning any matter, or concerning the otzarot."},{"num":16,"verse":"Now all the work of Sh’lomo was carried out from the yom musad (day of the foundation) of the Beis Hashem until its completion. So the Beis Hashem was perfected."},{"num":17,"verse":"Then went Sh’lomo to Etzyon-Gever, and to Eilat, on the seacoast of Eretz Edom. [T.N. See Ep 2:20 in connection with the musad (foundation in 2Chr 8:16) where the OJBC speaks about Shluchim and Nevi’im and Moshiach as the Rosh Pinah]"},{"num":18,"verse":"And Churam sent him by the hands of his avadim oniyot, and avadim that were experienced seamen; and they went with the avadim of Sh’lomo to Ophir, and took from there four hundred and fifty talents of zahav, and brought them to Sh’lomo HaMelech."}]