[{"num":8,"verse":"Forsooth when twenty years were [ful]filled, after that Solomon had builded the house of the Lord, and his own house,"},{"num":2,"verse":"he builded the cities, which Hiram had given to Solomon; and he made the sons of Israel to dwell there. (he rebuilt the cities, which Hiram had given to Solomon; and he ordered the Israelites to live there.)"},{"num":3,"verse":"Also he went into Hamath of Zobah, and got it."},{"num":4,"verse":"And he builded Palmyra in (the) desert, and he builded other full strong cities in Hamath."},{"num":5,"verse":"And he builded the higher Bethhoron and the lower Bethhoron, walled cities, having gates, and locks, and bars;"},{"num":6,"verse":"also he builded Baalath, and all the strong cities that were of Solomon; and all the cities of carts, and the cities of knights (and all the cities for the chariots, and the cities for the horsemen), (and) king Solomon builded, and disposed all things, whichever he would, in Jerusalem, and in Lebanon, and in all the land of his power."},{"num":7,"verse":"And Solomon made subject into tributaries till into this day all the people that was left of (the) Hittites, and Amorites, and Perizzites, and Hivites, and Jebusites, that were not of the generations of Israel,"},{"num":8,"verse":"and of the sons of them, and of the after-comers of them, which the sons of Israel had not slain, (and their descendants, and their after-comers, whom the Israelites had not killed.)"},{"num":9,"verse":"For of the sons of Israel Solomon set not, that they should serve the works of the king; for they were men warriors, and the first, or chief, dukes, and princes of his chariots, and of his knights; (For Solomon ordained, that the Israelites should not serve in the forced labour for the public works of the king; for they were men of war, and the first, or the chief, officers, and the leaders of his chariots, and of his horsemen;)"},{"num":10,"verse":"and all the princes of the host of king Solomon were two hundred and fifty, that taught, or ruled, the people."},{"num":11,"verse":"And Solomon translated the daughter of Pharaoh from the city of David into an house, that he had builded to her; for the king said, My wife shall not dwell in the house of David, king of Israel, for it is hallowed, for the ark of the Lord entered into that house. (And Solomon brought Pharaoh’s daughter up from the City of David to the house, that he had built for her; for the king said, My wife shall not live in the house of David, the king of Israel, for it is holy, for the Ark of the Lord hath entered into that house.)"},{"num":12,"verse":"Then Solomon offered burnt sacrifices to the Lord on the altar of the Lord, which he had builded before the porch (which he had built in front of the vestibule),"},{"num":13,"verse":"that by all days offering should be offered in it, by the commandment of Moses, in sabbaths, and in calends, and in feast days, thrice by the year, that is, in the solemnity of therf loaves, and in the solemnity of weeks, and in the solemnity of tabernacles. (so that by all days the offerings would be offered on it, by the command of Moses, yea, on sabbaths, and calends, and Feast days, three times in the year, that is, on the Feast of Unleavened Bread, and the Feast of Weeks, and the Feast of Tabernacles.)"},{"num":14,"verse":"And he ordained by the ordinance of David, his father, the offices of priests in their services, and the deacons in their order, that they should praise and minister before [the] priests by the custom of each day; and he ordained [the] porters in their partings by gate and gate. For David, the man of God, had commanded so; (And he ordained by the ordinance of his father David, the offices of the priests in their services, and the Levites in their order, to praise and to minister before the priests by the custom of each day; and he ordained the guards, or the doorkeepers, in their divisions by each gate. For David, the man of God, had so commanded;)"},{"num":15,"verse":"and both priests and deacons passed not from the commandments of the king of all things which he had commanded. (and the priests and the Levites followed all the king’s commands concerning everything which he commanded, including his orders about the treasuries.)"},{"num":16,"verse":"And Solomon had all [the] costs, or dispenses (or expenses), made ready in the keepings of [the] treasuries, from that day in which he founded the house of the Lord, till into the day in which he performed it. (And so Solomon founded the House of the Lord, and he finished it; and he successfully completed all of his work.)"},{"num":17,"verse":"Then Solomon went into Eziongeber, and into Elath, at the brink of the Red Sea (and into Elath, on the Gulf of Akabah), which is in the land of Edom."},{"num":18,"verse":"Therefore Hiram sent to him, by the hands of his servants, ships, and shipmen knowing of the sea (And so Hiram sent to him, under the command of his servants, ships, and shipmen who were knowledgeable about the sea), and they went with the servants of Solomon into Ophir, and they took from thence four hundred and fifty talents of gold, and they brought it (back) to king Solomon."}]