[{"header":"Chapter 2"},{"num":1,"verse":"The Search for a New Queen. After this, when King Ahasuerus’ wrath had cooled, he thought over what Vashti had done and what had been decreed against her. "},{"num":2,"verse":"Then the king’s personal attendants suggested: “Let beautiful young virgins be sought for the king. "},{"num":3,"verse":"Let the king appoint emissaries in all the provinces of his realm to gather all beautiful young virgins into the harem in the royal precinct of Susa. Under the care of the royal eunuch Hegai, guardian of the women, let cosmetics be given them. "},{"num":4,"verse":"Then the young woman who pleases the king shall reign in place of Vashti.” This suggestion pleased the king, and he acted accordingly."},{"num":5,"verse":"There was in the royal precinct of Susa a certain Jew named Mordecai, son of Jair, son of Shimei, son of Kish, a Benjaminite, "},{"num":6,"verse":"who had been exiled from Jerusalem with the captives taken with Jeconiah, king of Judah, whom Nebuchadnezzar, king of Babylon, had deported. "},{"num":7,"verse":"He became foster father to his cousin Hadassah, that is, Esther, when she lost both father and mother. The young woman was beautifully formed and lovely to behold. On the death of her father and mother, Mordecai adopted her as his own daughter."},{"num":8,"verse":"When the king’s order and decree had been proclaimed and many young women brought together to the royal precinct of Susa under the care of Hegai, Esther also was brought in to the royal palace under the care of Hegai, guardian of the women. "},{"num":9,"verse":"The young woman pleased him and won his favor. So he promptly furnished her with cosmetics and provisions. Then choosing seven maids for her from the royal palace, he transferred both her and her maids to the best place in the harem. "},{"num":10,"verse":"Esther did not reveal her nationality or family, for Mordecai had commanded her not to do so."},{"num":11,"verse":"Day by day Mordecai would walk about in front of the court of the harem to learn how Esther was faring and what was to become of her."},{"num":12,"verse":"After the twelve months’ preparation decreed for the women, each one went in turn to visit King Ahasuerus. During this period of beautifying treatment, six months were spent with oil of myrrh, and the other six months with perfumes and cosmetics. "},{"num":13,"verse":"Then, when each one was to visit the king, she was allowed to take with her from the harem to the royal palace whatever she chose. "},{"num":14,"verse":"She would go in the evening and return in the morning to a second harem under the care of the royal eunuch Shaashgaz, guardian of the concubines. She could not return to the king unless he was pleased with her and had her summoned by name. "},{"num":15,"verse":"As for Esther, daughter of Abihail and adopted daughter of his nephew Mordecai, when her turn came to visit the king, she did not ask for anything but what the royal eunuch Hegai, guardian of the women, suggested. And she won the admiration of all who saw her."},{"num":16,"verse":"Ahasuerus Chooses Esther. Esther was led to King Ahasuerus in his palace in the tenth month, Tebeth, in the seventh year of his reign. "},{"num":17,"verse":"The king loved Esther more than all other women, and of all the virgins she won his favor and good will. So he placed the royal crown on her head and made her queen in place of Vashti. "},{"num":18,"verse":"Then the king gave a great feast in honor of Esther to all his officials and servants, granting a holiday to the provinces and bestowing gifts with royal generosity."},{"num":19,"verse":"As was said, from the time the virgins had been brought together, and while Mordecai was passing his time at the king’s gate, "},{"num":20,"verse":"Esther had not revealed her family or nationality, because Mordecai had told her not to; and Esther continued to follow Mordecai’s instructions, just as she had when she was being brought up by him. "},{"num":21,"verse":"During the time that Mordecai spent at the king’s gate, Bigthan and Teresh, two of the royal eunuchs who guarded the entrance, became angry and plotted to assassinate King Ahasuerus. "},{"num":22,"verse":"When the plot became known to Mordecai, he told Queen Esther, who in turn informed the king in Mordecai’s name. "},{"num":23,"verse":"The matter was investigated and verified, and both of them were impaled on stakes. This was written in the annals in the king’s presence."}]