[{"header":"Esther Becomes Queen of Persia"},{"num":2,"verse":"Later, the great anger of King Xerxes calmed down. Then he remembered Vashti and what she had done. He also remembered the royal order he had sent out concerning her. "},{"num":2,"verse":"At that time the king’s personal attendants made a suggestion. They said, “King Xerxes, let a search be made for some beautiful young virgins for you. "},{"num":3,"verse":"Appoint some officials in every territory in your kingdom. Have them bring all these beautiful young women into the fort of Susa. Put them in the special place where the virgins stay. Then put Hegai in charge of them. He’s the official who serves you. He’s in charge of the women. Let beauty care be given to the new group of women. "},{"num":4,"verse":"Then let the young woman who pleases you the most become queen in Vashti’s place.” The king liked that advice. So he followed it."},{"num":5,"verse":"There was a Jew living in the fort of Susa. He was from the tribe of Benjamin. His name was Mordecai. He was the son of Jair. Jair was the son of Shimei. Shimei was the son of Kish. "},{"num":6,"verse":"Nebuchadnezzar had forced Mordecai to leave Jerusalem. He was among the prisoners who were carried off along with Jehoiachin. Jehoiachin had been king of Judah. Nebuchadnezzar was king of Babylon. "},{"num":7,"verse":"Mordecai had a cousin named Hadassah. He had raised her because she didn’t have a father or mother. Hadassah was also called Esther. She had a lovely figure and was very beautiful. Mordecai had adopted her as his own daughter. He had done it when her father and mother died."},{"num":8,"verse":"After the king’s order and law were announced, many young women were brought to the fort of Susa. Hegai was put in charge of them. Esther was also taken to the king’s palace. She was put under the control of Hegai. He was in charge of the place where the virgins stayed. "},{"num":9,"verse":"Esther pleased him. He showed her how happy he was with her. Right away he provided her with her beauty care and special food. He appointed seven female attendants to help her. They were chosen from the king’s palace. He moved her and her attendants into the best part of the place where the virgins stayed."},{"num":10,"verse":"Esther hadn’t told anyone who her people were. She hadn’t talked about her family. That’s because Mordecai had told her not to. "},{"num":11,"verse":"Mordecai tried to find out how Esther was getting along. He wanted to know what was happening to her. So he walked back and forth near the courtyard by the place where the virgins stayed. He did it every day."},{"num":12,"verse":"Each young woman had to complete 12 months of beauty care. They used oil of myrrh for six months. And they used perfume and makeup for the other six months. A virgin’s turn to go in to King Xerxes could come only after a full 12 months had passed. "},{"num":13,"verse":"And here is how she would go to the king. She would be given anything she wanted from the place where the virgins stayed. She could take it with her to the king’s palace. "},{"num":14,"verse":"In the evening she would go there. In the morning she would leave. Then she would go to the special place where the king’s concubines stayed. She would be put under the control of Shaashgaz. He was the king’s official who was in charge of the concubines. She would never return to the king unless he was pleased with her. He had to send for her by name before she could go to him again."},{"num":15,"verse":"Mordecai had adopted Esther. She had been the daughter of his uncle Abihail. Her turn came to go in to the king. She only asked for what Hegai suggested. He was the king’s official who was in charge of the place where the virgins stayed. Everyone who saw Esther was pleased with her. "},{"num":16,"verse":"She was taken to King Xerxes in the royal house. It was now the tenth month. That was the month of Tebeth. It was the seventh year of the rule of Xerxes."},{"num":17,"verse":"The king liked Esther more than he liked any of the other women. She pleased him more than any of the other virgins. So he put a royal crown on her head. He made her queen in Vashti’s place. "},{"num":18,"verse":"Then the king gave a feast to honor Esther. All his nobles and officials were invited. He announced a holiday all through the territories he ruled over. He freely gave many gifts in keeping with his royal wealth."},{"header":"Mordecai Uncovers a Plan to Kill the King"},{"num":19,"verse":"The virgins were gathered together a second time. At that time Mordecai was sitting at the palace gate. "},{"num":20,"verse":"Esther had kept her family history a secret. She hadn’t told anyone who her people were. Mordecai had told her not to. She continued to follow his directions. That’s what she had always done when he was bringing her up."},{"num":21,"verse":"Bigthana and Teresh were two of the king’s officers. They guarded the door of the royal palace. They became angry with King Xerxes. So they decided to kill him. They made their evil plans while Mordecai was sitting at the palace gate. "},{"num":22,"verse":"So Mordecai found out about it and told Queen Esther. Then she reported it to the king. She told him that Mordecai had uncovered the plans against him. "},{"num":23,"verse":"Some people checked Esther’s report. And they found out it was true. So the two officials were put to death. Then poles were stuck through them. They were set up where people could see them. All of that was written in the official records. It was written down while the king was watching."}]