[{"num":2,"verse":"But after King Ahasuerus’ anger had cooled, he began brooding over the loss of Vashti, realizing that he would never see her again."},{"num":2,"verse":"So his aides suggested, “Let us go and find the most beautiful girls in the empire and bring them to the king for his pleasure. "},{"num":3,"verse":"We will appoint agents in each province to select young lovelies for the royal harem. Hegai, the eunuch in charge, will see that they are given beauty treatments, "},{"num":4,"verse":"and after that, the girl who pleases you most shall be the queen instead of Vashti.”"},{"num":5,"verse":"Now there was a certain Jew at the palace named Mordecai (son of Jair, son of Shimei, son of Kish, a Benjaminite). "},{"num":6,"verse":"He had been captured when Jerusalem was destroyed by King Nebuchadnezzar and had been exiled to Babylon along with King Jeconiah of Judah and many others. "},{"num":7,"verse":"This man had a beautiful and lovely young cousin, Hadassah (also called Esther), whose father and mother were dead, and whom he had adopted into his family and raised as his own daughter. "},{"num":8,"verse":"So now, as a result of the king’s decree, Esther was brought to the king’s harem at Shushan Palace along with many other young girls. "},{"num":9,"verse":"Hegai, who was responsible for the harem, was very much impressed with her and did his best to make her happy; he ordered a special menu for her, favored her for the beauty treatments, gave her seven girls from the palace as her maids, and gave her the most luxurious apartment in the harem. "},{"num":10,"verse":"Esther hadn’t told anyone that she was a Jewess, for Mordecai had said not to. "},{"num":11,"verse":"He came daily to the court of the harem to ask about Esther and to find out what was happening to her."},{"num":12,"verse":"The instructions concerning these girls were that before being taken to the king’s bed, each would be given six months of beauty treatments with oil of myrrh, followed by six months with special perfumes and ointments. Then, as each girl’s turn came for spending the night with King Ahasuerus, she was given her choice of clothing or jewelry she wished, to enhance her beauty. She was taken to the king’s apartment in the evening and the next morning returned to the second harem where the king’s wives lived. There she was under the care of Shaashgaz, another of the king’s eunuchs and lived there the rest of her life, never seeing the king again unless he had especially enjoyed her and called for her by name."},{"num":15,"verse":"When it was Esther’s turn to go to the king, she accepted the advice of Hegai, the eunuch in charge of the harem, dressing according to his instructions. And all the other girls exclaimed with delight when they saw her. "},{"num":16,"verse":"So Esther was taken to the palace of the king in January of the seventh year of his reign. "},{"num":17,"verse":"Well, the king loved Esther more than any of the other girls. He was so delighted with her that he set the royal crown on her head and declared her queen instead of Vashti. "},{"num":18,"verse":"To celebrate the occasion, he threw another big party for all his officials and servants, giving generous gifts to everyone and making grants to the provinces in the form of remission of taxes."},{"num":19,"verse":"Later the king demanded a second bevy of beautiful girls. By that time Mordecai had become a government official."},{"num":20,"verse":"Esther still hadn’t told anyone she was a Jewess, for she was still following Mordecai’s orders, just as she had in his home."},{"num":21,"verse":"One day as Mordecai was on duty at the palace, two of the king’s eunuchs, Bigthan and Teresh—who were guards at the palace gate—became angry at the king and plotted to assassinate him. "},{"num":22,"verse":"Mordecai heard about it and passed on the information to Queen Esther, who told the king, crediting Mordecai with the information. "},{"num":23,"verse":"An investigation was made, the two men found guilty, and impaled alive. This was all duly recorded in the book of the history of King Ahasuerus’ reign."}]