[{"header":"Daniel’s Prayer for His People"},{"num":9,"verse":"In the first year of Darius, the son of Ahasuerus, from the offspring of the Medes, who became king over the kingdom of the Chaldeans— "},{"num":2,"verse":"in the first year of his kingship I, Daniel, observed in the scrolls the number of the years that it was that were to be fulfilled according to the word of Yahweh to Jeremiah the prophet for the devastation of Jerusalem—seventy years."},{"num":3,"verse":"Then I turned my face to the Lord God to seek him by prayer and pleas for mercy, in fasting and in sackcloth and ashes. "},{"num":4,"verse":"And I prayed to Yahweh my God, and I made confession and I said, “O Lord, the great and awesome God, keeping the covenant and loyal love with those who love him and with those who keep his commandments, "},{"num":5,"verse":"we have sinned and we have done wrong and we acted wickedly and we rebelled and have been turning aside from your commandments and from your ordinances. "},{"num":6,"verse":"We have not listened to your servants the prophets, who spoke in your name to our kings, our princes and our ancestors and to all the people of the land."},{"num":7,"verse":"“Righteousness belongs to you, O Lord, and on us is open shame, just as it is this day to the people of Judah and to the inhabitants of Jerusalem and to all Israel, those who are near and those who are far off in all the lands to which you have driven them, because of their infidelity which they displayed against you. "},{"num":8,"verse":"Yahweh, on us is open shame, on our kings, on our princes, and on our ancestors, because we have sinned against you. "},{"num":9,"verse":"Compassion and forgiveness belong to the Lord, our God, for we have rebelled against him, "},{"num":10,"verse":"and we have not listened to the voice of Yahweh our God, by following his law which he placed before us by the hand of his servants the prophets."},{"num":11,"verse":"“And all Israel transgressed your law and turned aside so as not to listen to your voice, and so the curse and the oath which was written in the law of Moses, the servant of God, has been poured out upon us, because we have sinned against him. "},{"num":12,"verse":"And so he has carried out his words which he spoke against us and against our rulers who ruled us, to bring upon us a great calamity which was not done under all of heaven as it was done in Jerusalem. "},{"num":13,"verse":"Just as it is written in the law of Moses, all of this calamity has come upon us, and we have not implored the face of Yahweh our God so as to turn from our iniquities and to attend closely to your faithfulness. "},{"num":14,"verse":"So Yahweh has kept watch over the calamity, and now he has brought it upon us. Indeed, Yahweh our God is righteous concerning all his works that he has done, but we have not listened to his voice."},{"num":15,"verse":"“And now, Lord our God, who have brought your people out from the land of Egypt with a strong hand, and you have made for yourself a name until this day—we have sinned, we have acted wickedly. "},{"num":16,"verse":"Lord, according to all your righteousness, please let your anger and your rage turn away from your city Jerusalem, your holy mountain, because through our sins and through the iniquities of our ancestors Jerusalem and your people have become an object of mockery among all of our neighbors."},{"num":17,"verse":"“And now, listen to the prayer of your servant and to his pleas for mercy. Shine your face upon your desolate sanctuary for your sake, O Lord. "},{"num":18,"verse":"Incline your ear, my God, and listen; open your eyes and look at our desolation and the city that is called by your name, for we are not presenting our pleas for mercy before you because of our righteousness, but rather because of your great compassion. "},{"num":19,"verse":"Lord, listen! Lord, forgive! Lord, pay heed and act! You must not delay for your sake, my God; because your city and your people are called by your name.”"},{"header":"Gabriel’s Announcement and Presentation of the Seventy Sets of Seven"},{"num":20,"verse":"Now I was still speaking and praying, and confessing my sin and the sin of my people Israel, and presenting my plea before Yahweh my God, on behalf of the holy mountain of my God. "},{"num":21,"verse":"And I was still speaking in prayer, and the man Gabriel, whom I had seen in the vision previously, in my weariness touched me at the time of the evening offering. "},{"num":22,"verse":"And he instructed me and he spoke with me and he said, “Daniel I have now come out to teach you understanding. "},{"num":23,"verse":"At the beginning of your pleas for mercy, a word went out, and now I have come to declare it, for you are highly esteemed, and so consider the word and understand the vision."},{"header":"The Seventy Sets of Seven Detailed"},{"num":24,"verse":"“Seventy weeks is decreed for your people and for your holy city, to put an end to the transgression and to seal up sin and to make atonement for guilt and to bring in everlasting righteousness and to seal vision and prophet and to anoint the most holy place. "},{"num":25,"verse":"And you must know and you must understand that from the time of the going out of the word to restore and build Jerusalem until an anointed one—a leader—will be seven weeks and sixty-two weeks; it will be restored and will be built with streets and a moat, but in a time of oppression."},{"num":26,"verse":"“And after the sixty and two weeks an anointed one shall be cut off, and he shall have nothing, and the people of the coming leader will destroy the city and the sanctuary, and its end will be with the flood and on to the end there shall be war; these desolations are determined. "},{"num":27,"verse":"And he will make a strong covenant with the many for one week, but in half of the week he will let cease sacrifice and offering and in its place a desolating abomination comes even until the determined complete destruction is poured out on the desolator.”"}]