[{"header":"The Prayer of Daniel"},{"num":9,"verse":"In the first year of Darius the son of Ahasuerus of the lineage of the Medes, who was made king over the realm of the Chaldeans, "},{"num":2,"verse":"in the first year of his reign, I, Daniel, observed in the books the number of the years which were specified by the word of the Lord to Jeremiah the prophet for the accomplishment of the desolations of Jerusalem, that is, seventy years. "},{"num":3,"verse":"I set my face toward the Lord God to seek by prayer and supplications with fasting and sackcloth and ashes."},{"num":4,"verse":"And I prayed to the Lord my God, and made my confession, and said,"},{"num":5,"verse":"We have sinned and have committed iniquity and have done wickedly and have rebelled, even by departing from Your precepts and from Your judgments. "},{"num":6,"verse":"We have not listened to Your servants the prophets, who spoke in Your name to our kings, our officials, and our fathers, and to all the people of the land."},{"num":7,"verse":"“O Lord, righteousness belongs to You, but to us shame of face, as it is this day, to the men of Judah and to the inhabitants of Jerusalem and to all Israel, who are near and who are far off, through all the countries wherever You have driven them, because of their trespass that they have trespassed against You. "},{"num":8,"verse":"O Lord, to us belongs shame of face, to our kings, to our officials, and to our fathers, because we have sinned against You. "},{"num":9,"verse":"To the Lord our God belong mercies and forgiveness, though we have rebelled against Him. "},{"num":10,"verse":"We have not obeyed the voice of the Lord our God, to walk in His laws, which He set before us by His servants the prophets. "},{"num":11,"verse":"Indeed, all Israel has transgressed Your law, even by departing that they might not obey Your voice."},{"num":12,"verse":"He has confirmed His words, which He had spoken against us and against our judges who judged us, by bringing on us great calamity. For under the whole heaven there has not been done such as has been done to Jerusalem. "},{"num":13,"verse":"As it is written in the Law of Moses, great calamity has come on us. Yet we have not sought the favor of the Lord our God so that we might turn from our iniquities and give attention to Your truth. "},{"num":14,"verse":"Therefore, the Lord has kept the disaster in store and brought it upon us. For the Lord our God is righteous in all His works which He does, but we have not obeyed His voice."},{"num":15,"verse":"“Now, O Lord our God, who brought Your people out of the land of Egypt with a mighty hand, and made Yourself a name, even to this day, we have sinned, we have done wickedly. "},{"num":16,"verse":"O Lord, according to all Your righteousness, I beseech You, let Your anger and Your fury be turned away from Your city Jerusalem, Your holy mountain, because for our sins and for the iniquities of our fathers, Jerusalem and Your people have become a reproach to all who are around us."},{"num":17,"verse":"“Now therefore, O God, hear the prayer of Your servant and his supplications, and for Your sake, O Lord, cause Your face to shine upon Your sanctuary, which is desolate. "},{"num":18,"verse":"O my God, incline Your ear and hear. Open Your eyes and look at our desolations and the city which is called by Your name, for we do not present our supplications before You for our righteousness, but for Your great mercies. "},{"num":19,"verse":"O Lord, hear! O Lord, forgive! O Lord, listen and act! Do not defer, for Your own sake, O my God. For Your city and Your people are called by Your name.”"},{"header":"The Seventy Weeks"},{"num":20,"verse":"While I was speaking and praying and confessing my sin and the sin of my people Israel, and presenting my supplication before the Lord my God for the holy mountain of my God, "},{"num":21,"verse":"indeed, while I was speaking in prayer, the man Gabriel, whom I had seen in the vision at the beginning, being caused to fly swiftly, touched me about the time of the evening oblation. "},{"num":22,"verse":"He informed me and talked with me, and said, “Daniel, I have now come to give you insight and understanding. "},{"num":23,"verse":"At the beginning of your supplications the command went out, and I have come to tell you, for you are greatly beloved. Therefore understand the matter and consider the vision:"},{"num":24,"verse":"“Seventy weeks have been determined for your people and upon your holy city, to finish the transgression, and to make an end of sins, and to make atonement for iniquity, and to bring in everlasting righteousness, and to seal up the vision and prophecy, and to anoint the Most Holy Place."},{"num":25,"verse":"“Know therefore and understand that from the going forth of the command to restore and to rebuild Jerusalem until the Prince Messiah shall be seven weeks, and sixty-two weeks. It shall be built again, with plaza and moat, even in times of trouble. "},{"num":26,"verse":"After the sixty-two weeks Messiah shall be cut off and shall have nothing. And the troops of the prince who shall come shall destroy the city and the sanctuary. The end of it shall come with a flood. And until the end of the war desolations are determined. "},{"num":27,"verse":"And he shall make a firm covenant with many for one week. But in the middle of the week he shall cause the sacrifice and the offering to cease. And on the wing of abominations shall come one who makes desolate, until the decreed destruction is poured out on the desolator.”"}]