[{"header":"Daniel Confesses Israel’s Sins"},{"num":9,"verse":"“In the first year of Darius the son of Ahasuerus, of Median descent, who was made king over the realm of the Chaldeans, "},{"num":2,"verse":"in the first year of his reign—I, Daniel, understood from the books that according to the word of Adonai to Jeremiah the prophet, the number of the years for the fulfilling of the desolation of Jerusalem would be 70 years. "},{"num":3,"verse":"So I set my face to the Lord God to seek Him by prayer and supplications, with fasting, sackcloth and ashes."},{"num":4,"verse":"“I prayed to Adonai my God and confessed, saying: ‘O Lord, the great and awesome God, who keeps covenant and mercy with those who love Him and keep His mitzvot, "},{"num":5,"verse":"we have sinned; we have committed iniquity; we have acted wickedly; we have rebelled; we have turned away from Your mitzvot and from Your rulings. "},{"num":6,"verse":"We have not listened to Your servants the prophets, who spoke in Your name to our kings, our leaders and our fathers, and to all the people of the land."},{"num":7,"verse":"“‘You Lord are righteousness, but shame covers our face to this day—the people of Judah and the inhabitants of Jerusalem, and all Israel, near and far, in all the countries where you have banished them—because they behaved unfaithfully toward you. "},{"num":8,"verse":"Adonai, shame covers our face—our kings, our leaders, our fathers—because we have sinned against you. "},{"num":9,"verse":"The Lord our God is compassionate and forgiving, even though we have rebelled against Him. "},{"num":10,"verse":"We have not obeyed the voice of Adonai Eloheinu by walking in His Torah that He set before us through His servants the prophets. "},{"num":11,"verse":"Yes, all Israel has transgressed Your Torah and has turned away—not obeying Your voice."},{"num":12,"verse":"So He has confirmed His words that he spoke against us and against our rulers who ruled over us by bringing on us a great calamity. Under the whole heaven nothing like this has ever been done to Jerusalem!"},{"num":13,"verse":" As it is written in the Torah of Moses, all this calamity came on us, yet we have not sought the favor of Adonai Eloheinu by turning away from our iniquities and paying attention to Your truth. "},{"num":14,"verse":"So Adonai was intent on bringing the calamity upon us, for Adonai Eloheinu is righteous in all His deeds that He has done—while we have not paid attention to His voice."},{"num":15,"verse":"“‘So now, Adonai Eloheinu, who brought Your people out of the land of Egypt with a mighty hand and made for Yourself a Name to this day—we have sinned, we have acted wickedly. "},{"num":16,"verse":"Lord, in keeping with all Your righteous acts, let Your anger and Your fury turn away, please, from Jerusalem, Your city, Your holy mountain. Because of our sins and the iniquities of our fathers, Jerusalem and Your people have become an object of scorn to all those around us."},{"num":17,"verse":"‘So now, our God, listen to the prayers and petitions of Your servant, and cause Your face to shine upon Your devastated Sanctuary, for the sake of my Lord. "},{"num":18,"verse":"Give ear, my God, and hear! Open Your eyes and see our desolation and the city called by Your name. We do not present our supplications before You because of our own righteousness, but because of Your great compassions. "},{"num":19,"verse":"Lord, hear! Lord, forgive! Lord, listen and act! For Your own sake, O my God, do not delay! For Your city and Your people are called by Your name.’"},{"header":"The Mashiach and Seventy Weeks"},{"num":20,"verse":"“While I was still speaking and praying, confessing my sin and the sin of my people Israel, and presenting my supplication before Adonai my God on behalf of the holy mountain of my God—"},{"num":21,"verse":"yes, while I was praying, Gabriel, the one I had seen in the earlier vision, came to me swiftly about the time of the evening offering."},{"num":22,"verse":"“He instructed me and said to me: ‘Daniel, I have come now to give you insight and understanding. "},{"num":23,"verse":"At the beginning of your requests, a message went out, and I have come to declare it to you, for you are greatly esteemed. Therefore consider the message and understand the vision:"},{"num":25,"verse":"So know and understand:"},{"num":26,"verse":"Then after the 62 weeks Mashiach will be cut off and have nothing."},{"num":27,"verse":"Then he will make a firm covenant with many for one week, but in the middle of the week he will put an end to sacrifice and offering."}]