[{"num":9,"verse":"In the first year of Darius, the son of Ahasuerus, of the seed of Medes, that was emperor on the realm of Chaldees, (In the first year of Darius, the son of Ahasuerus, or of Xerxes, of Media/a Mede, who was the emperor over the kingdom of the Chaldeans,)"},{"num":2,"verse":"in the first year of his realm, I, Daniel, understood in books the number of years, of which number the word of the Lord was made to Jeremy, the prophet, that seventy years of (the) desolation of Jerusalem should be [ful]filled. (in the first year of his reign, I, Daniel, understood by books the number of years, of which number the word of the Lord was made to the prophet Jeremiah, yea, the seventy years of the desolation of Jerusalem that would be fulfilled.)"},{"num":3,"verse":"And I setted my face to my Lord God, to pray and beseech in fastings, in sackcloth, and ashes. (And I set my face before the Lord my God, to pray and to beseech him, with fasting, in sackcloth, and ashes.)"},{"num":4,"verse":"And I prayed my Lord God, and I acknowledged, and said, I beseech, thou Lord God, great and fearedful, keeping covenant and mercy to them that love thee, and keep thy commandments. (And I prayed to the Lord my God, and I acknowledged, and said, I beseech thee, O Lord God, great and fearful, keeping covenant and giving mercy to those who love thee, and who obey thy commandments.)"},{"num":5,"verse":"We have sinned, we have done wickedness, we did unfaithfully, and went away, and bowed away from thy commandments and dooms. (We have sinned, we have done wickedness, we did unfaithfully, and rebelled, and turned away from thy commandments and thy judgements/and thy laws.)"},{"num":6,"verse":"We obeyed not to thy servants, (the) prophets, that spake in thy name to our kings, to our princes, and to our fathers, and to all the people of the land. (We did not obey thy servants, the prophets, who spoke in thy name to our kings, to our leaders, to our forefathers, and to all the people of the land.)"},{"num":7,"verse":"Lord, rightfulness is to thee, forsooth shame of face is to us, as (it) is today to a man of Judah, and to the dwellers of Jerusalem (and to the inhabitants of Jerusalem), and to all Israel, to these men that be nigh, and to these men that be afar in all lands, to which thou castedest them out for the wickednesses of them, in which, Lord, they sinned against thee."},{"num":8,"verse":"Shame of face is to us, to our kings, to our princes, and to our fathers, that sinned; (Shame is to us, to our kings, to our rulers, and to our forefathers, who sinned;)"},{"num":9,"verse":"but mercy and benignity is to thee, our Lord God (but mercy and generosity of spirit, or forgiveness, is to thee, O Lord our God). For we went away from thee,"},{"num":10,"verse":"and heard not the voice of our Lord God, that we should go in the law of him, which he setted to us by his servants, (the) prophets. (and did not listen to the voice of the Lord our God, that we should go in his Law, which he gave to us by his servants, the prophets.)"},{"num":11,"verse":"And all Israel brake thy law, and bowed away, (so) that they heard not thy voice; and (the) cursing and (the) loathing, which is written in the book of Moses, the servant of God, dropped on us, for we sinned to him (for we have sinned against him)."},{"num":12,"verse":"And he ordained his words, which he spake on us, and on our princes, that deemed us, that they should bring in on us great evil, what manner evil was never under all heaven, by that that is done in Jerusalem, (And he ordained his words, which he spoke against us, and against our rulers, who judged us, so that they would bring in upon us great evil, what manner evil was never under all heaven, by that which is done in Jerusalem,)"},{"num":13,"verse":"as it is written in the law of Moses. All this evil came [up]on us, and, our Lord God, we prayed not thy face, that we should turn again from our wickednesses, and should think (on) thy truth. (as it is written in the Law of Moses. All this evil came upon us, and, O Lord our God, we did not pray to thee, that we should turn back from our wickednesses, and should think upon thy truth.)"},{"num":14,"verse":"And the Lord waked on malice, and brought it on us; our Lord God is just in all his works which he made, for we heard not his voice. (And the Lord watched, and then brought in this malice upon us; for the Lord our God is just, and right, in all his works which he made, but we did not listen to him, or obey him.)"},{"num":15,"verse":"And now, our Lord God, that leddest thy people out of the land of Egypt in strong hand, and madest to thee a name by this day, we have sinned, we have done wickedness, (And now, O Lord our God, who leddest thy people out of the land of Egypt with a strong hand, and madest to thee a name by this day, we have sinned, yea, we have done wickedness.)"},{"num":16,"verse":"Lord, against all thy rightfulness. I beseech, thy wrath and thy strong vengeance be turned away from thy city Jerusalem, and from thy holy hill; for why for our sins, and for the wickednesses of our fathers, Jerusalem and thy people be in shame, to all men by our compass. (O Lord, according to all thy righteousness, I beseech thee, let thy anger and thy strong vengeance be turned away from thy city Jerusalem, and from thy holy hill; and because of our sins, and the wickednesses of our forefathers, Jerusalem and thy people be in shame, to all those who live all around us.)"},{"num":17,"verse":"But now, our God, hear thou the prayer of thy servant, and the beseechings of him, and show thy face on thy saintuary, which is forsaken. (But now, our God, hear thou the prayer of thy servant, and his beseechings, and for thy own sake, let thy face shine upon thy sanctuary, which is deserted.)"},{"num":18,"verse":"My God, for thyself bow down thine ear, and hear; open thine eyes, and see our desolation, and the city, on which thy name is called to help. For not in our (own) justifyings we set forth meekly prayers before thy face, but in thy many merciful doings. (My God, bow down thy ear, and hear; open thine eyes, and see our desolation, and the city, which is called by thy name. For not in our own justifyings do we humbly put forth our prayers before thee, but for thy many merciful doings.)"},{"num":19,"verse":"Lord, hear thou; Lord, be thou pleased, perceive thou, and do; my Lord God, tarry thou not, for thyself, for thy name is called to help on the city, and on thy people. (Lord, hear thou; Lord, forgive thou; Lord, perceive thou, and do; for thy own sake, my God, tarry thou not, for this city and thy people be called by thy name.)"},{"num":20,"verse":"And when I spake yet, and prayed, and acknowledged my sins, and the sins of my people Israel, that I should set forth meekly my prayers in the sight of my God (that I should humbly put forth my prayers before my God), for the holy hill of my God,"},{"num":21,"verse":"the while I spake yet in my prayer, lo! the man Gabriel, whom I had seen in vision at the beginning, flew soon, and touched me in the time of eventide sacrifice; (and yet while I spoke my prayer, lo! the angel Gabriel, whom I had seen in vision before, or at the beginning, flew swiftly, and touched me at the time of the evening sacrifice;)"},{"num":22,"verse":"and he taught me, and he spake to me, and said, Daniel, now I went out, that I should teach thee, and thou shouldest understand. (and he taught me, and he spoke to me, and said, Daniel, I have come now to teach thee, so that thou wouldest understand.)"},{"num":23,"verse":"From the beginning of thy prayers a word went out. Forsooth I came to show to thee, for thou art a man of desires (And I came to show thee, because thou art a man much beloved); therefore perceive thou the word, and understand thou the vision."},{"num":24,"verse":"Seventy weeks of years be abridged on thy people, and on thine holy city, that trespassing be ended, and sin take an end (and sin is brought to an end), and that wickedness be done away, and everlasting rightfulness be brought, and that the vision and prophecy be [ful]filled, and the Holy (Place) of (the) saints be anointed."},{"num":25,"verse":"Therefore know thou, and perceive; from the going out of the word that Jerusalem be builded again, till to Christ, the duke, shall be seven weeks of years and two and sixty weeks of years; and again the street shall be builded, and walls, in the anguish of times. (And so know thou, and understand; from the going out of the word that Jerusalem be rebuilt, until the Anointed One, yea, the Prince, or the Ruler, shall be seven weeks of years and sixty-two weeks of years; and the streets and the walls shall be rebuilt, in the time of anguish.)"},{"num":26,"verse":"And after two and sixty weeks of years Christ shall be slain. And it shall not be his people, that shall deny him. And the people with the duke to coming shall destroy the city, and the saintuary; and the end thereof shall be destroying, and after the end of battle shall be ordained desolation. (And after sixty-two weeks of years the Anointed One shall be killed. And it shall not be his own people, who shall deny him life, that is who shall kill him. Yea, other people, coming with their own ruler, shall destroy the city, and the sanctuary; and its end shall be in utter destruction, and after the end of the battle there shall be ordained a desolation.)"},{"num":27,"verse":"Forsooth one week of years shall confirm the covenant to many men, and the offering and sacrifice shall fail in the midst of the week of years; and abomination of desolation shall be in the temple, and the desolation shall continue till to the performing and end. (And one week of years shall confirm the covenant to many people, and the offering and the sacrifice shall be stopped in the midst of the week of years; and the abomination that maketh desolation shall be placed in the Temple, and the desolation shall continue until the performing and the end of it.)"}]