[{"num":1,"verse":"In the third year of the reign of Y’hoyakim king of Y’hudah, N’vukhadnetzar king of Bavel came to Yerushalayim and laid siege to it; "},{"num":2,"verse":"and Adonai handed Y’hoyakim king of Y’hudah over to him, along with some of the articles from the house of God. He took them to the land of Shin‘ar, to the house of his god and placed the articles in the storehouse of his god."},{"num":3,"verse":"The king ordered Ashp’naz, the eunuch serving as his chief officer, to bring into the palace from the people of Isra’el some of royal or noble descent. "},{"num":4,"verse":"They were to be boys without physical defect, handsome in appearance, versed in all kinds of wisdom, quick to learn, discerning, and having the capacity to serve in the king’s palace; and he was to teach them the language and literature of the Kasdim. "},{"num":5,"verse":"The king assigned them a daily portion of his own food and the wine he drank, and they were to be cared for in this way for three years. At the end of this time they were to become the king’s attendants."},{"num":6,"verse":"Among these, from the people of Y’hudah, were Dani’el, Hananyah, Misha’el and ‘Azaryah. "},{"num":7,"verse":"The chief officer gave them other names — to Dani’el he gave the name Belt’shatzar; to Hananyah, Shadrakh; to Misha’el, Meishakh; and to ‘Azaryah, ‘Aved-N’go."},{"num":8,"verse":"But Dani’el resolved that he would not defile himself with the king’s food or the wine he drank, so he asked the chief officer to be excused from defiling himself. "},{"num":9,"verse":"God caused the chief officer to be kind and sympathetic toward Dani’el; "},{"num":10,"verse":"however, the chief officer said to Dani’el, “I’m afraid of my lord the king. After all, he has given you an allowance of food and drink; so if he were to see you boys looking worse than the others your age, you would be putting my own head in danger from the king.”"},{"num":11,"verse":"Then Dani’el said to the guard whom the chief officer had put in charge of Dani’el, Hananyah, Misha’el and ‘Azaryah, "},{"num":12,"verse":"“Please! Try an experiment on your servants — for ten days have them give us only vegetables to eat and water to drink. "},{"num":13,"verse":"Then see how we look, and compare us with how the boys who eat the king’s food look; and deal with your servants according to what you see.” "},{"num":14,"verse":"He agreed to do what they had asked and gave them a ten-day test. "},{"num":15,"verse":"At the end of ten days they looked better and more robust than all the boys who were eating the king’s food. "},{"num":16,"verse":"So the guard took away their food and the wine they were supposed to drink, and gave them vegetables."},{"num":17,"verse":"To these four boys God had given knowledge and skill in every aspect of learning and wisdom; moreover, Dani’el could understand all kinds of visions and dreams."},{"num":18,"verse":"When the time the king had set for them to be presented came, the chief officer presented them to N’vukhadnetzar; "},{"num":19,"verse":"and when the king spoke with them, none was found among all of them to compare with Dani’el, Hananyah, Misha’el and ‘Azaryah. So they entered the king’s service; "},{"num":20,"verse":"and in all matters requiring wisdom and understanding, whenever the king consulted them, he found them ten times better than all the magicians and exorcists in his entire kingdom."},{"num":21,"verse":"So Dani’el remained there until the first year of King Koresh."}]