[{"header":"Four Young Israelites at the Babylonian Court"},{"num":1,"verse":"In the third year of the reign of Jehoi′akim king of Judah, Nebuchadnez′zar king of Babylon came to Jerusalem and besieged it. "},{"num":2,"verse":"And the Lord gave Jehoi′akim king of Judah into his hand, with some of the vessels of the house of God; and he brought them to the land of Shinar, to the house of his god, and placed the vessels in the treasury of his god. "},{"num":3,"verse":"Then the king commanded Ash′penaz, his chief eunuch, to bring some of the people of Israel, both of the royal family and of the nobility, "},{"num":4,"verse":"youths without blemish, handsome and skilful in all wisdom, endowed with knowledge, understanding learning, and competent to serve in the king’s palace, and to teach them the letters and language of the Chalde′ans. "},{"num":5,"verse":"The king assigned them a daily portion of the rich food which the king ate, and of the wine which he drank. They were to be educated for three years, and at the end of that time they were to stand before the king. "},{"num":6,"verse":"Among these were Daniel, Hanani′ah, Mish′a-el, and Azari′ah of the tribe of Judah. "},{"num":7,"verse":"And the chief of the eunuchs gave them names: Daniel he called Belteshaz′zar, Hanani′ah he called Shadrach, Mish′a-el he called Meshach, and Azari′ah he called Abed′nego."},{"num":8,"verse":"But Daniel resolved that he would not defile himself with the king’s rich food, or with the wine which he drank; therefore he asked the chief of the eunuchs to allow him not to defile himself. "},{"num":9,"verse":"And God gave Daniel favor and compassion in the sight of the chief of the eunuchs; "},{"num":10,"verse":"and the chief of the eunuchs said to Daniel, “I fear lest my lord the king, who appointed your food and your drink, should see that you were in poorer condition than the youths who are of your own age. So you would endanger my head with the king.” "},{"num":11,"verse":"Then Daniel said to the steward whom the chief of the eunuchs had appointed over Daniel, Hanani′ah, Mish′a-el, and Azari′ah, "},{"num":12,"verse":"“Test your servants for ten days; let us be given vegetables to eat and water to drink. "},{"num":13,"verse":"Then let our appearance and the appearance of the youths who eat the king’s rich food be observed by you, and according to what you see deal with your servants.” "},{"num":14,"verse":"So he hearkened to them in this matter, and tested them for ten days. "},{"num":15,"verse":"At the end of ten days it was seen that they were better in appearance and fatter in flesh than all the youths who ate the king’s rich food. "},{"num":16,"verse":"So the steward took away their rich food and the wine they were to drink, and gave them vegetables."},{"num":17,"verse":"As for these four youths, God gave them learning and skill in all letters and wisdom; and Daniel had understanding in all visions and dreams. "},{"num":18,"verse":"At the end of the time, when the king had commanded that they should be brought in, the chief of the eunuchs brought them in before Nebuchadnez′zar. "},{"num":19,"verse":"And the king spoke with them, and among them all none was found like Daniel, Hanani′ah, Mish′a-el, and Azari′ah; therefore they stood before the king. "},{"num":20,"verse":"And in every matter of wisdom and understanding concerning which the king inquired of them, he found them ten times better than all the magicians and enchanters that were in all his kingdom. "},{"num":21,"verse":"And Daniel continued until the first year of King Cyrus."}]