[{"header":"God Will Answer His People"},{"num":18,"verse":"Then Jesus taught the followers that they should always pray and never lose hope. He used this story to teach them:"},{"num":2,"verse":"“Once there was a judge in a town. He did not care about God. He also did not care what people thought about him."},{"num":3,"verse":"In that same town there was a woman whose husband had died. She came many times to this judge and said, ‘There is a man who is doing bad things to me. Give me my rights!’"},{"num":4,"verse":"But the judge did not want to help the woman. After a long time, the judge thought to himself, ‘I don’t care about God. And I don’t care about what people think."},{"num":5,"verse":"But this woman is bothering me. If I give her what she wants, then she will leave me alone. But if I don’t give her what she wants, she will bother me until I am sick.’”"},{"num":6,"verse":"The Lord said, “Listen, there is meaning in what the bad judge said."},{"num":7,"verse":"God’s people shout to him night and day, and he will always give them what is right. He will not be slow to answer them."},{"num":8,"verse":"I tell you, God will help his people quickly. But when the Son of Man comes again, will he find people on earth who believe in him?”"},{"header":"Being Right With God"},{"num":9,"verse":"There were some people who thought they were very good and looked down on everyone else. Jesus used this story to teach them:"},{"num":10,"verse":"“One time there was a Pharisee and a tax collector. One day they both went to the Temple to pray."},{"num":11,"verse":"The Pharisee stood alone, away from the tax collector. When the Pharisee prayed, he said, ‘O God, I thank you that I am not as bad as other people. I am not like men who steal, cheat, or commit adultery. I thank you that I am better than this tax collector."},{"num":12,"verse":"I fast twice a week, and I give a tenth of everything I get!’"},{"num":13,"verse":"“The tax collector stood alone too. But when he prayed, he would not even look up to heaven. He felt very humble before God. He said, ‘O God, have mercy on me. I am a sinner!’"},{"num":14,"verse":"I tell you, when this man finished his prayer and went home, he was right with God. But the Pharisee, who felt that he was better than others, was not right with God. People who make themselves important will be made humble. But those who make themselves humble will be made important.”"},{"header":"Jesus Welcomes Children(A)"},{"num":15,"verse":"Some people brought their small children to Jesus so that he could lay his hands on them to bless them. But when the followers saw this, they told the people not to do this."},{"num":16,"verse":"But Jesus called the little children to him and said to his followers, “Let the little children come to me. Don’t stop them, because God’s kingdom belongs to people who are like these little children."},{"num":17,"verse":"The truth is, you must accept God’s kingdom like a little child accepts things, or you will never enter it.”"},{"header":"A Rich Man Refuses to Follow Jesus(B)"},{"num":18,"verse":"A religious leader asked Jesus, “Good Teacher, what must I do to get eternal life?”"},{"num":19,"verse":"Jesus said to him, “Why do you call me good? Only God is good."},{"num":20,"verse":"And you know his commands: ‘You must not commit adultery, you must not murder anyone, you must not steal, you must not tell lies about others, you must respect your father and mother ….’”"},{"num":21,"verse":"But the leader said, “I have obeyed all these commands since I was a boy.”"},{"num":22,"verse":"When Jesus heard this, he said to the leader, “But there is still one thing you need to do. Sell everything you have and give the money to those who are poor. You will have riches in heaven. Then come and follow me.”"},{"num":23,"verse":"But when the man heard Jesus tell him to give away his money, he was sad. He didn’t want to do this, because he was very rich."},{"num":24,"verse":"When Jesus saw that the man was sad, he said, “It will be very hard for rich people to enter God’s kingdom."},{"num":25,"verse":"It is easier for a camel to go through the eye of a needle than for a rich person to enter God’s kingdom.”"},{"header":"Who Can Be Saved?"},{"num":26,"verse":"When the people heard this, they said, “Then who can be saved?”"},{"num":27,"verse":"Jesus answered, “God can do things that are not possible for people to do.”"},{"num":28,"verse":"Peter said, “Look, we left everything we had and followed you.”"},{"num":29,"verse":"Jesus said, “I can promise that everyone who has left their home, wife, brothers, parents, or children for God’s kingdom"},{"num":30,"verse":"will get much more than they left. They will get many times more in this life. And in the world that is coming they will get the reward of eternal life.”"},{"header":"Jesus Talks Again About His Death(C)"},{"num":31,"verse":"Then Jesus talked to the twelve apostles alone. He said to them, “Listen, we are going to Jerusalem. Everything that God told the prophets to write about the Son of Man will happen."},{"num":32,"verse":"He will be handed over to the foreigners, who will laugh at him, insult him, and spit on him."},{"num":33,"verse":"They will beat him with whips and then kill him. But on the third day after his death, he will rise to life again.”"},{"num":34,"verse":"The apostles tried to understand this, but they could not; the meaning was hidden from them."},{"header":"Jesus Heals a Blind Man(D)"},{"num":35,"verse":"Jesus came near the city of Jericho. There was a blind man sitting beside the road. He was begging people for money."},{"num":36,"verse":"When he heard the people coming down the road, he asked, “What is happening?”"},{"num":37,"verse":"They told him, “Jesus, the one from Nazareth, is coming here.”"},{"num":38,"verse":"The blind man was excited and said, “Jesus, Son of David, please help me!”"},{"num":39,"verse":"The people who were in front leading the group criticized the blind man. They told him to be quiet. But he shouted more and more, “Son of David, please help me!”"},{"num":40,"verse":"Jesus stopped there and said, “Bring that man to me!” When he came close, Jesus asked him,"},{"num":41,"verse":"“What do you want me to do for you?”"},{"num":42,"verse":"Jesus said to him, “You can see now. You are healed because you believed.”"},{"num":43,"verse":"Then the man was able to see. He followed Jesus, thanking God. Everyone who saw this praised God for what happened."}]