[{"header":"The Parable of the Widow and the Unjust Judge"},{"num":18,"verse":"And he told them a parable, to the effect that they ought always to pray and not lose heart. "},{"num":2,"verse":"He said, “In a certain city there was a judge who neither feared God nor regarded man; "},{"num":3,"verse":"and there was a widow in that city who kept coming to him and saying, ‘Vindicate me against my adversary.’ "},{"num":4,"verse":"For a while he refused; but afterward he said to himself, ‘Though I neither fear God nor regard man, "},{"num":5,"verse":"yet because this widow bothers me, I will vindicate her, or she will wear me out by her continual coming.’” "},{"num":6,"verse":"And the Lord said, “Hear what the unrighteous judge says. "},{"num":7,"verse":"And will not God vindicate his elect, who cry to him day and night? Will he delay long over them? "},{"num":8,"verse":"I tell you, he will vindicate them speedily. Nevertheless, when the Son of man comes, will he find faith on earth?”"},{"header":"The Parable of the Pharisee and the Tax Collector"},{"num":9,"verse":"He also told this parable to some who trusted in themselves that they were righteous and despised others: "},{"num":10,"verse":"“Two men went up into the temple to pray, one a Pharisee and the other a tax collector. "},{"num":11,"verse":"The Pharisee stood and prayed thus with himself, ‘God, I thank thee that I am not like other men, extortioners, unjust, adulterers, or even like this tax collector. "},{"num":12,"verse":"I fast twice a week, I give tithes of all that I get.’ "},{"num":13,"verse":"But the tax collector, standing far off, would not even lift up his eyes to heaven, but beat his breast, saying, ‘God, be merciful to me a sinner!’ "},{"num":14,"verse":"I tell you, this man went down to his house justified rather than the other; for every one who exalts himself will be humbled, but he who humbles himself will be exalted.”"},{"header":"Jesus Blesses Little Children"},{"num":15,"verse":"Now they were bringing even infants to him that he might touch them; and when the disciples saw it, they rebuked them. "},{"num":16,"verse":"But Jesus called them to him, saying, “Let the children come to me, and do not hinder them; for to such belongs the kingdom of God. "},{"num":17,"verse":"Truly, I say to you, whoever does not receive the kingdom of God like a child shall not enter it.”"},{"header":"The Rich Ruler"},{"num":18,"verse":"And a ruler asked him, “Good Teacher, what shall I do to inherit eternal life?” "},{"num":19,"verse":"And Jesus said to him, “Why do you call me good? No one is good but God alone. "},{"num":20,"verse":"You know the commandments: ‘Do not commit adultery, Do not kill, Do not steal, Do not bear false witness, Honor your father and mother.’” "},{"num":21,"verse":"And he said, “All these I have observed from my youth.” "},{"num":22,"verse":"And when Jesus heard it, he said to him, “One thing you still lack. Sell all that you have and distribute to the poor, and you will have treasure in heaven; and come, follow me.” "},{"num":23,"verse":"But when he heard this he became sad, for he was very rich. "},{"num":24,"verse":"Jesus looking at him said, “How hard it is for those who have riches to enter the kingdom of God! "},{"num":25,"verse":"For it is easier for a camel to go through the eye of a needle than for a rich man to enter the kingdom of God.” "},{"num":26,"verse":"Those who heard it said, “Then who can be saved?” "},{"num":27,"verse":"But he said, “What is impossible with men is possible with God.” "},{"num":28,"verse":"And Peter said, “Lo, we have left our homes and followed you.” "},{"num":29,"verse":"And he said to them, “Truly, I say to you, there is no man who has left house or wife or brothers or parents or children, for the sake of the kingdom of God, "},{"num":30,"verse":"who will not receive manifold more in this time, and in the age to come eternal life.”"},{"header":"A Third Time Jesus Foretells His Death and Resurrection"},{"num":31,"verse":"And taking the twelve, he said to them, “Behold, we are going up to Jerusalem, and everything that is written of the Son of man by the prophets will be accomplished. "},{"num":32,"verse":"For he will be delivered to the Gentiles, and will be mocked and shamefully treated and spit upon; "},{"num":33,"verse":"they will scourge him and kill him, and on the third day he will rise.” "},{"num":34,"verse":"But they understood none of these things; this saying was hid from them, and they did not grasp what was said."},{"header":"Jesus Heals a Blind Beggar Near Jericho"},{"num":35,"verse":"As he drew near to Jericho, a blind man was sitting by the roadside begging; "},{"num":36,"verse":"and hearing a multitude going by, he inquired what this meant. "},{"num":37,"verse":"They told him, “Jesus of Nazareth is passing by.” "},{"num":38,"verse":"And he cried, “Jesus, Son of David, have mercy on me!” "},{"num":39,"verse":"And those who were in front rebuked him, telling him to be silent; but he cried out all the more, “Son of David, have mercy on me!” "},{"num":40,"verse":"And Jesus stopped, and commanded him to be brought to him; and when he came near, he asked him, "},{"num":41,"verse":"“What do you want me to do for you?” He said, “Lord, let me receive my sight.” "},{"num":42,"verse":"And Jesus said to him, “Receive your sight; your faith has made you well.” "},{"num":43,"verse":"And immediately he received his sight and followed him, glorifying God; and all the people, when they saw it, gave praise to God."}]