[[],[{"type":"header","content":"Ahaziah Succeeds Jehoram in Judah"},{"type":"prose","content":"Then the inhabitants of Jerusalem made Ahaziah, his youngest son, king in his place, because the band of men (raiders) who came with the Arabs to the camp had killed all the older . So Ahaziah the son of Jehoram king of Judah began to reign. "}],[{"type":"prose","content":"Ahaziah was twenty-two years old when he became king and he reigned one year in Jerusalem. His mother’s name was Athaliah, a granddaughter of Omri. "}],[{"type":"prose","content":"He also walked in the ways of the house of Ahab, for his mother was his adviser [and she encouraged him] to act wickedly. "}],[{"type":"prose","content":"So he did evil in the sight of the  like the house of Ahab, for they were his advisers after the death of his father, resulting in his destruction."},{"type":"header","content":"Ahaziah Allies with Jehoram of Israel"}],[{"type":"prose","content":"He also walked in accordance with their advice, and he went with Jehoram the son of Ahab king of Israel to wage war against Hazael king of Aram (Syria) at Ramoth-gilead. And the Arameans wounded Joram (Jehoram). "}],[{"type":"prose","content":"Then he returned to Jezreel to recover from the wounds they had inflicted on him at Ramah when he fought against Hazael king of Aram. And Ahaziah, the son of Jehoram king of Judah, went down to see Jehoram the son of Ahab in Jezreel, because he was sick."}],[{"type":"prose","content":"But the downfall of Ahaziah was ordained by God, in that he went to Joram (Jehoram). For when he arrived there he went out [as an ally] with Jehoram against Jehu the son of Nimshi, whom the  had anointed to destroy the house of Ahab."},{"type":"header","content":"Jehu Murders Leaders of Judah"}],[{"type":"prose","content":"It came about that when Jehu was executing judgment on the house of Ahab, he found the leaders of Judah and the sons of Ahaziah’s [murdered] brothers ministering to Ahaziah, and he killed them. "}],[{"type":"prose","content":"Jehu also searched for Ahaziah, who was hiding in Samaria; he was captured, brought to Jehu, and put to death. They buried him, for they said, “, he is the grandson of Jehoshaphat, who sought the  with all his heart.” So the house of Ahaziah had no one  to retain the power to rule over the kingdom."}],[{"type":"prose","content":"Now when Athaliah the mother of Ahaziah saw that her son was dead, she rose and destroyed all the royal family of the house of Judah. "}],[{"type":"prose","content":"But Jehoshabeath, the king’s daughter, took Joash the [infant] son of Ahaziah and stole him away from among the king’s sons who were being put to death, and she placed him and his nurse in the bedroom. So Jehoshabeath, the daughter of King Jehoram [of Judah] and wife of Jehoiada the priest, hid Joash from [his grandmother] Athaliah so that she did not murder him for Jehoshabeath was the sister of Ahaziah. "}],[{"type":"prose","content":"Joash was hidden with them in the house (temple) of God for six years, and Athaliah reigned over the land."}]]