[{"header":"Chapter 22"},{"num":1,"verse":"Ahaziah. Then the inhabitants of Jerusalem made Ahaziah, his youngest son, king to succeed him, since all the older sons had been killed by the band that had come into the camp with the Arabians. Thus Ahaziah, son of Jehoram, reigned as the king of Judah. "},{"num":2,"verse":"Ahaziah was twenty-two years old when he became king, and he reigned one year in Jerusalem. His mother’s name was Athaliah, daughter of Omri. "},{"num":3,"verse":"He, too, walked in the ways of the house of Ahab, because his mother was his counselor in doing evil. "},{"num":4,"verse":"To his own destruction, he did what was evil in the sight of the Lord, like the house of Ahab, since they were his counselors after the death of his father."},{"num":5,"verse":"He was also following their counsel when he joined Jehoram, son of Ahab, king of Israel, in battle against Hazael, king of Aram, at Ramoth-gilead, where the Arameans wounded Jehoram. "},{"num":6,"verse":"He returned to Jezreel to be healed of the wounds that had been inflicted on him at Ramah in his battle against Hazael, king of Aram. Then Ahaziah, son of Jehoram, king of Judah, went down to Jezreel to visit Jehoram, son of Ahab, for he was sick. "},{"num":7,"verse":"Now from God came Ahaziah’s downfall, that he should join Jehoram; for after his arrival he rode out with Jehoram to Jehu, son of Nimshi, whom the Lord had anointed to cut down the house of Ahab. "},{"num":8,"verse":"While Jehu was executing judgment on the house of Ahab, he also came upon the princes of Judah and the nephews of Ahaziah who were his attendants, and he killed them. "},{"num":9,"verse":"Then he looked for Ahaziah himself. They caught him hiding in Samaria and brought him to Jehu, who put him to death. They buried him, for they said, “He was the grandson of Jehoshaphat, who sought the Lord with his whole heart.” Now the house of Ahaziah did not retain the power of kingship."},{"num":10,"verse":"Usurpation of Athaliah. When Athaliah, the mother of Ahaziah, saw that her son was dead, she began to kill off the whole royal family of the house of Judah. "},{"num":11,"verse":"But Jehosheba, a daughter of the king, took Joash, Ahaziah’s son, and spirited him away from among the king’s sons who were about to be slain, and put him and his nurse in a bedroom. In this way Jehosheba, the daughter of King Jehoram, a sister of Ahaziah and wife of Jehoiada the priest, concealed the child from Athaliah, so that she did not put him to death. "},{"num":12,"verse":"For six years he remained hidden with them in the house of God, while Athaliah ruled as queen over the land."}]