[{"header":"Ahaziah’s Reign"},{"num":22,"verse":"And the inhabitants of Jerusalem made Ahazi′ah his youngest son king in his stead; for the band of men that came with the Arabs to the camp had slain all the older sons. So Ahazi′ah the son of Jehor′am king of Judah reigned. "},{"num":2,"verse":"Ahazi′ah was forty-two years old when he began to reign, and he reigned one year in Jerusalem. His mother’s name was Athali′ah, the granddaughter of Omri. "},{"num":3,"verse":"He also walked in the ways of the house of Ahab, for his mother was his counselor in doing wickedly. "},{"num":4,"verse":"He did what was evil in the sight of the Lord, as the house of Ahab had done; for after the death of his father they were his counselors, to his undoing. "},{"num":5,"verse":"He even followed their counsel, and went with Jehor′am the son of Ahab king of Israel to make war against Haz′ael king of Syria at Ra′moth-gil′ead. And the Syrians wounded Joram, "},{"num":6,"verse":"and he returned to be healed in Jezre′el of the wounds which he had received at Ramah, when he fought against Haz′ael king of Syria. And Ahazi′ah the son of Jehor′am king of Judah went down to see Joram the son of Ahab in Jezre′el, because he was sick."},{"num":7,"verse":"But it was ordained by God that the downfall of Ahazi′ah should come about through his going to visit Joram. For when he came there he went out with Jehor′am to meet Jehu the son of Nimshi, whom the Lord had anointed to destroy the house of Ahab. "},{"num":8,"verse":"And when Jehu was executing judgment upon the house of Ahab, he met the princes of Judah and the sons of Ahazi′ah’s brothers, who attended Ahazi′ah, and he killed them. "},{"num":9,"verse":"He searched for Ahazi′ah, and he was captured while hiding in Samar′ia, and he was brought to Jehu and put to death. They buried him, for they said, “He is the grandson of Jehosh′aphat, who sought the Lord with all his heart.” And the house of Ahazi′ah had no one able to rule the kingdom."},{"header":"Athaliah Seizes the Throne"},{"num":10,"verse":"Now when Athali′ah the mother of Ahazi′ah saw that her son was dead, she arose and destroyed all the royal family of the house of Judah. "},{"num":11,"verse":"But Jeho-shab′e-ath, the daughter of the king, took Jo′ash the son of Ahazi′ah, and stole him away from among the king’s sons who were about to be slain, and she put him and his nurse in a bedchamber. Thus Jeho-shab′e-ath, the daughter of King Jehor′am and wife of Jehoi′ada the priest, because she was a sister of Ahazi′ah, hid him from Athali′ah, so that she did not slay him; "},{"num":12,"verse":"and he remained with them six years, hid in the house of God, while Athali′ah reigned over the land."}]