[{"header":"The Triumphal Entry"},{"num":21,"verse":"When they approached Jerusalem and came to Bethphage at the Mount of Olives, Jesus then sent two disciples, "},{"num":2,"verse":"telling them, “Go into the village ahead of you. At once you will find a donkey tied there, and a colt with her. Untie them and bring them to Me. "},{"num":4,"verse":"This took place so that what was spoken through the prophet might be fulfilled:"},{"num":6,"verse":"The disciples went and did just as Jesus directed them. "},{"num":7,"verse":"They brought the donkey and the colt; then they laid their robes on them, and He sat on them. "},{"num":8,"verse":"A very large crowd spread their robes on the road; others were cutting branches from the trees and spreading them on the road. "},{"num":9,"verse":"Then the crowds who went ahead of Him and those who followed kept shouting:"},{"num":10,"verse":"When He entered Jerusalem, the whole city was shaken, saying, “Who is this?” "},{"num":11,"verse":"And the crowds kept saying, “This is the prophet Jesus from Nazareth in Galilee!”"},{"header":"Cleansing the Temple Complex"},{"num":12,"verse":"Jesus went into the temple complex and drove out all those buying and selling in the temple. He overturned the money changers’ tables and the chairs of those selling doves. "},{"num":13,"verse":"And He said to them, “It is written, My house will be called a house of prayer. But you are making it a den of thieves!”"},{"header":"Children Praise Jesus"},{"num":14,"verse":"The blind and the lame came to Him in the temple complex, and He healed them. "},{"num":15,"verse":"When the chief priests and the scribes saw the wonders that He did and the children shouting in the temple complex, “Hosanna to the Son of David!” they were indignant "},{"num":16,"verse":"and said to Him, “Do You hear what these children are saying?”"},{"num":17,"verse":"Then He left them, went out of the city to Bethany, and spent the night there."},{"header":"The Barren Fig Tree"},{"num":18,"verse":"Early in the morning, as He was returning to the city, He was hungry. "},{"num":19,"verse":"Seeing a lone fig tree by the road, He went up to it and found nothing on it except leaves. And He said to it, “May no fruit ever come from you again!” At once the fig tree withered."},{"num":20,"verse":"When the disciples saw it, they were amazed and said, “How did the fig tree wither so quickly?”"},{"num":21,"verse":"Jesus answered them, “I assure you: If you have faith and do not doubt, you will not only do what was done to the fig tree, but even if you tell this mountain, ‘Be lifted up and thrown into the sea,’ it will be done. "},{"header":"Messiah’s Authority Challenged"},{"num":23,"verse":"When He entered the temple complex, the chief priests and the elders of the people came up to Him as He was teaching and said, “By what authority are You doing these things? Who gave You this authority?”"},{"num":24,"verse":"Jesus answered them, “I will also ask you one question, and if you answer it for Me, then I will tell you by what authority I do these things. "},{"num":26,"verse":"But if we say, ‘From men,’ we’re afraid of the crowd, because everyone thought John was a prophet.” "},{"num":27,"verse":"So they answered Jesus, “We don’t know.”"},{"header":"The Parable of the Two Sons"},{"header":"The Parable of the Vineyard Owner"},{"num":41,"verse":"“He will completely destroy those terrible men,” they told Him, “and lease his vineyard to other farmers who will give him his produce at the harvest.”"},{"num":42,"verse":"Jesus said to them, “Have you never read in the Scriptures:"},{"num":45,"verse":"When the chief priests and the Pharisees heard His parables, they knew He was speaking about them. "},{"num":46,"verse":"Although they were looking for a way to arrest Him, they feared the crowds, because they regarded Him as a prophet."}]