[{"header":"Encounters at Jerusalem"},{"header":"Chapter 21"},{"num":1,"verse":"The Entry into Jerusalem. When they drew near Jerusalem and had reached Bethphage on the Mount of Olives, Jesus sent off two disciples,"},{"num":2,"verse":"saying to them, “Go to the village directly ahead of you, and as soon as you enter you will find a tethered donkey and a colt with her. Untie them and bring them to me."},{"num":3,"verse":"If anyone says anything to you, tell them, ‘The Lord needs them.’ Then he will let you have them at once.”"},{"num":4,"verse":"This was to fulfill what had been spoken by the prophet:"},{"num":6,"verse":"The disciples went off and did as Jesus had instructed them."},{"num":7,"verse":"They brought the donkey and the colt, and laid their cloaks on their backs, and he sat on them."},{"num":8,"verse":"A very large crowd spread their cloaks on the road, while others cut branches from the trees and spread them on the road."},{"num":9,"verse":"The crowds that preceded him and those that followed kept shouting:"},{"num":10,"verse":"And when he entered Jerusalem, the whole city was filled with excitement. “Who is this?” the people asked,"},{"num":11,"verse":"and the crowds replied, “This is the prophet Jesus from Nazareth in Galilee.”"},{"num":12,"verse":"Jesus Cleanses the Temple. Then Jesus entered the temple and drove out all those whom he found buying and selling there. He overturned the tables of the money changers and the seats of those who were selling doves."},{"num":13,"verse":"He said to them, “It is written:"},{"num":14,"verse":"The blind and the crippled came to him in the temple, and he cured them."},{"num":15,"verse":"But when the chief priests and the scribes witnessed the wonderful things he was performing and heard the children crying out in the temple area, “Hosanna to the Son of David,” they became infuriated"},{"num":16,"verse":"and said to him, “Do you hear what they are saying?” Jesus replied, “Yes. Have you never read the text:"},{"num":17,"verse":"Then he left them and went out of the city to Bethany, where he spent the night."},{"num":18,"verse":"The Lesson of the Withered Fig Tree. Early the next morning, as he was returning to the city, he was hungry."},{"num":19,"verse":"Noticing a fig tree by the side of the road, he went over to it but found nothing on its branches except leaves. Then he said to it, “May you never give forth fruit again!” And instantly the fig tree withered away."},{"num":20,"verse":"When the disciples witnessed this, they were stunned, and they asked, “How could that fig tree wither away in an instant?”"},{"num":21,"verse":"Jesus answered them, “Amen, I say to you, if you have faith and do not doubt, not only will you do what has been done to this fig tree, but even if you say to this mountain, ‘Be lifted up and thrown into the sea,’ it will be accomplished."},{"num":22,"verse":"Whatever you ask for in faith-filled prayer, you will receive.”"},{"num":23,"verse":"The Authority of Jesus Questioned. When he entered the temple and began to teach, the chief priests and the elders of the people approached him and asked, “By what authority are you doing these things? And who gave you this authority?”"},{"num":24,"verse":"Jesus said to them in reply, “I will also ask you one question. If you give me an answer, then I will tell you by what authority I do these things."},{"num":25,"verse":"Where did John’s baptism originate? From heaven or from men?”"},{"num":27,"verse":"Therefore, they answered Jesus, “We do not know.” And Jesus said to them, “Then neither shall I tell you by what authority I do these things."},{"num":28,"verse":"The Parable of the Two Sons.“What is your opinion about this? A man had two sons. He went to the first and said, ‘My son, go and work in the vineyard today.’"},{"num":29,"verse":"He answered, ‘I will not,’ but later he had a change of heart and went."},{"num":30,"verse":"The father then gave the same instruction to the second son, who answered, ‘Of course I will,’ but then did not go."},{"num":31,"verse":"Which of the two complied with his father’s instruction?” They responded, “The first.”"},{"num":33,"verse":"The Parable of the Tenants.“Listen to another parable. There was a landowner who planted a vineyard, fenced it in on all sides, dug a winepress in it, and built a watchtower. Then he leased it to tenants and went off on a journey."},{"num":34,"verse":"“When the time for harvest approached, he sent his servants to the tenants to collect his share of the produce."},{"num":35,"verse":"But the tenants seized his servants and beat one of them, killed another, and stoned a third."},{"num":36,"verse":"Again, he sent more servants, but they treated them in the same manner."},{"num":37,"verse":"“Finally, he sent his son to them, thinking, ‘They will respect my son.’"},{"num":38,"verse":"But when the tenants saw the son, they said to one another, ‘This is the heir. Come, let us kill him and get his inheritance.’"},{"num":39,"verse":"And so they seized him, threw him out of the vineyard, and killed him."},{"num":40,"verse":"“Now what do you think the owner of the vineyard will do to those tenants when he comes?”"},{"num":41,"verse":"They said to him, “He will kill those evil men, and then he will lease his vineyard to other tenants who will give him the produce at the harvest.”"},{"num":42,"verse":"Jesus then said to them, “Have you never read in the Scriptures:"},{"num":43,"verse":"Therefore, I tell you, the kingdom of God will be taken away from you and given to a people that will produce fruit in abundance. ["},{"num":44,"verse":"The one who falls on this stone will be broken into pieces, and the one on whom it falls will be crushed.]”"},{"num":45,"verse":"When the chief priests and the Pharisees heard his parables, they realized that he was speaking about them."},{"num":46,"verse":"They wanted to arrest him, but they were afraid of the crowds, who regarded him as a prophet."}]