[{"header":"Baruch Ha-Ba! Blessed Is He Who Comes!"},{"num":21,"verse":"Now as they drew near to Jerusalem and came to Bethphage, to the Mount of Olives, then Yeshua sent two disciples, "},{"num":2,"verse":"saying to them, “Go into the village before you. Right away, you’ll find a donkey tied up and a colt with her. Untie them and bring them to Me. "},{"num":3,"verse":"If anyone says anything to you, you shall say, ‘The Master needs them.’ And right away he will send them.”"},{"num":4,"verse":"This happened to fulfill what was spoken through the prophet, saying,"},{"num":6,"verse":"The disciples went and did as Yeshua had directed them. "},{"num":7,"verse":"They brought the donkey and colt and put their clothing on them, and He sat on the clothing. "},{"num":8,"verse":"Most of the crowd spread their clothing on the road, and others began cutting branches from the trees and spreading them on the road. "},{"num":9,"verse":"The crowds going before Him and those following kept shouting, saying,"},{"num":10,"verse":"When He entered Jerusalem, the whole city was stirred up, saying, “Who is this?” "},{"num":11,"verse":"And the crowds kept saying, “This is the prophet Yeshua, from Natzeret in the Galilee.”"},{"num":12,"verse":"Then Yeshua entered the Temple and drove out all those selling and buying in the Temple. He overturned the tables of the moneychangers and the seats of those selling doves."},{"num":13,"verse":" And He said to them, “It is written, ‘My house shall be called a house of prayer,’ but you are making it ‘a den of thieves’!”"},{"num":14,"verse":"The blind and lame came to Him in the Temple, and He healed them. "},{"num":15,"verse":"But when the ruling kohanim and Torah scholars saw the wonders He performed, and the children crying out in the Temple and saying, “Hoshia-na to Ben-David,” they became indignant. "},{"num":16,"verse":"And they said to Him, “Do You hear what these children are saying?” “Yes,” Yeshua said to them. “Haven’t you ever read,"},{"num":17,"verse":"Then He left them and went out of the city to Bethany, and He spent the night there."},{"header":"Faith Moves Mountains"},{"num":18,"verse":"Now early in the morning, as He was returning to the city, He became hungry. "},{"num":19,"verse":"Seeing a lone fig tree by the road, He came up to it and found nothing on it except leaves only. And He said to it, “May no fruit ever come from you again!” And the fig tree shriveled up at once."},{"num":20,"verse":"When the disciples saw it they were astonished. “How did the fig tree shrivel on the spot?” they asked."},{"num":21,"verse":"Yeshua answered them, “Amen, I tell you, if you have faith and do not doubt, not only will you do what was done to the fig tree, but even if you say to this mountain, ‘Be taken up and thrown into the sea,’ it will happen. "},{"num":22,"verse":"And whatever you ask in prayer, trusting, you shall receive.”"},{"header":"Questions about Yeshua’s Authority"},{"num":23,"verse":"Now when He entered the Temple, the ruling kohanim and the elders of the people came to Him while He was teaching, saying, “By what authority are You doing these things? Who gave You this authority?”"},{"num":24,"verse":"Yeshua replied to them, “I also will ask you one question. If you tell Me, I likewise will tell you by what authority I do these things. "},{"num":25,"verse":"John’s immersion, where was it from? From heaven or from men?”"},{"num":26,"verse":"But if we say, ‘From men,’ we fear the crowd, for all hold up John as a prophet.” "},{"num":27,"verse":"So answering Yeshua, they said, “We don’t know.”"},{"header":"A Parable about Intentions and Actions"},{"num":28,"verse":"“Now what do you think? A man had two sons, and he went to the first and said, ‘Son, go work in the vineyard today.’ "},{"num":29,"verse":"The son answered, ‘I won’t,’ but afterward he had a change of heart and went. "},{"num":30,"verse":"The man went to the second son and said the same thing. But he answered, ‘I will, sir,’ and didn’t go. "},{"num":31,"verse":"Which of the two did the will of the father?”"},{"num":32,"verse":"For John came to you in the way of righteousness, and you did not believe him. But the tax collectors and prostitutes did believe him; and even after you saw this, you had no change of heart to believe him.”"},{"header":"Parable of the Vineyard"},{"num":33,"verse":"“Listen to another parable. There was a master of a household who planted a vineyard. He put a hedge around it, dug a winepress in it, and built a tower. Then He leased it to some tenant farmers and went on a journey. "},{"num":34,"verse":"Now when fruit season drew near, he sent his servants to the tenants to collect his fruit. "},{"num":35,"verse":"But grabbing his servants, the tenants beat up one, killed another, and stoned still another. "},{"num":36,"verse":"Again the master sent other servants, even more than the first, and they did the same thing to them. "},{"num":37,"verse":"Finally he sent his son to them, saying, ‘They will respect my son.’"},{"num":38,"verse":"“But when the tenants saw the son, they said among themselves, ‘This is the heir! Come on, let’s kill him and get his inheritance!’ "},{"num":39,"verse":"So grabbing him, they threw him out of the vineyard and killed him. "},{"num":40,"verse":"Therefore when the master of the vineyard comes, what will he do to those tenants?”"},{"num":41,"verse":"“He will bring those miserable men to a miserable end,” they said to Him, “and will lease the vineyard to other tenants, who will give him his share of the fruits in their seasons.” "},{"num":42,"verse":"Yeshua said to them, “Have you never read in the Scriptures?"},{"num":43,"verse":"Therefore I say to you, the kingdom of God will be taken away from you and given to people producing its fruits. "},{"num":44,"verse":"Whoever falls on this stone will be shattered; but the one upon whom it falls, it will crush him.”"},{"num":45,"verse":"When the ruling kohanim and Pharisees heard Yeshua’s parables, they realized He was talking about them. "},{"num":46,"verse":"Although they were trying to seize Him, they feared the crowds, because they regarded Him as a prophet."}]