[{"num":14,"verse":"1 The Priests’ conspiracy against Christ. 3 The woman pouring oil on Christ’s head. 12 The preparing of the Passover. 22 The institution of the Supper. 41 Christ delivered into the hands of men. 43 Judas betrayeth him with a kiss. 53 Christ is before Caiaphas. 66 Peter’s denial."},{"num":1,"verse":"And two days after followed the feast of the Passover, and of unleavened bread: and the high Priests, and Scribes sought how they might take him by craft, and put him to death."},{"num":2,"verse":"But they said, Not in the feast day, lest there be any tumult among the people."},{"num":3,"verse":"And when he was in Bethany in the house of Simon the leper, as he sat at table, there came a woman having a box of ointment of Spikenard, very costly, and she brake the box, and poured it on his head."},{"num":4,"verse":"Therefore some disdained among themselves, and said, To what end is this waste of ointment?"},{"num":5,"verse":"For it might have been sold for more than three hundred pence, and been given unto the poor, and they murmured against her."},{"num":6,"verse":"But Jesus said, Let her alone: Why trouble ye her? she hath wrought a good work on me. "},{"num":7,"verse":"For ye have the poor with you always, and when ye will ye may do them good, but me ye shall not have always. "},{"num":8,"verse":"She hath done that she could: she came aforehand to anoint my body to the burying. "},{"num":9,"verse":"Verily I say unto you, wheresoever this Gospel shall be preached throughout the whole world, this also that she hath done, shall be spoken of in remembrance of her. "},{"num":10,"verse":"¶ Then Judas Iscariot, one of the twelve, went away unto the high Priests, to betray him unto them."},{"num":11,"verse":"And when they heard it, they were glad, and promised that they would give him money: therefore he sought how he might conveniently betray him."},{"num":12,"verse":"¶ Now the first day of unleavened bread, when they sacrificed the Passover, his disciples said unto him, Where wilt thou that we go and prepare, that thou mayest eat the Passover?"},{"num":13,"verse":"Then he sent forth two of his disciples, and said unto them, Go ye into the city, and there shall a man meet you bearing a pitcher of water: follow him. "},{"num":14,"verse":"And whithersoever he goeth in, say ye to the good man of the house, The master saith, Where is the lodging where I shall eat the Passover with my disciples? "},{"num":15,"verse":"And he will show you an upper chamber which is large, trimmed and prepared: there make it ready for us. "},{"num":16,"verse":"So his disciples went forth, and came to the city, and found as he had said unto them, and made ready the Passover."},{"num":17,"verse":"¶ And at even he came with the twelve."},{"num":18,"verse":"And as they sat at table and did eat, Jesus said, Verily I say unto you, that one of you shall betray me, which eateth with me. "},{"num":19,"verse":"Then they began to be sorrowful and to say to him one by one, Is it I? And another, Is it I?"},{"num":20,"verse":"And he answered and said unto them, It is one of the twelve that dippeth with me in the platter. "},{"num":21,"verse":"Truly the Son of man goeth his way, as it is written of him: but woe be to that man, by whom the Son of man is betrayed: it had been good for that man, if he had never been born. "},{"num":22,"verse":"And as they did eat, Jesus took the bread, and when he had given thanks, he brake it and gave it to them, and said, Take, eat, this is my body. "},{"num":23,"verse":"Also he took the cup, and when he had given thanks, gave it to them: and they all drank of it."},{"num":24,"verse":"And he said unto them, This is my blood of that new Testament which is shed for many. "},{"num":25,"verse":"Verily I say unto you, I will drink no more of the fruit of the vine until that day, that I drink it new in the kingdom of God. "},{"num":26,"verse":"And when they had sung a Psalm, they went out to the mount of Olives."},{"num":27,"verse":"¶ Then Jesus said unto them, All ye shall be offended by me this night: for it is written, I will smite the shepherd, and the sheep shall be scattered. "},{"num":28,"verse":"But after that I am risen, I will go into Galilee before you. "},{"num":29,"verse":"And Peter said unto him, Although all men should be offended at thee, yet would not I."},{"num":30,"verse":"Then Jesus said unto him, Verily I say unto thee, this day, even in this night before the cock crow twice, thou shalt deny me thrice. "},{"num":31,"verse":"But he said more earnestly, If I should die with thee, I will not deny thee: likewise also said they all."},{"num":32,"verse":"¶ After, they came into a place named Gethsemane: then he said to his disciples, Sit ye here, till I have prayed. "},{"num":33,"verse":"And he took with him Peter, and James, and John, and he began to be troubled, and in great heaviness,"},{"num":34,"verse":"And said unto them, My soul is very heavy, even unto the death: tarry here, and watch. "},{"num":35,"verse":"So he went forward a little, and fell down on the ground, and prayed, that if it were possible, that hour might pass from him,"},{"num":36,"verse":"And he said, Abba, Father, all things are possible unto thee: take away this cup from me: nevertheless not that I will, but that thou wilt, be done. "},{"num":37,"verse":"Then he came, and found them sleeping, and said to Peter, Simon, sleepest thou? couldest not thou watch one hour? "},{"num":38,"verse":"¶ Watch ye, and pray, that ye enter not into temptation: the spirit indeed is ready, but the flesh is weak. "},{"num":39,"verse":"And again he went away, and prayed, and spake the same words."},{"num":40,"verse":"And he returned, and found them asleep again: for their eyes were heavy: neither knew they what they should answer him."},{"num":41,"verse":"And he came the third time, and said unto them, Sleep henceforth, and take your rest: it is enough: the hour is come: behold, the Son of man is delivered into the hands of sinners. "},{"num":42,"verse":"Rise up: let us go: lo, he that betrayeth me, is at hand. "},{"num":43,"verse":"And immediately while he yet spake, came Judas that was one of the twelve, and with him a great multitude with swords and staves from the high Priests, and Scribes, and Elders."},{"num":44,"verse":"And he that betrayed him, had given them a token, saying, Whomsoever I shall kiss, he it is: take him and lead him away safely."},{"num":45,"verse":"And as soon as he was come, he went straightway to him, and said, Hail Master, and kissed him."},{"num":46,"verse":"Then they laid their hands on him, and took him."},{"num":47,"verse":"And one of them that stood by, drew out a sword, and smote a servant of the high Priest, and cut off his ear."},{"num":48,"verse":"And Jesus answered, and said to them, Ye be come out as against a thief, with swords and with staves, to take me. "},{"num":49,"verse":"I was daily with you, teaching in the Temple, and ye took me not: but this is done that the Scriptures should be fulfilled. "},{"num":50,"verse":"Then they all forsook him, and fled."},{"num":51,"verse":"And there followed him a certain young man, clothed in linen upon his bare body, and the young men caught him."},{"num":52,"verse":"But he left his linen cloth, and fled from them naked."},{"num":53,"verse":"So they led Jesus away to the high Priest, and to him came together all the high Priests, and the Elders, and the Scribes."},{"num":54,"verse":"And Peter followed him afar off, even into the hall of the high Priest, and sat with the servants, and warmed himself at the fire."},{"num":55,"verse":"And the high Priests, and all the Council sought for witness against Jesus, to put him to death, but found none."},{"num":56,"verse":"For many bare false witness against him, but their witness agreed not together."},{"num":57,"verse":"Then there arose certain, and bare false witness against him, saying,"},{"num":58,"verse":"We heard him say, I will destroy this Temple made with hands, and within three days I will build another, made without hands."},{"num":59,"verse":"But their witness yet agreed not together."},{"num":60,"verse":"Then the high Priest stood up amongst them, and asked Jesus, saying, Answerest thou nothing? what is the matter that these bear witness against thee?"},{"num":61,"verse":"But he held his peace, and answered nothing. Again the high Priest asked him, and said unto him, Art thou that Christ the son of the Blessed?"},{"num":62,"verse":"And Jesus said, I am he, and ye shall see the Son of man sit at the right hand of the power of God, and come in the clouds of heaven. "},{"num":63,"verse":"Then the high Priest rent his clothes, and said, What have we anymore need of witnesses?"},{"num":64,"verse":"Ye have heard the blasphemy: what think ye? And they all condemned him to be worthy of death."},{"num":65,"verse":"And some began to spit at him, and to cover his face, and to beat him with fists, and to say unto him, Prophesy. And the sergeants smote him with their rods."},{"num":66,"verse":"And as Peter was beneath in the hall, there came one of the maids of the high Priest."},{"num":67,"verse":"And when she saw Peter warming himself, she looked on him, and said, Thou wast also with Jesus of Nazareth."},{"num":68,"verse":"But he denied it, saying, I know him not, neither wot I what thou sayest. Then he went out into the porch, and the cock crew."},{"num":69,"verse":"Then a maid saw him again, and began to say to them that stood by, This is one of them."},{"num":70,"verse":"But he denied it again: and anon after, they that stood by, said again to Peter, Surely thou art one of them: for thou art of Galilee, and thy speech is like."},{"num":71,"verse":"And he began to curse, and swear, saying, I know not this man of whom ye speak."},{"num":72,"verse":"Then the second time the cock crew, and Peter remembered the word that Jesus had said unto him, Before the cock crow twice, thou shalt deny me thrice, and weighing that with himself, he wept."}]