[{"header":"The Plot to Kill Jesus(A)"},{"num":14,"verse":"It was two days before the Passover and the Festival of Unleavened Bread. The chief priests and the experts in Moses’ Teachings were looking for some underhanded way to arrest Yeshua and to kill him. "},{"num":2,"verse":"However, they said, “We shouldn’t arrest him during the festival, or else there will be a riot among the people.”"},{"header":"A Woman Prepares Jesus’ Body for the Tomb(B)"},{"num":3,"verse":"Yeshua was in Bethany at the home of Simon, a man who had suffered from a skin disease. While Yeshua was sitting there, a woman went to him. She had a bottle of very expensive perfume made from pure nard. She opened the bottle and poured the perfume on his head."},{"num":4,"verse":"Some who were there were irritated and said to one another, “Why was the perfume wasted like this? "},{"num":5,"verse":"This perfume could have been sold for a high price, and the money could have been given to the poor.” So they said some very unkind things to her."},{"num":6,"verse":"Yeshua said, “Leave her alone! Why are you bothering her? She has done a beautiful thing for me. "},{"num":7,"verse":"You will always have the poor with you and can help them whenever you want. But you will not always have me with you. "},{"num":8,"verse":"She did what she could. She came to pour perfume on my body before it is placed in a tomb. "},{"num":9,"verse":"I can guarantee this truth: Wherever the Good News is spoken in the world, what she has done will also be told in memory of her.”"},{"header":"Judas Plans to Betray Jesus(C)"},{"num":10,"verse":"Judas Iscariot, one of the twelve apostles, went to the chief priests to betray Yeshua. "},{"num":11,"verse":"They were pleased to hear what Judas had to say and promised to give him money. So he kept looking for a chance to betray Yeshua."},{"header":"Preparations for the Passover(D)"},{"num":12,"verse":"Killing the Passover lamb was customary on the first day of the Festival of Unleavened Bread. The disciples asked Yeshua, “Where do you want us to prepare the Passover meal for you?”"},{"num":13,"verse":"He sent two of his disciples and told them, “Go into the city. You will meet a man carrying a jug of water. Follow him. "},{"num":14,"verse":"When he goes into a house, tell the owner that the teacher asks, ‘Where is my room where I can eat the Passover meal with my disciples?’ "},{"num":15,"verse":"He will take you upstairs and show you a large room. The room will be completely furnished. Get everything ready for us there.”"},{"num":16,"verse":"The disciples left. They went into the city and found everything as Yeshua had told them. So they prepared the Passover."},{"num":17,"verse":"When evening came, Yeshua arrived with the twelve apostles."},{"header":"Jesus Knows Who Will Betray Him(E)"},{"num":18,"verse":"While they were at the table eating, Yeshua said, “I can guarantee this truth: One of you is going to betray me, one who is eating with me!”"},{"num":19,"verse":"Feeling hurt, they asked him one by one, “You don’t mean me, do you?”"},{"num":20,"verse":"He said to them, “It’s one of you twelve, someone dipping his hand into the bowl with me. "},{"num":21,"verse":"The Son of Man is going to die as the Scriptures say he will. But how horrible it will be for that person who betrays the Son of Man! It would have been better for that person if he had never been born.”"},{"header":"The Lord’s Supper(F)"},{"num":22,"verse":"While they were eating, Yeshua took bread and blessed it. He broke the bread, gave it to them, and said, “Take this. This is my body.”"},{"num":23,"verse":"Then he took a cup, spoke a prayer of thanksgiving, and gave the cup to them. They all drank from it. "},{"num":24,"verse":"He said to them, “This is my blood, the blood of the promise. It is poured out for many people."},{"num":25,"verse":"“I can guarantee this truth: I won’t drink this wine again until that day when I drink new wine in the kingdom of God.”"},{"num":26,"verse":"After they sang a hymn, they went to the Mount of Olives."},{"header":"Jesus Predicts Peter’s Denial(G)"},{"num":27,"verse":"Then Yeshua said to them, “All of you will abandon me. Scripture says,"},{"num":28,"verse":"“But after I am brought back to life, I will go to Galilee ahead of you.”"},{"num":29,"verse":"Peter said to him, “Even if everyone else abandons you, I won’t.”"},{"num":30,"verse":"Yeshua said to Peter, “I can guarantee this truth: Tonight, before a rooster crows twice, you will say three times that you don’t know me.”"},{"num":31,"verse":"But Peter said very strongly, “Even if I have to die with you, I will never say that I don’t know you.” All the other disciples said the same thing."},{"header":"Jesus Prays in the Garden of Gethsemane(H)"},{"num":32,"verse":"Then they came to a place called Gethsemane. He said to his disciples, “Stay here while I pray.”"},{"num":33,"verse":"He took Peter, James, and John with him and began to feel distressed and anguished. "},{"num":34,"verse":"He said to them, “My anguish is so great that I feel as if I’m dying. Wait here, and stay awake.”"},{"num":35,"verse":"After walking a little farther, he fell to the ground and prayed that if it were possible he might not have to suffer what was ahead of him. "},{"num":36,"verse":"He said, “Abba! Father! You can do anything. Take this cup of suffering away from me. But let your will be done rather than mine.”"},{"num":37,"verse":"He went back and found them asleep. He said to Peter, “Simon, are you sleeping? Couldn’t you stay awake for one hour? "},{"num":38,"verse":"Stay awake, and pray that you won’t be tempted. You want to do what’s right, but you’re weak.”"},{"num":39,"verse":"He went away again and prayed the same prayer as before. "},{"num":40,"verse":"He found them asleep because they couldn’t keep their eyes open. They didn’t even know what they should say to him."},{"num":41,"verse":"He came back a third time and said to them, “You might as well sleep now. It’s all over. The time has come for the Son of Man to be handed over to sinners. "},{"num":42,"verse":"Get up! Let’s go! The one who is betraying me is near.”"},{"header":"Jesus Is Arrested(I)"},{"num":43,"verse":"Just then, while Yeshua was still speaking, Judas, one of the twelve apostles, arrived. A crowd carrying swords and clubs was with him. They were from the chief priests, the experts in Moses’ Teachings, and the leaders of the people. "},{"num":44,"verse":"Now, the traitor had given them a signal. He said, “The one I kiss is the man you want. Arrest him, and guard him closely as you take him away.”"},{"num":45,"verse":"Then Judas quickly stepped up to Yeshua and said, “Rabbi!” and kissed him."},{"num":46,"verse":"Some men took hold of Yeshua and arrested him. "},{"num":47,"verse":"One of those standing there pulled out his sword and cut off the ear of the chief priest’s servant."},{"num":48,"verse":"Yeshua asked them, “Have you come out with swords and clubs to arrest me as if I were a criminal? "},{"num":49,"verse":"I used to teach in the temple courtyard every day. But you didn’t arrest me then. But what the Scriptures say must come true.”"},{"num":50,"verse":"Then all the disciples abandoned him and ran away."},{"num":51,"verse":"A certain young man was following Yeshua. He had nothing on but a linen sheet. They tried to arrest him, "},{"num":52,"verse":"but he left the linen sheet behind and ran away naked."},{"header":"The Trial in Front of the Jewish Council(J)"},{"num":53,"verse":"The men took Yeshua to the chief priest. All the chief priests, the leaders, and the experts in Moses’ Teachings had gathered together. "},{"num":54,"verse":"Peter followed him at a distance and went into the chief priest’s courtyard. He sat with the guards and warmed himself facing the glow of a fire."},{"num":55,"verse":"The chief priests and the whole Jewish council were searching for some testimony against Yeshua in order to execute him. But they couldn’t find any. "},{"num":56,"verse":"Many gave false testimony against him, but their statements did not agree."},{"num":57,"verse":"Then some men stood up and gave false testimony against him. They said, "},{"num":58,"verse":"“We heard him say, ‘I’ll tear down this temple made by humans, and in three days I’ll build another temple, one not made by human hands.’” "},{"num":59,"verse":"But their testimony did not agree even on this point."},{"num":60,"verse":"So the chief priest stood up in the center and asked Yeshua, “Don’t you have any answer to what these men testify against you?”"},{"num":61,"verse":"But he was silent."},{"num":62,"verse":"Yeshua answered, “Yes, I am, and you will see the Son of Man in the highest position in heaven. He will be coming with the clouds of heaven.”"},{"num":63,"verse":"The chief priest tore his clothes in horror and said, “Why do we need any more witnesses? "},{"num":64,"verse":"You’ve heard him dishonor God! What’s your verdict?”"},{"num":65,"verse":"Some of them began to spit on him. They covered his face and hit him with their fists. They said to him, “Prophesy!” Even the guards took him and slapped him."},{"header":"Peter Denies Jesus(K)"},{"num":66,"verse":"Peter was in the courtyard. One of the chief priest’s female servants "},{"num":67,"verse":"saw Peter warming himself. She looked at him and said, “You, too, were with Yeshua from Nazareth!”"},{"num":68,"verse":"But Peter denied it by saying, “I don’t know him, and I don’t understand what you’re talking about.”"},{"num":69,"verse":"The servant saw him. Once again she said to those who were standing around, “This man is one of them!” "},{"num":70,"verse":"Peter again denied it."},{"num":71,"verse":"Then Peter began to curse and swear with an oath, “I don’t know this man you’re talking about!” "},{"num":72,"verse":"Just then a rooster crowed a second time. Peter remembered that Yeshua said to him, “Before a rooster crows twice, you will say three times that you don’t know me.” Then Peter began to cry very hard."}]