[{"header":"The Inner Sanctuary"},{"num":41,"verse":"Then he brought me to the Temple, and measured the pillars—six cubits wide on one side, six cubits wide on the other side, which was the width of the tent. "},{"num":2,"verse":"The width of the entrance was ten cubits. The sides of the entrance were five cubits on the one side and five cubits on the other side. He measured its length, 40 cubits and its width, 20 cubits. "},{"num":3,"verse":"He went to the inner room and measured each pillar of the entrance, two cubits; the doorway, six cubits; and the width of the doorway, seven cubits. "},{"num":4,"verse":"When he measured the inner room’s length, it was 20 cubits, and the width was 20 cubits, in front of the Temple. He said to me, “This is the Holy of Holies.”"},{"num":5,"verse":"When he measured the wall of the House, it was six cubits, and the width of every side chamber was four cubits, surrounding the House on every side. "},{"num":6,"verse":"There were 33 side chambers. There were supports in the wall, which belonged to the House for the side chambers all around, so that they were not supported by the wall of the House. "},{"num":7,"verse":"The side chambers were wider as they wound about higher and higher. Because the winding about of the House went higher and higher round about the house, therefore the width of the House expanded. One went up from the lowest row to the highest by way of the middle. "},{"num":8,"verse":"I saw also that the House had a raised platform all around; the foundations of the side chambers were a full rod of six cubits up to the joint. "},{"num":9,"verse":"The thickness of the outer wall of the side chambers was five cubits. The space between the side chambers of the House "},{"num":10,"verse":"and the outer chambers was 20 cubits wide all around the House on every side. "},{"num":11,"verse":"The doors of the side chambers were toward the space, one door toward the north and another door toward the south. The width of the space was five cubits all around."},{"num":12,"verse":"The building that was before the separate area at the side toward the west was 70 cubits wide. The wall of the building was five cubits thick all around and its length was 90 cubits. "},{"num":13,"verse":"When he measured the House, it was 100 cubits long; the separate area and the building with its walls, was 100 cubits long; "},{"num":14,"verse":"and the width of the face of the House and the separate area toward the east was also 100 cubits."},{"num":15,"verse":"When he measured the length of the building facing the separate area behind it, with its galleries on each side, it was 100 cubits. Now the inner Sanctuary and the porches of the court—"},{"num":16,"verse":"the thresholds, the shuttered windows, and the galleries all around in three stories opposite the thresholds—were paneled with wood all around, from the ground up to the windows (even the windows were covered), "},{"num":17,"verse":"over the space above the door, as far as the inner House, and on all the wall outside all around inside and outside, by measurement. "},{"num":18,"verse":"It was made with cheruvim and palm trees. A palm tree was between cheruv and cheruv. Every cheruv had two faces: "},{"num":19,"verse":"the face of a man toward the palm tree on one side and the face of a young lion toward the palm tree on the other side. Thus was it made on all the House all around. "},{"num":20,"verse":"The cheruvim and palm trees were made from the ground up to above the door and on the wall of the Temple."},{"num":21,"verse":"The Temple’s doorposts were square. Now the front of the Sanctuary had something resembling "},{"num":22,"verse":"an altar—three cubits high and two cubits long, made of wood. Its corners, its base and its sides were also of wood. He said to me, “This is the table of the Presence of Adonai.”"},{"num":23,"verse":"The Temple and the inner Sanctuary each had double doors. "},{"num":24,"verse":"The doors each had two turning leaves—two leaves for one door and two leaves for the other. "},{"num":25,"verse":"Cheruvim and palm trees were made on them, on the doors of the Temple, just like those made on the walls. There were thick beams of wood on the face of the porch outside. "},{"num":26,"verse":"There were shuttered windows and palm trees on one side and on the other, on the sides of the porch, the side chambers of the House and the thick beams."}]