[{"num":52,"verse":"A son of twenty and one years [is] Zedekiah in his reigning, and eleven years he hath reigned in Jerusalem, and the name of his mother [is] Hamutal daughter of Jeremiah of Libnah."},{"num":2,"verse":"and he doth the evil thing in the eyes of Jehovah, according to all that Jehoiakim hath done,"},{"num":3,"verse":"for, because of the anger of Jehovah, it hath been in Jerusalem and Judah till He hath cast them from before His face, and Zedekiah doth rebel against the king of Babylon."},{"num":4,"verse":"And it cometh to pass, in the ninth year of his reign, in the tenth month, in the tenth of the month, come hath Nebuchadrezzar king of Babylon -- he and all his force -- against Jerusalem, and they encamp against it, and build against it a fortification round about;"},{"num":5,"verse":"and the city cometh into siege till the eleventh year of king Zedekiah."},{"num":6,"verse":"In the fourth month, in the ninth of the month, when the famine is severe in the city, and there hath been no bread for the people of the land,"},{"num":7,"verse":"then is the city broken up, and all the men of war flee, and go forth from the city by night, the way of the gate between the two walls, that [is] by the king's garden -- and the Chaldeans [are] by the city round about -- and they go the way of the plain."},{"num":8,"verse":"And the forces of the Chaldeans pursue after the king, and overtake Zedekiah in the plains of Jericho, and all his forces have been scattered from him,"},{"num":9,"verse":"and they capture the king, and bring him up unto the king of Babylon to Riblah, in the land of Hamath, and he speaketh with him -- judgments."},{"num":10,"verse":"And the king of Babylon slaughtereth the sons of Zedekiah before his eyes, and also all the princes of Judah hath he slaughtered in Riblah;"},{"num":11,"verse":"and the eyes of Zedekiah he hath blinded, and he bindeth him in brazen fetters, and the king of Babylon bringeth him to Babylon, and putteth him in the house of inspection unto the day of his death."},{"num":12,"verse":"And in the fifth month, in the tenth of the month -- it [is] the nineteenth year of king Nebuchadrezzar king of Babylon -- come hath Nebuzar-Adan, chief of the executioners; he hath stood before the king of Babylon in Jerusalem,"},{"num":13,"verse":"and he burneth the house of Jehovah, and the house of the king, and all the houses of Jerusalem, even every great house he hath burned with fire,"},{"num":14,"verse":"and all the walls of Jerusalem round about broken down have all the forces of the Chaldeans that [are] with the chief of the executioners."},{"num":15,"verse":"And of the poor of the people, and the remnant of the people who are left in the city, and those who are falling away, who have fallen unto the king of Babylon, and the remnant of the multitude, hath Nebuzar-Adan chief of the executioners, removed;"},{"num":16,"verse":"and of the poor of the land hath Nebuzar-Adan, chief of the executioners, left for vine-dressers and for husbandmen."},{"num":17,"verse":"And the pillars of brass that [are] to the house of Jehovah, and the bases, and the brasen sea that [is] in the house of Jehovah, have the Chaldeans broken, and they bear away all the brass of them to Babylon;"},{"num":18,"verse":"and the pots, and the shovels, and the snuffers, and the bowls, and the spoons, and all the vessels of brass with which they minister, they have taken away;"},{"num":19,"verse":"and the basins, and the fire-pans, and the bowls, and the pots, and the candlesticks, and the spoons, and the cups, the gold of that which [is] gold, and the silver of that which [is] silver, hath the chief of the executioners taken."},{"num":20,"verse":"The two pillars, the one sea, and the twelve brazen oxen that [are] beneath the bases, that king Solomon made for the house of Jehovah, there was no weighing of the brass of all these vessels."},{"num":21,"verse":"As to the pillars, eighteen cubits [is] the height of the one pillar, and a cord of twelve cubits doth compass it, and its thickness [is] four fingers hollow."},{"num":22,"verse":"And the chapiter upon it [is] of brass, and the height of the one chapiter [is] five cubits, and net-work and pomegranates [are] on the chapiter round about, the whole [is] of brass; and like these have the second pillar, and pomegranates."},{"num":23,"verse":"And the pomegranates are ninety and six on a side, all the pomegranates [are] a hundred on the net-work round about."},{"num":24,"verse":"And the chief of the executioners taketh Seraiah the head priest, and Zephaniah the second priest, and the three keepers of the threshold,"},{"num":25,"verse":"and out of the city he hath taken a certain eunuch, who hath been inspector over the men of war, and seven men of those seeing the king's face, who have been found in the city, and the head scribe of the host, who mustereth the people of the land, and sixty men of the people of the land, who are found in the midst of the city;"},{"num":26,"verse":"and Nebuzar-Adan, chief of the executioners, taketh them, and bringeth them unto the king of Babylon to Riblah,"},{"num":27,"verse":"and the king of Babylon smiteth them, and putteth them to death in Riblah, in the land of Hamath, and he removeth Judah from off its own ground."},{"num":28,"verse":"This [is] the people whom Nebuchadrezzar hath removed: in the seventh year, of Jews, three thousand and twenty and three;"},{"num":29,"verse":"in the eighteenth year of Nebuchadrezzar -- from Jerusalem, souls, eight hundred thirty and two;"},{"num":30,"verse":"in the three and twentieth year of Nebuchadrezzar, hath Nebuzar-Adan chief of the guard removed of Jewish souls, seven hundred forty and five; all the souls [are] four thousand and six hundred."},{"num":31,"verse":"And it cometh to pass, in the thirty and seventh year of the removal of Jehoiachin king of Judah, in the twelfth month, in the twenty and fifth of the month, hath Evil-Merodach king of Babylon lifted up, in the year of his reign, the head of Jehoiachin king of Judah, and bringeth him out from the house of restraint,"},{"num":32,"verse":"and speaketh with him good things, and setteth his throne above the throne of the kings who [are] with him in Babylon,"},{"num":33,"verse":"and he hath changed his prison garments, and he hath eaten bread before him continually, all the days of his life."},{"num":34,"verse":"And his allowance -- a continual allowance -- hath been given to him by the king of Babylon, the matter of a day in its day, till the day of his death -- all days of his life."}]