[{"num":16,"verse":"Then I heard a mighty voice from the temple sanctuary saying to the seven angels, Go and empty out on the earth the seven bowls of God’s wrath and indignation."},{"num":2,"verse":"So the first [angel] went and emptied his bowl on the earth, and foul and painful ulcers (sores) came on the people who were marked with the stamp of the beast and who did homage to his image."},{"num":3,"verse":"The second [angel] emptied his bowl into the sea, and it turned into blood like that of a corpse [thick, corrupt, ill-smelling, and disgusting], and every living thing that was in the sea perished."},{"num":4,"verse":"Then the third [angel] emptied out his bowl into the rivers and the springs of water, and they turned into (became) blood."},{"num":5,"verse":"And I also heard the angel of the waters say, Righteous (just) are You in these Your decisions and judgments, You Who are and were, O Holy One!"},{"num":6,"verse":"Because they have poured out the blood of Your people (the saints) and the prophets, and You have given them blood to drink. Such is their due [they deserve it]!"},{"num":7,"verse":"And [from] the altar I heard [the] cry, Yes, Lord God the Omnipotent, Your judgments (sentences, decisions) are true and just and righteous!"},{"num":8,"verse":"Then the fourth [angel] emptied out his bowl upon the sun, and it was permitted to burn (scorch) humanity with [fierce, glowing] heat (fire)."},{"num":9,"verse":"People were severely burned (scorched) by the fiery heat, and they reviled and blasphemed the name of God, Who has control of these plagues, and they did not repent of their sins [felt no regret, contrition, and compunction for their waywardness, refusing to amend their ways] to give Him glory."},{"num":10,"verse":"Then the fifth [angel] emptied his bowl on the throne of the beast, and his kingdom was [plunged] in darkness; and people gnawed their tongues for the torment [of their excruciating distress and severe pain]"},{"num":11,"verse":"And blasphemed the God of heaven because of their anguish and their ulcers (sores), and they did not deplore their wicked deeds or repent [for what they had done]."},{"num":12,"verse":"Then the sixth [angel] emptied his bowl on the mighty river Euphrates, and its water was dried up to make ready a road for [the coming of] the kings of the east (from the rising sun)."},{"num":13,"verse":"And I saw three loathsome spirits like frogs, [leaping] from the mouth of the dragon and from the mouth of the beast and from the mouth of the false prophet."},{"num":14,"verse":"For really they are the spirits of demons that perform signs (wonders, miracles). And they go forth to the rulers and leaders all over the world, to gather them together for war on the great day of God the Almighty."},{"num":15,"verse":"Behold, I am going to come like a thief! Blessed (happy, to be envied) is he who stays awake (alert) and who guards his clothes, so that he may not be naked and [have the shame of being] seen exposed!"},{"num":16,"verse":"And they gathered them together at the place which in Hebrew is called Armageddon."},{"num":17,"verse":"Then the seventh [angel] emptied out his bowl into the air, and a mighty voice came out of the sanctuary of heaven from the throne [of God], saying, It is done! [It is all over, it is all accomplished, it has come!]"},{"num":18,"verse":"And there followed lightning flashes, loud rumblings, peals of thunder, and a tremendous earthquake; nothing like it has ever occurred since men dwelt on the earth, so severe and far-reaching was that earthquake."},{"num":19,"verse":"The mighty city was broken into three parts, and the cities of the nations fell. And God kept in mind mighty Babylon, to make her drain the cup of His furious wrath and indignation."},{"num":20,"verse":"And every island fled and no mountains could be found."},{"num":21,"verse":"And great (excessively oppressive) hailstones, as heavy as a talent [between fifty and sixty pounds], of immense size, fell from the sky on the people; and men blasphemed God for the plague of the hail, so very great was [the torture] of that plague."}]