[{"header":"The Bowls Filled With God’s Anger"},{"num":16,"verse":"Then I heard a loud voice from the temple. It said to the seven angels, “Go and pour out the seven bowls of God’s anger on the earth.”"},{"num":2,"verse":"The first angel left. He poured out his bowl on the land. Then all those who had the mark of the beast and who worshiped its idol got sores that were ugly and painful."},{"num":3,"verse":"The second angel poured out his bowl on the sea. Then the sea became blood like a dead man’s blood. And everything living in the sea died."},{"num":4,"verse":"The third angel poured out his bowl on the rivers and the springs of water. The rivers and the springs of water became blood."},{"num":5,"verse":"Then I heard the angel of the waters say to God,"},{"num":7,"verse":"And I heard the altar say,"},{"num":8,"verse":"The fourth angel poured out his bowl on the sun. The sun was given power to burn the people with fire."},{"num":9,"verse":"The people were burned by the great heat. They cursed the name of God, who had control over these plagues. But they refused to change their hearts and lives and give glory to God."},{"num":10,"verse":"The fifth angel poured out his bowl on the throne of the beast. And darkness covered the beast’s kingdom. People bit their tongues because of the pain."},{"num":11,"verse":"They cursed the God of heaven because of their pain and the sores they had. But they refused to change their hearts and turn away from the evil things they did."},{"num":12,"verse":"The sixth angel poured out his bowl on the great river Euphrates. The water in the river was dried up. This prepared the way for the rulers from the east to come."},{"num":13,"verse":"Then I saw three evil spirits that looked like frogs. They came out of the mouth of the dragon, out of the mouth of the beast, and out of the mouth of the false prophet."},{"num":14,"verse":"These evil spirits are the spirits of demons. They have power to do miracles. They go out to the rulers of the whole world to gather them for battle on the great day of God All-Powerful."},{"num":15,"verse":"“Listen! I will come at a time you don’t expect, like a thief. Great blessings belong to those who stay awake and keep their clothes with them. They will not have to go without clothes and be ashamed for people to see them.”"},{"num":16,"verse":"Then the evil spirits gathered the rulers together to the place that in Hebrew is called Armageddon."},{"num":17,"verse":"The seventh angel poured out his bowl into the air. Then a loud voice came out of the temple from the throne. It said, “It is finished!”"},{"num":18,"verse":"Then there were flashes of lightning, noises, thunder, and a big earthquake. This was the worst earthquake that has ever happened since people have been on earth."},{"num":19,"verse":"The great city split into three parts. The cities of the nations were destroyed. And God did not forget to punish Babylon the Great. He gave that city the cup filled with the wine of his terrible anger."},{"num":20,"verse":"Every island disappeared and there were no more mountains."},{"num":21,"verse":"Giant hailstones fell on the people from the sky. These hailstones weighed almost 100 pounds each. People cursed God because of this plague of the hail. It was terrible."}]