[{"num":16,"verse":"And I heard a great voice out of the Temple, saying to the seven angels, “Go and pour out the seven vials of the wrath of God upon the earth!”"},{"num":2,"verse":"And the first went and poured out his vial upon the earth. And there fell an evil and grievous sore upon the men who had the mark of the beast, and upon those who worshipped his image."},{"num":3,"verse":"And the second angel poured out his vial upon the sea. And it became like the blood of a dead man. And every living thing in the sea died."},{"num":4,"verse":"And the third angel poured out his vial upon the rivers and fountains of waters. And they became blood."},{"num":5,"verse":"And I heard the angel of the waters say, “Lord, You are just - Who are, and Who was - and Holy, because You have judged these things."},{"num":6,"verse":"For they shed the blood of the saints and Prophets. And therefore have you given them blood to drink. For they are worthy.”"},{"num":7,"verse":"And I heard another say from the Sanctuary, “Even so, Lord God Almighty, true and righteous are Your judgments.”"},{"num":8,"verse":"And the fourth angel poured out his vial on the sun. And it was given to him to torment man with the heat of fire."},{"num":9,"verse":"And man boiled in great heat and blasphemed the Name of God, Who has power over these plagues. And they did not repent, to give Him glory."},{"num":10,"verse":"And the fifth angel poured out his vial upon the throne of the beast, and the kingdom grew dark. And they gnawed their tongues for sorrow."},{"num":11,"verse":"And blasphemed the God of Heaven for their pains, and for their sores, and did not repent of their works."},{"num":12,"verse":"And the sixth angel poured out his vial upon the great river Euphrates. And the water thereof dried up, so the way of the Kings of the East would be prepared."},{"num":13,"verse":"And I saw three unclean spirits, like frogs, come out of the mouth of the dragon, and out of the mouth of the beast, and out of the mouth of the false prophet."},{"num":14,"verse":"For they are the spirits of demons, working miracles to go to the kings of the earth; and of the whole world, to gather them to the battle on that great Day of God Almighty."},{"num":15,"verse":"“Behold I come as a thief. Blessed is he who watches and keeps his garments, lest he walk naked and man sees his filthiness.”"},{"num":16,"verse":"And they gathered together into a place called ‘Armageddon’ in Hebrew."},{"num":17,"verse":"And the seventh angel poured out his vial into the air. And there came a loud voice out of the Temple of Heaven from the throne, saying, “It is done!”"},{"num":18,"verse":"And there were voices and thunderings and lightnings. And there was a great earthquake unlike any since man has been upon the earth, such a mighty an earthquake it was."},{"num":19,"verse":"And the great city was divided into three parts. And the cities of the nations fell. And God as reminded of the great Babylon; to give her the cup of the wine of the fierceness of His wrath."},{"num":20,"verse":"And every isle fled away. And the mountains were not found."},{"num":21,"verse":"And there fell great hail - the weight of a talent - out of Heaven upon man. And man blasphemed God because of the plague of the hail. For the plague thereof was exceedingly great."}]