[{"header":"The Ten Commandments"},{"num":20,"verse":"Then God spoke all these words:"},{"num":2,"verse":"“I am the Lord your God, who has brought you out of the land of Egypt, out of the house of slavery."},{"num":3,"verse":"“You shall have no other gods before Me."},{"num":4,"verse":"“You shall not make for yourself any idol, or any likeness (form, manifestation) of what is in heaven above or on the earth beneath or in the water under the earth [as an object to worship]. "},{"num":5,"verse":"You shall not worship them nor serve them; for I, the Lord your God, am a jealous (impassioned) God [demanding what is rightfully and uniquely mine], visiting (avenging) the iniquity (sin, guilt) of the fathers on the children [that is, calling the children to account for the sins of their fathers], to the third and fourth generations of those who hate Me, "},{"num":6,"verse":"but showing graciousness and steadfast lovingkindness to thousands [of generations] of those who love Me and keep My commandments."},{"num":7,"verse":"“You shall not take the name of the Lord your God in vain [that is, irreverently, in false affirmations or in ways that impugn the character of God]; for the Lord will not hold guiltless nor leave unpunished the one who takes His name in vain [disregarding its reverence and its power]."},{"num":8,"verse":"“Remember the Sabbath (seventh) day to keep it holy (set apart, dedicated to God). "},{"num":9,"verse":"Six days you shall labor and do all your work, "},{"num":10,"verse":"but the seventh day is a Sabbath [a day of rest dedicated] to the Lord your God; on that day you shall not do any work, you or your son, or your daughter, or your male servant, or your female servant, or your livestock or the temporary resident (foreigner) who stays within your [city] gates. "},{"num":11,"verse":"For in six days the Lord made the heavens and the earth, the sea and everything that is in them, and He rested (ceased) on the seventh day. That is why the Lord blessed the Sabbath day and made it holy [that is, set it apart for His purposes]."},{"num":12,"verse":"“Honor (respect, obey, care for) your father and your mother, so that your days may be prolonged in the land the Lord your God gives you."},{"num":13,"verse":"“You shall not commit murder (unjustified, deliberate homicide)."},{"num":14,"verse":"“You shall not commit adultery."},{"num":15,"verse":"“You shall not steal [secretly, openly, fraudulently, or through carelessness]."},{"num":16,"verse":"“You shall not testify falsely [that is, lie, withhold, or manipulate the truth] against your neighbor (any person)."},{"num":17,"verse":"“You shall not covet [that is, selfishly desire and attempt to acquire] your neighbor’s house; you shall not covet your neighbor’s wife, or his male servant, or his female servant, or his ox, or his donkey, or anything that belongs to your neighbor.”"},{"num":18,"verse":"Now all the people witnessed the thunder and the flashes of lightning and the sound of the trumpet and the smoking mountain; and as they looked, the people were afraid, and they trembled [and moved backward] and stood at a [safe] distance. "},{"num":19,"verse":"Then they said to Moses, “You speak to us and we will listen, but do not let God speak to us or we will die.” "},{"num":20,"verse":"Moses said to the people, “Do not be afraid; for God has come in order to test you, and in order that the fear of Him [that is, a profound reverence for Him] will remain with you, so that you do not sin.” "},{"num":21,"verse":"So the people stood at a [safe] distance, but Moses approached the thick cloud where God was."},{"num":22,"verse":"Then the Lord said to Moses, “Thus you shall say to the Israelites, ‘You have seen for yourselves that I have spoken to you from heaven. "},{"num":23,"verse":"You shall not make other gods [to worship] besides Me; gods of silver or gods of gold, you shall not make [these lifeless idols] for yourselves. "},{"num":24,"verse":"You shall make an altar of earth for Me, and sacrifice on it your burnt offerings and your peace offerings, your sheep and your oxen. In every place where I cause My Name to be recorded and remembered [through revelation of My divine nature] I will come to you and bless you. "},{"num":25,"verse":"If you make an altar of stone for Me, you shall not build it of cut stones, for if you use a chisel on it, you will profane it. "},{"num":26,"verse":"Nor shall you go up to My altar on steps, so that your nakedness will not be exposed on it.’"}]