[{"num":20,"verse":"Then God issued this edict:"},{"num":2,"verse":"“I am Jehovah your God who liberated you from your slavery in Egypt."},{"num":3,"verse":"“You may worship no other god than me."},{"num":4,"verse":"“You shall not make yourselves any idols: no images of animals, birds, or fish. "},{"num":5,"verse":"You must never bow or worship it in any way; for I, the Lord your God, am very possessive. I will not share your affection with any other god!"},{"num":6,"verse":"but I lavish my love upon thousands of those who love me and obey my commandments."},{"num":7,"verse":"“You shall not use the name of Jehovah your God irreverently, nor use it to swear to a falsehood. You will not escape punishment if you do."},{"num":8,"verse":"“Remember to observe the Sabbath as a holy day. "},{"num":9,"verse":"Six days a week are for your daily duties and your regular work, "},{"num":10,"verse":"but the seventh day is a day of Sabbath rest before the Lord your God. On that day you are to do no work of any kind, nor shall your son, daughter, or slaves—whether men or women—or your cattle or your house guests. "},{"num":11,"verse":"For in six days the Lord made the heaven, earth, and sea, and everything in them, and rested the seventh day; so he blessed the Sabbath day and set it aside for rest."},{"num":12,"verse":"“Honor your father and mother, that you may have a long, good life in the land the Lord your God will give you."},{"num":13,"verse":"“You must not murder."},{"num":14,"verse":"“You must not commit adultery."},{"num":15,"verse":"“You must not steal."},{"num":16,"verse":"“You must not lie."},{"num":17,"verse":"“You must not be envious of your neighbor’s house, or want to sleep with his wife, or want to own his slaves, oxen, donkeys, or anything else he has.”"},{"num":18,"verse":"All the people saw the lightning and the smoke billowing from the mountain, and heard the thunder and the long, frightening trumpet blast; and they stood at a distance, shaking with fear."},{"num":19,"verse":"They said to Moses, “You tell us what God says and we will obey, but don’t let God speak directly to us, or it will kill us.”"},{"num":20,"verse":"“Don’t be afraid,” Moses told them, “for God has come in this way to show you his awesome power, so that from now on you will be afraid to sin against him!”"},{"num":21,"verse":"As the people stood in the distance, Moses entered into the deep darkness where God was."},{"num":22,"verse":"And the Lord told Moses to be his spokesman to the people of Israel. “You are witnesses to the fact that I have made known my will to you from heaven. "},{"num":23,"verse":"Remember, you must not make or worship idols made of silver or gold or of anything else!"},{"num":24,"verse":"“The altars you make for me must be simple altars of earth. Offer upon them your sacrifices to me—your burnt offerings and peace offerings of sheep and oxen. Build altars only where I tell you to, and I will come and bless you there. "},{"num":25,"verse":"You may also build altars from stone, but if you do, then use only uncut stones and boulders. Don’t chip or shape the stones with a tool, for that would make them unfit for my altar. "},{"num":26,"verse":"And don’t make steps for the altar, or someone might look up beneath the skirts of your clothing and see your nakedness."}]