[{"num":4,"verse":"I give you a command in the sight of God and Christ Jesus. Christ will judge the living and the dead. Because he and his kingdom are coming, here is the command I give you. "},{"num":2,"verse":"Preach the word. Be ready to serve God in good times and bad. Correct people’s mistakes. Warn them. Encourage them with words of hope. Be very patient as you do these things. Teach them carefully. "},{"num":3,"verse":"The time will come when people won’t put up with true teaching. Instead, they will try to satisfy their own desires. They will gather a large number of teachers around them. The teachers will say what the people want to hear. "},{"num":4,"verse":"The people will turn their ears away from the truth. They will turn to stories that aren’t true. "},{"num":5,"verse":"But I want you to keep your head no matter what happens. Don’t give up when times are hard. Work to spread the good news. Do everything God has given you to do."},{"num":6,"verse":"I am already being poured out like a drink offering. The time when I will leave is near. "},{"num":7,"verse":"I have fought the good fight. I have finished the race. I have kept the faith. "},{"num":8,"verse":"Now there is a crown waiting for me. It is given to those who are right with God. The Lord, who judges fairly, will give it to me on the day he returns. He will not give it only to me. He will also give it to all those who are longing for him to return."},{"header":"Personal Words"},{"num":9,"verse":"Do your best to come to me quickly. "},{"num":10,"verse":"Demas has deserted me. He has gone to Thessalonica. He left me because he loved this world. Crescens has gone to Galatia. Titus has gone to Dalmatia. "},{"num":11,"verse":"Only Luke is with me. Get Mark and bring him with you. He helps me in my work for the Lord. "},{"num":12,"verse":"I sent Tychicus to Ephesus. "},{"num":13,"verse":"When you come, bring my coat. I left it with Carpus at Troas. Also bring my books. Most of all, bring the ones made out of animal skins."},{"num":14,"verse":"Remember Alexander, the one who works with metal. He did me a great deal of harm. The Lord will pay him back for what he has done. "},{"num":15,"verse":"You too should watch out for him. He strongly opposed our message."},{"num":16,"verse":"The first time I was put on trial, no one came to help me. Everyone deserted me. I hope they will be forgiven for it. "},{"num":17,"verse":"The Lord stood at my side. He gave me the strength to preach the whole message. Then all the Gentiles heard it. I was saved from the lion’s mouth. "},{"num":18,"verse":"The Lord will save me from every evil attack. He will bring me safely to his heavenly kingdom. Give him glory for ever and ever. Amen."},{"header":"Final Greetings"},{"num":19,"verse":"Greet Priscilla and Aquila. Greet those who live in the house of Onesiphorus."},{"num":20,"verse":"Erastus stayed in Corinth. I left Trophimus sick in Miletus. "},{"num":21,"verse":"Do your best to get here before winter."},{"num":22,"verse":"May the Lord be with your spirit. May God’s grace be with you all."}]