[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "43:1-14 Jacob urges his sons to go and buy a little food; now, in time of dearth, a little must suffice. Judah urges that Benjamin should go with them. It is not against the honour and duty children owe their parents, humbly to advise them, and when needful, to reason with them. Jacob saw the necessity of the case, and yielded. His prudence and justice appeared in three things. 1. He sent back the money they had found in the sack. Honesty obliges us to restore not only that which comes to us by our own fault, but that which comes to us by the mistakes of others. Though we get it by oversight, if we keep it when the oversight is discovered, it is kept by deceit. 2. He sent as much again as they took the time before; the price of corn might be risen, or they might have to pay a ransom for Simeon. 3. He sent a present of such things as the land afforded, and as were scarce in Egypt, balm, and honey, &c. Providence dispenses not its gifts to all alike. But honey and spice will never make up the want of bread-corn. The famine was sore in Canaan, yet they had balm and myrrh, &c. We may live well enough upon plain food, without dainties; but we cannot live upon dainties without plain food. Let us thank God that what is most needful and useful, generally is most cheap and common. Though men value very highly their gold and silver, and the luxuries which are counted the best fruits of every land, yet in a time of famine they willingly barter them for bread. And how little will earthly good things stand us in stead in the day of wrath! How ready should we be to renounce them all, as loss, for the excellency of the knowledge of Jesus Christ! Our way to prevail with man is by first prevailing with the Lord in fervent prayer. But, Thy will be done, should close every petition for the mercies of this life, or against the afflictions of this life.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The famine was severe. The pressure began to be felt more and more. The twelve households had at length consumed all the corn they had purchased, and the famine still pressed heavily upon them. Jacob directs them to return. \"And Judah said.\" Reuben had offended, and could not come forward. Simon and Levi had also grieved their father by the treacherous slaughter of the Shekemites. Judah therefore, speaks. \"Is your father yet alive?\" \"Have ye a brother?\" These questions do not come out in the previous narrative, on account of its brevity. But how pointed they are, and how true to Joseph's yearnings! They explain how it was that these particulars came out in the replies of the brothers to Joseph. For the charge of being spies did not call for them in exculpation. Judah now uses all the arguments the case would admit of, to persuade his father to allow Benjamin to go with them. He closes with the emphatic sentence, If I bring him not unto thee, and set him before thee, then let me have sinned against thee all my days; that is, let me bear the blame, and of course the penalty of having sinned against thee in so tender a point. Both Judah and his father knew that this was a matter that touched the interest of the former very deeply. Reuben was bearing the blame of a grievous sin, and had no hope of the birthright. Simon and Levi were also bearing blame, and, besides, had not the natural right, which belonged only to Reuben. Judah came next, and a failure in securing the safe return of Benjamin might set him also aside. He undertakes to run this risk.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2. their father said, … Go again, buy us a little food—It was no easy matter to bring Jacob to agree to the only conditions on which his sons could return to Egypt (Ge 42:15). The necessity of immediately procuring fresh supplies for the maintenance of themselves and their families overcame every other consideration and extorted his consent to Benjamin joining in a journey, which his sons entered on with mingled feelings of hope and anxiety—of hope, because having now complied with the governor's demand to bring down their youngest brother, they flattered themselves that the alleged ground of suspecting them would be removed; and of apprehension that some ill designs were meditated against them.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ye shall not see my face.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " See the same expression, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " 2 Samuel 14:24,32 Ac 20:25,38",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 14:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",32 Ac 20:25,38",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". Ye shall not be admitted into my presence, nor to the purchasing of any corn here. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Judah spake unto him,.... Reuben the eldest son had met with a repulse already, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 42:36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; Simeon the next was now in Egypt, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 42:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and Levi, perhaps on account of the affair of Shechem, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 34:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", did not yet stand well in his father's favour and affection; wherefore Judah being next, with the consent of his brethren, undertakes to manage the affair with him, who had doubtless an interest in him, as well as authority among his brethren, and was a prudent man, and could speak well: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "saying, the man did solemnly protest unto us; meaning Joseph, though he then knew not that it was he; whom he calls \"the man\", not by way of contempt, or as thinking and speaking meanly of him, but the reverse, the great man, the honourable man, the governor of Egypt; and so the Septuagint version adds, \"the man, the lord of the land\"; he in the strongest terms, and in the most solemn manner, protested by the life of Pharaoh: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "saying, ye shall not see my face; with acceptance, should not be admitted to come near him, or treat with him, and purchase any corn of him: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "except your brother be with you; their youngest brother Benjamin. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "except your brother be with you; their youngest brother Benjamin. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Judah spake unto him, saying, The man did solemnly protest unto us, saying, Ye shall not see my face, except your brother be with you.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Judah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Judah is prominent throughout the J narrative. Cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Genesis 43:8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 43:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 37:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 44:14-34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 46:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "except your brother be with you",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Admission to Joseph’s presence and permission to buy corn were to depend on Benjamin’s accompanying them. The other two objects mentioned in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 42:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", (1) to disprove the charge of being spies, and (2) to obtain the release of Simeon, are not mentioned.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 3.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And Judah spake unto him, saying,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - Judah now becomes the spokesman, either because Reuben's entreaty had been rejected, and Levi, who followed Reuben and Simeon in respect of age, had forfeited his father's confidence though his treachery to the Shechemites (Keil, Murphy); or because he could speak to his father with greater freedom, having a freer conscience than the rest (Lange); or because he was a man possessed of greater prudence and ability than the rest (Lawson), if indeed the suggestion is not correct that they all endeavored to persuade their father, though Judah's eloquence alone is recorded (Calvin) - the man (i4 e. the Egyptian viceroy) did solemnly protest (literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "protesting did protest, i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " did earnestly protest) ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "unto us, saying",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", - with an oath which is not here repeated (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 42:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Ye shall not see my face, except your brother be with you.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Genesis 43:3",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Judah then declared, that they would not go there again unless their father sent Benjamin with them; for the man (Joseph) had solemnly protested (העד העד) that they should not see his face without their youngest brother. Judah undertook the consultation with his father about Benjamin's going, because Reuben, the eldest son, had already been refused, and Levi, who followed Reuben and Simeon, had forfeited his father's confidence through his treachery to the Shechemites (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). ",
        "children": []
      }
    ]
  }
]