[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "43:26-34 Observe the great respect Joseph's brethren paid to him. Thus were Joseph's dreams more and more fulfilled. Joseph showed great kindness to them. He treated them nobly; but see here the early distance between Jews and gentiles. In a day of famine, it is enough to be fed; but they were feasted. Their cares and fears were now over, and they ate their bread with joy, reckoning they were upon good terms with the lord of the land. If God accept our works, our present, we have reason to be cheerful. Joseph showed special regard for Benjamin, that he might try whether his brethren would envy him. It must be our rule, to be content with what we have, and not to grieve at what others have. Thus Jesus shows those whom he loves, more and more of their need. He makes them see that he is their only refuge from destruction. He overcomes their unwillingness, and brings them to himself. Then, as he sees good, he gives them some taste of his love, and welcomes them to the provisions of his house, as an earnest of what he further intends for them.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "They are now entertained by Joseph. They brought the present, and made a lowly obeisance before him. \"They bent the head.\" See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 24:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"God be gracious unto thee, my son.\" His kind treatment of Benjamin, on whose presence he had so much insisted, was calculated to reassure the brothers. The latter was born in his thirteenth year, and therefore, he was entitled to assume the paternal style in regard to him. Joseph still appeals with a natural and unconstrained reverence to his own God. \"And Joseph hastened away.\" The little touch of tenderness he had involuntarily thrown into his address to Benjamin, is too much for his feelings, which yearn toward his brother, and he is obliged to retreat to his chamber to conceal his tears and compose his countenance. \"They set for him by himself.\" As the governor, or as connected by affinity with the priestly caste, Joseph does not eat with the other Egyptians. The Egyptians cannot eat with the Hebrews. \"That is an abomination to the Mizrites.\" For the Hebrews partook of the flesh of kine, both male and female.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "But Herodotus informs us (ii. 41), that \"male kine, if clean, are used by the Egyptians, but the females they are not allowed to sacrifice, since they are sacred to Isis.\" And he adds that \"a native of Egypt will not kiss a Greek, use his knife, his spit, or his cauldron, or taste the flesh cut with a Greek knife.\" They considered all foreigners unclean, and therefore, refused to eat with them (see Rawlinson's Herodotus on p. q.). They sat in his presence; arranged according to the order of their birth, to their great amazement. Egypt was to them a land of wonders, and Egypt's sultan a man of wonder. \"Benjamin's mess.\" The honored guest was distinguished by a larger or daintier portion of the fare (1 Samuel 9:23-24; Homer, ii. 7,321). A double portion was assigned to the Spartan kings. The fivefold division was prominent in Egyptian affairs Genesis 41:34; Genesis 45:22; Genesis 47:2, Genesis 47:24, Genesis 47:26. \"And were merry.\" They drank freely, so as to be exhilarated, because their cares were dissipated by the kindness they were receiving, the presence of Simon, and the attention paid to Benjamin. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "But Herodotus informs us (ii. 41), that \"male kine, if clean, are used by the Egyptians, but the females they are not allowed to sacrifice, since they are sacred to Isis.\" And he adds that \"a native of Egypt will not kiss a Greek, use his knife, his spit, or his cauldron, or taste the flesh cut with a Greek knife.\" They considered all foreigners unclean, and therefore, refused to eat with them (see Rawlinson's Herodotus on p. q.). They sat in his presence; arranged according to the order of their birth, to their great amazement. Egypt was to them a land of wonders, and Egypt's sultan a man of wonder. \"Benjamin's mess.\" The honored guest was distinguished by a larger or daintier portion of the fare (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 9:23-24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; Homer, ii. 7,321). A double portion was assigned to the Spartan kings. The fivefold division was prominent in Egyptian affairs ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 41:34",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 45:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 47:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 47:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 47:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". \"And were merry.\" They drank freely, so as to be exhilarated, because their cares were dissipated by the kindness they were receiving, the presence of Simon, and the attention paid to Benjamin. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": " - The Ten Brothers Were Tested",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Joseph has had the satisfaction of seeing his brother Benjamin safe and well. He has heard his brothers acknowledging their guilt concerning himself. He resolves to put their attachment to Benjamin, and the genuineness of their change of disposition, to a test that will at the same time expose Benjamin to no hazard.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Joseph has had the satisfaction of seeing his brother Benjamin safe and well. He has heard his brothers acknowledging their guilt concerning himself. He resolves to put their attachment to Benjamin, and the genuineness of their change of disposition, to a test that will at the same time expose Benjamin to no hazard.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "18. the men were afraid—Their feelings of awe on entering the stately mansion, unaccustomed as they were to houses at all, their anxiety at the reasons of their being taken there, their solicitude about the restored money, their honest simplicity in communicating their distress to the steward and his assurances of having received their money in \"full weight,\" the offering of their fruit present, which would, as usual, be done with some parade, and the Oriental salutations that passed between their host and them—are all described in a graphic and animated manner.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "His bowels did yearn; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " his heart and inward parts were vehemently moved, as they commonly are upon occasion of any excessive passion, of love, pity, grief, or joy, &c. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Joseph made haste,.... To get out of the room where he was with his brethren as fast as he could: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for his bowels did yearn upon his brother; his passions grew strong, his affections were raised, his heart was full of tenderness, and there was such a flow of love and joy at the sight of his brother, and the little conversation he had with him, that he was ready to burst out, and must have discovered himself if he had not immediately turned and got out of the room: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and he sought where to weep; a proper place to vent his passion in tears of joy, and relieve himself ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and he entered into his chamber, and wept there; where he could be the most retired, and not likely to be overheard. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and he entered into his chamber, and wept there; where he could be the most retired, and not likely to be overheard. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Joseph made haste; for his bowels did yearn upon his brother: and he sought where to weep; and he entered into his chamber, and wept there.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "his bowels did yearn",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] For this phrase denoting strong feelings cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 3:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 31:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Joseph’s emotion is recorded here, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 42:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in proof of his tenderness and sympathy. The same simplicity may be found in the description of Homeric heroes.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 30.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And Joseph made haste; for his bowels did yearn",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "were becom",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "ing warm, from intensity of tore) ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "upon his brother: and he sought where to weep; -",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the second occasion on which Joseph is represented as overcome by the strength of his inward emotion, the first having been when his brethren were speaking about their cruelty towards himself (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 42:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "and he entered into his chamber, and wept there.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Genesis 43:30",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And \"his (Joseph's) bowels did yearn\" (נכמרוּ lit., were compressed, from the force of love to his brother), so that he was obliged to seek (a place) as quickly as possible to weep, and went into the chamber, that he might give vent to his feelings in tears; after which, he washed his face and came out again, and, putting constraint upon himself, ordered the dinner to be brought in.",
        "children": []
      }
    ]
  }
]