[{"num":8,"verse":"All the commandments which I command you this day you shall be watchful to do, that you may live and multiply and go in and possess the land which the Lord swore to give to your fathers."},{"num":2,"verse":"And you shall [earnestly] remember all the way which the Lord your God led you these forty years in the wilderness, to humble you and to prove you, to know what was in your [mind and] heart, whether you would keep His commandments or not."},{"num":3,"verse":"And He humbled you and allowed you to hunger and fed you with manna, which you did not know nor did your fathers know, that He might make you recognize and personally know that man does not live by bread only, but man lives by every word that proceeds out of the mouth of the Lord."},{"num":4,"verse":"Your clothing did not become old upon you nor did your feet swell these forty years."},{"num":5,"verse":"Know also in your [minds and] hearts that, as a man disciplines and instructs his son, so the Lord your God disciplines and instructs you."},{"num":6,"verse":"So you shall keep the commandments of the Lord your God, to walk in His ways and [reverently] fear Him."},{"num":7,"verse":"For the Lord your God is bringing you into a good land, a land of brooks of water, of fountains and springs, flowing forth in valleys and hills;"},{"num":8,"verse":"A land of wheat and barley, and vines and fig trees and pomegranates, a land of olive trees and honey;"},{"num":9,"verse":"A land in which you shall eat food without shortage and lack nothing in it; a land whose stones are iron and out of whose hills you can dig copper."},{"num":10,"verse":"When you have eaten and are full, then you shall bless the Lord your God for all the good land which He has given you."},{"num":11,"verse":"Beware that you do not forget the Lord your God by not keeping His commandments, His precepts, and His statutes which I command you today,"},{"num":12,"verse":"Lest when you have eaten and are full, and have built goodly houses and live in them,"},{"num":13,"verse":"And when your herds and flocks multiply and your silver and gold is multiplied and all you have is multiplied,"},{"num":14,"verse":"Then your [minds and] hearts be lifted up and you forget the Lord your God, Who brought you out of the land of Egypt, out of the house of bondage,"},{"num":15,"verse":"Who led you through the great and terrible wilderness, with its fiery serpents and scorpions and thirsty ground where there was no water, but Who brought you forth water out of the flinty rock,"},{"num":16,"verse":"Who fed you in the wilderness with manna, which your fathers did not know, that He might humble you and test you, to do you good in the end."},{"num":17,"verse":"And beware lest you say in your [mind and] heart, My power and the might of my hand have gotten me this wealth."},{"num":18,"verse":"But you shall [earnestly] remember the Lord your God, for it is He Who gives you power to get wealth, that He may establish His covenant which He swore to your fathers, as it is this day."},{"num":19,"verse":"And if you forget the Lord your God and walk after other gods and serve them and worship them, I testify against you this day that you shall surely perish."},{"num":20,"verse":"Like the nations which the Lord makes to perish before you, so shall you perish, because you would not obey the voice of the Lord your God."}]