[{"header":"Remember the Lord"},{"num":8,"verse":"“You must obey all the commands that I give you today, because then you will live and grow to become a great nation. You will get the land that the Lord promised to your ancestors."},{"num":2,"verse":"And you must remember the entire trip that the Lord your God has led you through these 40 years in the desert. He was testing you. He wanted to make you humble. He wanted to know what is in your heart. He wanted to know if you would obey his commands."},{"num":3,"verse":"He humbled you and let you be hungry. Then he fed you with manna—something you did not know about before. It was something your ancestors had never seen. Why did the Lord do this? Because he wanted you to know that it is not just bread that keeps people alive. People’s lives depend on what the Lord says."},{"num":4,"verse":"These past 40 years, your clothes did not wear out, and your feet did not swell."},{"num":5,"verse":"You must remember that the Lord your God teaches and corrects you as a father teaches and corrects his son."},{"num":6,"verse":"“You must obey the commands of the Lord your God. Follow him and respect him."},{"num":7,"verse":"The Lord your God is bringing you into a good land—a land with rivers and pools of water. Water flows out of the ground in the valleys and hills."},{"num":8,"verse":"It is a land with wheat and barley, grapevines, fig trees, and pomegranates. It is a land with olive oil and honey."},{"num":9,"verse":"There you will have plenty of food and everything you need. It is a land where the rocks are iron. You can dig copper out of the hills."},{"num":10,"verse":"You will have all you want to eat. Then you will praise the Lord your God for the good land he has given you."},{"header":"Don’t Forget What the Lord Did"},{"num":11,"verse":"“Be careful. Don’t forget the Lord your God! Be careful to obey the commands, laws, and rules that I give you today."},{"num":12,"verse":"Then you will have plenty to eat, and you will build good houses and live in them."},{"num":13,"verse":"Your cattle, sheep, and goats will grow large. You will get plenty of gold and silver. You will have plenty of everything."},{"num":14,"verse":"When that happens, you must be careful not to become proud. You must not forget the Lord your God. You were slaves in Egypt, but he made you free and brought you out of that land."},{"num":15,"verse":"He led you through that great and terrible desert where there were poisonous snakes and scorpions. The ground was dry, and there was no water anywhere. But he gave you water out of a solid rock."},{"num":16,"verse":"In the desert he fed you manna—something your ancestors had never seen. He tested you to make you humble so that everything would go well for you in the end."},{"num":17,"verse":"Don’t ever say to yourself, ‘I got all this wealth by my own power and ability.’"},{"num":18,"verse":"Remember the Lord your God is the one who gives you power to do these things. He does this because he wants to keep the agreement that he made with your ancestors, as he is doing today!"},{"num":19,"verse":"“Don’t ever forget the Lord your God. Don’t ever follow other gods or worship and serve them. If you do that, I warn you today: You will surely be destroyed!"},{"num":20,"verse":"The Lord is destroying other nations for you. But if you stop listening to the Lord your God, you will be destroyed just like them!"}]