[{"header":"Remember the Lord"},{"num":8,"verse":"“You must carefully follow every command I am giving you today, so that you may live and increase, and may enter and take possession of the land the Lord swore to your fathers. "},{"num":2,"verse":"Remember that the Lord your God led you on the entire journey these 40 years in the wilderness, so that He might humble you and test you to know what was in your heart, whether or not you would keep His commands. "},{"num":3,"verse":"He humbled you by letting you go hungry; then He gave you manna to eat, which you and your fathers had not known, so that you might learn that man does not live on bread alone but on every word that comes from the mouth of the Lord. "},{"num":4,"verse":"Your clothing did not wear out, and your feet did not swell these 40 years. "},{"num":5,"verse":"Keep in mind that the Lord your God has been disciplining you just as a man disciplines his son. "},{"num":6,"verse":"So keep the commands of the Lord your God by walking in His ways and fearing Him. "},{"num":7,"verse":"For the Lord your God is bringing you into a good land, a land with streams of water, springs, and deep water sources, flowing in both valleys and hills; "},{"num":8,"verse":"a land of wheat, barley, vines, figs, and pomegranates; a land of olive oil and honey; "},{"num":9,"verse":"a land where you will eat food without shortage, where you will lack nothing; a land whose rocks are iron and from whose hills you will mine copper. "},{"num":10,"verse":"When you eat and are full, you will praise the Lord your God for the good land He has given you."},{"num":11,"verse":"“Be careful that you don’t forget the Lord your God by failing to keep His command—the ordinances and statutes—I am giving you today. "},{"num":12,"verse":"When you eat and are full, and build beautiful houses to live in, "},{"num":13,"verse":"and your herds and flocks grow large, and your silver and gold multiply, and everything else you have increases, "},{"num":14,"verse":"be careful that your heart doesn’t become proud and you forget the Lord your God who brought you out of the land of Egypt, out of the place of slavery. "},{"num":15,"verse":"He led you through the great and terrible wilderness with its poisonous snakes and scorpions, a thirsty land where there was no water. He brought water out of the flint-like rock for you. "},{"num":16,"verse":"He fed you in the wilderness with manna that your fathers had not known, in order to humble and test you, so that in the end He might cause you to prosper. "},{"num":17,"verse":"You may say to yourself, ‘My power and my own ability have gained this wealth for me,’ "},{"num":18,"verse":"but remember that the Lord your God gives you the power to gain wealth, in order to confirm His covenant He swore to your fathers, as it is today. "},{"num":19,"verse":"If you ever forget the Lord your God and go after other gods to worship and bow down to them, I testify against you today that you will perish. "},{"num":20,"verse":"Like the nations the Lord is about to destroy before you, you will perish if you do not obey the Lord your God."}]