[{"num":14,"verse":"¶ Then all the congregation lifted up their voice and cried, and the people wept that night."},{"num":2,"verse":"And all the sons of Israel murmured against Moses and against Aaron, and the whole congregation said unto them, Oh, that we might die in the land of Egypt or that we might die in this wilderness!"},{"num":3,"verse":"And why has the LORD brought us unto this land, to fall by the sword, that our wives and our children should be a prey? Would it not be better for us to return into Egypt?"},{"num":4,"verse":"And they said one to another, Let us make a captain, and let us return into Egypt."},{"num":5,"verse":"¶ Then Moses and Aaron fell on their faces before all the assembly of the congregation of the sons of Israel."},{"num":6,"verse":"And Joshua, the son of Nun, and Caleb, the son of Jephunneh, who were of those that had spied out the land, rent their clothes;"},{"num":7,"verse":"and they spoke unto all the company of the sons of Israel, saying, The land which we passed through to spy out is an exceeding good land."},{"num":8,"verse":"If the LORD delights in us, then he will bring us into this land and give it to us, a land which flows with milk and honey."},{"num":9,"verse":"Therefore, do not be rebels against the LORD, neither fear ye the people of the land, for they are our bread; their defence is departed from them, and the LORD is with us; do not fear them."},{"num":10,"verse":"Then all the multitude spoke of stoning them with stones. But the glory of the LORD appeared in the tabernacle of the testimony before all the sons of Israel."},{"num":11,"verse":"¶ And the LORD said unto Moses, How long will this people provoke me? How long will it be before they believe me, with all the signs which I have done among them?"},{"num":12,"verse":"I will smite them with the pestilence and disinherit them and will make of thee a greater nation and mightier than they."},{"num":13,"verse":"And Moses said unto the LORD, Then the Egyptians shall hear it, for thou didst bring this people out of the midst of them with thy might;"},{"num":14,"verse":"and the inhabitants of this land will say, for they have already heard that thou, oh LORD, wast among this people, that thou, O LORD, art seen face to face, and that thy cloud was over them, and that thou didst go before them by day time in a pillar of a cloud and in a pillar of fire by night;"},{"num":15,"verse":"and that thou hast caused all this people to die as one man; and the Gentiles who have heard of thy fame will speak, saying,"},{"num":16,"verse":"Because the LORD was not able to bring this people into the land which he swore unto them; therefore, he has slain them in the wilderness."},{"num":17,"verse":"And now, I beseech thee, let the power of my Lord be great, according as thou hast spoken, saying,"},{"num":18,"verse":"The LORD is longsuffering and of great mercy, letting go of iniquity and transgression and absolving, but by no means absolving the guilty, visiting the iniquity of the fathers upon the sons unto the third and fourth generations."},{"num":19,"verse":"Pardon now the iniquity of this people according to the greatness of thy mercy and as thou hast forgiven this people from Egypt even until now."},{"num":20,"verse":"¶ Then the LORD said, I have pardoned according to thy word."},{"num":21,"verse":"But as truly as I live, all the earth shall be filled with the glory of the LORD."},{"num":22,"verse":"Because all those men who saw my glory and my signs which I have done in Egypt and in the wilderness and have tempted me now these ten times and have not hearkened to my voice,"},{"num":23,"verse":"surely they shall not see the land which I swore unto their fathers, neither shall any of those that provoked me see it."},{"num":24,"verse":"But my slave Caleb, because there was another spirit in him, and he proved to follow after me, I will bring him into the land that he entered into, and his seed shall receive it by inheritance,"},{"num":25,"verse":"and even the Amalekite and the Canaanite who dwell in the valley. Turn around tomorrow and go into the wilderness by the way of the Red Sea."},{"num":26,"verse":"And the LORD spoke unto Moses and unto Aaron, saying,"},{"num":27,"verse":"How long shall I hear this evil congregation, which murmurs against me, the complaints of the sons of Israel, which they murmur against me?"},{"num":28,"verse":"Say unto them, As truly as I live, saith the LORD, according as ye have spoken in my ears, so will I do to you."},{"num":29,"verse":"Your carcasses shall fall in this wilderness, all that were numbered of you, according to your whole number, from twenty years old and upward, who have murmured against me;"},{"num":30,"verse":"doubtless ye shall not come into the land, concerning which I swore to make you dwell therein, except Caleb the son of Jephunneh and Joshua the son of Nun."},{"num":31,"verse":"But your little ones, whom ye said should be a prey, I will bring them in, and they shall know the land which ye have despised."},{"num":32,"verse":"But as for you, your carcasses, they shall fall in this wilderness."},{"num":33,"verse":"And your children shall be shepherded in the wilderness forty years and bear your fornications until your carcasses are wasted in the wilderness."},{"num":34,"verse":"After the number of the days in which ye spied out the land, even forty days, each day for a year, ye shall bear your iniquities forty years, and ye shall know my reason for annulling my promise."},{"num":35,"verse":"I, the LORD, have spoken, I will surely do it unto all this evil congregation that are gathered together against me; in this wilderness they shall be consumed, and there they shall die."},{"num":36,"verse":"¶ And the men, whom Moses had sent to spy out the land, who returned and made all the congregation to murmur against him by bringing up a slander upon the land,"},{"num":37,"verse":"even those men that brought an evil report of the land, died by the plague before the LORD."},{"num":38,"verse":"But Joshua, the son of Nun, and Caleb, the son of Jephunneh, remained alive of the men that went to spy out the land."},{"num":39,"verse":"And Moses told these things unto all the sons of Israel, and the people mourned greatly."},{"num":40,"verse":"And they rose up early in the morning and climbed up into the top of the mountain, saying, Here we are prepared to go up unto the place of which the LORD has spoken; for we have sinned."},{"num":41,"verse":"And Moses said, Why do ye break the commandment of the LORD? This also shall not prosper."},{"num":42,"verse":"Do not go up, for the LORD is not among you; do not be smitten before your enemies."},{"num":43,"verse":"For the Amalekite and the Canaanite are there before you, and ye shall fall by the sword; because ye are turned away from following the LORD, therefore, the LORD will not be with you."},{"num":44,"verse":"But they presumed to go up unto the hill top; nevertheless, the ark of the covenant of the LORD and Moses, did not depart out of the camp."},{"num":45,"verse":"Then the Amalekite came down and the Canaanite who dwelt in that hill and smote them and defeated them, pursuing them unto Hormah."}]