[{"num":34,"verse":"The word that was made of the Lord to Jeremy, when Nebuchadnezzar, king of Babylon, and all his host, and all the realms of [the] earth, that were under the power of his hand, and all peoples fought against Jerusalem, and against all cities thereof; and he said, (The word of the Lord that was made to Jeremiah, when Nebuchadnezzar, the king of Babylon, and all his army, and all the kingdoms of the earth, that were under the power of his hand, and all the peoples, fought against Jerusalem, and against all its nearby towns; and he said,)"},{"num":2,"verse":"The Lord God of Israel saith these things, Go thou, and speak to Zedekiah, king of Judah; and thou shalt say to him, The Lord saith these things, Lo! I shall betake this city into the hand of the king of Babylon, and he shall burn it by fire (Lo! I shall deliver this city into the hands of the king of Babylon, and he shall burn it down)."},{"num":3,"verse":"And thou shalt not escape from his hand, but thou shalt be taken by taking, and thou shalt be betaken into his hand (and thou shalt be delivered into his hands); and thine eyes shall see the eyes of the king of Babylon, and his mouth shall speak with thy mouth, and thou shalt enter into Babylon."},{"num":4,"verse":"Nevertheless Zedekiah, the king of Judah, hear thou the word of the Lord; the Lord saith these things to thee, Thou shalt not die by sword,"},{"num":5,"verse":"but thou shalt die in peace; and by the burnings of thy fathers (and like the burning of incense for thy forefathers), the former kings that were before thee, so they shall burn (incense for) thee, and they shall bewail thee, (and say,) Woe! (my) lord; for I spake a word, saith the Lord."},{"num":6,"verse":"And Jeremy, the prophet, spake to Zedekiah, king of Judah, all these words in Jerusalem."},{"num":7,"verse":"And the host of the king of Babylon fought against Jerusalem, and against all the cities of Judah, that were left; against Lachish, and against Azekah; for why these strong cities were left of the cities of Judah."},{"num":8,"verse":"The word that was made of the Lord to Jeremy, after that king Zedekiah smote bond of peace with all the people in Jerusalem, and preached, (The word of the Lord that was made to Jeremiah, after that King Zedekiah struck a covenant with all the people in Jerusalem, and had proclaimed,)"},{"num":9,"verse":"that each man should deliver his servant, and each man his handmaid, an Hebrew man and an Hebrew woman, free, and that they should not be lords of them, that is, in a Jew, and their brother. (that each person should set free their servants, and their servantesses, yea, any Hebrew man or woman, and that they should not be their lords, that is, of a Jew, their brother, or their sister.)"},{"num":10,"verse":"Therefore all the princes and all the people heard, which made covenant, that they should deliver each man his servant, and each man his handmaid, free, and should no more be lords of them; therefore they heard, and delivered (them); (And so when all the leaders and all the people, who had made the covenant, had heard that each person should set their servants, and their servantesses, free, and that they should no more be their lords; yea, when they had heard this, they indeed set them free;)"},{"num":11,"verse":"and they were turned afterward, and drew again their servants, and handmaids, which they had let go free, and they made them subject (again) into servants, and into servantesses. (but then afterward, they turned back, and drew again to themselves their servants, and servantesses, whom they had let go free, and they made them subject again into servants, and into servantesses.)"},{"num":12,"verse":"And the word of the Lord was made of the Lord to Jeremy, and said, (And so the word of the Lord was made to Jeremiah, and said,)"},{"num":13,"verse":"The Lord God of Israel saith these things, I smote a bond of peace with your fathers, in the day in which I led them out of the land of Egypt, out of the house of servage; and I said, (The Lord God of Israel saith these things, I struck a covenant with your forefathers, on the day when I led them out of the land of Egypt, from the house of servitude, or of slavery; and I said,)"},{"num":14,"verse":"When seven years be [ful]filled, each man deliver his brother, an Hebrew man, which is sold to him, and he shall serve thee six years, and (then) thou shalt deliver him from thee; and your fathers heard not me, neither bowed [in] their ear. (Every seven years, each person shall let their brother, a Hebrew man, who was sold to him, go free, yea, after that he hath served thee for six years, thou shalt let him go free from thee; but your forefathers did not listen to me, nor bowed in their ears.)"},{"num":15,"verse":"And ye be converted today, and ye did that, that is rightful before mine eyes, that ye preached each man freedom to his friend, and ye made (a) covenant in my sight, in the house wherein my name is called to help on that freedom. (And today ye turned, and ye did what was right before my eyes, in that ye preached freedom for each person to their friend, and ye made a covenant in my sight, in the House where my name is called on for help/and ye made a covenant before me, in the House which is called by my name.)"},{"num":16,"verse":"And ye turned again, and defouled my name, and ye brought again each man his servant, and each man his handmaid, which ye delivered, that they should be free, and of their own power; and ye made them subject, that they be servants and handmaids to you. (But then ye turned again, and defiled my name, and each person took back his servant, and his servantess, whom they had let go, so that they could be free, and under their own power; and ye made them subject again, so that they be your servants and your servantesses.)"},{"num":17,"verse":"Therefore the Lord saith these things, Ye heard not me, that ye preached freedom, each man to his brother, and each man to his friend; lo! (so now) I preach to you freedom, saith the Lord, and to sword, and to hunger, and to pestilence; and I shall give you into stirring to all realms of (the) earth. (And so the Lord saith these things, Ye did not listen to me, ye who proclaimed freedom, each person to their brother, and each person to their friend; so now lo! I proclaim freedom to you, saith the Lord, yea, freedom to the sword, and to hunger, and to pestilence; and I shall give you into stirring, or into loathing, by all the kingdoms of the earth.)"},{"num":18,"verse":"And I shall give the men, that brake my bond of peace, and kept not the words of [the] bond of peace, to which they assented in my sight, and kept not the calf which they cutted into two parts; (And I shall make those who broke my covenant, and did not keep, or obey, the words of the covenant, to which they assented before me, to become like the calf which they cut into two parts;)"},{"num":19,"verse":"and (they be) the princes of Judah, and the princes of Jerusalem, and the honest (and chaste) servants, and priests (that) went between the partings thereof, and all the people of the land, that went between the partings of the calf; (and these be the leaders of Judah, and the leaders of Jerusalem, and the eunuchs, and the priests who went between its parts, and all the people of the land, who went between the parts of the calf;)"},{"num":20,"verse":"and I shall give them into the hand of their enemies, and into the hand of them that seek their life; and the dead carrion of them shall be into meat to the volatiles of the air, and to the beasts of (the) earth. (and I shall give them into the hands, or into the power, of their enemies, and into the hands of those who seek their life; and their dead bodies shall be food for the birds of the air, and for the beasts of the earth.)"},{"num":21,"verse":"And I shall give Zedekiah, the king of Judah, and his princes, into the hand of their enemies, and into the hand of them that seek their life, and into the hand of the hosts of the king of Babylon, that went away from you. (And I shall give Zedekiah, the king of Judah, and his leaders, into the hands of their enemies, and into the hands of those who seek their lives, and into the hands of the army of the king of Babylon, that went away from you.)"},{"num":22,"verse":"Lo! I command, saith the Lord, and I shall bring them again into this city; and they shall fight against it, and shall take it, and shall burn it with fire; and I shall give the cities of Judah into wilderness, for there is no dweller. (Lo! I command, saith the Lord, and I shall bring them again into this city; and they shall fight against it, and shall take it, and they shall burn it down; and I shall make the cities of Judah like a wilderness, or like a desert, where there be no inhabitants.)"}]