[{"header":"The Eagle and the Vine"},{"num":17,"verse":"Then the word of the Lord came to me. He said,"},{"num":2,"verse":"“Son of man, I have a story with a hidden meaning for you to tell the family of Israel."},{"num":3,"verse":"Tell them that this is what the Lord God says:"},{"header":"King Zedekiah Punished"},{"num":11,"verse":"The word of the Lord came to me. He said,"},{"num":12,"verse":"“Explain this story to the people of Israel who always turn against me. Tell them this: The first eagle is the king of Babylonia. He came to Jerusalem and took away the king and other leaders. He brought them to Babylonia."},{"num":13,"verse":"Then Nebuchadnezzar made an agreement with a man from the king’s family. Nebuchadnezzar forced that man to make a promise. So this man promised to be loyal to Nebuchadnezzar. Nebuchadnezzar made this man the new king of Judah. Then he took all the powerful men away from Judah."},{"num":14,"verse":"So Judah became a weak kingdom that could not turn against King Nebuchadnezzar. The people were forced to keep the agreement Nebuchadnezzar made with the new king of Judah."},{"num":15,"verse":"But this new king tried to rebel against Nebuchadnezzar anyway! He sent messengers to Egypt to ask for help. The new king asked for many horses and soldiers. Now, do you think the new king of Judah will succeed? Do you think the new king will have enough power to break the agreement and escape punishment?”"},{"num":16,"verse":"The Lord God says, “By my life, I swear that this new king will die in Babylonia! Nebuchadnezzar made this man the new king of Judah, but he broke his promise with Nebuchadnezzar. This new king ignored that agreement."},{"num":17,"verse":"The king of Egypt will not be able to save the king of Judah. He might send many soldiers, but Egypt’s great power will not save Judah. Nebuchadnezzar’s army will build dirt roads and dirt walls to capture the city. Many people will die."},{"num":18,"verse":"But the king of Judah will not escape, because he ignored his agreement. He broke his promise to Nebuchadnezzar.”"},{"num":19,"verse":"The Lord God makes this promise: “By my life, I swear that I will punish the king of Judah, because he ignored my warnings and broke our agreement."},{"num":20,"verse":"I will set my trap, and he will be caught in it. Then I will bring him to Babylon, and I will punish him there. I will punish him because he turned against me,"},{"num":21,"verse":"and I will destroy his army. I will destroy his best soldiers and scatter them to the wind. Then you will know that I am the Lord and that I told you these things.”"},{"num":22,"verse":"This is what the Lord God says:"}]