[{"num":17,"verse":"¶ And the word of the LORD came unto me, saying,"},{"num":2,"verse":"Son of man, propose a figure and compose an enigma unto the house of Israel"},{"num":3,"verse":"and say: Thus hath the Lord GOD said, A great eagle with great wings and long members, full of feathers of diverse colours, came unto Lebanon and took the highest branch of the cedar:"},{"num":4,"verse":"he cropped off the principal shoot and carried it into a land of markets; he set it in the city of the merchants."},{"num":5,"verse":"He also took of the seed of the land and planted it in a fruitful field; he placed it by great waters and set it as a willow tree."},{"num":6,"verse":"And it grew and became a vine of many branches, low of stature, whose branches looked at him, and its roots were under him: so it became a vine and brought forth branches and shot forth sprigs."},{"num":7,"verse":"There was also another great eagle with great wings and many feathers; and, behold, this vine joined her roots toward him and extended her branches toward him that he might water it by the furrows of her plantation."},{"num":8,"verse":"It was planted in a good soil by many waters that it might bring forth branches and that it might bear fruit, that it might be a goodly vine."},{"num":9,"verse":"Say thou: Thus hath the Lord GOD said, Shall it be prospered? Shall he not pull it up its roots and destroy its fruit and let it wither? All of the leaves of her spring shall wither, even without great power or many people plucking it up by its roots."},{"num":10,"verse":"Yea, behold, being planted, shall it be prospered? Shall it not utterly wither when the east wind touches it? It shall wither in the furrows where it grew."},{"num":11,"verse":"And the word of the LORD came unto me, saying,"},{"num":12,"verse":"Say now to the rebellious house: Do ye not know what these things mean? Tell them, Behold, the king of Babylon is come to Jerusalem and has taken its king and its princes and led them with him to Babylon;"},{"num":13,"verse":"and has taken of the seed of the kingdom and made a covenant with him and has brought him to an oath: he has also taken the mighty of the land:"},{"num":14,"verse":"that the kingdom might be cast down, that it might not lift itself up, but that it might keep his covenant and stay in her."},{"num":15,"verse":"But he rebelled against him in sending his ambassadors unto Egypt, that they might give him horses and much people. Shall he be prospered, shall he that does such things escape? And shall he who broke the covenant be able to flee?"},{"num":16,"verse":"As I live, said the Lord GOD, surely in the place where the king dwells that made him king, whose oath he despised and whose covenant he broke, even with him in the midst of Babylon, he shall die."},{"num":17,"verse":"And not with a mighty army, nor with a great company shall Pharaoh do anything for him in the battle when they cast up mounts, and build forts to cut off many lives:"},{"num":18,"verse":"seeing he despised the oath to invalidate the covenant when, behold, he had given his hand and has done all these things, he shall not escape."},{"num":19,"verse":"Therefore thus hath the Lord GOD said: As I live, surely my oath that he has despised and my covenant that he has broken, even it will I turn upon his own head."},{"num":20,"verse":"And I will spread my net upon him and he shall be taken in my snare, and I will bring him to Babylon and will enter into judgment with him there for his trespass with which he has rebelled against me."},{"num":21,"verse":"And all his fugitives with all his armies shall fall by the sword, and those that remain shall be scattered toward all winds; and ye shall know that I the LORD have spoken it."},{"num":22,"verse":"¶ Thus hath the Lord GOD said: I will also take of the highest branch of that high cedar and will set it up; I will crop off from the principal branch a shoot and will plant it upon the high and sublime mountain:"},{"num":23,"verse":"in the high mountain of Israel I will plant it, and it shall bring forth boughs and bear fruit and become a magnificent cedar; and under it shall dwell every fowl; everything that flies shall dwell in the shadow of its branches."},{"num":24,"verse":"And all the trees of the field shall know that I the LORD have brought down the high tree, have exalted the low tree, have dried up the green tree, and have made the dry tree to flourish; I the LORD have spoken and have done it."}]