[{"header":"A Parable of Two Eagles and a Vine"},{"num":17,"verse":"The Lord’s message came to me: "},{"num":2,"verse":"“Son of man, offer a riddle, and tell a parable to the house of Israel. "},{"num":3,"verse":"Say to them: ‘This is what the Sovereign Lord says:"},{"num":9,"verse":"“Say to them: ‘This is what the Sovereign Lord says:"},{"num":11,"verse":"Then the Lord’s message came to me: "},{"num":12,"verse":"“Say to the rebellious house of Israel: ‘Don’t you know what these things mean?’ Say: ‘See here, the king of Babylon came to Jerusalem and took her king and her officials prisoner and brought them to himself in Babylon. "},{"num":13,"verse":"He took one from the royal family, made a treaty with him, and put him under oath. He then took the leaders of the land "},{"num":14,"verse":"so it would be a lowly kingdom that could not rise on its own but had to keep its treaty with him in order to stand. "},{"num":15,"verse":"But this one from Israel’s royal family rebelled against the king of Babylon by sending his emissaries to Egypt to obtain horses and a large army. Will he prosper? Will the one doing these things escape? Can he break the covenant and escape?"},{"num":16,"verse":"“‘As surely as I live, declares the Sovereign Lord, surely in the city of the king who crowned him, whose oath he despised and whose covenant he broke—in the middle of Babylon he will die! "},{"num":17,"verse":"Pharaoh with his great army and mighty horde will not help him in battle, when siege ramps are erected and siege walls are built to kill many people. "},{"num":18,"verse":"He despised the oath by breaking the covenant. Take note—he gave his promise and did all these things. He will not escape!"},{"num":19,"verse":"“‘Therefore this is what the Sovereign Lord says: As surely as I live, I will certainly repay him for despising my oath and breaking my covenant! "},{"num":20,"verse":"I will throw my net over him and he will be caught in my snare; I will bring him to Babylon and judge him there because of the unfaithfulness he committed against me. "},{"num":21,"verse":"All the choice men among his troops will die by the sword, and the survivors will be scattered to every wind. Then you will know that I, the Lord, have spoken!"},{"num":22,"verse":"“‘This is what the Sovereign Lord says:"}]