[{"header":"Jesus Heals a Soldier’s Servant"},{"num":7,"verse":"When Jesus finished saying all these things to the people, he went to Capernaum. "},{"num":2,"verse":"In Capernaum there was an army officer. He had a servant who was so sick he was nearly dead. The officer loved the servant very much. "},{"num":3,"verse":"When the officer heard about Jesus, he sent some Jewish elders to him. The officer wanted the leaders to ask Jesus to come and heal his servant. "},{"num":4,"verse":"The men went to Jesus and begged him saying, “This officer is worthy of your help. "},{"num":5,"verse":"He loves our people, and he built us a synagogue.”"},{"num":6,"verse":"So Jesus went with the men. He was getting near the officer’s house when the officer sent friends to say, “Lord, you don’t need to come into my house. I am not good enough for you to be under my roof. "},{"num":7,"verse":"That is why I did not come to you myself. You only need to say the word, and my servant will be healed. "},{"num":8,"verse":"I, too, am a man under the authority of other men. And I have soldiers under my command. I tell one soldier, ‘Go,’ and he goes. And I tell another soldier, ‘Come,’ and he comes. And I say to my servant, ‘Do this,’ and my servant obeys me.”"},{"num":9,"verse":"When Jesus heard this, he was amazed. He turned to the crowd following him and said, “I tell you, this is the greatest faith I have seen anywhere, even in Israel.”"},{"num":10,"verse":"The men who had been sent to Jesus went back to the house. There they found that the servant was healed."},{"header":"Jesus Brings a Man Back to Life"},{"num":11,"verse":"The next day Jesus went to a town called Nain. His followers and a large crowd were traveling with him. "},{"num":12,"verse":"When he came near the town gate, he saw a funeral. A mother, who was a widow, had lost her only son. A large crowd from the town was with the mother while her son was being carried out. "},{"num":13,"verse":"When the Lord saw her, he felt very sorry for her. Jesus said to her, “Don’t cry.” "},{"num":14,"verse":"He went up to the coffin and touched it. The men who were carrying it stopped. Jesus said, “Young man, I tell you, get up!” "},{"num":15,"verse":"And the son sat up and began to talk. Then Jesus gave him back to his mother."},{"num":16,"verse":"All the people were amazed. They began praising God. They said, “A great prophet has come to us! God is taking care of his people.”"},{"num":17,"verse":"This news about Jesus spread through all Judea and into all the places around there."},{"header":"John Asks a Question"},{"num":18,"verse":"John’s followers told him about all these things. He called for two of his followers. "},{"num":19,"verse":"He sent them to the Lord to ask, “Are you the One who is coming, or should we wait for another?”"},{"num":20,"verse":"So the men came to Jesus. They said, “John the Baptist sent us to you with this question: ‘Are you the One who is coming, or should we wait for another?’”"},{"num":21,"verse":"At that time, Jesus healed many people of their sicknesses, diseases, and evil spirits. He healed many blind people so that they could see again. "},{"num":22,"verse":"Then Jesus said to John’s followers, “Go tell John the things that you saw and heard here. The blind can see. The crippled can walk. People with a harmful skin disease are healed. The deaf can hear, and the dead are given life. And the Good News is told to the poor. "},{"num":24,"verse":"When John’s followers left, Jesus began to tell the people about John: “What did you go out into the desert to see? A reed blown by the wind? "},{"num":29,"verse":"(When the people heard this, they all agreed that God’s teaching was good. Even the tax collectors agreed. These were people who were already baptized by John. "},{"num":30,"verse":"But the Pharisees and teachers of the law refused to accept God’s plan for themselves; they did not let John baptize them.)"},{"num":31,"verse":"Then Jesus said, “What shall I say about the people of this time? What are they like? "},{"header":"Simon the Pharisee"},{"num":36,"verse":"One of the Pharisees asked Jesus to eat with him. Jesus went into the Pharisee’s house and sat at the table. "},{"num":37,"verse":"A sinful woman in the town learned that Jesus was eating at the Pharisee’s house. So she brought an alabaster jar of perfume. "},{"num":38,"verse":"She stood at Jesus’ feet, crying, and began to wash his feet with her tears. She dried his feet with her hair, kissed them many times and rubbed them with the perfume. "},{"num":39,"verse":"The Pharisee who asked Jesus to come to his house saw this. He thought to himself, “If Jesus were a prophet, he would know that the woman who is touching him is a sinner!”"},{"num":40,"verse":"Jesus said to the Pharisee, “Simon, I have something to say to you.”"},{"num":41,"verse":"Jesus said, “There were two men. Both men owed money to the same banker. One man owed the banker 500 silver coins. The other man owed the banker 50 silver coins. "},{"num":43,"verse":"Simon, the Pharisee, answered, “I think it would be the one who owed him the most money.”"},{"num":44,"verse":"Then Jesus turned toward the woman and said to Simon, “Do you see this woman? When I came into your house, you gave me no water for my feet. But she washed my feet with her tears and dried my feet with her hair. "},{"num":48,"verse":"Then Jesus said to her, “Your sins are forgiven.”"},{"num":49,"verse":"The people sitting at the table began to think to themselves, “Who is this man? How can he forgive sins?”"},{"num":50,"verse":"Jesus said to the woman, “Because you believed, you are saved from your sins. Go in peace.”"}]