[{"header":"Micah’s sanctuary and the Levite priest"},{"num":17,"verse":"Once there was a man named Micah who lived in the Ephraim highlands."},{"num":2,"verse":"He said to his mother, “The eleven hundred pieces of silver that were taken from you led you to declare a curse and even to repeat it when I could hear. I have that silver. I’m the one who took it, and now I’ll give it back to you.”"},{"num":3,"verse":"When he gave the eleven hundred pieces of silver back to his mother, she said, “I wholeheartedly devote this silver to the Lord, to be made into a sculpted image and a molded image for my son.”"},{"num":4,"verse":"So he gave the silver back to his mother, and she took two hundred pieces of silver and gave them to a silversmith, who used it for a sculpted image and a molded image. And they were placed in Micah’s house."},{"num":5,"verse":"This man Micah had his own sanctuary. He made a priestly vest and divine images and appointed one of his sons to be his personal priest."},{"num":6,"verse":"In those days there was no king in Israel; each person did what they thought to be right."},{"num":7,"verse":"Now there was a young man from Bethlehem in Judah, from the area of the Judahite clan. He was a Levite residing there as an immigrant."},{"num":8,"verse":"The man left the town of Bethlehem in Judah to settle as an immigrant wherever he could find a place. He came to Micah’s house in the Ephraim highlands while he was making his way."},{"num":9,"verse":"“Where are you from?” Micah asked him."},{"num":10,"verse":"So Micah said to him, “Stay with me and be a father and a priest to me, and I’ll give you ten pieces of silver a year, a set of clothes, and your basic needs.”"},{"num":11,"verse":"The Levite agreed to stay with him; and the young man became like one of his own sons."},{"num":12,"verse":"Micah appointed the Levite so that the young man became his personal priest and lived in Micah’s sanctuary."},{"num":13,"verse":"And Micah said to himself, Now I know that the Lord will give me good things, because a Levite has become my priest."}]