[{"num":77,"verse":"Understanding for Asaph. Attend, O my people, to my law: incline your ears to the words of my mouth."},{"num":2,"verse":"I will open my mouth in parables: I will utter propositions from the beginning."},{"num":3,"verse":"How great things have we heard and known, and our fathers have told us."},{"num":4,"verse":"They have not been hidden from their children, in another generation. Declaring the praises of the Lord, and his powers, and his wonders which he hath done."},{"num":5,"verse":"And he set up a testimony in Jacob: and made a law in Israel. How great things he commanded our fathers, that they should make the same known to their children:"},{"num":6,"verse":"That another generation might know them. The children that should be born and should rise up, and declare them to their children."},{"num":7,"verse":"That they may put their hope in God and may not forget the works of God: and may seek his commandments."},{"num":8,"verse":"That they may not become like their fathers, a perverse and exasperating generation. A generation that set not their heart aright: and whose spirit was not faithful to God."},{"num":9,"verse":"The sons of Ephraim who bend and shoot with the bow: they have turned back in the day of battle."},{"num":10,"verse":"They kept not the covenant of God: and in his law they would not walk."},{"num":11,"verse":"And they forgot his benefits, and his wonders that he had shewn them."},{"num":12,"verse":"Wonderful things did he do in the sight of their fathers, in the land of Egypt, in the field of Tanis."},{"num":13,"verse":"He divided the sea and brought them through: and he made the waters to stand as in a vessel."},{"num":14,"verse":"And he conducted them with a cloud by day: and all the night with a light of fire."},{"num":15,"verse":"He struck the rock in the wilderness: and gave them to drink, as out of the great deep."},{"num":16,"verse":"He brought forth water out of the rock: and made streams run down as rivers."},{"num":17,"verse":"And they added yet more sin against him: they provoked the most High to wrath in the place without water."},{"num":18,"verse":"And they tempted God in their hearts, by asking meat for their desires."},{"num":19,"verse":"And they spoke ill of God: they said: Can God furnish a table in the wilderness?"},{"num":20,"verse":"Because he struck the rock, and the waters gushed out, and the streams overflowed. Can he also give bread, or provide a table for his people?"},{"num":21,"verse":"Therefore the Lord heard, and was angry: and a fire was kindled against Jacob, and wrath came up against Israel."},{"num":22,"verse":"Because they believed not in God: and trusted not in his salvation."},{"num":23,"verse":"And he had commanded the clouds from above, and had opened the doors of heaven."},{"num":24,"verse":"And had rained down manna upon them to eat, and had given them the bread of heaven."},{"num":25,"verse":"Man ate the bread of angels: he sent them provisions in abundance."},{"num":26,"verse":"He removed the south wind from heaven: and by his power brought in the southwest wind."},{"num":27,"verse":"And he rained upon them flesh as dust: and feathered fowls like as the sand of the sea."},{"num":28,"verse":"And they fell in the midst of their camp, round about their pavilions."},{"num":29,"verse":"So they did eat, and were filled exceedingly, and he gave them their desire:"},{"num":30,"verse":"They were not defrauded of that which they craved. As yet their meat was in their mouth:"},{"num":31,"verse":"And the wrath of God came upon them. And he slew the fat ones amongst them, and brought down the chosen men of Israel."},{"num":32,"verse":"In all these things they sinned still: and they believed not for his wondrous works."},{"num":33,"verse":"And their days were consumed in vanity, and their years in haste."},{"num":34,"verse":"When he slew them, then they sought him: and they returned, and came to him early in the morning."},{"num":35,"verse":"And they remembered that God was their helper: and the most high God their redeemer."},{"num":36,"verse":"And they loved him with their mouth: and with their tongue they lied unto him:"},{"num":37,"verse":"But their heart was not right with him: nor were they counted faithful in his covenant."},{"num":38,"verse":"But he is merciful, and will forgive their sins: and will not destroy them. And many a time did he turn away his anger: and did not kindle all his wrath."},{"num":39,"verse":"And he remembered that they are flesh: a wind that goeth and returneth not."},{"num":40,"verse":"How often did they provoke him in the desert: and move him to wrath in the place without water?"},{"num":41,"verse":"And they turned back and tempted God: and grieved the holy one of Israel."},{"num":42,"verse":"They remembered not his hand, in the day that he redeemed them from the hand of him that afflicted them:"},{"num":43,"verse":"How he wrought his signs in Egypt, and his wonders in the field of Tanis."},{"num":44,"verse":"And he turned their rivers into blood, and their showers that they might, not drink."},{"num":45,"verse":"He sent amongst them divers sores of flies, which devoured them: and frogs which destroyed them."},{"num":46,"verse":"And he gave up their fruits to the blast, and their labours to the locust."},{"num":47,"verse":"And he destroyed their vineyards with hail, and their mulberry trees with hoarfrost."},{"num":48,"verse":"And he gave up their cattle to the hail, and their stock to the fire."},{"num":49,"verse":"And he sent upon them the wrath of his indignation: indignation and wrath and trouble, which he sent by evil angels."},{"num":50,"verse":"He made a way for a path to his anger: he spared not their souls from death, and their cattle he shut up in death."},{"num":51,"verse":"And he killed all the firstborn in the land of Egypt: the firstfruits of all their labour in the tabernacles of Cham."},{"num":52,"verse":"And he took away his own people as sheep: and guided them in the wilderness like a flock."},{"num":53,"verse":"And he brought them out in hope, and they feared not: band the sea overwhelmed their enemies."},{"num":54,"verse":"And he brought them into the mountain of his sanctuary: the mountain which his right hand had purchased. And he cast out the Gentiles before them: and by lot divided to them their land by a line of distribution."},{"num":55,"verse":"And he made the tribes of Israel to dwell in their tabernacles."},{"num":56,"verse":"Yet they tempted, and provoked the most high God: and they kept not his testimonies."},{"num":57,"verse":"And they turned away, and kept not the covenant: even like their fathers they were turned aside as a crooked bow."},{"num":58,"verse":"They provoked him to anger on their hills: and moved him to jealousy with their graven things."},{"num":59,"verse":"God heard, and despised them, and he reduced Israel exceedingly as it were to nothing."},{"num":60,"verse":"And he put away the tabernacle of Silo, his tabernacle where he dwelt among men."},{"num":61,"verse":"And he delivered their strength into captivity: and their beauty into the hands of the enemy."},{"num":62,"verse":"And he shut up his people under the sword: and he despised his inheritance."},{"num":63,"verse":"Fire consumed their young men: and their maidens were not lamented."},{"num":64,"verse":"Their priests fell by the sword: and their widows did not mourn."},{"num":65,"verse":"And the Lord was awaked as one out of sleep, and like a mighty man that hath been surfeited with wine."},{"num":66,"verse":"And he smote his enemies on the hinder parts: he put them to an everlasting reproach."},{"num":67,"verse":"And he rejected the tabernacle of Joseph: and chose not the tribe of Ephraim:"},{"num":68,"verse":"But he chose the tribe of Juda, mount Sion which he loved."},{"num":69,"verse":"And he built his sanctuary as of unicorns, in the land which he founded for ever."},{"num":70,"verse":"And he chose his servant David, and took him from the flocks of sheep: he brought him from following the ewes great with young,"},{"num":71,"verse":"To feed Jacob his servant, and Israel his inheritance."},{"num":72,"verse":"And he fed them in the innocence of his heart: and conducted them by the skillfulness of his hands."}]