[{"num":77,"verse":"1 The Prophet in the Name of the Church rehearseth the greatness of his affliction, and his grievous temptations, 6 Whereby he was driven to this end to consider his former conversation, 11 and the continual course of God’s works in the preservation of his servants, and so he confirmeth his faith against these temptations."},{"num":1,"verse":"My voice came to God, when I cried: my voice came to God; and he heard me."},{"num":2,"verse":"In the day of my trouble I sought the Lord: my sore ran and ceased not in the night: my soul refused comfort."},{"num":3,"verse":"I did think upon God, and was troubled: I prayed, and my spirit was full of anguish. Selah."},{"num":4,"verse":"Thou keepest mine eyes waking: I was astonied, and could not speak."},{"num":5,"verse":"Then I considered the days of old: and the years of ancient time."},{"num":6,"verse":"I called to remembrance my song in the night: I communed with mine own heart, and my spirit searched diligently."},{"num":7,"verse":"Will the Lord absent himself forever? and will he show no more favor?"},{"num":8,"verse":"Is his mercy clean gone forever? doth his promise fail forevermore?"},{"num":9,"verse":"Hath God forgotten to be merciful? hath he shut up his tender mercies in displeasure? Selah."},{"num":10,"verse":"And I said, This is my death: yet I remembered the years of the right hand of the most High."},{"num":11,"verse":"I remembered the works of the Lord: certainly I remembered thy wonders of old."},{"num":12,"verse":"I did also meditate all thy works, and did devise of thine acts, saying,"},{"num":13,"verse":"Thy way, O God, is in the Sanctuary: who is so great a God, as our God!"},{"num":14,"verse":"Thou art the God that doest wonders; thou hast declared thy power among the people."},{"num":15,"verse":"Thou hast redeemed thy people with thine arm, even the sons of Jacob and Joseph. Selah."},{"num":16,"verse":"The waters saw thee, O God: the waters saw thee, and were afraid: yea, the depths trembled."},{"num":17,"verse":"The clouds poured out water: the heavens gave a sound: yea, thine arrows went abroad."},{"num":18,"verse":"The voice of thy thunder was round about; the lightnings lightened the world: the earth trembled and shook."},{"num":19,"verse":"Thy way is in the sea, and thy paths in the great waters, and thy footsteps are not known."},{"num":20,"verse":"Thou didst lead thy people like sheep by the hand of Moses and Aaron."}]