[{"header":"Comfort in Times of Trouble"},{"num":77,"verse":"My voice goes up to God, and I will cry out. My voice goes up to God and He will hear me. "},{"num":2,"verse":"I looked to the Lord when I was in trouble. I put out my hand at night, and it did not get tired. My soul would not be comforted. "},{"num":3,"verse":"When I remember God, then I am troubled. When I am in deep thought, then my spirit becomes weak. "},{"num":4,"verse":"You keep my eyes from closing. I am so troubled that I cannot speak. "},{"num":5,"verse":"I have thought about the days of old, the years of long ago. "},{"num":6,"verse":"I remember my song in the night. I think with my heart. And my spirit asks questions."},{"num":7,"verse":"Will the Lord turn away forever? Will He never show favor again? "},{"num":8,"verse":"Has His loving-kindness stopped forever? Has His promise come to an end for all time? "},{"num":9,"verse":"Has God forgotten to be loving and kind? Has He in anger taken away His loving-pity? "},{"num":10,"verse":"Then I said, “It is my sorrow that the right hand of the Most High has changed.”"},{"num":11,"verse":"I will remember the things the Lord has done. Yes, I will remember the powerful works of long ago. "},{"num":12,"verse":"I will think of all Your work, and keep in mind all the great things You have done. "},{"num":13,"verse":"O God, Your way is holy. What god is great like our God? "},{"num":14,"verse":"You are the God Who does great works. You have shown Your power among the people. "},{"num":15,"verse":"You have set free Your people, the sons of Jacob and Joseph, with Your strong arm."},{"num":16,"verse":"The waters saw You, O God. The waters saw You and shook. The sea shook also. "},{"num":17,"verse":"The clouds poured down water. The sky sounded with thunder. Your arrows of lightning went this way and that. "},{"num":18,"verse":"The sound of Your thunder was in the turning wind. The lightning lit up the world. The earth shook. "},{"num":19,"verse":"Your way was through the sea. Your paths went through the powerful waters. And it cannot be known where You stepped. "},{"num":20,"verse":"You led Your people like a flock by the hand of Moses and Aaron."}]