[{"num":77,"verse":"(For the one directing. Set to Yedutun. Mizmor of Asaph) I cried unto Elohim with my voice, even unto Elohim with my voice; and He gave ear unto me."},{"num":3,"verse":"In my yom tzoros (day of trouble) I sought Adonoi; my hand was stretched up in the lailah, and ceased not; my nefesh refused to be comforted."},{"num":4,"verse":"I remembered Elohim, and groaned; I pondered, and my ruach was overwhelmed. Selah."},{"num":5,"verse":"Thou holdest mine eyelids awake; I am so troubled that lo adaber (I cannot speak)."},{"num":6,"verse":"I have considered the yamim mikedem (days of old), the shnot olamim (years long past)."},{"num":7,"verse":"I called to remembrance my neginah balailah (song in the night); I communed with mine own lev; and my ruach pondered with diligent search."},{"num":8,"verse":"Will Adonoi cast off forever? And will He show favor no more?"},{"num":9,"verse":"Is His chesed passed away forever? Is His promise at an end l’dor vador?"},{"num":10,"verse":"Hath El (G-d) forgotten to be channot (gracious)? Hath He in anger shut up His rachamim (mercy)? Selah."},{"num":11,"verse":"And I said, This is my affliction; but I will remember the shanot of the Yemin Elyon (Right Hand of the Most High)."},{"num":12,"verse":"I will remember the deeds of Hashem; surely I will remember Thy wonders mikedem (of old, of long ago)."},{"num":13,"verse":"I will meditate also on kol po’al (all work) of Thine, and consider Thy mighty deeds."},{"num":14,"verse":"Thy Derech, O Elohim, is bakodesh (in holiness). Who is so gadol El as Elohim?"},{"num":15,"verse":"Thou art HaEl oseh peleh (the G-d that doest wonders); Thou hast declared Thy oz (strength) among the amim (peoples, nations)."},{"num":16,"verse":"Thou hast with Thine zero’a (strong arm) redeemed Thy people, the Bnei Ya’akov and Yosef. Selah."},{"num":17,"verse":"The mayim saw Thee, O Elohim, the mayim saw Thee; they were afraid; the tehomot (ocean depths) also writhed."},{"num":18,"verse":"The clouds poured down mayim; the skies resounded in thunder; Thine khitzim (arrows, i.e., lightning bolts) also went forth"},{"num":19,"verse":"The voice of Thy thunder was in the galgal (whirlwind); the lightning lit up the tevel (world); ha’aretz trembled and quaked."},{"num":20,"verse":"Thy derech is in the yam (sea), and Thy path is through the mayim rabbim (great waters), and Thy footsteps are not to be discerned."},{"num":21,"verse":"Thou didst lead Thy people like a tzon (flock) by the yad Moshe and Aharon."}]