[{"header":"King Solomon Prays for Wisdom(A)"},{"num":1,"verse":"Solomon, the son of King David, took firm control of the kingdom of Israel, and the Lord his God blessed him and made him very powerful."},{"num":2,"verse":"King Solomon gave an order to all the officers in charge of units of a thousand men and of a hundred men, all the government officials, all the heads of families, and all the rest of the people, "},{"num":3,"verse":"commanding them to go with him to the place of worship at Gibeon. They went there because that was where the Tent of the Lord's presence was located, which Moses, the Lord's servant, had made in the wilderness. "},{"num":4,"verse":"(The Covenant Box, however, was in Jerusalem, kept in a tent which King David had set up when he brought the Box from Kiriath Jearim.) "},{"num":5,"verse":"The bronze altar which had been made by Bezalel, the son of Uri and grandson of Hur, was also in Gibeon in front of the Tent of the Lord's presence. King Solomon and all the people worshiped the Lord there. "},{"num":6,"verse":"In front of the Tent the king worshiped the Lord by offering sacrifices on the bronze altar; he had a thousand animals killed and burned whole on it."},{"num":7,"verse":"That night God appeared to Solomon and asked, “What would you like me to give you?”"},{"num":8,"verse":"Solomon answered, “You always showed great love for my father David, and now you have let me succeed him as king. "},{"num":9,"verse":"O Lord God, fulfill the promise you made to my father. You have made me king over a people who are so many that they cannot be counted, "},{"num":10,"verse":"so give me the wisdom and knowledge I need to rule over them. Otherwise, how would I ever be able to rule this great people of yours?”"},{"num":11,"verse":"God replied to Solomon, “You have made the right choice. Instead of asking for wealth or treasure or fame or the death of your enemies or even for long life for yourself, you have asked for wisdom and knowledge so that you can rule my people, over whom I have made you king. "},{"num":12,"verse":"I will give you wisdom and knowledge. And in addition, I will give you more wealth, treasure, and fame than any king has ever had before or will ever have again.”"},{"header":"King Solomon's Power and Wealth(E)"},{"num":13,"verse":"So Solomon left the place of worship at Gibeon, where the Tent of the Lord's presence was, and returned to Jerusalem. There he ruled over Israel. "},{"num":14,"verse":"He built up a force of fourteen hundred chariots and twelve thousand cavalry horses. Some of them he kept in Jerusalem, and the rest he stationed in various other cities. "},{"num":15,"verse":"During his reign silver and gold became as common in Jerusalem as stone, and cedar was as plentiful as ordinary sycamore in the foothills of Judah. "},{"num":16,"verse":"The king's agents controlled the export of horses from Musri and Cilicia, "},{"num":17,"verse":"and the export of chariots from Egypt. They supplied the Hittite and Syrian kings with horses and chariots, selling chariots for 600 pieces of silver each and horses for 150 each."}]