[{"header":"Chapter 1"},{"num":1,"verse":"Solomon at Gibeon. Solomon, son of David, strengthened his hold on the kingdom, for the Lord, his God, was with him, making him ever greater. "},{"num":2,"verse":"Solomon summoned all Israel, the commanders of thousands and of hundreds, the judges, the princes of all Israel, and the family heads; "},{"num":3,"verse":"and, accompanied by the whole assembly, Solomon went to the high place at Gibeon, because the tent of meeting of God, made in the wilderness by Moses, the Lord’s servant, was there. "},{"num":4,"verse":"David had, however, brought up the ark of God from Kiriath-jearim to Jerusalem, where he had provided a place and pitched a tent for it; "},{"num":5,"verse":"the bronze altar made by Bezalel, son of Uri, son of Hur, he put in front of the tabernacle of the Lord. There Solomon and the assembly sought out the Lord, "},{"num":6,"verse":"and Solomon offered sacrifice in the Lord’s presence on the bronze altar at the tent of meeting; he sacrificed a thousand burnt offerings upon it."},{"num":7,"verse":"That night God appeared to Solomon and said to him: Whatever you ask, I will give you. "},{"num":8,"verse":"Solomon answered God: “You have shown great favor to David my father, and you have made me king to succeed him. "},{"num":9,"verse":"Now, Lord God, may your word to David my father be confirmed, for you have made me king over a people as numerous as the dust of the earth. "},{"num":10,"verse":"Give me, therefore, wisdom and knowledge to govern this people, for otherwise who could rule this vast people of yours?” "},{"num":11,"verse":"God then replied to Solomon: Because this has been your wish—you did not ask for riches, treasures, and glory, or the life of those who hate you, or even for a long life for yourself, but you have asked for wisdom and knowledge in order to rule my people over whom I have made you king— "},{"num":12,"verse":"wisdom and knowledge are given you. I will also give you riches, treasures, and glory, such as kings before you never had, nor will those who come after you."},{"num":13,"verse":"Solomon’s Wealth. Solomon returned to Jerusalem from the high place at Gibeon, from before the tent of meeting, and became king over Israel. "},{"num":14,"verse":"Solomon amassed chariots and horses: he had one thousand four hundred chariots and twelve thousand horses; these he allocated among the chariot cities and to the king’s service in Jerusalem. "},{"num":15,"verse":"The king made silver and gold as common in Jerusalem as stones, and cedars as numerous as the sycamores of the Shephelah. "},{"num":16,"verse":"Solomon’s horses were imported from Egypt and Cilicia, where the king’s agents purchased them at the prevailing price. "},{"num":17,"verse":"A chariot imported from Egypt cost six hundred shekels of silver, a horse one hundred and fifty shekels; so they were exported to all the Hittite and Aramean kings."},{"num":18,"verse":"Preparations for the Temple. Solomon gave orders for the building of a house for the name of the Lord and also a king’s house for himself."}]