[{"header":"Chapter 1"},{"num":1,"verse":"Solomon’s Wisdom. Solomon, the son of David, strengthened his hold on the kingdom, for the Lord his God was with him and made him exceedingly powerful."},{"num":2,"verse":"After summoning all Israel, Solomon addressed the commanders of units of thousands and hundreds, the judges, and all the leaders in Israel, the heads of families."},{"num":3,"verse":"Then, accompanied by the entire assembly, he went to the high place at Gibeon where God’s meeting tent was located, the tent that Moses, the servant of the Lord had made in the wilderness."},{"num":4,"verse":"However, David had brought up the Ark of the Covenant from Kiriath-jearim to the place that David had prepared for it, having pitched a tent for it in Jerusalem."},{"num":5,"verse":"In addition, the bronze altar that Bezalel, the son of Hur, had made was also there in front of the tabernacle of the Lord, and Solomon and the assembly frequently consulted him."},{"num":6,"verse":"Solomon also offered one thousand burnt offerings upon the bronze altar which was at the meeting tent."},{"num":7,"verse":"That night God appeared to Solomon and said to him: “Ask what you wish me to grant you.”"},{"num":8,"verse":"Solomon replied to God: “You have shown great and faithful love to my father, and you have granted me the privilege of succeeding him as king."},{"num":9,"verse":"O Lord God, let your promise to my father David now be fulfilled, for you have made me king over a people as numerous as the dust of the earth."},{"num":10,"verse":"Therefore, now grant me wisdom and knowledge to lead this people, for without your help who can rule this great people of yours?”"},{"num":11,"verse":"Then God replied to Solomon: “Since this is your heart’s desire and you have not asked for wealth or possessions or honor, or for the lives of those who are hostile to you, or even for a long life for yourself, but instead have asked for wisdom and knowledge for yourself so that you may govern my people over whom I have designated you to be king,"},{"num":12,"verse":"wisdom and knowledge will be granted to you. I will also give you riches, possessions, and glory such as no king before you has had and none after you shall be granted.”"},{"num":13,"verse":"Solomon’s Wealth. Then Solomon returned to Jerusalem from the meeting tent to the high place at Gibeon, and he reigned as king over Israel."},{"num":14,"verse":"He accumulated vast numbers of chariots and horses, amassing fourteen hundred chariots and twelve thousand horses. He stationed some in the chariot cities, and the rest with the king at Jerusalem."},{"num":15,"verse":"In Jerusalem the king made silver and gold as common as stones, and he made cedars as plentiful as the sycamores in the lowlands."},{"num":16,"verse":"Solomon’s horses were imported from Egypt and Cilicia, obtained by the king’s traders from Cilicia at the prevailing price."},{"num":17,"verse":"The traders would import chariots from Egypt for six hundred shekels apiece, and horses from Cilicia for one hundred and fifty shekels apiece. They also exported them to all the kings of the Hittites and the Arameans."}]