[{"header":"Solomon Asks God for Wisdom"},{"num":1,"verse":"Solomon was the son of David. Solomon made his position secure over his kingdom. The Lord his God was with him. He made Solomon very great."},{"num":2,"verse":"Solomon spoke to the whole community of Israel. He spoke to the commanders of thousands of men and commanders of hundreds. He spoke to the judges and all the leaders in Israel. He spoke to the leaders of Israel’s families. "},{"num":3,"verse":"Solomon and the whole community went to the high place at Gibeon. That’s because God’s tent of meeting was there. The Lord’s servant Moses had made the tent in the desert. "},{"num":4,"verse":"David had carried up the ark of God from Kiriath Jearim. He had it brought to the place he had prepared for it. He had set up a tent for it in Jerusalem. "},{"num":5,"verse":"But the bronze altar that Bezalel had made was in Gibeon. Bezalel was the son of Uri. Uri was the son of Hur. The altar was in front of the Lord’s holy tent. So Solomon and the whole community asked the Lord for advice in Gibeon. "},{"num":6,"verse":"Solomon went up to the bronze altar in front of the Lord at the tent of meeting. Solomon sacrificed 1,000 burnt offerings on the altar."},{"num":7,"verse":"That night God appeared to Solomon. He said to him, “Ask for anything you want me to give you.”"},{"num":8,"verse":"Solomon answered God, “You were very kind to my father David. Now you have made me king in his place. "},{"num":9,"verse":"Lord God, let the promise you gave to my father David come true. You have made me king. My people are as many as the dust of the earth. They can’t be counted. "},{"num":10,"verse":"Give me wisdom and knowledge. Then I’ll be able to lead these people. Without your help, who would be able to rule this great nation of yours?”"},{"num":11,"verse":"God said to Solomon, “I am glad that those are the things you really want. You have not asked for wealth, possessions or honor. You have not even asked to have your enemies killed. You have not asked to live for a long time. Instead, you have asked for wisdom and knowledge. You want to be able to rule my people wisely. I have made you king over them. "},{"num":12,"verse":"So wisdom and knowledge will be given to you. I will also give you wealth, possessions and honor. You will have more than any king before you ever had. And no king after you will have as much.”"},{"num":13,"verse":"Then Solomon left the high place at Gibeon. He went from the tent of meeting there to Jerusalem. And he ruled over Israel."},{"num":14,"verse":"Solomon had 1,400 chariots and 12,000 horses. He kept some of them in the chariot cities. He kept others with him in Jerusalem. "},{"num":15,"verse":"The king made silver and gold as common in Jerusalem as stones. He made cedar wood as common there as sycamore-fig trees in the western hills. "},{"num":16,"verse":"Solomon got horses from Egypt and Kue. The king’s buyers purchased them from Kue at the current price. "},{"num":17,"verse":"They could get a chariot from Egypt for 15 pounds of silver. They could get a horse for less than four pounds of silver. They sold horses and chariots to all the Hittite and Aramean kings."}]