[{"num":1,"verse":"Solomon the son of David became a strong king. The Lord his God was with him, and gave him much honor. "},{"num":2,"verse":"Solomon spoke to all Israel. He spoke to the leaders of thousands and of hundreds. He spoke to the men who judge and to every leader in all Israel, the heads of fathers’ houses. "},{"num":3,"verse":"Then Solomon and all the people with him went to a place of worship at Gibeon where God’s meeting tent was. It was the tent which Moses the servant of the Lord had made in the desert. "},{"num":4,"verse":"(But David had brought up the special box of God from Kiriath-jearim to the place he had made ready for it. For he had set up a tent for it in Jerusalem.) "},{"num":5,"verse":"Now the brass altar was there in front of the meeting tent of the Lord. It was the altar which was made by Bezalel the son of Uri, the son of Hur. Solomon and the people worshiped the Lord there. "},{"num":6,"verse":"Solomon went before the Lord to the brass altar at the meeting tent. And he gave a thousand burnt gifts on it."},{"num":7,"verse":"That night God showed Himself to Solomon and said to him, “Ask Me for anything and I will give it to you.” "},{"num":8,"verse":"Solomon said to God, “You have acted toward my father David with great loving-kindness. And You have made me king in his place. "},{"num":9,"verse":"Now, O Lord God, Your promise to my father David has come true. For You have made me king over as many people as the dust of the earth. "},{"num":10,"verse":"Now give me wisdom and much understanding, that I may lead these people. For who can rule this great nation of Yours?” "},{"num":11,"verse":"God said to Solomon, “You have not asked for riches, much money, or honor, or the life of those who hate you. And you have not asked for a long life for yourself. But you have asked for wisdom and much understanding, that you may rule My people over whom I have made you king. Because this was in your heart, "},{"num":12,"verse":"wisdom and much understanding have been given to you. And I will give you riches and much money and honor. You will have more than all the kings who were before you, and more than all who will come after you.”"},{"header":"Solomon’s Power and Riches"},{"num":13,"verse":"So Solomon went from the place of worship at Gibeon, from the meeting tent to Jerusalem. There he ruled over Israel."},{"num":14,"verse":"Solomon gathered together war-wagons and horsemen. He had 1,400 war-wagons and 12,000 horsemen. And he kept some of them in the war-wagon cities, and some with him in Jerusalem. "},{"num":15,"verse":"The king made silver and gold as easy to find in Jerusalem as stones. He made cedar trees as easy to find as sycamore trees in the valley. "},{"num":16,"verse":"Solomon’s horses were brought in from Egypt and Kue. The men who traded for the king received them from Kue for a special price. "},{"num":17,"verse":"They paid 600 pieces of silver for each war-wagon brought in from Egypt and 150 pieces of silver for each horse. They also sold them to all the kings of the Hittites and the kings of Aram."}]