[{"num":18,"verse":"Some people like to do things their own way, and they get upset when people give them advice."},{"num":2,"verse":"Fools don’t want to learn from others. They only want to tell their own ideas."},{"num":3,"verse":"Do something evil, and people will hate you. Do something shameful, and they will have no respect for you."},{"num":4,"verse":"Words from wise people are like water bubbling up from a deep well—the well of wisdom."},{"num":5,"verse":"You must be fair in judging others. It is wrong to favor the guilty and rob the innocent of justice."},{"num":6,"verse":"Fools say things to start arguments. They are just asking for a beating."},{"num":7,"verse":"Fools hurt themselves when they speak. Their own words trap them."},{"num":8,"verse":"People love to hear gossip. It is like tasty food on its way to the stomach."},{"num":9,"verse":"Someone who does careless work is as bad as someone who destroys things."},{"num":10,"verse":"The name of the Lord is like a strong tower. Those who do what is right can run to him for protection."},{"num":11,"verse":"The rich think their wealth will protect them. They think it is a strong fortress."},{"num":12,"verse":"A proud person will soon be ruined, but a humble person will be honored."},{"num":13,"verse":"Let people finish speaking before you try to answer them. That way you will not embarrass yourself and look foolish."},{"num":14,"verse":"A good attitude will support you when you are sick, but if you give up, nothing can help."},{"num":15,"verse":"Wise people want to learn more, so they listen closely to gain knowledge."},{"num":16,"verse":"Gifts can open many doors and help you meet important people."},{"num":17,"verse":"The first person to speak always seems right until someone comes and asks the right questions."},{"num":18,"verse":"The best way to settle an argument between two powerful people may be to use lots."},{"num":19,"verse":"An insulted brother is harder to win back than a city with strong walls. Arguments separate people like the strong bars of a palace gate."},{"num":20,"verse":"Your words can be as satisfying as fruit, as pleasing as the food that fills your stomach."},{"num":21,"verse":"The tongue can speak words that bring life or death. Those who love to talk must be ready to accept what it brings."},{"num":22,"verse":"If you find a wife, you have found something good. She shows that the Lord is happy with you."},{"num":23,"verse":"The poor are polite when they beg for help. The rich are rude with their answer."},{"num":24,"verse":"Some friends are fun to be with, but a true friend can be better than a brother."}]