[{"num":18,"verse":"A man who separates himself seeks his own ta’avah (desire); he defies all tushiyyah (wisdom, sound judgment)."},{"num":2,"verse":"A kesil (fool) hath no delight in tevunah (understanding), but only in airing out his lev (mind, opinions)."},{"num":3,"verse":"When the rashah cometh, then cometh also contempt, and with dishonor, cherpah (reproach, disgrace)."},{"num":4,"verse":"The devarim of a man’s mouth are deep mayim; the makor chochmah is a flowing stream."},{"num":5,"verse":"It is not tov to show partiality to the rashah, to subvert the tzaddik in mishpat."},{"num":6,"verse":"The sfatayim (lips) of a kesil enter into contention, and his peh (mouth) inviteth blows."},{"num":7,"verse":"The peh (mouth) of a kesil is his undoing, and his sfatayim (lips) are the mokesh (snare) of his nefesh."},{"num":8,"verse":"The devarim of a nirgan (gossip, talebearer, slanderer) are like mitlachamim (delicious tidbits), and they go down into the innermost parts of the beten (belly)."},{"num":9,"verse":"He also that is slack in his work is brother to him that is ba’al mashchit (master of destruction)."},{"num":10,"verse":"The Shem of Hashem is a strong migdal (tower), the tzaddik runneth into it, and is safe."},{"num":11,"verse":"The oisher’s wealth is his strong city, and is a high chomah in his own conceit."},{"num":12,"verse":"Before shever (destruction) the lev ish is haughty, and before kavod is anavah (humility)."},{"num":13,"verse":"He that answereth a matter before he heareth it, it is folly and kelimmah (reproach, shame) unto him."},{"num":14,"verse":"The ruach ish will sustain him in sickness, but a crushed ruach who can bear?"},{"num":15,"verse":"The lev of the prudent acquireth da’as, and the ozen of the chachamim seeketh da’as."},{"num":16,"verse":"The mattan adam (gift of a man) openeth the way for him, and bringeth him before gedolim."},{"num":17,"verse":"He that is harishon (the first) to make his case seemeth tzaddik, but his re’a cometh and doth cross-examine him."},{"num":18,"verse":"The goral (lot) causeth contentions to cease, and keepeth the mighty apart."},{"num":19,"verse":"A brother offended is harder to be won than a strong city, and their contentious quarrelings are like the bars of an armon (citadel)."},{"num":20,"verse":"An ish’s beten shall be filled with the fruit of his peh (mouth), and with the produce of his sfatayim (lips) shall he be satisfied."},{"num":21,"verse":"Mavet and chayyim are in the power of the lashon, and they that love it shall eat the p’ri (fruit) thereof."},{"num":22,"verse":"He who findeth an isha (wife) findeth tov, and obtaineth ratzon (favor) from Hashem."},{"num":23,"verse":"The poor useth entreaties, but the oisher answereth roughly."},{"num":24,"verse":"An ish of many companions may come to ruin, but there is an ohev (friend) that sticketh closer than a brother."}]