[{"num":18,"verse":"For [an object of] desire he who is separated doth seek, With all wisdom he intermeddleth."},{"num":2,"verse":"A fool delighteth not in understanding, But -- in uncovering his heart."},{"num":3,"verse":"With the coming of the wicked come also hath contempt, And with shame -- reproach."},{"num":4,"verse":"Deep waters [are] the words of a man's mouth, The fountain of wisdom [is] a flowing brook."},{"num":5,"verse":"Acceptance of the face of the wicked [is] not good, To turn aside the righteous in judgment."},{"num":6,"verse":"The lips of a fool enter into strife, And his mouth for stripes calleth."},{"num":7,"verse":"The mouth of a fool [is] ruin to him, And his lips [are] the snare of his soul."},{"num":8,"verse":"The words of a tale-bearer [are] as self-inflicted wounds, And they have gone down [to] the inner parts of the heart."},{"num":9,"verse":"He also that is remiss in his work, A brother he [is] to a destroyer."},{"num":10,"verse":"A tower of strength [is] the name of Jehovah, Into it the righteous runneth, and is set on high."},{"num":11,"verse":"The wealth of the rich [is] the city of his strength, And as a wall set on high in his own imagination."},{"num":12,"verse":"Before destruction the heart of man is high, And before honour [is] humility."},{"num":13,"verse":"Whoso is answering a matter before he heareth, Folly it is to him and shame."},{"num":14,"verse":"The spirit of a man sustaineth his sickness, And a smitten spirit who doth bear?"},{"num":15,"verse":"The heart of the intelligent getteth knowledge, And the ear of the wise seeketh knowledge."},{"num":16,"verse":"The gift of a man maketh room for him, And before the great it leadeth him."},{"num":17,"verse":"Righteous [is] the first in his own cause, His neighbour cometh and hath searched him."},{"num":18,"verse":"The lot causeth contentions to cease, And between the mighty it separateth."},{"num":19,"verse":"A brother transgressed against is as a strong city, And contentions as the bar of a palace."},{"num":20,"verse":"From the fruit of a man's mouth is his belly satisfied, [From the] increase of his lips he is satisfied."},{"num":21,"verse":"Death and life [are] in the power of the tongue, And those loving it eat its fruit."},{"num":22,"verse":"[Whoso] hath found a wife hath found good, And bringeth out good-will from Jehovah."},{"num":23,"verse":"[With] supplications doth the poor speak, And the rich answereth fierce things."},{"num":24,"verse":"A man with friends [is] to show himself friendly, And there is a lover adhering more than a brother!"}]