[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(14) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "All the days of his life.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—This ends the section, as appears by comparison with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 3:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Observe that Joshua’s position, as equal to Moses in the respect of the people, dates from the passage of Jordan, a fact not to be forgotten in considering his Antitype.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Joshua 4:14",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 4:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "On that day the Lord magnified Joshua — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Both by the fellowship he admitted him to with himself, speaking to him on all occasions, and being ready to be consulted by him, and by the miracle which had just given happy success to that general’s first enterprise, and which had acquired to him the same confidence and respect from the Israelites which Moses had before acquired from the miraculous passage of the Red sea: thus did the Lord, in a glorious manner, accomplish the promises made to Joshua in the foregoing chapter, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 4:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "4:10-19 The priests with the ark did not stir till ordered to move. Let none be weary of waiting, while they have the tokens of God's presence with them, even the ark of the covenant, though it be in the depths of adversity. Notice is taken of the honour put upon Joshua. Those are feared in the best manner, and to the best purpose, who make it appear that God is with them, and that they set him before them.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The plains of Jericho, consisting of the higher terrace of the Jordan valley, are almost seven miles broad. The mountains of Judaea here recede somewhat from the river, and leave a level and fertile space, which, at the time of Joshua's invasion, was principally occupied by a forest of palms. Hence, the name \"city of palms,\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 34:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Jos 4:14-24. God Magnifies Joshua.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "14-17. On that day the Lord magnified Joshua in the sight of all Israel—It appeared clear from the chief part he acted, that he was the divinely appointed leader; for even the priests did not enter the river or quit their position, except at his command; and thenceforward his authority was as firmly established as that of his predecessor.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "On that day the Lord magnified Joshua in the sight of Israel,.... Made him great and honourable in their esteem, by doing what he foretold would be done, dividing the waters of Jordan, drying up the river to make a passage for them through it, as on dry land: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and they feared him, as they feared Moses, all the days of his life; had a reverend esteem of him, and affection for him, and yielded obedience to him all his days; see Exodus 14:31. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and they feared him, as they feared Moses, all the days of his life; had a reverend esteem of him, and affection for him, and yielded obedience to him all his days; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 14:31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "On that day the LORD magnified Joshua in the sight of all Israel; and they feared him, as they feared Moses, all the days of his life.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 14.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "On that day the Lord magnified Joshua.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " This was not, as Calvin remarks, the chief aim of the miracle. But it was, nevertheless, one important result of it. Joshua was the appointed leader of the Israelites, and he was under God's special protection and guidance. But however much God may overrule our human nature to His own purposes, He never abrogates the laws of its working. Confidence in a leader, from a human point of view, is one of the most essential requisites for success in war. Therefore in the crossing of the Jordan we find Joshua directing all the operations, though the direction of affairs might have been put into other hands, that of Eleazar the high priest, for instance. But this was the public attestation of the secret intimation God had given Joshua (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 1:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "): \"As I was with Moses, so will I be with thee: I will not fail thee nor forsake thee.\" From this point onward we see no signs of hesitation on the part of the Israelites; nothing but the most unwavering confidence in the Divine mission, as well as in the extraordinary natural gifts, of their leader. Joshua 4:14",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The account of the fighting men of the tribes on the east of the Jordan passing over along with them, in number about 40,000, is added as a supplement, because there was no place in which it could be appropriately inserted before, and yet it was necessary that it should be expressly mentioned that these tribes performed the promise they had given (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 1:16-17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and in what manner they did so. The words וגו ויּעברוּ do not imply that these 40,000 men crossed over behind the priests with the ark, which would not only be at variance with the fact so expressly stated, that the ark of the covenant was the medium of the miraculous division of the water, but also with the distant statement in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 4:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", that when the priests, with the ark, set their feet upon the dry land, the waters filled the river again as they had done before. The imperfect with vav consec. here expresses simply the order of thought, and not of time. \"Arboth Jericho,\" the steppes of Jericho, were that portion of the Arabah or Ghor which formed the environs of Jericho, and which widens here into a low-lying plain of about three and a half or four hours' journey in breadth, on account of the western mountains receding considerably to the south of the opening of the Wady Kelt (Rob. Pal. ii. pp. 263ff.). - In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 4:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the writer mentions still further the fact that the Lord fulfilled His promise (in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 3:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and by means of this miracle so effectually confirmed the authority of Joshua in the eyes of Israel, that the people feared him all the days of his life as they had feared Moses. \"This was not the chief end of the miracle, that Joshua increased in power and authority; but since it was a matter of great importance, so far as the public interests were concerned, that the government of Joshua should be established, it is very properly mentioned, as an addition to the benefits that were otherwise conferred, that he was invested as it were with sacred insignia, which produced such a felling of veneration among the people, that no one dared to treat him with disrespect\" (Calvin). ",
        "children": []
      }
    ]
  }
]