[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(16) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I will not contend for ever . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The words come as a message of comfort to the penitent who is still bearing the chastisement of his sins. The time during which God “contends” with him as an accuser and a judge has its limits. Were it not so. the souls which he had made would be utterly consumed, and His purpose in creation would be frustrated. The words seem like an echo of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 6:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 8:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". (Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 103:9-10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "57:13-21 The idols and their worshippers shall come to nothing; but those who trust in God's grace, shall be brought to the joys of heaven. With the Lord there is neither beginning of days, nor end of life, nor change of time. His name is holy, and all must know him as a holy God. He will have tender regard to those who bring their mind to their condition, and dread his wrath. He will make his abode with those whose hearts he has thus humbled, in order to revive and comfort them. When troubles last long, even good men are tempted to entertain hard thoughts of God. Therefore He will not contend for ever, for he will not forsake the work of his own hands, nor defeat the purchase of his Son's blood. Covetousness is a sin that particularly lays men under the Divine displeasure. See the sinfulness of sin. See also that troubles cannot reform men unless God's grace work in them. Peace shall be published, perfect peace. It is the fruit of preaching lips, and praying lips. Christ came and preached peace to Gentiles, as well as to the Jews; to after-ages, who were afar off in time, as well as to those of that age. But the wicked would not be healed by God's grace, therefore would not be healed by his comforts. Their ungoverned lusts and passions made them like the troubled sea. Also the terrors of conscience disturbed their enjoyments. God hath said it, and all the world cannot unsay it, That there is no peace to those who allow themselves in any sin. If we are recovered from such an awful state, it is only by the grace of God. And the influences of the Holy Spirit, and that new heart, from whence comes grateful praise, the fruit of our lips, are his gift. Salvation, with all its fruits, hopes, and comforts, is his work, and to him belongs all the glory. There is no peace for the wicked man; but let the wicked forsake his way, and the unrighteous man his thoughts; and let him return to the Lord, and he will have mercy upon him, and to our God, and he will abundantly pardon.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "For I will not contend for ever - I will not be angry with my people forever, nor always refuse to pardon and comfort them (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 103:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). This is to be regarded as having been primarily addressed to the Jews in their long and painful exile in Babylon. It is, however, couched in general language; and the idea is, that although God would punish his people for their sins, yet his wrath would not be perpetual. If they were his children, he would visit them again in mercy, and would restore to them his favor.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "For the spirit should fail before me - Critics have taken a great deal of pains on this part of the verse, which they suppose to be very obscure. The simple meaning seems to be, that if God should continue in anger against people they would be consumed. The human soul could not endure a long-continued controversy with God. Its powers would fail; its strength decay; it must sink to destruction. As God did not intend this in regard to his own people; as he meant that his chastisements should not be for their destruction, but for their salvation; and as he knew how much they could bear, and how much they needed, he would lighten the burden, and restore them to his favor. And the truth taught here is, that if we are his children, we are safe. We may suffer much and long. We may suffer so much that it seems scarcely possible that we should endure more. But he knows how much we can bear; and he will remove the lead, so that we shall not be utterly crushed. A similar sentiment is found in the two following elegant passages of the Psalms, which are evidently parallel to this, and express the same idea:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "But he being full of compassion,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Forgave their iniquity, and destroyed them not;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Yea many a time burned he his anger away,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And did not stir up all his wrath.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "For he remembered that they were but flesh;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "A wind that passeth away and returneth not again.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "A wind that passeth away and returneth not again.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "16. For—referring to the promise in Isa 57:14, 15, of restoring Israel when \"contrite\" (Ge 6:3; 8:21; Ps 78:38, 39; 85:5; 103:9, 13, 14; Mic 7:18). God \"will not contend for ever\" with His people, for their human spirit would thereby be utterly crushed, whereas God's object is to chasten, not to destroy them (La 3:33, 34; Mic 7:8, 9). With the ungodly He is \"angry every day\" (Ps 7:11; Re 14:11).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "spirit … before me—that is, the human spirit which went forth from Me (Nu 16:22), answering to \"which I have made\" in the parallel clause.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I will not contend for ever; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " I will not constantly proceed to the utmost severity with sinful men in this life, and therefore I will put an end to the miseries of the Jews, and turn their captivity. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "For the spirit should fail before me, and the souls which I have made; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for then their spirits would sink and die under my stroke, and I should do nothing else but destroy the works of mine own hands. Therefore I consider their infirmity, and spare them. Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 78:38,39 103:13,14",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 78:38",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",39 103:13,14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "For I will not contend for ever,.... By afflictive providences; with the humble and contrite, the end being in a great measure answered by their humiliation and contrition; when God afflicts his people, it shows that he has a controversy with them, for their good, and his own glory; and when these ends are obtained, he will carry it on no longer: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "neither will I be always wroth; as he seems to be in the apprehensions of his people, when he either hides his face from them, or chastises them with a rod of affliction: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for the spirit should fail before me; the spirit of the afflicted, which not being able to bear up any longer under the affliction, would sink and faint, or be \"overwhelmed\", as the word (c) signifies: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the souls which I have made; which are of God's immediate creation, and which are also renewed by his grace, and made new creatures. The proselytes Abraham made are called the souls he made in Haran, Genesis 12:5, much more may this be said of the Father of spirits, the author both of the old and new creation. The Lord knowing the weakness of the human frame, therefore restrains his hand, or moderates or removes the affliction; see a like reason in Psalm 78:38, the last days of trouble to God's people, which will be the time of the slaying of the witnesses, will be such that if they are not shortened, no flesh can be saved, but for the elect's sake they will be shortened, Matthew 24:22. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and the souls which I have made; which are of God's immediate creation, and which are also renewed by his grace, and made new creatures. The proselytes Abraham made are called the souls he made in Haran, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 12:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", much more may this be said of the Father of spirits, the author both of the old and new creation. The Lord knowing the weakness of the human frame, therefore restrains his hand, or moderates or removes the affliction; see a like reason in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 78:38",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the last days of trouble to God's people, which will be the time of the slaying of the witnesses, will be such that if they are not shortened, no flesh can be saved, but for the elect's sake they will be shortened, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 24:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) \"obrueretur\", Junius & Tremellius, Vitriuga; \"in deliquium incideret\", Piscator, Gataker. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(c) \"obrueretur\", Junius & Tremellius, Vitriuga; \"in deliquium incideret\", Piscator, Gataker. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "For I will not contend for ever, neither will I be always angry: {s} for the spirit should fail before me, and the souls which I have made.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "For I will not contend for ever, neither will I be always angry: ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{s}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " for the spirit should fail before me, and the souls ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "which",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " I have made.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(s) I will not use my power against frail man, whose life is but a blast.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Hardly less remarkable is the motive here assigned for the Divine clemency,—Jehovah’s compassion for the frailty of His creatures (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 103:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 103:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " f., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 78:39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The argument somewhat resembles that of ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 45:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff.: it cannot be Jehovah’s purpose to undo His own creation. The continuance of His anger would annihilate the souls which He Himself has made; therefore when chastisement has produced the contrite and humble spirit, He relents and shews mercy.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The word for ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "souls",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is that which in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 2:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " means “breath (of life),” the principle of life in virtue of which man becomes “a living person” (cf. ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 42:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The parallel ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "spirit",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " has the same sense; it is the Divine power by which human life is sustained.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 16.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "I will",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "not contend for ever.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " God \"will not always chide, neither will he keep his anger for ever\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 103:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). If he were \"extreme to mark what is done amiss,\" none could abide it (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 130:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). He remits somewhat, therefore, from the claims of strict justice, and is content to take lower ground. Were it otherwise, man's spirit should fail before him. Man, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", would be utterly unable to justify himself, and would faint and fade away before the Divine fury. The souls which God has made would, one and all, perish. He, however, has not made them for this purpose, but that they should live (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 30:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 18:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); and has therefore devised for them a way of salvation (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 53:5-10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Isaiah 57:16",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The compassion, by virtue of which God has His abode and His work of grace in the spirit and heart of the penitent, is founded in that free anticipating love which called man and his self-conscious spirit-soul into being at the first. \"For I do not contend for ever, and I am not angry for ever: for the spirit would pine away before me, and the souls of men which I have created.\" The early translators (lxx, Syr., Jer., possibly also the Targum) give to יעטף the meaning egredietur, which certainly cannot be established. And so also does Stier, so far as the thought is concerned, when he adopts the rendering, \"A spirit from me will cover over, and breath of life will I make;\" and so Hahn, \"When the spirit pines away before me, I create breath in abundance.\" But in both cases the writer would at any rate have used the perf. consec. ועשׂיתי, and the last clause of the v. has not the syntactic form of an apodosis. The rendering given above is the only one that is unassailable both grammatically and in fact. כּי introduces the reason for the self-limitation of the divine wrath, just as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 78:38-39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cf., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 103:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "): if God should put no restraint upon His wrath, the consequence would be the entire destruction of human life, which was His creative work at first. The verb עטף, from its primary meaning to bend round (Comm. on Job, at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 23:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), has sometimes the transitive meaning to cover, and sometimes the meaning to wrap one's self round, i.e., to become faint or weak (compare עטוּף, fainted away, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Lamentations 2:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and התעטּף in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 142:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which is applied to the spirit, like the kal here). מלּפני is equivalent to \"in consequence of the wrath proceeding from me.\" נשׁמות (a plural only met with here) signifies, according to the fixed usage of the Old Testament (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 2:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 42:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), the souls of men, the origin of which is described as a creation in the attributive clause (with an emphatic אני), just as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 38:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cf., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 12:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Whether the accents are intended to take עשׂיתי אני in this attributive sense or not, cannot be decided from the tiphchah attached to ונשׁמות. The prophet, who refers to the flood in other passages also (e.g., ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 54:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), had probably in his mind the promise given after the flood, according to which God would not make the existing and inherited moral depravity an occasion for utterly destroying the human race. ",
        "children": []
      }
    ]
  }
]