[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Job 18:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 18:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "How long will it be ere you wake an end ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— How long shall we continue this dispute? Why do not you, my brethren, give over discoursing with Job, who is so transported by his passions, as not to be fit to be discoursed with? At least, forbear to proceed till both you and he shall better understand the subject? For, if Bildad be considered as addressing himself to his two companions, he must have meant to reprove them for making use of too long discourses, and to advise them first to consider the subject well, and then to speak directly to the purpose. But many commentators understand him as addressing Job; using here, as also ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 18:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the plural number, according to the common idiom of the eastern language: which was to speak thus to, or of one person, especially if he were of great eminence. In this case he must have intended to censure Job for puzzling the cause with cavils and exceptions, and to call upon him to produce a plain instance, in which a righteous man was known to have had punishment inflicted on him, or else to own the truth of the established maxim, that punishment was a sure mark of wickedness. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Mark, and afterward we will speak — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Consider the matter better, and then we shall speak concerning it to more advantage. Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "inform ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "us: Hebrew ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "תבינו",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "tabinu, make us to understand. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Seeing thou lookest upon us as ignorant and brutish men, as it follows, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 18:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", do thou instruct and inform us. Cease cavilling, and produce thy strong reasons, that we may consider and yield to their weight, or answer them.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "18:1-4 Bildad had before given Job good advice and encouragement; here he used nothing but rebukes, and declared his ruin. And he concluded that Job shut out the providence of God from the management of human affairs, because he would not admit himself to be wicked.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "How long will it be ere ye make an end of words? - It has been made a question to whom this is addressed. It is in the plural number, and it is not usual in Hebrew when addressing an individual to make use of the plural form. Some have supposed that it is addressed to Job and to Eliphaz, as being both \"long-winded\" and tedious in their remarks. Others have supposed that it refers to Job \"and the members of his family,\" who possibly interposed remarks, and joined Job in his complaints. Others suppose that it refers to Eliphaz and Zophar, as being silent during the speech of Job, and not arresting his remarks as they ought to have done. Rosenmuller supposes that it refers to Job and those similar to him, who were mere feigners of piety, and that Bildad means to ask how long it would be before they would be effectually silenced, and their complaints hushed. I see no great difficulty in supposing that the reference is to Job. The whole strain of the discourse evidently supposes it; and there is no evidence that any of the family of Job had spoken, nor does it seem at all probable that Bildad would reprove his own friends either for the length of their speeches, or for not interrupting an other. The custom in the East is to allow a man to utter all that he has to say without interruption.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Mark - Hebrew understand; or be intelligent - תבינו  tābı̂ynû; that is, either speak distinctly, clearly, intelligently; or consider and weigh our arguments. The former is the interpretation of Schultens, and seems to me to be the true one. The idea is this: \"You, Job, have been altering mere words. They are words of complaint, without argument. Speak now in a different manner; show that you understand the case; advance arguments that are worthy of attention, and then we will reply.\" ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Mark - Hebrew understand; or be intelligent - תבינו  tābı̂ynû; that is, either speak distinctly, clearly, intelligently; or consider and weigh our arguments. The former is the interpretation of Schultens, and seems to me to be the true one. The idea is this: \"You, Job, have been altering mere words. They are words of complaint, without argument. Speak now in a different manner; show that you understand the case; advance arguments that are worthy of attention, and then we will reply.\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2. ye—the other two friends of Job, whom Bildad charges with having spoken mere \"words,\" that is, empty speeches; opposed to \"mark,\" that is, come to reason, consider the question intelligently; and then let us speak.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ere ye; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " either, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. You my brethren. Why do you not give over discoursing with Job, who is wholly transported with rage, and not fit to be discoursed with, at least until both you and he have better considered what to say? Or rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. Thou, O Job, of whom he speaks here, as also ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Job 18:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 18:3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", in the plural number; either because there were some other person or persons present at this debate, who by their words or gestures showed themselves favourers of Job’s cause; or because it was a common idiom of the Eastern language to speak thus of one person, especially where he was one of eminency or authority. Job’s speeches were generally longer than his friends’, and they seemed very tedious to them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Mark; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " consider the matter and our words better. Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "inform us",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "make us to understand",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Seeing thou lookest upon us as ignorant and brutish men, as it follows, do thou instruct and inform us. Cease cavilling and railing, and produce thy strong reasons, that we may consider and answer them, or yield to them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "How long will it be ere ye make an end of words?.... Because these words are expressed the plural number, some think more persons than one are addressed, either Eliphaz and Job together, who are complained of as taking up all the time, and having all the talk to themselves, that another could scarce put in a word; Bildad could say this with a better grace, because his discourses were but short; or else all his friends, whom he blames for not stopping Job's mouth at once, and for lengthening out the dispute with him; as if he should say, why are you so complaisant to him, to wait till he has done speaking, before you reply? why do not you, without any ceremony, interrupt him, and not suffer him to go on with his prate, a man that is so insufferably rude as to reckon us all as beasts? and to what purpose is it to talk to such a man, that is so hardened and incorrigible, so proud and conceited? it is all labour in vain, and mere beating the air; it is high time to have done talking, and to put an end to the dispute, when things are such a pass with him as they are: or else the words are directed to Job, and his friends that were with him, who might now and then speak a word in his behalf, though their words are not recorded; or, however, by their looks or gestures might show their approbation of Job's defences: that there were others present besides Job and his three friends, it is probable; yea, it is certain that Elihu was present all the while, but he was not altogether of Job's mind; nor does it appear that he had any to take his part, for his brethren, acquaintance, kinsfolk, and familiar friends, stood at a distance from him, and his maids and menservants used him ill; and even his own wife was not very kind to him, as he declares in the following chapter; wherefore it seems best of all to understand these words as spoken to Job alone, the plural being used for the singular, according to the idiom of the tongue in which they were spoken, and so are a charge of loquacity against him for talking too much, and too long, unless it had been to better purpose; and in like manner Bildad begins his first reply to Job, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 8:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; a late interpreter renders the words, \"how long will you lay snares with words\" (e)? use cautious words, set snares with words to catch, lie upon the catch, and lay hold upon a word, and improve it to disadvantage, which is imprudently or inadvertently dropped: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "mark, and afterwards we will speak; or \"let us speak\" (f); after we have well considered things, got a right understanding of them, and thoroughly digested them, and have well concerted things, and have thought very closely what reply to make to them; and so the words are a tacit reflection of Bildad's on his other two friends, that they spoke before they thought, and therefore some things impertinently, which Job took the advantage of against them; wherefore it would be right, for the future, to mark and consider things well beforehand, and then speak, as they then would with greater propriety, and more to the purpose: public speakers especially, or such who are engaged in public service, or in a public dispute, should meditate beforehand what to say, lest they deliver what is crude and undigested, and may be turned against them. Our Lord indeed directed his disciples, when called before kings and, governors for his sake, not to premeditate what they should answer; but that was an extraordinary case, and they were promised to have extraordinary assistance, whereby some great ends were to be answered, the confusion of their enemies, and the confirmation of the Christian religion. But the words seem rather directed to Job, and to carry in them a charge of inattention to what was said to him by his friends; and therefore Bildad exhorts him to mark and observe what they said to him, to listen attentively to that, and well consider it, and then it would be an encouragement to them to proceed in discoursing with him. Job is represented like some hearers, that stop their ears to the voice of the charmer charming ever so wisely; or that are careless and inattentive to what they hear, and let it pass, and never think of it more; whereas hearers of the word should be swift to hear, and listen with attention, and take care that they let not slip what they have heard, and that they meditate upon it in order to get instruction by it, and when they hear in such a manner it is? a encouragement to speak; or else the sense is, \"act wisely\" (g), like an honest man, and show yourself to be a wise man, a man of understanding, that well weighs and considers things, and rightly takes them in, and receives instruction by them, and talks like a sensible man: \"then afterwards we will speak\"; or otherwise, if you go on to talk in the foolish manner you do, it is to no purpose to carry on the dispute; the best way is to put an end to it at once. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) Schultens. (f)  \"et postea loquamur\", Piscator, Mercerus, Cocceius. (g) \"diserte agatis\", Schultens. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(e) Schultens. (f)  \"et postea loquamur\", Piscator, Mercerus, Cocceius. (g) \"diserte agatis\", Schultens. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "How long will it be ere {a} ye make an end of words? {b} mark, and afterwards we will speak.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "How long ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "will it be ere",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{a}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ye make an end of words? ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{b}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " mark, and afterwards we will speak.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) Who count yourselves just as Job 12:4.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) Whom you take to be only beasts, as in Job 12:7.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Then he spoke impiously of God, saying that He tore him in His anger (ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 16:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and appealed to the earth and nature to rise up on his side (ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 16:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Such things provoke the personal and moral indignation of Bildad alike. It seems to him that Job holds his brethren and him little higher than the beasts (although it was Job himself that was destitute of understanding), and that in his extravagant self-righteousness he flings them away from him as belonging to the class of the “unclean” (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Job 18:2-3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 18:2-3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "And it is not God that tears him in His anger; rather in his outrageous fury he is tearing himself. And does he suppose, as his appeal to the earth might suggest, that the eternal flow of law and order in the universe is to be interrupted for his sake—that he may be reputed innocent, or that being guilty he may not suffer the penalty of his evil, and that his principles may prevail? (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Job 18:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 18:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "This question naturally leads over to the principal theme of the discourse, the certainty of the destruction of the wicked through the operation of the fixed order of the world and the moral instincts of mankind (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Job 18:5-21",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 18:5-21",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ere you make an end of words",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "how long will ye hunt for words",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", lit. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "set snares for words",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Bildad begins with the same exclamation of impatient astonishment that he used on a former occasion, ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 8:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "how long? quousque tandem abutere patientia nostra",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "? By “hunting for words” he means making subtle and artificial attempts at finding arguments—which were only words. He probably refers to the distinctions which Job, in wrestling with his great problem, drew between God and God, and his appeals to the one against the other. Such things seem subtleties to Bildad and but the theme of speakers; man’s destiny in the world of God is a thing of more solid stuff, and its principles not so intangible.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "mark, and afterwards",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "understand",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Bildad gives back Job’s words, Thou hast hid their heart from understanding, ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 17:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It was not they but he that was without wisdom, and until he came to some admission of first principles talking was of little avail. In answering Job Bildad uses here the plur. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ye",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", with reference no doubt to Job’s identifying himself with the class of righteous sufferers persecuted by the wicked, ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 17:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "seq",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The circumstances of the Author’s time perhaps shine out through these allusions—the collision of classes, the conflicting claims of parties to represent the true people of God, and the diverse solutions which various minds sought for the hard problem of the national affliction, which turned the servant of the Lord over into the hands of the wicked (ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 16:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") and made him the servant of rulers (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 49:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Job 18:2",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "  1  Then began Bildad the Shuhite, and said:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "  2  How long will ye hunt for words?!",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Attend, and afterwards we will speak.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "  3  Wherefore are we accounted as beasts,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And narrow-minded in your eyes?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Job's speeches are long, and certainly are a trial of patience to the three, and the heaviest trial to Bildad, whose turn now comes on, because he is at pains throughout to be brief. Hence the reproach of endless babbling with which he begins here, as at Job 8:2, when he at last has an opportunity of speaking; in connection with which it must, however, not be forgotten that Job also, Job 16:3, satirically calls upon them to cease. He is indeed more entitled than his opponents to the entreaty not to weary him with long speeches. The question, Job 18:2, if קנצי six derived from קץ, furnishes no sense, unless perhaps it is, with Ralbag, explained: how long do you make close upon close in order, when you seem to have come to an end, to begin continually anew? For to give the thought: how long do you make no end of speaking, it must have been לא עד־אנה, as the lxx (μέχρι τίνος ου ̓ παύσῃ:) involuntarily inserts the negative. And what should the plur. mean by this rendering? The form קנצי  equals  קצּי would not cause doubt; for though קצּים does not occur elsewhere in the Old Testament, it is nevertheless sufficient that it is good Aramaic (קצּין), and that another Hebr. plural, as קצי, קצוי, קצוות, would have been hardly in accordance with the usage of the language. But the plural would not be suitable here generally, the over-delicate explanation of Ralbag perhaps excepted. Since the book of Job abounds in Arabisms, and in Arabic qanaṣa (as synon. of ṣâd) signifies venari, venando capere, and qanṣun (maqnaṣun) cassis, rete venatorium; since, further, שׂים קנצים (comp. שׂים ארב, Jeremiah 9:7) is an incontrovertible reading, and all the difficulties in connection with the reference to קץ lying in the עד־אנה for עד־אנה לא and in the plur. vanish, we translate with Castell., Schultens, J. D. Mich., and most modern expositors: how long (here not different from Job 8:2; Job 19:2) will ye lay snares (construction, as also by the other rendering, like Job 24:5; Job 36:16, according to Ges. 116, 1) for words; which, however, is not equivalent to hunt for words in order to contradict, but in order to talk on continually.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Job's speeches are long, and certainly are a trial of patience to the three, and the heaviest trial to Bildad, whose turn now comes on, because he is at pains throughout to be brief. Hence the reproach of endless babbling with which he begins here, as at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 8:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", when he at last has an opportunity of speaking; in connection with which it must, however, not be forgotten that Job also, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 16:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", satirically calls upon them to cease. He is indeed more entitled than his opponents to the entreaty not to weary him with long speeches. The question, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 18:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", if קנצי six derived from קץ, furnishes no sense, unless perhaps it is, with Ralbag, explained: how long do you make close upon close in order, when you seem to have come to an end, to begin continually anew? For to give the thought: how long do you make no end of speaking, it must have been לא עד־אנה, as the lxx (μέχρι τίνος ου ̓ παύσῃ:) involuntarily inserts the negative. And what should the plur. mean by this rendering? The form קנצי  equals  קצּי would not cause doubt; for though קצּים does not occur elsewhere in the Old Testament, it is nevertheless sufficient that it is good Aramaic (קצּין), and that another Hebr. plural, as קצי, קצוי, קצוות, would have been hardly in accordance with the usage of the language. But the plural would not be suitable here generally, the over-delicate explanation of Ralbag perhaps excepted. Since the book of Job abounds in Arabisms, and in Arabic qanaṣa (as synon. of ṣâd) signifies venari, venando capere, and qanṣun (maqnaṣun) cassis, rete venatorium; since, further, שׂים קנצים (comp. שׂים ארב, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 9:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") is an incontrovertible reading, and all the difficulties in connection with the reference to קץ lying in the עד־אנה for עד־אנה לא and in the plur. vanish, we translate with Castell., Schultens, J. D. Mich., and most modern expositors: how long (here not different from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 8:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 19:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") will ye lay snares (construction, as also by the other rendering, like ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 24:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 36:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", according to Ges. 116, 1) for words; which, however, is not equivalent to hunt for words in order to contradict, but in order to talk on continually.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: In post-bibl. Hebrew, קנצים has become common in the signification, proofs, arguments, as e.g., a Karaitic poet says, ויחוד שׁמך בקנצים הקימותי, the oneness of thy name have I upheld with proofs; vid., Pinsker, Likute Kadmoniot. Zur Gesch. des Karaismus und der karischen Literatur, 1860, S. קסו.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Job is the person addressed, for Bildad agrees with the two others. It is remarkable, however, that he addresses Job with \"you.\" Some say that he thinks of Job as one of a number; Ewald observes that the controversy becomes more wide and general; and Schlottm. conjectures that Bildad fixes his eye on individuals of his hearers, on whose countenances he believed he saw a certain inclination to side with Job. This conjecture we will leave to itself; but the remark which Schlottm. also makes, that Bildad regards Job as a type of a whole class, is correct, only one must also add, this address in the plur. is a reply to Job's sarcasm by a similar one. As Job has told the friends that they act as if they were mankind in general, and all wisdom were concentrated in them, so Bildad has taken it amiss that Job connects himself with the whole of the truly upright, righteous, and pure; and he addresses him in the plural, because he, the unit, has puffed himself up as such a collective whole. This wrangler - he means - with such a train behind him, cannot accomplish anything: Oh that you would understand (הבין, as e.g., Job 42:3, not causative, as Job 6:24), i.e., come to your senses, and afterward we will speak, i.e., it is only then possible to walk in the way of understanding. That is not now possible, when he, as one who plays the part of their many, treats them, the three who are agreed in opposition to him, as totally void of understanding, and each one of them unwise, in expressions like Job 17:4, Job 17:10. Looking to Psalm 49:13, 21, one might be tempted to regard נטמינוּ (on the vowel  instead of , vid., Ges. 75, rem. 7) as an interchange of consonants from נדמינו: be silent, make an end, ye profligati; but the supposition of this interchange of consonants would be arbitrary. On the other hand, there is no suitable thought in \"why are we accounted unclean?\" (Vulg. sorduimus), from טמה  equals  טמא, Leviticus 11:43 (Ges. 75, vi.); the complaint would have no right connection, except it were a very slight one, with Job 17:9. On the contrary, if we suppose a verb טמה in the signification opplere, obturare, which is peculiar to this consonant-combination in the whole range of the Semitic languages (comp. א־טם, Arab. 'ṭm, obstruere, Aram. טמּם, טמטם, Arab. ṭmm, e.g., Talm.: transgression stoppeth up, מטמטמת, man's heart), and after which this טמה has been explained by the Jewish expositors (Raschi: נחשׁבנו טמומים), and is interpreted by סתם (Parchon: נסתמה דעתנו), we gain a sense which corresponds both with previous reproaches of Job and the parallelism, and we decide in its favour with the majority of modern expositors. With the interrogative Wherefore, Bildad appeals to Job's conscience. These invectives proceed from an impassioned self-delusion towards the truth, which he wards off from himself, but cannot however alter. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Job is the person addressed, for Bildad agrees with the two others. It is remarkable, however, that he addresses Job with \"you.\" Some say that he thinks of Job as one of a number; Ewald observes that the controversy becomes more wide and general; and Schlottm. conjectures that Bildad fixes his eye on individuals of his hearers, on whose countenances he believed he saw a certain inclination to side with Job. This conjecture we will leave to itself; but the remark which Schlottm. also makes, that Bildad regards Job as a type of a whole class, is correct, only one must also add, this address in the plur. is a reply to Job's sarcasm by a similar one. As Job has told the friends that they act as if they were mankind in general, and all wisdom were concentrated in them, so Bildad has taken it amiss that Job connects himself with the whole of the truly upright, righteous, and pure; and he addresses him in the plural, because he, the unit, has puffed himself up as such a collective whole. This wrangler - he means - with such a train behind him, cannot accomplish anything: Oh that you would understand (הבין, as e.g., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 42:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", not causative, as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 6:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), i.e., come to your senses, and afterward we will speak, i.e., it is only then possible to walk in the way of understanding. That is not now possible, when he, as one who plays the part of their many, treats them, the three who are agreed in opposition to him, as totally void of understanding, and each one of them unwise, in expressions like ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 17:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 17:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Looking to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 49:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", 21, one might be tempted to regard נטמינוּ (on the vowel  instead of , vid., Ges. 75, rem. 7) as an interchange of consonants from נדמינו: be silent, make an end, ye profligati; but the supposition of this interchange of consonants would be arbitrary. On the other hand, there is no suitable thought in \"why are we accounted unclean?\" (Vulg. sorduimus), from טמה  equals  טמא, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 11:43",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (Ges. 75, vi.); the complaint would have no right connection, except it were a very slight one, with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 17:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". On the contrary, if we suppose a verb טמה in the signification opplere, obturare, which is peculiar to this consonant-combination in the whole range of the Semitic languages (comp. א־טם, Arab. 'ṭm, obstruere, Aram. טמּם, טמטם, Arab. ṭmm, e.g., Talm.: transgression stoppeth up, מטמטמת, man's heart), and after which this טמה has been explained by the Jewish expositors (Raschi: נחשׁבנו טמומים), and is interpreted by סתם (Parchon: נסתמה דעתנו), we gain a sense which corresponds both with previous reproaches of Job and the parallelism, and we decide in its favour with the majority of modern expositors. With the interrogative Wherefore, Bildad appeals to Job's conscience. These invectives proceed from an impassioned self-delusion towards the truth, which he wards off from himself, but cannot however alter. ",
            "children": []
          }
        ]
      }
    ]
  }
]