[{"num":28,"verse":"Woe to the crown of pride, to the drunken men of Ephraim, and to the flower falling down of the glory of the full out joying thereof, that were in the top of the fattest valley, and erred of wine. (Woe to the crown of pride of the drunken men of Ephraim, and to the declining glory, or the diminishing beauty, of the revellers’ flowers, that were on the fat, or the proud, heads, of those who wandered about because of the wine.)"},{"num":2,"verse":"Lo! the mighty and strong Lord, as the fierceness of hail, and whirlwind breaking together, as the fierceness of many waters (over)flowing, and sent out on a large land. (Lo! the Lord hath someone strong and mighty, like the fierceness of the hail, and like the fierceness of the whirlwind that altogether breaketh up, and like the fierceness of many waters overflowing, whom he shall send out upon the large, or the broad, land.)"},{"num":3,"verse":"The crown of pride of the drunken men of Ephraim shall be defouled with feet, (The crown of pride of the drunken men of Ephraim shall be defiled underfoot,)"},{"num":4,"verse":"and the flower of [the] glory of the full out joying of him, that is on the top of the valley of fat things, shall be falling down, as a timely thing before the ripeness of harvest; which when a man seeing beholdeth, anon as he taketh with hand, he shall devour it. (and the glory, or the beauty, of the flowers, that were on the fat, or on the proud, heads of the revellers, shall decline, or shall diminish, like a timely thing before the ripeness of the harvest, which when a person seeing beholdeth, as soon as he taketh hold of it with his hand, he shall devour it.)"},{"num":5,"verse":"In that day the Lord of hosts shall be a crown of glory, and a garland of full out joying, to the residue of his people; (On that day the Lord of hosts shall be a crown of glory, and a beautiful garland, for the remnant of his people;)"},{"num":6,"verse":"and a spirit of doom to him that sitteth on the throne, and strength to them that turn again from [the] battle to the gate. (and a spirit of justice, or of judgement, for him who sitteth upon the throne, and strength to them who return from the battle at the gate.)"},{"num":7,"verse":"But also they knew not for wine, and erred for drunkenness; the priest and (the) prophet knew not for drunkenness; they were sopped up of wine, they erred in drunkenness; they knew not a prophet, they knew not doom. (But they also knew not because of the wine, and wandered about in drunkenness; yea, the priest and the prophet knew not because of drunkenness; they were swallowed up by wine, and so they wandered about in drunkenness, and they knew not prophecy, and they did not have good judgement.)"},{"num":8,"verse":"For why all (the) boards were filled with spewing and filths, so that there was no more place. (For all the tables were covered with vomit and filth, so that there was no clean place left.)"},{"num":9,"verse":"Whom shall he teach knowing, and whom shall he make to understand [the] hearing? Men weaned from milk, men drawn away from teats. (And so to whom shall he teach knowledge, and who shall he make understand the teaching? Those just weaned from milk, yea, those just drawn away from the breast!/?)"},{"num":10,"verse":"For why command thou, command thou again; command thou, command thou again; abide thou, abide thou again; abide thou, abide thou again; a little there, a little there (a little here, a little there)."},{"num":11,"verse":"For why in [the] speech of lip, and in other language, he shall speak to this people,"},{"num":12,"verse":"to which he said, This is my rest; refresh ye a weary man, and this is my refreshing; and they would not hear. (to whom he said, This is my rest; refresh ye all the weary, and this is my refreshing; but they would not listen to him.)"},{"num":13,"verse":"And the word of the Lord shall be to them, Send thou, send thou again; send thou, send thou again; abide thou, abide thou again; abide thou, abide thou again; a little there, a little there (a little here, a little there); (so) that they go, and fall backward, and be all-broken, and be snared, and be taken."},{"num":14,"verse":"For this thing, ye men scorners, that be lords over my people which is in Jerusalem, hear the word of the Lord. (And so because of this, ye mockers, who be lords over my people who be in Jerusalem, hear the word of the Lord.)"},{"num":15,"verse":"For ye said, We have smitten a bond of peace with death, and we have made covenant with hell; a scourge (over)flowing, when it shall pass, shall not come [up]on us, for we have set a leasing our hope, and we be covered with a leasing. (For ye said, We have struck a covenant with death, and we have made a covenant with Sheol, that is, the land of the dead/and we have made a covenant with hell; an overflowing scourge, when it shall pass by, shall not come upon us, for we have made a lie to be our hope, and we be covered with, or protected by, a lie.)"},{"num":16,"verse":"Therefore the Lord God saith these things, Lo! I shall send in the foundaments of Zion a cornerstone precious, proved, founded in the foundament; he that believeth, shall not hasten. (And so the Lord God saith these things, Lo! I shall put in the foundation of Zion a precious cornerstone, proved, and laid in the foundation; he who believeth shall not be in haste, but shall be patient, or shall be steadfast.)"},{"num":17,"verse":"And I shall set doom in weight, and rightfulness in measure; and hail shall destroy the hope of leasing, and waters shall (over)flow on (your) protection. (And I shall put justice in weights, and righteousness in measures; and hail shall destroy the hope of lies, and water shall overflow your protection.)"},{"num":18,"verse":"And your bond of peace with death shall be done away, and your covenant with hell shall not stand; when the scourge (over)flowing shall pass, ye shall be to it into defouling. (And your covenant with death shall be done away, and your covenant with Sheol, or the land of the dead, shall not stand/and your covenant with hell shall not stand; when the overflowing scourge shall pass by, ye shall be defiled by it.)"},{"num":19,"verse":"Whenever it shall pass, it shall take away you (And when it shall pass by you, it shall take you away); for why early in the gray morrowtide it shall pass (by), (and) in day and night; and only travail alone shall give understanding to [the] hearing."},{"num":20,"verse":"Forsooth the bed is strait, so that the tother fall down; and a short mantle shall not cover ever either. (For the bed is too short, so that no one can stretch out on it; and the blanket is too small, so that no one can be covered by it.)"},{"num":21,"verse":"For as in the hill of partings the Lord shall stand, as in the valley, which is in Gibeon, he shall be wroth, that he do his work; his work alien, that he work his work; his work is strange from him. (For the Lord shall stand, as he did at Mount Perazim, and he shall be angry, as he was in the Valley of Gibeon; so that he do his work, his strange work; yea, that he work his work, his strange work.)"},{"num":22,"verse":"And now do not ye scorn, lest peradventure your bonds be made strait together; for I heard of the Lord God of hosts, ending and abridging on all (the) earth. (And now do not ye mock, lest peradventure your bonds be made altogether strait, or tight; for I have heard from the Lord God of hosts, of the ending and the shortening, or destruction, of all the earth.)"},{"num":23,"verse":"Perceive ye with ears, and hear ye my voice; perceive ye, and hear ye my speech. (Listen, and hear ye my voice; pay attention, yea, listen to me!)"},{"num":24,"verse":"Whether he that eareth, shall ear all day, for to sow, and shall he carve (up), and purge his land? (Shall he who ploweth, plow every day, in order to sow, and to furrow, and to purge his land?)"},{"num":25,"verse":"Whether when he hath made even the face thereof, shall he not sow gith, and sprinkle abroad cummin? and he shall not set wheat by order, and barley, and millet, and fitches in his coasts? (Or rather, when he hath smoothed, or leveled, its surface, shall he not sow gith, and sprinkle abroad cummin? and shall he not put in, by order, wheat, and barley, and millet, and fitches, in all his fields?)"},{"num":26,"verse":"And his God shall teach him, in doom he shall teach him. (And his God shall teach him, yea, he shall teach him good judgement.)"},{"num":27,"verse":"Forsooth (the) gith shall not be threshed in saws, and a wheel of a wain shall not compass on [the] cummin (For the gith shall not be threshed with saws, and the wheel of a wagon shall not roll over, or grind down, the cummin); but (the) gith shall be beaten out with a rod, and [the] cummin with a staff."},{"num":28,"verse":"Soothly bread shall be made less, but he that thresheth shall not thresh it without end, neither shall travail it with a wheel of a wain, neither shall make it less with his claws. (And the corn shall be crushed, but he who thresheth it shall not thresh it out forever, nor shall he grind it down with the wheel of a wagon, nor shall he make it fine with his horses’ hooves.)"},{"num":29,"verse":"And this thing went out of the Lord God of hosts, that he should make wonderful counsel, and magnify rightfulness. (And this word went out from the Lord God of hosts, whose counsel is wonderful, and whose rightfulness is great.)"}]