[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(5) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "David their king.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Meaning the predicted representative of the Davidic dynasty. Thus Rehoboam and his house are spoken of as “David” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Kings 12:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The phrase “latter days” is used indefinitely of the distant future, the horizon of the seer’s gaze. It occurs in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 49:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Authorised version, “last days”). We can only see the fulfilment of this anticipation in the Messianic reign. (Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 34:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 37:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Hosea 3:5",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 3:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Afterward shall the children of Israel return — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "When they have lived a long time in this state, without any country or government of their own, without any temple or place of worship, and without the liberty and proper means for offering sacrifices; they shall be touched with a true remorse for their former errors, and weary of this forlorn and desolate condition, shall bethink themselves of Jehovah the true God, and shall seek unto him by prayer and supplication. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "shall ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "seek David their king — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That is, the son of David, the Messiah, often called David by the prophets, as being not only descended from David, but the person in whom all the promises made to David were to receive their full and final accomplishment: see the margin. So the Chaldee paraphrase expounds this and the parallel texts. David was also a type of the Messiah, and therefore the latter is called by the name of David. Thus John the Baptist is called ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Elias, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 4:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", because he was to resemble him, and to succeed him in his office of reproving the people, and calling them to repentance. The expression cannot be literally understood here, David himself having been dead long before the uttering of this prophecy. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And shall fear the Lord and his goodness in the latter days — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That is, they shall reverence the Lord, stand in awe of him, and fear to offend him, and shall put their trust in and be grateful for his goodness, manifested in their redemption, their illumination by the gospel, their conversion to God, and their restoration to their own land; and hence they shall yield an entire obedience to him, shall worship and serve him in spirit and in truth, and live to his glory. And this will come to pass in the latter days, or times, of the world: see notes on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 2:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 2:44",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3:4-5 Here is the application of the parable to Israel. They must long sit like a widow, stripped of all joys and honours; but shall at length be received again. Those that would seek the Lord so as to find him, must apply to Christ, and become his willing people. Not only are we to fear the Lord and his greatness, but the Lord and his goodness; not only his majesty, but his mercy. Even Jewish writers apply this passage to the promised Messiah; doubtless it foretold their future conversion to Christ, for which they are kept a separate people. Though the first fear of God arise from a view of his holy majesty and righteous vengeance, yet the experience of mercy and grace through Jesus Christ, will lead the heart to reverence so kind and glorious a Friend and Father, and to fear offending him.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Afterward shall the children of Israel return - Elsewhere it is said more fully, \"return to the Lord.\" It expresses more than \"turning\" or even conversion to God. It is not conversion only, but reversion too, a turning \"back from\" the unbelief and sins, for which they had left God, and a return to Him whom they had forsaken.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And shall seek the Lord - This word, \"seek,\" expresses in Hebrew, from its intensive form, a diligent search; as used with regard to God, it signifies a religious search. It is not such seeking as our Lord speaks of, \"Ye seek me, not because ye saw the miracles, but because ye did eat of the loaves and were filled\" John 6:26, or, \"many shall seek to enter in and shall not be able\" Luke 13:24, but that earnest seeking, to which He has promised, \"Seek and ye shall find.\" Before, she had diligently sought her false gods. Now, in the end she shall as diligently seek God and His grace, as she had heretofore sought her idols and her sins.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And shall seek the Lord - This word, \"seek,\" expresses in Hebrew, from its intensive form, a diligent search; as used with regard to God, it signifies a religious search. It is not such seeking as our Lord speaks of, \"Ye seek me, not because ye saw the miracles, but because ye did eat of the loaves and were filled\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 6:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", or, \"many shall seek to enter in and shall not be able\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 13:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", but that earnest seeking, to which He has promised, \"Seek and ye shall find.\" Before, she had diligently sought her false gods. Now, in the end she shall as diligently seek God and His grace, as she had heretofore sought her idols and her sins.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And David their King - David himself, after the flesh, this could not be. For he had long since been gathered to his fathers; nor was he to return to this earth. \"David\" then must be \"the Son of David,\" the same, of whom God says, \"I will set up One Shepherd over them, and He shall feed them, even My servant David, and He shall be their Shepherd, and I the Lord will be their God, and My servant David a Prince among them\" Ezekiel 34:23-24. The same was to be a \"witness, leader, commander to the people Isaiah 55:4; He who was to be \"raised up to David Jeremiah 23:5-6, a righteous Branch,\" and who was to \"be called the Lord our Righteousness; David's Lord\" Psalm 110:1, as well as \"David's Son.\" Whence the older Jews, of every school, Talmudic, mystical, Biblical, grammatical, explained this prophecy, of Christ. Thus their received paraphrase is: \"Afterward the children of Israel shall repent, or turn by repentance, and shall seek the service of the Lord their God, and shall obey Messiah the Son of David, their King\" .",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And David their King - David himself, after the flesh, this could not be. For he had long since been gathered to his fathers; nor was he to return to this earth. \"David\" then must be \"the Son of David,\" the same, of whom God says, \"I will set up One Shepherd over them, and He shall feed them, even My servant David, and He shall be their Shepherd, and I the Lord will be their God, and My servant David a Prince among them\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 34:23-24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The same was to be a \"witness, leader, commander to the people ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 55:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; He who was to be \"raised up to David ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 23:5-6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", a righteous Branch,\" and who was to \"be called the Lord our Righteousness; David's Lord\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 110:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", as well as \"David's Son.\" Whence the older Jews, of every school, Talmudic, mystical, Biblical, grammatical, explained this prophecy, of Christ. Thus their received paraphrase is: \"Afterward the children of Israel shall repent, or turn by repentance, and shall seek the service of the Lord their God, and shall obey Messiah the Son of David, their King\" .",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And shall fear the Lord - Literally, \"shall fear toward the Lord and toward His goodness.\" It is not then a servile fear, not even, as elsewhere, a fear, which makes them shrink back from His awful Majesty. It is a fear, the most opposed to this; a fear, whereby \"they shall flee to Him for help, from all that is to be feared;\" a reverent holy awe, which should even impel them to Him; a fear of losing Him, which should make them hasten to Him. : \"They shall fear, and wonder exceedingly, astonied at the greatness of God's dealing, or of their own joy.\" Yet they should \"hasten tremblingly,\" as bearing in memory their past unfathfulness and ill deserts, and fearing to approach, but for the greater fear on turning away. Nor do they hasten with this reverent awe and awful joy to God only, but \"to His Goodness also.\" His Goodness draws them, and to it they betake themselves, away from all cause of fear, their sins, themselves, the Evil one. Yet even His Goodness is a source of awe. \"His Goodness!\" How much it contains. All whereby God is good in Himself, all whereby he is good to us. That whereby he is essentially good, or rather Goodness; that whereby He is good to us, as His creatures, its yet more as His sinfill, ungrateful, redeemed creatures, re-born to bear the Image of His Son. So then His Goodness overflows into beneficence, and condescension, and graciousness and mercy and forgiving love, and joy in imparting Himself, and complacence in the creatures which he has formed, and re-formed, redeemed and sanctified for His glory. Well may His creatures \"tremble toward\" it, with admiring wonder that all this can be made their's!",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This was to take place \"in the latter days.\" These words, which are adopted in the New Testament, where Apostles say, \"in the last days, in these last days\" Acts 2:17; Hebrews 1:2, mean this, the last dispensation of God, in contrast with all which went before, the times of the Gospel . The prophecy has all along been fulfilled during this period to those, whether of the ten or of the two tribes, who have been converted to Christ, since God ended their temple-worship. It is fulfilled in every soul from among them, who now is \"converted and lives.\" There will be a more full fulfillment, of which Paul speaks, when the eyes of all Israel shall be opened to the deceivableness of the last antichrist; and Enoch and Elias, the two witnesses Revelation 11:3, shall have come to prepare our Lord's second Coming, and shall have keen slain, and, by God's converting grace, \"all Israel shall be saved\" Romans 11:26. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "This was to take place \"in the latter days.\" These words, which are adopted in the New Testament, where Apostles say, \"in the last days, in these last days\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 2:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 1:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", mean this, the last dispensation of God, in contrast with all which went before, the times of the Gospel . The prophecy has all along been fulfilled during this period to those, whether of the ten or of the two tribes, who have been converted to Christ, since God ended their temple-worship. It is fulfilled in every soul from among them, who now is \"converted and lives.\" There will be a more full fulfillment, of which Paul speaks, when the eyes of all Israel shall be opened to the deceivableness of the last antichrist; and Enoch and Elias, the two witnesses ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 11:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", shall have come to prepare our Lord's second Coming, and shall have keen slain, and, by God's converting grace, \"all Israel shall be saved\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 11:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "5. Afterward—after the long period (\"many days,\" Ho 3:4) has elapsed.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "return—from their idols to \"their God,\" from whom they had wandered.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "David their king—Israel had forsaken the worship of Jehovah at the same time that they forsook their allegiance to David's line. Their repentance towards God is therefore to be accompanied by their return to the latter. So Judah and Israel shall be one, and under \"one head,\" as is also foretold (Ho 1:11). That representative and antitype of David is Messiah. \"David\" means \"the beloved.\" Compare as to Messiah, Mt 3:17; Eph 1:6. Messiah is called David (Isa 55:3, 4; Jer 30:9; Eze 34:23, 24; 37:24, 25).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "fear the Lord and his goodness—that is, tremblingly flee to the Lord, to escape from the wrath to come; and to His goodness,\" as manifested in Messiah, which attracts them to Him (Jer 31:12). The \"fear\" is not that which \"hath torment\" (1Jo 4:18), but reverence inspired by His goodness realized in the soul (Ps 130:4).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the latter days—those of Messiah [Kimchi].   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Afterward; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " after these long and sore troubles have broken their hearts and opened their eyes. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Return; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " repent; it is not a promise of return into their own country. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Seek the Lord their God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to know his way, and to live under his protection and blessing, to worship him, and they shall pray to him, depend on him, consult with him, with ardency and earnestness of desire. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "David their king; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " not son of Jesse, who was long since dead; nor Zerubbabel; but Messiah, who is elsewhere called David, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 132:10 Jeremiah 30:9 Ezekiel 34:24 37:24,25",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 132:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 30:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 34:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 37:24,25",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", which see; and ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Amos 9:11",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 9:11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Shall fear the Lord",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; with reverence shall pray, depend on, and consult their God, and worship his Son the Messiah, whom the Father sent out of his infinite goodness and kindness towards us. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And his goodness; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " God and his goodness, i.e. the good and gracious God, such to us in Christ; God in Christ and with Christ shall be worshipped. In the latter days; in the days of the Messiah, in gospel times, and perhaps the last of these latter days. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Afterward shall the children of Israel return,.... The ten tribes of Israel, and also the two tribes of Judah and Benjamin, which are included in the name of Israel, as Aben Ezra interprets it; and these are joined together in parallel places; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 30:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for though they did not go into captivity together, yet their return and conversion will be at the same time; and they are all spoken of under the name of Israel by the Apostle Paul, when he foretells their conversion and salvation, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 11:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The \"return\" of them, here prophesied of, does not barely mean their return to their own land, which will be at this time; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 30:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but their return to the Lord by repentance; when they shall repent of, and turn from, their sinful course of life, and particularly of their unbelief and rejection of the true Messiah, and embrace him; and of their traditions and false ways of worship, which they shall discard; and of their own righteousness they shall now renounce; and shall turn to the Lord Jesus Christ, and believe in him for righteousness, life, and salvation: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and seek the Lord their God, and David their King; these may be considered either as two distinct persons, Jehovah the Father, and the Messiah, as in Ezekiel 34:23 and so the Targum, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and seek the Lord their God, and David their King; these may be considered either as two distinct persons, Jehovah the Father, and the Messiah, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 34:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and so the Targum, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"and seek the worship of the Lord their God, and obey Messiah the Son of David their King;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "who will be both equally sought after, and unto, by them; and which is a proof of the divinity of the Messiah, and of his equality with God his Father; as well as points out the right way in which Jehovah is to be sought, namely, with Christ, or in him, in whom he is a God gracious and merciful; and to seek and know both the one and the other is eternal life, John 17:3 or else all this is to be understood of the Messiah, rendering the words, \"and seek the Lord their God, even David their King\" as also Jeremiah 30:9, may be rendered; and so these are all epithets, titles, and characters of him: he is Jehovah, the everlasting I AM; the true God, and eternal life; Immanuel, God with us; God in our nature, manifest in the flesh; the Son of David, and his antitype, often called David in Scripture. Psalm 89:3, King of kings, King of the saints, of his church, and will be owned as such by the Jews at the time of their conversion, though they have rejected him; but now they will receive him, and be subject to him; they will seek to him for salvation, for the pardon of their sins, for righteousness, for rest, for food, for protection and safety, and to serve and obey him: and this seeking will not be out of curiosity, or in a carnal way, or for selfish ends; nor hypocritically; but with their whole hearts, and diligently, and in earnest. Not only the Targum interprets this of Messiah the Son of David, but Aben Ezra on the place says, this is the Messiah; and it is applied to him, and his times, by other Jewish writers, both ancient and modern. In an ancient book (h) of theirs, speaking of David, it is said, the holy blessed God is well pleased with him in this world, and in the world to come; in this world, as it is written, \"and I will defend this city for mine own sake, and for my servant David's sake\", 2 Kings 20:6, and in the world to come, as it is written, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "who will be both equally sought after, and unto, by them; and which is a proof of the divinity of the Messiah, and of his equality with God his Father; as well as points out the right way in which Jehovah is to be sought, namely, with Christ, or in him, in whom he is a God gracious and merciful; and to seek and know both the one and the other is eternal life, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 17:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " or else all this is to be understood of the Messiah, rendering the words, \"and seek the Lord their God, even David their King\" as also ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 30:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", may be rendered; and so these are all epithets, titles, and characters of him: he is Jehovah, the everlasting I AM; the true God, and eternal life; Immanuel, God with us; God in our nature, manifest in the flesh; the Son of David, and his antitype, often called David in Scripture. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 89:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", King of kings, King of the saints, of his church, and will be owned as such by the Jews at the time of their conversion, though they have rejected him; but now they will receive him, and be subject to him; they will seek to him for salvation, for the pardon of their sins, for righteousness, for rest, for food, for protection and safety, and to serve and obey him: and this seeking will not be out of curiosity, or in a carnal way, or for selfish ends; nor hypocritically; but with their whole hearts, and diligently, and in earnest. Not only the Targum interprets this of Messiah the Son of David, but Aben Ezra on the place says, this is the Messiah; and it is applied to him, and his times, by other Jewish writers, both ancient and modern. In an ancient book (h) of theirs, speaking of David, it is said, the holy blessed God is well pleased with him in this world, and in the world to come; in this world, as it is written, \"and I will defend this city for mine own sake, and for my servant David's sake\", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 20:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and in the world to come, as it is written, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "they shall seek the Lord their God, and David their King, &c.; David was King in this world, and David shall be King in the time to come. And in both Talmuds the words are applied to the Messiah; in one of them (i), after quoting this text, it is added, the Rabbins say this is the King Messiah; if of the living, David is his name; if of the dead, David is his name. And in the other (k), it is said, when Jerusalem is built, David comes; that is, the Son of David, the Messiah; which is proved by this passage, \"afterwards the children of Israel shall return, and seek the Lord their God, and David their King\"; that is, as the gloss interprets it, after they shall return to the house of the sanctuary, or the temple: so Abarbinel, both in his commentary upon this place, and elsewhere (l), as he interprets the \"one head\" in Hosea 1:11, of Messiah ben Ephraim, whom he, with the rest of his tribe, feign shall perish in war; so he observes, that then Israel shall seek David their King, the rod out of the root of Jesse, whom the Lord shall choose, and cause to reign over them. And another of their later writers (m) interprets the passage of the Messiah, and produces it to prove against the Christians that he should come in the end of days, or in the latter days; as it is plain and certain that our Jesus, the true Messiah, came at the end of the Jewish world, in the last days of their civil and church state; see Hebrews 1:1, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "they shall seek the Lord their God, and David their King, &c.; David was King in this world, and David shall be King in the time to come. And in both Talmuds the words are applied to the Messiah; in one of them (i), after quoting this text, it is added, the Rabbins say this is the King Messiah; if of the living, David is his name; if of the dead, David is his name. And in the other (k), it is said, when Jerusalem is built, David comes; that is, the Son of David, the Messiah; which is proved by this passage, \"afterwards the children of Israel shall return, and seek the Lord their God, and David their King\"; that is, as the gloss interprets it, after they shall return to the house of the sanctuary, or the temple: so Abarbinel, both in his commentary upon this place, and elsewhere (l), as he interprets the \"one head\" in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 1:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", of Messiah ben Ephraim, whom he, with the rest of his tribe, feign shall perish in war; so he observes, that then Israel shall seek David their King, the rod out of the root of Jesse, whom the Lord shall choose, and cause to reign over them. And another of their later writers (m) interprets the passage of the Messiah, and produces it to prove against the Christians that he should come in the end of days, or in the latter days; as it is plain and certain that our Jesus, the true Messiah, came at the end of the Jewish world, in the last days of their civil and church state; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 1:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and shall fear the Lord and his goodness in the latter day; not man, but the Lord; not his wrath and vengeance, but his goodness; not with a servile, but with a godly filial fear; a fear influenced by the blessings of goodness they shall now be partakers of, particularly pardoning grace and mercy, Psalm 130:3, they shall fear the Lord, who is good, and goodness itself, and Christ, in whom the goodness of God is displayed, and who is prevented with the blessings of goodness for his people: it may be rendered, they \"shall fear\", or \"come fearing to the Lord, and his goodness\" (n), being sensible of their sin, danger, and misery; they shall flee to the Lord as to their city of refuge, and to the blessings of his goodness they see their need of; and this they shall do in haste, as Aben Ezra interprets it, comparing it with Hosea 11:11. The Septuagint version is, \"they shall be amazed at the Lord, and his good things\"; the Syriac version, \"they shall know the Lord, and his goodness\": the Arabic version, they shall confess the Lord, and his benefits; the Targum, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and shall fear the Lord and his goodness in the latter day; not man, but the Lord; not his wrath and vengeance, but his goodness; not with a servile, but with a godly filial fear; a fear influenced by the blessings of goodness they shall now be partakers of, particularly pardoning grace and mercy, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 130:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", they shall fear the Lord, who is good, and goodness itself, and Christ, in whom the goodness of God is displayed, and who is prevented with the blessings of goodness for his people: it may be rendered, they \"shall fear\", or \"come fearing to the Lord, and his goodness\" (n), being sensible of their sin, danger, and misery; they shall flee to the Lord as to their city of refuge, and to the blessings of his goodness they see their need of; and this they shall do in haste, as Aben Ezra interprets it, comparing it with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 11:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The Septuagint version is, \"they shall be amazed at the Lord, and his good things\"; the Syriac version, \"they shall know the Lord, and his goodness\": the Arabic version, they shall confess the Lord, and his benefits; the Targum, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"they shall give themselves to the service of the Lord, and his goodness shall be multiplied, which shall come to them in the end of days;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "or, as Aben Ezra, in the end of the prophecy of the prophets, in future time, in the times of the Messiah; which, as Kimchi serves, are always meant by the last days; and here it signifies the latter day of the last days, or of the Gospel dispensation. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(h) Zohar in Exod. fol. 93. 3.((i) T. Hieros. Beracot, fol. 5. 1.((k) T. Bab Megillah, fol. 18. 1.((l) Mashmiah Jeshuah, fol. 55. 4. (m) R. Isaac Chizzuk Emunah, par. 1. p. 44. (n)     \"pavebunt ad Dominum\", Montanus; \"providi accedent ad Jehovam, et ad bonitatem ejus\", Junius & Tremellius, Piscator, Drusius; \"et cum timore venient ad Jehovam, et ad bonum ejus\", Schmidt; so Ben Melech interprets it, \"they shall fear, and be afraid of him, flow to him, and to his goodness\"; and which, he says, Saadiah explains of his glory, agreeably to Exodus 33.19. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(h) Zohar in Exod. fol. 93. 3.((i) T. Hieros. Beracot, fol. 5. 1.((k) T. Bab Megillah, fol. 18. 1.((l) Mashmiah Jeshuah, fol. 55. 4. (m) R. Isaac Chizzuk Emunah, par. 1. p. 44. (n)     \"pavebunt ad Dominum\", Montanus; \"providi accedent ad Jehovam, et ad bonitatem ejus\", Junius & Tremellius, Piscator, Drusius; \"et cum timore venient ad Jehovam, et ad bonum ejus\", Schmidt; so Ben Melech interprets it, \"they shall fear, and be afraid of him, flow to him, and to his goodness\"; and which, he says, Saadiah explains of his glory, agreeably to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".19. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Afterward shall the children of Israel return, and seek the LORD their God, and {g} David their king; and shall fear the LORD and his goodness in the latter days.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Afterward shall the children of Israel return, and seek the LORD their God, and ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{g}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " David their king; and shall fear the LORD and his goodness in the latter days.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(g) This is meant of Christ's kingdom, which was promised to David to be eternal; Ps 72:17.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "return",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] i.e. from their evil courses of disobedience to their God and to the legitimate royal house.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "David their king",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] There is a great body of authority for regarding this as an expression for the Messiah. So the Targum took it, so Aben Ezra, and other Jewish writers cited by Pococke. The interpretation rests on the undoubted fact that in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 30:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 34:23-24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 37:24-25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘David’ means the ideal king of the future who should prove as it were a second David. In all these passages however there is something in the context to determine the reference to a person, and all these passages belong to a later period in the development of the Messianic revelation. The analogy of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 9:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " suggests that what is in Hosea’s mind is, not the person of the king, but the dynasty. In short, ‘David’ = the representative of David. Precisely so Rehoboam is still ‘David’ in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 12:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and the high priest ‘Aaron’ in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 133:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Hosea does not sanction the usurping dynasties (see on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 1:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and shall fear the Lord and his goodness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "and shall come eagerly to Jehovah and to his goodness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (or, ‘to His good things’). ‘Come eagerly to’ is literally, ‘tremble to’, but the idea is not that they will tremble at their own unworthiness, but rather ‘trement præ gaudio’ (as the same verb means in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 60:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Comp. the similar expression in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 11:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where however the idea of speech is included. The parallel passage in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 31:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " proves that the revived love of the Israelites for Jehovah will have ‘cast out fear’.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in the latter days",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "in the days to come",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (lit., ‘in the sequel of the days’); see on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 4:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Hosea does not mean to say that this will be the last ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "αἰὼν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in the course of history; but only that after Israel’s captivity, nothing will arise to break the harmony between Jehovah and his people.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 5.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Afterward shall the children of Israel return, and seek the Lord theft God, and David their king.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The note of time in the beginning of ver. 5 is explained by Rashi to signify \"after the days of the Captivity;\" and by Kimchi as follows: \"This will take place at the end of the days, near the time of salvation, when the children of Israel shall return in repentance.\" Though not comprehended in the symbolic representation that precedes, this statement is necessary to complete it. The future of Israel is the burden of this promise; the blessedness of that future is its brightness. It comprises three items - the reversal of their previous career, their loving return to the Lord their God, and their cordial reception of David their king. Contemporaneous with their sorrow for the sins of the past was their serious seeking of the Lord their God and submission to David their king. Their revolt from the Davidic dynasty in the days of Rehoboam was immediately followed by the idolatry of the calves which Jeroboam set up at Dan and Bethel. The reversal of this course is symptomatic of their complete recovery. The patriarch David was long dead and buried, and his sepulcher was in Palestine at the time when the prophet wrote; one, therefore, in the Davidic line, a descendant from, and dynastic representative of, the patriarch must be meant. That this was Messiah there can be no reasonable doubt; parallel passages in the other prophets prove this; for example: \"I will set up one shepherd over them, and he shall feed them, even my servant David; he shall feed them, and he shall be their shepherd. And I the Lord will be their God, and my servant David a prince among them\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 34:23, 25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; comp. also Ezekiel 37:24). Again in Jeremiah (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 30:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") we read to the same purpose, \"They shall serve the Lord their God, and David their king, whom I will raise up unto them.\" We can by no means concur with those who refer this promise to Zerubbabel as a later occupant of the Davidic throne; and just as little with those who, like Wunsche, hold that the prophet has no particular period and no particular person in view, but presents the prospect of a happy and blissful future when Israel would return to the pure worship of Jehovah and enjoy his gracious protection, and when the national prosperity would equal or even far ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "surpass",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that under the glorious reign of David ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "himself.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The best Jewish authorities are quoted in favor of the same; thus Rabbi Tanchum says, \"He (the prophet) understands the son of David, occupying his place, from his lineage, walking in his way, by whom his name shall endure and his kingdom be preserved.\" The Chaldee Targum translates in the same sense: \"",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "They",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " shall seek the worship of Jehovah their God, and obey Messiah, the Son of David, their king.\" So Aben Ezra ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "says",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that \"David their king is this Messiah, Like 'My servant David shall be their prince forever' (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 37:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").\" The well-known idiom of one idea expressed by two verbs, so that the rendering of the clause would be \"They shall again seek the Lord their God, and David their king,\" if applied here, as undoubtedly it might, would weaken the sense, and so be unsuitable to the context. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And shall fear",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "come with trembling to",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "the Lord and his goodness in the latter days.",
        "children": [
          {
            "element": "span",
            "class": "cmt_word",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "the Lord and his goodness in the latter days.",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The comment of Kimchi on the first part of this clause is as follows: \"They shall tremble and be afraid of him when they return to him, and shall with repentance wait for the goodness of redemption on which they have trusted.\" A somewhat different meaning is assigned to the words by Aben Ezra: \"They shall return in haste, when the end (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "e",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". the time of redemption) comes to their own land with hasty course suddenly.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "His goodness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is taken by some in a concrete sense, as signifying the blessings which he bestows and the good gifts which he imparts; and by others in the abstract, as the Divine goodness or majesty, to which Israel resorts for the pardon of sin and the gracious acceptance of their petitions and answer of their prayers. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Hosea 3:5",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "\"Afterward will the sons of Israel turn and seek Jehovah their God, and David their king, and will go trembling to Jehovah and to His goodness at the end of the days.\" This section, like the previous one, closes with the announcement of the eventual conversation of Israel, which was not indicated in the symbolical action which precedes it, but is added to complete the interpretation of the symbol. Seeking Jehovah their God is connected with seeking David their king. For just as the falling away of the ten tribes from the royal house of David was merely the sequel and effect of their inward apostasy from Jehovah, and was openly declared in the setting up of the golden calves; the true return to the Lord cannot take place without a return to David their king, since God has promised the kingdom to David and his seed for ever (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 7:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 7:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and therefore David is the only true king of Israel (their king). This King David, however, is no other than the Messiah. For although David received the promise of the everlasting continuance of his government, not with reference to his own person, but for his seed, i.e., his family; and on the ground of this promise, the whole of the royal house of David is frequently embraced under the expression \"King David,\" so that we might imagine that David is introduced here, not as an individual, but as signifying the Davidic family; yet we must not understand it on this account as referring to such historical representatives of the Davidic government as Zerubbabel, and other earthly representatives of the house of David, since the return of the Israelites to \"their King David\" was not to take place till 'achârı̄th hayyâmı̄m (the end of the days). For \"the end of the days\" does not denote the future generally, but always the closing future of the kingdom of God, commencing with the coming of the Messiah (see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 49:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 2:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Pâchad 'el Yehovâh, to shake or tremble to Jehovah, is a pregnant expression for \"to turn to Jehovah with trembling;\" i.e., either trembling at the holiness of God, in the consciousness of their own sinfulness and unworthiness, or else with anguish and distress, in the consciousness of their utter helplessness. It is used here in the latter sense, as the two parallels, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 5:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"in their affliction they will seek me,\" and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 11:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"they shall tremble as a bird,\" etc., clearly show. This is also required by the following expression, ואל־טוּבו, which is to be understood, according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 2:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as denoting the goodness of God manifested in His gifts. Affliction will drive them to seek the Lord, ad His goodness which is inseparable from Himself (Hengstenberg). Compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 31:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where \"the goodness of the Lord\" is explained as corn, new wine, oil, lambs, and oxen, these being the gifts that come from the goodness of the Lord (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 9:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 27:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 31:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). He who has the Lord for his God will want no good thing. ",
        "children": []
      }
    ]
  }
]