[{"num":66,"verse":"Thus says the Lord: Heaven is My throne, and the earth is My footstool. What kind of house would you build for Me? And what kind can be My resting-place?"},{"num":2,"verse":"For all these things My hand has made, and so all these things have come into being [by and for Me], says the Lord. But this is the man to whom I will look and have regard: he who is humble and of a broken or wounded spirit, and who trembles at My word and reveres My commands."},{"num":3,"verse":"[The acts of the hypocrite’s worship are as abominable to God as if they were offered to idols.] He who kills an ox [then] will be as guilty as if he slew and sacrificed a man; he who sacrifices a lamb or a kid, as if he broke a dog’s neck and sacrificed him; he who offers a cereal offering, as if he offered swine’s blood; he who burns incense [to God], as if he blessed an idol. [Such people] have chosen their own ways, and they delight in their abominations;"},{"num":4,"verse":"So I also will choose their delusions and mockings, their calamities and afflictions, and I will bring their fears upon them—because when I called, no one answered; when I spoke, they did not listen or obey. But they did what was evil in My sight and chose that in which I did not delight."},{"num":5,"verse":"Hear the word of the Lord, you who tremble at His word: Your brethren who hate you, who cast you out for My name’s sake, have said, Let the Lord be glorified, that we may see your joy! But it is they who shall be put to shame."},{"num":6,"verse":"[Hark!] An uproar from the city! A voice from the temple! The voice of the Lord, rendering recompense to His enemies!"},{"num":7,"verse":"Before [Zion] travailed, she gave birth; before her pain came upon her, she was delivered of a male child."},{"num":8,"verse":"Who has heard of such a thing? Who has seen such things? Shall a land be born in one day? Or shall a nation be brought forth in a moment? For as soon as Zion was in labor, she brought forth her children."},{"num":9,"verse":"Shall I bring to the [moment of] birth and not cause to bring forth? says the Lord. Shall I Who causes to bring forth shut the womb? says your God."},{"num":10,"verse":"Rejoice with Jerusalem and be glad for her, all you who love her; rejoice for joy with her, all you who mourn over her,"},{"num":11,"verse":"That you may nurse and be satisfied from her consoling breasts, that you may drink deeply and be delighted with the abundance and brightness of her glory."},{"num":12,"verse":"For thus says the Lord: Behold, I will extend peace to her like a river, and the glory of the nations like an overflowing stream; then you will be nursed, you will be carried on her hip and trotted [lovingly bounced up and down] on her [God’s maternal] knees."},{"num":13,"verse":"As one whom his mother comforts, so will I comfort you; you shall be comforted in Jerusalem."},{"num":14,"verse":"When you see this, your heart shall rejoice; your bones shall flourish like green and tender grass. And the [powerful] hand of the Lord shall be revealed and known to be with His servants, but His indignation [shown] to be against His enemies."},{"num":15,"verse":"For behold, the Lord will come in fire, and His chariots will be like the stormy wind, to render His anger with fierceness, and His rebuke with flames of fire."},{"num":16,"verse":"For by fire and by His sword will the Lord execute judgment upon all flesh, and the slain of the Lord will be many."},{"num":17,"verse":"Those who [attempt to] sanctify themselves and cleanse themselves to enter [and sacrifice to idols] in the gardens, following after one in the midst, eating hog’s flesh and the abomination [creeping things] and the [mouse—their works and their thoughts] shall come to an end together, says the Lord."},{"num":18,"verse":"For I know their works and their thoughts. And the time is coming when I will gather all nations and tongues, and they will come and see My glory."},{"num":19,"verse":"And I will set up a [miraculous] sign among them, and from them I will send survivors to the nations—to Tarshish, Pul (Put), and Lud, who draw the bow, to Tubal and Javan, to the isles and coastlands afar off that have not heard of My fame nor seen My glory. And they will declare and proclaim My glory among the nations."},{"num":20,"verse":"And they shall bring all your brethren from all the nations as an offering to the Lord—upon horses and in chariots and in litters and upon mules and upon camels—to My holy mountain Jerusalem, says the Lord, just as the children of Israel bring their cereal offering in a clean vessel to the house of the Lord."},{"num":21,"verse":"And I will also take some of them for priests and for Levites, says the Lord."},{"num":22,"verse":"For as the new heavens and the new earth which I make shall remain before Me, says the Lord, so shall your offspring and your name remain."},{"num":23,"verse":"And it shall be that from one New Moon to another New Moon and from one Sabbath to another Sabbath, all flesh shall come to worship before Me, says the Lord."},{"num":24,"verse":"And they shall go forth and gaze upon the dead bodies of the [rebellious] men who have stepped over against Me; for their worm shall not die, their fire shall not be quenched, and they shall be an abhorrence to all mankind."}]