[{"header":"The Ceremony for People Healed of Leprosy"},{"num":14,"verse":"The Lord told Moses to say to the people:"},{"num":2,"verse":"After you think you are healed of leprosy, you must ask for a priest to come outside the camp and examine you. And if you are well, "},{"num":4,"verse":"he will have someone bring out two live birds that are acceptable for sacrifice, together with a stick of cedar wood, a piece of red yarn, and a branch from a hyssop plant. "},{"num":5,"verse":"The priest will have someone kill one of the birds over a clay pot of spring water. "},{"num":6,"verse":"Then he will dip the other bird, the cedar, the red yarn, and the hyssop in the blood of the dead bird. "},{"num":7,"verse":"Next, he will sprinkle you seven times with the blood and say, “You are now clean.” Finally, he will release the bird and let it fly away."},{"num":8,"verse":"After this you must wash your clothes, shave your entire body, and take a bath before you are completely clean. You may move back into camp, but you must not enter your tent for seven days. "},{"num":9,"verse":"Then you must once again shave your head, face, and eyebrows, as well as the hair on the rest of your body. Finally, wash your clothes and take a bath, and you will be completely clean."},{"num":10,"verse":"On the eighth day you must bring to the priest two rams and a year-old female lamb that have nothing wrong with them; also bring a half pint of olive oil and six pounds of your finest flour mixed with oil. "},{"num":11,"verse":"Then the priest will present you and your offerings to me at the entrance to my sacred tent. "},{"num":12,"verse":"There he will offer one of the rams, together with the pint of oil, as a sacrifice to make things right. He will also lift them up to show that they are dedicated to me. "},{"num":13,"verse":"This sacrifice is very holy. It belongs to the priest and must be killed in the same place where animals are killed as sacrifices for sins and as sacrifices to please me."},{"num":14,"verse":"The priest will smear some of the blood from this sacrifice on your right ear lobe, some on your right thumb, and some on the big toe of your right foot. "},{"num":15,"verse":"He will then pour some of the olive oil into the palm of his left hand, "},{"num":16,"verse":"dip a finger of his right hand into the oil, and sprinkle some of it seven times toward the sacred tent. "},{"num":17,"verse":"Next, he will smear some of the oil on your right ear lobe, some on your right thumb, and some on the big toe of your right foot, "},{"num":18,"verse":"and pour the rest of the oil from his palm on your head. Then he will offer the other two animals—one as a sacrifice for sin and the other as a sacrifice to please me, together with a grain sacrifice. After this you will be completely clean."},{"num":21,"verse":"If you are poor and cannot afford to offer this much, you may offer a ram as a sacrifice to make things right, together with a half pint of olive oil and two pounds of flour mixed with oil as a grain sacrifice. The priest will then lift these up to dedicate them to me. "},{"num":22,"verse":"Depending on what you can afford, you must also offer either two doves or two pigeons, one as a sacrifice for sin and the other as a sacrifice to please me. "},{"num":23,"verse":"The priest will offer these to me in front of the sacred tent on the eighth day."},{"num":24,"verse":"The priest will kill this ram for the sacrifice to make things right, and he will lift it up with the olive oil in dedication to me. Then he will smear some of the blood on your right ear lobe, some on your right thumb, and some on the big toe of your right foot."},{"num":26,"verse":"The priest will pour some of the olive oil into the palm of his left hand, "},{"num":27,"verse":"then dip a finger of his right hand in the oil and sprinkle some of it seven times toward the sacred tent. "},{"num":28,"verse":"He will smear some of the oil on your right ear lobe, some on your right thumb, and some on the big toe of your right foot, just as he did with the blood of the sacrifice to make things right. "},{"num":29,"verse":"And he will pour the rest of the oil from his palm on your head."},{"num":32,"verse":"These are the things you must do if you have leprosy and cannot afford the usual sacrifices to make you clean."},{"header":"When Mildew Is in a House"},{"num":33,"verse":"The Lord told Moses and Aaron to say to the people:"},{"num":34,"verse":"After I have given you the land of Canaan as your permanent possession, here is what you must do, if I ever put mildew on the walls of any of your homes. "},{"num":35,"verse":"First, you must say to a priest, “I think mildew is on the wall of my house.”"},{"num":36,"verse":"The priest will reply, “Empty the house before I inspect it, or else everything in it will be unclean.”"},{"num":37,"verse":"If the priest discovers greenish or reddish spots that go deeper than the surface of the walls, "},{"num":38,"verse":"he will have the house closed for seven days. "},{"num":39,"verse":"Then he will return and check to see if the mildew has spread. "},{"num":40,"verse":"If so, he will have someone scrape the plaster from the walls, remove the filthy stones, then haul everything off and dump it in an unclean place outside the town. "},{"num":42,"verse":"Afterwards the wall must be repaired with new stones and fresh plaster."},{"num":43,"verse":"If the mildew appears a second time, "},{"num":44,"verse":"the priest will come and say, “This house is unclean. It’s covered with mildew that can’t be removed.” "},{"num":45,"verse":"Then he will have the house torn down and every bit of wood, stone, and plaster hauled off to an unclean place outside the town. "},{"num":46,"verse":"Meanwhile, if any of you entered the house while it was closed, you will be unclean until evening. "},{"num":47,"verse":"And if you either slept or ate in the house, you must wash your clothes."},{"num":48,"verse":"On the other hand, if the priest discovers that mildew hasn’t reappeared after the house was newly plastered, he will say, “This house is clean—the mildew has gone.” "},{"num":49,"verse":"Then, to show that the house is now clean, he will get two birds, a stick of cedar wood, a piece of red yarn, and a branch from a hyssop plant and bring them to the house. "},{"num":50,"verse":"He will kill one of the birds over a clay pot of spring water "},{"num":51,"verse":"and let its blood drain into the pot. Then he will dip the cedar, the hyssop, the yarn, and the other bird into the mixture of blood and water. Next, he will sprinkle the house seven times with the mixture, then the house will be completely clean. "},{"num":53,"verse":"Finally, he will release the bird and let it fly away, ending the ceremony for purifying the house."},{"num":54,"verse":"These are the things you must do if you discover that you are unclean because of an itch or a sore, or that your clothing or house is unclean because of mildew."}]