[{"header":"Ahaziah, King of Judah(A)"},{"num":22,"verse":"Then those in Jerusalem made Ahaziah, the youngest son of Jehoram, king in his place because the raiding party, those coming with the Arabians to the camp, killed all the older sons. So Ahaziah the son of Jehoram reigned in Jerusalem."},{"num":2,"verse":"Now Ahaziah was forty-two years old when he began to reign, but he only reigned one year in Jerusalem. The name of his mother was Athaliah, a granddaughter of Omri."},{"num":3,"verse":"And he also walked in the ways of the house of Ahab because his mother was the one counseling him to do evil. "},{"num":4,"verse":"And he also did what was evil in the eyes of the Lord, like the house of Ahab, for they served as his counselors after his father Jehoram died, which led to his destruction. "},{"num":5,"verse":"Even Ahaziah walked in their counsel and went with Jehoram the son of Ahab king of Israel to war against Hazael king of Aram at Ramoth Gilead. And the Arameans wounded Joram, "},{"num":6,"verse":"and the king returned to Jezreel to heal from the wounds that he sustained in Ramah where he fought against Hazael king of Aram."},{"num":7,"verse":"And it was from God that a downfall would happen to Ahaziah in regard to his visit with Joram. And when he arrived he went out with Joram to see Jehu the son of Nimshi, whom the Lord anointed to cut off the house of Ahab. "},{"num":8,"verse":"And it happened that when Jehu was acting in judgment with the house of Ahab that he found the rulers of Judah and the sons of the brothers of Ahaziah, who were serving Ahaziah, and Jehu killed them. "},{"num":9,"verse":"He sought out Ahaziah, and they captured him while he hid in Samaria, and they brought him to Jehu, and they put him to death. And they buried him because they said, “He is the grandson of Jehoshaphat who sought the Lord with all his heart.” And there was no one from the house of Ahaziah strong enough to retain the kingdom."},{"header":"Athaliah Seizes the Throne(B)"},{"num":10,"verse":"So when Athaliah the mother of Ahaziah saw that her son was dead, she rose up and mounted a campaign to destroy all the royal offspring of the house of Judah. "},{"num":11,"verse":"But Jehoshabeath, the daughter of the king, took Joash the son of Ahaziah and stole him away from the king’s sons who were going to be put to death, and she placed him and his nurse in a bed chamber. So Jehoshabeath, the daughter of King Jehoram and wife of Jehoiada the priest (since she was a sister of Ahaziah), hid Joash from Athaliah. And she did not put the royal child to death. "},{"num":12,"verse":"And he was hidden away with them in the house of God for six years. And Athaliah ruled over the land."}]