[{"num":22,"verse":"And the inhabitants of Yerushalayim made Achazyahu (Ahaziah of Judah) his (i.e., Yehoram’s) youngest son melech in his place; for the troops that came with the Arabs into the machaneh had slain all the eldest. So Achazyahu (Ahaziah) ben Yehoram Melech Yehudah reigned."},{"num":2,"verse":"Twenty and two years old was Achazyahu (Ahaziah) when he began to reign, and he reigned one year in Yerushalayim And shem immo was Atalyah bat Omri (i.e., granddaughter of Omri the father of Ahab)."},{"num":3,"verse":"He also walked in the darkhei Bais Ach’av (Ahab); for immo (his mother) was his counselor to do rah."},{"num":4,"verse":"Therefore he did rah in the eyes of Hashem like the Bais Ach’av (House of Ahab); for they were his yo’atzim (counselors) after the mot (death) of his av to his (i.e., Achazyahu’s, Ahaziah’s) ruin."},{"num":5,"verse":"He walked also after their etza (advice, counsel), and went with Yehoram ben Ach’av Melech Yisroel to war against Chatzael Melech Aram (Syria) at Ramot Gil’ad; and the Syrians wounded Yoram."},{"num":6,"verse":"And he (Yoram) returned to Yizre’el (Jezreel) to recover from his wounds which were inflicted upon him at Ramah, when he fought with Chatzael Melech Aram. And Achazyahu (Ahaziah) ben Yehoram Melech Yehudah went down to see Yehoram ben Ach’av at Yizre’el (Jezreel), because he was wounded."},{"num":7,"verse":"And the tevusat Achazyahu (downfall of Ahaziah) was of Elohim in coming to Yoram, for when he arrived, he went out with Yehoram against Yehu ben Nimshi, whom Hashem had anointed to cut off the Bais Ach’av (the House of Ahab)."},{"num":8,"verse":"And it came to pass, that, when Yehu was executing mishpat upon the Bais Ach’av, and found the sarei Yehudah, and the bnei achei Achazyahu that were in attendance with Achazyahu, he slaughtered them."},{"num":9,"verse":"And he searched for Achazyahu, and they captured him while he was hiding in Shomron (Samaria), and brought him to Yehu; and when they had slain him, they buried him. Because, they said, he is a ben Yehoshaphat, who sought Hashem with all his levav. So the Bais Achazyahu had no koach to retain the mamlachah (kingdom)."},{"num":10,"verse":"But when Atalyah em Achazyahu saw that her son was dead, she arose and began destroying kol zera hamamlachah (all the royal seed) of the Bais Yehudah."},{"num":11,"verse":"But Yehoshavat Bat HaMelech, took Yoash ben Achazyahu, and stole him away from among the Bnei HaMelech that were being murdered, and put him and his nurse in a cheder hamittot (bedroom). So Yehoshavat Bat HaMelech Yehoram, the isha of Yehoyada HaKohen, (for she was the achot of Achazyahu), hid him from Atalyah, so that she slaughtered him not."},{"num":12,"verse":"And he was with them hid in the Bais Elohim shesh shanim. And Atalyah reigned over HaAretz."}]