[{"num":22,"verse":"Since the Philistines and Arabs had killed all of Jehoram’s older sons when they plundered the palace, the citizens of Jerusalem made Ahaziah, his youngest son, king. "},{"num":2,"verse":"Ahaziah was 22 years old when he became king, and he ruled for only one year in Jerusalem."},{"num":3,"verse":"Since his mother and her relatives were his counselors during his reign, Ahaziah followed the gods worshiped by the Northern Kingdom, and performed evil deeds before the Eternal as the house of Ahab did. By following this bad advice, Ahaziah ensured his destruction. "},{"num":5,"verse":"He repeated the mistake of Jehoshaphat and followed Jehoram, the son of Ahab king of the Northern Kingdom, to fight Hazael, king of Aram, at Ramoth-gilead. When the Arameans wounded Joram, he returned to Jezreel to heal his wounds and Ahaziah went to visit him there."},{"num":7,"verse":"Ahaziah’s destruction by the True God was decided when he visited Joram because his visit coincided with the attack Jehu, the son of Nimshi, executed on Jezreel. (The Eternal had incited Jehu to destroy the house of Ahab.) "},{"num":8,"verse":"During his assault, Jehu found Ahaziah’s sons and nephews who served him and killed them. "},{"num":9,"verse":"Then Jehu looked for Ahaziah and found him cowering in Samaria. Jehu’s forces brought Ahaziah to Jehu, killed him, and buried him. He was given a burial only because of his descent from Jehoshaphat, who looked for the Eternal and followed His commands. Because of Jehu’s slaughter, no one from Ahaziah’s immediate family lived to inherit the kingdom."},{"num":10,"verse":"When Athaliah realized that her son Ahaziah had died along with all of the royal line, she decided to kill her opponents—the remaining royal offspring of the Southern Kingdom."},{"num":11,"verse":"But little did she know that Jehoshabeath, King Jehoram’s daughter, had stolen Ahaziah’s son Joash from among the king’s sons when Jehu’s soldiers were killing them. She hid Joash and his nurse in a bedroom. So Jehoshabeath, the daughter of King Jehoram and the sister of King Ahaziah, saved the Davidic line by protecting him from Athaliah’s murderous rage. Since she was the wife of Jehoiada the priest, Jehoshabeath "},{"num":12,"verse":"was able to hide Joash and his nurse in the temple of the True God during the six years of Athaliah’s reign."}]