[{"num":24,"verse":"2 Joshua rehearseth God’s benefits,  14 and exhorteth the people to fear God. 25 The league renewed between God and the people. 29 Joshua dieth. 32 The bones of Joseph are buried. 33 Eleazar dieth."},{"num":1,"verse":"And Joshua assembled again all the tribes of Israel to Shechem, and called the Elders of Israel, and their heads, and their Judges, and their officers, and they presented themselves before God."},{"num":2,"verse":"Then Joshua said unto all the people, Thus saith the Lord God of Israel, Your fathers dwelt beyond the flood in old time, even Terah the father of Abraham, and the father of Nachor, and served other gods."},{"num":3,"verse":"And I took your father Abraham from beyond the flood, and brought him through all the land of Canaan, and multiplied his seed, and gave him Isaac."},{"num":4,"verse":"And I gave unto Isaac, Jacob and Esau: and I gave unto Esau mount Seir, to possess it: but Jacob and his children went down into Egypt."},{"num":5,"verse":"I sent Moses also and Aaron, and I plagued Egypt: and when I had so done among them, I brought you out."},{"num":6,"verse":"So I brought your fathers out of Egypt, and ye came unto the Sea, and the Egyptians pursued after your fathers with chariots and horsemen unto the red Sea."},{"num":7,"verse":"Then they cried unto the Lord, and he put a darkness between you and the Egyptians, and brought the Sea upon them, and covered them: so your eyes have seen what I have done in Egypt: also ye dwelt in the wilderness a long season."},{"num":8,"verse":"After, I brought you into the land of the Amorites, which dwelt beyond Jordan, and they fought with you: but I gave them into your hand, and ye possessed their country, and I destroyed them out of your sight."},{"num":9,"verse":"Also Balak the son of Zippor king of Moab, arose and warred against Israel, and sent to Balaam the son of Beor for to curse you,"},{"num":10,"verse":"But I would not hear Balaam: therefore he blessed you, and I delivered you out of his hand."},{"num":11,"verse":"And ye went over Jordan, and came unto Jericho, and the men of Jericho fought against you, the Amorites, and the Perizzites, and the Canaanites, and the Hittites, and the Girgashites, the Hivites, and the Jebusites, and I delivered them into your hand."},{"num":12,"verse":"And I sent hornets before you, which cast them out before you, even the two kings of the Amorites, and not with thy sword, nor with thy bow."},{"num":13,"verse":"And I have given you a land, wherein ye did not labor, and cities which ye built not, and ye dwell in them, and eat of the vineyards and olive trees, which ye planted not."},{"num":14,"verse":"Now therefore fear the Lord, and serve him in uprightness and in truth, and put away the gods, which your fathers served beyond the flood, and in Egypt, and serve ye the Lord."},{"num":15,"verse":"And if it seem evil unto you to serve the Lord, choose you this day whom ye will serve, whether the gods which your fathers served (that were beyond the flood) or the gods of the Amorites, in whose land ye dwell: but I and mine house will serve the Lord."},{"num":16,"verse":"Then the people answered and said, God forbid, that we should forsake the Lord, to serve other gods."},{"num":17,"verse":"For the Lord our God, he brought us and our fathers out of the land of Egypt, from the house of bondage, and he did those great miracles in our sight, and preserved us in all the way that we went, and among all the people through whom we came."},{"num":18,"verse":"And the Lord did cast out before us all the people, even the Amorites which dwelt in the land: therefore will we also serve the Lord, for he is our God."},{"num":19,"verse":"And Joshua said unto the people, Ye cannot serve the Lord: for he is an holy God: he is a jealous God: he will not pardon your iniquity nor your sins."},{"num":20,"verse":"If ye forsake the Lord and serve strange gods, then he will return and bring evil upon you, and consume you, after that he hath done you good."},{"num":21,"verse":"And the people said unto Joshua, Nay, but we will serve the Lord."},{"num":22,"verse":"And Joshua said unto the people, Ye are witnesses against yourselves, that ye have chosen you the Lord, to serve him: and they said, We are witnesses."},{"num":23,"verse":"Then put away now, said he, the strange gods which are among you, and bow your hearts unto the Lord God of Israel."},{"num":24,"verse":"And the people said unto Joshua, The Lord our God will we serve, and his voice will we obey."},{"num":25,"verse":"So Joshua made a covenant with the people the same day, and gave them an ordinance and law in Shechem."},{"num":26,"verse":"And Joshua wrote these words in the book of the Law of God and took a great stone, and pitched it there under an oak that was in the Sanctuary of the Lord."},{"num":27,"verse":"And Joshua said unto all the people, Behold, this stone shall be a witness unto us: for it hath heard all the words of the Lord which he spake with us: it shall be therefore a witness against you, lest you deny your God."},{"num":28,"verse":"Then Joshua let the people depart, every man unto his inheritance."},{"num":29,"verse":"And after these things, Joshua the son of Nun, the servant of the Lord died, being an hundred and ten years old."},{"num":30,"verse":"And they buried him in the border of his inheritance in Timnath Serah, which is in mount Ephraim, on the North side of mount Gaash."},{"num":31,"verse":"And Israel served the Lord all the days of Joshua, and all the days of the Elders that overlived Joshua, and which had known all the works of the Lord that he had done for Israel."},{"num":32,"verse":"And the bones of Joseph, which the children of Israel brought out of Egypt, buried they in Shechem in a parcel of ground, which Jacob bought of the sons of Hamor the father of Shechem, for an hundred pieces of silver, and the children of Joseph had them in their inheritance."},{"num":33,"verse":"Also Eleazar the son of Aaron died, whom they buried in the hill of Phinehas his son, which was given him in mount Ephraim."}]