[{"num":24,"verse":"Joshua gathered all the tribes of Israel together at Shechem. He called the elders, heads of families, judges, and officers of Israel to stand before God."},{"num":2,"verse":"Then Joshua said to all the people, “Here’s what the Lord, the God of Israel, says to you: ‘A long time ago your ancestors lived on the other side of the Euphrates River. Terah, the father of Abraham and Nahor, worshiped other gods. "},{"num":3,"verse":"But I, the Lord, took your ancestor Abraham from the other side of the river and led him through the land of Canaan. And I gave him many children, including his son Isaac. "},{"num":4,"verse":"I gave Isaac two sons named Jacob and Esau. I gave the land around the mountains of Edom to Esau, but Jacob and his sons went down to Egypt. "},{"num":5,"verse":"Then I sent Moses and Aaron to Egypt, where I brought many disasters on the Egyptians. Afterwards I brought you out. "},{"num":6,"verse":"When I brought your ancestors out of Egypt, they came to the Red Sea, and the Egyptians chased them with chariots and men on horses. "},{"num":7,"verse":"So the people called out to the Lord. And I brought darkness between you and the Egyptians and made the sea to cover them. You yourselves saw what I did to the army of Egypt. After that, you lived in the desert for a long time."},{"num":8,"verse":"“‘Then I brought you to the land of the Amorites, east of the Jordan River. They fought against you, but I handed them over to you. I destroyed them before you, and you took control of that land. "},{"num":9,"verse":"But the king of Moab, Balak son of Zippor, prepared to fight against the Israelites. The king sent for Balaam son of Beor to curse you, "},{"num":10,"verse":"but I refused to listen to Balaam. So he asked for good things to happen to you! I saved you and brought you out of his power."},{"num":11,"verse":"“‘Then you crossed the Jordan River and came to Jericho, where the people of Jericho fought against you. Also, the Amorites, Perizzites, Canaanites, Hittites, Girgashites, Hivites, and Jebusites fought against you. But I handed them over to you. "},{"num":12,"verse":"I sent terror ahead of you to force out two Amorite kings. You took the land without using swords and bows. "},{"num":13,"verse":"I gave you that land where you did not have to work. I gave you cities that you did not have to build. And now you live in that land and in those cities, and you eat from vineyards and olive trees that you did not plant.’”"},{"num":14,"verse":"Then Joshua said to the people, “Now respect the Lord and serve him fully and sincerely. Throw away the gods that your ancestors worshiped on the other side of the Euphrates River and in Egypt. Serve the Lord. "},{"num":15,"verse":"But if you don’t want to serve the Lord, you must choose for yourselves today whom you will serve. You may serve the gods that your ancestors worshiped when they lived on the other side of the Euphrates River, or you may serve the gods of the Amorites who lived in this land. As for me and my family, we will serve the Lord.”"},{"num":16,"verse":"Then the people answered, “We will never stop following the Lord to serve other gods! "},{"num":17,"verse":"It was the Lord our God who brought our ancestors out of Egypt. We were slaves in that land, but the Lord did great things for us there. He brought us out and protected us while we traveled through other lands. "},{"num":18,"verse":"Then he forced out all the people living in these lands, even the Amorites. So we will serve the Lord, because he is our God.”"},{"num":19,"verse":"Then Joshua said, “You are not able to serve the Lord, because he is a holy God and a jealous God. If you turn against him and sin, he will not forgive you. "},{"num":20,"verse":"If you leave the Lord and serve other gods, he will send you great trouble. The Lord may have been good to you, but if you turn against him, he will destroy you.”"},{"num":21,"verse":"But the people said to Joshua, “No! We will serve the Lord.”"},{"num":22,"verse":"Then Joshua said, “You are your own witnesses that you have chosen to serve the Lord.”"},{"num":23,"verse":"Then Joshua said, “Now throw away the gods that you have. Love the Lord, the God of Israel, with all your heart.”"},{"num":24,"verse":"Then the people said to Joshua, “We will serve the Lord our God, and we will obey him.”"},{"num":25,"verse":"On that day at Shechem Joshua made an agreement for the people. He made rules and laws for them to follow. "},{"num":26,"verse":"Joshua wrote these things in the Book of the Teachings of God. Then he took a large stone and set it up under the oak tree near the Lord’s Holy Tent."},{"num":27,"verse":"Joshua said to all the people, “See this stone! It will remind you of what we did today. It was here the Lord spoke to us today. It will remind you of what happened so you will not turn against your God.”"},{"header":"Joshua Dies"},{"num":28,"verse":"Then Joshua sent the people back to their land."},{"num":29,"verse":"After that, Joshua son of Nun died at the age of one hundred ten. "},{"num":30,"verse":"They buried him in his own land at Timnath Serah, in the mountains of Ephraim, north of Mount Gaash."},{"num":31,"verse":"The Israelites served the Lord during the lifetime of Joshua and during the lifetimes of the elders who lived after Joshua who had seen what the Lord had done for Israel."},{"header":"Joseph Comes Home"},{"num":32,"verse":"When the Israelites left Egypt, they carried the bones of Joseph with them. They buried them at Shechem, in the land Jacob had bought for a hundred pieces of silver from the sons of Hamor (Hamor was the father of Shechem). This land now belonged to Joseph’s children."},{"num":33,"verse":"And Eleazar son of Aaron died and was buried at Gibeah in the mountains of Ephraim, which had been given to Eleazar’s son Phinehas."}]