[{"num":24,"verse":"Then Joshua summoned all the people of Israel to him at Shechem, along with their leaders—the elders, officers, and judges. So they came and presented themselves before God."},{"num":2,"verse":"Then Joshua addressed them as follows: “The Lord God of Israel says, ‘Your ancestors, including Terah the father of Abraham and Nahor, lived east of the Euphrates River; and they worshiped other gods. "},{"num":3,"verse":"But I took your father Abraham from that land across the river and led him into the land of Canaan and gave him many descendants through Isaac, his son. "},{"num":4,"verse":"Isaac’s children, whom I gave him, were Jacob and Esau. To Esau I gave the area around Mount Seir while Jacob and his children went into Egypt."},{"num":5,"verse":"“‘Then I sent Moses and Aaron to bring terrible plagues upon Egypt; and afterwards I brought my people out as free men. "},{"num":6,"verse":"But when they arrived at the Red Sea, the Egyptians chased after them with chariots and cavalry. "},{"num":7,"verse":"Then Israel cried out to me and I put darkness between them and the Egyptians; and I brought the sea crashing in upon the Egyptians, drowning them. You saw what I did. Then Israel lived in the wilderness for many years."},{"num":8,"verse":"“‘Finally I brought you into the land of the Amorites on the other side of the Jordan; and they fought against you, but I destroyed them and gave you their land. "},{"num":9,"verse":"Then King Balak of Moab started a war against Israel, and he asked Balaam, the son of Beor, to curse you. "},{"num":10,"verse":"But I wouldn’t listen to him. Instead I made him bless you; and so I delivered Israel from him."},{"num":11,"verse":"“‘Then you crossed the Jordan River and came to Jericho. The men of Jericho fought against you, and so did many others—the Perizzites, the Canaanites, the Hittites, the Girgashites, the Hivites, and the Jebusites. Each in turn fought against you, but I destroyed them all. "},{"num":12,"verse":"And I sent hornets ahead of you to drive out the two kings of the Amorites and their people. It was not your swords or bows that brought you victory! "},{"num":13,"verse":"I gave you land you had not worked for and cities you did not build—these cities where you are now living. I gave you vineyards and olive groves for food, though you did not plant them.’"},{"num":14,"verse":"“So revere Jehovah and serve him in sincerity and truth. Put away forever the idols your ancestors worshiped when they lived beyond the Euphrates River and in Egypt. Worship the Lord alone. "},{"num":15,"verse":"But if you are unwilling to obey the Lord, then decide today whom you will obey. Will it be the gods of your ancestors beyond the Euphrates or the gods of the Amorites here in this land? But as for me and my family, we will serve the Lord.”"},{"num":16,"verse":"And the people replied, “We would never forsake the Lord and worship other gods! "},{"num":17,"verse":"For the Lord our God is the one who rescued our fathers from their slavery in the land of Egypt. He is the God who did mighty miracles before the eyes of Israel, as we traveled through the wilderness, and preserved us from our enemies when we passed through their land. "},{"num":18,"verse":"It was the Lord who drove out the Amorites and the other nations living here in the land. Yes, we choose the Lord, for he alone is our God.”"},{"num":19,"verse":"But Joshua replied to the people, “You can’t worship the Lord God, for he is holy and jealous; he will not forgive your rebellion and sins. "},{"num":20,"verse":"If you forsake him and worship other gods, he will turn upon you and destroy you, even though he has taken care of you for such a long time.”"},{"num":21,"verse":"But the people answered, “We choose the Lord!”"},{"num":22,"verse":"“You have heard yourselves say it,” Joshua said. “You have chosen to obey the Lord.”"},{"num":23,"verse":"“All right,” he said, “then you must destroy all the idols you now own, and you must obey the Lord God of Israel.”"},{"num":24,"verse":"The people replied to Joshua, “Yes, we will worship and obey the Lord alone.”"},{"num":25,"verse":"So Joshua made a covenant with them that day at Shechem, committing them to a permanent and binding contract between themselves and God. "},{"num":26,"verse":"Joshua recorded the people’s reply in the book of the laws of God and took a huge stone as a reminder and rolled it beneath the oak tree that was beside the Tabernacle."},{"num":27,"verse":"Then Joshua said to all the people, “This stone has heard everything the Lord said, so it will be a witness to testify against you if you go back on your word.”"},{"num":28,"verse":"Then Joshua sent the people away to their own sections of the country."},{"num":29,"verse":"Soon after this he died at the age of 110. "},{"num":30,"verse":"He was buried on his own estate at Timnath-serah, in the hill country of Ephraim, on the north side of the mountains of Gaash."},{"num":31,"verse":"Israel obeyed the Lord throughout the lifetimes of Joshua and the other old men who had personally witnessed the amazing deeds the Lord had done for Israel."},{"num":32,"verse":"The bones of Joseph, which the people of Israel had brought along when they left Egypt, were buried in Shechem, in the parcel of ground Jacob had bought from the sons of Hamor. (The land was located in the territory assigned to the tribes of Joseph.)"},{"num":33,"verse":"Eleazar, the son of Aaron, also died; he was buried in the hill country of Ephraim, at Gibeah, the city that had been given to his son Phinehas."}]