[[],[{"type":"header","content":"The Temple, Filled with the Presence of God"},{"type":"prose","content":"When I next looked, oh! Above the dome over the heads of the cherubim-angels was what looked like a throne, sky-blue, like a sapphire!"}],[{"type":"prose","content":" said to the man dressed in linen, “Enter the place of the wheels under the cherubim-angels. Fill your hands with burning coals from beneath the cherubim and scatter them over the city.”I watched as he entered. The cherubim were standing on the south side of the Temple when the man entered. A cloud filled the inside courtyard. Then the Glory of  ascended from the cherubim and moved to the threshold of the Temple. The cloud filled the Temple. Court and Temple were both filled with the blazing presence of the Glory of . And the sound! The wings of the cherubim were audible all the way to the outer court—the sound of the voice was like The Strong God in thunder."}],[{"type":"prose","content":"When  commanded the man dressed in linen, “Take fire from among the wheels, from between the cherubim,” he went in and stood beside a wheel. One of the cherubim reached into the fire, took some coals, and put them in the hands of the man dressed in linen. He took them and went out. Something that looked like a human hand could be seen under the wings of the cherubim."}],[{"type":"prose","content":"And then I saw four wheels beside the cherubim, one beside each cherub. The wheels radiating were sparkling like diamonds in the sun. All four wheels looked alike, each like a wheel within a wheel. When they moved, they went in any of the four directions but in a perfectly straight line. Where the cherubim went, the wheels went straight ahead. The cherubim were full of eyes in their backs, hands, and wings. The wheels likewise were full of eyes. I heard the wheels called “wheels within wheels.”"}],[{"type":"prose","content":"Each of the cherubim had four faces: the first, of an angel; the second, a human; the third, a lion; the fourth, an eagle."}],[{"type":"prose","content":"Then the cherubim ascended. They were the same living creatures I had seen at the Kebar River. When the cherubim moved, the wheels beside them moved. When the cherubim spread their wings to take off from the ground, the wheels stayed right with them. When the cherubim stopped, the wheels stopped. When the cherubim rose, the wheels rose, because the spirit of the living creatures was also in the wheels."}],[{"type":"prose","content":"Then the Glory of  left the Temple entrance and hovered over the cherubim. I watched as the cherubim spread their wings and left the ground, the wheels right with them. They stopped at the entrance of the east gate of the Temple. The Glory of the God of Israel was above them."}],[{"type":"prose","content":"These were the same living creatures I had seen previously beneath the God of Israel at the Kebar River. I recognized them as cherubim. Each had four faces and four wings. Under their wings were what looked like human hands. Their faces looked exactly like those I had seen at the Kebar River. Each went straight ahead."}]]