[{"header":"The Glory of the Lord Moves Out of the Temple"},{"num":10,"verse":"I looked up and saw something that appeared to be a throne made out of lapis lazuli. It was above the huge space that was spread out over the heads of the cherubim. "},{"num":2,"verse":"The Lord spoke to the man who was wearing linen clothes. He said, “Go in among the wheels beneath the cherubim. Fill your hands with burning coals from the fire that is among the cherubim. Scatter the coals over the city.” As I watched, he went in."},{"num":3,"verse":"The cherubim were standing on the south side of the temple when the man went in. A cloud filled the inner courtyard. "},{"num":4,"verse":"Then the glory of the Lord rose from above the cherubim. It moved to the doorway of the temple. The cloud filled the temple. And the courtyard was full of the brightness of the glory of the Lord. "},{"num":5,"verse":"The sound the wings of the cherubim made could be heard as far away as the outer courtyard. It was like the voice of the Mighty God when he speaks."},{"num":6,"verse":"The Lord gave a command to the man who was dressed in linen clothes. He said, “Get some coals of fire from among the wheels. Take them from among the cherubim.” So the man went in and stood beside a wheel. "},{"num":7,"verse":"Then one of the cherubim reached out his hand. He picked up some of the burning coals that were among the wheels. He handed them to the man who was wearing linen clothes. The man took them and left. "},{"num":8,"verse":"I saw what looked like human hands. They were under the wings of the cherubim."},{"num":9,"verse":"I looked up and saw four wheels beside the cherubim. One wheel was beside each of them. The wheels gleamed like topaz. "},{"num":10,"verse":"All four of them looked alike. Each wheel appeared to be inside another wheel at right angles. "},{"num":11,"verse":"The wheels could go in any one of the four directions the cherubim faced. The wheels didn’t change their direction as the cherubim moved. The cherubim went in the direction their heads faced. They didn’t change their direction as they moved. "},{"num":12,"verse":"Their whole bodies were completely covered with eyes. That included their backs, hands and wings. Their four wheels were covered with eyes too. "},{"num":13,"verse":"I heard someone tell the wheels to start spinning around. "},{"num":14,"verse":"Each of the cherubim had four faces. One face was the face of a cherub. The second was the face of a human being. The third was the face of a lion. And the fourth was an eagle’s face."},{"num":15,"verse":"The cherubim rose from the ground. They were the same living creatures I had seen by the Kebar River. "},{"num":16,"verse":"When the cherubim moved, the wheels beside them moved. The cherubim spread their wings to rise from the ground. As they did, the wheels didn’t leave their side. "},{"num":17,"verse":"When the cherubim stood still, the wheels also stood still. When the cherubim rose, the wheels rose along with them. That’s because the spirits of the living creatures were in the wheels."},{"num":18,"verse":"Then the glory of the Lord moved away from the doorway of the temple. It stopped above the cherubim. "},{"num":19,"verse":"While I watched, they spread their wings. They rose from the ground. As they went, the wheels went along with them. They stopped at the entrance of the east gate of the Lord’s house. And the glory of the God of Israel was above them."},{"num":20,"verse":"These were the same living creatures I had seen by the Kebar River. I had seen them beneath the God of Israel. I realized that they were cherubim. "},{"num":21,"verse":"Each one had four faces and four wings. Under their wings was what looked like human hands. "},{"num":22,"verse":"Their faces looked the same as the ones I had seen by the Kebar River. Each of the cherubim went straight ahead."}]