[{"header":"Jesus Teaches about Divorce(A)"},{"num":10,"verse":"Then Jesus left that place, went to the province of Judea, and crossed the Jordan River. Crowds came flocking to him again, and he taught them, as he always did."},{"num":2,"verse":"Some Pharisees came to him and tried to trap him. “Tell us,” they asked, “does our Law allow a man to divorce his wife?”"},{"num":3,"verse":"Jesus answered with a question, “What law did Moses give you?”"},{"num":4,"verse":"Their answer was, “Moses gave permission for a man to write a divorce notice and send his wife away.”"},{"num":5,"verse":"Jesus said to them, “Moses wrote this law for you because you are so hard to teach. "},{"num":6,"verse":"But in the beginning, at the time of creation, ‘God made them male and female,’ as the scripture says. "},{"num":7,"verse":"‘And for this reason a man will leave his father and mother and unite with his wife, "},{"num":8,"verse":"and the two will become one.’ So they are no longer two, but one. "},{"num":9,"verse":"No human being must separate, then, what God has joined together.”"},{"num":10,"verse":"When they went back into the house, the disciples asked Jesus about this matter. "},{"num":11,"verse":"He said to them, “A man who divorces his wife and marries another woman commits adultery against his wife. "},{"num":12,"verse":"In the same way, a woman who divorces her husband and marries another man commits adultery.”"},{"header":"Jesus Blesses Little Children(F)"},{"num":13,"verse":"Some people brought children to Jesus for him to place his hands on them, but the disciples scolded the people. "},{"num":14,"verse":"When Jesus noticed this, he was angry and said to his disciples, “Let the children come to me, and do not stop them, because the Kingdom of God belongs to such as these. "},{"num":15,"verse":"I assure you that whoever does not receive the Kingdom of God like a child will never enter it.” "},{"num":16,"verse":"Then he took the children in his arms, placed his hands on each of them, and blessed them."},{"header":"The Rich Man(H)"},{"num":17,"verse":"As Jesus was starting on his way again, a man ran up, knelt before him, and asked him, “Good Teacher, what must I do to receive eternal life?”"},{"num":18,"verse":"“Why do you call me good?” Jesus asked him. “No one is good except God alone. "},{"num":19,"verse":"You know the commandments: ‘Do not commit murder; do not commit adultery; do not steal; do not accuse anyone falsely; do not cheat; respect your father and your mother.’”"},{"num":20,"verse":"“Teacher,” the man said, “ever since I was young, I have obeyed all these commandments.”"},{"num":21,"verse":"Jesus looked straight at him with love and said, “You need only one thing. Go and sell all you have and give the money to the poor, and you will have riches in heaven; then come and follow me.” "},{"num":22,"verse":"When the man heard this, gloom spread over his face, and he went away sad, because he was very rich."},{"num":23,"verse":"Jesus looked around at his disciples and said to them, “How hard it will be for rich people to enter the Kingdom of God!”"},{"num":24,"verse":"The disciples were shocked at these words, but Jesus went on to say, “My children, how hard it is to enter the Kingdom of God! "},{"num":25,"verse":"It is much harder for a rich person to enter the Kingdom of God than for a camel to go through the eye of a needle.”"},{"num":26,"verse":"At this the disciples were completely amazed and asked one another, “Who, then, can be saved?”"},{"num":27,"verse":"Jesus looked straight at them and answered, “This is impossible for human beings but not for God; everything is possible for God.”"},{"num":28,"verse":"Then Peter spoke up, “Look, we have left everything and followed you.”"},{"num":29,"verse":"“Yes,” Jesus said to them, “and I tell you that those who leave home or brothers or sisters or mother or father or children or fields for me and for the gospel, "},{"num":30,"verse":"will receive much more in this present age. They will receive a hundred times more houses, brothers, sisters, mothers, children, and fields—and persecutions as well; and in the age to come they will receive eternal life. "},{"num":31,"verse":"But many who are now first will be last, and many who are now last will be first.”"},{"header":"Jesus Speaks a Third Time about His Death(K)"},{"num":32,"verse":"Jesus and his disciples were now on the road going up to Jerusalem. Jesus was going ahead of the disciples, who were filled with alarm; the people who followed behind were afraid. Once again Jesus took the twelve disciples aside and spoke of the things that were going to happen to him. "},{"num":33,"verse":"“Listen,” he told them, “we are going up to Jerusalem where the Son of Man will be handed over to the chief priests and the teachers of the Law. They will condemn him to death and then hand him over to the Gentiles, "},{"num":34,"verse":"who will make fun of him, spit on him, whip him, and kill him; but three days later he will rise to life.”"},{"header":"The Request of James and John(L)"},{"num":35,"verse":"Then James and John, the sons of Zebedee, came to Jesus. “Teacher,” they said, “there is something we want you to do for us.”"},{"num":36,"verse":"“What is it?” Jesus asked them."},{"num":37,"verse":"They answered, “When you sit on your throne in your glorious Kingdom, we want you to let us sit with you, one at your right and one at your left.”"},{"num":38,"verse":"Jesus said to them, “You don't know what you are asking for. Can you drink the cup of suffering that I must drink? Can you be baptized in the way I must be baptized?”"},{"num":39,"verse":"“We can,” they answered."},{"num":40,"verse":"But I do not have the right to choose who will sit at my right and my left. It is God who will give these places to those for whom he has prepared them.”"},{"num":41,"verse":"When the other ten disciples heard about it, they became angry with James and John. "},{"num":42,"verse":"So Jesus called them all together to him and said, “You know that those who are considered rulers of the heathen have power over them, and the leaders have complete authority. "},{"num":43,"verse":"This, however, is not the way it is among you. If one of you wants to be great, you must be the servant of the rest; "},{"num":44,"verse":"and if one of you wants to be first, you must be the slave of all. "},{"num":45,"verse":"For even the Son of Man did not come to be served; he came to serve and to give his life to redeem many people.”"},{"header":"Jesus Heals Blind Bartimaeus(P)"},{"num":46,"verse":"They came to Jericho, and as Jesus was leaving with his disciples and a large crowd, a blind beggar named Bartimaeus son of Timaeus was sitting by the road. "},{"num":47,"verse":"When he heard that it was Jesus of Nazareth, he began to shout, “Jesus! Son of David! Have mercy on me!”"},{"num":48,"verse":"Many of the people scolded him and told him to be quiet. But he shouted even more loudly, “Son of David, have mercy on me!”"},{"num":49,"verse":"Jesus stopped and said, “Call him.”"},{"num":50,"verse":"So he threw off his cloak, jumped up, and came to Jesus."},{"num":51,"verse":"“What do you want me to do for you?” Jesus asked him."},{"num":52,"verse":"“Go,” Jesus told him, “your faith has made you well.”"}]