[{"header":"Jesus Teaches About Divorce"},{"num":10,"verse":"Then Jesus left that place and went into the area of Judea and across the Jordan River. Again, crowds came to him, and he taught them as he usually did."},{"num":2,"verse":"Some Pharisees came to Jesus and tried to trick him. They asked, “Is it right for a man to divorce his wife?”"},{"num":3,"verse":"Jesus answered, “What did Moses command you to do?”"},{"num":4,"verse":"They said, “Moses allowed a man to write out divorce papers and send her away.”"},{"num":5,"verse":"Jesus said, “Moses wrote that command for you because you were stubborn. "},{"num":10,"verse":"Later, in the house, his followers asked Jesus again about the question of divorce. "},{"num":11,"verse":"He answered, “Anyone who divorces his wife and marries another woman is guilty of adultery against her. "},{"header":"Jesus Accepts Children"},{"num":13,"verse":"Some people brought their little children to Jesus so he could touch them, but his followers told them to stop. "},{"num":14,"verse":"When Jesus saw this, he was upset and said to them, “Let the little children come to me. Don’t stop them, because the kingdom of God belongs to people who are like these children. "},{"num":16,"verse":"Then Jesus took the children in his arms, put his hands on them, and blessed them."},{"header":"A Rich Young Man’s Question"},{"num":17,"verse":"As Jesus started to leave, a man ran to him and fell on his knees before Jesus. The man asked, “Good teacher, what must I do to have life forever?”"},{"num":18,"verse":"Jesus answered, “Why do you call me good? Only God is good. "},{"num":20,"verse":"The man said, “Teacher, I have obeyed all these things since I was a boy.”"},{"num":21,"verse":"Jesus, looking at the man, loved him and said, “There is one more thing you need to do. Go and sell everything you have, and give the money to the poor, and you will have treasure in heaven. Then come and follow me.”"},{"num":22,"verse":"He was very sad to hear Jesus say this, and he left sorrowfully, because he was rich."},{"num":23,"verse":"Then Jesus looked at his followers and said, “How hard it will be for the rich to enter the kingdom of God!”"},{"num":24,"verse":"The followers were amazed at what Jesus said. But he said again, “My children, it is very hard to enter the kingdom of God! "},{"num":26,"verse":"The followers were even more surprised and said to each other, “Then who can be saved?”"},{"num":27,"verse":"Jesus looked at them and said, “For people this is impossible, but for God all things are possible.”"},{"num":28,"verse":"Peter said to Jesus, “Look, we have left everything and followed you.”"},{"num":29,"verse":"Jesus said, “I tell you the truth, all those who have left houses, brothers, sisters, mother, father, children, or farms for me and for the Good News "},{"header":"Jesus Talks About His Death"},{"num":32,"verse":"As Jesus and the people with him were on the road to Jerusalem, he was leading the way. His followers were amazed, but others in the crowd who followed were afraid. Again Jesus took the twelve apostles aside and began to tell them what was about to happen in Jerusalem. "},{"num":33,"verse":"He said, “Look, we are going to Jerusalem. The Son of Man will be turned over to the leading priests and the teachers of the law. They will say that he must die, and they will turn him over to the non-Jewish people, "},{"header":"Two Followers Ask Jesus a Favor"},{"num":35,"verse":"Then James and John, sons of Zebedee, came to Jesus and said, “Teacher, we want to ask you to do something for us.”"},{"num":36,"verse":"Jesus asked, “What do you want me to do for you?”"},{"num":37,"verse":"They answered, “Let one of us sit at your right side and one of us sit at your left side in your glory in your kingdom.”"},{"num":38,"verse":"Jesus said, “You don’t understand what you are asking. Can you drink the cup that I must drink? And can you be baptized with the same kind of baptism that I must go through?”"},{"num":39,"verse":"They answered, “Yes, we can.”"},{"num":41,"verse":"When the other ten followers heard this, they began to be angry with James and John."},{"num":42,"verse":"Jesus called them together and said, “The other nations have rulers. You know that those rulers love to show their power over the people, and their important leaders love to use all their authority. "},{"header":"Jesus Heals a Blind Man"},{"num":46,"verse":"Then they came to the town of Jericho. As Jesus was leaving there with his followers and a great many people, a blind beggar named Bartimaeus son of Timaeus was sitting by the road. "},{"num":47,"verse":"When he heard that Jesus from Nazareth was walking by, he began to shout, “Jesus, Son of David, have mercy on me!”"},{"num":48,"verse":"Many people warned the blind man to be quiet, but he shouted even more, “Son of David, have mercy on me!”"},{"num":49,"verse":"Jesus stopped and said, “Tell the man to come here.”"},{"num":50,"verse":"The blind man jumped up, left his coat there, and went to Jesus."},{"num":51,"verse":"Jesus asked him, “What do you want me to do for you?”"},{"num":52,"verse":"Jesus said, “Go, you are healed because you believed.” At once the man could see, and he followed Jesus on the road."}]