[{"header":"Abide in Marriage"},{"num":10,"verse":"Then getting up from there, Yeshua goes to the region of Judea beyond the Jordan. Again crowds gather around Him, and, as was His custom, He began to teach them once more."},{"num":2,"verse":"Pharisees came up, and to test Him they began asking, “Is it permitted for a man to divorce his wife?”"},{"num":3,"verse":"And He replied to them, “What did Moses command you?”"},{"num":4,"verse":"The Pharisees said, “Moses permitted a man to write a bill of divorce and to put her away.”"},{"num":5,"verse":"But Yeshua said to them, “Because of your hardness of heart he wrote you this commandment! "},{"num":6,"verse":"But from the beginning of creation, God ‘made them male and female. "},{"num":7,"verse":"For this reason a man shall leave his father and mother and be joined to his wife, "},{"num":8,"verse":"and the two shall become one flesh.’ So they are no longer two, but one flesh. "},{"num":9,"verse":"Therefore what God has joined together, let no man separate!”"},{"num":10,"verse":"In the house, the disciples began questioning Him about this again. "},{"num":11,"verse":"And He said to them, “Whoever divorces his wife and marries another commits adultery against her. "},{"num":12,"verse":"And if she divorces her husband and marries another, she is committing adultery.”"},{"header":"Let the Little Ones Come!"},{"num":13,"verse":"Now people were bringing little children to Yeshua so He might touch them, but the disciples rebuked those who brought them. "},{"num":14,"verse":"But when Yeshua saw this, He got angry. He told them, “Let the little children come to Me! Do not hinder them, for the kingdom of God belongs to such as these. "},{"num":15,"verse":"Amen, I tell you, whoever does not receive the kingdom of God like a little child will never enter it!” "},{"num":16,"verse":"And He took them in His arms and began blessing them, laying His hands on them."},{"header":"The Cost of Discipleship"},{"num":17,"verse":"As Yeshua was setting out on His way, a man ran up to Him, fell on his knees before Him, and asked, “Good Teacher, what shall I do to inherit eternal life?”"},{"num":18,"verse":"“Why do you call Me good?” Yeshua said to him. “No one is good except One—that is God. "},{"num":19,"verse":"You know the commandments, ‘Do not murder, do not commit adultery, do not steal, do not give false testimony,’ do not cheat, ‘honor your father and mother.’”"},{"num":20,"verse":"The man responded, “Teacher, all these I have kept since my youth!”"},{"num":21,"verse":"Looking at him, Yeshua loved him and said, “One thing you lack. Go, sell as much as you have, and give to the poor; and you will have treasure in heaven. Then come, follow Me.” "},{"num":22,"verse":"But at this statement, the man became sad and went away grieving, for he had much property."},{"num":23,"verse":"Then looking around, Yeshua says to His disciples, “How hard it will be for the rich to enter the kingdom of God!” "},{"num":24,"verse":"The disciples were amazed at His words. But Yeshua answers again and says to them, “Children, how hard it is to enter the kingdom of God! "},{"num":25,"verse":"It is easier for a camel to go through the eye of a needle, than for a rich man to enter the kingdom of God.”"},{"num":26,"verse":"The disciples were even more astonished, saying among themselves, “Then who can be saved?”"},{"num":27,"verse":"Looking at them, Yeshua said, “With men it is impossible, but not with God. For all things are possible with God!”"},{"num":28,"verse":"Peter began to say to Him, “Look, we’ve left everything to follow You!”"},{"num":29,"verse":"“Amen, I tell you,” Yeshua replied, “there is no one who has left house or brothers or sisters or mother or father or children or property, for My sake and for the sake of the Good News, "},{"num":30,"verse":"who will not receive a hundred times as much now in this time, houses and brothers and sisters and mothers and children and property, along with persecutions; and in the olam ha-ba, eternal life. "},{"num":31,"verse":"But many who are first will be last, and the last first.”"},{"header":"Death and Resurrection Revealed"},{"num":32,"verse":"They were on the way going up to Jerusalem, and Yeshua was going ahead of them. And they were amazed, while those who followed were fearful. Again Yeshua took the Twelve aside and began to tell them what was going to happen to Him."},{"num":33,"verse":"He said, “Look, we are going up to Jerusalem, and the Son of Man will be handed over to the ruling kohanim and the Torah scholars. They will condemn Him to death and hand Him over to the Gentiles."},{"num":34,"verse":" They will mock Him and spit on Him, scourge Him and kill Him. Yet after three days, He will rise again!”"},{"num":35,"verse":"Then Jacob and John, the sons of Zebedee, come up to Him, saying, “Teacher, we want You to do for us whatever we ask of You.”"},{"num":36,"verse":"And He said to them, “What do you want Me to do for you?”"},{"num":37,"verse":"They said to Him, “Let us sit, one on Your right and one on Your left, in Your glory.”"},{"num":38,"verse":"But Yeshua answered them, “You don’t know what you’re asking! Are you able to drink the cup I drink, or endure the immersion I must endure?”"},{"num":39,"verse":"They said to Him, “We are able.”"},{"num":40,"verse":"But to sit on My right or left is not Mine to grant—it is for those for whom it has been prepared.”"},{"num":41,"verse":"Now when the ten heard, they started to get angry with Jacob and John. "},{"num":42,"verse":"And calling them over, Yeshua said to them, “You know those recognized as rulers of the nations lord it over them, and their great ones play the tyrant over them. "},{"num":43,"verse":"Yet it is not this way among you. But whoever wants to be great among you shall be your servant, "},{"num":44,"verse":"and whoever wants to be first among you shall be slave of all. "},{"num":45,"verse":"For even the Son of Man did not come to be served, but to serve, and to give His life as a ransom for many.”"},{"header":"Ben-David Heals the Blind"},{"num":46,"verse":"Then they came to Jericho. Now as Yeshua was leaving Jericho with His disciples and a large crowd, Bartimaeus the son of Timaeus, a blind beggar, was sitting by the roadside. "},{"num":47,"verse":"When he heard that it was Yeshua of Natzeret, he began to cry out, “Ben-David, Yeshua! Have mercy on me!” "},{"num":48,"verse":"Many were warning him to be quiet; but he kept crying out all the more, “Ben-David, have mercy on me!”"},{"num":49,"verse":"Yeshua stopped and said, “Call him over.”"},{"num":50,"verse":"Throwing off his cloak, he jumped up and came to Yeshua."},{"num":51,"verse":"And answering him, Yeshua said, “What do you want Me to do for you?”"},{"num":52,"verse":"Yeshua said to him, “Go! Your faith has made you well.” Instantly he regained his sight and began following Yeshua down the road."}]