[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(17) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "World without end.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for the ages, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "œons on œons ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 77:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "45:11-19 Believers may ask in prayer for what they need; if for their good, it will not be withheld. But how common to hear God called to account for his dealings with man! Cyrus provided for the returning Jews. Those redeemed by Christ shall be provided for. The restoration would convince many, and convert some; and all that truly join the Lord, find his service perfect freedom. Though God be his people's God and Saviour, yet sometimes he lays them under his frowns; but let them wait upon the Lord who hides his face. There is a world without end; and it will be well or ill with us, according as it shall be with us in that world. The Lord we serve and trust, is God alone. All that God has said is plain, satisfactory, and just. As God in his word calls us to seek him, so he never denied believing prayers, nor disappointed believing expectations. He gives grace sufficient, and comfort and satisfaction of soul.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But Israel shall be saved - Referring primarily to the Jews in Babylon, but affirming the universal truth that the true Israel (compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 2:28-29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), that is, the people of God, shall be saved from all their trials, and shall be brought to his everlasting kingdom.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In the Lord - By Jehovah - ביהוה  bayohvâh; Septuagint, Ἀπὸ κυρίου  Apo kuriou. It shall be done by the power of Yahweh, and shall be traced to him alone. No more human power could have saved them from their captivity in Babylon; no human power can save the soul from hell.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "With an everlasting salvation - It shall not be a temporary deliverance; but it shall be perpetual. In heaven his people shall meet no more foes; they shall suffer no more calamity: they shall be driven into no exile; they shall never die.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ye shall not be ashamed nor confounded - This means:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. That they should never find God to fail, that is, to be either unable or unwilling to befriend and rescue them Psalm 46:1.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "1. That they should never find God to fail, that is, to be either unable or unwilling to befriend and rescue them ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 46:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "2. That they should never be ashamed, that is, have cause to regret that they had put their trust in him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The idea is, that they who become his friends never regret it; never are ashamed of it. The time never can come, when anyone who has become a true friend of God will regret it. In prosperity or adversity; in sickness or health; at home or abroad; in safety or in danger; in life or in death: there will be no situation in which they will be ashamed that they gave their hearts to God. There never have been any true Christians who regretted that they became the friends of the Redeemer. Their religion may have exposed them to persecution; their names may have been east out as evil; they may have been stripped of their property; they may have been thrown into dungeons, laid on the rack, or led to the stake; but they have not regretted that they became the friends of God. Nor will they ever regret it. No man on a dying bed regrets that he is a friend of God. No man at the judgment bar will be ashamed to be a Christian. And in all the interminable duration of the world to come, the period never will, never can arrive, when anyone will ever be ashamed that he gave his heart early, and entirely to the Redeemer. Why then should not all become his friends? Why will not people pursue that course which they know they never can regret, rather than the ways of sin and folly, which they know must cover them with shame and confusion hereafter? ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The idea is, that they who become his friends never regret it; never are ashamed of it. The time never can come, when anyone who has become a true friend of God will regret it. In prosperity or adversity; in sickness or health; at home or abroad; in safety or in danger; in life or in death: there will be no situation in which they will be ashamed that they gave their hearts to God. There never have been any true Christians who regretted that they became the friends of the Redeemer. Their religion may have exposed them to persecution; their names may have been east out as evil; they may have been stripped of their property; they may have been thrown into dungeons, laid on the rack, or led to the stake; but they have not regretted that they became the friends of God. Nor will they ever regret it. No man on a dying bed regrets that he is a friend of God. No man at the judgment bar will be ashamed to be a Christian. And in all the interminable duration of the world to come, the period never will, never can arrive, when anyone will ever be ashamed that he gave his heart early, and entirely to the Redeemer. Why then should not all become his friends? Why will not people pursue that course which they know they never can regret, rather than the ways of sin and folly, which they know must cover them with shame and confusion hereafter? ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "17. in the Lord—(Isa 45:24, 25), contrasted with the idols which cannot give even temporary help (Isa 45:16); in Jehovah there is everlasting salvation (Isa 26:4).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "not … ashamed—opposed to the doom of the idolaters, who, in the hour of need, shall be \"ashamed\" (see on [811]Isa 45:16).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "With an everlasting salvation; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " not for a short time, as it was in the days of the judges and of the kings, under whom their dangers and calamities did frequently return upon them; but unto all ages, as it follows; whence it appears that he speaks not only nor chiefly of their deliverance out of Babylon, which was far from being complete or perpetual, as appears both from Scripture, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ezra 9:8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezra 9:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", and elsewhere, and from other authors; but of their redemption by Christ, by which this was truly and fully verified unto a great number of Israelites after the flesh, and especially unto the mystical, God’s church and people, who are frequently called in Scripture by that name; as the ordinances and privileges of the gospel are commonly described in the Old Testament by expressions borrowed from the Levitical dispensation. And that this is the meaning of the place is evident from ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 45:22",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 45:22",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", wherein all the ends of the earth are said to be sharers in this salvation. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "But Israel shall be saved in the Lord,.... Not the carnal seed of Israel, or the natural posterity of Jacob, for only a remnant of them were saved; indeed, in the latter day, when there will be a general conversion of them, there will be a general salvation of them, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "all Israel shall be saved; but here the spiritual Israel of God are meant, such as God has appointed unto salvation; who are taken into the covenant of his grace, in which their salvation is secured; who are his spiritual people, whom Christ saves from their sins; who are redeemed by the blood of Christ, and are called by his grace; who believe in him, and hope in the Lord: these \"shall be saved\": there is a certainty of their salvation, and not a mere probability and possibility of it only. It is not they \"may be\", but they \"shall be\" saved; it is the will of God they should, whose will cannot be resisted; they are the purchase of Christ, which he will never lose, and the Spirit is the earnest and pledge of salvation to them: and it is \"in\" and \"by the Lord\" they are saved, not in of themselves; their destruction is of themselves, but their salvation is of the Lord; and they are saved as they are in him, and owing to their being in him; they are chosen in him, and hence spring all the blessings of grace and salvation to them; they are representatively in him, as their federal Head; they are openly in him, in effectual calling; and they are justified in him, and by his righteousness, and so saved; and being in him, there is no condemnation to them, nor can they ever come into it. They are saved \"by\" the Lord; by the Word of the Lord, as the Targum; by Jesus Christ, the incarnate Word; by his obedience, sufferings, and death; by his blood, righteousness, and sacrifice; and by his interceding life, and that \"with an everlasting salvation\"; which is distinguished, by this epithet, from a temporal one, and is opposed to eternal damnation, the desert of sin; it is the salvation of the immortal soul, and includes in it grace and glory, which are perpetual and everlasting; and the duration of it is owing to the perpetuity of Christ's person, office, and grace: or, \"with a salvation of ages\", or \"worlds\" (a): ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "ye shall not be ashamed, nor confounded, world without end; or, \"unto the ages of eternity\" (b); that is, such who believe in Christ, and are saved by him, they shall not be ashamed, though the makers and worshippers of idols will; they shall not be confounded, neither in this world, nor in the other; they shall not be ashamed of Christ, his word, and ordinances, nor of their faith and hope in him, or of their sufferings for him; they shall not be ashamed in the resurrection morn, their vile bodies being fashioned like to the glorious body of Christ, when others shall rise to shame and everlasting contempt; nor shall they be ashamed at the coming of Christ, and when they stand before him, being clothed with white robes, and having on the wedding garment; when they shall be introduced into his own and his Father's kingdom and glory, into the world of happiness, which will know no end. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(a)  \"salute Seculorum\", Pagninus, Montanus, Vatublus; \"salvatione seculorum\", Cocceius. So Ben Melcch interprets it, this world and the world to come; everlasting salvation takes in both. (b)   \"in secula perpetuitatis\", Montanus, Vatablus. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(a)  \"salute Seculorum\", Pagninus, Montanus, Vatublus; \"salvatione seculorum\", Cocceius. So Ben Melcch interprets it, this world and the world to come; everlasting salvation takes in both. (b)   \"in secula perpetuitatis\", Montanus, Vatablus. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "But Israel shall be saved in the LORD with an everlasting salvation: ye shall not be ashamed nor confounded world without end.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". But ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Israel shall be saved in the Lord",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Israel is saved by Jehovah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "with ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "an everlasting salvation",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] which shall never be turned into confusion. The state of things introduced by the deliverance is final, including the manifestation of Jehovah as He is, and such a union between Him and His people as can never be dissolved. As is usual in the prophets, the perfect dispensation, or what is called the Messianic age, is conceived as issuing immediately from the historical crisis which is the subject of the prophecy, in this case the deliverance from Babylon.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "world without end",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] More literally: ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "to all eternity",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The exact expression does not occur again.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 17.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Israel shall be saved...  with an everlasting salvation",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "a salvation of ages",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " one which will continue age after age. As Mr. Cheyne remarks, for this to be so, the redemption required to be spiritual as well as temporal. Otherwise it would ere long have been forfeited. Isaiah 45:17",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The way in which this God who hides Himself is ultimately revealed as the God of salvation, is then pointed out in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 45:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 45:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : \"They are put to shame, and also confounded, all of them; they go away into confusion together, the forgers of idols. Israel is redeemed by Jehovah with everlasting redemption: ye are not put to shame nor confounded to everlasting eternities.\" The perfects are expressive of the ideal past. Jehovah shows Himself as a Savour by the fact, that whereas the makers of idols perish, Israel is redeemed an everlasting redemption (acc. obj. as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 14:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 22:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; Ges. 138, 1, Anm. 1), i.e., so that its redemption is one that lasts for aeons (αἰωνία λύτρωσις, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 9:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") - observe that teshū‛âh does not literally signify redemption or rescue, but transfer into a state of wide expanse, i.e., of freedom and happiness. The plural ‛ōlâmı̄m (eternities  equals  αἰῶνες aeua) belongs, according to Knobel, to the later period of the language; but it is met with as early as in old Asaphite psalms (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 77:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). When the further promise is added, Ye shall not be put to shame, etc., this clearly shows, what is also certain on other grounds - namely, that the redemption is not thought of merely as an outward and bodily one, but also as inward and spiritual, and indeed (in accordance with the prophetic blending of the end of the captivity with the end of all things) as a final one. Israel will never bring upon itself again such a penal judgment as that of the captivity by falling away from God; that is to say, its state of sin will end with its state of punishment, even עב עד־עולמי, i.e., since עד has no plural, εἰς αἰῶνας τῶν αἰώνων. ",
        "children": []
      }
    ]
  }
]