[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(3) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The treasures of darkness . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The heaped-up wealth of “gold-abounding” Babylon. The capture of Sardis, with all the riches of Crœsus, must have been almost as fruitful in plunder. (Herod. i. 84). The conqueror was to see in his victories the token of the protection of Jehovah, and so accept his vocation as the redeemer of His people.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "45:1-4 Cyrus is called God's anointed; he was designed and qualified for his great service by the counsel of God. The gates of Babylon which led to the river, were left open the night that Cyrus marched his army into the empty channel. The Lord went before him, giving entrance to the cities he besieged. He gave him also treasures, which had been hidden in secret places. The true God was to Cyrus an unknown God; yet God foreknew him; he called him by his name. The exact fulfilment of this must have shown Cyrus that Jehovah was the only true God, and that it was for the sake of Israel that he was prospered. In all the changes of states and kingdoms, God works out the good of his church.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And I will give thee the treasures of darkness - The treasures which kings have amassed, and which they have laid up in dark and secure places. The word 'darkness,' here, means that which was hidden, unknown, secret (compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 12:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The treasures of the kings of the East were usually hidden in some obscure and strong place, and were not to be touched except in cases of pressing necessity. Alexander found vast quantities of treasure thus hidden among the Persians; and it was by taking such treasures that the rapacity of the soldiers who followed a conqueror was satisfied, and in fact by a division of the spoils thus taken that they were paid. There can be no doubt that large quantities of treasure in this manner would be found in Babylon. The following observations from Harmer (Obs. pp. 111, 511-513), will show that it was common to conceal treasures in this manner in the East; 'We are told by travelers in the East, that they have met with great difficulties, very often from a notion universally disseminated among them, that all Europeans are magicians, and that their visits to those eastern countries are not to satisfy curiosity, but to find out, and get possession of those vast treasures they believe to be buried there in great quantities.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "These representations are very common; but Sir John Chardin gives us a more particular and amusing account of affairs of this kind: \"It is common in the Indies, for those sorcerers that accompany conquerors, everywhere to point out the place where treasures are bid. Thus, at Surat, when Siragi came thither, there were people who, with a stick striking on the ground or against walls, found out those that had been hollowed or dug up, and ordered such places to be opened.\" He then intimates that something of this nature had happened to him in Mingrelia. Among the various contradictions that agitate the human breast, this appears to be a remarkable one; they firmly believe the power of magicians to discover bidden treasures, and yet they continue to hide them. Dr. Perry has given us all account of some mighty treasures hidden in the ground by some of the principal people of the Turkish empire, which, upon a revolution, were discovered by domestics privy to the secret.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "D'Herbelot has given us accounts of treasures concealed in the same manner, some of them of great princes, discovered by accidents extremely remarkable: but this account of Chardin's, of conquerors pretending to find out hidden treasures by means of sorcerers, is very extraordinary. As, however, people of this cast have made great pretences to mighty things, in all ages, and were not unfrequently confided in by princes, there is reason to believe they pretended sometimes, by their art, to discover treasures, anciently, to princes, of which they had gained intelligence by other methods; and, as God opposed his prophets, at various times, to pretended sorcerers, it is not unlikely that the prophet Isaiah points at some such prophetic discoveries, in those remarkable words Isaiah 45:3 : \"And I will give thee the treasures of darkness, and hidden riches of secret places, that thou mayest know that I the Lord, which call thee by thy name, am the God of Israel.\" I will give them, by enabling some prophet of mine to tell thee where they are concealed.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "D'Herbelot has given us accounts of treasures concealed in the same manner, some of them of great princes, discovered by accidents extremely remarkable: but this account of Chardin's, of conquerors pretending to find out hidden treasures by means of sorcerers, is very extraordinary. As, however, people of this cast have made great pretences to mighty things, in all ages, and were not unfrequently confided in by princes, there is reason to believe they pretended sometimes, by their art, to discover treasures, anciently, to princes, of which they had gained intelligence by other methods; and, as God opposed his prophets, at various times, to pretended sorcerers, it is not unlikely that the prophet Isaiah points at some such prophetic discoveries, in those remarkable words ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 45:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : \"And I will give thee the treasures of darkness, and hidden riches of secret places, that thou mayest know that I the Lord, which call thee by thy name, am the God of Israel.\" I will give them, by enabling some prophet of mine to tell thee where they are concealed.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Such a supposition throws a great energy into those words.' The belief that the ruins of cities abound with treasures that were deposited there long since, prevails in the East, and the inhabitants of those countries regard all travelers who come there, Burckhardt informs us, as coming to find treasures, and as having power to remove them by enchantment. 'It is very unfortunate,' says he, 'for European travelers, that the idea of treasures being hidden in ancient edifices is so strongly rooted in the minds of the Arabs and Turks; they believe that it is sufficient for a true magician to have seen and observed the spot where treasures are hidden (of which be is supposed to be already informed by the old books of the infidels who lived on the spot), in order to be able afterward at his ease to command the guardian of the treasure to set the whole before him. It was of no avail to tell them to follow me and see whether I searched for money.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Their reply was, \"Of course you will not dare to take it out before us, but we know that if you are a skillful magician you will order it to follow you through the air to whatever place you please.\" If the traveler takes the dimensions of a building or a column, they are persuaded it is a magical proceeding.' (Travels in Syria, pp. 428, 429. Ed. Lond. 4to, 1822.) Laborde, in his account of a visit to Petra, or Sela, has given an account of a splendid temple cut in the solid rock, which is called the Khasne, or 'treasury of Pharaoh.' It is sculptured out of an enormous block of freestone, and is one of the most splendid remains of antiquity. It is believed by the Arabs to have been the place where Pharaoh, supposed to have been the founder of the costly edifices of Petra, had deposited his wealth. 'After having searched in vain,' says Laborde, 'all the coffins and funeral monuments, to find his wealth, they supposed it must be in the urn which surmounted the Khasne. But, unhappily, being out of their reach, it has only served the more to kindle their desires.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Hence, whenever they pass through the ravine, they stop for a moment, charge their guns, aim at the urn, and endeavor by firing at it, to break off some fragments, with a view to demolish it altogether, and get at the treasure which it is supposed to contain.' (Laborde's Sinai and Petra, p. 170. Ed. Lond. 1836.) The treasures which Cyrus obtained in his conquests are known to have been immense. Sardis, the capital of Croesus, king of Lydia, the most wealthy monarch of his time, was, according to Herodotus (i. 84), given up to be plundered; and his hoarded wealth became the spoil of the victor (see also Xen. Cyr. vii.) That Babylon abounded in treasures is expressly declared by Jeremiah Jer 51:13 : 'O thou that dwellest upon many waters, abundant in treasures.' These treasures also, according to Jeremiah Jer 50:37, became the spoil of the conqueror of the city. Pithy also has given a description of the wealth which Cyrus obtained in his conquests, which strikingly confirms what Isaiah here declares: 'Cyrus, in the conquest of Asia, obtained thirty-four thousand pounds weight of gold, besides golden vases, and gold that was made with leaves, and the palm-tree, and the vine.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In which victory also he obtained five hundred thousand talents of silver, and the goblet of Semiramis, which weighed fifteen talents.' (Nat. Hist. 33. 3.) Brerewood has estimated that this gold and silver amounted to one hundred and twenty-six million, and two hundred and twenty-four thousand pounds sterling. (De Pon. et Men. 10.) Babylon was the center of an immense traffic that was carried on between the eastern parts of Asia and the western parts of Asia and Europe. For a description of this commerce, see an article in the Bib. Rep. vol. vii. pp. 364-390. Babylonian garments, it will be remembered, of great value, had made their way to Palestine in the time of Joshua Jos 7:21. Tapestries embroidered with figures of griffons and other monsters of eastern imagination were articles of export (Isaac Vossius, Observatio). Carpets were made there of the finest materials and workmanship, and formed an article of extensive exportation. They were of high repute in the times of Cyrus; whose tomb at Pasargada was adorned with them (Arrian, Exped. Alex. vi. 29). Great quantities of gold were used in Babylon. The vast image of gold erected by Nebuchadnezzar in the plain of Dura is proof enough of this fact. The image was sixty cubits high and six broad Daniel 3:1. Herodotus (i. 183) informs us that the Chaldeans used a thousand talents of frankincense annually in the temple of Jupiter.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In which victory also he obtained five hundred thousand talents of silver, and the goblet of Semiramis, which weighed fifteen talents.' (Nat. Hist. 33. 3.) Brerewood has estimated that this gold and silver amounted to one hundred and twenty-six million, and two hundred and twenty-four thousand pounds sterling. (De Pon. et Men. 10.) Babylon was the center of an immense traffic that was carried on between the eastern parts of Asia and the western parts of Asia and Europe. For a description of this commerce, see an article in the Bib. Rep. vol. vii. pp. 364-390. Babylonian garments, it will be remembered, of great value, had made their way to Palestine in the time of Joshua Jos 7:21. Tapestries embroidered with figures of griffons and other monsters of eastern imagination were articles of export (Isaac Vossius, Observatio). Carpets were made there of the finest materials and workmanship, and formed an article of extensive exportation. They were of high repute in the times of Cyrus; whose tomb at Pasargada was adorned with them (Arrian, Exped. Alex. vi. 29). Great quantities of gold were used in Babylon. The vast image of gold erected by Nebuchadnezzar in the plain of Dura is proof enough of this fact. The image was sixty cubits high and six broad ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 3:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Herodotus (i. 183) informs us that the Chaldeans used a thousand talents of frankincense annually in the temple of Jupiter.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "That thou mayest know - That from these signal successes, and these favors of heaven, you may learn that Yahweh is the true God. This he would learn because he would see that he owed it to heaven (see the note at Isaiah 45:2); and because the prediction which God had made of his success would convince him that he was the true and only God. That it had this effect on Cyrus is apparent from his own proclamation (see Ezra 1:2). God took this method of making himself known to the monarch of the most mighty kingdom of the earth, in order, as he repeatedly declares, that through his dealings with kingdoms and people he may be acknowledged.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "That thou mayest know - That from these signal successes, and these favors of heaven, you may learn that Yahweh is the true God. This he would learn because he would see that he owed it to heaven (see the note at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 45:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); and because the prediction which God had made of his success would convince him that he was the true and only God. That it had this effect on Cyrus is apparent from his own proclamation (see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezra 1:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). God took this method of making himself known to the monarch of the most mighty kingdom of the earth, in order, as he repeatedly declares, that through his dealings with kingdoms and people he may be acknowledged.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Which call thee by thy name - (See the notes at Isaiah 43:1). That thou mayest know that I, who so long before designated thee by name, am the true God. The argument is, that none but God could have foretold the name of him who should be the deliverer of his people.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Which call thee by thy name - (See the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 43:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). That thou mayest know that I, who so long before designated thee by name, am the true God. The argument is, that none but God could have foretold the name of him who should be the deliverer of his people.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Am the God of Israel - That the God of Israel was the true and only God. The point to be made known was not that he was the God of Israel, but that the God of Israel was Yahweh the true God. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Am the God of Israel - That the God of Israel was the true and only God. The point to be made known was not that he was the God of Israel, but that the God of Israel was Yahweh the true God. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3. treasures of darkness—that is, hidden in subterranean places; a common Oriental practice. Sorcerers pretended to be able to show where such treasures were to be found; in opposition to their pretensions, God says, He will really give hidden treasures to Cyrus (Jer 50:37; 51:13). Pliny (Natural History,, 33:3) says that Cyrus obtained from the conquest of Asia thirty-four thousand pounds weight of gold, besides golden vases, and five hundred thousand talents of silver, and the goblet of Semiramis, weighing fifteen talents.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that thou mayest know—namely, not merely that He was \"the God of Israel,\" but that He was Jehovah, the true God. Ezr 1:1, 2 shows that the correspondence of the event with the prediction had the desired effect on Cyrus.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "which call … thy name—so long before designate thee by name (Isa 43:1).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The treasures of darkness; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " such as have been stored up and long kept in dark and secret places, as well in Babylon, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Jeremiah 50:37 51:13",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 50:37",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 51:13",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", as in other countries, which Cyrus conquered; and from which he took infinite treasures, as Pliny and others relate. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "That thou mayest know, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " by the accomplishment of these predictions. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And I will give thee treasures of darkness, and hidden riches of secret places,.... What had been laid up in private places, and had not seen the light for many years. The Jewish Rabbins say (f), that Nebuchadnezzar having amassed together all the riches of the world, when he drew near his end, considered with himself to whom he should leave it; and being unwilling to leave it to Evilmerodach, he ordered ships of brass to be built, and filled them with it, and dug a place in Euphrates, and hid them in it, and turned the river upon them; and that day that Cyrus ordered the temple to be built, the Lord revealed them to him: the riches of Croesus king of Lydia, taken by Cyrus, are meant; especially what he found in Babylon, which abounded in riches, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 51:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Pliny (g) says, when he conquered Asia, he brought away thirty four thousand pounds of gold, besides golden vessels, and five hundred thousand talents of silver, and the cup of Semiramis, which weighed fifteen talents. Xenophon (h) makes mention of great riches and treasures which Cyrus received from Armenius, Gobryas, and Croesus: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that thou mayest know that I the Lord, which call thee by thy name, am the God of Israel; to call him by name two hundred years, or near it, before he was born, was a proof that he was God omniscient, and knew things before they were, and could call things that were not, as though they were; and this Cyrus was made acquainted with; for, as Josephus (i) says, he read this prophecy in Isaiah concerning him; and all this being exactly fulfilled in him, obliged him to acknowledge him the Lord, to be the Lord God of heaven, and the Lord God of Israel, Ezra 1:2. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "that thou mayest know that I the Lord, which call thee by thy name, am the God of Israel; to call him by name two hundred years, or near it, before he was born, was a proof that he was God omniscient, and knew things before they were, and could call things that were not, as though they were; and this Cyrus was made acquainted with; for, as Josephus (i) says, he read this prophecy in Isaiah concerning him; and all this being exactly fulfilled in him, obliged him to acknowledge him the Lord, to be the Lord God of heaven, and the Lord God of Israel, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezra 1:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(f) Vide Abendana in Miclol Yophi in Ioc. (g) Nat. Hist. l. 33. c. 3.((h) Cyropaedia, l. 3. c. 3. l. 5. c. 4. l. 7. c. 14. (i) Antiqu. l. 11. c. 1. sect. 2.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(f) Vide Abendana in Miclol Yophi in Ioc. (g) Nat. Hist. l. 33. c. 3.((h) Cyropaedia, l. 3. c. 3. l. 5. c. 4. l. 7. c. 14. (i) Antiqu. l. 11. c. 1. sect. 2.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And I will give thee the treasures of darkness, and hidden riches of secret places, that thou mayest {e} know that I, the LORD, who call thee by thy name, am the God of Israel.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And I will give thee the treasures of darkness, and hidden riches of secret places, that thou mayest ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{e}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " know that I, the LORD, who call ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "thee",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " by thy name, ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "am",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the God of Israel.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(e) Not that Cyrus knew God to worship him correctly, but he had a certain particular knowledge as profane men may have of his power, and so was compelled to deliver God's people.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the treasures of darkness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] i.e. treasures hid in darkness. The following word rendered ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "hidden riches",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "maṭmôn",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", held by some to be the original of the N.T. “Mammon”), means properly treasure ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "hidden",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " underground (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 3:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 2:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 41:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The treasures referred to are chiefly the loot of Sardis, which Xenophon describes as “the richest city of Asia next to Babylon” (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Cyrop.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " VII. 2. 11), and of Babylon itself (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 50:37",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 51:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). If, as is probable, the capture of the former city was past before the date of the prophecy, rumours of the fabulous wealth of Crœsus, which then found its way into the coffers of Cyrus, may have reached the prophet.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that thou mayest know &c.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Render: ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "that thou mayest know that I Jehovah am He that calleth thee by name",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (see on ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 43:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "the God of Israel",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The prophet apparently expects that Cyrus will come to acknowledge Jehovah as the true God and the author of his success (see ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 41:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Whether this hope was actually realised is more than ever doubtful since the discovery of cuneiform inscriptions in which Cyrus uses the language of crude polytheism (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Records of the Past",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Vol. v., pp. 167 f.). [Cf. Sayce, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Higher Criticism and the Monuments",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", pp. 507–511.] Many elements of the prophecy, such as the universal extinction of idolatry, remained unfulfilled, and it is possible that the anticipated conversion of Cyrus to the true faith is one of them (see Ryle’s note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezra 1:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Cambridge Bible for Schools",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The prophet nowhere explains the process by which this spiritual change is to be brought about, but he doubtless regards it as produced by the evidence of prophecy, so frequently dwelt upon in the first nine chapters of the book. The wonderful successes of Cyrus marked him out, to the mind of antiquity, as a favourite of the gods; but the further conviction that Jehovah alone is God proceeds from the knowledge that He alone has foretold his appearance.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 3.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "I will give thee the treasures of darkness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " \"treasures stored in dark places\" - \"bidden treasures.\" Treasuries were built for greater security without windows. Of the treasures which fell into the hands of Cyrus, the greatest were probably those of Babylon (Herod., 1:183) and of Sardis (Xen., 'Cyrop.,' 7:2, § 11). The value of the latter has been estimated at above one hundred and twenty-six millions sterling. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "That thou mayest know",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "acknowledge",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (for the actual acknowledgment, see the decrees in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezra 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and Ezra 6:3-5). If these documents are accepted as genuine, or even as true in substance (Ewald), Cyrus must be considered to have identified Jehovah with his own Ormuzd, and to have viewed the Jewish and Persian religions as substantially the same. He would be under no temptation, with so weak and down-trodden a people as the Jews, to resort to politic pretences, as he might be in the case of the Babylonians (see the comment on Isaiah 41:25). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Which call thee by thy name",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (comp. ver. 1 and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 44:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). (On the special favour implied in God's condescending to \"know\" or \"call\" a person by his name, see the 'Pulpit Commentary' on Exodus 33:12.) Am the God of Israel; rather, am the Lord...  ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "the God of Israel.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Isaiah 45:3",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The first strophe of the first half of this sixth prophecy (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 44:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".), the subject of which is Cyrus, the predicted restorer of Jerusalem, of the cities of Judah, and of the temple, is now followed by a second strophe (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 45:1-8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), having for its subject Cyrus, the man through whose irresistible career of conquest the heathen would be brought to recognise the power of Jehovah, so that heavenly blessings would come down upon the earth. The naming of the great shepherd of the nations, and the address of him, are continued in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 45:1-3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : \"Thus saith Jehovah to His anointed, to Koresh, whom I have taken by his right hand to subdue nations before him; and the loins of kings I ungird, to open before him doors and gates, that they may not continue shut. I shall go before thee, and level what is heaped up: gates of brass shall I break in pieces, and bolts of iron shall I smite to the ground. And I shall give thee treasures of darkness, and jewels of hidden places, that thou mayest know that I Jehovah am He who called out thy name, (even) the God of Israel.\" The words addressed to Cyrus by Jehovah commence in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 45:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", but promises applying to him force themselves into the introduction, being evoked by the mention of his name. He is the only king of the Gentiles whom Jehovah ever meshı̄chı̄ (my anointed; lxx τῷ χριστῷ μου). The fundamental principle of the politics of the empire of the world was all-absorbing selfishness. But the politics of Cyrus were pervaded by purer motives, and this brought him eternal honour. The very same thing which the spirit of Darius, the father of Xerxes, is represented as saying of him in the Persae of Aeschylus (v. 735), Θεὸς γὰρ οὐκ ἤχθησεν ὡς εὔφρων ἔφυ (for he was not hateful to God, because he was well-disposed), is here said by the Spirit of revelation, which by no means regards the virtues of the heathen as splendida vitia. Jehovah has taken him by his right hand, to accomplish great things through him while supporting him thus. (On the inf. rad for rōd, from râdad, to tread down, see Ges. 67, Anm. 3.) The dual delâthaim has also a plural force: \"double doors\" (fores) in great number, viz., those of palaces. After the two infinitives, the verb passes into the finite tense: \"loins of kings I ungird\" (discingo; pittēăch, which refers primarily to the loosening of a fastened garment, is equivalent to depriving of strength). The gates - namely, those of the cities which he storms - will not be shut, sc. in perpetuity, that is to say, they will have to open to him. Jerome refers here to the account given of the elder Cyrus in Xenophon's Cyropaedia. A general picture may no doubt be obtained from this of his success in war; but particular statements need support from other quarters, since it is only a historical romance. Instead of אושׁר (אושׁר)? in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 45:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the keri has אישּׁר; just as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 5:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it has הישׁר instead of הושׁר. A hiphil הושׁיר cannot really be shown to have existed, and the abbreviated future form עושׁר would be altogether without ground or object here. הדּורים (tumida; like נעיימם, amaena, and others) is meant to refer to the difficulties piled up in the conqueror's way. The \"gates of brass' (nedhūshâh, brazen, poetical for nechōsheth, brass, as in the derivative passage, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 107:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") and \"bolts of iron\" remind one more especially of Babylon with its hundred \"brazen gates,\" the very posts and lintels of which were also of brass (Herod. i. 179); and the treasures laid up in deep darkness and jewels preserved in hiding-places, of the riches of Babylon (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 50:37",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 51:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and especially of those of the Lydian Sardes, \"the richest city of Asia after Babylon\" (Cyrop. vii. 2, 11), which Cyrus conquered first. On the treasures which Cyrus acquired through his conquests, and to which allusion is made in the Persae of Aeschylus, v. 327 (\"O Persian, land and harbour of many riches thou\"), see Plin. h. n. xxxiii. 2. Brerewood estimates the quantity of gold and silver mentioned there as captured by him at no less than 126,224,000 sterling. And all this success is given to him by Jehovah, that he may know that it is Jehovah the God of Israel who has called out with his name, i.e., called out his name, or called him to be what he is, and as what he shows himself to be. ",
        "children": []
      }
    ]
  }
]