[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(7) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I make peace, and create evil . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The words have no bearing on the insoluble problem of what we call the origin of evil. “Evil,” as opposed to “peace” or prosperity, is suffering, but not sin; normally, in the Divine counsels, at once the consequence and corrective of moral evil (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 47:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 57:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 45:7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 45:7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I form the light, and create darkness, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — All men’s comforts and calamities come from my hand. “It was the great principle of the Magian religion, which prevailed in Persia in the time of Cyrus, and in which probably he was educated, that there are two supreme, coeternal, and independent causes, always acting in opposition one to the other; one, the author of all good, the other, of all evil; the good being they called Light; the evil being Darkness; that, when Light had the ascendant, then good and happiness prevailed among men; when Darkness had the superiority, then evil and misery abounded. All opinion that contradicts the clearest evidence of our reason, which plainly leads us to the acknowledgment of one only Supreme Being, infinitely good as well as powerful. With reference to this absurd opinion, held probably by the person to whom this prophecy is addressed, God, by his prophet, in the most significant terms, asserts his omnipotence and absolute supremacy. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I am ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "JEHOVAH, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and none else; forming light, and creating darkness; making peace, and creating evil; I ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "JEHOVAH ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "am the author of all these things.” ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Declaring that there is no power, either of light or darkness, of good or evil, of happiness or misery, independent of the one supreme God, infinite in power and in goodness. — Bishop Lowth.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "45:5-10 There is no God beside Jehovah. There is nothing done without him. He makes peace, put here for all good; and creates evil, not the evil of sin, but the evil of punishment. He is the Author of all that is true, holy, good, or happy; and evil, error, and misery, came into the world by his permission, through the wilful apostacy of his creatures, but are restrained and overruled to his righteous purpose. This doctrine is applied, for the comfort of those that earnestly longed, yet quietly waited, for the redemption of Israel. The redemption of sinners by the Son of God, and the pouring out the Spirit, to give success to the gospel, are chiefly here intended. We must not expect salvation without righteousness; together the Lord hath created them. Let not oppressors oppose God's designs for his people. Let not the poor oppressed murmur, as if God dealt unkindly with them. Men are but earthen pots; they are broken potsherds, and are very much made so by mutual contentions. To contend with Him is as senseless as for clay to find fault with the potter. Let us turn God's promises into prayers, beseeching him that salvation may abound among us, and let us rest assured that the Judge of all the earth will do right.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "I form the light, and create darkness - Light, in the Bible, is the emblem of knowledge, innocence, pure religion, and of prosperity in general; and darkness is the emblem of the opposite. Light here seems to be the emblem of peace and prosperity, and darkness the emblem of adversity; and the sentiment of the verse is, that all things prosperous and adverse are under the providential control and direction of God. Of light, it is literally true that God made it; and emblematically true that he is the source of knowledge, prosperity, happiness, and pure religion. Of darkness, it is literally true also that the night is formed by him; that he withdraws the light of the sun, and leaves the earth enveloped in gloomy shades. It is emblematically true also that calamity, ignorance, disappointment, and want of success are ordered by him; and not less true that all the moral darkness, or evil, that prevails on earth, is under the direction and ordering of his Providence. There is no reason to think, however, that the words 'darkness' and 'evil' are to be understood as referring to moral darkness; that is, sin.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "A strict regard should be had to the connection in the interpretation of such passages; and the connection here does not demand such an interpretation. The main subject is, the prosperity which would attend the arms of Cyrus, the consequent reverses and calamities of the nations whom he would subdue, and the proof thence furnished that Yahweh was the true God; and the passage should be limited in the interpretation to this design. The statement is, that all this was under his direction. It was not the work of chance or hap-hazard. It was not accomplished or caused by idols. It was not originated by any inferior or subordinate cause. It was to be traced entirely to God. The successes of arms, and the blessings of peace were to be traced to him; and the reverses of arms, and the calamities of war to him also. This is all that the connection of the passage demands; and this is in accordance with the interpretation of Kimchi, Jerome, Rosenmuller, Gesenius, Calvin, and Grotius. The comment of Grotius is, 'Giving safety to the people, as the Persians; sending calamities upon the people, as upon the Medes and Babylonians.' Lowth, Jerome, Vitringa, Jahn, and some others, suppose that there is reference here to the prevalent doctrine among the Persians, and the followers of the Magian religion in general, which prevailed all over the East, and in which Cyrus was probably educated, that there are two supreme, independent, co-existent and eternal causes always acting in opposition to each other - the one the author of all good, and the other of all evil; and that these principles or causes are constantly struggling with each other.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The good being or principle, they call light; and the evil, darkness; the one, Oromasden, and the other Ahrimanen. It was further the doctrine of the Magians that when the good principle had the ascendency, happiness prevailed; and when the evil principle prevailed, misery abounded. Lowth supposes, that God here means to assert his complete and absolute superiority over all other things or principles; and that all those powers whom the Persians supposed to be the original authors of good and evil to mankind were subordinate, and must be subject to him; and that there is no power that is not subservient to him, and under his control. That these opinions prevailed in very early times, and perhaps as early as Isaiah, there seems no good reason to doubt (Hyde, de Relig. Veter. Persar, xxii.) But there is no good evidence that Isaiah here referred to those opinions. Good and evil, prosperity and adversity, abound in the world at all times; and all that is required in order to a correct understanding of this passage is the general statement that all these things are under providential direction.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I make peace - I hush the contending passions of mankind; I dispose to peace, and prevent wars when I choose - a passage which proves that the most violent passions are under his control. No passions are more uncontrollable than those which lead to wars; and nowhere is there a more striking display of the Omnipotence of God than in his power to repress the pride, ambition, and spirit of revenge of conquerors and kings:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Which stilleth the noise of the seas,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The noise of their waves,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And the tumult of the people.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And the tumult of the people.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "7. form … create—yatzar, to give \"form\" to previously existing matter. Bara, to \"create\" from nothing the chaotic dark material.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "light … darkness—literally (Ge 1:1-3), emblematical also, prosperity to Cyrus, calamity to Babylon and the nations to be vanquished [Grotius] … Isaiah refers also to the Oriental belief in two coexistent, eternal principles, ever struggling with each other, light or good, and darkness or evil, Oromasden and Ahrimanen. God, here, in opposition, asserts His sovereignty over both [Vitringa].",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "create evil—not moral evil (Jas 1:13), but in contrast to \"peace\" in the parallel clause, war, disaster (compare Ps 65:7; Am 3:6).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " All men’s comforts and calamities come from my hand. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "I form the light, and create darkness,.... Natural light, or that light which was produced at the first creation, and of which the sun is the fountain and source; or day which is light, and night which is darkness, the constant revolutions of which were formed, appointed, and are continued by the Lord, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", moral light, or the light of nature, the rational understanding in man; spiritual light, or the light of grace, by which things spiritual and supernatural are known; the light of joy and comfort from Christ, the sun of righteousness; and the light of eternal glory and happiness: this is all from God, of his producing and giving; and so darkness is his creature; that natural darkness which was upon the face of the earth at the beginning; what arises from the absence of the sun, or is occasioned by the eclipses of it, or very black clouds; or any extraordinary darkness, such as was in Egypt; or deprivation of sight, blindness in men; and, in a figurative sense, ignorance and darkness that follow upon sin; judicial blindness, God gives men up and leaves them to; temporal afflictions and distresses, and everlasting punishment, which is blackness of darkness: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I make peace, and create evil; peace between God and men is made by Christ, who is God over all; spiritual peace of conscience comes from God, through Christ, by the Spirit; eternal glory and happiness is of God, which saints enter into at death; peace among the saints themselves here, and with the men of the world; peace in churches, and in the world, God is the author of, even of all prosperity of every kind, which this word includes: \"evil\" is also from him; not the evil of sin; this is not to be found among the creatures God made; this is of men, though suffered by the Lord, and overruled by him for good: but the evil of punishment for sin, God's sore judgments, famine, pestilence, evil beasts, and the sword, or war, which latter may more especially be intended, as it is opposed to peace; this usually is the effect of sin; may be sometimes lawfully engaged in; whether on a good or bad foundation is permitted by God; moreover, all afflictions, adversities, and calamities, come under this name, and are of God; see Job 2:10, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I make peace, and create evil; peace between God and men is made by Christ, who is God over all; spiritual peace of conscience comes from God, through Christ, by the Spirit; eternal glory and happiness is of God, which saints enter into at death; peace among the saints themselves here, and with the men of the world; peace in churches, and in the world, God is the author of, even of all prosperity of every kind, which this word includes: \"evil\" is also from him; not the evil of sin; this is not to be found among the creatures God made; this is of men, though suffered by the Lord, and overruled by him for good: but the evil of punishment for sin, God's sore judgments, famine, pestilence, evil beasts, and the sword, or war, which latter may more especially be intended, as it is opposed to peace; this usually is the effect of sin; may be sometimes lawfully engaged in; whether on a good or bad foundation is permitted by God; moreover, all afflictions, adversities, and calamities, come under this name, and are of God; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 2:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "I the Lord do all these things; and therefore must be the true God, and the one and only one. Kimchi, from Saadiah Gaon, observes, that this is said against those that assert two gods, the one good, and the other evil; whereas the Lord is the Maker of good and evil, and therefore must be above all; and it is worthy of observation, that the Persian Magi, before Zoroastres (m), held two first causes, the one light, or the good god, the author of all good; and the other darkness, or the evil god, the author of all evil; the one they called Oromazes, the other Arimanius; and, as Dr. Prideaux (n) observes, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"these words are directed to Cyrus king of Persia, and must be understood as spoken in reference to the Persian sect of the Magians; who then held light and darkness, or good and evil, to be the supreme Beings, without acknowledging the great God as superior to both;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and which these words show; for Zoroastres, who reformed them in this first principle of their religion, was after Isaiah's time. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(m) Vid. Pocock. Specimen Arab. Hist. p. 147, 148. (n) Connexion, part 1. p. 215. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(m) Vid. Pocock. Specimen Arab. Hist. p. 147, 148. (n) Connexion, part 1. p. 215. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "I form the {h} light, and create darkness: I make peace, and create evil: I the LORD do all these things.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I form the ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{h}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " light, and create darkness: I make peace, and create evil: I the LORD do all these ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "things",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(h) I send peace and war, prosperity and adversity, as in Am 3:6.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It has been very generally supposed that the expressions of this verse cover a polemic against the Zoroastrian dualism, with its eternal antagonism between Ahuramazda, the god of light and of goodness, and Ahriman, the god of darkness and evil. The prophet’s language, however, is perfectly general, and it is hardly probable that he would have contented himself with a vague allusion to so important a controversy. And apart from the question whether Cyrus was a Zoroastrian in religion, it is doubtful whether a sharply formulated dualism was a prominent feature of Persian religion in his time. It is more likely therefore that the only dualism here referred to is the dualism latent in every polytheistic system, viz., the ascription of good and evil events to different classes of deities. The context shews that the writer is thinking of the effect of Jehovah’s victory, not specially on Cyrus, but upon men in general; and the truth he asserts is simply that Jehovah as the only God is the disposer of all events, good and evil alike.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and create evil",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] i.e. not moral evil, but physical evil, calamity. Cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Amos 3:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “shall evil befall a city and Jehovah hath not done it?” The prophet’s words are startlingly bold, but they do not go beyond the common O. T. doctrine on the subject, which is free from the speculative difficulties that readily suggest themselves to the mind of a modern reader. There is no thought in the O.T. of reducing all evil, moral and physical, to a single principle. Moral evil proceeds from the will of man, physical evil from the will of God, who sends it as the punishment of sin. The expression “",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "create",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " evil” implies nothing more than that. It is true (as we see from the Book of Job &c.) that the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "indiscriminateness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of physical calamities had begun to cause perplexity in the age to which the prophecy belongs. But the discussion of that question never shook either of the two positions, that sin originates in man, and that God is the author of calamity.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 7.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "I form the light, and create darkness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It has been recently denied that there is any allusion in these words, or in those which follow, to the Zoroastrian tenets; and it has even been asserted that the religion of the early Achaemenian kings was free from the taint of dualism. But according to some authorities, \"a god of lies\" is mentioned in the Behistun inscription; and the evidence is exceedingly strong that dualism was an essential part of the Zoroastrian religion long before the time of Cyrus (see 'Ancient Monarchies,' vol. 2. pp. 332, 333, 2nd edit.). It is quite reasonable to suppose that Isaiah would be acquainted with the belief of the Persians and Medes, who had come in contact with the Assyrians as early as B.C.. 830; and a warning against the chief error of their religion would be quite in place when he was holding up Cyrus to his countrymen as entitled to their respect and veneration. The ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "nexus",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of the words, \"I am the Lord, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "and there is none else. I form the light",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "and create darkness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",\" is such as naturally to suggest an intended antagonism to the Zoroastrian system. Under that, Ormuzd created \"light\" and \"peace,\" Ahriman \"darkness\" and \"evil.\" The two were eternal adversaries, engaged in an inter-ruinable contest. Ormuzd, it is true, claimed the undivided allegiance of mankind, since he was their maker; but Ahriman was a great power, terribly formidable - perhaps a god (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "diva",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "-",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " certainly the chief of the devas. It was from Zoroastrianism that Manicheism derived its doctrine of the two principles, and to the same source may, with much probability, be traced the \"devil-worshippers\" of the Zagros mountain chain. Isaiah 45:7",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "A second and third object are introduced by a second and third למען. \"For the sake of my servant Jacob, and Israel my chosen, I called thee hither by name, surnamed thee when thou knewest me not. I Jehovah, and there is none else, beside me no God: I equipped thee when thou knewest me not; that they may know from the rising of the sun, and its going down, that there is none without me: I Jehovah, and there is none else, former of the light, and creator of the darkness; founder of peace, and creator of evil: I Jehovah am He who worketh all this.\" The ואקרא which follows the second reason assigned like an apodosis, is construed doubly: \"I called to thee, calling thee by name.\" The parallel אכנּך refers to such titles of honour as \"my shepherd\" and \"my anointed,\" which had been given to him by Jehovah. This calling, distinguishing, and girding, i.e., this equipment of Cyrus, took place at a time when Cyrus knew nothing as yet of Jehovah, and by this very fact Jehovah made known His sole Deity. The meaning is, not that it occurred while he was still worshipping false gods, but, as the refrain-like repetition of the words \"though thou hast not know me\" affirms with strong emphasis, before he had been brought into existence, or could know anything of Jehovah. The passage is to be explained in the same way as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 1:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"Before I formed thee in the womb, I knew thee\" (see Psychol. pp. 36, 37, 39); and what the God of prophecy here claims for Himself, must not be questioned by false criticism, or weakened down by false apologetics (i.e., by giving up the proper name Cyrus as a gloss in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 44:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 45:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; or generalizing it into a king's name, such as Pharaoh, Abimelech, or Agag). The third and last object of this predicted and realized success of the oppressor of nations and deliverer of Israel is the acknowledgement of Jehovah, spreading over the heathen world from the rising and setting of the sun, i.e., in every direction. The ah of וּממּערבה is not a feminine termination (lxx, Targ., Jer.), but a feminine suffix with He raphato pro mappic (Kimchi); compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 23:17-18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 34:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (but not נצּה in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 18:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or מוּסדה in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 30:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Shemesh (the sun) is a feminine here, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 15:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nahum 3:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Malachi 4:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and always in Arabic; for the west is invariably called מערב (Arab. magrib). In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 45:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " we are led by the context to understand by darkness and evil the penal judgments, through which light and peace, or salvation, break forth for the people of God and the nations generally. But as the prophecy concerning Cyrus closes with this self-assertion of Jehovah, it is unquestionably a natural supposition that there is also a contrast implied to the dualistic system of Zarathustra, which divided the one nature of the Deity into two opposing powers (see Windischmann, Zoroastrische Studien, p. 135). The declaration is so bold, that Marcion appealed to this passage as a proof that the God of the Old Testament was a different being from the God of the New, and not the God of goodness only. The Valentinians and other gnostics also regarded the words \"There is no God beside me\" in Isaiah, as deceptive words of the Demiurugs. The early church met them with Tertullian's reply, \"de his creator profitetur malis quae congruunt judici,\" and also made use of this self-attestation of the God of revelation as a weapon with which to attack Manicheesism. The meaning of the words is not exhausted by those who content themselves with the assertion, that by the evil (or darkness) we are not to understand the evil of guilt (malum culpae), but the evil of punishment (malum paenae). Undoubtedly, evil as an act is not the direct working of God, but the spontaneous work of a creature endowed with freedom. At the same time, evil, as well as good, has in this sense its origin in God - that He combines within Himself the first principles of love and wrath, the possibility of evil, the self-punishment of evil, and therefore the consciousness of guilt as well as the evil of punishment in the broadest sense. When the apostle celebrates the glory of free grace in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 9:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., he stands on that giddy height, to which few are able to follow him without falling headlong into the false conclusions of a decretum absolutum, and the denial of all creaturely freedom. ",
        "children": []
      }
    ]
  }
]