[{"num":6,"verse":"The ark of Adonai was in the country of the P’lishtim for seven months. "},{"num":2,"verse":"The P’lishtim summoned the priests and soothsayers and asked them, “What are we to do with the ark of Adonai? Tell us how to send it back where it belongs.” "},{"num":3,"verse":"They said, “If you do send off the ark of the God of Isra’el, don’t send it back empty, but return it with some sort of guilt offering for him. Then you will be cured, and you will learn why he has not stopped oppressing you.” "},{"num":4,"verse":"They asked, “What kind of guilt offering should we send him?” and they replied, “Five gold models of tumors and five gold rats, because that’s how many leaders the P’lishtim have, and you and your leaders all had the same illness. "},{"num":5,"verse":"So make models of your tumors and models of your rats that are infesting your land, and show respect to the God of Isra’el. Maybe he will stop oppressing you, your gods and your land. "},{"num":6,"verse":"Why be obstinate like the Egyptians and Pharaoh were? When he had done his work among them, didn’t they let the people go? — and they left. "},{"num":7,"verse":"Now take and prepare yourselves a new cart and two milk-cows that have never been under a yoke. Harness the cows to the cart, but put their calves back in the shed. "},{"num":8,"verse":"Then take the ark of Adonai and lay it on the cart. In a box next to it, put the gold objects you are sending back to him as a guilt offering. Then send it away to go off by itself, "},{"num":9,"verse":"but watch to see if it goes up the road to Beit-Shemesh in its own territory. If it does, he is responsible for this great tragedy; if not, we will know that it is not his oppression which has been over us, but that what has been happening to us has been only by chance.”"},{"num":10,"verse":"The men did it. They took two milk-cows, harnessed them to the cart and confined their calves to the shed. "},{"num":11,"verse":"Then they put the ark on the cart, along with the box containing the gold rats and the models of their tumors. "},{"num":12,"verse":"The cows made straight for the road to Beit-Shemesh and took that route, mooing as they went and turning off neither to the right nor to the left. The leaders of the P’lishtim followed them as far as the border of Beit-Shemesh."},{"num":13,"verse":"The people of Beit-Shemesh were harvesting their wheat in the valley when they looked up and saw the ark. They were so happy to see it! "},{"num":14,"verse":"The cart entered the field of Y’hoshua the Beit-Shimshi and stood there by a big rock. They cut up the wood of the cart and offered up the cows as a burnt offering to Adonai. "},{"num":15,"verse":"Then the L’vi’im removed the ark of Adonai and the box that was with it, which contained the gold objects, and put them on the big rock. That same day the men of Beit-Shemesh offered burnt offerings and sacrifices to Adonai. "},{"num":16,"verse":"Upon seeing this, the five leaders of the P’lishtim returned that day to ‘Ekron."},{"num":17,"verse":"The gold tumors which the P’lishtim sent back as a guilt offering for Adonai were one each for Ashdod, ‘Azah, Ashkelon, Gat and ‘Ekron; "},{"num":18,"verse":"and the gold rats also corresponded to the number of all the cities of the P’lishtim that belonged to the five leaders — fortified cities and country villages. [The rock] is a witness to this day of the great mourning [which resulted from] putting the ark of Adonai on it in the field of Y’hoshua the Beit-Shimshi; "},{"num":19,"verse":"for [Adonai] struck the people of Beit-Shemesh for looking at the ark of Adonai. He killed 50,070 of the people; the people mourned because Adonai had struck them with such a terrible slaughter. "},{"num":20,"verse":"The people of Beit-Shemesh asked, “Who can stand before Adonai, this holy God? To whom can we send it, to get it away from us?”"},{"num":21,"verse":"They sent messengers to the people living in Kiryat-Ye‘arim with this message: “The P’lishtim have returned the ark of Adonai. Come down and bring it back up with you.”"}]