[{"header":"The Return of the Covenant Box"},{"num":6,"verse":"After the Lord's Covenant Box had been in Philistia for seven months, "},{"num":2,"verse":"the people called the priests and the magicians and asked, “What shall we do with the Covenant Box of the Lord? If we send it back where it belongs, what shall we send with it?”"},{"num":3,"verse":"They answered, “If you return the Covenant Box of the God of Israel, you must, of course, send with it a gift to him to pay for your sin. The Covenant Box must not go back without a gift. In this way you will be healed, and you will find out why he has kept on punishing you.”"},{"num":4,"verse":"“What gift shall we send him?” the people asked."},{"num":5,"verse":"You must make these models of the tumors and of the mice that are ravaging your country, and you must give honor to the God of Israel. Perhaps he will stop punishing you, your gods, and your land. "},{"num":6,"verse":"Why should you be stubborn, as the king of Egypt and the Egyptians were? Don't forget how God made fools of them until they let the Israelites leave Egypt. "},{"num":7,"verse":"So prepare a new wagon and two cows that have never been yoked; hitch them to the wagon and drive their calves back to the barn. "},{"num":8,"verse":"Take the Lord's Covenant Box, put it on the wagon, and place in a box beside it the gold models that you are sending to him as a gift to pay for your sins. Start the wagon on its way and let it go by itself. "},{"num":9,"verse":"Then watch it go; if it goes toward the town of Beth Shemesh, this means that it is the God of the Israelites who has sent this terrible disaster on us. But if it doesn't, then we will know that he did not send the plague; it was only a matter of chance.”"},{"num":10,"verse":"They did what they were told: they took two cows and hitched them to the wagon, and shut the calves in the barn. "},{"num":11,"verse":"They put the Covenant Box in the wagon, together with the box containing the gold models of the mice and of the tumors. "},{"num":12,"verse":"The cows started off on the road to Beth Shemesh and headed straight toward it, without turning off the road. They were mooing as they went. The five Philistine kings followed them as far as the border of Beth Shemesh."},{"num":13,"verse":"The people of Beth Shemesh were reaping wheat in the valley, when suddenly they looked up and saw the Covenant Box. They were overjoyed at the sight. "},{"num":14,"verse":"The wagon came to a field belonging to a man named Joshua, who lived in Beth Shemesh, and it stopped there near a large rock. The people chopped up the wooden wagon and killed the cows and burned them as a burnt sacrifice to the Lord. "},{"num":15,"verse":"The Levites lifted off the Covenant Box of the Lord and the box with the gold models in it, and placed them on the large rock. Then the people of Beth Shemesh offered burnt sacrifices and other sacrifices to the Lord. "},{"num":16,"verse":"The five Philistine kings watched them do this and then went back to Ekron that same day."},{"num":17,"verse":"The Philistines sent the five gold tumors to the Lord as a gift to pay for their sins, one each for the cities of Ashdod, Gaza, Ashkelon, Gath, and Ekron. "},{"num":18,"verse":"They also sent gold mice, one for each of the cities ruled by the five Philistine kings, both the fortified towns and the villages without walls. The large rock in the field of Joshua of Beth Shemesh, on which they placed the Lord's Covenant Box, is still there as a witness to what happened."},{"num":19,"verse":"The Lord killed seventy of the men of Beth Shemesh because they looked inside the Covenant Box. And the people mourned because the Lord had caused such a great slaughter among them."},{"header":"The Covenant Box at Kiriath Jearim"},{"num":20,"verse":"So the men of Beth Shemesh said, “Who can stand before the Lord, this holy God? Where can we send him to get him away from us?” "},{"num":21,"verse":"They sent messengers to the people of Kiriath Jearim to say, “The Philistines have returned the Lord's Covenant Box. Come down and get it.”"}]