[{"num":6,"verse":"The Ark remained in the Philistine country for seven months in all. "},{"num":2,"verse":"Then the Philistines called for their priests and diviners and asked them, “What shall we do about the Ark of God? What sort of gift shall we send with it when we return it to its own land?”"},{"num":3,"verse":"“Yes, send it back with a gift,” they were told. “Send a guilt offering so that the plague will stop. Then, if it doesn’t, you will know God didn’t send the plague upon you after all.”"},{"num":4,"verse":"“What guilt offering shall we send?” they asked."},{"num":6,"verse":"Don’t be stubborn and rebellious as Pharaoh and the Egyptians were. They wouldn’t let Israel go until God had destroyed them with dreadful plagues. "},{"num":7,"verse":"Now build a new cart and hitch to it two cows that have just had calves—cows that never before have been yoked—and shut their calves away from them in the barn. "},{"num":8,"verse":"Place the Ark of God on the cart beside a chest containing the gold models of the rats and tumors, and let the cows go wherever they want to. "},{"num":9,"verse":"If they cross the border of our land and go into Beth-shemesh, then you will know that it was God who brought this great evil upon us; if they don’t but return to their calves, then we will know that the plague was simply a coincidence and was not sent by God at all.”"},{"num":10,"verse":"So these instructions were carried out. Two cows with newborn calves were hitched to the cart and their calves were shut up in the barn. "},{"num":11,"verse":"Then the Ark of the Lord and the chest containing the gold rats and tumors were placed upon the cart. "},{"num":12,"verse":"And sure enough, the cows went straight along the road toward Beth-shemesh, lowing as they went; and the Philistine mayors followed them as far as the border of Beth-shemesh. "},{"num":13,"verse":"The people of Beth-shemesh were reaping wheat in the valley, and when they saw the Ark, they went wild with joy!"},{"num":14,"verse":"The cart came into the field of a man named Joshua and stopped beside a large rock. So the people broke up the wood of the cart for a fire and killed the cows and sacrificed them to the Lord as a burnt offering. "},{"num":15,"verse":"Several men of the tribe of Levi lifted the Ark and the chest containing the gold rats and tumors from the cart and laid them on the rock. And many burnt offerings and sacrifices were offered to the Lord that day by the men of Beth-shemesh."},{"num":16,"verse":"After the five Philistine mayors had watched for a while, they returned to Ekron that same day. "},{"num":17,"verse":"The five gold models of tumors which had been sent by the Philistines as a guilt offering to the Lord were gifts from the mayors of the capital cities, Ashdod, Gaza, Ashkelon, Gath, and Ekron. "},{"num":18,"verse":"The gold rats were to placate God for the other Philistine cities, both the fortified cities and the country villages controlled by the five capitals. (By the way, that large rock at Beth-shemesh can still be seen in the field of Joshua.) "},{"num":19,"verse":"But the Lord killed seventy of the men of Beth-shemesh because they looked into the Ark. And the people mourned because of the many people whom the Lord had killed."},{"num":20,"verse":"“Who is able to stand before Jehovah, this holy God?” they cried out. “Where can we send the Ark from here?”"},{"num":21,"verse":"So they sent messengers to the people at Kiriath-jearim and told them that the Philistines had brought back the Ark of the Lord."}]