[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(19) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The Lord God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—This is an adaptation from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 18:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The “hinds’ feet” indicate the strength and elasticity of the prophet’s confidence; the “high places” are, as Kleinert observes, “the heights of salvation which stand at the end of the way of tribulation, and which only the righteous man can climb by the confidence of faith.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "To the chief singer—i.e., to the precentor, or presiding singer. The rubric may be interpreted either “To the precentor. (To be performed) on my stringed instruments,” or, “To him who presides over my stringed instruments.” The fact that the same direction occurs with the words in the same order in six Psalms perhaps favours the latter rendering in all cases. The preposition al would, however, in this case be appropriate rather than b’ On the terms used, see Psalm 4:1. It has been inferred from the use of the possessive pronoun, “my stringed instruments,” that Habakkuk was a Levite, and therefore himself entitled to accompany the Temple music. But see Introduction, § 1.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "To the chief singer",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "i.e.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", to the precentor, or presiding singer. The rubric may be interpreted either “To the precentor. (To be performed) on my stringed instruments,” or, “To him who presides over my stringed instruments.” The fact that the same direction occurs with the words in the same order in six Psalms perhaps favours the latter rendering in all cases. The preposition ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "al",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " would, however, in this case be appropriate rather than ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "b",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "’ On the terms used, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 4:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". It has been inferred from the use of the possessive pronoun, “",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "my",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " stringed instruments,” that Habakkuk was a Levite, and therefore himself entitled to accompany the Temple music. But see Introduction, § 1.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Habakkuk",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "THE IDEAL DEVOUT LIFEHabakkuk 3:19",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "THE IDEAL DEVOUT LIFE",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 3:19",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So ends one of the most magnificent pieces of imaginative poetry in Scripture or anywhere else. The singer has been describing a great delivering manifestation of the Most High God, which, though he knew it was for the deliverance of God’s people, shed awe and terror over his soul. Then he gathers himself together to vow that in this God, thus manifested as the God of his salvation, he ‘will rejoice,’ whatever penury or privation may attach to his outward life. Lastly, he rises, in these final words, to the apprehension of what this God, thus rejoiced in, will become to those who so put their trust and their gladness upon Himself.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The expressions are of a highly metaphorical and imaginative character, but they admit of being brought down to very plain facts, and they tell us the results in heart and mind of true faith and communion with God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " It is to be noticed that a parallel saying, almost verbatim the same as that of my text, occurs in the 18th psalm, and that there, too, it is the last and joyous result of a tremendous manifestation of the delivering energy of God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Without any attempt to do more than bring out the deep meaning of the words, I note that the three clauses of our text present three aspects of what our lives and ourselves may steadfastly be if we, too, will rejoice in the God of our salvation.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. First, such communion with God brings God to a man for his strength. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. First, such communion with God brings God to a man for his strength.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The 18th psalm, which is closely parallel, as I have remarked, with this one, gives a somewhat different and inferior version of that thought when it says, ‘It is the Lord that girdeth me with strength.’ But Habakkuk, though perhaps he could not have put into dogmatic shape all that he meant, had come farther than that with this: ‘The Lord is my strength.’ He not only ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "gives",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as one might put a coin into the hand of a beggar, while standing separate from him all the while, but ‘He is my strength.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And what does that mean? It is an anticipation of that most wonderful and highest of all the New Testament truths which the Apostle declared when he said: ‘I can do all things in Christ which strengtheneth me within.’ It is the anticipation in experience-which always comes before dogmatic formulas that reduce experiences into articulate utterances, of what the Apostle recorded when he said that he had heard the voice that declared, ‘My grace is sufficient for thee, and My strength is made perfect in weakness.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Ah, brother! do not let us deprive ourselves of the lofty consolations and the mysterious influx of power which may be ours, if we will open our eyes to see, and our hearts to receive, what is really the central blessing of the Gospel, the communication through the same faith as Habakkuk exercised when he said, ‘I will rejoice in the God of my salvation,’ of an actual divine strength to dwell in and manifest itself majestically and triumphantly through, our weakness. ‘The Lord is my strength,’ and if we will rejoice in the Lord we shall find that Habakkuk’s experience was lower than ours, inasmuch as he knew less of God than we do; and we shall be able to surpass his saying with the other one of the Prophet: ‘The Lord is my strength and song; He also is become my salvation.’ That is the first blessing that this ancient believer, out of the twilight of early revelation, felt as certain to come through communion with God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. The second is like unto it. Such rejoicing communion with God will give light-footedness in the path of life. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. The second is like unto it. Such rejoicing communion with God will give light-footedness in the path of life.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘He makes my feet like hinds’ feet.’ The stag is, in all languages spoken by people that have ever seen it, the very type and emblem of elastic, springing ease, of light and bounding gracefulness, that clears every obstacle, and sweeps swiftly over the moor. And when this singer, or his brother psalmist in the other psalm that we have referred to, says, ‘Thou makest my feet like hinds’ feet,’ what he is thinking about is that light and easy, springing, elastic gait, that swiftness of advance. What a contrast that is to the way in which most of us get through our day’s work! Plod, plod, plod, in a heavy-footed, spiritless grind, like that with which the ploughman toils down the sticky furrows of a field, with a pound of clay at each heel; or like that with which a man goes wearied home from his work at night. The monotony of trivial, constantly recurring doings, the fluctuations in the thermometer of our own spirits; the stiff bits of road that we have all to encounter sooner or later; and as days go on, our diminishing buoyancy of nature, and the love of walking a little slower than we used to do; we all know these things, and our gait is affected by them. But then my text brings a bright assurance, that swift and easy and springing as the course of a stag on a free hill-side may be the gait with which we run the race set before us.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " It is the same thought, under a somewhat different garb, which the Apostle has when he tells us that the Christian soldier ought to have his ‘feet shod with the alacrity that comes from the gospel of peace.’ We are to be always ready to run, and to run with light hearts when we do. That is a possible result of Christian communion, and ought, far more than it is, to be an achieved reality with each of us. Of course physical conditions vary. Of course our spirits go up and down. Of course the work that we have to do one day seems easier than the same work does another. All these fluctuations and variations, and causes of heavy-footedness-and sometimes more sinful ones, causes of sluggishness-will survive; but in spite of them all, and beneath them all, it is possible that we may have ourselves thus equipped for the road, and may rejoice in our work ‘as a strong man to run a race,’ and may cheerily welcome every duty, and cast ourselves into all our tasks. It is possible, because communion with God manifest in Christ does, as we have been seeing, actually breathe into men a vigour, and consequently a freshness and a buoyancy that do not belong to themselves, and do not come from nature or from surrounding things. Unless that is true, that Christianity gives to a man the divine gladness which makes him ready for work, I do not know what is the good of his Christianity to him.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But not only is that so, but this same communion with God, which is the opening of the heart for the influx of the divine power, brings to bear upon all our work new motives which redeem it from being oppressive, tedious, monotonous, trivial, too great for our endurance, or too little for our effort. All work that is not done in fellowship with Jesus Christ tends to become either too heavy to be tackled successfully, or too trivial to demand our best energies, and in either case will be done perfunctorily, and as the days go on, mechanically and wearisomely, as a grind and a pled. ‘Thou makest my feet like hinds’ feet’-if I get the new motive of love to God in Christ well into my heart so that it comes out and influences all my actions, there will be no more tasks too formidable to undertake, or too small to be worth an effort. There will be nothing unwelcome. The rough places will be made plain, and the crooked things straight, and our feet will be shod with the preparedness of the gospel of peace.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " If we live in daily communion with God, another thought, too, will come in, which will, in like manner, make us ready ‘to run with’ cheerfulness ‘the race that is set before us.’ We shall connect everything that befalls us, and everything that we have to do, with the final issue, and life will become solemn, grave, and blessed, because it is the outer court and vestibule of the eternal life with God in Christ. They that hold communion with Him, and only they, will, as another prophet says, ‘run and not be weary,’ when there come the moments that require a special effort; and ‘will walk and not faint’ through the else tediously long hours of commonplace duty and dusty road.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. The last of the thoughts here is-Communion with God brings elevation. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. The last of the thoughts here is-Communion with God brings elevation.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘He will make me to walk upon my high places.’ One sees the herd on the skyline of the mountain ridge, and at home up there, far above dangers and attack; able to keep their footing on cliff and precipice, and tossing their antlers in the pure air. One wave of the hand, and they are miles away. ‘He sets me upon my high places’; if we will keep ourselves in simple, loving fellowship with God in Christ; and day by day, even when ‘the fig-tree does not blossom, and there is no fruit in the vine,’ will still ‘rejoice in the God of our salvation,’ He will lift us up, and Isaiah’s other clause in the verse which I have quoted will be fulfilled: ‘They shall mount up with wings as eagles.’ Communion with God does not only help us to plod and to travel, but it helps us to soar. If we keep ourselves in touch with Him, we shall be like a weight that is hung on to a balloon. The buoyancy of the one will lift the leadenness of the other. If we hold fast by Christ’s hand that will lift us up to the high places, the heights of God, in so far as we may reach them in this world; and we shall be at home up there. They will be ‘",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "my",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " high places,’ that I never could have got at by my own scrambling, but to which Thou hast lifted me up, and which, by Thy grace, have become my natural abode. I am at home there, and walk at liberty in the loftiness, and fear no fall amongst the cliffs.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Are you and I familiar with these upper ranges of thought and experience and life? Do we feel at home there more than down in the bottoms, amongst the swamps, and the miasma, and the mists? Where is your home, brother? The Mass begins with ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Sursum corda",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": ‘Up with your hearts,’ and that is the word for us. But the way to get up is to keep ourselves in touch with Jesus Christ, and then He will, even whilst our feet are travelling along this road of earth, set us at His own right hand in the heavenly places, and make them ‘",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "our",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " high places.’ It is safe up there. The air is pure; the poison mists are down lower; the hunters do not come there; their arrows or their rifles will not carry so far. It is only when the herd ventures a little down the hill that it is in danger from shots.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But the elevation will not be such as to make us despise the low paths on which duty-the sufficient and loftiest thing of all-lies for us. Our souls may be like stars, and dwell apart, and yet may lay the humblest duties upon themselves, and whilst we live in the high places, we ‘may travel on life’s common way in cheerful godliness.’ Communion with Him will make us light-footed, and lift us high, and yet it will keep us at desk, and mill, and study, and kitchen, and nursery, and shop, and we shall find that the high places are reachable in every life, and in every task. So we may go on until at last we shall hear the Voice that says, ‘Come up higher,’ and shall he lifted to the mountain of God, where the living waters are, and shall fear no snares or hunters any more for ever.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Habakkuk 3:19",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 3:19",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The Lord God is my strength — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "He that is the God of our salvation in another world, will be our strength in this world, to carry us on in our journey thither, and help us over the difficulties and oppositions we meet with in our way, even then when provisions are cut off, to make it appear that man does ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "not live by bread alone, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "but may have the want of bread supplied by the graces and comforts of God’s Spirit. Observe, reader: 1st, We may be strong for our spiritual warfare and work, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The Lord God is my strength, the strength of my heart, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 73:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". 2d, We may be ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "swift ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "for our spiritual race, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He will make my feet like hinds’ feet, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "that with enlargement of heart I may run the way of his commandments. 3d, We may be successful in our spiritual enterprises, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He will make me to walk upon my high places: ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "that is, I shall gain my point, shall be restored unto my land, and tread upon the high places of the enemy: see the notes on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 18:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 33:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Thus the prophet, who began his prayer with fear and trembling, concludes it with joy and triumph; for prayer is the support and consolation of a pious soul. And as he seems to have had the beginning of Moses’s blessing in his eye, at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Habakkuk 3:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", so in this he alludes to the conclusion of it. Some think it appears from the last words, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "To the chief singers, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c., that this prayer was sung in the temple service. Houbigant, however, gives the last words another turn, rendering them thus: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And shall bring me to the tops of the mountains to victory in my song; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or, that I may overcome, when those things which I here sing shall have their completion. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3:16-19 When we see a day of trouble approach, it concerns us to prepare. A good hope through grace is founded in holy fear. The prophet looked back upon the experiences of the church in former ages, and observed what great things God had done for them, and so was not only recovered, but filled with holy joy. He resolved to delight and triumph in the Lord; for when all is gone, his God is not gone. Destroy the vines and the fig-trees, and you make all the mirth of a carnal heart to cease. But those who, when full, enjoyed God in all, when emptied and poor, can enjoy all in God. They can sit down upon the heap of the ruins of their creature-comforts, and even then praise the Lord, as the God of their salvation, the salvation of the soul, and rejoice in him as such, in their greatest distresses. Joy in the Lord is especially seasonable when we meet with losses and crosses in the world. Even when provisions are cut off, to make it appear that man lives not by bread alone, we may be supplied by the graces and comforts of God's Spirit. Then we shall be strong for spiritual warfare and work, and with enlargement of heart may run the way of his commandments, and outrun our troubles. And we shall be successful in spiritual undertakings. Thus the prophet, who began his prayer with fear and trembling, ends it with joy and triumph. And thus faith in Christ prepares for every event. The name of Jesus, when we can speak of Him as ours, is balm for every wound, a cordial for every care. It is as ointment poured forth, shedding fragrance through the whole soul. In the hope of a heavenly crown, let us sit loose to earthly possessions and comforts, and cheerfully bear up under crosses. Yet a little while, and He that shall come will come, and will not tarry; and where he is, we shall be also.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The Lord God is my strength - The prophet does not inwardly only exult and triumph in God, but he confesses also in words of praise, that in Him he hath all things, that He is All things in him. And as he had confessed the Father, under the Name whereby He revealed Himself to Moses, and the Son, \"the Lord God of my salvation,\" so he confesses  God the Holy Ghost, who, in us, is our strength. \"He is our strength,\" so that through Him, we can do all things; \"He is our strength,\" so that without Him, we can do nothing; \"He is our strength,\" so that when we put forth strength, we put forth nothing of our own, we add nothing of our own, we use not our own strength, of which we have none, but we do use His; and we have It ever ready to use, as if it were our own. For it is not our own and it is our own; not our own, i. e., not from or of ourselves; but our own, since It is in us, yea \"He the Lord our God is our strength,\" not without us, for He is our strength, but in us.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And so he says further, how we can use it as our own. \"He will make my feet like hinds,\" which bound upward through His imparted strength, trod, when scared by alarms here below, flee tearless to their native reeks, spring from height to height, and at last shew themselves on some high peak, and standing on the Rock, look down on the whole world below their feet and upward on high. Even so  when at the end of the world all shall fail, and the love of many shall wax cold, and the Church, which is likened to the fig tree the vine and the (Luke 13:6; Isaiah 5:1; Isaiah 21:33; etc. Romans 11:17.) olive, shall yield no fruits, and sweetness shall be corrupted by vanities, and the oil of mercy shall be dried up, and lamps go out, and its promises shall fail and it shall lie, having \"a show of goodness, but denying the power of it; in words confessing God, and in works denying Him;\" and through their own negligences, or the carelessness of pastors, the sheep of Christ shall perish from His very fold, and they who should be strong to labor 1 Corinthians 9:9-10. shall cease, God's elect shall joy in Him, \"beholding His goodness, and loving Him in all things, and He will give them free affections, and fervid longings of holy love, whereby they shall not walk only, but run the way of His commandments and prevail over the enemies of their salvation.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And so he says further, how we can use it as our own. \"He will make my feet like hinds,\" which bound upward through His imparted strength, trod, when scared by alarms here below, flee tearless to their native reeks, spring from height to height, and at last shew themselves on some high peak, and standing on the Rock, look down on the whole world below their feet and upward on high. Even so  when at the end of the world all shall fail, and the love of many shall wax cold, and the Church, which is likened to the fig tree the vine and the (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 13:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 5:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 21:33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; etc. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 11:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".) olive, shall yield no fruits, and sweetness shall be corrupted by vanities, and the oil of mercy shall be dried up, and lamps go out, and its promises shall fail and it shall lie, having \"a show of goodness, but denying the power of it; in words confessing God, and in works denying Him;\" and through their own negligences, or the carelessness of pastors, the sheep of Christ shall perish from His very fold, and they who should be strong to labor ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 9:9-10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". shall cease, God's elect shall joy in Him, \"beholding His goodness, and loving Him in all things, and He will give them free affections, and fervid longings of holy love, whereby they shall not walk only, but run the way of His commandments and prevail over the enemies of their salvation.\"",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Yet though this strength is inward, and used by man, still God who gives it, Himself guides it. Not man shall \"direct his own ways,\" but \"He will make me to walk (as on a plain way) upon my high place.\" Steep and slippery places and crags of the reeks are but ways to the safe height above, to those whom God makes to walk on them; and since he has passed all things earthly, what are his high places, but the heavenly places, even his home, even while a pilgrim here, but now at the end, much more his home, when not in hope only, but in truth, he is \"raised up together, and made to sit together in heavenly places in Christ Jesus?\" Ephesians 2:6)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Yet though this strength is inward, and used by man, still God who gives it, Himself guides it. Not man shall \"direct his own ways,\" but \"He will make me to walk (as on a plain way) upon my high place.\" Steep and slippery places and crags of the reeks are but ways to the safe height above, to those whom God makes to walk on them; and since he has passed all things earthly, what are his high places, but the heavenly places, even his home, even while a pilgrim here, but now at the end, much more his home, when not in hope only, but in truth, he is \"raised up together, and made to sit together in heavenly places in Christ Jesus?\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ephesians 2:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ")",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And now what remains then, but that this song of praise should be forever? And so it is not without meaning, nor was of old thought to be so  that there stand here, at the end, words which elsewhere in the Psalms always stand at the beginning. Nor is it anywhere else, \"upon my stringed instruments.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "To the chief singer on my stringed instruments - To Him to whom all praise is due, through whom we praise Himself, His Spirit pleading in us, for us, \"upon my stringed instruments.\" He Himself, providing, as it were, and teaching the prelude of the endless song, and by His spirit, breathing upon the instrument which He has attuned, and it giving back faithfully, in union with the heavenly choir with whom it is now blended, the angelic hymn, \"Glory to God in the Highest.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "To the chief singer on my stringed instruments - To Him to whom all praise is due, through whom we praise Himself, His Spirit pleading in us, for us, \"upon my stringed instruments.\" He Himself, providing, as it were, and teaching the prelude of the endless song, and by His spirit, breathing upon the instrument which He has attuned, and it giving back faithfully, in union with the heavenly choir with whom it is now blended, the angelic hymn, \"Glory to God in the Highest.\"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "19. hinds' feet … walk upon … high places—Habakkuk has here before his mind Ps 18:33, 34; De 32:13. \"Hinds' (gazelles') feet\" imply the swiftness with which God enables him (the prophet and his people) to escape from his enemies, and return to his native land. The \"high places\" are called \"mine,\" to imply that Israel shall be restored to his own land, a land of hills which are places of safety and of eminence (compare Ge 19:17; Mt 24:16). Probably not only the safety, but the moral elevation, of Israel above all the lands of the earth is implied (De 33:29).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "on my stringed instruments—neginoth. This is the prophet's direction to the precentor (\"chief singer\") as to how the preceding ode (Hab 3:1-19) is to be performed (compare Ps 4:1; 6:1, titles). The prophet had in mind a certain form of stringed instrument adapted to certain numbers and measures. This formula at the end of the ode, directing the kind of instrument to be used, agrees with that in the beginning of it, which directs the kind of melody (compare Isa 38:20).   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " The prophet had in his own, and in the name of all the godly, made a full profession of his faith, and resolution to behave himself with joy in midst of troubles, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Habakkuk 3:17,18",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 3:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",18",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; now he gives us account on what ground he speaks so, it is not in his own strength he can do it, but it is because the Lord God is his strength. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He will make my feet like hinds’ feet; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that I may escape to God my refuge to that safe mountain of salvation, that I may at last flee from Babylon to Judea, to Jerusalem. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He will make me to walk upon mine high places; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to my native country, to my beloved city, and thy more beloved temple, which were built like high places to that munition of rocks, &c., ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Deu 32:13 Isaiah 33:16",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deu 32:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 33:16",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". My God will return my captivity, and when I am set at liberty, as I shall be, by Cyrus, my God will be my strength, that, as a hind let loose, I may hasten to the mountains of Israel. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "To the chief singer; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " let this be kept on record for public use, this be a pattern for others as well as it is a declaration of my faith, hope, desire, and prayer. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The Lord God is my strength,.... The author and giver of natural and spiritual strength, as he is to all his people; he is the strength of their hearts when ready to faint and sink, and of their graces, faith, hope, love, patience, &c. and continues and increases them, and draws them forth into lively acts and exercise; and of their lives, natural and spiritual, which he supports and maintains, secures and defends; from him they have their strength to perform the duties of religion; to oppose their spiritual enemies, sin, Satan, and the world; and to bear them up under all trials and afflictions, and carry them through them, and deliver out of them, and which is principally intended here: the church, though in distress, and pressed with sorrows, yet believed the strength of Christ would be made perfect in her weakness, and she should be upheld by him under all, and brought out of it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and he will make my feet like hinds' feet; swift as they, as the Targum, which are very swift; and on account of the swiftness of them is the comparison used: and which is to be understood, not barely of the Jews being swift of foot to return to their own country, when the time of their conversion is come; or to pursue their enemies, as Kimchi; that is, Gog or the Turks, having got the victory over them: but of all Christians, whose feet will be swift to run, in a lively cheerful manner, the way of Christ's commandments; their souls being strengthened, and their hearts enlarged with the love and grace of God; and to surmount with ease all difficulties and obstructions that lie in their way: and chiefly this regards the ministers of the Gospel, and the swift progress they will make in spreading it in the world; as the apostles and first ministers of the word, having their feet shod with the preparation of the Gospel of peace, went swiftly through all parts of the world, even to the ends of the earth, with it; so in the latter day many will run to and fro, everywhere preaching the everlasting Gospel to all nations; the knowledge of it shall greatly increase; see  Daniel 12:4 this passage seems to be taken out of  Psalm 18:33 and there may be not only an allusion to the swiftness of those creatures, but to the strength and firmness of their feet; so that they can go upon rocks and mountains securely, and tread and walk, and even run upon them with safety; and this sense is directed to, not only by what follows, concerning \"walking\" on \"high places\"; but by the word here used, which signifies to \"make\", or \"set\", fix, place, order, and settle (b); and this agrees with the nature of those creatures, whose feet are not only swift, but firm; they tread sure and stable; hence hinds and harts are by the poets (c) called the \"brasen footed hinds\", or \"harts\"; because of the firmness and stability of their going; and it is an observation of Jarchi's (d), that the feet of the females stand firmer and more upright than the feet of the males; wherefore, both here, and in Psalm 18:33, not harts, but hinds, are made mention of; and so this may also denote the stability of the saints in those times, both ministers and common Christians, in the exercise of grace, and in the performance of duty; their hearts will be established in the faith of Christ, and in love to him, and in the hope of eternal life by him; all which they will be settled in, and will hold fast, and not let go; and will be steadfast and immovable, always abounding in the work of the Lord their God; and so in the Gospel of Christ, and in the ordinances of it, their souls will be established in and with the doctrines of grace, and will continue steadfastly in them, and abide by and keep the ordinances as they have been delivered to them; nor will any difficulties, which may seem like hills and mountains, and cragged rocks, deter or discourage them, or move them from the hope of the Gospel, or from their duty; but they shall walk on securely and firmly: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and he will make my feet like hinds' feet; swift as they, as the Targum, which are very swift; and on account of the swiftness of them is the comparison used: and which is to be understood, not barely of the Jews being swift of foot to return to their own country, when the time of their conversion is come; or to pursue their enemies, as Kimchi; that is, Gog or the Turks, having got the victory over them: but of all Christians, whose feet will be swift to run, in a lively cheerful manner, the way of Christ's commandments; their souls being strengthened, and their hearts enlarged with the love and grace of God; and to surmount with ease all difficulties and obstructions that lie in their way: and chiefly this regards the ministers of the Gospel, and the swift progress they will make in spreading it in the world; as the apostles and first ministers of the word, having their feet shod with the preparation of the Gospel of peace, went swiftly through all parts of the world, even to the ends of the earth, with it; so in the latter day many will run to and fro, everywhere preaching the everlasting Gospel to all nations; the knowledge of it shall greatly increase; see  ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 12:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " this passage seems to be taken out of  ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 18:33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and there may be not only an allusion to the swiftness of those creatures, but to the strength and firmness of their feet; so that they can go upon rocks and mountains securely, and tread and walk, and even run upon them with safety; and this sense is directed to, not only by what follows, concerning \"walking\" on \"high places\"; but by the word here used, which signifies to \"make\", or \"set\", fix, place, order, and settle (b); and this agrees with the nature of those creatures, whose feet are not only swift, but firm; they tread sure and stable; hence hinds and harts are by the poets (c) called the \"brasen footed hinds\", or \"harts\"; because of the firmness and stability of their going; and it is an observation of Jarchi's (d), that the feet of the females stand firmer and more upright than the feet of the males; wherefore, both here, and in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 18:33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", not harts, but hinds, are made mention of; and so this may also denote the stability of the saints in those times, both ministers and common Christians, in the exercise of grace, and in the performance of duty; their hearts will be established in the faith of Christ, and in love to him, and in the hope of eternal life by him; all which they will be settled in, and will hold fast, and not let go; and will be steadfast and immovable, always abounding in the work of the Lord their God; and so in the Gospel of Christ, and in the ordinances of it, their souls will be established in and with the doctrines of grace, and will continue steadfastly in them, and abide by and keep the ordinances as they have been delivered to them; nor will any difficulties, which may seem like hills and mountains, and cragged rocks, deter or discourage them, or move them from the hope of the Gospel, or from their duty; but they shall walk on securely and firmly: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and he will make me to walk upon mine high places: meaning not so much the high places of the land of Judea, some part of it being mountainous, though there may be some reference to them; but it signifies the exalted state of the church after the troublesome times, when it shall be exalted above the hills, and established on the top of the mountains; when Christ the Lamb, with his 144,000 sealed ones, shall stand upon Mount Zion with harps in their hands, having gotten the victory over the antichristian beast and his image; and when the saints shall have the dominion of the world; and the kingdom and the greatness of it, under the whole heaven, shall be given to them, Isaiah 2:2 as well as they shall be in lively, spiritual, and heavenly frames of soul; mount up with wings, as eagles; soar aloft in the exercise of faith; dwell on high in the contemplation of divine things; have their affections set on things above; and their conversation in heaven while they are on earth: especially this may be said of them when they shall have the glory of God upon them in the New Jerusalem state, and shall dwell in the new heavens and the new earth, with Christ at the head of them; and when they shall possess the ultimate glory in the highest heavens to all eternity; see  Deuteronomy 33:29 and thus ends this prayer of Habakkuk; which serves to draw out the desires of good men after the flourishing estate of the kingdom and interest of Christ; to assist their faith in the belief, hope, and expectation of it; and to lead their views to its summit and perfection, notwithstanding all the difficulties and discouragements that may lie in its way: and being of so much moment and importance, that it might remain and continue, and be of use to the church in succeeding ages, the prophet delivered or directed it ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and he will make me to walk upon mine high places: meaning not so much the high places of the land of Judea, some part of it being mountainous, though there may be some reference to them; but it signifies the exalted state of the church after the troublesome times, when it shall be exalted above the hills, and established on the top of the mountains; when Christ the Lamb, with his 144,000 sealed ones, shall stand upon Mount Zion with harps in their hands, having gotten the victory over the antichristian beast and his image; and when the saints shall have the dominion of the world; and the kingdom and the greatness of it, under the whole heaven, shall be given to them, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 2:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " as well as they shall be in lively, spiritual, and heavenly frames of soul; mount up with wings, as eagles; soar aloft in the exercise of faith; dwell on high in the contemplation of divine things; have their affections set on things above; and their conversation in heaven while they are on earth: especially this may be said of them when they shall have the glory of God upon them in the New Jerusalem state, and shall dwell in the new heavens and the new earth, with Christ at the head of them; and when they shall possess the ultimate glory in the highest heavens to all eternity; see  ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 33:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and thus ends this prayer of Habakkuk; which serves to draw out the desires of good men after the flourishing estate of the kingdom and interest of Christ; to assist their faith in the belief, hope, and expectation of it; and to lead their views to its summit and perfection, notwithstanding all the difficulties and discouragements that may lie in its way: and being of so much moment and importance, that it might remain and continue, and be of use to the church in succeeding ages, the prophet delivered or directed it ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "to the chief singer, to be set to tune, and sung by him, as David's prayers, and others, sometimes were, and to be preserved for future usefulness; and this he would have sung (he says) ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "on my stringed instruments; which were either invented by him, or used by him in the temple, or were his own property: or he sent this prayer or ode to him who was over these instruments, had the care and use of them; and which were such as were to be stricken with the hand, bone, or quill; and are the same that are called \"Neginoth\" in the title of the fourth Psalm Psa 4:1, and others. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(b)  , Sept.; \"et ponet\", V. L. Pagninus, Montanus, Burkius; \"qui disponit\", Junius & Tremellius; \"et possuit\", (c) \"Fixerit aeripedem cervam licet----\" Virgil. Aeneid. 6. prope finem. \"Vincunt aeripedes ter terno Nestore cervi.\" Ausonii Idyll. 11. (d) Comment. in Psal. xviii. 34. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(b)  , Sept.; \"et ponet\", V. L. Pagninus, Montanus, Burkius; \"qui disponit\", Junius & Tremellius; \"et possuit\", (c) \"Fixerit aeripedem cervam licet----\" Virgil. Aeneid. 6. prope finem. \"Vincunt aeripedes ter terno Nestore cervi.\" Ausonii Idyll. 11. (d) Comment. in Psal. xviii. 34. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "The LORD God is my strength, and he will make my feet like hinds' feet, and he will make me to walk upon my high places. {z} To the chief singer on my stringed instruments.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The LORD God ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " my strength, and he will make my feet like hinds' ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "feet",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and he will make me to walk upon my high places. ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{z}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " To the chief singer on my stringed instruments.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(z) The chief singer upon the instruments of music, will have occasion to praise God for this great deliverance of his Church.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The Lord God is my strength",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] lit. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Jehovah, the Lord is",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 73:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “God is the strength of my heart”; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 18:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “The God that girdeth me with strength.” The strength is an inward one, confidence and assurance and courageousness in the face of all external afflictions.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And he will make my feet",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "and he maketh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The points in the comparison are perhaps swiftness and security. What is suggested is the freshness of life, the power and confidence in action, which is felt to be drawn from God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And he will make me to walk",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "and he maketh me",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "upon mine high places",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The words seem still to carry on the figure of the “hinds’ feet.” The pronoun ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "mine",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " does not refer to any particular high places; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "my",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " high places are just those on which I walk or tread. Sept., Syr., Vulg. omit ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "my",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", with no difference of meaning. The phrase “tread on my high places” expresses the freedom, the superiority to hindrance or restraint, and the power, which the community is conscious of in the strength of God. Cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 18:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "To the chief singer",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] In the titles to Psalms 4, 6 the word is rendered ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "chief musician",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It means ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "director",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or, superintendent.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "on my stringed instruments",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Or, with my. In the titles to Psalms 4, 6 &c. in A.V. the original word ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "neginoth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is retained. In the sing this word may mean ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "playing",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " on strings, in the plur it appears to mean stringed instruments. The whole expression has the meaning: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "To the director in the",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Temple) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "music;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "To the director; with",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Temple) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "music",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The pronoun ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "my",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " occasions difficulty. On the assumption that this musical direction came from the author of the hymn it has been inferred that he was a Levite and a musician. Such an assumption would exclude the authorship of Habakkuk. But even supposing the author were some other Levite, how could a single member of the orchestra say “",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "my",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " stringed instruments”? The Sept. reads ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "his",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which might refer to the director, but no reliance can ever be placed on the pronouns of the Sept. All evidence, however, is against ascribing any of these musical directions to the authors of the hymns themselves. The similar passage ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 38:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " should perhaps be rendered: “Therefore will we strike (play) my stringed instruments all the days of our life in the house of the Lord.” In both passages the pronoun ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "my",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " must either be deleted according to the usage in the titles to Psalms 4, 6 &c., or the speaker who says “my” must be supposed to be the worshipping congregation. Only a collective body could say “my stringed instruments” and “our life” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 38:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") in the same breath.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 19.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The Lord God is my strength;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " more accurately, J",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "ehovah, the Lord, is my strength",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 18:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 27:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "He will make my feet like hinds' feet",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 18:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). He makes me active and swift-footed as the gazelle, as a lusty warrior (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 1:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 2:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") should be. So by the help of God I shall be superior to my enemies. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "He will make me to walk upon mine high places.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The expression is used properly of God (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and elsewhere, says Keil, to denote the victorious possession and government of a country (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 33:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Here it signifies that believing Israel shall overcome all opposition and dwell in safety in its own land. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "To the chief singer",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "musician",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "on my stringed instruments",
        "children": [
          {
            "element": "span",
            "class": "cmt_word",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "on my stringed instruments",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "neginoth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). This is a musical direction, answering to the heading in ver. 1, and implies that the ode is committed to the conductor of the temple music, to be by him adapted for the public service to the accompaniment of stringed instruments. Such directions are elsewhere always found at the beginning, not the end, of psalms (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 54",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 55",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 67",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 76",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".). It has been thought that the suffix of the first person, \"my stringed instruments,\" denotes that Habakkuk had a right to take part in the temple service, and was therefore a Levite; but it is very doubtful whether this suffix is not a clerical error, as Kuenen and Ewald suppose, or merely paragogic. Certainly neither the Greek, Latin, nor Syriac Versions afford it any confirmation. These versions make the subscription part of the ode. Thus LXX., ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "Ἐπι τὰ ὑψηλὰ ἐπιβιβᾶ με",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "τοῦ νικῆσαι ἐν τῇ ὠδῇ αὐτοῦ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", He maketh me to mount upon the high places, that I may conquer by his song;\" Vulgate, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Super excelsa mea deducet me victor",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "victori",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Cod. Amiat.) ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "in psalmis canentem.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Habakkuk 3:19",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Although trembling on account of the approaching trouble, the prophet will nevertheless exult in the prospect of the salvation that he foresees. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Habakkuk 3:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"But I, in Jehovah will I rejoice, will shout in the God of my salvation. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Habakkuk 3:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Jehovah the Lord is my strength, and makes my feet like the hinds, and causes me to walk along upon my high places.\" The turning-point is introduced with ואני ht, as is frequently the case in the Psalms. For this exaltation out of the sufferings of this life to believing joy in God, compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 5:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 13:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 31:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc. עלז, a softened form of עלץ, to rejoice in God (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 5:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), i.e., so that God is the inexhaustible source and infinite sphere of the joy, because He is the God of salvation, and rises up to judgment upon the nations, to procure the salvation of His people (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Habakkuk 3:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Elōhē yish‛ı̄ (the God of my salvation), as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 18:47",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 25:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 7:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The thoughts of the 19th verse are also formed from reminiscences of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ":the first clause, \"the Lord is my strength,\" from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 18:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"God, who girdeth me with strength,\" i.e., the Lord gives me strength to overcome all tribulation (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 27:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Corinthians 12:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The next two clauses are from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 18:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"He maketh my feet like hinds',\" according to the contracted simile common in Hebrew for \"hinds' feet;\" and the reference is to the swiftness of foot, which was one of the qualifications of a thorough man of war (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 1:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 12:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), so as to enable him to make a sudden attack upon the enemy, and pursue him vigorously. Here it is a figurative expression for the fresh and joyous strength acquired in God, which Isaiah calls rising up with eagles' wings (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 40:29-31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Causing to walk upon the high places of the land, was originally a figure denoting the victorious possession and government of a land. It is so in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 33:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", from which David has taken the figure in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", though he has altered the high places of the earth into \"my high places\" (bâmōthai). They were the high places upon which the Lord had placed him, by giving him the victory over his enemies. And Habakkuk uses the figurative expression in the same sense, with the simple change of יעמידני into ידרכני after ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 33:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to substitute for the bestowment of victory the maintenance of victory corresponding to the blessing of Moses. We have therefore to understand bâmōthai neither as signifying the high places of the enemy, nor the high places at home, nor high places generally. The figure must be taken as a whole; and according to this, it simply denotes the ultimate triumph of the people of God over all oppression on the part of the power of the world, altogether apart from the local standing which the kingdom of God will have upon the earth, either by the side of or in antagonism to the kingdom of the world. The prophet prays and speaks throughout the entire ode in the name of the believing congregation. His pain is their pain; his joy their joy. Accordingly he closes his ode by appropriating to himself and all believers the promise which the Lord has given to His people and to David His anointed servant, to express the confident assurance that the God of salvation will keep it, and fulfil it in the approaching attack on the part of the power of the world upon the nation which has been refined by the judgment.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The last words, למנצּח בּנגינותי, do not form part of the contents of the supplicatory ode, but are a subscription answering to the heading in Habakkuk 3:1, and refer to the use of the ode in the worship of God, and simply differ from the headings למנצּח בּנגינות in Psalm 4:1-8; Psalm 6:1-10; Psalm 54:1-55:23; Psalm 67:1-7, and Psalm 76:1-12, through the use of the suffix in בּנגינותי. Through the words, \"to the president (of the temple-music, or the conductor) in accompaniment of my stringed playing,\" the prophet appoints his psalm for use in the public worship of God accompanied by his stringed playing. Hitzig's rendering is grammatically false, \"to the conductor of my pieces of music;\" for ב cannot be used as a periphrasis for the genitive, but when connected with a musical expression, only means with or in the accompaniment of (ה instrumenti or concomitantiae). Moreover, נגינות does not mean pieces of music, but simply a song, and the playing upon stringed instruments, or the stringed instrument itself (see at Psalm 4:1-8). The first of these renderings gives no suitable sense here, so that there only remains the second, viz., \"playing upon stringed instruments.\" But if the prophet, by using this formula, stipulates that the ode is to be used in the temple, accompanied by stringed instruments, the expression bingı̄nōthai, with my stringed playing, affirms that he himself will accompany it with his own playing, from which it has been justly inferred that he was qualified, according to the arrangements of the Israelitish worship, to take part in the public performance of such pieces of music as were suited for public worship, and therefore belonged to the Levites who were entrusted with the conduct of the musical performance of the temple. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The last words, למנצּח בּנגינותי, do not form part of the contents of the supplicatory ode, but are a subscription answering to the heading in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 3:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and refer to the use of the ode in the worship of God, and simply differ from the headings למנצּח בּנגינות in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 4:1-8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 6:1-10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 54:1-55:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 67:1-7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 76:1-12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", through the use of the suffix in בּנגינותי. Through the words, \"to the president (of the temple-music, or the conductor) in accompaniment of my stringed playing,\" the prophet appoints his psalm for use in the public worship of God accompanied by his stringed playing. Hitzig's rendering is grammatically false, \"to the conductor of my pieces of music;\" for ב cannot be used as a periphrasis for the genitive, but when connected with a musical expression, only means with or in the accompaniment of (ה instrumenti or concomitantiae). Moreover, נגינות does not mean pieces of music, but simply a song, and the playing upon stringed instruments, or the stringed instrument itself (see at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 4:1-8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The first of these renderings gives no suitable sense here, so that there only remains the second, viz., \"playing upon stringed instruments.\" But if the prophet, by using this formula, stipulates that the ode is to be used in the temple, accompanied by stringed instruments, the expression bingı̄nōthai, with my stringed playing, affirms that he himself will accompany it with his own playing, from which it has been justly inferred that he was qualified, according to the arrangements of the Israelitish worship, to take part in the public performance of such pieces of music as were suited for public worship, and therefore belonged to the Levites who were entrusted with the conduct of the musical performance of the temple. ",
            "children": []
          }
        ]
      }
    ]
  }
]