[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(2) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Thy speech.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Better, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "thy report,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as in margin. The tone is that of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 44:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “We have heard with our ears O God! our fathers have told us . . . ” Jehovah’s doings at the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "beginning",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of the years are well known; the prophet seeks that they may be manifested again, now in the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "midst",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of the years. The petition “in wrath remember mercy,” is explained by ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Habakkuk 1:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "et seq.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " It implies—though Thy visitation be well deserved, yet mercifully limit its duration, as on former occasions.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Habakkuk 3:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 3:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "O Lord, I have heard thy speech and was afraid — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "I have heard what thou hast revealed to me concerning thy judgments to be executed, first upon thy own people, and afterward upon their enemies the Chaldeans, and the terribleness of them hath filled me with a reverential awe and dread. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "O Lord, revive, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "preserve alive, thy work in the midst of the years — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Habakkuk having understood, by divine revelation, that some time would intervene between the desolation of Judea and the punishment of the Chaldeans, here entreats God, that, during that interval, he would preserve or take care of his work; that is, his Israel, that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "work of his hands which he had formed for himself, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "that they might ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "show forth his praise: ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 43:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 45:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " :) together with the work of his grace in and among them; that he would keep that spark alive amidst the waters of tribulation and temptation through which they had to pass. Although all men are the work of God, yet the Jews might be called so more emphatically, because he had, by many extraordinary interpositions, raised them to be a peculiar people to himself, and had formed them such by laws given to them in a singular manner, not used with regard to any other people. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "In the midst of the years make known; in wrath remember mercy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " — Or, as Grotius interprets the clause, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "In that intervening time show, that although thou art angry, thou rememberest mercy. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "In the midst of these years of calamity let thy people experience, that even in thy indignation thou thinkest upon mercy, and dost not lay more upon them than thou enablest them to bear. The years here referred to seem plainly to be those in which the Jews were under the power of the Chaldeans, and Judea lay desolate. Mr. Green translates the verse, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "O Jehovah, I have heard thy report: ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(that is, what thou hast revealed concerning the captivity:) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I am in pain, O Jehovah, for thy work: ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(that is, the Jewish people:) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in the midst of the years revive it: ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(restore the Jews to their own land before the years appointed for their captivity are expired:) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in the midst of the years show compassion; in wrath remember mercy.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3:1,2 The word prayer seems used here for an act of devotion. The Lord would revive his work among the people in the midst of the years of adversity. This may be applied to every season when the church, or believers, suffer under afflictions and trials. Mercy is what we must flee to for refuge, and rely upon as our only plea. We must not say, Remember our merit, but, Lord, remember thy own mercy.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "O Lord, I have heard - i. e., with the inward ear of the heart, \"Thy speech,\" (rather as English margin, Thy report, i. e., the report of Thee)  i. e., what may he heard and known of God, or, what he had himself heard . The word contains in one both what God had lately declared to the prophet, the judgments of God upon the wicked of the people, and upon those who, with their own injustice, done upon them the righteous judgments of God, and that the work of the Lord would be performed in His time for those who in patience wait for it; and also still more largely, what might be heard of God, although, as it were, but a little whisper of His greatness and of the majesty of His workings.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And was afraid - not \"fearful\" but \"afraid in awe,\" as a creature, and amazed at the surpassing wonderfulness of the work of God. Well may man stand in awe  \"at the incarnation of the only-begotten Son, how earth should contain Him uncontained by space, how a body was prepared for Him of the virgin by the Holy Spirit, and all the works whereby He shall work the salvation of mankind, the cross, the death, resurrection and ascension, uniting things opposite, a body with one incorporeal, death with life, resurrection with death, a body in heaven. All is full of wonder and awe.\" Rup.: \"This is not a servile fear, but a holy fear which endureth forever, not one which 'love casteth out,' but which it bringeth in, wherein angels praise, dominions adore, powers stand in awe at the majesty of the Eternal God.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "O Lord, revive Thy work - God's Word seems, often, as it were, dead and \"come utterly to an end for evermore\" Psalm 77:8, while it is holding on its own course, as all nature seems dead for a while, but all is laid up in store, and ready to shoot forth, as by a sort of resurrection Rup.: \"The prophet prophesying prayeth, that it should come quickly, and praying prophesieth that it shall so come.\" All God's dealings with His people, His Church, each single soul, are part of one great work, perfect in itself Deuteronomy 32:4; glory and majesty Psalm 140:3; all which the godly meditateth on Psalm 77:3; Psalm 143:5; which those busied with their own plans, do not look to Isaiah 5:12; it is manifested in great doings for them or with them, as in the Exodus the Psalmist says, \"We have heard with our ears, yea, our fathers have told us what work Thou didst in their days, in the times of old\" Psalm 44:2; \"They proved Me and saw My work\" Psalm 95:9; with it He makes His own glad Psalm 92:3; after it has been withdrawn for a while, \"He sheweth it to His servants\" Psalm 90:6; it issues in judgments on the ungodly, which people consider and declare .",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "O Lord, revive Thy work - God's Word seems, often, as it were, dead and \"come utterly to an end for evermore\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 77:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", while it is holding on its own course, as all nature seems dead for a while, but all is laid up in store, and ready to shoot forth, as by a sort of resurrection Rup.: \"The prophet prophesying prayeth, that it should come quickly, and praying prophesieth that it shall so come.\" All God's dealings with His people, His Church, each single soul, are part of one great work, perfect in itself ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 32:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; glory and majesty ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 140:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; all which the godly meditateth on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 77:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 143:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; which those busied with their own plans, do not look to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 5:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; it is manifested in great doings for them or with them, as in the Exodus the Psalmist says, \"We have heard with our ears, yea, our fathers have told us what work Thou didst in their days, in the times of old\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 44:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; \"They proved Me and saw My work\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 95:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; with it He makes His own glad ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 92:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; after it has been withdrawn for a while, \"He sheweth it to His servants\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 90:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; it issues in judgments on the ungodly, which people consider and declare .",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The great work of God on earth, which includes all His works and is the end of all, is the salvation of man through Jesus Christ. This great work seemed, as it were, asleep, or dead, as trees in winter, all through those 4,000 years, which gave no token of His coming. Included in this great work is the special work of the Hand of God, of which alone it is said, \"God said, Let Us make man in Our image after Our Likeness\" Genesis 1:26; and, \"we are the clay and Thou our Potter, and we are all the work of Thy Hands\" Isaiah 64:8; and \"Thy Hands have made me and fashioned me together round about\" Job 10:8, man; whom, being dead as to the life of the soul through the malice of Satan, Christ revived by dying and rising again. He was \"dead in trespasses and sins,\" and like a carcass putrefying in them, and this whole world one great charnel-house, through man's manifold corruptions, when Christ came to awaken the dead, and they who heard lived John 5:25.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The great work of God on earth, which includes all His works and is the end of all, is the salvation of man through Jesus Christ. This great work seemed, as it were, asleep, or dead, as trees in winter, all through those 4,000 years, which gave no token of His coming. Included in this great work is the special work of the Hand of God, of which alone it is said, \"God said, Let Us make man in Our image after Our Likeness\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 1:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and, \"we are the clay and Thou our Potter, and we are all the work of Thy Hands\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 64:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and \"Thy Hands have made me and fashioned me together round about\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 10:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", man; whom, being dead as to the life of the soul through the malice of Satan, Christ revived by dying and rising again. He was \"dead in trespasses and sins,\" and like a carcass putrefying in them, and this whole world one great charnel-house, through man's manifold corruptions, when Christ came to awaken the dead, and they who heard lived ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 5:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Again, the Center of this work, the special Work of God, that wherein He made all things new, is the Human Body of our Lord, the Temple which was destroyed by death, and within three days was raised up.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The answer to Habakkuk's enquiry, \"How long?\" had two sides: It had given assurance as to the end. The trial-time would not be prolonged for one moment longer than the counsel of God had fore-determined. The relief would \"come, come; it would not be behind-hand.\" But meantime? There was no comfort to be given. For God knew that deepening sin was drawing on deepening chastisement. But in that He was silent as to the intervening time and pointed to patient expectation of a lingering future, as their only comfort, He implies that the immediate future was heavy. Habakkuk then renews his prayer for the years which had to intervene and to pass away. \"In the midst of the years,\" before that \"time appointed\" , when His promise should have its full fulfillment, before those years should come to their close, he prays; \"revive Thy work.\" The years include all the long period of waiting for our Lord's first coming before He came in the Flesh; and now for His second coming and the \"restitution of all things.\" in this long period, at times God seems to be absent, as when our Lord was asleep in the boat, while the tempest was raging; at times He bids \"the storm to cease and there is a great calm.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This, in those long intervals, when God seems to be absent, and to leave all things to time and chance, and love waxes cold, and graces seem rare, is the prayer of Habakkuk, of prophets and Psalmists, of the Church Psalm 80:14, \"Return, we beseech Thee, O God of hosts, look down from heaven, behold and visit this vine Psalm 74:1, Psalm 74:11-12. O God, why hast Thou cast us off forever? Why withdrawest Thou Thy hand, Thy right hand? For God is my king of old, working salvation in the midst of the earth. Isaiah 51:9-10 awake, awake, put on strength, Thou Arm of the Lord; awake, as in the ancient days, in the generations of old. Art thou not It which did smite Rahab, didst wound the dragon? Art thou not It which didst dry the sea, the waters of the great deep, which didst make the depths of the sea a way for the ransomed to pass over? Psalm 80:3. Stir up Thy might and come, save us Lamentations 5:21. Renew our days, as of old.\" So our Lord taught His Church to pray continually, whenever she prayed, \"Thy kingdom come,\" longing not for His final coming only, but for the increase of His glory, and the greater dominion of His grace, and His enthronement in the hearts of people, even before its complete and final coming. \"In the midst of the years revive Thy work,\" is the Church's continual cry.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "This, in those long intervals, when God seems to be absent, and to leave all things to time and chance, and love waxes cold, and graces seem rare, is the prayer of Habakkuk, of prophets and Psalmists, of the Church ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 80:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"Return, we beseech Thee, O God of hosts, look down from heaven, behold and visit this vine ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 74:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 74:11-12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". O God, why hast Thou cast us off forever? Why withdrawest Thou Thy hand, Thy right hand? For God is my king of old, working salvation in the midst of the earth. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 51:9-10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " awake, awake, put on strength, Thou Arm of the Lord; awake, as in the ancient days, in the generations of old. Art thou not It which did smite Rahab, didst wound the dragon? Art thou not It which didst dry the sea, the waters of the great deep, which didst make the depths of the sea a way for the ransomed to pass over? ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 80:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Stir up Thy might and come, save us ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Lamentations 5:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Renew our days, as of old.\" So our Lord taught His Church to pray continually, whenever she prayed, \"Thy kingdom come,\" longing not for His final coming only, but for the increase of His glory, and the greater dominion of His grace, and His enthronement in the hearts of people, even before its complete and final coming. \"In the midst of the years revive Thy work,\" is the Church's continual cry.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "In the midst of the years make known - literally, \"Thou wilt make known: in wrath Thou wilt remember mercy;\" and so (as we use the word \"wilt\") the prophet, at once, foretelleth, expresseth his faith, prayeth. God had made known His work and His power in the days of old. In times of trouble He seems \"like a God who hideth Himself.\" Now, he prays Him to shine forth and help; make known Thy work, before Thou fulfill it, to revive the drooping hopes of man, and that all may see that \"Thy word is truth.\" Make Thyself known in Thy work, that, when the time cometh to Daniel 9:24 \"make an end of sin\" by the Death of Thy Son, Thy Awful Holiness, and the love wherewith Thou hast John 3:16 \"so loved the world,\" may be the more known and adored.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In the midst of the years make known - literally, \"Thou wilt make known: in wrath Thou wilt remember mercy;\" and so (as we use the word \"wilt\") the prophet, at once, foretelleth, expresseth his faith, prayeth. God had made known His work and His power in the days of old. In times of trouble He seems \"like a God who hideth Himself.\" Now, he prays Him to shine forth and help; make known Thy work, before Thou fulfill it, to revive the drooping hopes of man, and that all may see that \"Thy word is truth.\" Make Thyself known in Thy work, that, when the time cometh to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 9:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " \"make an end of sin\" by the Death of Thy Son, Thy Awful Holiness, and the love wherewith Thou hast ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 3:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " \"so loved the world,\" may be the more known and adored.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "In wrath Thou wilt remember mercy - So David prayed Psalm 25:6, \"Remember Thy tender-mercies and Thy loving-kindnesses; for they are from old.\" \"Thou wilt remember\" that counsel for man's redemption which has been from the foundation of the world: for we seem in our own minds to be forgotten of God, when He delayeth to help us. God remembereth mercy Luke 1:54, Luke 1:72 in anger, in that in this life He never chastens without purposes of mercy, and His Mercy ever softeneth His judgments. His Promise of mercy, that the Seed of the woman shall bruise the serpent's head, went before the sentence of displeasure Genesis 3:19, \"Dust thou art, and unto dust shalt thou return.\" Jerome: \"He reveals His wrath that He may scare us from sin and so may not inflict it;\" and when at last He inflicteth it, He hath mercy on the remnant who flee to His Mercy, that we be not like Sodom and Gomorrah. Romans 5:8, \"while we were yet sinners,\" and God was angry, \"Christ died for us,\" and, Titus 3:5, \"He saved us, not for works which we had done, but out of His great Mercy,\" and took away sin, and restored us to life and interruption.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In wrath Thou wilt remember mercy - So David prayed ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 25:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"Remember Thy tender-mercies and Thy loving-kindnesses; for they are from old.\" \"Thou wilt remember\" that counsel for man's redemption which has been from the foundation of the world: for we seem in our own minds to be forgotten of God, when He delayeth to help us. God remembereth mercy ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 1:54",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 1:72",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " in anger, in that in this life He never chastens without purposes of mercy, and His Mercy ever softeneth His judgments. His Promise of mercy, that the Seed of the woman shall bruise the serpent's head, went before the sentence of displeasure ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 3:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"Dust thou art, and unto dust shalt thou return.\" Jerome: \"He reveals His wrath that He may scare us from sin and so may not inflict it;\" and when at last He inflicteth it, He hath mercy on the remnant who flee to His Mercy, that we be not like Sodom and Gomorrah. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 5:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"while we were yet sinners,\" and God was angry, \"Christ died for us,\" and, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Titus 3:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"He saved us, not for works which we had done, but out of His great Mercy,\" and took away sin, and restored us to life and interruption.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "God had already promised by Micah M1 Corinthians 7:15, \"According to the days of thy coming out of the land of Egypt, I will show him marvelous things.\" Isaiah had often used the great events of that deliverance as the symbols of the future. So now Habakkuk, in one vast panorama, as it were, without distinction of time or series of events, exhibits the future in pictures of the past. In the description itself which follows, he now speaks in the past, now in the future; of which times the future might be a vivid present; and the past a prophetic past. As a key to the whole, he says, \"God shall come,\" indicating that all which follows, however spoken, was a part of that future. In no other way was it an answer to that prayer, \"Revive Thy work.\" To foretell future deliverances in plain words, had been a comfort; it would have promised a continuance of that work. The unity and revival of the work is expressed, in that the past is made, as it was, the image of the future. That future was to be wondrous, superhuman; elsewhere the past miracles had been no image of it. It was to be no mere repetition of the future; and to mark this, the images are exhibited out of their historical order. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "God had already promised by Micah M",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 7:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"According to the days of thy coming out of the land of Egypt, I will show him marvelous things.\" Isaiah had often used the great events of that deliverance as the symbols of the future. So now Habakkuk, in one vast panorama, as it were, without distinction of time or series of events, exhibits the future in pictures of the past. In the description itself which follows, he now speaks in the past, now in the future; of which times the future might be a vivid present; and the past a prophetic past. As a key to the whole, he says, \"God shall come,\" indicating that all which follows, however spoken, was a part of that future. In no other way was it an answer to that prayer, \"Revive Thy work.\" To foretell future deliverances in plain words, had been a comfort; it would have promised a continuance of that work. The unity and revival of the work is expressed, in that the past is made, as it was, the image of the future. That future was to be wondrous, superhuman; elsewhere the past miracles had been no image of it. It was to be no mere repetition of the future; and to mark this, the images are exhibited out of their historical order. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2. I have heard thy speech—Thy revelation to me concerning the coming chastisement of the Jews [Calvin], and the destruction of their oppressors. This is Habakkuk's reply to God's communication [Grotius]. Maurer translates, \"the report of Thy coming,\" literally, \"Thy report.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and was afraid—reverential fear of God's judgments (Hab 3:16).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "revive thy work—Perfect the work of delivering Thy people, and do not let Thy promise lie as if it were dead, but give it new life by performing it [Menochius]. Calvin explains \"thy work\" to be Israel; called \"the work of My hands\" (Isa 45:11). God's elect people are peculiarly His work (Isa 43:1), pre-eminently illustrating His power, wisdom, and goodness. \"Though we seem, as it were, dead nationally, revive us\" (Ps 85:6). However (Ps 64:9), where \"the work of God\" refers to His judgment on their enemies, favors the former view (Ps 90:16, 17; Isa 51:9, 10).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "in the midst of the years—namely, of calamity in which we live. Now that our calamities are at their height; during our seventy years' captivity. Calvin more fancifully explains it, in the midst of the years of Thy people, extending from Abraham to Messiah; if they be cut off before His coming, they will be cut off as it were in the midst of their years, before attaining their maturity. So Bengel makes the midst of the years to be the middle point of the years of the world. There is a strikingly similar phrase (Da 9:27), In the midst of the week. The parallel clause, \"in wrath\" (that is, in the midst of wrath), however, shows that \"in the midst of the years\" means \"in the years of our present exile and calamity.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "make known—Made it (Thy work) known by experimental proof; show in very deed, that this is Thy work.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I have heard; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " received answer to the inquiry made ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Habakkuk 1:13-17",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 1:13-17",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", whether by voice from heaven, or by inward illumination or irradiation of the mind, or any other way of impression from the prophetic Spirit, needs not be inquired. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Thy speech; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the report or declaration God made to him concerning the future corrections of his own people, and the devastations Babylon would make among them; and next, the destruction which should fall upon the Babylonians by the Medes and Persians, which is summarily set down, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Habakkuk 2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Was afraid; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " trembled at the apprehension of these sad things, which both we and they were to suffer; he saw them as certain and grievous. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Revive; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " not only keep alive, but somewhat refresh, renew, give some new strength to thy church and people, who wait for thee. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Thy work; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " thy church, called, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 45:11",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 45:11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", as here, God’s work, in an eminent manner, above other people; so the apostle, we are his workmanship, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ephesians 2:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ephesians 2:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ": or else by work may be meant, the returning of the captivity, and restoring them to their own land, which was the great thing God did promise to do for them; and the prophet prays for some kindness from the Lord, that may be a revival of the hope, assurance, and joy of it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "In the midst of the years:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it is not needful we report the different account of these years, and the precise midst of them assigned by some; perhaps it may point to that time when Evil-merodach exalted Jehoiachin out of prison, which, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "2 Kings 25:27",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 25:27",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", was in the 37th year of their captivity; but I rather think it is more vulgarly to be taken for any time within the term of the sad and troublesome days which would last seventy years. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Make known:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it is an affectionate request, and (as such often are) somewhat abrupt; make known either thy truth, or wisdom, or power, or compassion, or all; make it known that thou art our God, and we thy people, that thou still hast a care of us: or what next follows makes the sense full. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "In wrath, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " whilst thy just displeasure burns against us for our sins, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "remember mercy; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " make it appear thou hast not forgotten to be gracious, let thy people see thou rememberest mercy towards them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I have heard; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " received answer to the inquiry made ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Habakkuk 1:13-17",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 1:13-17",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", whether by voice from heaven, or by inward illumination or irradiation of the mind, or any other way of impression from the prophetic Spirit, needs not be inquired. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Thy speech; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the report or declaration God made to him concerning the future corrections of his own people, and the devastations Babylon would make among them; and next, the destruction which should fall upon the Babylonians by the Medes and Persians, which is summarily set down, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Habakkuk 2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Was afraid; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " trembled at the apprehension of these sad things, which both we and they were to suffer; he saw them as certain and grievous. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Revive; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " not only keep alive, but somewhat refresh, renew, give some new strength to thy church and people, who wait for thee. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Thy work; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " thy church, called, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 45:11",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 45:11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", as here, God’s work, in an eminent manner, above other people; so the apostle, we are his workmanship, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ephesians 2:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ephesians 2:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ": or else by work may be meant, the returning of the captivity, and restoring them to their own land, which was the great thing God did promise to do for them; and the prophet prays for some kindness from the Lord, that may be a revival of the hope, assurance, and joy of it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "In the midst of the years:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it is not needful we report the different account of these years, and the precise midst of them assigned by some; perhaps it may point to that time when Evil-merodach exalted Jehoiachin out of prison, which, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "2 Kings 25:27",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 25:27",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", was in the 37th year of their captivity; but I rather think it is more vulgarly to be taken for any time within the term of the sad and troublesome days which would last seventy years. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Make known:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it is an affectionate request, and (as such often are) somewhat abrupt; make known either thy truth, or wisdom, or power, or compassion, or all; make it known that thou art our God, and we thy people, that thou still hast a care of us: or what next follows makes the sense full. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "In wrath, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " whilst thy just displeasure burns against us for our sins, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "remember mercy; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " make it appear thou hast not forgotten to be gracious, let thy people see thou rememberest mercy towards them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I have heard; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " received answer to the inquiry made ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Habakkuk 1:13-17",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 1:13-17",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", whether by voice from heaven, or by inward illumination or irradiation of the mind, or any other way of impression from the prophetic Spirit, needs not be inquired. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Thy speech; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the report or declaration God made to him concerning the future corrections of his own people, and the devastations Babylon would make among them; and next, the destruction which should fall upon the Babylonians by the Medes and Persians, which is summarily set down, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Habakkuk 2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Was afraid; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " trembled at the apprehension of these sad things, which both we and they were to suffer; he saw them as certain and grievous. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Revive; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " not only keep alive, but somewhat refresh, renew, give some new strength to thy church and people, who wait for thee. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Thy work; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " thy church, called, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 45:11",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 45:11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", as here, God’s work, in an eminent manner, above other people; so the apostle, we are his workmanship, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ephesians 2:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ephesians 2:10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ": or else by work may be meant, the returning of the captivity, and restoring them to their own land, which was the great thing God did promise to do for them; and the prophet prays for some kindness from the Lord, that may be a revival of the hope, assurance, and joy of it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "In the midst of the years:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it is not needful we report the different account of these years, and the precise midst of them assigned by some; perhaps it may point to that time when Evil-merodach exalted Jehoiachin out of prison, which, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "2 Kings 25:27",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 25:27",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", was in the 37th year of their captivity; but I rather think it is more vulgarly to be taken for any time within the term of the sad and troublesome days which would last seventy years. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Make known:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it is an affectionate request, and (as such often are) somewhat abrupt; make known either thy truth, or wisdom, or power, or compassion, or all; make it known that thou art our God, and we thy people, that thou still hast a care of us: or what next follows makes the sense full. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "In wrath, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " whilst thy just displeasure burns against us for our sins, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "remember mercy; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " make it appear thou hast not forgotten to be gracious, let thy people see thou rememberest mercy towards them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "O Lord, I have heard thy speech, and was afraid,.... Or, \"thy hearing\" (p); which the Lord had caused to be heard from and of himself; the report that had been made to him, and other prophets before him, particularly Isaiah, who says, \"who hath believed our report?\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 53:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " where the same phrase is used as here: though it seems here not so much to regard the evangelical part of that report, concerning the coming of Christ, his sufferings and death, in order obtain redemption and salvation for his people; for this would have been, and was, matter of joy, and not of fear and consternation: but the truth is this, the Lord in the preceding speech, being a report he made to the prophet concerning the Messiah, had signified that Christ would have many enemies from the Jews and from the Gentiles, from Rome Pagan and Rome Papal; that the church of Christ would meet with great afflictions and persecutions, and be attended with many conflicts, temptations, and difficulties; that the interest of the Redeemer would be sometimes very low, and the work of the Lord at a stand in the world, yea, seemingly dead, quite lost and gone; this is what caused the fear and distress in the prophet's mind, and gave him that pain and uneasiness: and hence the following petition, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "O Lord, revive thy work in the midst of the years; which refers not to the deliverance from the Babylonish captivity, which was fixed to a term of years, when, and not before, not in the midst of them it would be wrought; but to the great work of the Lord in the times of the Gospel. There is a double reading of these words in the Septuagint version of them, and both very different from the Hebrew text. The one is, \"in the midst of two lives thou shalt be known\"; the life that now is, and that which is to come. The other, by a change of the accent, is, \"in the midst of two animals thou shall be known\"; so the Arabic version. Theodoret makes mention of both, and inclines to the former; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"some (he says) by two animals understand angels and men; some the incorporeal powers near the divine Glory, the cherubim and seraphim; others the Jews and Babylonians; but to me it seems that the prophet does not say animals, but lives, the present and future, in the midst of which he was a just Judge:'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "but the latter reading is followed by many of the ancients, whose different senses are given by Jerom on the place; some interpreting them of the Son and Spirit, by whom the Father is made known; others of the two cherubim in Exodus, and of the two seraphim in Isaiah; and there were some who understood them of the two Testaments, the Old and New, in the midst of which the Lord may be known; and others of Christ's being crucified between two thieves, by which be might be known: but, besides these different sentiments, many of the ancients concluded from hence that Christ lay in the manger between two animals, the ox and the ass, and to which they refer in their ancient hymns (q); but though this is a wrong version of the text, and a wrong sense which is put upon it, together with Isaiah 1:3; yet, as Burkius observes, there is in this mistake a certain and ancient truth, that the text of Habakkuk belongs to the work of God in Christ, and especially to the nativity of our Lord Jesus; and so some later writers apply this to the wonderful work of the incarnation of Christ, that new, unheard of, and amazing thing the Lord would work in the earth; the promise of which, being delayed, might seem to be dead; and therefore it is entreated it might be revived, and the performance of it hastened; and others to the work of redemption by Christ, which the Father gave him to do, and he promised to come and perform; but, being deferred, the Old Testament saints were impatient of it. Cocceius and Van Till restrain it to the resurrection of Christ from the dead, his coming being prophesied of before; and render the words, \"O Lord, thy work is his life (r), in the midst of the years\"; the resurrection of Christ from the dead, or the quickening of him, is prophesied of in many places as a work that would be done, and in which the hope and expectation of the saints were placed; this being a work of great importance both to Christ, his exaltation and glory, and to his people; their quickening together with him; their regeneration, or passing from death to life; their justification of life, and resurrection from the dead, depending upon it; and this is the Lord's work, and owing to the exceeding greatness of his power, and is frequently ascribed to God the Father, who raised Christ from the dead, and gave him glory: and this was \"in the midst of the years\", or between the years of the Old and of the New Testament; the former was the year of God's longsuffering and forbearance, the time when the Jewish church, like children, were under governors and tutors, until the time appointed of the Father; the latter is the acceptable year of the Lord, and the year of the redeemed; and between these two years, at the end of the one, and the beginning of the other, the Messiah came, was cut off or died, and was quickened and raised again: but I should choose rather to understand this more generally of the work of the Lord in the Christian churches throughout the whole Gospel dispensation, or at least in some certain periods of it. The church itself is the work of the hands of the Lord, Isaiah 45:11 which sometimes has seemed to have been in a very dead and lifeless state and condition, as in the dark times of Popery; and though there was a reviving of it upon the Reformation, yet there has been a decline since; and the Sardian church state, in which we now are, is described as having a \"name\", that it \"lives\", and yet is \"dead\"; and the interest of religion, and the church of Christ, will be lower still when the witnesses are slain, and their dead bodies lie unburied, before the Spirit of the Lord enters into them, and revives them: now the prophet having in view these various intervals, and especially the last, prays for a reviving of the interest and church of Christ, and the work of the Lord in it; and which will be done when Christ will come in a spiritual manner, and destroy antichrist; when the Spirit will be poured down plentifully from on high; when the Gospel will be purely and powerfully preached all over the world; when the ordinances of it will be administered as at the beginning; when multitudes of churches will be raised and formed, the Jews will be converted, and the fulness of the Gentiles brought in: this will be a reviving time indeed! and there never will be a thorough one till this time comes; and this will be in \"the midst of the years\"; between the years of the reign of antichrist, the 1260 days or years of it, which will now expire, and the thousand years of Christ's personal reign on earth; between these two will be this reviving time or spiritual reign of Christ (s). The words may to good purpose be applied to the work of grace in the hearts of true believers in Christ, which is the Lord's work, and his only; not men, not ministers, not angels, but Jehovah only is the author and finisher of it. This sometimes seems as it were to be dead, when the graces of the Spirit are not in exercise; when saints are in dead and lifeless frames of soul; when they are backward to spiritual and religious exercises; when the world, and the things of it, have got power over them, and they are unconcerned for the things of Christ, the honour of his name, and the good of their own souls; when they are under the power of some sin, and are carried captive by it, as was the case of David, Peter, and others: now this work is revived, when the graces of the Spirit are called forth again into lively exercise; when the affections go out strongly after divine objects and things; when the thoughts of the mind, and the meditations of the heart, are on spiritual subjects; when the talk and conversation turns chiefly on things of a religious and heavenly nature; when there is a forwardness to spiritual exercises, a stirring up of themselves and others to them, and a continuance in them; when there is a visible growing in grace, and a fruitfulness in every good work: this is to be prayed for, and is from the Lord; and is owing to his setting his hand a second time to the work; to his being as the dew to his people; to Christ the sun of righteousness arising on them, with healing in his wings; and to the south wind of the Spirit blowing upon them, and causing their spices to flow out; and this is desirable in the midst of their years, before the years come on in which they have no pleasure, or before they go hence, and be no more: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "but the latter reading is followed by many of the ancients, whose different senses are given by Jerom on the place; some interpreting them of the Son and Spirit, by whom the Father is made known; others of the two cherubim in Exodus, and of the two seraphim in Isaiah; and there were some who understood them of the two Testaments, the Old and New, in the midst of which the Lord may be known; and others of Christ's being crucified between two thieves, by which be might be known: but, besides these different sentiments, many of the ancients concluded from hence that Christ lay in the manger between two animals, the ox and the ass, and to which they refer in their ancient hymns (q); but though this is a wrong version of the text, and a wrong sense which is put upon it, together with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 1:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; yet, as Burkius observes, there is in this mistake a certain and ancient truth, that the text of Habakkuk belongs to the work of God in Christ, and especially to the nativity of our Lord Jesus; and so some later writers apply this to the wonderful work of the incarnation of Christ, that new, unheard of, and amazing thing the Lord would work in the earth; the promise of which, being delayed, might seem to be dead; and therefore it is entreated it might be revived, and the performance of it hastened; and others to the work of redemption by Christ, which the Father gave him to do, and he promised to come and perform; but, being deferred, the Old Testament saints were impatient of it. Cocceius and Van Till restrain it to the resurrection of Christ from the dead, his coming being prophesied of before; and render the words, \"O Lord, thy work is his life (r), in the midst of the years\"; the resurrection of Christ from the dead, or the quickening of him, is prophesied of in many places as a work that would be done, and in which the hope and expectation of the saints were placed; this being a work of great importance both to Christ, his exaltation and glory, and to his people; their quickening together with him; their regeneration, or passing from death to life; their justification of life, and resurrection from the dead, depending upon it; and this is the Lord's work, and owing to the exceeding greatness of his power, and is frequently ascribed to God the Father, who raised Christ from the dead, and gave him glory: and this was \"in the midst of the years\", or between the years of the Old and of the New Testament; the former was the year of God's longsuffering and forbearance, the time when the Jewish church, like children, were under governors and tutors, until the time appointed of the Father; the latter is the acceptable year of the Lord, and the year of the redeemed; and between these two years, at the end of the one, and the beginning of the other, the Messiah came, was cut off or died, and was quickened and raised again: but I should choose rather to understand this more generally of the work of the Lord in the Christian churches throughout the whole Gospel dispensation, or at least in some certain periods of it. The church itself is the work of the hands of the Lord, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 45:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " which sometimes has seemed to have been in a very dead and lifeless state and condition, as in the dark times of Popery; and though there was a reviving of it upon the Reformation, yet there has been a decline since; and the Sardian church state, in which we now are, is described as having a \"name\", that it \"lives\", and yet is \"dead\"; and the interest of religion, and the church of Christ, will be lower still when the witnesses are slain, and their dead bodies lie unburied, before the Spirit of the Lord enters into them, and revives them: now the prophet having in view these various intervals, and especially the last, prays for a reviving of the interest and church of Christ, and the work of the Lord in it; and which will be done when Christ will come in a spiritual manner, and destroy antichrist; when the Spirit will be poured down plentifully from on high; when the Gospel will be purely and powerfully preached all over the world; when the ordinances of it will be administered as at the beginning; when multitudes of churches will be raised and formed, the Jews will be converted, and the fulness of the Gentiles brought in: this will be a reviving time indeed! and there never will be a thorough one till this time comes; and this will be in \"the midst of the years\"; between the years of the reign of antichrist, the 1260 days or years of it, which will now expire, and the thousand years of Christ's personal reign on earth; between these two will be this reviving time or spiritual reign of Christ (s). The words may to good purpose be applied to the work of grace in the hearts of true believers in Christ, which is the Lord's work, and his only; not men, not ministers, not angels, but Jehovah only is the author and finisher of it. This sometimes seems as it were to be dead, when the graces of the Spirit are not in exercise; when saints are in dead and lifeless frames of soul; when they are backward to spiritual and religious exercises; when the world, and the things of it, have got power over them, and they are unconcerned for the things of Christ, the honour of his name, and the good of their own souls; when they are under the power of some sin, and are carried captive by it, as was the case of David, Peter, and others: now this work is revived, when the graces of the Spirit are called forth again into lively exercise; when the affections go out strongly after divine objects and things; when the thoughts of the mind, and the meditations of the heart, are on spiritual subjects; when the talk and conversation turns chiefly on things of a religious and heavenly nature; when there is a forwardness to spiritual exercises, a stirring up of themselves and others to them, and a continuance in them; when there is a visible growing in grace, and a fruitfulness in every good work: this is to be prayed for, and is from the Lord; and is owing to his setting his hand a second time to the work; to his being as the dew to his people; to Christ the sun of righteousness arising on them, with healing in his wings; and to the south wind of the Spirit blowing upon them, and causing their spices to flow out; and this is desirable in the midst of their years, before the years come on in which they have no pleasure, or before they go hence, and be no more: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "in the midst of the years make known; which Cocceius and Van Till restrain to the notification of Christ's resurrection from the dead by the ministry of the Gospel, for the benefit of the Lord's people, both Jews and Gentiles; as being a matter of great consequence to them, and for the confirmation of the Christian religion, as it undoubtedly was: but it seems better to understand it in a more general sense, that God would make known more of himself, as the covenant God and Father of his people, of his mind and will, of his love, grace, and mercy in Christ; that he would make known more of Christ, of his person, offices, and grace; that he would make known more clearly the work of his Spirit and grace upon their hearts, and display his power, and the efficacy of his grace, in reviving it, and carrying it on; that he would make known more largely his covenant and promises, his truth and faithfulness in the performance of them; that he would grant a larger measure of knowledge of all divine things of the Gospel, and the truths of it; such as is promised, and is expected will be in the latter day, when the earth shall be everywhere filled with the knowledge of the Lord, Habakkuk 2:14, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "in the midst of the years make known; which Cocceius and Van Till restrain to the notification of Christ's resurrection from the dead by the ministry of the Gospel, for the benefit of the Lord's people, both Jews and Gentiles; as being a matter of great consequence to them, and for the confirmation of the Christian religion, as it undoubtedly was: but it seems better to understand it in a more general sense, that God would make known more of himself, as the covenant God and Father of his people, of his mind and will, of his love, grace, and mercy in Christ; that he would make known more of Christ, of his person, offices, and grace; that he would make known more clearly the work of his Spirit and grace upon their hearts, and display his power, and the efficacy of his grace, in reviving it, and carrying it on; that he would make known more largely his covenant and promises, his truth and faithfulness in the performance of them; that he would grant a larger measure of knowledge of all divine things of the Gospel, and the truths of it; such as is promised, and is expected will be in the latter day, when the earth shall be everywhere filled with the knowledge of the Lord, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 2:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "in wrath remember mercy; the above interpreters refer this to the time of God's wrath and vengeance upon the Jewish nation for their rejection of the Messiah; and which the prophet does not pray might be averted, but that mercy might be remembered to his own people among them, as was; who had the Gospel first preached to them, and were called by grace and saved; and who had an opportunity given them of escaping from Jerusalem, before the destruction of that city: but it may be more agreeable to interpret this of the state of the churches of Christ and true believers; who, when under affliction and distress, or in temptation and desertion, are ready to conclude that God is dealing with them in wrath; and whom the prophet personates, and by him they are taught to pray, that at such seasons God would remember his covenant, his promises, his lovingkindness and tender mercies, the favour he bears to his own people, and smile on them again, and comfort their souls. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(p) \"tuam auditionem\", V. L. Burkius; \"tuum auditum\", Pagninus, Montanus; \"rumorem\", Tarnovius. (q) \"Agnoscat bos et asinus Jacentem in praesepio.\" And again, \"Cognovit bos et asinus, Quod paer erat Dominus.\" (r) Taking for  as for in ver. 10. So Ben Melech observes it may be taken. (s) The Targum interprets these years of the time in which God will renew the world. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(p) \"tuam auditionem\", V. L. Burkius; \"tuum auditum\", Pagninus, Montanus; \"rumorem\", Tarnovius. (q) \"Agnoscat bos et asinus Jacentem in praesepio.\" And again, \"Cognovit bos et asinus, Quod paer erat Dominus.\" (r) Taking for  as for in ver. 10. So Ben Melech observes it may be taken. (s) The Targum interprets these years of the time in which God will renew the world. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "{b} O LORD, I have heard thy speech, and was afraid: O LORD, revive thy {c} work in the midst of the years, in the midst of the years make known; in wrath remember mercy.",
        "children": [
          {
            "element": "span",
            "class": "cverse3",
            "text": "{b}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " O LORD, I have heard thy speech, ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "and",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " was afraid: O LORD, revive thy ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{c}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " work in the midst of the years, in the midst of the years make known; in wrath remember mercy.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) Thus the people were afraid when they heard God's threatenings, and prayed.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) That is, the state of your Church which is now ready to perish, before it comes to half a perfect age, which would be under Christ.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I have heard thy speech",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I have heard the report of thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The term appears always to express the report or bruit about one, e.g. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 29:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the news about Jacob, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 10:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " about Solomon, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 23:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " about Tyre (her downfall); comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 14:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 66:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nahum 3:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It seems also always to refer to something past and actual (unless ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 7:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " be an exception); and this suggests that the allusion is to the divine manifestation at the Exodus.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "was afraid",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "am afraid",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Of course the prophet or the community in whose name he speaks (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Habakkuk 3:14",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 3:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ") did not fear hurt from the Theophany so long past, but the recital or the thought of it created alarm. Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 14:30-31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "revive thy work",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Though filled with fear at the thought of the divine interposition the prophet nevertheless prays for it. The term “revive” might mean to recall or bring back to life that which is dead (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 6:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), or to call into life and being what does not yet exist (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 2:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The “work” of Jehovah is that which He does, any operation which He performs, ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Habakkuk 1:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; but the word is often used of His great historical acts done for His people, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 44:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 95:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 11:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jdg 2:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The sense is thus either: bring into being a great act of Thine; or, renew, recall into life again, Thy former great work of redemption. The second sense is the more natural, and most in harmony with the following phrase “in the midst of the years.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in the midst of the years",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] This cannot mean “within a few years” (Gesen.), a sense ill-suited to the tone of importunity in the passage; nor “amidst the years of distress,” because the idea of distress must have been expressed. The expression must describe the poet’s own time, for his prayer is for immediate divine interposition. Looking back to the far past event of the Exodus, the many years that have rolled by since then, he conceives of the position of himself and his people as amidst the years.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "midst of the years make known",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] i.e. at this late time in our history make thy work known. Sept. regarded the verbal form as reflexive: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "make thyself",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (ox, let thyself be) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "known",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". So Wellh.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "In wrath remember mercy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The “wrath” might be that lying on the people now; but it is more natural to understand it of the wrath which the judge will manifest when He intervenes among men. Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 26:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", “Come, O my people, enter into thy chambers, hide thyself for a little moment until the indignation be overpast.” At the thought or the recital of God’s interposition in the past—type of every interposition of His—the poet trembled; yet he would encounter it for the sake of that which will come after it, and he prays that it may come again; then he prays that in that day of universal wrath he and his people may have mercy shewn them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 3:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 2.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - § 2. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "The proemium, in which the prophet expresses his fear at the coming judgment, and prays God in his wrath to",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " remember mercy. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Thy speech;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "the report of thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; the declaration made by God in the preceding chapters concerning the punishment of the Jews and the destruction of the Chaldeans. The LXX., regarding the ambiguity of the Hebrew, gives a double rendering, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "εἰσακήκοα τὴν ἀκοήν σου",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "κατενόησα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "τὰ ἕργα σου",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"I heard thy report,\" and \"I considered thy works.\" Pusey considers that both meanings are intended, viz. both what God had lately declared, and all that might be heard of God, his greatness and his workings. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Was afraid.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The revelation of God's interposition makes the prophet tremble. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Revive thy work.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " God's work is the twofold judgment spoken of above; and the prophet prays God to \"quicken\" and make it live, because, though it brings temporary distress upon his countrymen, it will also cause the destruction of their enemies, and re-establish the Jews and crown them with salvation, and make the glory of God known to all the earth. Dr. Briggs ('Messianic Prophecy,' p. 234) translates, \"Jahveh, I have heard the report of thee; I fear, Jahveh, thy work. In the midst of the years revive him (Israel).\" He explains God's \"work\" to be his acts in theophany - his judgment, especially as in ver. 16, the cause of fear to the psalmist. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "In the midst of the years.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The \"years\" are the period between the announcement of the judgment and its final accomplishment (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Habakkuk 2:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); the prophet prays that God would manifest his power, not merely at the extreme limit of this epoch, but earlier, sooner. This overthrow of the world power forms, as it were, the central point of history, the beginning of a new age which shall culminate in the Messianic kingdom. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Make known.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Let all the earth know and acknowledge thy work. The LXX. have given two or more versions of this passage, one of which is remarkable. Thus they read, \"In the midst of two animals (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "δύο ζώων",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") thou shalt be known; when the years draw nigh thou shalt be well known; when the time is come thou shalt be revealed.\" The rendering, \"two animals,\" arises from a confusion of words  but many of the Fathers, who were conversant with the Greek Scriptures, saw herein a reference to the incarnation of our blessed Lord, as lying in the stable at Bethlehem between the ox and the ass, which was the mystical explanation of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"The ox knoweth his owner, and the ass his master's crib.\" Others interpreted the two animals of the two thieves between whom Christ was crucified; or of angels and men; or Jews and Gentiles; or the two Testaments; or Moses and Elias. Others again accented the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ζῶων",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " so as to understand \"two lives,\" the present and the future, in the midst of which the Judge shall appear; or the life of Christ before his death and after his resurrection. There is a great truth underlying most of these interpretations, namely, that this magnificent hymn is concerned with the victories of Christ and his Church. In wrath remember mercy. When thine anger is displayed by sending the Chaldeans against us, remember thy mercy, and make a speedy end of our misery, and mitigate our enemies' cruelty (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Habakkuk 1:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and vers. 9, 13, 18, 19 of this chapter). The LXX. gives a double version, \"In the troubling of my soul, in wrath, thou wilt remember mercy.\" Habakkuk 3:2",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "\"Jehovah, I have heard Thy tidings, am alarmed. Jehovah, Thy work, in the midst of the years call it to life, in the midst of the years make it known; in wrath remember mercy.\" שׁמעך is the tidings (ἀκοή) of God; what the prophet has heard of God, i.e., the tidings of the judgment which God is about to inflict upon Judah through the Chaldaeans, and after that upon the Chaldaeans themselves. The prophet is alarmed at this. The word יראתי (I am alarmed) does not compel us to take what is heard as referring merely to the judgment to be inflicted upon Judah by the Chaldaeans. Even in the overthrow of the mighty Chaldaean, or of the empire of the world, the omnipotence of Jehovah is displayed in so terrible a manner, that this judgment not only inspires with joy at the destruction of the foe, but fills with alarm at the omnipotence of the Judge of the world. The prayer which follows, \"Call Thy work to life,\" also refers to this twofold judgment which God revealed to the prophet in ch. 1 and 2. פּעלך, placed absolutely at the head for the sake of emphasis, points back to the work (pō‛al) which God was about to do (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Habakkuk 1:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); but this work of God is not limited to the raising up of the Chaldaean nation, but includes the judgment which will fall upon the Chaldaean after he has offended (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Habakkuk 1:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). This assumption is not at variance even with חיּיהוּ. For the opinion that חיּה never means to call a non-existent thing to life, but always signifies either to give life to an inorganic object (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 33:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), or to keep a living thing alive, or (and this most frequently) to restore a dead thing to life, and that here the word must be taken in the sense of restoring to life, because in the description which follows Habakkuk looks back to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 77",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and the pō‛al depicted there, viz., the deliverance out of Egyptian bondage, is not correct. חיּה does not merely mean to restore to life and keep alive, but also to give life and call to life. In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 33:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where תּחיּני is parallel to עשׂתני, the reference is not to the impartation of life to an inorganic object, but to the giving of life in the sense of creating; and so also in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 7:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 19:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", חיּה זרע means to call seed to life, or raise it up, i.e., to call a non-existent thing to life. Moreover, the resemblances in the theophany depicted in what follows to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 77",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " do not require the assumption that Habakkuk is praying for the renewal of the former acts of God for the redemption of His people, but may be fully explained on the ground that the saving acts of God on behalf of His people are essentially the same in all ages, and that the prophets generally were accustomed to describe the divine revelations of the future under the form of imagery drawn from the acts of God in the past. There is special emphasis in the use of בּקרב שׁנים twice, and the fact that in both instances it stands at the head. It has been interpreted in very different ways; but there is an evident allusion to the divine answer in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Habakkuk 2:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", that the oracle is for an appointed time, etc. \"In the midst of the years,\" or within years, cannot of course mean by itself \"within a certain number, or a small number, of years,\" or \"within a brief space of time\" (Ges., Ros., and Maurer); nevertheless this explanation is founded upon a correct idea of the meaning. When the prophet directs his eye to the still remote object of the oracle (ch. 2), the fulfilment of which was to be delayed, but yet assuredly to come at last (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Habakkuk 2:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), the interval between the present time and the mō‛ēd appointed by God (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Habakkuk 2:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") appears to him as a long series of years, at the end only of which the judgment is to come upon the oppressors of His people, namely the Chaldaeans. He therefore prays that the Lord will not delay too long the work which He designs to do, or cause it to come to life only at the end of the appointed interval, but will bring it to life within years, i.e., within the years, which would pass by if the fulfilment were delayed, before that mō‛ēd arrived.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Grammatically considered, qerebh shânı̄m cannot be the centre of the years of the world, the boundary-line between the Old and New Testament aeons, as Bengel supposes, who takes it at the same time, according to this explanation, as the starting-point for a chronological calculation of the whole course of the world. Moreover, it may also be justly argued, in opposition to this view and application of the words, that it cannot be presupposed that the prophets had so clear a consciousness as this, embracing all history by its calculus; and still less can be expect to find in a lyrical ode, which is the outpouring of the heart of the congregation, a revelation of what God Himself had not revealed to him according to Habakkuk 2:3. Nevertheless the view which lies at the foundation of this application of our passage, viz., that the work of God, for the manifestation of which the prophet is praying, falls in the centre of the years of the world, has this deep truth, that it exhibits the overthrow not only of the imperial power of Chaldaea, but that of the world-power generally, and the deliverance of the nation from its power, and forms the turning-point, with which the old aeon closes and the new epoch of the world commences, with the completion of which the whole of the earthly development of the universe will reach its close. The repetition of בּקרב שׁנים is expressive of the earnest longing with which the congregation of the Lord looks for the tribulation to end. The object to תּודיע, which is to be taken in an optative sense, answering to the imperative in the parallel clause, may easily be supplied from the previous clause. To the prayer for the shortening of the period of suffering there is appended, without the copula Vav, the further prayer, in wrath to remember mercy. The wrath (rōgez, like râgaz in Isaiah 28:21 and Proverbs 29:9) in which God is to remember mercy, namely for His people Israel, can only be wrath over Israel, not merely the wrath manifested in the chastisement of Judah through the Chaldaeans, but also the wrath displayed in the overthrow of the Chaldaeans. In the former case God would show mercy by softening the cruelty of the Chaldaeans; in the latter, by accelerating their overthrow, and putting a speedy end to their tyranny. This prayer is followed in Habakkuk 3:3-15 by a description of the work of God which is to be called to life, in which the prophet expresses confidence that his petition will be granted. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Grammatically considered, qerebh shânı̄m cannot be the centre of the years of the world, the boundary-line between the Old and New Testament aeons, as Bengel supposes, who takes it at the same time, according to this explanation, as the starting-point for a chronological calculation of the whole course of the world. Moreover, it may also be justly argued, in opposition to this view and application of the words, that it cannot be presupposed that the prophets had so clear a consciousness as this, embracing all history by its calculus; and still less can be expect to find in a lyrical ode, which is the outpouring of the heart of the congregation, a revelation of what God Himself had not revealed to him according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 2:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Nevertheless the view which lies at the foundation of this application of our passage, viz., that the work of God, for the manifestation of which the prophet is praying, falls in the centre of the years of the world, has this deep truth, that it exhibits the overthrow not only of the imperial power of Chaldaea, but that of the world-power generally, and the deliverance of the nation from its power, and forms the turning-point, with which the old aeon closes and the new epoch of the world commences, with the completion of which the whole of the earthly development of the universe will reach its close. The repetition of בּקרב שׁנים is expressive of the earnest longing with which the congregation of the Lord looks for the tribulation to end. The object to תּודיע, which is to be taken in an optative sense, answering to the imperative in the parallel clause, may easily be supplied from the previous clause. To the prayer for the shortening of the period of suffering there is appended, without the copula Vav, the further prayer, in wrath to remember mercy. The wrath (rōgez, like râgaz in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 28:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 29:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") in which God is to remember mercy, namely for His people Israel, can only be wrath over Israel, not merely the wrath manifested in the chastisement of Judah through the Chaldaeans, but also the wrath displayed in the overthrow of the Chaldaeans. In the former case God would show mercy by softening the cruelty of the Chaldaeans; in the latter, by accelerating their overthrow, and putting a speedy end to their tyranny. This prayer is followed in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 3:3-15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " by a description of the work of God which is to be called to life, in which the prophet expresses confidence that his petition will be granted. ",
            "children": []
          }
        ]
      }
    ]
  }
]