[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(3-15) Habakkuk describes the “Theophany” or self-manifestation of Jehovah, which is to introduce the desired deliverance. The Authorised Version has unfortunately rendered all the verbs in this section in the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "past",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " tense, thus obscuring the sense of the poem. They all refer to a scene really future, but brought by the grasp of faith into the immediate ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "present.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " In the Hebrew some of these verbs are in the future tense, others in the past used with the force of a present, the “prophetic perfect” as it is sometimes termed. Such a use of the Hebrew preterite is common in Biblical poetry, notably in the Book of Psalms. It is almost impossible to reproduce in English the slight distinction between these tenses. While, however, his eyes are thus fixed on a future deliverance, the basis of all Habakkuk’s anticipations is God’s doings in time past; the chief features in the portraiture are, in fact, borrowed from the Books of Exodus and Judges.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(3) God came.—Render “God shall come from Teman, and the Holy One from Mount Paran. Selah. His glory covers the heavens, and the earth is full of His praise.” Jehovah reveals Himself from the south: i.e., from Mount Sinai, as in Deuteronomy 32, Judges 5, Psalms 68. The southern country is here designated as “Teman,” i.e., Edom to the S.E., and “Paran,” the mountainous region to the S.W., between Edom and Egypt.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(3) ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "God came",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".—Render “",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "God shall come from Teman, and the Holy One from Mount Paran. Selah. His glory covers the heavens, and the earth is full of His praise.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "” Jehovah reveals Himself from the south: ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "i.e.,",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " from Mount Sinai, as in Deuteronomy 32, Judges 5, Psalms 68. The southern country is here designated as “Teman,” ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "i.e.,",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Edom to the S.E., and “Paran,” the mountainous region to the S.W., between Edom and Egypt.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Habakkuk 3:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 3:3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "God came from Teman, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — Bishop Lowth observes, that “this chapter affords us a remarkable instance of that sublimity which is peculiar to the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ode, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and which is principally owing to a bold and yet easy digression, or transition. The prophet, foreseeing the judgments of God, the calamities which were to be brought upon his countrymen by the Chaldeans, and then the punishments which awaited the Chaldeans themselves; partly struck with terror, partly revived with hope and confidence in the divine mercy, he prays that God would hasten the redemption and deliverance of his people, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Habakkuk 3:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Now here immediately occurs to every one’s mind a similitude between the Babylonish and Egyptian captivity; that it was possible an equal deliverance might be procured by the help of God; and how aptly the prophet might so have continued his prayer, namely, that God, who had wrought so many miracles in ancient days for the sake of his people, would likewise continue his providential regard toward them; and how much it would contribute to confirm and strengthen the minds of the pious, who should remember, that the God who formerly had manifested his infinite power in rescuing the Israelites out of such great calamities, was able to do the same by avenging their posterity likewise. But the prophet has omitted all these topics, for this very reason, because they so readily occur to the mind; and instead of expatiating in so large a field, he bursts forth with an unexpected impetuosity, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "God came from Teman, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c.” — ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Præl. Hebrews ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "28. Habakkuk, therefore, having offered up his petitions to God for the preservation and support of his people during their captivity, proceeds, from hence to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Habakkuk 3:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to recount, for their encouragement, the wonderful works which Jehovah had formerly wrought for them to deliver them from Egyptian slavery, and to put them in possession of the land of Canaan, intimating by this, that he would in due time show himself equally powerful in delivering them from the Babylonish captivity, and restoring them to their own land. In recounting these wonderful works he first exhibits a description of Jehovah, as king and commander of the thousands of Israel, marching at their head in a pillar of a cloud, to conduct them, and put them in possession of the promised land. When Jehovah sets out from ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Teman ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Paran, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "so great is the majesty and glory with which he is arrayed, that the heaven and the earth are too little to contain them, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Habakkuk 3:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". His brightness, like that of the meridian sun, is insupportable, and his power irresistible, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Habakkuk 3:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The pestilence and devouring fire attending him to do execution upon the enemy at his command, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Habakkuk 3:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". As soon as he enters the land of Canaan, (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Habakkuk 3:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) he takes possession of it as rightful Lord; and the seven nations of Canaan, conscious that they had forfeited it by their wickedness, flee at the sight of him. The mountains of the land disperse to make way for him, the hills bow to pay him obeisance, and the highways own him for their Lord; and so great is the dread of him, that the neighbouring nations tremble while he passes by, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Habakkuk 3:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". “Throughout the whole passage the prophet preserves the same magnificence with which he begins, choosing the noblest images which so copious a subject could afford, and illustrating them with the most splendid colours, images, figures, and the most elevated style. What crowns the sublimity of this piece, is the singular elegance of the close; and were it not that antiquity hath here and there thrown its veil of obscurity over it, there could not be conceived a more perfect and masterly poem of the kind.” — Bishop Lowth. “The grandest images,” adds Bishop Newcome, “are selected; and the diction is as splendid as the subjects.” ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Teman ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "is thought to have been first the name of an encampment, and afterward of an Idumean city: see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 2:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 49:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Paran ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "was a part of Arabia Petræa, near mount Sinai: see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 21:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 33:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "His glory covered the heavens — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That excessive splendour which filled the air when God descended on mount Sinai, in flames of fire, lightnings, and thunders, to give the law to his people. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And the earth was full of his praise — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Green reads, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And his glory filled the earth.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3:3-15 God's people, when in distress, and ready to despair, seek help by considering the days of old, and the years of ancient times, and by pleading them with God in prayer. The resemblance between the Babylonish and Egyptian captivities, naturally presents itself to the mind, as well as the possibility of a like deliverance through the power of Jehovah. God appeared in his glory. All the powers of nature are shaken, and the course of nature changed, but all is for the salvation of God's own people. Even what seems least likely, shall be made to work for their salvation. Hereby is given a type and figure of the redemption of the world by Jesus Christ. It is for salvation with thine anointed. Joshua who led the armies of Israel, was a figure of Him whose name he bare, even Jesus, our Joshua. In all the salvations wrought for them, God looked upon Christ the Anointed, and brought deliverances to pass by him. All the wonders done for Israel of old, were nothing to that which was done when the Son of God suffered on the cross for the sins of his people. How glorious his resurrection and ascension! And how much more glorious will be his second coming, to put an end to all that opposes him, and all that causes suffering to his people!",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "God came - literally, shall come",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "From Teman - \"God shall come,\" as He came of old, clothed with majesty and power; but it was not mere power. The center of the whole picture is, as Micah and Isaiah had prophesied that it was to be, a new revelation Isa 2:3; Micah 4:2 : \"The law shall go forth from Zion, and the word of the Lord from Jerusalem.\" Isaiah 44:5, \"I will give Thee for a covenant to the people (Israel), for a light of the Gentiles.\" So now, speaking of the new work in store, Habakkuk renews the imagery in the Song of Moses Deuteronomy 33:2, in Deborah's Song Judges 5:5, and in David; Psalm 68:7 but there the manifestation of His glory is spoken of wholly in time past, and Mount Sinai is named. Habakkuk speaks of that coming as yet to be, and omits the express mention of Mount Sinai, which was the emblem of the law . And so he directs us to another Lawgiver, whom God should raise up like unto Moses Deuteronomy 18:15-18, yet with a law of life, and tells how He who spake the law, God, shall come in likeness of our flesh. And the Holy One from Mount Paran In the earliest passage three places are mentioned, in which or from which the glory of God was manifested; with this difference however, that it is said Deuteronomy 33:2, The Lord came from Sinai, but His glory arose, as we should say \"dawned\"  unto them from Seir, and flashed forth  from Mount Paran  Seir and Mount Paran are joined together by the symbol of the light which dawned or shone forth from them. In the second passage, the Song of Deborah, Seir and the field of Edom are the place whence God came forth; Sinai melted Judges 5:4-5 at His presence.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "From Teman - \"God shall come,\" as He came of old, clothed with majesty and power; but it was not mere power. The center of the whole picture is, as Micah and Isaiah had prophesied that it was to be, a new revelation Isa 2:3; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 4:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " : \"The law shall go forth from Zion, and the word of the Lord from Jerusalem.\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 44:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"I will give Thee for a covenant to the people (Israel), for a light of the Gentiles.\" So now, speaking of the new work in store, Habakkuk renews the imagery in the Song of Moses ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 33:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", in Deborah's Song ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 5:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and in David; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 68:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " but there the manifestation of His glory is spoken of wholly in time past, and Mount Sinai is named. Habakkuk speaks of that coming as yet to be, and omits the express mention of Mount Sinai, which was the emblem of the law . And so he directs us to another Lawgiver, whom God should raise up like unto Moses ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 18:15-18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", yet with a law of life, and tells how He who spake the law, God, shall come in likeness of our flesh. And the Holy One from Mount Paran In the earliest passage three places are mentioned, in which or from which the glory of God was manifested; with this difference however, that it is said ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 33:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", The Lord came from Sinai, but His glory arose, as we should say \"dawned\"  unto them from Seir, and flashed forth  from Mount Paran  Seir and Mount Paran are joined together by the symbol of the light which dawned or shone forth from them. In the second passage, the Song of Deborah, Seir and the field of Edom are the place whence God came forth; Sinai melted ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 5:4-5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " at His presence.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "In Psalm 68 the mention of Edom is dropped; and the march through the wilderness under the leading of God, is alone mentioned, together with the shaking of Sinai. In Habakkuk, the contrast is the same as in Moses; only Tehran stands in place of Seir . Theman and Mount Paran are named probably, as the two opposed boundaries of the journeyings of Israel through the desert. They came to Mount Sinai through the valley, now called Wady Feiran  or Paran; Edom was the bound of their wanderings to their promised land Numbers 20:14-20; Deuteronomy 2. God who guided, fed, protected them from the beginning, led them to the end. Between Paran also and Edom or Teman was the gift of the Spirit to the seventy, which was the shadow of the day of Pentecost; there, was the brass serpent lifted up, the picture of the healing of the Cross . If Mount Paran is near Kadesh, then Moses in the opening of his song describes the glory of God as manifested from that first revelation of His Law on Mount Sinai; then in that long period of Israel's waiting there to its final departure for the promised land, when Mount Hor was consecrated and God's awful Holiness declared in the death of Aaron.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 68",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the mention of Edom is dropped; and the march through the wilderness under the leading of God, is alone mentioned, together with the shaking of Sinai. In Habakkuk, the contrast is the same as in Moses; only Tehran stands in place of Seir . Theman and Mount Paran are named probably, as the two opposed boundaries of the journeyings of Israel through the desert. They came to Mount Sinai through the valley, now called Wady Feiran  or Paran; Edom was the bound of their wanderings to their promised land ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 20:14-20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". God who guided, fed, protected them from the beginning, led them to the end. Between Paran also and Edom or Teman was the gift of the Spirit to the seventy, which was the shadow of the day of Pentecost; there, was the brass serpent lifted up, the picture of the healing of the Cross . If Mount Paran is near Kadesh, then Moses in the opening of his song describes the glory of God as manifested from that first revelation of His Law on Mount Sinai; then in that long period of Israel's waiting there to its final departure for the promised land, when Mount Hor was consecrated and God's awful Holiness declared in the death of Aaron.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "He who \"shall come,\" is God , \"the Holy One\" (a proper name of gods) . Perfect in Holiness, as God, the Son of God, and as Man also all-holy, with a human will, always exactly accompanying the Divine Will, which was:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"The passion of His Heart",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Those Three-and-thirty years.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "On this there follows a pause denoted by \"Selah\"  (which occurs thrice according to the mystery of that number,) that the soul may dwell on the greatness of the majesty and mercy of God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Selah - There is no doubt as to the general purport of the word, that it is a musical direction, that there should be a pause, the music probably continuing alone, while the mind rested upon the thought, which had just been presented to it; our \"interlude\" . It is always placed at some pause of thought, even when not at the end of a strophe, or, as twice in this hymn , at the end of the verse.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Gregory of Nyssa modifies this thought, supposing \"Selah\" to express a pause made by the writer, that  \"while the psalmody, with which David's prophesying was accompanied, went on in its course, another illumining of the Holy Spirit, and an addition to the gift according to knowledge, came for the benefit of those who received the prophecy, he, holding in his verse, gave time for his mind to receive the knowledge of the thought, which took place in him from the divine illumining. He defines it to be \"a sudden silence in the midst of the Psalmody for the reception of the illumining.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "His Glory covered the heavens, and the earth was full of His praise - This is plainly no created glory, but anticipates the Angelic Hymn Luke 2:14 \"Glory to God in the highest, and on earth peace, good-will toward men,\" or, as the Seraphim sing first glory to God in Heaven Isaiah 6:3, \"Holy Holy Holy is the Lord God of Sabaoth,\" and then, the whole earth is full of His glory; and Uncreated Wisdom saith (Ecclesiasticus 24:5), \"I alone compassed the circuit of Heaven, and walked in the bottom of the deep.\" Nor are they our material heavens, much less this lowest heaven over our earth nor is \"His glory\" any  of God, which rules, encompasses, fills, penetrates the orbs of heaven and all its inhabitants, and yet is not enclosed nor bounded thereby. Those who are made as the heavens by the indwelling of God He spiritually \"covers,\" filling  them with the light of glory and splendor of grace and brightness of wisdom, as it saith, \"Is there any number of His armies, and upon whom doth not His light arise? Job 25:3 and so the earth was full of His praise,\" i. e., the Church militant spread throughout the world, as in the Psalm Psa 112:3, \"The Lord's name is praised from the rising up of the sun unto the going down of the same, and, Psalm 8:1, O Lord, our Lord, how excellent is Thy name in all the earth, who hast set Thy glory above the heavens.\" ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "His Glory covered the heavens, and the earth was full of His praise - This is plainly no created glory, but anticipates the Angelic Hymn ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 2:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " \"Glory to God in the highest, and on earth peace, good-will toward men,\" or, as the Seraphim sing first glory to God in Heaven ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 6:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"Holy Holy Holy is the Lord God of Sabaoth,\" and then, the whole earth is full of His glory; and Uncreated Wisdom saith (Ecclesiasticus 24:5), \"I alone compassed the circuit of Heaven, and walked in the bottom of the deep.\" Nor are they our material heavens, much less this lowest heaven over our earth nor is \"His glory\" any  of God, which rules, encompasses, fills, penetrates the orbs of heaven and all its inhabitants, and yet is not enclosed nor bounded thereby. Those who are made as the heavens by the indwelling of God He spiritually \"covers,\" filling  them with the light of glory and splendor of grace and brightness of wisdom, as it saith, \"Is there any number of His armies, and upon whom doth not His light arise? ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 25:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and so the earth was full of His praise,\" i. e., the Church militant spread throughout the world, as in the Psalm Psa 112:3, \"The Lord's name is praised from the rising up of the sun unto the going down of the same, and, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 8:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", O Lord, our Lord, how excellent is Thy name in all the earth, who hast set Thy glory above the heavens.\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3. God—singular in the Hebrew, \"Eloah,\" instead of \"Elohim,\" plural, usually employed. The singular is not found in any other of the minor prophets, or Jeremiah, or Ezekiel; but it is in Isaiah, Daniel, Job, and Deuteronomy.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "from Teman—the country south of Judea and near Edom, in which latter country Mount Paran was situated [Henderson]. \"Paran\" is the desert region, extending from the south of Judah to Sinai. Seir, Sinai, and Paran are adjacent to one another, and are hence associated together, in respect to God's giving of the law (De 33:2). Teman is so identified with Seir or Edom, as here to be substituted for it. Habakkuk appeals to God's glorious manifestations to His people at Sinai, as the ground for praying that God will \"revive His work\" (Hab 3:2) now. For He is the same God now as ever.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Selah—a musical sign, put at the close of sections and strophes, always at the end of a verse, except thrice; namely, here, and Hab 3:9, and Ps 55:19; 57:3, where, however, it closes the hemistich. It implies a change of the modulation. It comes from a root to \"rest\" or \"pause\" [Gesenius]; implying a cessation of the chant, during an instrumental interlude. The solemn pause here prepares the mind for contemplating the glorious description of Jehovah's manifestation which follows.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "earth … full of his praise—that is, of His glories which were calculated to call forth universal praise; the parallelism to \"glory\" proves this to be the sense.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the God of our fathers, our God, came; appeared, discovered himself, for that is his coming, who, since he fills all places at all times, cannot be said to come by any change of place. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Teman; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " either appellatively, the south, or else as a proper name of a mountain or country. so called from Teman, son of Eliphaz, and grandson of Esau. It is also called Seir, or is one particular hill among those many which make up Mount Seir. It was not far from Mount Sinai, where the law was given, and the prophet hath respect to that ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Deu 33:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deu 33:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", where God appeared in a manner equally glorious and terrible, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The Holy One of Israel.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Mount Paran; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which was a name to wilderness, plains, and a mountain, of which the prophet here speaketh, and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Deu 33:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deu 33:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " it is said God shined thence. This the prophet mentions as a support of his faith, as an encouragement to others, as a motive why God should renew his work among them, since he so gloriously appeared among their fathers, and made a covenant with them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Selah:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to the argument he addeth this to awaken us to attention. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "His glory; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " lightnings and thunders, and fire and smoke, tokens of the power, majesty, and greatness of God, at the sight whereof Moses himself trembled. Covered, overspread, intercepted, and obscured, the heavens; that part of the visible heavens under which Israel then encamped. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The earth, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that part of the earth where this was done, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "was full of his praise; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of works which deserved then, and still do deserve, to be had in remembrance, with praise to God who did them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "God came from Teman,.... Or, \"may God come from Teman\" (t); since it is part of the prayer of Habakkuk: or, as \"from Teman\" (u); as he of old came from thence, a city in the land of Edom, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 49:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it was five miles from Petra, in Idumea, where was Mount Seir, from whence the Lord arose, and shone forth from Mount Paran, at the giving of the law, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 33:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to which the allusion is here. So the Targum, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"at the giving of the law to his people, God was revealed from the south;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for so Teman signifies. The prophet, to encourage his own faith, and the faith of others, takes notice, in this and the following verses, of the instances of the grace, goodness, and power of God to his people Israel, in appearing to them at Mount Sinai, going before them in the wilderness, destroying their enemies, casting them out before them, and introducing them into the land of Canaan, and settling them there; suggesting, that he that had done these great and wonderful things would support and maintain, carry on and promote, his own kingdom and interest in the world; in order to which the prophet prays to God the Father for the coming of his Son, either in the flesh, that the incarnate God would appear in the world, and set up his kingdom in it; or, in prayer, he prophesies of it, and expresses his faith in it: \"God cometh from the south\"; or, \"he shall come\" (w), as it may be rendered: he knew, from the prophecy of Micah, that he that was to be ruler in Israel was to come from Bethlehem, Micah 5:2 which lay to the south of Jerusalem; and from hence he expected him, and believed he would come, and prayed for it as being most desirable and welcome: or else this respects the coming of the Messiah, in the ministration of the word to Jews and Gentiles, after his resurrection from the dead, and ascension to heaven, and the pouring forth of his Spirit on the day of Pentecost; that as the Lord came from the places here mentioned, when he gave the law on Mount Sinai, so he would send forth his Gospel out of Zion and Jerusalem, and go forth himself along with it, riding in his glory, and in his majesty, conquering and to conquer; causing his ministers to triumph in him, and by them subdue multitudes of souls to him, both in Judea, and in the Gentile world, whereby his kingdom might appear in it: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "for so Teman signifies. The prophet, to encourage his own faith, and the faith of others, takes notice, in this and the following verses, of the instances of the grace, goodness, and power of God to his people Israel, in appearing to them at Mount Sinai, going before them in the wilderness, destroying their enemies, casting them out before them, and introducing them into the land of Canaan, and settling them there; suggesting, that he that had done these great and wonderful things would support and maintain, carry on and promote, his own kingdom and interest in the world; in order to which the prophet prays to God the Father for the coming of his Son, either in the flesh, that the incarnate God would appear in the world, and set up his kingdom in it; or, in prayer, he prophesies of it, and expresses his faith in it: \"God cometh from the south\"; or, \"he shall come\" (w), as it may be rendered: he knew, from the prophecy of Micah, that he that was to be ruler in Israel was to come from Bethlehem, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Micah 5:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " which lay to the south of Jerusalem; and from hence he expected him, and believed he would come, and prayed for it as being most desirable and welcome: or else this respects the coming of the Messiah, in the ministration of the word to Jews and Gentiles, after his resurrection from the dead, and ascension to heaven, and the pouring forth of his Spirit on the day of Pentecost; that as the Lord came from the places here mentioned, when he gave the law on Mount Sinai, so he would send forth his Gospel out of Zion and Jerusalem, and go forth himself along with it, riding in his glory, and in his majesty, conquering and to conquer; causing his ministers to triumph in him, and by them subdue multitudes of souls to him, both in Judea, and in the Gentile world, whereby his kingdom might appear in it: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and the Holy One from Mount Paran; or, \"even the Holy One\" (x); that came or shined forth \"from Mount Paran\" formerly; for it was Christ then that appeared on Mount Sinai, and gave to Moses the lively oracles of God; see Psalm 68:17 he, as he is truly God, God manifest in the flesh, \"Immanuel\", God with us; so he is the holy One of God, infinitely and essentially holy, as a divine Person; and holy, and harmless, and without sin in his human nature and life; and is the sanctifier and sanctification of his people. Mount Paran was situated to the south of the land of Canaan, as well as Teman, which so signifies, as before observed. It is called by Ptolemy, Pomponius Mela, and others, Strobilus, from its likeness to a pineapple. It had its name from the city Paran, which lay between Egypt and Arabia (y); see  1 Kings 11:18 which Jerom says (z) was three days' journey from Aila to the east; mention is made of Ail, or Elparan in Genesis 14:6 near to which was the wilderness of Paran, frequently spoken of in Scripture,  Genesis 21:21 the same which Josephus (a) calls the valley or plain of Pharan, where Simon of Gerasa made caves and dens, and hid the treasure he plundered from the people: according to Adrichomius (b), it was a most dreadful barren desert, where nothing grew, or was to be had, through which the children of Israel journeyed; and was sometimes taken for the first part of the desert of Arabia, near Mount Sinai, and sometimes for the last part of it, towards the land of promise; sometimes it was called the desert of Sin, and sometimes the desert of Sinai, from that mountain; but its most general name was that of Paran, and contained eleven days' journey from Mount Sinai to Kadeshbarnea. Mount Paran (he says (c)) is thick and shady, near to Mount Sinai, and even \"contiguous\", as it should seem to be from Deuteronomy 33:2 to which the reference is here. So Hillerus (d) interprets it, \"full of boughs\", or \"branches\"; or else he would have it to signify \"the corner of Aran\", the son of Dishan, a son of Seir the Horite, who inhabited this country; see Genesis 36:20 and both Teman and Paran being to the south, may point to the place of the Redeemer, by whom the great work was to be done, referred unto. Jerom says he heard a Hebrew man discourse on this passage, thus, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and the Holy One from Mount Paran; or, \"even the Holy One\" (x); that came or shined forth \"from Mount Paran\" formerly; for it was Christ then that appeared on Mount Sinai, and gave to Moses the lively oracles of God; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 68:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " he, as he is truly God, God manifest in the flesh, \"Immanuel\", God with us; so he is the holy One of God, infinitely and essentially holy, as a divine Person; and holy, and harmless, and without sin in his human nature and life; and is the sanctifier and sanctification of his people. Mount Paran was situated to the south of the land of Canaan, as well as Teman, which so signifies, as before observed. It is called by Ptolemy, Pomponius Mela, and others, Strobilus, from its likeness to a pineapple. It had its name from the city Paran, which lay between Egypt and Arabia (y); see  ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 11:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " which Jerom says (z) was three days' journey from Aila to the east; mention is made of Ail, or Elparan in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 14:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " near to which was the wilderness of Paran, frequently spoken of in Scripture,  ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 21:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the same which Josephus (a) calls the valley or plain of Pharan, where Simon of Gerasa made caves and dens, and hid the treasure he plundered from the people: according to Adrichomius (b), it was a most dreadful barren desert, where nothing grew, or was to be had, through which the children of Israel journeyed; and was sometimes taken for the first part of the desert of Arabia, near Mount Sinai, and sometimes for the last part of it, towards the land of promise; sometimes it was called the desert of Sin, and sometimes the desert of Sinai, from that mountain; but its most general name was that of Paran, and contained eleven days' journey from Mount Sinai to Kadeshbarnea. Mount Paran (he says (c)) is thick and shady, near to Mount Sinai, and even \"contiguous\", as it should seem to be from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 33:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " to which the reference is here. So Hillerus (d) interprets it, \"full of boughs\", or \"branches\"; or else he would have it to signify \"the corner of Aran\", the son of Dishan, a son of Seir the Horite, who inhabited this country; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 36:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and both Teman and Paran being to the south, may point to the place of the Redeemer, by whom the great work was to be done, referred unto. Jerom says he heard a Hebrew man discourse on this passage, thus, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"that Bethlehem lies to the south, where the Lord and Saviour was born: and that he it is of whom it is here said, \"the Lord shall come from the south\"; that is, shall be born in Bethlehem, and thence arise; and because he who is born in Bethlehem formerly gave the law on Mount Sinai, he is \"the Holy One\" that came from \"Mount Paran\"; seeing Paran is a place near to Mount Sinai; and the word \"Selah\" signifies \"always\"; and the sense is, he who is born in Bethlehem, and who on Mount Sinai, that is, on Mount Paran, gave the law, always is the author and giver of all blessings, past, present, and to come.'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The word ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Selah stands here in the middle of the verse. It is interpreted, by several of the Jewish writers, \"for ever\", as by the aforementioned Hebrew; and by others as an affirmation, and render it, \"verily, truly\", as answering to \"Amen\". Some understand it as a pause or full stop, denoting attention to something said that is remarkable; and others take it to be a note, directing the singer to the elevation of his voice, where it stands; and so it is no other than a musical note; hence the Septuagint render it  A very learned man (e) has wrote a dissertation upon it, showing that it is one of the names of God; and used differently, as the sense requires, either in the vocative case, as \"Selah\", that is, O God; or in the other cases, of God, to God, &c.: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "his glory covered the heavens; that is, the glory of God, the Holy One, when he came, or should come: this was true of him when he descended on Mount Sinai, and his glory abode upon it; and the sight of his glory was like devouring fire; and the elders saw the God of Israel, under whose feet was as a paved work of sapphire, and as the body of heaven in its clearness; yea, so great as to make the light and glory of the celestial bodies useless, even to cover and hide the shining of them; see Exodus 24:10 and may respect the glorious appearances at the birth of Christ, when the heavenly host descended, and sung Glory to God in the highest, and when the glory of the Lord shone round about the shepherds, Luke 2:9 and at his baptism, when the heavens were opened, the Father's voice was heard, and the Spirit descended on Christ, as a dove; and at his transfiguration, when his face shone as the sun; and Moses and Elias appeared in glorious forms, and a bright cloud overshadowed them, and a voice was heard from the excellent Glory, Matthew 3:16 or rather it may be, this may respect Christ as the brightness of his Father's glory, and the glory of God in the face of Christ, as set forth in the light of the glorious Gospel of Christ, when carried throughout the world by his apostles; whereby his glory was so spread in it, that the heavens were covered with it, and declared it; yea, it was set above the heavens, and the name of the Lord became excellent in all the earth, as follows; see Psalm 19:1, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "his glory covered the heavens; that is, the glory of God, the Holy One, when he came, or should come: this was true of him when he descended on Mount Sinai, and his glory abode upon it; and the sight of his glory was like devouring fire; and the elders saw the God of Israel, under whose feet was as a paved work of sapphire, and as the body of heaven in its clearness; yea, so great as to make the light and glory of the celestial bodies useless, even to cover and hide the shining of them; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 24:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and may respect the glorious appearances at the birth of Christ, when the heavenly host descended, and sung Glory to God in the highest, and when the glory of the Lord shone round about the shepherds, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 2:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and at his baptism, when the heavens were opened, the Father's voice was heard, and the Spirit descended on Christ, as a dove; and at his transfiguration, when his face shone as the sun; and Moses and Elias appeared in glorious forms, and a bright cloud overshadowed them, and a voice was heard from the excellent Glory, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 3:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " or rather it may be, this may respect Christ as the brightness of his Father's glory, and the glory of God in the face of Christ, as set forth in the light of the glorious Gospel of Christ, when carried throughout the world by his apostles; whereby his glory was so spread in it, that the heavens were covered with it, and declared it; yea, it was set above the heavens, and the name of the Lord became excellent in all the earth, as follows; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 19:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and the earth was full of his praise; with the words of his praise, as the Targum; so the fame of the mighty things done by the Lord in Egypt, at the Red sea, and in the wilderness, for his people, reached the nations of the world, and especially those of the land of Canaan, and struck them with awe and dread, Joshua 2:9 and the fame of Christ, his miracles and doctrines, went through the land of Israel, and all Syria; and multitudes glorified God, and praised him for what was done by him, Matthew 4:23 and more especially the earth was filled with his glory and praise when his Gospel was carried into all the parts of it by his apostles; which occasioned universal joy to all sensible sinners, and filled their hearts and mouths with praise to God for such a Saviour, and for such blessings of grace and good things that came by him: or, \"the earth was full of his light\" (f); of the light of his Gospel, and of the knowledge of himself by it. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and the earth was full of his praise; with the words of his praise, as the Targum; so the fame of the mighty things done by the Lord in Egypt, at the Red sea, and in the wilderness, for his people, reached the nations of the world, and especially those of the land of Canaan, and struck them with awe and dread, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 2:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and the fame of Christ, his miracles and doctrines, went through the land of Israel, and all Syria; and multitudes glorified God, and praised him for what was done by him, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 4:23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and more especially the earth was filled with his glory and praise when his Gospel was carried into all the parts of it by his apostles; which occasioned universal joy to all sensible sinners, and filled their hearts and mouths with praise to God for such a Saviour, and for such blessings of grace and good things that came by him: or, \"the earth was full of his light\" (f); of the light of his Gospel, and of the knowledge of himself by it. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(t) \"veniet\", so some in Calvin, Van Till. (u) \"sicuti olim ex Theman\", Van Till. (w) Venit, Grotius; \"veniet\", Pagninus, Montanus, Calvin, Gussetius. (x)  (y) Hiller. Onomastic. p. 585, 908. (z) De locis Hebr. fol. 91. F. G. (a) De Bello Jud. l. 4. c. 9. sect. 4. (b) Theatrum Terrae Sanctae, p. 116. (c) Ibid. p. 123. (d) Ut supra, (Hiller. Onomastic.) p. 431, 477, 908. (e) Paschii Dissertatio de Selah, p. 670. in Thesaur. Theolog. Philolog. par. 1.((f)   \"et lux ejus implevit terram\", Junius & Tremellius; \"et splendoris, vel fulgoris ejus plena terra\", Vatablus, Drusius; so Kimchi, Ben Melech, and R. Sol. Urbin. Ohel Moed, fol. 3. 1. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(t) \"veniet\", so some in Calvin, Van Till. (u) \"sicuti olim ex Theman\", Van Till. (w) Venit, Grotius; \"veniet\", Pagninus, Montanus, Calvin, Gussetius. (x)  (y) Hiller. Onomastic. p. 585, 908. (z) De locis Hebr. fol. 91. F. G. (a) De Bello Jud. l. 4. c. 9. sect. 4. (b) Theatrum Terrae Sanctae, p. 116. (c) Ibid. p. 123. (d) Ut supra, (Hiller. Onomastic.) p. 431, 477, 908. (e) Paschii Dissertatio de Selah, p. 670. in Thesaur. Theolog. Philolog. par. 1.((f)   \"et lux ejus implevit terram\", Junius & Tremellius; \"et splendoris, vel fulgoris ejus plena terra\", Vatablus, Drusius; so Kimchi, Ben Melech, and R. Sol. Urbin. Ohel Moed, fol. 3. 1. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "God came from {d} Teman, and the Holy One from mount Paran. Selah. His glory covered the heavens, and the earth was full of his praise.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "God came from ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{d}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Teman, and the Holy One from mount Paran. Selah. His glory covered the heavens, and the earth was full of his praise.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(d) Teman and Paran were near Sinai, where the Law was given: by which is signified that his deliverance was as present now as it was then.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "God came from Teman",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "cometh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": the poet feels himself in presence of the manifestation. Teman is a district lying in the north-west of Edom, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 25:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Obadiah 1:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the Holy One from mount Paran",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "the mountains",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (hill country) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "of Paran",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The “Holy One” is virtually already a proper name (without the Art.), as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 40:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Paran is the elevated region lying between the wilderness of Kadesh on the north and that of Sinai on the south, west of the Arabah. If any particular mountain be referred to it may be Jebel Mukrah, which has a height of 2000 feet, and forms the southern boundary of the plateau. At present the region is the seat of the Azazimeh Arabs. The whole region of Sinai, Paran and Edom is regarded as the scene of the divine manifestation; comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 33:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jdg 5:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "His glory covered",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "covereth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the heavens. The “glory” is the splendour of the divine majesty, which overspreads the heavens. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 8:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 148:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "was full",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "his praise",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "the earth is filled with",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The term “praise” has a secondary meaning, viz. that in God which evokes praise or adoration. The meaning is not that praises from men’s mouth filled the earth, but that the light of God’s glory filled it, just as it overspread the heavens. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 6:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "3–7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Approach and manifestation of Jehovah in the storm",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The Theophany is pictured as a great tempest in the heavens in the midst of which God is present. It comes from the south, the region of Paran and Sinai (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Habakkuk 3:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 3:3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); there is a terrible splendour around the advancing God, which lightens the heavens and the earth (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Habakkuk 3:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 3:3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "b",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", 4); pestilence and fever-glow follow in His wake (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Habakkuk 3:5",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 3:5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "); all nature shudders, the eternal hills sink down (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Habakkuk 3:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 3:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "); the nations and tribes in the desert are dismayed (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Habakkuk 3:7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 3:7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "3–15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Revelation of Jehovah",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "The passage has three strophes of 5, 4, 4 verses respectively. (1) Description of the Theophany, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Habakkuk 3:3-7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 3:3-7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". (2) The question, what is its meaning? ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Habakkuk 3:8-11",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 3:8-11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". (3) Statement of its meaning—it is to save His people, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Habakkuk 3:12-15",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 3:12-15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 3-15.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - § 3. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "The prophet or the congregation depicts in a majestic theophany the coming of God to judge the world, and its effect symbolically on material nature, and properly on evil men.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 3.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - In this episode Habakkuk takes his imagery from the accounts of God's dealings with his people in old time, in Egypt, at the Red Sea, at Sinai, at the Jordan, in Canaan; he echoes the songs of Moses and Deborah and the psalmist; and he looks on all these mighty deeds as antici-pative of God's great work, the overthrow of all that opposes and the establishment of the kingdom of Messiah. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Eloah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "came from Teman.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The words are connected with Moses' description of the Lord's appearance at Sinai (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 33:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 5:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). As he then came in glory to make a covenant with his people, so will he appear again in majesty to deliver them from the power of evil and to execute judgment. The verbs throughout are best rendered in the present. The prophet takes his stand in time preceding the action of the verb, and hence uses the future tense, thus also showing that he is prophesying of a great event to come, symbolized by these earlier manifestations. Habakkuk here and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Habakkuk 1:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " trees the word ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Eloah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which is not found in Jeremiah, Ezekiel, or the other minor prophets; it occurs once in Isaiah, twice in Deuteronomy, and frequently in Job. There is no ground for the contention that its employment belongs to the latest stage of Hebrew. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Teman",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Edom; Vulgate, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "ab Austro",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (see notes on Amos 1:12 and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Obadiah 1:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). In Moses' song the Lord is said to come from Sinai. Habakkuk omits Sinai, says Pusey which was the emblem of the Law, and points to another Lawgiver, like unto Moses, telling how he who spake the Law, God. should come in the likeness of man. The Holy One. A name of God (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Habakkuk 1:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), implying that he will not let iniquity pass unpunished, and that he will preserve the holy seed. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Mount Paran.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The mountainous district on the northeast of the desert of ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Et-Tih.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The glory of the Lord is represented as flashing on the two hilly regions separated by the Arabah. They both lay south of Canaan; and there is propriety in representing the redeemer and deliverer appearing in the south, as the Chaldean invader comes from the north. The LXX. adds two translations of the word \"Pharan,\" viz. \"shady,\" \"rough;\" according to its etymology it might also mean \"lovely.\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Selah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; Septuagint, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "διάψαλμα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This term occurs also in vers. 9, 13, and frequently in the Psalms, but nowhere else, and indicates some change in the music when the ode was sung in the temple service. What is the exact change is a matter of great uncertainty. Some take it to indicate \"a pause;\" others, connecting it with ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "salah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"to lift up,\" render it \"elevation,\" and suppose it means the raising of the voice, or the strengthening of the accompaniment, as by the blast of trumpets. The meaning must be left undetermined, though it must be added that it is always found at the end of a verse or hemistich, where there is a pause or break in the thought, or, as some say, some strongly accented words occur. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "His glory covered the heavens.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " His majestic brightness spread over the heavens, dimming the gleam of sun and stars; or it may mean his boundless majesty fills the highest heavens and encompasses its inhabitants. His praise. This is usually explained to signify that the earth and all that dwell therein, at this glorious manifestion, utter their praise. But there is no allusion as yet to the manner in which the appearance is received, and in ver. 6 it produces fear and trembling; so it is best to take \"praise\" in the sense of \"matter of praise,\" that glory \"which was calculated to call forth universal adoration\" (Henderson). Habakkuk 3:3",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Coming of the Lord to judge the nations and to redeem His people. The description of this theophany rests throughout upon earlier lyrical descriptions of the revelations of God in the earlier times of Israel. Even the introduction (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Habakkuk 3:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") has its roots in the song of Moses in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 33:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and in the further course of the ode we meet with various echoes of different psalms (compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Habakkuk 3:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 18:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Habakkuk 3:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 18:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Habakkuk 3:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 18:33-34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; also ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Habakkuk 3:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 68:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Habakkuk 3:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 68:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 68:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The points of contact in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Habakkuk 3:10-15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 77:17-21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", are still more marked, and are of such a kind that Habakkuk evidently had the psalm in his mind, and not the writer of the psalm the hymn of the prophet, and that the prophet has reproduced in an original manner such features of the psalm as were adapted to his purpose. This is not only generally favoured by the fact that Habakkuk's prayer is composed throughout after the poetry of the Psalms, but still more decidedly by the circumstance that Habakkuk depicts a coming redemption under figures borrowed from that of the past, to which the singer of this psalm looks back from his own mournful times, comforting himself with the picture of the miraculous deliverance of his people out of Egypt (see Hengstenberg and Delitzsch on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 77",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). For it is very evident that Habakkuk does not describe the mighty acts of the Lord in the olden time, in order to assign a motive for his prayer for the deliverance of Israel out of the affliction of exile which awaits it in the future, as many of the earlier commentators supposed, but that he is predicting a future appearance of the Lord to judge the nations, from the simple fact that he places the future יבוא (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Habakkuk 3:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") at the head of the whole description, so as to determine all that follows; whilst it is placed beyond the reach of doubt by the impossibility of interpreting the theophany historically, i.e., as relating to an earlier manifestation of God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Habakkuk 3:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 3:3",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Eloah comes from Teman, and the Holy One from the mountains of Paran. Selah. His splendour covers the sky, and the earth is full of His glory. Habakkuk 3:4. And brightness appears like sunlight, rays are at His hand, and there His power is concealed. Habakkuk 3:5. Before Him goes the plague, and pestilence follows His feet.\" As the Lord God once came down to His people at Sinai, when they had been redeemed out of Egypt, to establish the covenant of His grace with them, and make them into a kingdom of God, so will He appear in the time to come in the terrible glory of His omnipotence, to liberate them from the bondage of the power of the world, and dash to pieces the wicked who seek to destroy the poor. The introduction to this description is closely connected with Deuteronomy 33:2. As Moses depicts the appearance of the Lord at Sinai as a light shining from Seir and Paran, so does Habakkuk also make the Holy One appears thence in His glory; but apart from other differences, he changes the preterite בּא (Jehovah came from Sinai) into the future יבוא, He will come, or comes, to indicate at the very outset that he is about to describe not a past, but a future revelation of the glory of the Lord. This he sees in the form of a theophany, which is fulfilled before his mental eye; hence יבוא does not describe what is future, as being absolutely so, but is something progressively unfolding itself from the present onwards, which we should express by the present tense. The coming one is called Eloah (not Jehovah, as in Deuteronomy 33:2, and the imitation in Judges 5:4), a form of the name Elohim which only occurs in poetry in the earlier Hebrew writings, which we find for the first time in Deuteronomy 32:15, where it is used of God as the Creator of Israel, and which is also used here to designate God as the Lord and Governor of the whole world. Eloah, however, comes as the Holy One (qâdōsh), who cannot tolerate sin (Habakkuk 1:13), and who will judge the world and destroy the sinners (Habakkuk 3:12-14). As Eloah and Qâdōsh are names of one God; so \"from Teman\" and \"from the mountain of Paran\" are expressions denoting, not two starting-points, but simply two localities of one single starting-point for His appearance, like Seir and the mountains of Paran in Deuteronomy 33:2. Instead of Seir, the poetical name of the mountainous country of the Edomites, Teman, the southern district of Edomitish land, is used per synecdochen for Idumaea generally, as in Obadiah 1:9 and Amos 1:12 (see p. 168). The mountains of Paran are not the Et-Tih mountains, which bounded the desert of Paran towards the south, but the high mountain-land which formed the eastern half of that desert, and the northern portion of which is now called, after its present inhabitants, the mountains of the Azazimeh (see comm. on Numbers 10:12). The two localities lie opposite to one another, and are only separated by the Arabah (or deep valley of the Ghor). We are not to understand the naming of these two, however, as suggesting the idea that God was coming from the Arabah, but, according to the original passage in Deuteronomy 33:2, as indicating that the splendour of the divine appearance spread over Teman and the mountains of Paran, so that the rays were reflected from the two mountainous regions. The word Selâh does not form part of the subject-matter of the text, but shows that the music strikes in here when the song is used in the temple, taking up the lofty thought that God is coming, and carrying it out in a manner befitting the majestic appearance, in the prospect of the speedy help of the Lord. The word probably signified elevatio, from sâlâh  equals  sâlal, and was intended to indicate the strengthening of the musical accompaniment, by the introduction, as is supposed, of a blast from the trumpets blown by the priests, corresponding therefore to the musical forte. (For further remarks, see Hvernick's Introduction to the Old Testament, iii. p. 120ff., and Delitzsch on Psalm 3:1-8.) In Habakkuk 3:3 the glory of the coming of God is depicted with reference to its extent, and in Habakkuk 3:4 with reference to its intensive power. The whole creation is covered with its splendour. Heaven and earth reflect the glory of the coming one. הודו, His splendour or majesty, spreads over the whole heaven, and His glory over the earth. Tehillâh does not mean the praise of the earth, i.e., of its inhabitants, where (Chald., Ab. Ezr., Ros., and others); for there is no allusion to the manner in which the coming of God is received, and according to Habakkuk 3:6 it fills the earth with trembling; but it denotes the object of the praise or fame, the glory, ἡ δόξα, like hâdâr in Job 40:10, or kâbhōd in Isaiah 6:3; Isaiah 42:8, and Numbers 14:21. Grammatically considered, תּהלּתו is the accusative governed by מלאה, and הארץ is the subject. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"Eloah comes from Teman, and the Holy One from the mountains of Paran. Selah. His splendour covers the sky, and the earth is full of His glory. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 3:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And brightness appears like sunlight, rays are at His hand, and there His power is concealed. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 3:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Before Him goes the plague, and pestilence follows His feet.\" As the Lord God once came down to His people at Sinai, when they had been redeemed out of Egypt, to establish the covenant of His grace with them, and make them into a kingdom of God, so will He appear in the time to come in the terrible glory of His omnipotence, to liberate them from the bondage of the power of the world, and dash to pieces the wicked who seek to destroy the poor. The introduction to this description is closely connected with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 33:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". As Moses depicts the appearance of the Lord at Sinai as a light shining from Seir and Paran, so does Habakkuk also make the Holy One appears thence in His glory; but apart from other differences, he changes the preterite בּא (Jehovah came from Sinai) into the future יבוא, He will come, or comes, to indicate at the very outset that he is about to describe not a past, but a future revelation of the glory of the Lord. This he sees in the form of a theophany, which is fulfilled before his mental eye; hence יבוא does not describe what is future, as being absolutely so, but is something progressively unfolding itself from the present onwards, which we should express by the present tense. The coming one is called Eloah (not Jehovah, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 33:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and the imitation in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 5:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), a form of the name Elohim which only occurs in poetry in the earlier Hebrew writings, which we find for the first time in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 32:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where it is used of God as the Creator of Israel, and which is also used here to designate God as the Lord and Governor of the whole world. Eloah, however, comes as the Holy One (qâdōsh), who cannot tolerate sin (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 1:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and who will judge the world and destroy the sinners (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 3:12-14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). As Eloah and Qâdōsh are names of one God; so \"from Teman\" and \"from the mountain of Paran\" are expressions denoting, not two starting-points, but simply two localities of one single starting-point for His appearance, like Seir and the mountains of Paran in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 33:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Instead of Seir, the poetical name of the mountainous country of the Edomites, Teman, the southern district of Edomitish land, is used per synecdochen for Idumaea generally, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Obadiah 1:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 1:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (see p. 168). The mountains of Paran are not the Et-Tih mountains, which bounded the desert of Paran towards the south, but the high mountain-land which formed the eastern half of that desert, and the northern portion of which is now called, after its present inhabitants, the mountains of the Azazimeh (see comm. on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 10:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). The two localities lie opposite to one another, and are only separated by the Arabah (or deep valley of the Ghor). We are not to understand the naming of these two, however, as suggesting the idea that God was coming from the Arabah, but, according to the original passage in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 33:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", as indicating that the splendour of the divine appearance spread over Teman and the mountains of Paran, so that the rays were reflected from the two mountainous regions. The word Selâh does not form part of the subject-matter of the text, but shows that the music strikes in here when the song is used in the temple, taking up the lofty thought that God is coming, and carrying it out in a manner befitting the majestic appearance, in the prospect of the speedy help of the Lord. The word probably signified elevatio, from sâlâh  equals  sâlal, and was intended to indicate the strengthening of the musical accompaniment, by the introduction, as is supposed, of a blast from the trumpets blown by the priests, corresponding therefore to the musical forte. (For further remarks, see Hvernick's Introduction to the Old Testament, iii. p. 120ff., and Delitzsch on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 3:1-8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".) In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 3:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the glory of the coming of God is depicted with reference to its extent, and in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 3:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " with reference to its intensive power. The whole creation is covered with its splendour. Heaven and earth reflect the glory of the coming one. הודו, His splendour or majesty, spreads over the whole heaven, and His glory over the earth. Tehillâh does not mean the praise of the earth, i.e., of its inhabitants, where (Chald., Ab. Ezr., Ros., and others); for there is no allusion to the manner in which the coming of God is received, and according to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Habakkuk 3:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " it fills the earth with trembling; but it denotes the object of the praise or fame, the glory, ἡ δόξα, like hâdâr in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 40:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", or kâbhōd in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 6:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 42:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 14:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Grammatically considered, תּהלּתו is the accusative governed by מלאה, and הארץ is the subject. ",
            "children": []
          }
        ]
      }
    ]
  }
]