[{"header":"Passover Is Celebrated"},{"num":35,"verse":"Josiah commanded that Passover be celebrated in Jerusalem to honor the Lord. So, on the fourteenth day of the first month, the lambs were killed for the Passover celebration."},{"num":2,"verse":"On that day, Josiah made sure the priests knew what duties they were to do in the temple. "},{"num":3,"verse":"He called together the Levites who served the Lord and who taught the people his laws, and he said:"},{"num":7,"verse":"Josiah donated thirty thousand sheep and goats, and three thousand bulls from his own flocks and herds for the people to offer as sacrifices. "},{"num":8,"verse":"Josiah’s officials also voluntarily gave some of their animals to the people, the priests, and the Levites as sacrifices. Hilkiah, Zechariah, and Jehiel, who were the officials in charge of the temple, gave the priests twenty-six hundred sheep and lambs and three hundred bulls to sacrifice during the Passover celebration. "},{"num":9,"verse":"Conaniah, his two brothers Shemaiah and Nethanel, as well as Hashabiah, Jeiel, and Jozabad were leaders of the Levites, and they gave the other Levites five thousand sheep and goats, and five hundred bulls to offer as sacrifices."},{"num":10,"verse":"When everything was ready to celebrate Passover, the priests and the Levites stood where Josiah had told them. "},{"num":11,"verse":"Then the Levites killed and skinned the Passover lambs, and they handed some of the blood to the priests, who splattered it on the altar. "},{"num":12,"verse":"The Levites set aside the parts of the animal that the worshipers needed for their sacrifices to please the Lord, just as the Law of Moses required. They also did the same thing with the bulls. "},{"num":13,"verse":"They sacrificed the Passover animals on the altar and boiled the meat for the other offerings in pots, kettles, and pans. Then they quickly handed the meat to the people so they could eat it."},{"num":14,"verse":"All day long, the priests were busy offering sacrifices and burning the animals' fat on the altar. And when everyone had finished, the Levites prepared Passover animals for themselves and for the priests."},{"num":15,"verse":"During the celebration some of the Levites prepared Passover animals for the musicians and the guards, so that the Levite musicians would not have to leave their places, which had been assigned to them according to the instructions of David, Asaph, Heman, and Jeduthun the king’s prophet. Even the guards at the temple gates did not have to leave their posts."},{"num":16,"verse":"So on that day, Passover was celebrated to honor the Lord, and sacrifices were offered on the altar to him, just as Josiah had commanded. "},{"num":17,"verse":"The worshipers then celebrated the Festival of Thin Bread for the next seven days."},{"num":18,"verse":"People from Jerusalem and from towns all over Judah and Israel were there. Passover had not been observed like this since the days of Samuel the prophet. In fact, this was the greatest Passover celebration in Israel’s history! "},{"num":19,"verse":"All these things happened in the eighteenth year of Josiah’s rule in Judah."},{"header":"Josiah Dies in Battle"},{"num":20,"verse":"Some time later, King Neco of Egypt led his army to the city of Carchemish on the Euphrates River. And Josiah led his troops north to meet the Egyptians in battle."},{"num":21,"verse":"Neco sent the following message to Josiah:"},{"num":22,"verse":"But Josiah ignored Neco’s warning, even though it came from God! Instead, he disguised himself and marched into battle against Neco in the valley near Megiddo."},{"num":23,"verse":"During the battle an Egyptian soldier shot Josiah with an arrow. Josiah told his servants, “Get me out of here! I’ve been hit.” "},{"num":24,"verse":"They carried Josiah out of his chariot, then put him in the other chariot he had there and took him back to Jerusalem, where he soon died. He was buried beside his ancestors, and everyone in Judah and Jerusalem mourned his death."},{"num":25,"verse":"Jeremiah the prophet wrote a funeral song in honor of Josiah. And since then, anyone in Judah who mourns the death of Josiah sings that song. It is included in the collection of funeral songs."},{"num":26,"verse":"Everything else Josiah did while he was king, including how he faithfully obeyed the Lord, "},{"num":27,"verse":"is written in The History of the Kings of Israel and Judah."}]