[{"header":"Celebration of the Passover"},{"num":35,"verse":"Josiah kept a passover to the Lord in Jerusalem; they slaughtered the passover lamb on the fourteenth day of the first month. "},{"num":2,"verse":"He appointed the priests to their offices and encouraged them in the service of the house of the Lord. "},{"num":3,"verse":"He said to the Levites who taught all Israel and who were holy to the Lord, ‘Put the holy ark in the house that Solomon son of David, king of Israel, built; you need no longer carry it on your shoulders. Now serve the Lord your God and his people Israel. "},{"num":4,"verse":"Make preparations by your ancestral houses by your divisions, following the written directions of King David of Israel and the written directions of his son Solomon. "},{"num":5,"verse":"Take position in the holy place according to the groupings of the ancestral houses of your kindred the people, and let there be Levites for each division of an ancestral house. "},{"num":6,"verse":"Slaughter the passover lamb, sanctify yourselves, and on behalf of your kindred make preparations, acting according to the word of the Lord by Moses.’"},{"num":7,"verse":"Then Josiah contributed to the people, as passover offerings for all that were present, lambs and kids from the flock to the number of thirty thousand, and three thousand bulls; these were from the king’s possessions. "},{"num":8,"verse":"His officials contributed willingly to the people, to the priests, and to the Levites. Hilkiah, Zechariah, and Jehiel, the chief officers of the house of God, gave to the priests for the passover offerings two thousand six hundred lambs and kids and three hundred bulls. "},{"num":9,"verse":"Conaniah also, and his brothers Shemaiah and Nethanel, and Hashabiah and Jeiel and Jozabad, the chiefs of the Levites, gave to the Levites for the passover offerings five thousand lambs and kids and five hundred bulls."},{"num":10,"verse":"When the service had been prepared for, the priests stood in their place, and the Levites in their divisions according to the king’s command. "},{"num":11,"verse":"They slaughtered the passover lamb, and the priests dashed the blood that they received from them, while the Levites did the skinning. "},{"num":12,"verse":"They set aside the burnt-offerings so that they might distribute them according to the groupings of the ancestral houses of the people, to offer to the Lord, as it is written in the book of Moses. And they did the same with the bulls. "},{"num":13,"verse":"They roasted the passover lamb with fire according to the ordinance; and they boiled the holy offerings in pots, in cauldrons, and in pans, and carried them quickly to all the people. "},{"num":14,"verse":"Afterwards they made preparations for themselves and for the priests, because the priests the descendants of Aaron were occupied in offering the burnt-offerings and the fat parts until night; so the Levites made preparations for themselves and for the priests, the descendants of Aaron. "},{"num":15,"verse":"The singers, the descendants of Asaph, were in their place according to the command of David, and Asaph, and Heman, and the king’s seer Jeduthun. The gatekeepers were at each gate; they did not need to interrupt their service, for their kindred the Levites made preparations for them."},{"num":16,"verse":"So all the service of the Lord was prepared that day, to keep the passover and to offer burnt-offerings on the altar of the Lord, according to the command of King Josiah. "},{"num":17,"verse":"The people of Israel who were present kept the passover at that time, and the festival of unleavened bread for seven days. "},{"num":18,"verse":"No passover like it had been kept in Israel since the days of the prophet Samuel; none of the kings of Israel had kept such a passover as was kept by Josiah, by the priests and the Levites, by all Judah and Israel who were present, and by the inhabitants of Jerusalem. "},{"num":19,"verse":"In the eighteenth year of the reign of Josiah this passover was kept."},{"header":"Defeat by Pharaoh Neco and Death of Josiah"},{"num":20,"verse":"After all this, when Josiah had set the temple in order, King Neco of Egypt went up to fight at Carchemish on the Euphrates, and Josiah went out against him. "},{"num":21,"verse":"But Neco sent envoys to him, saying, ‘What have I to do with you, king of Judah? I am not coming against you today, but against the house with which I am at war; and God has commanded me to hurry. Cease opposing God, who is with me, so that he will not destroy you.’ "},{"num":22,"verse":"But Josiah would not turn away from him, but disguised himself in order to fight with him. He did not listen to the words of Neco from the mouth of God, but joined battle in the plain of Megiddo. "},{"num":23,"verse":"The archers shot King Josiah; and the king said to his servants, ‘Take me away, for I am badly wounded.’ "},{"num":24,"verse":"So his servants took him out of the chariot and carried him in his second chariot and brought him to Jerusalem. There he died, and was buried in the tombs of his ancestors. All Judah and Jerusalem mourned for Josiah. "},{"num":25,"verse":"Jeremiah also uttered a lament for Josiah, and all the singing-men and singing-women have spoken of Josiah in their laments to this day. They made these a custom in Israel; they are recorded in the Laments. "},{"num":26,"verse":"Now the rest of the acts of Josiah and his faithful deeds in accordance with what is written in the law of the Lord, "},{"num":27,"verse":"and his acts, first and last, are written in the Book of the Kings of Israel and Judah."}]