[{"header":"Do Not Wait to Be Saved from the Punishment of Sin"},{"num":2,"verse":"That is why we must listen all the more to the truths we have been told. If we do not, we may slip away from them. "},{"num":2,"verse":"These truths given by the angels proved to be true. People were punished when they did not obey them. "},{"num":3,"verse":"God was so good to make a way for us to be saved from the punishment of sin. What makes us think we will not go to hell if we do not take the way to heaven that He has made for us? The Lord was the first to tell us of this. Then those who heard Him told it later. "},{"num":4,"verse":"God proved what they said was true by showing us special things to see and by doing powerful works. He gave the gifts of the Holy Spirit as He wanted to."},{"header":"Jesus, the Way to Heaven"},{"num":5,"verse":"God did not make angels to be the leaders of that world to come which we have been speaking about. "},{"num":6,"verse":"Instead, the Holy Writings say, “What is man that You think of him and the son of man that You should remember him?”  "},{"num":7,"verse":"“You made him so he took a place that was not as important as the angels for a little while. You gave him the crown of honor and shining-greatness. *You made him the head over everything You have made. "},{"num":8,"verse":"You have put everything under his feet.”  There is nothing that does not obey him, but we do not see all things obey him yet. "},{"num":9,"verse":"But we do see Jesus. For a little while He took a place that was not as important as the angels. But God had loving-favor for everyone. He had Jesus suffer death on a cross for all of us. Then, because of Christ’s death on a cross, God gave Him the crown of honor and shining-greatness."},{"num":10,"verse":"God made all things. He made all things for Himself. It was right for God to make Jesus a perfect Leader by having Him suffer for men’s sins. In this way, He is bringing many men to share His shining-greatness. "},{"num":11,"verse":"Jesus makes men holy. He takes away their sins. Both Jesus and the ones being made holy have the same Father. That is why Jesus is not ashamed to call them His brothers. "},{"num":12,"verse":"Jesus is saying to His Father, “I will tell My brothers Your name. I will sing songs of thanks for You among the people.”  "},{"num":13,"verse":"And again He says, “I will put My trust in God.” At another time He said, “Here I am with the children God gave Me.” "},{"num":14,"verse":"It is true that we share the same Father with Jesus. And it is true that we share the same kind of flesh and blood because Jesus became a man like us. He died as we must die. Through His death He destroyed the power of the devil who has the power of death. "},{"num":15,"verse":"Jesus did this to make us free from the fear of death. We no longer need to be chained to this fear. "},{"num":16,"verse":"Jesus did not come to help angels. Instead, He came to help men who are of Abraham’s family. "},{"num":17,"verse":"So Jesus had to become like His brothers in every way. He had to be one of us to be our Religious Leader to go between God and us. He had loving-pity on us and He was faithful. He gave Himself as a gift to die on a cross for our sins so that God would not hold these sins against us any longer. "},{"num":18,"verse":"Because Jesus was tempted as we are and suffered as we do, He understands us and He is able to help us when we are tempted."}]