[{"num":2,"verse":"Therefore we ought to give the more heed to the things that we have heard, lest we perish. "},{"num":2,"verse":"For if the word that was spoken by angels was sure, so that every transgression and disobedience received a just recompense in reward, "},{"num":3,"verse":"how shall we escape if we neglect so great a salvation? – which at the first began to be preached by the Lord himself, and afterward was confirmed to us by those who heard it, "},{"num":4,"verse":"God bearing witness to it both with signs and wonders also, and with divers miracles, and gifts of the Holy Spirit according to his own will."},{"num":5,"verse":"It is not to the angels that he has put in subjection the world to come, of which we speak. "},{"num":6,"verse":"But one in a certain place witnesses, saying, What is man, that you are mindful of him? "},{"num":7,"verse":"After you had for a season made him lower than the angels, you crowned him with honour and glory, and have set him above the works of your hands. "},{"num":8,"verse":"You have put all things in subjection under his feet."},{"num":9,"verse":"Nevertheless, we do not yet see all things subdued, but we see him who was made less than the angels. We see that it was Jesus who is crowned with glory and honour for the suffering of death: that he, by the grace of God, was to taste of death for all men."},{"num":10,"verse":"For it was fitting for him, for whom all things are and by whom all things are, in accordance with the way that he brought many sons to glory, to make the Lord of their salvation perfect through suffering. "},{"num":11,"verse":"For he who sanctifies and those who are sanctified are all of one, for which sake he is not ashamed to call them brethren, "},{"num":12,"verse":"saying: I will declare your name to my brethren, and in the midst of the congregation I will praise you. "},{"num":13,"verse":"And again: I will put my trust in him. And again: Behold, here am I and the children that God has given me."},{"num":14,"verse":"Considering then that the children were partakers of flesh and blood, he also himself likewise took part with them, in order to put down through death him that had lordship over death – that is to say, the devil – "},{"num":15,"verse":"and to deliver those who through fear of death were all their lifetime subject to bondage. "},{"num":16,"verse":"For in no place does he take on him the angels, but he takes the seed of Abraham on him. "},{"num":17,"verse":"Therefore it was fitting for him to be made like his brethren in all things, so that he could be merciful, and a faithful high priest in things concerning God, in order to purge the people’s sins. "},{"num":18,"verse":"For in that he himself suffered and was tried, he is able to succour those who are tried."}]