[{"num":2,"verse":"So we must listen very carefully to the truths we have heard, or we may drift away from them. "},{"num":2,"verse":"For since the messages from angels have always proved true and people have always been punished for disobeying them, "},{"num":3,"verse":"what makes us think that we can escape if we are indifferent to this great salvation announced by the Lord Jesus himself and passed on to us by those who heard him speak?"},{"num":4,"verse":"God always has shown us that these messages are true by signs and wonders and various miracles and by giving certain special abilities from the Holy Spirit to those who believe; yes, God has assigned such gifts to each of us."},{"num":5,"verse":"And the future world we are talking about will not be controlled by angels. "},{"num":6,"verse":"No, for in the book of Psalms David says to God, “What is mere man that you are so concerned about him? And who is this Son of Man you honor so highly? "},{"num":7,"verse":"For though you made him lower than the angels for a little while, now you have crowned him with glory and honor. "},{"num":8,"verse":"And you have put him in complete charge of everything there is. Nothing is left out.”"},{"num":9,"verse":"but we do see Jesus—who for a while was a little lower than the angels—crowned now by God with glory and honor because he suffered death for us. Yes, because of God’s great kindness, Jesus tasted death for everyone in all the world."},{"num":10,"verse":"And it was right and proper that God, who made everything for his own glory, should allow Jesus to suffer, for in doing this he was bringing vast multitudes of God’s people to heaven; for his suffering made Jesus a perfect Leader, one fit to bring them into their salvation."},{"num":11,"verse":"We who have been made holy by Jesus, now have the same Father he has. That is why Jesus is not ashamed to call us his brothers. "},{"num":12,"verse":"For he says in the book of Psalms, “I will talk to my brothers about God my Father, and together we will sing his praises.” "},{"num":13,"verse":"At another time he said, “I will put my trust in God along with my brothers.” And at still another time, “See, here am I and the children God gave me.”"},{"num":14,"verse":"Since we, God’s children, are human beings—made of flesh and blood—he became flesh and blood too by being born in human form; for only as a human being could he die and in dying break the power of the devil who had the power of death. "},{"num":15,"verse":"Only in that way could he deliver those who through fear of death have been living all their lives as slaves to constant dread."},{"num":16,"verse":"We all know he did not come as an angel but as a human being—yes, a Jew. "},{"num":17,"verse":"And it was necessary for Jesus to be like us, his brothers, so that he could be our merciful and faithful High Priest before God, a Priest who would be both merciful to us and faithful to God in dealing with the sins of the people. "},{"num":18,"verse":"For since he himself has now been through suffering and temptation, he knows what it is like when we suffer and are tempted, and he is wonderfully able to help us."}]