[{"header":"Introduction"},{"num":1,"verse":"The words of Hilkiah’s son Jeremiah, who was one of the priests at Anathoth in the territory of Benjamin. "},{"num":2,"verse":"This message from the Lord came to him during the thirteenth year of the reign of Ammon’s son Josiah, the king of Judah, "},{"num":3,"verse":"and during the reign of Josiah’s son Jehoiakim, the king of Judah, and continued until the exile of Jerusalem in the fifth month, at the end of the eleventh year of the reign of Josiah’s son Zedekiah, the king of Judah."},{"header":"Jeremiah’s Call as a Prophet"},{"num":4,"verse":"This message from the Lord came to me:"},{"num":6,"verse":"I replied, “Ah, Lord God! Look, I don’t know how to speak, because I’m only a young man.”"},{"num":7,"verse":"Then the Lord told me, “Don’t say, ‘I’m only a young man,’ for you will go everywhere I send you, and you will speak everything I command you. "},{"num":8,"verse":"Don’t be afraid of them, because I am with you to deliver you,” declares the Lord."},{"num":9,"verse":"The Lord stretched out his hand, touched my mouth, and then told me, “Look, I’ve put my words in your mouth. "},{"num":10,"verse":"See, today I’ve appointed you to prophesy about nations and kingdoms, to pull up and tear down, to destroy and overthrow, to build and to plant.”"},{"header":"The Visions of the Almond Branch and Boiling Pot"},{"num":11,"verse":"This message from the Lord came to me, asking, “What do you see, Jeremiah?”"},{"num":12,"verse":"The Lord told me, “You have observed well, because I’m watching over my message, to make sure it comes about.”"},{"num":13,"verse":"This message from the Lord came to me a second time: “What do you see?”"},{"num":14,"verse":"Then the Lord told me, “From the north disaster will pour out on all who live in the land, "},{"num":15,"verse":"because I’m about to summon all the families and kingdoms from the north,” declares the Lord."},{"header":"The Lord’s Assurance to Jeremiah"},{"num":17,"verse":"“As for you, get ready! Stand up and tell them everything that I’ve commanded you. Don’t be frightened as you face them, or I’ll frighten you right in front of them."},{"num":18,"verse":"“As for me, today I’m making you a fortified city, an iron pillar, and a bronze wall against the whole land—against the kings of Judah, against its princes, against its priests, and against the people of the land. "},{"num":19,"verse":"They’ll fight against you, but they won’t prevail against you, because I am with you,” declares the Lord, “to deliver you.”"}]