[{"header":"The Message to Sardis"},{"num":3,"verse":"“To the angel of the church in Sardis write:"},{"num":2,"verse":"So wake up, and strengthen what you still have before it dies completely. For I find that what you have done is not yet perfect in the sight of my God. "},{"num":3,"verse":"Remember, then, what you were taught and what you heard; obey it and turn from your sins. If you do not wake up, I will come upon you like a thief, and you will not even know the time when I will come. "},{"num":4,"verse":"But a few of you there in Sardis have kept your clothes clean. You will walk with me, clothed in white, because you are worthy to do so. "},{"num":5,"verse":"Those who win the victory will be clothed like this in white, and I will not remove their names from the book of the living. In the presence of my Father and of his angels I will declare openly that they belong to me."},{"num":6,"verse":"“If you have ears, then, listen to what the Spirit says to the churches!"},{"header":"The Message to Philadelphia"},{"num":7,"verse":"“To the angel of the church in Philadelphia write:"},{"num":8,"verse":"I know what you do; I know that you have a little power; you have followed my teaching and have been faithful to me. I have opened a door in front of you, which no one can close. "},{"num":9,"verse":"Listen! As for that group that belongs to Satan, those liars who claim that they are Jews but are not, I will make them come and bow down at your feet. They will all know that I love you. "},{"num":10,"verse":"Because you have kept my command to endure, I will also keep you safe from the time of trouble which is coming upon the world to test all the people on earth. "},{"num":11,"verse":"I am coming soon. Keep safe what you have, so that no one will rob you of your victory prize. "},{"num":12,"verse":"I will make those who are victorious pillars in the temple of my God, and they will never leave it. I will write on them the name of my God and the name of the city of my God, the new Jerusalem, which will come down out of heaven from my God. I will also write on them my new name."},{"num":13,"verse":"“If you have ears, then, listen to what the Spirit says to the churches!"},{"header":"The Message to Laodicea"},{"num":14,"verse":"“To the angel of the church in Laodicea write:"},{"num":15,"verse":"I know what you have done; I know that you are neither cold nor hot. How I wish you were either one or the other! "},{"num":16,"verse":"But because you are lukewarm, neither hot nor cold, I am going to spit you out of my mouth! "},{"num":17,"verse":"You say, ‘I am rich and well off; I have all I need.’ But you do not know how miserable and pitiful you are! You are poor, naked, and blind. "},{"num":18,"verse":"I advise you, then, to buy gold from me, pure gold, in order to be rich. Buy also white clothing to dress yourself and cover up your shameful nakedness. Buy also some ointment to put on your eyes, so that you may see. "},{"num":19,"verse":"I rebuke and punish all whom I love. Be in earnest, then, and turn from your sins. "},{"num":20,"verse":"Listen! I stand at the door and knock; if any hear my voice and open the door, I will come into their house and eat with them, and they will eat with me. "},{"num":21,"verse":"To those who win the victory I will give the right to sit beside me on my throne, just as I have been victorious and now sit by my Father on his throne."},{"num":22,"verse":"“If you have ears, then, listen to what the Spirit says to the churches!”"}]