[{"header":"(v) To the sleeping Church"},{"num":1,"verse":"“Write this to the angel of the Church in Sardis: ‘These are the words of him who holds in his hand the seven Spirits of God and the seven stars: I know what you have done, that you have a reputation for being alive, but that in fact you are dead. Now wake up! Strengthen what you still have before it dies! For I have not found any of your deeds complete in the sight of my God. Remember then what you were given and what you were taught. Hold to those things and repent. If you refuse to wake up, then I will come to you like a thief, and you will have no idea of the hour of my coming."},{"num":4,"verse":"Yet you still have a few names in Sardis of people who have not soiled their garments. They shall walk with me in white, for they have deserved to do so. The victorious shall wear such white garments, and never will I erase his name from the book of life. Indeed, I will speak his name openly in the presence of my Father and of his angels. Let the listener hear what the Spirit says to the Churches."},{"header":"(vi) To the Church with opportunity"},{"num":7,"verse":"“Then write this to the angel of the Church in Philadelphia: These are the words of the holy one and the true, ‘He who has the key of David. He who opens and no one shuts, and shuts and no one opens’."},{"num":8,"verse":"I know what you have done. See, I have given you a door flung wide open, which no man can close! For you have some little power and have been faithful to my message and have not denied my name. See how I deal with those of Satan’s synagogue, who claim to be Jews, yet are no Jews but liars! Watch how I make them come and bow down before your feet and acknowledge that I have loved you. Because you have obeyed my call to patient endurance I will keep you safe from the hour of trial which is to come upon the whole world, to test all who live upon the earth. I am coming soon; hold fast to what you have—let no one deprive you of your crown. As for the victorious, I will make him a pillar in the Temple of my God, and he will never leave it. I will write upon him the name of my God, and the name of the city of my God, the new Jerusalem which comes down out of Heaven from my God. And I will write upon him my own new name. Let the listener hear what the Spirit says to the Churches."},{"header":"(vii) To the complacent church"},{"num":14,"verse":"“Then write this to the angel of the Church in Laodicea: ‘These are the words of the Amen, the faithful and true witness, the beginning of God’s creation: I know what you have done, and that you are neither cold nor hot. I could wish that you were either cold or hot! but since you are lukewarm and neither hot nor cold, I intend to spit you out of my mouth! While you say, ‘I am rich, I have prospered, and there is nothing that I need’, you have no eyes to see that you are wretched, pitiable, poverty-stricken, blind and naked. My advice to you is to buy from me that gold which is purified in the furnace so that you may be rich, and white garments to wear so that you may hide the shame of your nakedness, and salve to put on your eyes to make you see. All those whom I love I correct and discipline. Therefore, shake off your complacency and repent. See, I stand knocking at the door. If anyone listens to my voice and opens the door, I will go into his house, and dine with him, and he with me. As for the victorious, I will give him the honour of sitting beside me on my throne, just as I myself have won the victory and have taken my seat beside my Father on his throne. Let the listener hear what the spirit says to the Churches.”"}]