[{"num":3,"verse":"And write to the angel of the Church which is at Sardis: “These things say He Who has the seven spirits of God, and the seven stars: ‘I know your works. For you have the reputation that you live, but you are dead."},{"num":2,"verse":"‘Be awake! And strengthen the things which remain that are ready to die! For I have not found your work perfect before God."},{"num":3,"verse":"‘Therefore, remember what you have received and heard. And hold fast and repent. If, therefore, you will not watch, I will come on you as a thief. And you shall not know what hour I will come upon you."},{"num":4,"verse":"‘Notwithstanding, you still have a few names in Sardis who have not defiled their garments. And they shall walk with Me in white. For they are worthy."},{"num":5,"verse":"‘He who overcomes shall be clothed in white array. And I will not blot his name out from the Book of Life. But I will confess his name before My Father, and before His angels."},{"num":6,"verse":"‘Let him who has an ear, hear what the Spirit says to the Churches.’”"},{"num":7,"verse":"“And write to the angel of the Church which is of Philadelphia: ‘These things say He Who is Holy and True; Who has the key of David which opens and no man shuts, and shuts and no man opens."},{"num":8,"verse":"‘I know your works. Behold, I have set before you an open door. And no one can shut it. For you have a little strength and have kept my word and have not denied my Name."},{"num":9,"verse":"‘Behold, I will make them of the synagogue of Satan; who call themselves Jews and are not; but lie. Behold, I say, I will make them come and worship before your feet. And they shall know that I have loved you."},{"num":10,"verse":"‘Because you have kept the word of my patience, therefore I will deliver you from the hour of trial, which will come upon all the world to try those who dwell upon the earth."},{"num":11,"verse":"‘Behold, I come shortly. Hold that which you have, so that no one take your crown."},{"num":12,"verse":"‘He who overcomes I will make a pillar in the Temple of My God, and he shall go out no more. And I will write upon him the Name of My God, and the name of the city of My God, which is the New Jerusalem; which comes down out of Heaven from My God. And I will write upon him My new Name."},{"num":13,"verse":"‘Let he who has an ear, hear what the Spirit says to the Churches.’”"},{"num":14,"verse":"“And to the angel of the Church of the Laodiceans write: ‘These things says the Amen; the faithful and true Witness; the beginning of the creatures of God."},{"num":15,"verse":"‘I know your works, that you are neither cold nor hot. I desire that you were either cold or hot."},{"num":16,"verse":"‘Therefore, because you are lukewarm - and neither cold nor hot – I am about to spew you out of My mouth."},{"num":17,"verse":"‘For you say, “I am rich, and increased with goods, and have need of nothing,” and do not know how wretched and miserable you are, and poor and blind and naked."},{"num":18,"verse":"‘I counsel you to buy from Me gold tried by the fire, so that you may be made rich; and white raiment, so that you may be clothed and that your filthy nakedness does not appear. And anoint your eyes with eye salve, so that you may see."},{"num":19,"verse":"‘As many as I love, I rebuke and chasten. Be zealous, therefore, and repent."},{"num":20,"verse":"‘Behold, I stand at the door and knock. If anyone hears My voice, and opens the door, I will come in to him, and will sup with him, and he with Me."},{"num":21,"verse":"‘To him who overcomes I will grant to sit with Me on My throne, even as I overcame and sit with My Father on His throne."},{"num":22,"verse":"‘Let he who has an ear, hear what the Spirit says to the Churches.’”"}]