[{"num":3,"verse":"And these are the generations of Aaron and Moses in the day that Jehovah spoke with Moses on mount Sinai."},{"num":2,"verse":"And these are the names of the sons of Aaron: Nadab the firstborn, and Abihu, Eleazar and Ithamar."},{"num":3,"verse":"These are the names of the sons of Aaron, the anointed priests, who were consecrated to exercise the priesthood."},{"num":4,"verse":"And Nadab and Abihu died before Jehovah when they offered strange fire before Jehovah in the wilderness of Sinai, and they had no sons; and Eleazar and Ithamar exercised the priesthood in the presence of Aaron their father."},{"num":5,"verse":"And Jehovah spoke to Moses, saying,"},{"num":6,"verse":"Bring the tribe of Levi near, and present them before Aaron the priest, that they may minister unto him;"},{"num":7,"verse":"and they shall keep his charge, and the charge of the whole assembly, before the tent of meeting, to do the service of the tabernacle."},{"num":8,"verse":"And they shall keep all the utensils of the tent of meeting, and the charge of the children of Israel, to do the service of the tabernacle."},{"num":9,"verse":"And thou shalt give the Levites to Aaron and to his sons: they are wholly given to him out of the children of Israel."},{"num":10,"verse":"And Aaron and his sons shalt thou appoint that they may attend to their priest's office; and the stranger that cometh near shall be put to death."},{"num":11,"verse":"And Jehovah spoke to Moses, saying,"},{"num":12,"verse":"And I, behold, I have taken the Levites from among the children of Israel instead of every firstborn that breaketh open the womb among the children of Israel, and the Levites shall be mine;"},{"num":13,"verse":"for every firstborn is mine. On the day that I smote all the firstborn in the land of Egypt, I hallowed unto me all the firstborn in Israel, both of man and beast; mine shall they be: I am Jehovah."},{"num":14,"verse":"And Jehovah spoke to Moses in the wilderness of Sinai, saying,"},{"num":15,"verse":"Number the sons of Levi according to their fathers' houses, after their families; every male from a month old and upward shalt thou number them."},{"num":16,"verse":"And Moses numbered them, according to the commandment of Jehovah,—as he had been commanded."},{"num":17,"verse":"And these are the sons of Levi by their names: Gershon, and Kohath, and Merari."},{"num":18,"verse":"And these are the names of the sons of Gershon according to their families: Libni and Shimei."},{"num":19,"verse":"And the sons of Kohath according to their families: Amram and Izhar, Hebron and Uzziel."},{"num":20,"verse":"And the sons of Merari according to their families: Mahli and Mushi. These are the families of the Levites according to their fathers' houses."},{"num":21,"verse":"Of Gershon, the family of the Libnites, and the family of the Shimites: these are the families of the Gershonites."},{"num":22,"verse":"Those that were numbered of them, according to the number of all the males, from a month old and upward, those that were numbered of them were seven thousand five hundred."},{"num":23,"verse":"The families of the Gershonites encamped behind the tabernacle westward."},{"num":24,"verse":"And the prince of the father's house of the Gershonites was Eliasaph the son of Lael."},{"num":25,"verse":"And the charge of the sons of Gershon in the tent of meeting was: the tabernacle and the tent, its covering, and the curtain of the entrance to the tent of meeting."},{"num":26,"verse":"And the hangings of the court, and the curtain of the entrance to the court, which surrounds the tabernacle and the altar, and the cords thereof for all its service."},{"num":27,"verse":"And of Kohath, the family of the Amramites, and the family of the Izharites, and the family of the Hebronites, and the family of the Uzzielites: these are the families of the Kohathites."},{"num":28,"verse":"According to the number of all the males, from a month old and upward, there were eight thousand six hundred, who kept the charge of the sanctuary."},{"num":29,"verse":"The families of the sons of Kohath encamped on the side of the tabernacle southward."},{"num":30,"verse":"And the prince of the father's house of the families of the Kohathites was Elizaphan the son of Uzziel."},{"num":31,"verse":"And their charge was the ark, and the table, and the candlestick, and the altars, and the utensils of the sanctuary with which they ministered, and the curtain, and all that belongs to its service."},{"num":32,"verse":"And the prince of princes of the Levites was Eleazar the son of Aaron the priest: he had the oversight of them that kept the charge of the sanctuary."},{"num":33,"verse":"Of Merari was the family of the Mahlites, and the family of the Mushites: these are the families of Merari."},{"num":34,"verse":"And those that were numbered of them, according to the number of all the males, from a month old and upward, were six thousand two hundred."},{"num":35,"verse":"And the prince of the father's house of the families of Merari was Zuriel the son of Abihail. They encamped on the side of the tabernacle northward."},{"num":36,"verse":"And the charge of the sons of Merari consisted in the oversight of the boards of the tabernacle, and its bars, and its pillars, and its bases, and all its furniture, and all that belongs to its service,"},{"num":37,"verse":"and the pillars of the court round about, and their bases, and their pegs, and their cords."},{"num":38,"verse":"And those who encamped before the tabernacle eastward, before the tent of meeting toward the sunrising, were Moses, and Aaron and his sons, who kept the charge of the sanctuary for the charge of the children of Israel; and the stranger that cometh near shall be put to death."},{"num":39,"verse":"All that were numbered of the Levites, whom Moses and Aaron numbered at the commandment of Jehovah, according to their families, all the males from a month old and upward, were twenty-two thousand."},{"num":40,"verse":"And Jehovah said to Moses, Number all the first-born males of the children of Israel from a month old and upward, and take the number of their names."},{"num":41,"verse":"And thou shalt take the Levites for me (I am Jehovah) instead of all the firstborn among the children of Israel; and the cattle of the Levites, instead of all the firstlings among the cattle of the children of Israel."},{"num":42,"verse":"And Moses numbered, as Jehovah had commanded him, all the firstborn among the children of Israel."},{"num":43,"verse":"And all the firstborn males, by the number of the names, from a month old and upward, according to their numbering, were twenty-two thousand two hundred and seventy-three."},{"num":44,"verse":"And Jehovah spoke to Moses, saying,"},{"num":45,"verse":"Take the Levites instead of all the firstborn among the children of Israel, and the cattle of the Levites instead of their cattle; and the Levites shall be mine: I am Jehovah."},{"num":46,"verse":"And for those that are to be ransomed, the two hundred and seventy-three of the firstborn of the children of Israel, which are in excess over the Levites,"},{"num":47,"verse":"thou shalt take five shekels apiece by the poll, according to the shekel of the sanctuary shalt thou take them,—twenty gerahs the shekel;"},{"num":48,"verse":"and thou shalt give the money unto Aaron and unto his sons for those in excess among them who are to be ransomed."},{"num":49,"verse":"And Moses took the ransom-money from them that were over and above those who were ransomed by the Levites;"},{"num":50,"verse":"of the firstborn of the children of Israel he took the money, a thousand three hundred and sixty-five [shekels], according to the shekel of the sanctuary."},{"num":51,"verse":"And Moses gave the money of them that were ransomed to Aaron and to his sons, according to the commandment of Jehovah,—as Jehovah had commanded Moses."}]