[{"num":3,"verse":"These be the generations of Aaron and of Moses, in the day in which the Lord spake to Moses, in the hill of Sinai. (These be the generations of Aaron and of Moses, on the day in which the Lord spoke to Moses, on Mount Sinai.)"},{"num":2,"verse":"And these be the names of the sons of Aaron; his first engendered, Nadab (Nadab, his first-born); afterward, Abihu, and Eleazar, and Ithamar;"},{"num":3,"verse":"these be the names of Aaron’s sons, (the) priests, that were anointed, and whose hands were [ful]filled and hallowed, that they should be set in priesthood. (these be the names of Aaron’s sons, the priests, who were anointed, and consecrated, so that they could be installed, or ordained, in the priesthood.)"},{"num":4,"verse":"Nadab and Abihu [died], when they offered alien fire in the sight of the Lord, in the desert of Sinai, (and they) were dead without free children; and Eleazar and Ithamar were set in priesthood before Aaron their father. (But then Nadab and Abihu were killed, when they offered unholy fire before the Lord, in the Sinai Desert, and they died before having any children; and so Eleazar and Ithamar were ordained in the priesthood in the sight of their father Aaron.)"},{"num":5,"verse":"And the Lord spake to Moses, saying,"},{"num":6,"verse":"Present thou the lineage of Levi, and make it to stand in the sight of Aaron, the priest, that they minister to him; (Present thou the tribe of Levi, and make them to stand before Aaron, the priest, to serve him;)"},{"num":7,"verse":"and (to stand) watch, and that they keep whatever thing pertaineth to the religion of the multitude, before the tabernacle of witnessing; (and to keep charge, and to do whatever thing pertaineth to the service of the multitude, in the Tabernacle of the Witnessing;)"},{"num":8,"verse":"and that they keep (charge of) the vessels of the tabernacle, and serve in the service of it."},{"num":9,"verse":"And thou shalt give by free gift the Levites to Aaron and to his sons, to whom they be given (out) of the sons of Israel. (And thou shalt give the Levites as a gift to Aaron and his sons, to whom they be given from all the Israelites.)"},{"num":10,"verse":"Soothly thou shalt ordain Aaron and his sons on the religion of priesthood; a stranger that nigheth for to minister, shall die. (And thou shalt ordain Aaron and his sons to serve in the priesthood; a stranger who cometh near to try to minister, shall be put to death.)"},{"num":11,"verse":"And the Lord spake to Moses, saying,"},{"num":12,"verse":"I have taken the Levites (out) of the sons of Israel for each first engendered (male) thing that openeth the womb in the sons of Israel; and the Levites shall be mine,"},{"num":13,"verse":"for each first engendered (male) thing is mine; since the time I smote the first engendered (male) thing in the land of Egypt, I have hallowed to me whatever (male) thing is born first in Israel (I have consecrated to myself whatever male is first-born in Israel); from man unto beast they be mine; I am the Lord."},{"num":14,"verse":"And the Lord spake to Moses in the desert of Sinai, and said,"},{"num":15,"verse":"Number thou the sons of Levi by their fathers’ houses, and by their families, each male from one month and above (every male one month of age and older)."},{"num":16,"verse":"[And] Moses numbered them, as the Lord commanded."},{"num":17,"verse":"And the sons of Levi were found, by their names, Gershon, and Kohath, and Merari;"},{"num":18,"verse":"the sons of Gershon were Libni, and Shimei;"},{"num":19,"verse":"the sons of Kohath were Amram, and Izhar, Hebron, and Uzziel;"},{"num":20,"verse":"and the sons of Merari were Mahli, and Mushi."},{"num":21,"verse":"Of Gershon were two families, (they) of Libni, and (they) of Shimei;"},{"num":22,"verse":"of which the people of male kind was numbered, from one month and above, seven thousand and five hundred. (of whom the number of the males, who were one month of age and older, was seven thousand and five hundred.)"},{"num":23,"verse":"These shall set tents behind the tabernacle at the west part, (They shall pitch their tents behind the Tabernacle, on the west side,)"},{"num":24,"verse":"under the prince Eliasaph, the son of Lael. (and their leader shall be Eliasaph, the son of Lael.)"},{"num":25,"verse":"And they shall have the keepings in the tabernacle of [the] bond of peace, the tabernacle itself, and the covering thereof, (and) the tent that is drawn before the gates of the covering of the witnessing of the bond of peace; (And they shall keep charge of the Tabernacle of the Covenant, that is, the Tabernacle itself, and its coverings, and the curtain which is hung at the entrance to the Tabernacle of the Covenant;)"},{"num":26,"verse":"and the curtains of the great entry, also the tent that is hanged in the entering of the great entry of the tabernacle, and whatever thing pertaineth to the use of the altar, the cords of the tabernacle, and to all the service thereof. (and the curtains for the courtyard all around the Tabernacle, and the curtain that is hung at the entrance to the courtyard, and whatever pertaineth to the use of the altar, and all the other things in the service thereof.)"},{"num":27,"verse":"The kindred of Kohath shall have the peoples of Amram, and of Izhar, and of Hebron, and of Uzziel; these be the families of Kohathites,"},{"num":28,"verse":"numbered by their names, all of male kind, from one month and above, eight thousand and six hundred. They shall have the keepings of the saintuary, (and the number of all the males, from one month of age and older, was eight thousand and six hundred. They shall keep charge of the holy things of the sanctuary,)"},{"num":29,"verse":"and they shall set their tents at the south coast thereof; (and they shall pitch their tents on its south side;)"},{"num":30,"verse":"and the prince of them shall be Elizaphan, the son of Uzziel. (and their leader shall be Elizaphan, the son of Uzziel.)"},{"num":31,"verse":"And they shall keep (charge of) the ark, and the table, and the candlestick, the altars, and the vessels of the saintuary in which it is served, and the veil, and all such manner purtenance. (And they shall keep charge of the Ark, that is, the Box containing the tablets of the Law, and the table, and the lamp-stand, and the altars, and the vessels of the sanctuary with which they shall serve, or they shall minister, and the Veil, and all the other things in the service thereof.)"},{"num":32,"verse":"Soothly the prince of princes of Levites shall be Eleazar, the son of Aaron, the priest; and he shall be upon the keepers of the keeping of the saintuary. (And the leader of the leaders of the Levites shall be Eleazar, the son of Aaron, the priest; and he shall be over those in charge of the sanctuary.)"},{"num":33,"verse":"And soothly of Merari shall be the peoples of Mahli, and of Mushi,"},{"num":34,"verse":"numbered by their names, all the male kind, from one month and above, six thousand and two hundred; (and the number of all the males, from one month of age and older, was six thousand and two hundred;)"},{"num":35,"verse":"the prince of them shall be Zuriel, the son of Abihail; they shall set their tents in the north coast. (their leader shall be Zuriel, the son of Abihail; and they shall pitch their tents on the north side of the Tabernacle.)"},{"num":36,"verse":"And under the keeping of them shall be the tables of the tabernacle, and the bars, and the pillars, and the foundaments of those, and all things that pertain to such adorning, (And the sons of Merari shall be in charge of the tables of the Tabernacle, and the bars, and the pillars, and their foundations, or their bases, and all the things in the service thereof,)"},{"num":37,"verse":"and the pillars of the great entry by compass (and the pillars all around the courtyard), with their bases, and the stakes with their cords."},{"num":38,"verse":"Forsooth Moses, and Aaron with his sons, shall set their tents before the tabernacle of [the] bond of peace, that is, at the east coast, and shall have the keeping of the saintuary, in the midst of the sons of Israel; whatever alien nigheth thereto, he shall die. (And Moses, and Aaron with his sons, shall pitch their tents in front of the Tabernacle of the Covenant, that is, on the east side, and they shall be in charge of the sanctuary, on behalf of the Israelites; and any stranger who cometh near to it, shall be put to death.)"},{"num":39,"verse":"All the Levites, which Moses and Aaron numbered, by the commandment of the Lord, by their families, in male kind, from one month and above, were two and twenty thousand. (And the number of all the Levites, whom Moses and Aaron listed, or registered, by the Lord’s command, by their families, all the males from one month of age and older, was twenty-two thousand.)"},{"num":40,"verse":"And the Lord said to Moses, Number thou the first begotten of male kind of the sons of Israel, from one month and above (from one month of age and older); and thou shalt have the sum, or the number, of them;"},{"num":41,"verse":"and thou shalt take the Levites to me for all the first begotten of the sons of Israel; I am the Lord; and thou shalt take their beasts (to me) for all the first begotten of the sons of Israel. (and thou shalt give me the Levites in place of all the first-born sons of the Israelites; I am the Lord; and thou shalt give me the beasts of the Levites in place of all the first-born male beasts of the Israelites.)"},{"num":42,"verse":"And as the Lord commanded, Moses numbered the first begotten (male) children of the sons of Israel;"},{"num":43,"verse":"and the males were by their names, from one month and above, two and twenty thousand two hundred and seventy and three. (and the number of the males, listed by their names, from one month of age and older, was twenty-two thousand and two hundred and seventy-three.)"},{"num":44,"verse":"And the Lord spake to Moses, and said,"},{"num":45,"verse":"Take thou the Levites for the first begotten of the sons of Israel, and take the beasts of the Levites for the beasts of them, and the Levites shall be mine; I am the Lord. (Now give me the Levites in place of all the first-born sons of the Israelites, and the beasts of the Levites in place of the first-born male beasts of the Israelites, and so the Levites shall be mine; I am the Lord.)"},{"num":46,"verse":"Forsooth in the price of two hundred and seventy and three persons, that pass the number of the Levites, of the first begotten (sons) of the sons of Israel, (And as payment to buy back the two hundred and seventy-three persons, of the first-born sons of the Israelites, who surpass the number of the Levites,)"},{"num":47,"verse":"thou shalt take five shekels by each head, at the measure of the saintuary (thou shalt take five shekels for each one, by the measure of the sanctuary); a shekel hath twenty halfpence;"},{"num":48,"verse":"and thou shalt give the money to Aaron and to his sons, the price of them that be numbered above (the number of the Levites). (and thou shalt give this money to Aaron and to his sons, as payment for those who be listed, or registered, above the number of the Levites.)"},{"num":49,"verse":"Therefore Moses took the money of them that were numbered above, and which they had again-bought of the Levites, (And so Moses took the money for the first-born sons of the Israelites, who surpassed the number of the Levites, and so had to be bought back, or ransomed, or redeemed,)"},{"num":50,"verse":"for the first begotten (sons) of the sons of Israel, a thousand three hundred and sixty and five of shekels, by the weight of the saintuary; (in all, a thousand and three hundred and sixty-five shekels, by the measure of the sanctuary;)"},{"num":51,"verse":"and he gave that money to Aaron and to his sons, by the word that the Lord commanded to him."}]