[{"header":"Psalm 107"},{"num":1,"verse":"O give thanks to the Lord, for He is good; for His mercy and loving-kindness endure forever!"},{"num":2,"verse":"Let the redeemed of the Lord say so, whom He has delivered from the hand of the adversary,"},{"num":3,"verse":"And gathered them out of the lands, from the east and from the west, from the north and from the [Red] Sea in the south."},{"num":4,"verse":"Some wandered in the wilderness in a solitary desert track; they found no city for habitation."},{"num":5,"verse":"Hungry and thirsty, they fainted; their lives were near to being extinguished."},{"num":6,"verse":"Then they cried to the Lord in their trouble, and He delivered them out of their distresses."},{"num":7,"verse":"He led them forth by the straight and right way, that they might go to a city where they could establish their homes."},{"num":8,"verse":"Oh, that men would praise [and confess to] the Lord for His goodness and loving-kindness and His wonderful works to the children of men!"},{"num":9,"verse":"For He satisfies the longing soul and fills the hungry soul with good."},{"num":10,"verse":"Some sat in darkness and in the shadow of death, being bound in affliction and in irons,"},{"num":11,"verse":"Because they had rebelled against the words of God and spurned the counsel of the Most High."},{"num":12,"verse":"Therefore He bowed down their hearts with hard labor; they stumbled and fell down, and there was none to help."},{"num":13,"verse":"Then they cried to the Lord in their trouble, and He saved them out of their distresses."},{"num":14,"verse":"He brought them out of darkness and the shadow of death and broke apart the bonds that held them."},{"num":15,"verse":"Oh, that men would praise [and confess to] the Lord for His goodness and loving-kindness and His wonderful works to the children of men!"},{"num":16,"verse":"For He has broken the gates of bronze and cut the bars of iron apart."},{"num":17,"verse":"Some are fools [made ill] because of the way of their transgressions and are afflicted because of their iniquities."},{"num":18,"verse":"They loathe every kind of food, and they draw near to the gates of death."},{"num":19,"verse":"Then they cry to the Lord in their trouble, and He delivers them out of their distresses."},{"num":20,"verse":"He sends forth His word and heals them and rescues them from the pit and destruction."},{"num":21,"verse":"Oh, that men would praise [and confess to] the Lord for His goodness and loving-kindness and His wonderful works to the children of men!"},{"num":22,"verse":"And let them sacrifice the sacrifices of thanksgiving and rehearse His deeds with shouts of joy and singing!"},{"num":23,"verse":"Some go down to the sea and travel over it in ships to do business in great waters;"},{"num":24,"verse":"These see the works of the Lord and His wonders in the deep."},{"num":25,"verse":"For He commands and raises up the stormy wind, which lifts up the waves of the sea."},{"num":26,"verse":"[Those aboard] mount up to the heavens, they go down again to the deeps; their courage melts away because of their plight."},{"num":27,"verse":"They reel to and fro and stagger like a drunken man and are at their wits’ end [all their wisdom has come to nothing]."},{"num":28,"verse":"Then they cry to the Lord in their trouble, and He brings them out of their distresses."},{"num":29,"verse":"He hushes the storm to a calm and to a gentle whisper, so that the waves of the sea are still."},{"num":30,"verse":"Then the men are glad because of the calm, and He brings them to their desired haven."},{"num":31,"verse":"Oh, that men would praise [and confess to] the Lord for His goodness and loving-kindness and His wonderful works to the children of men!"},{"num":32,"verse":"Let them exalt Him also in the congregation of the people and praise Him in the company of the elders."},{"num":33,"verse":"He turns rivers into a wilderness, water springs into a thirsty ground,"},{"num":34,"verse":"A fruitful land into a barren, salt waste, because of the wickedness of those who dwell in it."},{"num":35,"verse":"He turns a wilderness into a pool of water and a dry ground into water springs;"},{"num":36,"verse":"And there He makes the hungry to dwell, that they may prepare a city for habitation,"},{"num":37,"verse":"And sow fields, and plant vineyards which yield fruits of increase."},{"num":38,"verse":"He blesses them also, so that they are multiplied greatly, and allows not their cattle to decrease."},{"num":39,"verse":"When they are diminished and bowed down through oppression, trouble, and sorrow,"},{"num":40,"verse":"He pours contempt upon princes and causes them to wander in waste places where there is no road."},{"num":41,"verse":"Yet He raises the poor and needy from affliction and makes their families like a flock."},{"num":42,"verse":"The upright shall see it and be glad, but all iniquity shall shut its mouth."},{"num":43,"verse":"Whoso is wise [if there be any truly wise] will observe and heed these things; and they will diligently consider the mercy and loving-kindness of the Lord."}]