[{"num":107,"verse":"Alleluia. Acknowledge ye to the Lord, for he is good; for his mercy is into the world. (Alleluia. Give ye thanks to the Lord, for he is good; for his love is forever.)"},{"num":2,"verse":"Say they, that be again-bought of the Lord; which he again-bought from the hand of the enemy, (Say they, who were redeemed by the Lord; whom he rescued from the power of the enemy,)"},{"num":3,"verse":"from countries he gathered them together. From the rising of the sun, and from the going down; from the north, and from the sea. (yea, he gathered them together from all the countries. From the rising of the sun, and from the going down of the same; from the north, and from the sea.)"},{"num":4,"verse":"They erred in wilderness, in a place without water; they found not way of the city of dwelling place. (They wandered about in the desert, in a place without water; they could not find the way to a city to live in.)"},{"num":5,"verse":"They were hungry and thirsty; their soul(s) failed in them."},{"num":6,"verse":"And they cried to the Lord, when they were set in tribulation; and he delivered them from their needinesses. (And they cried to the Lord, when they were in trouble; and he saved them from all their distress.)"},{"num":7,"verse":"And he led forth them into the right way; that they should go into the city of dwelling. (And he led them forth by the right way; so that they came to a city to live in.)"},{"num":8,"verse":"The mercies of the Lord, acknowledge to him; and his marvels acknowledge to the sons of men. (Give thanks to the Lord for his constant love; and for the marvellous deeds which he hath done, for the sons and daughters of men.)"},{"num":9,"verse":"For he [ful]filled a void man; and he filled with goods an hungry man. (For he fulfilleth the thirsty; and he filleth the hungry with good things to eat.)"},{"num":10,"verse":"God delivered men sitting in darkness, and in the shadow of death; and men imprisoned in beggary, and in iron(s)."},{"num":11,"verse":"For they made bitter the speeches of God; and wrathed the counsel of the Highest. (Because they had rebelled against the words of God; and had rejected the counsel of the Most High.)"},{"num":12,"verse":"And the heart of them was made meek in travails; and they were sick, and none was that helped (them). (And their hearts were made weary by their labour; and they were enfeebled, or weak, and there was no one to help them.)"},{"num":13,"verse":"And they cried to the Lord, when they were set in tribulation; and he delivered them from their needinesses. (And they cried to the Lord, when they were in trouble; and he saved them from all their distress.)"},{"num":14,"verse":"And he led them out of darknesses, and [the] shadow of death; and brake the bonds of them."},{"num":15,"verse":"The mercies of the Lord, acknowledge to him; and his marvels, acknowledge to the sons of men. (Give thanks to the Lord for his constant love; and for the marvellous deeds which he hath done, for the sons and daughters of men.)"},{"num":16,"verse":"For he all-brake [the] brazen gates; and he brake [the] iron bars. (For he broke all the bronze gates; and the iron bars.)"},{"num":17,"verse":"He up-took them from the way of their wickedness; for they were made low for their unrightfulnesses. (And some were fools, and they went forth in their wicked ways; and they were made low for their unrighteousnesses.)"},{"num":18,"verse":"The soul of them loathed all meat (They hated all kinds of food); and they nighed unto the gates of death."},{"num":19,"verse":"And they cried to the Lord, when they were set in tribulation; and he delivered them from their needinesses. (And they cried to the Lord, when they were in trouble; and he saved them from all their distress.)"},{"num":20,"verse":"He sent his word, and healed them; and delivered them from the perishings of them (and saved them from death)."},{"num":21,"verse":"The mercies of the Lord, acknowledge to him; and his marvels to the sons of men. (Give thanks to the Lord for his constant love; and for the marvellous deeds which he hath done, for the sons and daughters of men.)"},{"num":22,"verse":"And offer they the sacrifice of praising; and tell they his works with full out joying. (And offer they the sacrifice of praise; and tell they about his works with rejoicing.)"},{"num":23,"verse":"They that go down into the sea in ships; and make working in many waters. (And let others go down to the sea in ships; and do their work/and ply their trade in many waters.)"},{"num":24,"verse":"They saw the works of the Lord; and his marvels in the depth. (And they saw the works of the Lord; and his marvellous deeds in the depths of the sea.)"},{"num":25,"verse":"He said, and the spirit of tempest stood; and the waves thereof were areared. (He spoke, and the wind of the tempest stood still; and its waves were lifted up high.)"},{"num":26,"verse":"They ascend till to heavens, and go down unto the depths; the soul of them failed in evils. (They were lifted up to the heavens, and then brought down to the depths; and their souls failed because of their troubles, yea, they lost all hope, or all courage.)"},{"num":27,"verse":"They were troubled, and they were moved as a drunken man; and all the wisdom of them was devoured. (They were troubled, and they staggered around like drunken men; and all their wisdom, or all their skill, had fled.)"},{"num":28,"verse":"And they cried to the Lord, when they were set in tribulation; and he led them out of their needinesses. (And they cried to the Lord, when they were in trouble; and he saved them from all their distress.)"},{"num":29,"verse":"And he ordained the tempest thereof into a soft wind, either peaceability; and the waves thereof were still(ed)."},{"num":30,"verse":"And they were glad, for those were still; and he led them forth into the haven of their will. (And they were glad that all was still; and he led them forth into the haven of their desire, yea, into a safe harbour.)"},{"num":31,"verse":"The mercies of the Lord, acknowledge to him; and his marvels to the sons of men. (Give thanks to the Lord for his constant love; and for the marvellous deeds which he hath done, for the sons and daughters of men.)"},{"num":32,"verse":"And enhance they him in the church of the people; and praise they him in the chair(s) of the elder men. (And let them exalt him in the congregation of the people; and praise they him in the council of the elders.)"},{"num":33,"verse":"He hath set floods into desert; and the outgoings of waters into thirst(y) (ground). (He hath turned rivers into desert; and springs of water into thirsty ground.)"},{"num":34,"verse":"He hath set fruitful land into saltiness; for the malice of men dwelling therein. (He hath set fruitful land into a salty wasteland; because of the evil, or the wickedness, of the people who live there.)"},{"num":35,"verse":"He hath set desert into ponds of waters; and [the] earth without water into [the] outgoings of waters. (He hath turned the desert into pools of water; yea, the place without water into springs of water.)"},{"num":36,"verse":"And he set there hungry men; and they made a city of dwelling. (And he put the hungry there; and they made a city to live in.)"},{"num":37,"verse":"And they sowed fields, and planted vines; and made fruit of birth. (And they sowed fields, and planted vines; and reaped a fruitful harvest.)"},{"num":38,"verse":"And he blessed them, and they were multiplied greatly (And he blessed them, and they were greatly multiplied); and he made not less their work beasts."},{"num":39,"verse":"And they were made few; and were travailed of tribulation of evils and of sorrow. (And then, they were made few; and were troubled with trials, and evils, and sorrow.)"},{"num":40,"verse":"Strife was shed out on princes; and he made them for to err without the way, and not in the way. (And he poured out his contempt upon their enemies’ leaders; and he made them to wander without a way, and to go not on the way.)"},{"num":41,"verse":"And he helped the poor man from poverty; and setted families as a sheep bringing forth lambs. (But he helped the poor out of their poverty; and made families to be like sheep bringing forth lambs.)"},{"num":42,"verse":"Rightful men shall see, and shall be glad; and all wickedness shall stop his mouth. (The upright shall see, and shall be glad; and all the wicked shall close their mouths.)"},{"num":43,"verse":"Who is wise, and shall keep these things; and shall understand the mercies of the Lord? (Whoever is wise, shall think about these things; and then they shall understand the Lord’s constant love.)"}]