[{"header":"Boaz and Ruth Marry and Have a Son"},{"num":4,"verse":"Boaz went up to the city gate, and he sat down there. Just then, the redeemer about whom Boaz had spoken was passing by. Boaz said, “Come over here! Sit down, my dear friend!” So he came over and sat down."},{"num":2,"verse":"Then Boaz chose ten men from the elders of the town, and he said, “Sit down here!” They too sat down."},{"num":3,"verse":"Then he said to the redeemer, “Naomi, who returned from the territory of Moab, is putting up for sale the piece of land that belongs to our brother Elimelek. "},{"num":4,"verse":"On my part, I thought I should call it to your attention so that you may acquire it in the presence of these residents and in the presence of the elders of my people. If you wish to redeem it, redeem it. But if you do not wish to redeem it, declare that to me. I know that there is no one ahead of you in the right to redeem, but I am right after you.”"},{"num":5,"verse":"Then Boaz said, “On the day that you acquire the field from the hand of Naomi, I will acquire from Ruth the Moabite, the wife of the deceased, the means to perpetuate the name of the deceased on his inheritance.”"},{"num":6,"verse":"Then the redeemer said, “I am not able to redeem it for myself, or I would ruin my inheritance. You acquire for yourself my right of redemption, because I am not able to redeem it.”"},{"num":7,"verse":"(In Israel this used to be the custom regarding the transfer of the right of redemption: To confirm every transfer, one man took off his sandal and gave it to the other party. This was the way of ratifying a transfer in Israel.)"},{"num":8,"verse":"So the redeemer said to Boaz, “Acquire it for yourself!” Then he took off his sandal."},{"num":9,"verse":"Then Boaz said to the elders and all the people, “You are witnesses today that I have acquired from the hand of Naomi everything that belonged to Elimelek and everything that belonged to Kilion and Mahlon. "},{"num":10,"verse":"Furthermore, Ruth the Moabite, the wife of Mahlon, I have acquired for myself as a wife, in order to perpetuate the name of the deceased on his inheritance, so that the name of the deceased shall not be cut off from his brothers and from the city gate of his place. You are witnesses today.”"},{"num":11,"verse":"Then all the people and the elders who were in the gatehouse said, “We are witnesses! May the Lord make the woman who is coming into your household like Rachel and like Leah, the two women who built the house of Israel, so that you prosper in Ephrathah and become famous in Bethlehem. "},{"num":12,"verse":"May your house become like the house of Perez, whom Tamar bore to Judah, through the seed whom the Lord will give to you from this young woman.”"},{"num":13,"verse":"Then Boaz took Ruth, and she became his wife, and he went to her. The Lord enabled her to conceive, and she bore a son. "},{"num":14,"verse":"Then the women said to Naomi:"},{"num":16,"verse":"Then Naomi took the boy and put him on her lap, and she became his caregiver. "},{"num":17,"verse":"The neighboring women named him, saying, “A son is born to Naomi!” and they named him Obed. He became the father of Jesse, the father of David."},{"header":"The Genealogy From Judah to David"}]