[{"header":"Boaz Marries Ruth"},{"num":4,"verse":"Boaz went to the city gate [the hub of the town for judicial, business, and social interaction] and sat there until the ·close relative [guardian; kinsman-redeemer; 2:20] he had mentioned passed by. Boaz called to him, “·Come here [Turn aside], ·friend [or so-and-so; the man is not named, perhaps ironically because he refused to preserve Naomi’s family name], and sit down.” So the man ·came over [turned aside] and sat down. "},{"num":2,"verse":"Boaz gathered ten of the elders of the city and told them, “Sit down here!” So they sat down."},{"num":3,"verse":"Then Boaz said to the ·close relative [guardian; kinsman-redeemer], “Naomi, who has come back from the country of Moab, ·wants to sell [is selling] the piece of land that belonged to our relative Elimelech [it was important in Israel to keep property in the family]. "},{"num":4,"verse":"So I ·decided [or thought it my obligation] to tell you about it: If you want to ·buy back the land [redeem it], then ·buy it [redeem] in front of the people who are sitting here and in front of the elders of my people. But if you don’t want to buy it, tell me, because you are the ·only one [or first in line] who can buy it, and I am next after you.”"},{"num":5,"verse":"Then Boaz explained, “When you ·buy [acquire] the land from [the hand of] Naomi, you must also ·marry [acquire] Ruth, the Moabite, the dead man’s wife. ·That way, the land will stay in the dead man’s name […to raise up a name for the dead man upon his inheritance].”"},{"num":6,"verse":"The ·close relative [guardian; kinsman-redeemer] answered, “I can’t ·buy back the land [redeem it]. If I did, I might ·harm [destroy; endanger; put in jeopardy] ·what I can pass on to my own sons [my inheritance]. I cannot ·buy the land back [redeem it], so ·buy it [redeem it for] yourself.”"},{"num":7,"verse":"Long ago in Israel ·when people traded or bought back [for the redemption and transfer of] something, one person took off his sandal and gave it to the other person. This was the ·proof of ownership [or validation of the transaction] in Israel."},{"num":8,"verse":"So the ·close relative [guardian; kinsman-redeemer] said to Boaz, “Buy the land yourself,” and he took off his sandal."},{"num":9,"verse":"Then Boaz said to the elders and to all the people, “You are witnesses today. I ·am buying [have bought] from Naomi everything that belonged to Elimelech and Kilion and Mahlon. "},{"num":10,"verse":"I ·am also taking [have also acquired] Ruth, the Moabite, who was the wife of Mahlon, as my wife. ·I am doing this so her dead husband’s property will stay in his name and his name will not be separated […so that his name will not be cut off] from his ·family [brothers] and ·his hometown [the gate of his place]. You are witnesses today.”"},{"num":11,"verse":"So all the people and elders who were at the city gate said, “We are witnesses. May the Lord make this woman, who is coming into your home, like Rachel and Leah, who together built up the ·people [house] of Israel [the twelve sons of Israel were born to Leah, Rachel and their servant girls; Gen. 29:31—30:24]. May you become ·powerful [or wealthy; or renowned] in the district of Ephrathah and ·famous [renowned] in Bethlehem. "},{"num":12,"verse":"As Tamar gave birth to Judah’s son Perez [an ancestor of Boaz (v. 18) whose birth resulted from a levirate union (2:20; Gen. 38:27–30; Deut. 25:5–10) and so was parallel to this situation], may the Lord give you many children through Ruth. May your family be great like his.”"},{"num":13,"verse":"So Boaz took Ruth home as his wife and ·had sexual relations with [went in to] her. The Lord let her become pregnant, and she gave birth to a son. "},{"num":14,"verse":"The women told Naomi, “·Praise [Blessed be] the Lord who ·gave you this grandson [has not left you today without a guardian/kinsman-redeemer]. May ·he [his name] become ·famous [renowned] in Israel. "},{"num":15,"verse":"He will ·give you new [restore/renew your] life and will take care of you in your old age because of your daughter-in-law who loves you. She is better for you than seven sons, because she has given birth to ·your grandson [him].”"},{"num":16,"verse":"Naomi took the boy, ·held him in her arms [or put him on her lap; or took him to her breast], and ·cared for him [or became his nurse/caregiver]. "},{"num":17,"verse":"The neighbors gave the boy his name, saying, “·This boy was [A son has been] born for Naomi.” They named him Obed [“servant”]. Obed was the father of Jesse, and Jesse was the father of David [Israel’s greatest king, through whom the Messiah would come; 2 Sam. 7:11–17; Matt. 1:1, 5–6; Luke 3:32]."},{"num":18,"verse":"This is the family history of Perez, the father of Hezron. "},{"num":19,"verse":"Hezron was the father of Ram, who was the father of Amminadab. "},{"num":20,"verse":"Amminadab was the father of Nahshon, who was the father of Salmon. "},{"num":21,"verse":"Salmon was the father of Boaz, who was the father of Obed. "},{"num":22,"verse":"Obed was the father of Jesse, and Jesse was the father of David [Matt. 1:3–6; Luke 3:31–33]."}]