[{"num":8,"verse":"¶ O that thou wert as my brother, that sucked the breasts of my mother! when I should find thee without, I would kiss thee; and I should not be despised."},{"num":2,"verse":"I would lead thee and bring thee into my mother’s house, that thou would instruct me; I would cause thee to drink of spiced wine of the juice of my pomegranate."},{"num":3,"verse":"His left hand should be under my head, and his right hand should embrace me."},{"num":4,"verse":"I charge you, O daughters of Jerusalem, that ye not awake nor stir up love until he pleases."},{"num":5,"verse":"¶ Who is she that comes up from the wilderness, leaning upon her beloved? I woke thee up under the apple tree; there thy mother had birth pains; there she had pains that brought thee into the light."},{"num":6,"verse":"Set me as a seal upon thine heart as a sign upon thine arm; for love is strong as death; jealousy is hard as Sheol; the coals thereof are coals of fire, which have a most vehement flame."},{"num":7,"verse":"The many waters cannot quench love, neither can the rivers drown it; if a man would give all the substance of his house for this love, it would certainly be despised."},{"num":8,"verse":"¶ We have a little sister, and she still has no breasts; what shall we do for our sister in the day when she shall be spoken for?"},{"num":9,"verse":"If she is a wall, we will build upon her a palace of silver; and if she is a door, we will inclose her with boards of cedar."},{"num":10,"verse":"I am a wall, and my breasts like towers since I was in his eyes as the one that found peace."},{"num":11,"verse":"Solomon had a vineyard at Baalhamon; he let out the vineyard unto keepers; for its fruit each one was to bring a thousand pieces of silver."},{"num":12,"verse":"My vineyard, which is mine, is before me; the thousand pieces shall be thine, O Solomon, and two hundred for those that keep the fruit."},{"num":13,"verse":"¶ Thou, she that dwellest in the gardens, the companions hearken to thy voice; cause me to hear it."},{"num":14,"verse":"Run, my beloved, and be thou like to a roe or to a young hart upon the mountains of spices."}]