[{"num":16,"verse":"Now concerning the collection for the saints, as I directed the assemblies of Galatia, so do *ye* do also."},{"num":2,"verse":"On [the] first of [the] week let each of you put by at home, laying up [in] whatever [degree] he may have prospered, that there may be no collections when I come."},{"num":3,"verse":"And when I am arrived, whomsoever ye shall approve, these I will send with letters to carry your bounty to Jerusalem:"},{"num":4,"verse":"and if it be suitable that *I* also should go, they shall go with me."},{"num":5,"verse":"But I will come to you when I shall have gone through Macedonia; for I do go through Macedonia."},{"num":6,"verse":"But perhaps I will stay with you, or even winter with you, that *ye* may set me forward wheresoever I may go."},{"num":7,"verse":"For I will not see you now in passing, for I hope to remain a certain time with you, if the Lord permit."},{"num":8,"verse":"But I remain in Ephesus until Pentecost."},{"num":9,"verse":"For a great door is opened to me and an effectual [one], and [the] adversaries many."},{"num":10,"verse":"Now if Timotheus come, see that he may be with you without fear; for he works the work of the Lord, even as I."},{"num":11,"verse":"Let not therefore any one despise him; but set him forward in peace, that he may come to me; for I expect him with the brethren."},{"num":12,"verse":"Now concerning the brother Apollos, I begged him much that he would go to you with the brethren; but it was not at all [his] will to go now; but he will come when he shall have good opportunity."},{"num":13,"verse":"Be vigilant; stand fast in the faith; quit yourselves like men; be strong."},{"num":14,"verse":"Let all things ye do be done in love."},{"num":15,"verse":"But I beseech you, brethren, (ye know the house of Stephanas, that it is the first-fruits of Achaia, and they have devoted themselves to the saints for service,)"},{"num":16,"verse":"that *ye* should also be subject to such, and to every one joined in the work and labouring."},{"num":17,"verse":"But I rejoice in the coming of Stephanas and Fortunatus and Achaicus; because *they* have supplied what was lacking on your part."},{"num":18,"verse":"For they have refreshed my spirit and yours: own therefore such."},{"num":19,"verse":"The assemblies of Asia salute you. Aquila and Priscilla, with the assembly in their house, salute you much in [the] Lord."},{"num":20,"verse":"All the brethren salute you. Salute one another with a holy kiss."},{"num":21,"verse":"The salutation of [me] Paul with my own hand."},{"num":22,"verse":"If any one love not the Lord [Jesus Christ] let him be Anathema Maranatha."},{"num":23,"verse":"The grace of the Lord Jesus Christ [be] with you."},{"num":24,"verse":"My love [be] with you all in Christ Jesus. Amen."}]