[{"header":"Concerning The Collection For Jerusalem: Store Up Your Gift And Be Ready When I Come"},{"num":16,"verse":"Now concerning the collection for the saints, just as I directed in the churches of Galatia, so you do also. "},{"num":2,"verse":"Every first day of the week, let each of you put-aside beside himself, storing-up whatever thing he may be prospered, in-order-that when I come, collections might not be taking place at-that-time. "},{"num":3,"verse":"And when I arrive, whomever you approve, I will send these ones with letters to carry-forth your grace-gift to Jerusalem. "},{"num":4,"verse":"And if it is fitting that I also go, they will go with me."},{"header":"I Will Stay In Ephesus For Now, And Come To You Before Winter"},{"num":5,"verse":"Now I will come to you whenever I go through Macedonia, for I am going through Macedonia. "},{"num":6,"verse":"And perhaps I will continue with you, or even spend-the-winter, in order that you may send me forward wherever I may go. "},{"num":7,"verse":"For I do not want to see you now in passing, for I am hoping to stay with you for some time, if the Lord permits. "},{"num":8,"verse":"But I will stay-on in Ephesus until Pentecost, "},{"num":9,"verse":"for a great and effective door has opened to me, and there are many opposing."},{"header":"Timothy May Come Before Me: Take Care of Him"},{"num":10,"verse":"But if Timothy comes, see that he may come-to-be with you fearlessly. For he is working the work of the Lord as I also. "},{"num":11,"verse":"Therefore let no one treat him with contempt. And send him forward in peace in order that he may come to me, for I am waiting-for him with the brothers."},{"header":"Concerning Apollos: He Will Come When He Can"},{"num":12,"verse":"Now concerning Apollos our brother, I strongly urged him that he come to you with the brothers. And it was not at all his will that he come now, but he will come whenever he finds-an-opportunity."},{"header":"Closing Exhortations And Greetings"},{"num":13,"verse":"Keep-watching, be standing-firm in the faith, be acting-like-men, be growing-strong, "},{"num":14,"verse":"let all your things be done in love."},{"num":15,"verse":"And I exhort you, brothers— you know the household of Stephanas, that it is the firstfruit of Achaia, and they appointed themselves for ministry to the saints— "},{"num":16,"verse":"that you also be subject to such ones, and to everyone helping and laboring. "},{"num":17,"verse":"Now I am rejoicing over the coming of Stephanas and Fortunatus and Achaicus, because these ones filled-up your lack. "},{"num":18,"verse":"For they refreshed my spirit and yours. Therefore be acknowledging such ones."},{"num":19,"verse":"The churches of Asia greet you. Aquila and Prisca greet you earnestly in the Lord, along with the church at their house. "},{"num":20,"verse":"All the brothers greet you. Greet one another with a holy kiss."},{"num":21,"verse":"The greeting of Paul by my own hand— "},{"num":22,"verse":"if anyone does not love the Lord, let him be accursed. Marana tha. "},{"num":23,"verse":"The grace of the Lord Jesus be with you. "},{"num":24,"verse":"My love be with you all in Christ Jesus."}]