[{"header":"The Resurrection of Christ"},{"num":15,"verse":"And now I want to remind you, my friends, of the Good News which I preached to you, which you received, and on which your faith stands firm. "},{"num":2,"verse":"That is the gospel, the message that I preached to you. You are saved by the gospel if you hold firmly to it—unless it was for nothing that you believed."},{"num":3,"verse":"I passed on to you what I received, which is of the greatest importance: that Christ died for our sins, as written in the Scriptures; "},{"num":4,"verse":"that he was buried and that he was raised to life three days later, as written in the Scriptures; "},{"num":5,"verse":"that he appeared to Peter and then to all twelve apostles. "},{"num":6,"verse":"Then he appeared to more than five hundred of his followers at once, most of whom are still alive, although some have died. "},{"num":7,"verse":"Then he appeared to James, and afterward to all the apostles."},{"num":8,"verse":"Last of all he appeared also to me—even though I am like someone whose birth was abnormal. "},{"num":9,"verse":"For I am the least of all the apostles—I do not even deserve to be called an apostle, because I persecuted God's church. "},{"num":10,"verse":"But by God's grace I am what I am, and the grace that he gave me was not without effect. On the contrary, I have worked harder than any of the other apostles, although it was not really my own doing, but God's grace working with me. "},{"num":11,"verse":"So then, whether it came from me or from them, this is what we all preach, and this is what you believe."},{"header":"Our Resurrection"},{"num":12,"verse":"Now, since our message is that Christ has been raised from death, how can some of you say that the dead will not be raised to life? "},{"num":13,"verse":"If that is true, it means that Christ was not raised; "},{"num":14,"verse":"and if Christ has not been raised from death, then we have nothing to preach and you have nothing to believe. "},{"num":15,"verse":"More than that, we are shown to be lying about God, because we said that he raised Christ from death—but if it is true that the dead are not raised to life, then he did not raise Christ. "},{"num":16,"verse":"For if the dead are not raised, neither has Christ been raised. "},{"num":17,"verse":"And if Christ has not been raised, then your faith is a delusion and you are still lost in your sins. "},{"num":18,"verse":"It would also mean that the believers in Christ who have died are lost. "},{"num":19,"verse":"If our hope in Christ is good for this life only and no more, then we deserve more pity than anyone else in all the world."},{"num":20,"verse":"But the truth is that Christ has been raised from death, as the guarantee that those who sleep in death will also be raised. "},{"num":21,"verse":"For just as death came by means of a man, in the same way the rising from death comes by means of a man. "},{"num":22,"verse":"For just as all people die because of their union with Adam, in the same way all will be raised to life because of their union with Christ. "},{"num":23,"verse":"But each one will be raised in proper order: Christ, first of all; then, at the time of his coming, those who belong to him. "},{"num":24,"verse":"Then the end will come; Christ will overcome all spiritual rulers, authorities, and powers, and will hand over the Kingdom to God the Father. "},{"num":25,"verse":"For Christ must rule until God defeats all enemies and puts them under his feet. "},{"num":26,"verse":"The last enemy to be defeated will be death. "},{"num":27,"verse":"For the scripture says, “God put all things under his feet.” It is clear, of course, that the words “all things” do not include God himself, who puts all things under Christ. "},{"num":28,"verse":"But when all things have been placed under Christ's rule, then he himself, the Son, will place himself under God, who placed all things under him; and God will rule completely over all."},{"num":29,"verse":"Now, what about those people who are baptized for the dead? What do they hope to accomplish? If it is true, as some claim, that the dead are not raised to life, why are those people being baptized for the dead? "},{"num":30,"verse":"And as for us—why would we run the risk of danger every hour? "},{"num":31,"verse":"My friends, I face death every day! The pride I have in you, in our life in union with Christ Jesus our Lord, makes me declare this. "},{"num":32,"verse":"If I have, as it were, fought “wild beasts” here in Ephesus simply from human motives, what have I gained? But if the dead are not raised to life, then, as the saying goes, “Let us eat and drink, for tomorrow we will die.”"},{"num":33,"verse":"Do not be fooled. “Bad companions ruin good character.” "},{"num":34,"verse":"Come back to your right senses and stop your sinful ways. I declare to your shame that some of you do not know God."},{"header":"The Resurrection Body"},{"num":35,"verse":"Someone will ask, “How can the dead be raised to life? What kind of body will they have?” "},{"num":36,"verse":"You fool! When you plant a seed in the ground, it does not sprout to life unless it dies. "},{"num":37,"verse":"And what you plant is a bare seed, perhaps a grain of wheat or some other grain, not the full-bodied plant that will later grow up. "},{"num":38,"verse":"God provides that seed with the body he wishes; he gives each seed its own proper body."},{"num":39,"verse":"And the flesh of living beings is not all the same kind of flesh; human beings have one kind of flesh, animals another, birds another, and fish another."},{"num":40,"verse":"And there are heavenly bodies and earthly bodies; the beauty that belongs to heavenly bodies is different from the beauty that belongs to earthly bodies. "},{"num":41,"verse":"The sun has its own beauty, the moon another beauty, and the stars a different beauty; and even among stars there are different kinds of beauty."},{"num":42,"verse":"This is how it will be when the dead are raised to life. When the body is buried, it is mortal; when raised, it will be immortal. "},{"num":43,"verse":"When buried, it is ugly and weak; when raised, it will be beautiful and strong. "},{"num":44,"verse":"When buried, it is a physical body; when raised, it will be a spiritual body. There is, of course, a physical body, so there has to be a spiritual body. "},{"num":45,"verse":"For the scripture says, “The first man, Adam, was created a living being”; but the last Adam is the life-giving Spirit. "},{"num":46,"verse":"It is not the spiritual that comes first, but the physical, and then the spiritual. "},{"num":47,"verse":"The first Adam, made of earth, came from the earth; the second Adam came from heaven. "},{"num":48,"verse":"Those who belong to the earth are like the one who was made of earth; those who are of heaven are like the one who came from heaven. "},{"num":49,"verse":"Just as we wear the likeness of the man made of earth, so we will wear the likeness of the Man from heaven."},{"num":50,"verse":"What I mean, friends, is that what is made of flesh and blood cannot share in God's Kingdom, and what is mortal cannot possess immortality."},{"num":51,"verse":"Listen to this secret truth: we shall not all die, but when the last trumpet sounds, we shall all be changed in an instant, as quickly as the blinking of an eye. For when the trumpet sounds, the dead will be raised, never to die again, and we shall all be changed. "},{"num":53,"verse":"For what is mortal must be changed into what is immortal; what will die must be changed into what cannot die. "},{"num":54,"verse":"So when this takes place, and the mortal has been changed into the immortal, then the scripture will come true: “Death is destroyed; victory is complete!”"},{"num":56,"verse":"Death gets its power to hurt from sin, and sin gets its power from the Law. "},{"num":57,"verse":"But thanks be to God who gives us the victory through our Lord Jesus Christ!"},{"num":58,"verse":"So then, my dear friends, stand firm and steady. Keep busy always in your work for the Lord, since you know that nothing you do in the Lord's service is ever useless."}]