[{"num":115,"verse":"1 A prayer of the faithful oppressed by idolatrous tyrants, against whom they desire that God would succor them,  9 trusting most constantly that God will preserve them in this their need, seeing, that he hath adopted and received them into his favor. 13 Promising finally that they will not be unmindful of so great a benefit if it would please God to hear their prayer, and deliver them by his omnipotent power."},{"num":1,"verse":"Not unto us, O Lord, not unto us, but unto thy Name give the glory for thy loving mercy, and for thy truth’s sake."},{"num":2,"verse":"Wherefore shall the heathen say, Where is now their God?"},{"num":3,"verse":"But our God is in heaven: he doeth whatsoever he will."},{"num":4,"verse":"Their idols are silver and gold, even the work of men’s hands."},{"num":5,"verse":"They have a mouth, and speak not: they have eyes, and see not."},{"num":6,"verse":"They have ears, and hear not: they have noses and smell not."},{"num":7,"verse":"They have hands, and touch not: they have feet, and walk not: neither make they a sound with their throat."},{"num":8,"verse":"They that make them are like unto them: so are all that trust in them."},{"num":9,"verse":"O Israel, trust thou in the Lord: for he is their help, and their shield."},{"num":10,"verse":"O house of Aaron trust ye in the Lord, for he is their help, and their shield."},{"num":11,"verse":"Ye that fear the Lord, trust in the Lord: for he is their helper, and their shield."},{"num":12,"verse":"The Lord hath been mindful of us, he will bless, he will bless the house of Israel, he will bless the house of Aaron."},{"num":13,"verse":"He will bless them that fear the Lord, both small and great."},{"num":14,"verse":"The Lord will increase his graces toward you, even toward you, and toward your children."},{"num":15,"verse":"Ye are blessed of the Lord, which made the heaven and the earth."},{"num":16,"verse":"The heavens, even the heavens are the Lord’s: but he hath given the earth to the sons of men."},{"num":17,"verse":"The dead praise not the Lord, neither any that go down into the place of silence."},{"num":18,"verse":"But we will praise the Lord from henceforth and forever. Praise ye the Lord."}]