[{"header":"Ezra Comes to Jerusalem"},{"num":7,"verse":"After these things, during the rule of King Artaxerxes of Persia, Ezra came to Jerusalem from Babylon. Ezra was the son of Seraiah. Seraiah was the son of Azariah. Azariah was the son of Hilkiah."},{"num":2,"verse":"Hilkiah was the son of Shallum. Shallum was the son of Zadok. Zadok was the son of Ahitub."},{"num":3,"verse":"Ahitub was the son of Amariah. Amariah was the son of Azariah. Azariah was the son of Meraioth."},{"num":4,"verse":"Meraioth was the son of Zerahiah. Zerahiah was the son of Uzzi. Uzzi was the son of Bukki."},{"num":5,"verse":"Bukki was the son of Abishua. Abishua was the son of Phinehas. Phinehas was the son of Eleazar. Eleazar was the son of Aaron the high priest."},{"num":6,"verse":"Ezra came to Jerusalem from Babylon. He was a teacher and knew the Law of Moses very well. The Law of Moses was given by the Lord, the God of Israel. King Artaxerxes gave Ezra everything he asked for because the Lord was with Ezra."},{"num":7,"verse":"Among the people who came with Ezra were Israelites, priests, Levites, singers, gatekeepers, and Temple servants. They arrived in Jerusalem during the seventh year of King Artaxerxes."},{"num":8,"verse":"Ezra arrived in Jerusalem in the fifth month of the seventh year that Artaxerxes was king."},{"num":9,"verse":"Ezra left Babylon on the first day of the first month and arrived in Jerusalem on the first day of the fifth month. With God’s blessing his trip went well."},{"num":10,"verse":"Ezra had always given his time and attention to studying and obeying the law of the Lord. He also loved to teach its rules and commandments to others in Israel."},{"header":"King Artaxerxes’ Letter to Ezra"},{"num":11,"verse":"Ezra was a priest and teacher. He knew much about the commands and laws the Lord gave Israel. This is a copy of the letter King Artaxerxes gave to Ezra the teacher:"},{"num":12,"verse":" From King Artaxerxes,"},{"num":13,"verse":"I give this order: Any of the Israelites living in my kingdom, including priests and Levites, who want to go with you to Jerusalem, may go."},{"num":14,"verse":"I and my seven advisors send you to Judah and Jerusalem. Go and see how your people are doing in obeying the law of your God. You have that law with you."},{"num":15,"verse":"I and my advisors are giving gold and silver to the God of Israel, who lives in Jerusalem. You must take this gold and silver with you."},{"num":16,"verse":"You must also go through all the provinces of Babylonia. Collect the gifts from your people, from the priests, and from the Levites. The gifts are for the Temple of their God in Jerusalem."},{"num":17,"verse":"Use this money to buy bulls, rams, and male lambs. Buy the grain offerings and drink offerings that go with these sacrifices. Then sacrifice them on the altar in the Temple of your God in Jerusalem."},{"num":18,"verse":"Then you and the other Jews may spend the silver and gold left over any way you want to. Use it in a way that is pleasing to your God."},{"num":19,"verse":"Take all these things to the God of Jerusalem. They are for the worship in the Temple of your God."},{"num":20,"verse":"And you may get any other things that you need for the Temple of your God. Use the money in the king’s treasury to buy anything you need."},{"num":21,"verse":"Now I, King Artaxerxes, give this order: I order all the men who keep the king’s money in the area west of the Euphrates River to give Ezra anything he wants. Ezra is a priest and a teacher of the Law of the God of heaven. Do this quickly and completely."},{"num":22,"verse":"Give this much to Ezra: 3 3/4 tons of silver, 600 bushels of wheat, 600 gallons of wine, 600 gallons of olive oil, and as much salt as Ezra wants."},{"num":23,"verse":"Anything that the God of heaven has ordered for Ezra to get, you must give to Ezra quickly and completely. Do this for the Temple of the God of heaven. We don’t want God to be angry with my kingdom or my sons."},{"num":24,"verse":"I want you men to know that it is against the law to make the priests, Levites, singers, gatekeepers, Temple servants, and other workers in God’s Temple pay taxes. They don’t have to pay taxes, money to honor the king, or any customs fees."},{"num":25,"verse":"Ezra, I give you the authority to use the wisdom you have from your God and choose civil and religious judges. These men will be judges for all the people living in the area west of the Euphrates River. They will judge all the people who know the laws of your God and they will teach those who don’t know those laws."},{"num":26,"verse":"Anyone who does not obey the law of your God, or the law of the king, must be punished. Depending on the crime, they must be punished with death, or sent away to another country, or their property taken away, or put into prison."},{"header":"Ezra Praises God"},{"num":27,"verse":" Blessed is the Lord, the God of our ancestors. He put the idea into the king’s heart to honor the Lord’s Temple in Jerusalem."},{"num":28,"verse":"God showed his faithful love to me in front of the king, his advisors, and the king’s important officials. The Lord my God was with me, and that gave me courage. I gathered together the leaders of Israel to go with me to Jerusalem."}]