[{"num":7,"verse":"13 By the commandment of the king, Ezra and his companions come to Jerusalem. 27 He giveth thanks to God."},{"num":1,"verse":"Now after these things, in the reign of Artaxerxes king of Persia, was Ezra the son of Seraiah, the son of Azariah, the son of Hilkiah,"},{"num":2,"verse":"The son of Shallum, the son of Zadok, the son of Ahitub,"},{"num":3,"verse":"The son of Amariah, the son of Azariah, the son of Meraioth,"},{"num":4,"verse":"The son of Zerahiah, the son of Uzzi, the son of Bukki,"},{"num":5,"verse":"The son of Abishua, the son of Phinehas, the son of Eleazar, the son of Aaron, the chief Priest."},{"num":6,"verse":"This Ezra came up from Babel, and was a Scribe, prompt in the Law of Moses, which the Lord God of Israel had given, and the king gave him all his request according to the hand of the Lord his God, which was upon him."},{"num":7,"verse":"And there went up certain of the children of Israel, and of the Priests, and the Levites, and the singers, and the porters, and the Nethinim unto Jerusalem, in the seventh year of king Artaxerxes."},{"num":8,"verse":"And he came to Jerusalem in the fifth month, which was in the seventh year of the king."},{"num":9,"verse":"For upon the first day of the first month began he to go up from Babel, and on the first day of the fifth month came he to Jerusalem according to the good hand of his God that was upon him."},{"num":10,"verse":"For Ezra had prepared his heart to seek the Law of the Lord, and to do it, and to teach the precepts and judgments in Israel."},{"num":11,"verse":"¶ And this is the copy of the letter that king Artaxerxes gave unto Ezra the Priest and Scribe, even a writer of the words of the commandments of the Lord, and of his statutes over Israel."},{"num":12,"verse":"ARTAXERXES king of kings, to Ezra the Priest and perfect Scribe of the Law of the God of heaven, and to Cheeneth."},{"num":13,"verse":"I have given commandment, that everyone that is willing in my kingdom of the people of Israel, and of the Priests, and Levites, to go to Jerusalem with thee, shall go."},{"num":14,"verse":"Therefore art thou sent of the king and his seven counselors, to enquire in Judah and Jerusalem, according to the Law of thy God, which is in thine hand,"},{"num":15,"verse":"And to carry the silver and the gold, which the king and his counselors willingly offer unto the God of Israel (whose habitation is in Jerusalem)"},{"num":16,"verse":"And all the silver and gold that thou canst find in all the province of Babel, with the free offering of the people, and that which the Priests offer willingly to the house of their God which is in Jerusalem,"},{"num":17,"verse":"That thou mayest buy speedily with this silver, bullocks, rams, lambs, with their meat offerings, and their drink offerings: and thou shalt offer them upon the Altar of the house of your God, which is in Jerusalem."},{"num":18,"verse":"And whatsoever it pleaseth thee and thy brethren to do with the rest of the silver and gold, do ye it according to the will of your God."},{"num":19,"verse":"And the vessels that are given thee for the service of the house of thy God, those deliver thou before God in Jerusalem."},{"num":20,"verse":"And the residue that shall be needful for the house of thy God, which shall be meet for thee to bestow, thou shalt bestow it out of the King’s treasure house,"},{"num":21,"verse":"And I king Artaxerxes have given commandment to all the treasurers which are beyond the River, that whatsoever Ezra the Priest and Scribe of the Law of the God of heaven shall require of you, that it be done incontinently,"},{"num":22,"verse":"Unto an hundred talents of silver, unto an hundred measures of wheat, and unto an hundred baths of wine, and unto an hundred baths of oil, and salt without writing."},{"num":23,"verse":"Whatsoever is by the commandment of the God of heaven, let it be done speedily for the house of the God of heaven: for why should he be wroth against the realm of the King and his children?"},{"num":24,"verse":"And we certify you, that upon any of the Priests, Levites, singers, porters, Nethinim, or Ministers in this house of God, there shall no governor lay upon them toll, tribute nor custom."},{"num":25,"verse":"And thou Ezra (after the wisdom of thy God, that is in thine hand) set judges and arbiters, which may judge all the people that is beyond the River, even all that know the law of thy God, and teach ye them that know it not."},{"num":26,"verse":"And whosoever will not do the Law of thy God, and the king’s law, let him have judgment without delay, whether it be unto death, or to banishment, or to confiscation of goods, or to imprisonment."},{"num":27,"verse":"Blessed be the Lord God of our fathers, which so hath put in the king’s heart, to beautify the house of the Lord that is in Jerusalem,"},{"num":28,"verse":"And hath inclined mercy toward me, before the king and his counselors, and before all the king’s mighty Princes: and I was comforted by the hand of the Lord my God which was upon me, and I gathered the chief of Israel to go up with me."}]