[{"num":7,"verse":"Now after these things, in the reign of Artachshasta Melech Paras (Persia), Ezra ben Serayah ben Azaryah ben Hilkiyah,"},{"num":2,"verse":"Ben Shallum, ben Tzadok, ben Achituv,"},{"num":3,"verse":"Ben Amaryah, ben Azaryah, ben Merayot,"},{"num":4,"verse":"Ben Zerachyah, ben Uzzi, ben Bukki,"},{"num":5,"verse":"Ben Avishua, ben Pinchas, ben Eleazar, ben Aharon HaKohen HaRosh;"},{"num":6,"verse":"This Ezra went up from Babylon, and he was a sofer mahir expert in the Torat Moshe, which Hashem Elohei Yisroel had given, and HaMelech granted him all his request, for the yad Hashem Elohav was upon him."},{"num":7,"verse":"And there went up some of the Bnei Yisroel, and of the Kohanim, and the Levi’im, and the singers, and the gatekeepers, and the Netinim, unto Yerushalayim, in the seventh year of Artachshasta [Artaxerxes] HaMelech [i.e., 458 B.C.E.]."},{"num":8,"verse":"And he came to Yerushalayim in the fifth month, which was in the seventh year of the Melech."},{"num":9,"verse":"For upon the first day of the first month he began to go up from Babylon, and on the first day of the fifth month he came to Yerushalayim, for the good yad Elohav was upon him."},{"num":10,"verse":"For Ezra had prepared his lev to study the Torat Hashem, and to do it, and to teach in Yisroel chok and mishpat."},{"num":11,"verse":"Now this is the copy of the letter that HaMelech Artachshasta gave unto Ezra HaKohen, HaSofer, even a Sofer of the divrei mitzvot Hashem, and of his chukkot for Yisroel:"},{"num":12,"verse":"Artachshasta, Melech Melachim, unto Ezra Kohen, Sofer of the law of Elohei Shomayim, Greetings! And now"},{"num":13,"verse":"I issued a decree, that all they of the Am Yisroel, and of Kohanim and Levi’im, in my kingdom, which are minded of their own freewill to go up to Yerushalayim, go with thee."},{"num":14,"verse":"Forasmuch as thou art sent of the Melech, and of his seven counselors, to inquire concerning Yehudah and Yerushalayim, according to the law of thy G-d which is in thine hand;"},{"num":15,"verse":"And to carry the kesef and zahav, which the Melech and his counselors have freely offered unto the Elohei Yisroel, Whose habitation is in Yerushalayim,"},{"num":16,"verse":"And all the kesef and zahav that thou canst find in all the province of Babylon, with the freewill offering of the people, and of the Kohanim, offering willingly for the Beis Eloheihem which is in Yerushalayim;"},{"num":17,"verse":"That thou mayest buy speedily with this kesef bulls, rams, lambs, with their minchot and their nesakhim, and offer them upon the Mizbe’ach of the Beis Eloheichem which is in Yerushalayim."},{"num":18,"verse":"And whatsoever shall seem good to thee, and to thy brethren, to do with the rest of the kesef and the zahav, that do according to the will of Eloheichem."},{"num":19,"verse":"The vessels also that are given thee for the service of the Beis of thy G-d, those deliver thou before the Elohei Yerushalayim."},{"num":20,"verse":"And whatsoever more shall be needful for the Beis of thy G-d, which thou shalt have occasion to bestow, bestow it out of the bais of treasuries of the Melech."},{"num":21,"verse":"And I, even I Artachshasta the Melech, do issue a decree to all the treasurers which are in Beyond-the-River [Euphrates], that whatsoever Ezra HaKohen, the Sofer of the law of the Elohei Shomayim, shall require of you, it be done speedily,"},{"num":22,"verse":"Unto one hundred talents of kesef, and to one hundred cors of wheat, and to one hundred baths of wine, and to one hundred baths of oil, and unlimited melach (salt)."},{"num":23,"verse":"Whatsoever is commanded by Elohei Shomayim, let it be diligently done for the Beis of Elohei Shomayim; for why should there be ketzaf (wrath) against the malchut of the Melech and his banim?"},{"num":24,"verse":"Also we make known to you, that touching any of the Kohanim and Levi’im, singers, gatekeepers, Netinim, or ministers of this Beis Elohim, it shall not be lawful to impose tax, tribute, or duty, upon them."},{"num":25,"verse":"And thou, Ezra, after the chochmah of thy G-d, that is in thine hand, set magistrates and judges, which may judge all the people that are in Beyond-the-River [Euphrates], all such as know the laws of thy G-d; and teach ye them that know them not."},{"num":26,"verse":"And whosoever will not do the law of thy G-d, and the law of the Melech, let punishment be executed speedily upon him, whether it be unto death, or to banishment, or to confiscation of goods, or to imprisonment."},{"num":27,"verse":"Baruch Hashem Elohei Avoteinu, Who hath put such a thing as this in the lev HaMelech, to honor the Beis Hashem which is in Yerushalayim;"},{"num":28,"verse":"And hath extended chesed unto me before HaMelech, and his counselors, and before all the mighty officials of the Melech. And I was strengthened because the Yad Hashem Elohai was upon me, and I gathered together out of Yisroel chief men to go up with me."}]