[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(7) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Of the increase . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Better, “",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For the increase of the government, and for peace with no end ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": ". . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The “throne of David,” though in harmony with the whole body of prophetic tradition as to the Messiah, may be noted as the first appearance of that tradition in Isaiah.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Henceforth even for ever.—The words admit, as in the parallels of Psalm 21:4; Psalm 61:6-7; 2Samuel 7:12-16, of being interpreted of the perpetuity of the dynasty of which the anointed king is to be the founder; but the “Everlasting Father “of the context, and the parallels of Psalm 45:6; Psalm 110:4, are in favour of its referring to a personal immortality of sovereignty.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Henceforth even for ever.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The words admit, as in the parallels of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 21:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 61:6-7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2Samuel 7:12-16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", of being interpreted of the perpetuity of the dynasty of which the anointed king is to be the founder; but the “Everlasting Father “of the context, and the parallels of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 45:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 110:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", are in favour of its referring to a personal immortality of sovereignty.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The zeal of the Lord of hosts will perform . . .—As in Greek so in Hebrew, we have the same root-word and root-idea for “zeal” and “jealousy,” and here, perhaps, the latter thought is dominant. It is because Jehovah loves the daughter of Zion with an absorbing love that He purposes such great things for her future, and that what He purposes will be assuredly performed. (Comp. Ezekiel 5:13.)",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "The zeal of the Lord of hosts will perform . . .",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—As in Greek so in Hebrew, we have the same root-word and root-idea for “zeal” and “jealousy,” and here, perhaps, the latter thought is dominant. It is because Jehovah loves the daughter of Zion with an absorbing love that He purposes such great things for her future, and that what He purposes will be assuredly performed. (Comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 5:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Isaiah 9:7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 9:7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Of the increase of his government, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — His peaceable and happy government shall be enlarged without end: either without end of duration, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for ever, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "as is expressed in a following clause of this verse, or without limitation: his peaceable and happy government shall be extended to all the ends of the earth. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Upon the throne of David ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— The throne which was promised to David, and to his seed ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for ever; from henceforth, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — From the beginning of it unto all eternity. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The zeal of the Lord of hosts,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " &c. — This great work shall be brought to pass by Almighty God, out of that fervent affection which he hath to his own glory, to the honour of his Son, and to his people.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9:1-7 The Syrians and Assyrians first ravaged the countries here mentioned, and that region was first favoured by the preaching of Christ. Those that want the gospel, walk in darkness, and in the utmost danger. But when the gospel comes to any place, to any soul, light comes. Let us earnestly pray that it may shine into our hearts, and make us wise unto salvation. The gospel brings joy with it. Those who would have joy, must expect to go through hard work, as the husbandman, before he has the joy of harvest; and hard conflict, as the soldier, before he divides the spoil. The Jews were delivered from the yoke of many oppressors; this was a shadow of the believer's deliverance from the yoke of Satan. The cleansing the souls of believers from the power and pollution of sin, would be by the influence of the Holy Spirit, as purifying fire. These great things for the church, shall be done by the Messiah, Emmanuel. The Child is born; it was certain; and the church, before Christ came in the flesh, benefitted by his undertaking. It is a prophecy of him and of his kingdom, which those that waited for the Consolation of Israel read with pleasure. This Child was born for the benefit of us men, of us sinners, of all believers, from the beginning to the end of the world. Justly is he called Wonderful, for he is both God and man. His love is the wonder of angels and glorified saints. He is the Counsellor, for he knew the counsels of God from eternity; and he gives counsel to men, in which he consults our welfare. He is the Wonderful Counsellor; none teaches like him. He is God, the mighty One. Such is the work of the Mediator, that no less power than that of the mighty God could bring it to pass. He is God, one with the Father. As the Prince of Peace, he reconciles us to God; he is the Giver of peace in the heart and conscience; and when his kingdom is fully established, men shall learn war no more. The government shall be upon him; he shall bear the burden of it. Glorious things are spoken of Christ's government. There is no end to the increase of its peace, for the happiness of its subjects shall last for ever. The exact agreement of this prophecy with the doctrine of the New Testament, shows that Jewish prophets and Christian teachers had the same view of the person and salvation of the Messiah. To what earthly king or kingdom can these words apply? Give then, O Lord, to thy people to know thee by every endearing name, and in every glorious character. Give increase of grace in every heart of thy redeemed upon earth.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Of the increase ... - The word rendered \"government\" here, משׂרה  mis'râh, means properly his government as a prince - his principality, and is a continuation of the idea in the previous verse, 'the Prince of Peace.' It means that his reign as a prince of peace - in extending and promoting peace, shall be unlimited.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And peace - This does not signify in the original, as our translation would seem to do, that there should be no end to the increase of his peace, but that there should be no limit to peace, that is, that his reign should be one of unlimited peace. The whole is a description of a prosperous, wide-extended, ever-growing and unlimited empire of peace.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "No end - The word used here - קץ  qêts - may refer either to space or time. The connection, however, seems to confine it to time, and to mean simply that over his wide-extended and peaceful principality he should reign forever.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Upon the throne of David - See the note at Acts 2:30. This was in accordance with the promise made to David; 1 Kings 8:25; 2 Samuel 7:12-13; Psalm 132:11. This promise was understood as referring to the Messiah. The primary idea is, that he should be descended in the line of David, and accordingly the New Testament writers are often at pains to show that the Lord Jesus was of that family; Luke 2:4. When it is said that he would sit upon the throne of David, it is not to be taken literally. The uniqueness of the reign of David was, that he reigned over the people of God. He was chosen for this purpose from humble life; was declared in his administration to be a man after God's own heart; and his long and prosperous reign was a reign over the people of God. To sit upon the throne of David, therefore, means to reign over the people of God; and in this sense the Messiah sat on his throne. There is also a similarity in the two administrations, in the fact that the Messiah was taken from humble life. and that his reign will be far-extended and prosperous. But the main idea of resemblance is, that the reign of each extended over the people of God.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Upon the throne of David - See the note at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 2:30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". This was in accordance with the promise made to David; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 8:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 7:12-13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 132:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". This promise was understood as referring to the Messiah. The primary idea is, that he should be descended in the line of David, and accordingly the New Testament writers are often at pains to show that the Lord Jesus was of that family; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 2:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". When it is said that he would sit upon the throne of David, it is not to be taken literally. The uniqueness of the reign of David was, that he reigned over the people of God. He was chosen for this purpose from humble life; was declared in his administration to be a man after God's own heart; and his long and prosperous reign was a reign over the people of God. To sit upon the throne of David, therefore, means to reign over the people of God; and in this sense the Messiah sat on his throne. There is also a similarity in the two administrations, in the fact that the Messiah was taken from humble life. and that his reign will be far-extended and prosperous. But the main idea of resemblance is, that the reign of each extended over the people of God.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And upon his kingdom - That is, over the kingdom of the people of God. It does not mean particularly the Jews, but all those over whom the divine administration should be set up.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "To order it - To raise up, or confirm it. The word, also, is sometimes used to denote to found a kingdom. Here it means to confirm it, to cause it to stand.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And to establish it - To place it on a firm foundation; to make it firm.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "With judgment ... - That is, under an administration that shall be just and right. Most kingdoms have been those of blood, and have been established by iniquity, and by the unjust overthrow of others. But the administration of the Messiah shall be established in righteousness, and shall be destined to extend and perpetuate justice and righteousness forever. \"From henceforth.\" That is, from the time which was the period of the prophet's vision, when he saw in vision the Messiah rising in the dark parts of Galilee; Notes, Isaiah 9:1-2.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "With judgment ... - That is, under an administration that shall be just and right. Most kingdoms have been those of blood, and have been established by iniquity, and by the unjust overthrow of others. But the administration of the Messiah shall be established in righteousness, and shall be destined to extend and perpetuate justice and righteousness forever. \"From henceforth.\" That is, from the time which was the period of the prophet's vision, when he saw in vision the Messiah rising in the dark parts of Galilee; Notes, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 9:1-2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The zeal - The word used here denotes \"ardor,\" intense desire in accomplishing an object; and means that the establishment of this kingdom was an object of intense and ardent desire on the part of Yahweh. It is also implied that nothing else than the zeal of Yahweh could do it. We may remark here:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) That if Yahweh feels so intense a desire for this, then the subjects of the Messiah's reign should also feel this.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(2) If Yahweh feels this zeal, and if he will certainly accomplish this, then Christians should be encouraged in their efforts to spread the gospel. His purpose to do this is their only encouragement - and a sufficient encouragement - to excite their zeal in this great and glorious work. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(2) If Yahweh feels this zeal, and if he will certainly accomplish this, then Christians should be encouraged in their efforts to spread the gospel. His purpose to do this is their only encouragement - and a sufficient encouragement - to excite their zeal in this great and glorious work. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "7. Of … increase … no end—His princely rule shall perpetually increase and be unlimited (Da 2:44).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "throne of David—(1Ki 8:25; Ps 2:6; 132:11; Jer 3:17, 18 Eze 34:23-26; 37:16, 22; Lu 1:32, 33; Ac 2:30).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "judgment … justice—It is not a kingdom of mere might, and triumph of force over enemies, but of righteousness (Isa 42:21; Ps 45:6, 7), attainable only in and by Messiah.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "zeal, &c.—including not only Christ's hidden spiritual victory over Satan at the first coming, but the open one accompanied with \"judgments\" on Antichrist and every enemy at the second coming (Isa 59:17; Ps 9:6-8).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Of the increase of his government and peace there shall be no end; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " his peaceable and happy government shall be enlarged without end; either without end of duration, for ever; but that is expressed in a following clause of this verse: or without end of limitation, or without bounds. It shall not be confined to a narrow spot of ground, the land of Canaan, but shall be extended far and wide to all the ends of the earth. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The throne of David; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which was promised to David, and to his seed for ever. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "With judgment and with justice; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " not with oppression and tyranny, by which other kingdoms are commonly managed, but by the administration of justice. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "From henceforth even for ever; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " from the beginning of it unto all eternity. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The zeal of the Lord of hosts will perform this; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " this great work, which surpasseth all the power and skill of men, shall be brought to pass by Almighty God, out of that fervent affection which he hath to his own name and glory, and to the honour of his dearly beloved Son, and unto his church and people. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Of the increase of his government,.... That is, of the Prince of peace, on whose shoulders it is; which, from small beginnings, will rise to a very great pitch and height of glory; this is signified by the stone cut out of the mountain without hands; that smote the image, became a great mountain, and filled the whole earth, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 2:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and by the parable of the mustard seed, the least of all seeds, and yet, when grown up, becomes a great tree, in which the birds of the air build their nests, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 13:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Christ's kingdom and interest, his dominion and government, may be said to be increased, when his Gospel is spread far and near, which is called the Gospel of the kingdom, and the doctrines of it, the mysteries of the kingdom; by means of which men become subjects of it, and so his kingdom is enlarged. At first it was only preached in Judea; and then it was carried into the Gentile world, where it met with great success, and was spread to the overthrow of Paganism in the Roman empire; a stop was put to its progress by the appearance and power of antichrist, the man of sin; but at the Reformation it broke out again, and spread itself over many nations; and though of late years there has been a decline, in the latter day the knowledge of it will cover the earth, as the waters do the sea, and multitudes shall be converted by it; which is meant by the increase of Christ's government. In the days of his flesh on earth, few believed in him; after his ascension to heaven, there was a large increase of his followers in Jerusalem, and in the Gentile world; the Gospel being preached there, more were the children of the desolate than of the married wife; large numbers were converted, and churches raised and formed everywhere; and in the latter day the church shall fill the earth, and the kingdoms of this world will become the church of Christ; all nations will flow unto it; the people of the Jews, in a body, will be converted, and the fulness of the Gentiles will be brought in; the interest of Christ, which made so contemptible a figure at first, consisting chiefly of the poor of this world, harassed with persecution, and disturbed by heretics, will now make a very great one; the kings of the earth coming into it, the wealth and riches of the world falling into the hands of the saints, the greatness of the kingdom under the whole heaven being given to them; Christianity will be the universal religion of men, and which will be attended with the greatest spirituality, holiness of life, purity of doctrine, worship, and discipline, and freedom from persecution, as follows. In the word  rendered, \"of the increase\", the letter  in the middle of it, is shut, which in other places is open. The Jews seek for mysteries in this. Aben Ezra says, it respects the miracle of the sun, whose shadow returned back in Hezekiah's time; this is said, to serve an hypothesis; Kimchi observes, on the contrary, that in, Ezra (it is in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Nehemiah 2:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") the same letter at the end of a word is open, which used to be shut, where mention is made of the walls of Jerusalem being broken down; and thinks is has this mystery in it, that at the time of the salvation, the walls of Jerusalem, that were broken down during the captivity, should be stopped up, and then the government should be opened, which was shut, until the King Messiah came. If there is any mystery in this, it may denote that the government of Christ, which would be for a time straitened, and kept in narrow bounds and limits, should hereafter be extended throughout the world, to the four corners of it, to be firm and stable, perfect and complete; which the figure of this letter, being, shut, and foursquare, may be an emblem of. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 21:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And peace there shall be no end; this respects both the increase and perpetuity of the peace of Christ's kingdom. The peace of believers, under the Gospel dispensation, is greater than that of the saints under the legal dispensation, whose sacrifices could not remove a consciousness of sin and its guilt; and who, through various laws threatening with death, were all their lifetime subject to bondage; but great is the peace of New Testament saints, through the blood, righteousness, and sacrifice of Christ, and which may be increased more and more; and in the latter day there will be more peace among themselves; Ephraim shall not envy Judah, nor Judah vex Ephraim; the sticks of Joseph and Judah shall be one nor will there ever be any more discord between Jew and Gentile, the lion and the lamb shall lie down together; there will be no more war among the nations, after the battle of Armageddon; and no more persecution, after the slaughter of the witnesses; and this abundance of peace, spiritual and temporal, will be as long as the moon endures, Psalm 72:7 and all this will issue in eternal peace in the world to come: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And peace there shall be no end; this respects both the increase and perpetuity of the peace of Christ's kingdom. The peace of believers, under the Gospel dispensation, is greater than that of the saints under the legal dispensation, whose sacrifices could not remove a consciousness of sin and its guilt; and who, through various laws threatening with death, were all their lifetime subject to bondage; but great is the peace of New Testament saints, through the blood, righteousness, and sacrifice of Christ, and which may be increased more and more; and in the latter day there will be more peace among themselves; Ephraim shall not envy Judah, nor Judah vex Ephraim; the sticks of Joseph and Judah shall be one nor will there ever be any more discord between Jew and Gentile, the lion and the lamb shall lie down together; there will be no more war among the nations, after the battle of Armageddon; and no more persecution, after the slaughter of the witnesses; and this abundance of peace, spiritual and temporal, will be as long as the moon endures, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 72:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and all this will issue in eternal peace in the world to come: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "upon the throne of David, and upon his kingdom; that is, on it the Prince of peace shall sit, who is David's son, according to the flesh, and so his heir; see Luke 1:32 and which must be understood spiritually of the church and people of Christ, who are his throne and kingdom; in whose hearts he reigns by his grace and Spirit: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "upon the throne of David, and upon his kingdom; that is, on it the Prince of peace shall sit, who is David's son, according to the flesh, and so his heir; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 1:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and which must be understood spiritually of the church and people of Christ, who are his throne and kingdom; in whose hearts he reigns by his grace and Spirit: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "to order it; dispose, rectify, put into form and order, and adorn and beautify, by enacting laws for them, writing them on their hearts, and putting his Spirit within them, to enable them to keep them; and by setting persons over them, under him, as deputies and sub-governors, guides and rulers, to explain his laws, and enforce them; to teach them to observe all things commanded by him; to whom he gives gifts for usefulness and service; and whose ministry he blesses, for the conversion and gathering in of others, and so repairs and glorifies the house of his kingdom; and also by granting his presence in his word and ordinances: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and to establish it with justice and judgment; by convincing men by his Spirit of righteousness and judgment; by revealing in his Gospel his own righteousness to them; by forming in their hearts the new man, which is created in righteousness and true holiness; by teaching them to live soberly, righteously, and godly; and by protecting them from all their enemies: and so he establishes particular believers in the faith of himself, and with the doctrine of faith, that they persevere to the end; and his whole church upon himself, the Rock of ages, that the gates of hell shall not prevail against it; and in the latter day he will establish it upon the top of the mountains, Isaiah 2:2, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and to establish it with justice and judgment; by convincing men by his Spirit of righteousness and judgment; by revealing in his Gospel his own righteousness to them; by forming in their hearts the new man, which is created in righteousness and true holiness; by teaching them to live soberly, righteously, and godly; and by protecting them from all their enemies: and so he establishes particular believers in the faith of himself, and with the doctrine of faith, that they persevere to the end; and his whole church upon himself, the Rock of ages, that the gates of hell shall not prevail against it; and in the latter day he will establish it upon the top of the mountains, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 2:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "from henceforth, even for ever; Christ's throne is for ever and ever, his kingdom is an everlasting one; he will have no successor in it, nor any rival that shall ever dispossess him of it; all other kingdoms will cease, but his will remain for ever: though this clause, according to the accents, is to be connected with what follows (w), thus, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "from henceforth, even for ever. The zeal of the Lord of hosts will perform this; all that is said in this verse, and in the context, respecting the incarnation of Christ and his kingdom; the veracity, faithfulness, and power of God, are engaged to perform whatever he has purposed and promised; and his zeal, which is no other than his fervent flaming love, will move him to it, and is effectual to accomplish it; his fervent love for his own glory, which is his ultimate end in all his works of nature, providence, and grace, will engage him to fulfil whatever is foretold concerning the birth of Christ, and redemption by him, and his offices and kingdom; since this is greatly concerned in all these things, his zeal or fervent love to his Son, shown in giving all things into his hands, in committing all judgment to him, that men may honour him as they do the Father, will move him to increase his government and peace, and make him his firstborn higher than the kings of the earth; and his zeal or fervent love to his people will put him upon all this, since it is for their good, as well as for his own glory, and the honour of his Son; what the queen of Sheba said of Solomon may be said of Christ and his people, 1 Kings 10:9. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "from henceforth, even for ever. The zeal of the Lord of hosts will perform this; all that is said in this verse, and in the context, respecting the incarnation of Christ and his kingdom; the veracity, faithfulness, and power of God, are engaged to perform whatever he has purposed and promised; and his zeal, which is no other than his fervent flaming love, will move him to it, and is effectual to accomplish it; his fervent love for his own glory, which is his ultimate end in all his works of nature, providence, and grace, will engage him to fulfil whatever is foretold concerning the birth of Christ, and redemption by him, and his offices and kingdom; since this is greatly concerned in all these things, his zeal or fervent love to his Son, shown in giving all things into his hands, in committing all judgment to him, that men may honour him as they do the Father, will move him to increase his government and peace, and make him his firstborn higher than the kings of the earth; and his zeal or fervent love to his people will put him upon all this, since it is for their good, as well as for his own glory, and the honour of his Son; what the queen of Sheba said of Solomon may be said of Christ and his people, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 10:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(w) So Junius and Tremellius, whom Reinbeck commends, De Accent. p. 387. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(w) So Junius and Tremellius, whom Reinbeck commends, De Accent. p. 387. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Of the increase of his government and peace there shall be no end, upon the throne of David, and upon his kingdom, to order it, and to establish it with judgment and with justice from henceforth even for ever. {l} The zeal of the LORD of hosts will perform this.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Of the increase of ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "his",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " government and peace ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "there shall be",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " no end, upon the throne of David, and upon his kingdom, to order it, and to establish it with judgment and with justice from henceforth even for ever. ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{l}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " The zeal of the LORD of hosts will perform this.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(l) His singular love and care for his elect.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The extension and consolidation of the Messiah’s rule.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Of the increase … end",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "For the increase of authority and for peace without end",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c. The final M (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ם",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") in the original points to some uncertainty of text, which can also be traced in the translation of the LXX. It is thought by some to have arisen through dittography of the last two letters of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 9:6",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 9:6",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Isaiah 9:7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 9:7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " would then begin “increased is authority.” But the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Qěrê",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " gives the better sense.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "upon the throne … kingdom",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "On the throne and kingdom of David",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Messiah succeeds to David’s throne and is doubtless conceived as his lineal descendant.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to order it",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Better, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "to confirm it",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The throne is established (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 20:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 16:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") not by force and conquest but by the moral qualities of ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "judgment and righteousness",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (see ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 1:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") in the government.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the zeal of the Lord of hosts will perform this",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] exactly as ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 37:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The word “zeal” or “jealousy” is used of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "passion",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in a variety of senses, but chiefly with the implied idea of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "resentment",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". When applied to Jehovah it appears always to express the reaction of His holiness called forth by some injury to His honour. Perhaps the closest parallel to the idea here is ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 1:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 8:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " “I am jealous ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for Zion",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " with a great jealousy.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 7.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Of the increase of his government and peace there shall be no end.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The Messiah's kingdom shall ever increase more and more; there shall be no limits to it; ultimately it shall fill the world (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 28:18, 19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The continual spread of Christianity tends to the accomplishment of this prophecy. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Upon the throne of David, and upon his kingdom.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " That the Messiah is to sit on the throne of David, suggests, but does not absolutely imply, his Davidic descent. That descent is, however, announced with sufficient clearness in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 11:1, 10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "To order it, and to establish it",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". A ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "gradual",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " establishment of the kingdom would seem to be implied, such as is taught also in the parables of the mustard seed and the leaven. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "From henceforth even forever",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The kingdom is to be both universal in respect of extent (see the first note on the verse), and in respect of duration eternal. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The zeal",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "jealousy",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". God's jealousy of his own honor, which is bound up with the prosperity and final triumph of his people over all their enemies, will assure the performance of all that is here prophesied. Isaiah 9:7",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "\"To the increase of government and to peace without end, upon the throne of David, and over his Kingdom, to strengthen it, and to support it through judgment and righteousness from henceforth even for ever. The jealousy of Jehovah of hosts will fulfil this.\" למרבּה (written with Mêm clausum in the middle of the one word, and, according to Elias Levita, properly to be read רבּה לם, iis magnificando, in accordance with this way of writing the word)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: When Bar-Kappara says (b. Sanhedrin 94a) that God designed to make Hezekiah the Messiah and Sennacherib Gog and Magog, but that Hezekiah was not found worthy of this, and therefore the Mem of l'marbeh was closed, there is so far some sense in this, that the Messianic hopes really could centre for a certain time in Hezekiah; whereas the assertion of a certain Hillel (ib. 98b), that Hezekiah was actually the Messiah of Israel, and no other was to be expected, is nothing but the perverted fancy of an empty brain. For an instance of the opposite, see Nehemiah 2:13, פרוצים הם, on which passage the Midrash observes, \"The broken walls of Jerusalem will be closed in the day of salvation, and the government which has been closed up to the time of the King Messiah will be opened then.\"))",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: When Bar-Kappara says (b. Sanhedrin 94a) that God designed to make Hezekiah the Messiah and Sennacherib Gog and Magog, but that Hezekiah was not found worthy of this, and therefore the Mem of l'marbeh was closed, there is so far some sense in this, that the Messianic hopes really could centre for a certain time in Hezekiah; whereas the assertion of a certain Hillel (ib. 98b), that Hezekiah was actually the Messiah of Israel, and no other was to be expected, is nothing but the perverted fancy of an empty brain. For an instance of the opposite, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nehemiah 2:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", פרוצים הם, on which passage the Midrash observes, \"The broken walls of Jerusalem will be closed in the day of salvation, and the government which has been closed up to the time of the King Messiah will be opened then.\"))",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "is not a participle here, but a substantive after the forms מראה, מעשׂה, and that not from הרבּה, but from רבה, an infinitive noun expressing, according to its formation, the practical result of an action, rather than the abstract idea.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: We have already observed at p. 101, that this substantive formation had not a purely abstract meaning even at the first. Frst has given the correct explanation in his Lehrgebude der Aram. Idiome, 130.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ever extending dominion and endless peace will be brought in by the sublime and lofty King's Son, when He sits upon the throne of David and rules over David's kingdom. He is a semper Augustus, i.e., a perpetual increaser of the kingdom; not by war, however, but with the spiritual weapons of peace. And within He gives to the kingdom \"judgment\" (mishpât) and \"righteousness\" (zedâkâh), as the foundations and pillars of its durability: mishpât, judgment or right, which He pronounces and ordains; and righteousness, which He not only exercises Himself, but transfers to the members of His kingdom. This new epoch of Davidic sovereignty was still only a matter of faith and hope. But the zeal of Jehovah was the guarantee of its realization. The accentuation is likely to mislead here, inasmuch as it makes it appear as though the words \"from henceforth even for ever\" (me‛attâh v‛ad ōlâm) belonged to the closing sentence, whereas the eternal perspective which they open applies directly to the reign of the great Son of David, and only indirectly to the work of the divine jealousy. \"Zeal,\" or jealousy, kin'âh, lit., glowing fire, from קנּא, Arab. kanaa, to be deep red (Deuteronomy 4:24), is one of the deepest of the Old Testament ideas, and one of the most fruitful in relation to the work of reconciliation. It is two-sided. The fire of love has for its obverse the fire of wrath. For jealousy contends for the object of its love against everything that touches either the object or the love itself.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Ever extending dominion and endless peace will be brought in by the sublime and lofty King's Son, when He sits upon the throne of David and rules over David's kingdom. He is a semper Augustus, i.e., a perpetual increaser of the kingdom; not by war, however, but with the spiritual weapons of peace. And within He gives to the kingdom \"judgment\" (mishpât) and \"righteousness\" (zedâkâh), as the foundations and pillars of its durability: mishpât, judgment or right, which He pronounces and ordains; and righteousness, which He not only exercises Himself, but transfers to the members of His kingdom. This new epoch of Davidic sovereignty was still only a matter of faith and hope. But the zeal of Jehovah was the guarantee of its realization. The accentuation is likely to mislead here, inasmuch as it makes it appear as though the words \"from henceforth even for ever\" (me‛attâh v‛ad ōlâm) belonged to the closing sentence, whereas the eternal perspective which they open applies directly to the reign of the great Son of David, and only indirectly to the work of the divine jealousy. \"Zeal,\" or jealousy, kin'âh, lit., glowing fire, from קנּא, Arab. kanaa, to be deep red (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 4:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), is one of the deepest of the Old Testament ideas, and one of the most fruitful in relation to the work of reconciliation. It is two-sided. The fire of love has for its obverse the fire of wrath. For jealousy contends for the object of its love against everything that touches either the object or the love itself.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Cf., Weber, On the Wrath of God (p. xxxv). It is evident that by kin'âh, ζῆλος, we are to understand the energy of love following up its violated claims upon the creature, from the comparison so common in the Scriptures between the love of God to His church and connubial affection. It is the jealousy of absolute love, which seeks to be loved in return, and indeed demands undivided love, and asserts its claim to reciprocity of love wherever this claim is refused. In a word, it is the self-vindication of scornful love. But this idea includes not only jealousy seeking the recovery of what it has lost, but also jealousy that consumes what cannot be saved (Nahum 1:2; Hebrews 10:27); and the Scriptures therefore deduce the wrath, by which the love resisted affirms itself, and the wrath which meets those who have resisted love in the form of absolute hostility-in other words, the jealousy of love as well as the jealousy of hatred-not from love and holiness as two entirely distinct sources, but from the single source of absolute holy love, which, just because it is absolute and holy, repels and excludes whatever will not suffer itself to be embraced (Joshua 24:19).)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: Cf., Weber, On the Wrath of God (p. xxxv). It is evident that by kin'âh, ζῆλος, we are to understand the energy of love following up its violated claims upon the creature, from the comparison so common in the Scriptures between the love of God to His church and connubial affection. It is the jealousy of absolute love, which seeks to be loved in return, and indeed demands undivided love, and asserts its claim to reciprocity of love wherever this claim is refused. In a word, it is the self-vindication of scornful love. But this idea includes not only jealousy seeking the recovery of what it has lost, but also jealousy that consumes what cannot be saved (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nahum 1:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 10:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "); and the Scriptures therefore deduce the wrath, by which the love resisted affirms itself, and the wrath which meets those who have resisted love in the form of absolute hostility-in other words, the jealousy of love as well as the jealousy of hatred-not from love and holiness as two entirely distinct sources, but from the single source of absolute holy love, which, just because it is absolute and holy, repels and excludes whatever will not suffer itself to be embraced (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 24:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Jehovah loves His nation. That He should leave it in the hands of such bad Davidic kings as Ahaz, and give it up to the imperial power of the world, would be altogether irreconcilable with this love, if continued long. But His love flares up, consumes all that is adverse, and gives to His people the true King, in whom that which was only foreshadowed in David and Solomon reaches its highest antitypical fulfilment. With the very same words, \"the zeal of Jehovah of hosts,\" etc., Isaiah seals the promise in Isaiah 37:32. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Jehovah loves His nation. That He should leave it in the hands of such bad Davidic kings as Ahaz, and give it up to the imperial power of the world, would be altogether irreconcilable with this love, if continued long. But His love flares up, consumes all that is adverse, and gives to His people the true King, in whom that which was only foreshadowed in David and Solomon reaches its highest antitypical fulfilment. With the very same words, \"the zeal of Jehovah of hosts,\" etc., Isaiah seals the promise in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 37:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      }
    ]
  }
]