[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Zechariah 12:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 12:3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I will make Jerusalem a burdensome stone — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Jerusalem is here compared to a stone of great weight, which, being too heavy for those who attempted to lift it up, or remove it, falls back upon them and crushes them to pieces. St. Jerome, in a note on the place, speaks of an exercise, which, he says, was common in Palestine, and throughout all Judea, in his days, in which the young men, who were ambitious to show their strength, used to lift up stones of enormous weight, as high as they could, some to their knees, others to their navel, their shoulders, and even their heads; and some placed them on the top of their heads, with their hands erect and joined together. In this exercise, it is evident, they must have been in great danger of the stone’s falling upon them and bruising them, or even crushing them to pieces. Mr. Lowth, who quotes this passage from Jerome, remarks that, to the same sense, Christ saith, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 21:44",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "On whomsoever this stone shall fall, it will grind him to powder. All that burden themselves with it shall be cut in pieces — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "All that undertake to contend with Jerusalem shall be either destroyed or greatly injured, as men will have their flesh torn or bruised that let a heavy stone fall upon them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Though all the people of the earth be gathered together against it — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "It is obvious, that by ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "all, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "here is meant only ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "many people, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "as it is expressed ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 38:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 38:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 38:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Thou, and many people with thee.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12:1-8 Here is a Divine prediction, which will be a heavy burden to all the enemies of the church. But it is for Israel; for their comfort and benefit. It is promised that God will make foolish the counsels, and weaken the courage of the enemies of the church. The exact meaning is not clear; but God often begins by calling the poor and despised; and in that day even the feeblest will resemble David, and be as eminent in courage and every thing good. Desirable indeed is it that the examples and labours of Christians should render them as fire among wood, as a torch in a sheaf, to kindle the flame of Divine love, to spread religion on the right hand and on the left.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "I will make Jerusalem a burdensome stone to all nations - What is \"a stone to all nations?\" It is not a rock or anything in its own nature immovable, but a \"stone,\" a thing rolled up and down, moved, lifted, displaced, piled on others, in every way at the service and command of people, to do with it what they willed. So they thought of that \"stone cut out without hands\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 2:45",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; that \"tried stone and sure foundation, laid in Zion\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 28:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; that \"stone\" which, God said in Zechariah, \"I have laid\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 3:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; of which our Lord says, \"the stone, which the builders rejected, is become the head of the corner\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 20:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; \"whosoever shall fall on this stone shall be broken, but on whomsoever it shall fall, it will grind him to powder\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 21:44",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 20:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Church, built on the stone, seems a thing easily annihilated; ten persecutions in succession strove to efface it; Diocletian erected a monument, commemorating that the Christian name was blotted out . It survived; he perished.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The image may have been suggested by the custom, so widely prevailing in Judaea, of trying the relative strength of young men, by lifting round stones selected for that end .",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Jerome: \"The meaning then is, I will place, Jerusalem to all nations like a very heavy stone  to be lifted up. They will lift it up, and according to their varied strength, will waste it; but it must needs be, that, while it is lifted, in the very strain of lifting the weight, that most heavy stone should leave some scission or rasure on the bodies of those who lift it. Of the Church it may be interpreted thus; that all persecutors, who fought against the house of the Lord, are inebriated with that cup, which Jeremiah gives to all nations, to drink and be inebriated and fall and vomit and be mad. Whosoever would uplift the stone shall lift it, and in the anger of the Lord, whereby He chastens sinners, will hold it in his hands; but he himself will not go unpunished, the sword of the Lord fighting against him.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "All that burden themselves with it will be cut to pieces - More exactly, \"scarified, lacerated;\" shall bear the scars. \"Though\" (rather, \"and\") \"all the people (peoples, nations) of the earth shall be gathered together against it.\" The prophet marshals them all against Jerusalem, only to say how they should perish before it. So in Joel God says, \"I will also gather all nations, and will bring them down to the valley of Jehoshaphat\" , speaking of that last closing strife of antichrist against God. Wars against Israel had either been petty, though anti-theistic, wars of neighboring petty nations, pitting their false gods against the True, or one, though world-empire wielded by a single will. The more God made Himself known, the fiercer the opposition. The Gospel claiming \"obedience to the faith among all nations\" Romans 1:5, provoked universal rebellion. Herod and Pontius Pilate became friends through rejection of Christ; the Roman Caesar and the Persian Sapor, Goths and Vandals, at war with one another, were one in persecuting Christ and the Church. Yet in vain. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "All that burden themselves with it will be cut to pieces - More exactly, \"scarified, lacerated;\" shall bear the scars. \"Though\" (rather, \"and\") \"all the people (peoples, nations) of the earth shall be gathered together against it.\" The prophet marshals them all against Jerusalem, only to say how they should perish before it. So in Joel God says, \"I will also gather all nations, and will bring them down to the valley of Jehoshaphat\" , speaking of that last closing strife of antichrist against God. Wars against Israel had either been petty, though anti-theistic, wars of neighboring petty nations, pitting their false gods against the True, or one, though world-empire wielded by a single will. The more God made Himself known, the fiercer the opposition. The Gospel claiming \"obedience to the faith among all nations\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 1:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", provoked universal rebellion. Herod and Pontius Pilate became friends through rejection of Christ; the Roman Caesar and the Persian Sapor, Goths and Vandals, at war with one another, were one in persecuting Christ and the Church. Yet in vain. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3. (Zec 14:4, 6-9, 13). Jerome states it was a custom in Palestine to test the strength of youths by their lifting up a massive stone; the phrase, \"burden themselves with it,\" refers to this custom. Compare Mt 21:44: The Jews \"fell\" on the rock of offense, Messiah, and were \"broken\"; but the rock shall fall on Antichrist, who \"burdens himself with it\" by his assault on the restored Jews, and \"grind him to powder.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "all … people of … earth—The Antichristian confederacy against the Jews shall be almost universal.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "In that day; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in the times of the heathens afflicting the church, from the repair of Jerusalem till Christ’s coming in the flesh, and in succeeding times since; but the day of the full accomplishment of this prophecy is a day known to the Lord. A burdensome stone; too heavy for them, though many join together to remove it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "For all people; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " though all people of this known world should burden themselves with her. Shall be cut in pieces: they would be crushed to pieces, as a man that falls under a weighty and massy stone. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Though all the people of the earth be gathered together against it:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " many nations have been confederate, now if you would suppose all through the whole world in league against Jerusalem, yet they could not stand under the weight of his displeasure, who is provoked by such attempts, he would grind them to powder. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And in that day will I make Jerusalem a burdensome stone for all people,.... The Targum renders it \"a stone of offence\"; at which they shall stumble and fall; but it seems to design the immovableness of the state and condition of Jerusalem, that those who attempt to remove her out of her place, or to make any alteration in her happy circumstances, will not be able to do it, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 125:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Jerom makes mention of a custom in the cities of Palestine, and which continued to his times throughout all Judea, that large, huge, round stones, used to be placed in the towns and villages, which the youths exercised themselves with, by trying to lift them up as high as they could, by which they showed their strength; and the same ancient writer observes that a like custom obtained in Greece; for he says he himself saw in the tower at Athens, by the image of Minerva, a globe of brass, of at very great weight, which he, through the weakness of his body, could not move; and asking the meaning of it, he was told that the strength of wrestlers was tried by it; and no man might be admitted a combatant, until it was known, by the lifting up of that weight, with whom he should be matched; and the throwing of the \"discus\" was an ancient military exercise, as old as the times of Homer, who speaks (z) of it; and is mentioned by Latin writers, as appears from some lines of Martial (a); see the Apocrypha: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"In like manner also Judas gathered together all those things that were lost by reason of the war we had, and they remain with us,'' (2 Maccabees 2:14) ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and this, as it tried the strength of men, so it was sometimes dangerous to themselves, or to bystanders, lest it should fall upon their heads: and as it was usual to defend themselves and oppress enemies by casting stones at them, so young men used to exercise themselves by lifting up and casting large stones; to which Virgil (b) sometimes refers; and it is well known that Abimelech was killed even by a woman casting a piece of a millstone upon his head, Judges 9:53 and such heavy stones, and the lifting of them up, in order to cast them, may he alluded to here: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and this, as it tried the strength of men, so it was sometimes dangerous to themselves, or to bystanders, lest it should fall upon their heads: and as it was usual to defend themselves and oppress enemies by casting stones at them, so young men used to exercise themselves by lifting up and casting large stones; to which Virgil (b) sometimes refers; and it is well known that Abimelech was killed even by a woman casting a piece of a millstone upon his head, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 9:53",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and such heavy stones, and the lifting of them up, in order to cast them, may he alluded to here: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "all that burden themselves with it shall be cut in pieces; all that attempt to unsettle and remove it shall be pressed down with the weight of it, and be utterly destroyed: or, \"shall be torn to pieces\" (c); as men's hands are cut and torn with rough and heavy stones, The Targum is, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"all that injure her shall be consumed;'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "which gives the sense of the passage: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "though all the people of the earth be gathered together against it; so safe and secure will the people of God be; he being a wall of fire round about them, and the glory in the midst of them. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(z) Iliad. 2. & 23. (a) \"Splendida cum volitent Spartani pondera disci Este procul pueri; sit se nel ille nocens.\" ---Epigr. l. 14. Ep. 157. (b) \"Certabant Troes contra defendere saxis.\" ---Aeneid. l. 9. \"Mijaculis, illi certent defendere saxis.\" --Aeneid. l. 10. --Vid. Lydium de Re Militari, l. 5. c. 2. p. 178, 179. & Menochium de Republica Hebr. l. 6. col. 555, 556. (c)  \"incidendo incidentur\", Montanus, Burkius; \"lacerando lacerabuntur\", Pagninus, Cocceius. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(z) Iliad. 2. & 23. (a) \"Splendida cum volitent Spartani pondera disci Este procul pueri; sit se nel ille nocens.\" ---Epigr. l. 14. Ep. 157. (b) \"Certabant Troes contra defendere saxis.\" ---Aeneid. l. 9. \"Mijaculis, illi certent defendere saxis.\" --Aeneid. l. 10. --Vid. Lydium de Re Militari, l. 5. c. 2. p. 178, 179. & Menochium de Republica Hebr. l. 6. col. 555, 556. (c)  \"incidendo incidentur\", Montanus, Burkius; \"lacerando lacerabuntur\", Pagninus, Cocceius. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And in that day will I make Jerusalem a burdensome stone for all people: all that burden themselves with it shall be cut in pieces, though all the people of the earth be gathered together against it.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a burdensome stone",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] because, as it immediately follows, it proves too heavy for every one who attempts to lift it, and slipping from his grasp wounds and lacerates him. There may possibly be a reference to the custom, if indeed it existed so early as the time of Zechariah, which Jerome describes as prevailing in Palestine in his days. “It is the custom,” he says, “in the cities of Palestine, and to the present day throughout all Judæa the ancient practice is observed, that in villages, towns and forts round stones of very great weight are placed, at which the youth are wont to exercise themselves, and according to their differing strength to lift them, some to the knees, others to the navel, others to the shoulders and head; some exhibiting the greatness of their strength, raise the weight above their head with both their hands straight up.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cut in pieces",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sore wounded",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", R. V.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "A burdensome stone.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Jerusalem shall prove to all the nations that attack it a weight not only too heavy to lift, but one which, itself remaining unhurt, shall wound and injure those who attempt to carry it. Jerome supposes here an allusion to a custom in the towns of Palestine, which prevailed to his day (and, indeed, in Syria even now), of placing round stones of great weight at certain distances, by lifting which the youths tested their bodily strength. But we do not know that this custom existed in Zcehariah's time, and the nations are not gathered together for amusement or display of strength, but for hostile attack. Septuagint, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "λίθον καταπατούμενον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"a stone trodden down,\" which reminds one of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 21:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "Ἱερουσαλὴμ ἔσται πατουμένη ὑπὸ ἐθνῶν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Shall be cut in pieces; i.e.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Shall be cut in pieces; ",
            "children": []
          },
          {
            "element": "span",
            "class": "accented",
            "text": "i",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".e.",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " by the sharp edges of the stone, or, as the Revised Version, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "shall be sore wounded. Though",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "shall be sore wounded. ",
            "children": []
          },
          {
            "element": "span",
            "class": "cmt_word",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Though",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "and",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; Septuagint, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "καὶ ἐπισυναχθήσονται",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": Vulgate, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "et colligentur. All the people",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "et colligentur. ",
            "children": []
          },
          {
            "element": "span",
            "class": "cmt_word",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "All the people",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "peoples",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "of the earth.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " This indicates that the struggle spoken of is no mere local conflict, waged in Maccabean or other times, but the great battle of the world against the Church, which shall rage in the Messianic era. Zechariah 12:3",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "\"Behold, I make Jerusalem a reeling-basin for all the nations round about, and upon Judah also will it be at the siege against Jerusalem. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 12:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And it will come to pass on that day, I will make Jerusalem a burden-stone to all nations: all who lift it up will tear rents for themselves; and all the nations of the earth will gather together against it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 12:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In that day, is the saying of Jehovah, will I smite every horse with shyness, and its rider with madness, and over the house of Judah will I open my eyes, and every horse of the nations will I smite with blindness.\" These verses allude to an attack on the part of the nations upon Jerusalem and Judah, which will result in injury and destruction to those who attack it. The Lord will make Jerusalem a reeling-basin to all nations round about. Saph does not mean threshold here, but basin, or a large bowl, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 12:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". רעל is equivalent to תּרעלה in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 51:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 60:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", viz., reeling. Instead of the goblet, the prophet speaks of a basin, because many persons can put their mouths to this at the same time, and drink out of it (Schmieder). The \"cup of reeling,\" i.e., a goblet filled with intoxicating drink, is a figure very frequently employed to denote the divine judgment, which intoxicates the nations, so that they are unable to stand any longer, and therefore fall to the ground and perish (see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 51:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 60:2 has been explained in very different ways. It is an old and widespread view, that the words \"also upon Judah will it be,\" etc., express the participation of Judah in the siege of Jerusalem. The Chaldee and Jerome both adopt this explanation, that in the siege of Jerusalem Judah will be constrained by the nations to besiege the capital of its own land. The grammatical reason assigned for this view is, that we must either take היה with על in the sense of obligation (it will also be the duty of Judah: Mich., Ros., Ewald), or supply סף־רעל as the subject to יהיה: the reeling-basin will also come upon Judah. But there is great harshness in both explanations. With the former, להלּחם, or some other infinitive, would hardly have been omitted; and with the latter, the preposition ל would stand before יהוּדה, instead of על. Moreover, in what follows there is no indication whatever of Judah's having made common cause with the enemy against Jerusalem; on the contrary, Judah and Jerusalem stand together in opposition to the nations, and the princes of Judah have strength in the inhabitants of Jerusalem (Psalm 60:5), and destroy the enemy to save Jerusalem (Psalm 60:6). Moreover, it is only by a false interpretation that any one can find a conflict between Judah and Jerusalem indicated in Zechariah 14:14. And throughout it is incorrect to designate the attitude of Judah towards Jerusalem in these verses as \"opposition,\" - a notion upon which Ebrard (Offenb. Joh.) and Kliefoth have founded the marvellous view, that by Jerusalem with its inhabitants and the house of David we are to understand the unbelieving portion of Israel; and by Judah with its princes, Christendom, or the true people of God, formed of believing Israelites, and increased by believing Gentiles. Judah is not opposed to Jerusalem, but simply distinguished from it, just as the Jewish kingdom or people is frequently designated by the prophets as Jerusalem and Judah. The גם, which does not separate, but adds, is of itself inapplicable to the idea of opposition. Consequently we should expect the words וגם על יה to express the thought, that Judah will be visited with the same fate as Jerusalem, as Luther, Calvin, and many others follow the Peshito in supposing that they do. היה על has then the meaning to happen, to come over a person; and the only question is, What are we to supply in thought as the subject? The best course is probably to take it from the previous clause, \"that which passes over Jerusalem;\" for the proposal of Koehler to supply mâtsōr as the subject is precluded by the circumstance that mâtsōr, a siege, can only affect a city or fortress (cf. Deuteronomy 20:20), and not a land. The thought is strengthened in Zechariah 12:3. Jerusalem is to become a burden-stone for all nations, which inflicts contusions and wounds upon those who try to lift it up or carry it away (\"experiencing no hurt itself, it causes great damage to them:\" Marck). The figure is founded upon the idea of the labour connected with building, and not upon the custom, which Jerome speaks of as a very common one in his time among the youth of Palestine, of testing and exercising their strength by lifting heavy stones. There is a gradation in the thought, both in the figure of the burdensome stone, which wounds whoever tries to lift it, whilst intoxicating wine only makes one powerless and incapable of any undertaking, and also in the description given of the object, viz., in Zechariah 12:2 all nations round about Jerusalem, and in Zechariah 12:3 all peoples and all nations of the earth. It is only in the last clause of Zechariah 12:3 that the oppression of Jerusalem indicated in the two figures is more minutely described, and in Zechariah 12:4 that its overthrow by the help of God is depicted. The Lord will throw the mind and spirit of the military force of the enemy into such confusion, that instead of injuring Jerusalem and Judah, it will rush forward to its own destruction. Horses and riders individualize the warlike forces of the enemy. The rider, smitten with madness, turns his sword against his own comrades in battle (cf. Zechariah 14:3; Judges 7:22; 1 Samuel 14:20). On the other hand, Jehovah will open His eyes upon Judah for its protection (1 Kings 8:29; Nehemiah 1:6; Psalm 32:8). This promise is strengthened by the repetition of the punishment to be inflicted upon the enemy. Not only with alarm, but with blindness, will the Lord smite their horses. We have an example of this in 2 Kings 6:18, where the Lord smote the enemy with blindness in answer to Elisha's prayer, i.e., with mental blindness, so that, instead of seizing the prophet, they fell into the hands of Israel. The three plagues, timmâhōn, shiggâ‛ōn, and ‛ivvârōn, are those with which rebellious Israelites are threatened in Deuteronomy 28:28. The \"house of Judah\" is the covenant nation, the population of Judah including the inhabitants of Jerusalem, as we may see from what follows. ",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 60:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " has been explained in very different ways. It is an old and widespread view, that the words \"also upon Judah will it be,\" etc., express the participation of Judah in the siege of Jerusalem. The Chaldee and Jerome both adopt this explanation, that in the siege of Jerusalem Judah will be constrained by the nations to besiege the capital of its own land. The grammatical reason assigned for this view is, that we must either take היה with על in the sense of obligation (it will also be the duty of Judah: Mich., Ros., Ewald), or supply סף־רעל as the subject to יהיה: the reeling-basin will also come upon Judah. But there is great harshness in both explanations. With the former, להלּחם, or some other infinitive, would hardly have been omitted; and with the latter, the preposition ל would stand before יהוּדה, instead of על. Moreover, in what follows there is no indication whatever of Judah's having made common cause with the enemy against Jerusalem; on the contrary, Judah and Jerusalem stand together in opposition to the nations, and the princes of Judah have strength in the inhabitants of Jerusalem (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 60:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and destroy the enemy to save Jerusalem (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 60:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Moreover, it is only by a false interpretation that any one can find a conflict between Judah and Jerusalem indicated in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 14:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And throughout it is incorrect to designate the attitude of Judah towards Jerusalem in these verses as \"opposition,\" - a notion upon which Ebrard (Offenb. Joh.) and Kliefoth have founded the marvellous view, that by Jerusalem with its inhabitants and the house of David we are to understand the unbelieving portion of Israel; and by Judah with its princes, Christendom, or the true people of God, formed of believing Israelites, and increased by believing Gentiles. Judah is not opposed to Jerusalem, but simply distinguished from it, just as the Jewish kingdom or people is frequently designated by the prophets as Jerusalem and Judah. The גם, which does not separate, but adds, is of itself inapplicable to the idea of opposition. Consequently we should expect the words וגם על יה to express the thought, that Judah will be visited with the same fate as Jerusalem, as Luther, Calvin, and many others follow the Peshito in supposing that they do. היה על has then the meaning to happen, to come over a person; and the only question is, What are we to supply in thought as the subject? The best course is probably to take it from the previous clause, \"that which passes over Jerusalem;\" for the proposal of Koehler to supply mâtsōr as the subject is precluded by the circumstance that mâtsōr, a siege, can only affect a city or fortress (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 20:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and not a land. The thought is strengthened in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 12:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Jerusalem is to become a burden-stone for all nations, which inflicts contusions and wounds upon those who try to lift it up or carry it away (\"experiencing no hurt itself, it causes great damage to them:\" Marck). The figure is founded upon the idea of the labour connected with building, and not upon the custom, which Jerome speaks of as a very common one in his time among the youth of Palestine, of testing and exercising their strength by lifting heavy stones. There is a gradation in the thought, both in the figure of the burdensome stone, which wounds whoever tries to lift it, whilst intoxicating wine only makes one powerless and incapable of any undertaking, and also in the description given of the object, viz., in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 12:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " all nations round about Jerusalem, and in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 12:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " all peoples and all nations of the earth. It is only in the last clause of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 12:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " that the oppression of Jerusalem indicated in the two figures is more minutely described, and in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 12:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " that its overthrow by the help of God is depicted. The Lord will throw the mind and spirit of the military force of the enemy into such confusion, that instead of injuring Jerusalem and Judah, it will rush forward to its own destruction. Horses and riders individualize the warlike forces of the enemy. The rider, smitten with madness, turns his sword against his own comrades in battle (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 14:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 7:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 14:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). On the other hand, Jehovah will open His eyes upon Judah for its protection (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 8:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nehemiah 1:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 32:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). This promise is strengthened by the repetition of the punishment to be inflicted upon the enemy. Not only with alarm, but with blindness, will the Lord smite their horses. We have an example of this in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 6:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where the Lord smote the enemy with blindness in answer to Elisha's prayer, i.e., with mental blindness, so that, instead of seizing the prophet, they fell into the hands of Israel. The three plagues, timmâhōn, shiggâ‛ōn, and ‛ivvârōn, are those with which rebellious Israelites are threatened in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 28:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The \"house of Judah\" is the covenant nation, the population of Judah including the inhabitants of Jerusalem, as we may see from what follows. ",
            "children": []
          }
        ]
      }
    ]
  }
]