[{"num":3,"verse":"The manner of peace offerings, and beasts for the same. 17 The Israelites may not eat fat nor blood."},{"num":1,"verse":"Also if his oblation be a peace offering, if he will offer of the drove (whether it be male or female) he shall offer such as is without blemish, before the Lord."},{"num":2,"verse":"And shall put his hand upon the head of his offering, and kill it at the door of the Tabernacle of the Congregation: and Aaron’s sons the Priests shall sprinkle the blood upon the altar round about."},{"num":3,"verse":"So he shall offer part of the peace offering, as a sacrifice made by fire unto the Lord, even the fat that covereth the inwards, and all the fat that is upon the inwards."},{"num":4,"verse":"He shall also take away the two kidneys, and the fat that is on them, and upon the flanks, and the caul on the liver with the kidneys."},{"num":5,"verse":"And Aaron’s sons shall burn it on the altar, with the burnt offering, which is upon the wood, that is on the fire: this is a sacrifice made by fire for a sweet savor unto the Lord."},{"num":6,"verse":"¶ Also if his oblation be a peace offering unto the Lord out of the flock, whether it be male or female, he shall offer it without blemish."},{"num":7,"verse":"If he offer a Lamb for his oblation, then he shall bring it before the Lord."},{"num":8,"verse":"And lay his hand upon the head of his offering, and shall kill it before the Tabernacle of the Congregation, and Aaron’s sons shall sprinkle the blood thereof round about upon the altar."},{"num":9,"verse":"After, of the peace offerings he shall offer an offering made by fire unto the Lord: he shall take away the fat thereof, and the rump altogether, hard by the back bone, and the fat that covereth the inwards, and all the fat that is upon the inwards."},{"num":10,"verse":"Also he shall take away the two kidneys, with the fat that is upon them, and upon the flanks, and the caul upon the liver with the kidneys."},{"num":11,"verse":"Then the Priest shall burn it upon the altar, as the meat of an offering made by fire unto the Lord."},{"num":12,"verse":"¶ Also if his offering be a goat, then shall he offer it before the Lord,"},{"num":13,"verse":"And shall put his hand upon the head of it, and kill it before the Tabernacle of the Congregation, and the sons of Aaron shall sprinkle the blood thereof upon the altar round about."},{"num":14,"verse":"Then he shall offer thereof his offering, even an offering made by fire unto the Lord, the fat that covereth the inwards, and all the fat that is upon the inwards."},{"num":15,"verse":"Also he shall take away the two kidneys, and the fat that is upon them, and upon the flanks, and the caul upon the liver with the kidneys."},{"num":16,"verse":"So the Priest shall burn them upon the altar, as the meat of an offering made by fire for a sweet savor: all the fat is the Lord’s."},{"num":17,"verse":"This shall be a perpetual ordinance for your generations, throughout all your dwellings, so that ye shall eat neither fat nor blood."}]