[{"header":"Rules for Friendship Offerings"},{"num":3,"verse":"“ ‘Suppose someone brings a friendship offering. If they offer an animal from the herd, it can be either male or female. It must not have any flaws. They must offer it in the sight of the Lord. "},{"num":2,"verse":"They must place their hand on the animal’s head. It must be killed at the entrance to the tent of meeting. Then the priests in Aaron’s family line must splash the blood against the sides of the altar. "},{"num":3,"verse":"Part of the friendship offering must be given to the Lord as a food offering. It must include all the fat that is connected to them. "},{"num":4,"verse":"It must include both kidneys with the fat on them next to the lower back muscles. It must also include the long part of the liver. All of it must be removed together with the kidneys. "},{"num":5,"verse":"Then the priests in Aaron’s family line must burn it on the altar. They must burn it on top of the burnt offering that is lying on the burning wood. It is a food offering. Its smell pleases the Lord."},{"num":6,"verse":"“ ‘Suppose someone brings an animal from the flock as a friendship offering to the Lord. It can be either male or female. It must not have any flaws. "},{"num":7,"verse":"If they bring a lamb, they must offer it in the sight of the Lord. "},{"num":8,"verse":"They must place their hand on the lamb’s head. It must be killed there in front of the tent of meeting. Then the priests in Aaron’s family line must splash its blood against the sides of the altar. "},{"num":9,"verse":"Part of the offering must be brought as a sacrifice presented to the Lord. It must include the lamb’s fat and the entire fat tail cut off close to the backbone. It must include all the fat that is connected to them. "},{"num":10,"verse":"It must include both kidneys with the fat on them next to the lower back muscles. The offering must also include the long part of the liver. That must be removed together with the kidneys. "},{"num":11,"verse":"Then the priest must burn the offering on the altar as food. It is a food offering presented to the Lord."},{"num":12,"verse":"“ ‘If someone brings a goat, they must offer it in the sight of the Lord. "},{"num":13,"verse":"They must place their hand on its head. It must be killed there in front of the tent of meeting. Then the priests in Aaron’s family line must splash its blood against the sides of the altar. "},{"num":14,"verse":"Part of the offering must be brought as a food offering presented to the Lord. It must include all the fat that is connected to them. "},{"num":15,"verse":"It must include both kidneys with the fat on them next to the lower back muscles. It must also include the long part of the liver. That must be removed together with the kidneys. "},{"num":16,"verse":"Then the priest must burn the offering on the altar as food. It is a food offering. It has a pleasant smell. All the fat belongs to the Lord."},{"num":17,"verse":"“ ‘You must not eat any fat or any blood. That is a law that will last for all time to come. It applies no matter where you live.’ ”"}]