[{"header":"Shalom Offerings"},{"num":3,"verse":"“Now if his offering is a sacrifice of fellowship offerings, if from the herd, whether male or female, he is to offer one without blemish before Adonai. "},{"num":2,"verse":"He shall lay his hand on the head of his offering and slaughter it at the entrance of the Tent of Meeting. Then Aaron’s sons the kohanim are to splash the blood around on the altar. "},{"num":3,"verse":"He is to bring from the sacrifice of fellowship offerings an offering made by fire to Adonai, the fat that covers the innards, all the fat that is on the entrails, "},{"num":4,"verse":"as well as the two kidneys and the fat that is on them which is by the loins, plus the cover on the liver that he must remove with the kidneys. "},{"num":5,"verse":"Aaron’s sons are to burn it up as smoke on the altar on top of the burnt offering, which is over the wood that is on the fire. It is an offering made by fire—a soothing aroma to Adonai."},{"num":6,"verse":"“If his gift for a sacrifice of fellowship offerings to Adonai is from the flock, he is to offer a male or female without blemish. "},{"num":7,"verse":"If he is bringing a lamb for his offering, he should present it before Adonai. "},{"num":8,"verse":"He is to lay his hand on the head of his offering and slaughter it before the Tent of Meeting. Aaron’s sons are to splash its blood around on the altar. "},{"num":9,"verse":"From the sacrifice of fellowship offerings he should bring a gift made by fire to Adonai. Its fat—the entire tail fat cut away close to the backbone, along with the fat that covers the innards and all the fat that is on the entrails, "},{"num":10,"verse":"as well as the two kidneys and the fat that is over them which is by the loins, plus the cover on the liver that he is to remove with the kidneys. "},{"num":11,"verse":"The kohen is to burn it up as smoke on the altar—as a food offering made by fire to Adonai."},{"num":12,"verse":"“If his offering is a goat then he should present it before Adonai. "},{"num":13,"verse":"He is to lay his hand on its head and slaughter it before the Tent of Meeting. Aaron’s sons are to splash its blood around on the altar. "},{"num":14,"verse":"From it he is to offer as his sacrifice an offering made by fire to Adonai, the fat that covers the innards, all the fat that is on the entrails, "},{"num":15,"verse":"the two kidneys and the fat that is over them, which is by the loins, and the cover on the liver, which he must remove with the kidneys. "},{"num":16,"verse":"The kohen is to burn them on the altar. It is the food of the offering made by fire, for a soothing aroma. All fat is for Adonai."},{"num":17,"verse":"“It is to be a perpetual statute throughout your generations in all your dwellings, that you must eat neither fat nor blood.”"}]