[{"num":3,"verse":"That if his offering is a sacrifice of peaceable things, and he will offer of [the] oxen, he shall offer before the Lord a male, either a female, without wem. (And if his offering is a peace offering, and he will offer it from the oxen, he shall offer before the Lord a male, or a female, without blemish, or without fault.)"},{"num":2,"verse":"And he shall set his hand upon the head of his slain sacrifice, which shall be offered in the entering of the tabernacle; and the sons of Aaron, [the] priest(s), shall pour the blood by compass of the altar. (And he shall put his hand on the head of his sacrifice, and shall offer, or shall kill, it at the entrance to the Tabernacle; and the priests, the sons of Aaron, shall throw the blood against all the sides of the altar.)"},{"num":3,"verse":"And they shall offer of the sacrifice of peaceable things into offering to the Lord, the fatness that covereth the entrails, and whatever thing of fatness is within; (And they shall offer for the peace offering, as a burnt sacrifice to the Lord, the fat that covereth the innards, and whatever fat is within;)"},{"num":4,"verse":"they shall offer [the] two kidneys with the fatness by which the guts called ileum be covered, and the caul of the liver, with the little reins, (or with the kidneys)."},{"num":5,"verse":"And they shall burn those on the altar, into burnt sacrifice, when fire is put under the wood, into offering of the sweetest odour to the Lord. (And they shall burn them on the altar, for a burnt sacrifice, when fire is put under the wood, for an offering of the sweetest aroma to the Lord.)"},{"num":6,"verse":"Soothly if his offering is of sheep, and a sacrifice of peaceable things, whether he offereth a male or a female, they shall be without wem. (And if his offering for a peace offering is a sheep, whether he offereth a male or a female, they shall be without blemish.)"},{"num":7,"verse":"If he offer a lamb before the Lord,"},{"num":8,"verse":"he shall set his hand upon the head of his sacrifice, that shall be offered in the porch of the tabernacle of witnessing; and the sons of Aaron shall pour the blood thereof by environ of the altar. (he shall put his hand on the head of his sacrifice, that shall be offered in front of the Tabernacle of the Witnessing; and the priests, the sons of Aaron, shall throw its blood against all the sides of the altar.)"},{"num":9,"verse":"And they shall offer of the sacrifice of peaceable things a sacrifice to the Lord, the inner fatness, and all the tail with the reins, and the fatness that covereth the womb, and all the entrails, (And they shall offer for the peace offering, as a burnt sacrifice to the Lord, the inner fat, and all the tail by the kidneys, and the fat that covereth the womb, and all the innards,)"},{"num":10,"verse":"and ever either little rein, with the fatness which is beside the guts called (the) ileum, and the caul of the maw, with the little reins. (and the two kidneys, with the fat which is beside the haunches, and the caul of the liver, with the kidneys.)"},{"num":11,"verse":"And the priest shall burn them upon the altar, into the feeding, or nourishing, of the fire, and of the offering to the Lord (for a burnt sacrifice to the Lord)."},{"num":12,"verse":"If his offering is a goat, and he offereth it to the Lord,"},{"num":13,"verse":"he shall set his hand on the head thereof, and he shall offer it in the entry of the tabernacle of witnessing; and the sons of Aaron shall pour the blood thereof by compass of the altar. (he shall put his hand on its head, and he shall offer it at the entrance to the Tabernacle of the Witnessing; and the priests, the sons of Aaron, shall throw its blood against all the sides of the altar.)"},{"num":14,"verse":"And they shall take thereof, into the feeding, or nourishing, of the Lord’s fire, the fatness that covereth the womb, and that covereth all the entrails,"},{"num":15,"verse":"and the two little reins with the caul that is on those beside the ileum, and the fatness of the maw, with the entrails that cleave to the little reins."},{"num":16,"verse":"And the priest shall burn those on the altar, into the feeding, or nourishing, of the fire, and of sweetest odour (to make the sweetest aroma); all the fatness shall be the Lord’s,"},{"num":17,"verse":"by everlasting right in generations, and in all your dwelling places, neither in any manner ye shall eat blood, neither fatness. (by an everlasting law for all your generations, in all your dwelling places, for not in any manner shall ye eat any blood, or fat.)"}]