[{"header":"The Calling of the First Disciples"},{"num":5,"verse":"One time, while the crowd was pressing in on Jesus and listening to the word of God, he was standing by the Lake of Gennesaret. "},{"num":2,"verse":"He saw two boats there along the lakeshore. The fishermen had left them and were washing their nets. "},{"num":3,"verse":"Jesus got into one of the boats, which belonged to Simon, and asked him to put out a little from the shore. He sat down and began teaching the crowds from the boat. "},{"num":4,"verse":"When he had finished speaking, he said to Simon, “Put out into the deep water, and let down your nets for a catch.”"},{"num":5,"verse":"Simon answered him, “Master, we worked hard all through the night and caught nothing. But at your word I will let down the nets.” "},{"num":6,"verse":"When they had done this, they caught a great number of fish, and their nets were about to tear apart. "},{"num":7,"verse":"They signaled their partners in the other boat to come and help them. They came and filled both boats, so that they began to sink. "},{"num":8,"verse":"When Simon Peter saw this, he fell down at Jesus’ knees, saying, “Go away from me, because I am a sinful man, Lord.” "},{"num":9,"verse":"For Peter and all those with him were amazed at the number of fish they had caught, "},{"num":10,"verse":"and so were James and John, the sons of Zebedee, who were partners with Simon."},{"num":11,"verse":"After they brought their boats to the shore, they left everything and followed him."},{"header":"Jesus Heals a Leper"},{"num":12,"verse":"On another occasion, Jesus was in one of the towns, and there was a man full of leprosy. When he saw Jesus, he fell on his face and begged him, “Lord, if you are willing, you can make me clean.”"},{"num":13,"verse":"Jesus stretched out his hand and touched him. “I am willing,” he said. “Be made clean.”"},{"num":14,"verse":"Jesus ordered him to tell no one, “But go, show yourself to the priest, and offer what Moses commanded for your cleansing, as a testimony for them.” "},{"num":15,"verse":"The news about him spread even more, and large crowds gathered to listen and be healed of their sicknesses. "},{"num":16,"verse":"But Jesus often withdrew to deserted places and prayed."},{"header":"Jesus Forgives Sins"},{"num":17,"verse":"On one of the days while Jesus was teaching, Pharisees and teachers of the law were sitting there who had come from every village of Galilee and Judea and from Jerusalem. The power of the Lord was with him to heal. "},{"num":18,"verse":"Just then, men who were carrying a paralyzed man on a stretcher tried to bring him in and lay him in front of Jesus. "},{"num":19,"verse":"Since they did not find a way to bring him in because of the crowd, they went up on the roof and lowered him down through the tiles on his stretcher into the middle of the crowd, right in front of Jesus. "},{"num":20,"verse":"When he saw their faith, he said, “Man, your sins have been forgiven.”"},{"num":21,"verse":"The experts in the law and the Pharisees began to think to themselves, “Who is this fellow who speaks blasphemies? Who can forgive sins except God alone?”"},{"num":22,"verse":"But Jesus knew their thoughts and answered them, “Why are you thinking this in your hearts? "},{"num":23,"verse":"Which is easier: to say, ‘Your sins have been forgiven,’ or to say, ‘Get up and walk’? "},{"num":24,"verse":"But so that you may know that the Son of Man has authority on earth to forgive sins. . .” He said to the paralyzed man, “I tell you, get up, take your stretcher, and go home.”"},{"num":25,"verse":"Immediately, he stood up in front of them, picked up what he had been lying on, and went home glorifying God. "},{"num":26,"verse":"They were all astonished and glorified God. They were also filled with reverence and said, “We have seen wonderful things today.”"},{"header":"The Calling of Levi (Matthew)"},{"num":27,"verse":"After these things, Jesus went out and saw a tax collector by the name of Levi sitting at the tax collector’s booth. He said to him, “Follow me.”"},{"num":28,"verse":"Levi left everything, got up, and followed Jesus. "},{"num":29,"verse":"Levi gave a great banquet for him in his house. There was a large crowd of tax collectors and others dining with them. "},{"num":30,"verse":"The Pharisees and experts in the law grumbled against his disciples, saying, “Why do you eat and drink with tax collectors and sinners?”"},{"num":31,"verse":"Jesus answered them, “The healthy do not need a physician, but the sick do. "},{"num":32,"verse":"I have not come to call the righteous, but sinners to repentance.”"},{"header":"A Question About Fasting"},{"num":33,"verse":"They said to him, “Why do John’s disciples fast and pray often, and so do the Pharisees’ disciples, but yours go on eating and drinking?”"},{"num":34,"verse":"Jesus said to them, “You cannot make the attendants of the bridegroom fast while the bridegroom is with them, can you? "},{"num":35,"verse":"But the days will come when the bridegroom will be taken away from them. Then, in those days, they will fast.”"},{"num":36,"verse":"He told them a parable: “No one tears a patch from a new garment and puts it on an old garment. If he does, he will tear the new garment, and the patch from the new garment will not match the old one. "},{"num":37,"verse":"And no one pours new wine into old wineskins. If he does, the new wine will burst the skins, it will be spilled, and the skins will be ruined. "},{"num":38,"verse":"Instead, new wine must be put into fresh wineskins so both are preserved. "},{"num":39,"verse":"And no one wants new wine while drinking old wine, because he says, ‘The old is fine.’”"}]