[{"header":"Jesus Calls the First Disciples"},{"num":5,"verse":"On one occasion, while the crowd was pressing in on him to hear the word of God, he was standing by the lake of Gennesaret,"},{"num":2,"verse":"and he saw two boats by the lake, but the fishermen had gone out of them and were washing their nets."},{"num":3,"verse":"Getting into one of the boats, which was Simon's, he asked him to put out a little from the land. And he sat down and taught the people from the boat."},{"num":4,"verse":"And when he had finished speaking, he said to Simon, “Put out into the deep and let down your nets for a catch.”"},{"num":5,"verse":"And Simon answered, “Master, we toiled all night and took nothing! But at your word I will let down the nets.”"},{"num":6,"verse":"And when they had done this, they enclosed a large number of fish, and their nets were breaking."},{"num":7,"verse":"They signaled to their partners in the other boat to come and help them. And they came and filled both the boats, so that they began to sink."},{"num":8,"verse":"But when Simon Peter saw it, he fell down at Jesus' knees, saying, “Depart from me, for I am a sinful man, O Lord.”"},{"num":9,"verse":"For he and all who were with him were astonished at the catch of fish that they had taken,"},{"num":10,"verse":"and so also were James and John, sons of Zebedee, who were partners with Simon. And Jesus said to Simon, “Do not be afraid; from now on you will be catching men.”"},{"num":11,"verse":"And when they had brought their boats to land, they left everything and followed him."},{"header":"Jesus Cleanses a Leper"},{"num":12,"verse":"While he was in one of the cities, there came a man full of leprosy. And when he saw Jesus, he fell on his face and begged him, “Lord, if you will, you can make me clean.”"},{"num":13,"verse":"And Jesus stretched out his hand and touched him, saying, “I will; be clean.” And immediately the leprosy left him."},{"num":14,"verse":"And he charged him to tell no one, but “go and show yourself to the priest, and make an offering for your cleansing, as Moses commanded, for a proof to them.”"},{"num":15,"verse":"But now even more the report about him went abroad, and great crowds gathered to hear him and to be healed of their infirmities."},{"num":16,"verse":"But he would withdraw to desolate places and pray."},{"header":"Jesus Heals a Paralytic"},{"num":17,"verse":"On one of those days, as he was teaching, Pharisees and teachers of the law were sitting there, who had come from every village of Galilee and Judea and from Jerusalem. And the power of the Lord was with him to heal."},{"num":18,"verse":"And behold, some men were bringing on a bed a man who was paralyzed, and they were seeking to bring him in and lay him before Jesus,"},{"num":19,"verse":"but finding no way to bring him in, because of the crowd, they went up on the roof and let him down with his bed through the tiles into the midst before Jesus."},{"num":20,"verse":"And when he saw their faith, he said, “Man, your sins are forgiven you.”"},{"num":21,"verse":"And the scribes and the Pharisees began to question, saying, “Who is this who speaks blasphemies? Who can forgive sins but God alone?”"},{"num":22,"verse":"When Jesus perceived their thoughts, he answered them, “Why do you question in your hearts?"},{"num":25,"verse":"And immediately he rose up before them and picked up what he had been lying on and went home, glorifying God."},{"num":26,"verse":"And amazement seized them all, and they glorified God and were filled with awe, saying, “We have seen extraordinary things today.”"},{"header":"Jesus Calls Levi"},{"num":27,"verse":"After this he went out and saw a tax collector named Levi, sitting at the tax booth. And he said to him, “Follow me.”"},{"num":28,"verse":"And leaving everything, he rose and followed him."},{"num":29,"verse":"And Levi made him a great feast in his house, and there was a large company of tax collectors and others reclining at table with them."},{"num":30,"verse":"And the Pharisees and their scribes grumbled at his disciples, saying, “Why do you eat and drink with tax collectors and sinners?”"},{"num":31,"verse":"And Jesus answered them, “Those who are well have no need of a physician, but those who are sick."},{"header":"A Question About Fasting"},{"num":33,"verse":"And they said to him, “The disciples of John fast often and offer prayers, and so do the disciples of the Pharisees, but yours eat and drink.”"},{"num":34,"verse":"And Jesus said to them, “Can you make wedding guests fast while the bridegroom is with them?"},{"num":36,"verse":"He also told them a parable: “No one tears a piece from a new garment and puts it on an old garment. If he does, he will tear the new, and the piece from the new will not match the old."}]