[{"header":"Chapter 5"},{"num":1,"verse":"Jesus Calls the First Disciples. One day, as Jesus was standing by the Lake of Gennesaret, with people crowding around him to hear the word of God,"},{"num":2,"verse":"he caught sight of two boats at the water’s edge. The fishermen had gotten out of the boats and were washing their nets."},{"num":3,"verse":"Getting into one of the boats, the one belonging to Simon, he asked him to put out a little way from the shore. Then he sat down and taught the crowds from the boat."},{"num":4,"verse":"When he had finished speaking, he said to Simon, “Put out into deep water and let down your nets for a catch.”"},{"num":5,"verse":"Simon answered, “Master, we worked hard throughout the night and caught nothing; but if you say so, I will let down the nets.”"},{"num":6,"verse":"When they had done this, they caught such a great number of fish that their nets were beginning to tear."},{"num":7,"verse":"Therefore, they signaled to their companions in the other boat to come and help them. They came and filled both boats to the point that they were in danger of sinking."},{"num":8,"verse":"When Simon Peter saw what had happened, he fell at the knees of Jesus, saying, “Depart from me, Lord, for I am a sinful man.”"},{"num":9,"verse":"For he and all of his companions were amazed at the catch they had made."},{"num":10,"verse":"So too were Simon’s partners James and John, the sons of Zebedee. Then Jesus said to Simon, “Do not be afraid. From now on you will be catching men.”"},{"num":11,"verse":"When they brought their boats to the shore, they left everything and followed him."},{"num":12,"verse":"Jesus Heals a Man with Leprosy. In one of the towns that he visited, a man appeared whose body was covered with leprosy. When he saw Jesus, he fell prostrate before him and pleaded for his help, saying, “Lord, if you choose to do so, you can make me clean.”"},{"num":13,"verse":"He stretched out his hand and touched him, saying, “I do choose. Be made clean.” Immediately, the leprosy left him."},{"num":14,"verse":"He then instructed him to tell no one. “Just go,” he said, “and show yourself to the priest, and make an offering for your cleansing, as prescribed by Moses. That will be proof for them.”"},{"num":15,"verse":"However, the reports about him continued to spread, so that large crowds assembled to listen to him and to be healed of their diseases."},{"num":16,"verse":"But he would withdraw to deserted places to pray."},{"num":17,"verse":"Jesus Pardons and Heals a Paralyzed Man. One day, as he was teaching, Pharisees and teachers of the law were sitting there. They had come from every village of Galilee and Judea, and from Jerusalem. And he possessed the power of the Lord to heal."},{"num":18,"verse":"Then some men appeared, carrying a paralyzed man on a bed. They tried to bring him in and set him down in front of Jesus."},{"num":19,"verse":"However, finding no way to bring him in because of the crowd, they went up onto the roof and lowered him on the bed through the tiles into the middle of the crowd surrounding Jesus."},{"num":20,"verse":"On perceiving their faith, Jesus said, “Friend, your sins are forgiven you.”"},{"num":21,"verse":"Then the scribes and the Pharisees began to ask each other, “Who is this man uttering blasphemies? Who can forgive sins but God alone?”"},{"num":22,"verse":"Jesus discerned what they were thinking, and he said in reply, “Why do you entertain such thoughts in your hearts?"},{"num":23,"verse":"Which is easier—to say: ‘Your sins are forgiven you,’ or to say: ‘Stand up and walk’?"},{"num":24,"verse":"But that you may come to realize that the Son of Man has authority on earth to forgive sins”—he said to the paralyzed man—“I say to you, stand up, and take your bed, and go to your home.”"},{"num":25,"verse":"Immediately, the man stood up before them, picked up his bed, and went home glorifying God."},{"num":26,"verse":"They were all overcome with amazement, and they praised God as, awestruck, they said, “We have witnessed unbelievable things today.”"},{"num":27,"verse":"Jesus Calls Levi (Matthew).After this, he went out and noticed a tax collector named Levi sitting at his customs post. Jesus said to him, “Follow me,”"},{"num":28,"verse":"and, leaving everything behind, he got up and followed him."},{"num":29,"verse":"Jesus Dines with Sinners. Then Levi gave a great banquet in his house for him, and a large crowd of tax collectors and others were at table with them."},{"num":30,"verse":"The Pharisees and their scribes complained to his disciples, saying, “Why do you eat and drink with tax collectors and sinners?”"},{"num":31,"verse":"Jesus said to them in reply, “It is not the healthy who need a physician, but rather those who are sick."},{"num":32,"verse":"I have not come to call the righteous but sinners to repentance.”"},{"num":33,"verse":"A Time of Joy and Grace. Then they said to him, “John’s disciples fast frequently and pray often, and the disciples of the Pharisees do likewise, but your disciples eat and drink.”"},{"num":34,"verse":"Jesus said to them, “How can the wedding guests fast while the bridegroom is still with them?"},{"num":35,"verse":"But the time will come when the bridegroom is taken away from them, and then, in those days, they will fast.”"},{"num":36,"verse":"He also told them this parable: “No one tears a piece from a new cloak and sews it on an old cloak. If he does, the new cloak will be torn, and the piece from it will not match that of the old."},{"num":37,"verse":"Nor does anyone pour new wine into old wineskins. If he does, the new wine will burst the skins and spill out, and the skins will be destroyed."},{"num":38,"verse":"Rather new wine must be put into fresh wineskins."},{"num":39,"verse":"And no one who has been drinking old wine will wish for new wine, for he says, ‘The old is better.’ ”"}]