[{"header":"The Call of the Disciples"},{"num":5,"verse":"Now Jesus was standing by the Lake of Gennesaret, and the crowd was pressing around him to hear the word of God. "},{"num":2,"verse":"He saw two boats by the lake, but the fishermen had gotten out of them and were washing their nets. "},{"num":3,"verse":"He got into one of the boats, which was Simon’s, and asked him to put out a little way from the shore. Then Jesus sat down and taught the crowds from the boat. "},{"num":4,"verse":"When he had finished speaking, he said to Simon, “Put out into the deep water and lower your nets for a catch.” "},{"num":5,"verse":"Simon answered, “Master, we worked hard all night and caught nothing! But at your word I will lower the nets.” "},{"num":6,"verse":"When they had done this, they caught so many fish that their nets started to tear. "},{"num":7,"verse":"So they motioned to their partners in the other boat to come and help them. And they came and filled both boats, so that they were about to sink. "},{"num":8,"verse":"But when Simon Peter saw it, he fell down at Jesus’ knees, saying, “Go away from me, Lord, for I am a sinful man!” "},{"num":9,"verse":"For Peter and all who were with him were astonished at the catch of fish that they had taken, "},{"num":10,"verse":"and so were James and John, Zebedee’s sons, who were Simon’s business partners. Then Jesus said to Simon, “Do not be afraid; from now on you will be catching people!” "},{"num":11,"verse":"So when they had brought their boats to shore, they left everything and followed him."},{"header":"Healing a Leper"},{"num":12,"verse":"While Jesus was in one of the towns, a man came to him who was covered with leprosy. When he saw Jesus, he bowed down with his face to the ground and begged him, “Lord, if you are willing, you can make me clean.” "},{"num":13,"verse":"So he stretched out his hand and touched him, saying, “I am willing. Be clean!” And immediately the leprosy left him. "},{"num":14,"verse":"Then he ordered the man to tell no one, but commanded him, “Go and show yourself to a priest, and bring the offering for your cleansing, as Moses commanded, as a testimony to them.” "},{"num":15,"verse":"But the news about him spread even more, and large crowds were gathering together to hear him and to be healed of their illnesses. "},{"num":16,"verse":"Yet Jesus himself frequently withdrew to the wilderness and prayed."},{"header":"Healing and Forgiving a Paralytic"},{"num":17,"verse":"Now on one of those days, while he was teaching, there were Pharisees and teachers of the law sitting nearby (who had come from every village of Galilee and Judea and from Jerusalem), and the power of the Lord was with him to heal. "},{"num":18,"verse":"Just then some men showed up, carrying a paralyzed man on a stretcher. They were trying to bring him in and place him before Jesus. "},{"num":19,"verse":"But since they found no way to carry him in because of the crowd, they went up on the roof and let him down on the stretcher through the roof tiles right in front of Jesus. "},{"num":20,"verse":"When Jesus saw their faith he said, “Friend, your sins are forgiven.” "},{"num":21,"verse":"Then the experts in the law and the Pharisees began to think to themselves, “Who is this man who is uttering blasphemies? Who can forgive sins but God alone?” "},{"num":22,"verse":"When Jesus perceived their hostile thoughts, he said to them, “Why are you raising objections within yourselves? "},{"num":23,"verse":"Which is easier, to say, ‘Your sins are forgiven,’ or to say, ‘Stand up and walk’? "},{"num":24,"verse":"But so that you may know that the Son of Man has authority on earth to forgive sins”—he said to the paralyzed man—“I tell you, stand up, take your stretcher and go home.” "},{"num":25,"verse":"Immediately he stood up before them, picked up the stretcher he had been lying on, and went home, glorifying God. "},{"num":26,"verse":"Then astonishment seized them all, and they glorified God. They were filled with awe, saying, “We have seen incredible things today.”"},{"header":"The Call of Levi; Eating with Sinners"},{"num":27,"verse":"After this, Jesus went out and saw a tax collector named Levi sitting at the tax booth. “Follow me,” he said to him. "},{"num":28,"verse":"And he got up and followed him, leaving everything behind."},{"num":29,"verse":"Then Levi gave a great banquet in his house for Jesus, and there was a large crowd of tax collectors and others sitting at the table with them. "},{"num":30,"verse":"But the Pharisees and their experts in the law complained to his disciples, saying, “Why do you eat and drink with tax collectors and sinners?” "},{"num":31,"verse":"Jesus answered them, “Those who are well don’t need a physician, but those who are sick do. "},{"num":32,"verse":"I have not come to call the righteous, but sinners to repentance.”"},{"header":"The Superiority of the New"},{"num":33,"verse":"Then they said to him, “John’s disciples frequently fast and pray, and so do the disciples of the Pharisees, but yours continue to eat and drink.” "},{"num":34,"verse":"So Jesus said to them, “You cannot make the wedding guests fast while the bridegroom is with them, can you? "},{"num":35,"verse":"But those days are coming, and when the bridegroom is taken from them, at that time they will fast.” "},{"num":36,"verse":"He also told them a parable: “No one tears a patch from a new garment and sews it on an old garment. If he does, he will have torn the new, and the piece from the new will not match the old. "},{"num":37,"verse":"And no one pours new wine into old wineskins. If he does, the new wine will burst the skins and will be spilled, and the skins will be destroyed. "},{"num":38,"verse":"Instead new wine must be poured into new wineskins. "},{"num":39,"verse":" No one after drinking old wine wants the new, for he says, ‘The old is good enough.’”"}]