[[],[{"type":"header","content":"The First Disciples"},{"type":"prose","content":"One day as Jesus was preaching on the shore of the Sea of Galilee, great crowds pressed in on him to listen to the word of God."}],[{"type":"prose","content":"He noticed two empty boats at the water’s edge, for the fishermen had left them and were washing their nets."}],[{"type":"prose","content":"Stepping into one of the boats, Jesus asked Simon, its owner, to push it out into the water. So he sat in the boat and taught the crowds from there."}],[{"type":"prose","content":"When he had finished speaking, he said to Simon, "}],[{"type":"prose","content":"“Master,” Simon replied, “we worked hard all last night and didn’t catch a thing. But if you say so, I’ll let the nets down again.”"}],[{"type":"prose","content":"And this time their nets were so full of fish they began to tear!"}],[{"type":"prose","content":"A shout for help brought their partners in the other boat, and soon both boats were filled with fish and on the verge of sinking."}],[{"type":"prose","content":"When Simon Peter realized what had happened, he fell to his knees before Jesus and said, “Oh, Lord, please leave me—I’m such a sinful man.”"}],[{"type":"prose","content":"For he was awestruck by the number of fish they had caught, as were the others with him."}],[{"type":"prose","content":"His partners, James and John, the sons of Zebedee, were also amazed.Jesus replied to Simon, "}],[{"type":"prose","content":"And as soon as they landed, they left everything and followed Jesus."}],[{"type":"header","content":"Jesus Heals a Man with Leprosy"},{"type":"prose","content":"In one of the villages, Jesus met a man with an advanced case of leprosy. When the man saw Jesus, he bowed with his face to the ground, begging to be healed. “Lord,” he said, “if you are willing, you can heal me and make me clean.”"}],[{"type":"prose","content":"Jesus reached out and touched him.  he said.  And instantly the leprosy disappeared."}],[{"type":"prose","content":"Then Jesus instructed him not to tell anyone what had happened. He said, "}],[{"type":"prose","content":"But despite Jesus’ instructions, the report of his power spread even faster, and vast crowds came to hear him preach and to be healed of their diseases."}],[{"type":"prose","content":"But Jesus often withdrew to the wilderness for prayer."}],[{"type":"header","content":"Jesus Heals a Paralyzed Man"},{"type":"prose","content":"One day while Jesus was teaching, some Pharisees and teachers of religious law were sitting nearby. (It seemed that these men showed up from every village in all Galilee and Judea, as well as from Jerusalem.) And the Lord’s healing power was strongly with Jesus."}],[{"type":"prose","content":"Some men came carrying a paralyzed man on a sleeping mat. They tried to take him inside to Jesus,"}],[{"type":"prose","content":"but they couldn’t reach him because of the crowd. So they went up to the roof and took off some tiles. Then they lowered the sick man on his mat down into the crowd, right in front of Jesus."}],[{"type":"prose","content":"Seeing their faith, Jesus said to the man, "}],[{"type":"prose","content":"But the Pharisees and teachers of religious law said to themselves, “Who does he think he is? That’s blasphemy! Only God can forgive sins!”"}],[{"type":"prose","content":"Jesus knew what they were thinking, so he asked them, "}],[],[{"type":"prose","content":" Then Jesus turned to the paralyzed man and said, "}],[{"type":"prose","content":"And immediately, as everyone watched, the man jumped up, picked up his mat, and went home praising God."}],[{"type":"prose","content":"Everyone was gripped with great wonder and awe, and they praised God, exclaiming, “We have seen amazing things today!”"}],[{"type":"header","content":"Jesus Calls Levi (Matthew)"},{"type":"prose","content":"Later, as Jesus left the town, he saw a tax collector named Levi sitting at his tax collector’s booth.  Jesus said to him."}],[{"type":"prose","content":"So Levi got up, left everything, and followed him."}],[{"type":"prose","content":"Later, Levi held a banquet in his home with Jesus as the guest of honor. Many of Levi’s fellow tax collectors and other guests also ate with them."}],[{"type":"prose","content":"But the Pharisees and their teachers of religious law complained bitterly to Jesus’ disciples, “Why do you eat and drink with such scum?”"}],[{"type":"prose","content":"Jesus answered them, "}],[],[{"type":"header","content":"A Discussion about Fasting"},{"type":"prose","content":"One day some people said to Jesus, “John the Baptist’s disciples fast and pray regularly, and so do the disciples of the Pharisees. Why are your disciples always eating and drinking?”"}],[{"type":"prose","content":"Jesus responded, "}],[],[{"type":"prose","content":"Then Jesus gave them this illustration: "}],[],[],[]]