[{"header":"Psalm 72[a]"},{"num":1,"verse":"Give the king [knowledge of] Your [way of] judging, O God, and [the spirit of] Your righteousness to the king’s son [to control all his actions]."},{"num":2,"verse":"Let him judge and govern Your people with righteousness, and Your poor and afflicted ones with judgment and justice."},{"num":3,"verse":"The mountains shall bring peace to the people, and the hills, through [the general establishment of] righteousness."},{"num":4,"verse":"May he judge and defend the poor of the people, deliver the children of the needy, and crush the oppressor,"},{"num":5,"verse":"So that they may revere and fear You while the sun and moon endure, throughout all generations."},{"num":6,"verse":"May he [Solomon as a type of King David’s greater Son] be like rain that comes down upon the mown grass, like showers that water the earth."},{"num":7,"verse":"In His [Christ’s] days shall the [uncompromisingly] righteous flourish and peace abound till there is a moon no longer."},{"num":8,"verse":"He [Christ] shall have dominion also from sea to sea and from the River [Euphrates] to the ends of the earth."},{"num":9,"verse":"Those who dwell in the wilderness shall bow before Him and His enemies shall lick the dust."},{"num":10,"verse":"The kings of Tarshish and of the coasts shall bring offerings; the kings of Sheba and Seba shall offer gifts."},{"num":11,"verse":"Yes, all kings shall fall down before Him, all nations shall serve Him."},{"num":12,"verse":"For He delivers the needy when he calls out, the poor also and him who has no helper."},{"num":13,"verse":"He will have pity on the poor and weak and needy and will save the lives of the needy."},{"num":14,"verse":"He will redeem their lives from oppression and fraud and violence, and precious and costly shall their blood be in His sight."},{"num":15,"verse":"And He shall live; and to Him shall be given gold of Sheba; prayer also shall be made for Him and through Him continually, and they shall bless and praise Him all the day long."},{"num":16,"verse":"There shall be abundance of grain in the soil upon the top of the mountains [the least fruitful places in the land]; the fruit of it shall wave like [the forests of] Lebanon, and [the inhabitants of] the city shall flourish like grass of the earth."},{"num":17,"verse":"His name shall endure forever; His name shall continue as long as the sun [indeed, His name continues before the sun]. And men shall be blessed and bless themselves by Him; all nations shall call Him blessed!"},{"num":18,"verse":"Blessed be the Lord God, the God of Israel, Who alone does wondrous things!"},{"num":19,"verse":"Blessed be His glorious name forever; let the whole earth be filled with His glory! Amen and Amen!"},{"num":20,"verse":"The prayers of David son of Jesse are ended."}]