[{"num":72,"verse":"1 He prayeth for the prosperous estate of the kingdom of Solomon, who was the figure of Christ, 4 under whom shall be righteousness, peace, and felicity. 10 Unto whom all Kings and nations shall do homage, 17 Whose name and power shall endure forever, and in whom all nations shall be blessed."},{"num":1,"verse":"Give thy judgments to the King, O God, and thy righteousness to the King’s son."},{"num":2,"verse":"Then shall he judge thy people in righteousness, and thy poor with equity."},{"num":3,"verse":"The mountains, and the hills shall bring peace to the people by justice."},{"num":4,"verse":"He shall judge the poor of the people: he shall save the children of the needy, and shall subdue the oppressor."},{"num":5,"verse":"They shall fear thee as long as the sun and moon endureth, from generation to generation."},{"num":6,"verse":"He shall come down like the rain upon the mown grass, and as the showers that water the earth."},{"num":7,"verse":"In his days shall the righteous flourish, and abundance of peace shall be so long as the moon endureth."},{"num":8,"verse":"His dominion shall be also from sea to sea, and from the river unto the ends of the land."},{"num":9,"verse":"They that dwell in the wilderness, shall kneel before him, and his enemies shall lick the dust."},{"num":10,"verse":"The kings of Tarshish and of the isles shall bring presents: the kings of Sheba and Seba shall bring gifts."},{"num":11,"verse":"Yea, all kings shall worship him: all nations shall serve him."},{"num":12,"verse":"For he shall deliver the poor when he crieth: the needy also, and him that hath no helper."},{"num":13,"verse":"He shall be merciful to the poor and needy, and shall preserve the souls of the poor."},{"num":14,"verse":"He shall redeem their souls from deceit and violence, and dear shall their blood be in his sight."},{"num":15,"verse":"Yea, he shall live, and unto him shall they give of the gold of Sheba: they shall also pray for him continually, and daily bless him."},{"num":16,"verse":"An handful of corn shall be sown in the earth, even in the top of the mountains, and the fruit thereof shalt shake like the trees of Lebanon: and the children shall flourish out of the city like the grass of the earth."},{"num":17,"verse":"His name shall be forever: his name shall endure as long as the Sun: all nations shall bless him, and be blessed in him."},{"num":18,"verse":"Blessed be the Lord God, even the God of Israel which only doeth wondrous things."},{"num":19,"verse":"And blessed be his glorious Name forever: and let all the earth be filled with his glory. So be it, even so be it."},{"num":20,"verse":"Here end the prayers of David the son of Jesse."}]