[[],[{"type":"prose","content":"By Solomon. O God, Thy judgments to the king give, And Thy righteousness to the king's son."}],[{"type":"prose","content":"He judgeth Thy people with righteousness, And Thy poor with judgment."}],[{"type":"prose","content":"The mountains bear peace to the people, And the heights by righteousness."}],[{"type":"prose","content":"He judgeth the poor of the people, Giveth deliverance to the sons of the needy, And bruiseth the oppressor."}],[{"type":"prose","content":"They fear Thee with the sun, and before the moon, Generation -- generations."}],[{"type":"prose","content":"He cometh down as rain on mown grass, As showers -- sprinkling the earth."}],[{"type":"prose","content":"Flourish in his days doth the righteous, And abundance of peace till the moon is not."}],[{"type":"prose","content":"And he ruleth from sea unto sea, And from the river unto the ends of earth."}],[{"type":"prose","content":"Before him bow do the inhabitants of the dry places, And his enemies lick the dust."}],[{"type":"prose","content":"Kings of Tarshish and of the isles send back a present. Kings of Sheba and Seba a reward bring near."}],[{"type":"prose","content":"And all kings do bow themselves to him, All nations do serve him,"}],[{"type":"prose","content":"For he delivereth the needy who crieth, And the poor when he hath no helper,"}],[{"type":"prose","content":"He hath pity on the poor and needy, And the souls of the needy he saveth,"}],[{"type":"prose","content":"From fraud and from violence he redeemeth their soul, And precious is their blood in his eyes."}],[{"type":"prose","content":"And he liveth, and giveth to him of the gold of Sheba, And prayeth for him continually, All the day he doth bless him."}],[{"type":"prose","content":"There is a handful of corn in the earth, On the top of mountains, Shake like Lebanon doth its fruit, And they flourish out of the city as the herb of the earth."}],[{"type":"prose","content":"His name is to the age, Before the sun is his name continued, And they bless themselves in him, All nations do pronounce him happy."}],[{"type":"prose","content":"Blessed is Jehovah God, God of Israel, He alone is doing wonders,"}],[{"type":"prose","content":"And blessed [is] the Name of His honour to the age, And the whole earth is filled [with] His honour. Amen, and amen!"}],[{"type":"prose","content":"The prayers of David son of Jesse have been ended."}]]