[[],[{"type":"header","content":"Israel Demands a King"},{"type":"prose","content":"Now it came about, when Samuel was old, that he appointed his sons as judges over Israel."}],[{"type":"prose","content":"The name of his firstborn was Joel, and the name of his second, Abijah;  judging in Beersheba."}],[{"type":"prose","content":"His sons, however, did not walk in his ways but turned aside after dishonest gain, and they took bribes and perverted justice."}],[{"type":"prose","content":"Then all the elders of Israel gathered together and came to Samuel at Ramah;"}],[{"type":"prose","content":"and they said to him, “Behold, you have grown old, and your sons do not walk in your ways. Now appoint us a king to judge us like all the nations.”"}],[{"type":"prose","content":"But the matter was displeasing in the sight of Samuel when they said, “Give us a king to judge us.” And Samuel prayed to the ."}],[{"type":"prose","content":"And the  said to Samuel, “Listen to the voice of the people regarding all that they say to you, because they have not rejected you, but they have rejected Me from being King over them."}],[{"type":"prose","content":"Like all the deeds which they have done since the day that I brought them up from Egypt even to this day—in that they have abandoned Me and served other gods—so they are doing to you as well."}],[{"type":"prose","content":"Now then, listen to their voice; however, you shall warn them strongly and tell them of the practice of the king who will reign over them.”"},{"type":"header","content":"Warning concerning a King"}],[{"type":"prose","content":"So Samuel spoke all the words of the  to the people who had asked him for a king."}],[{"type":"prose","content":"And he said, “This will be the practice of the king who will reign over you: he will take your sons and put  in his chariots for himself and among his horsemen, and they will run before his chariots."}],[{"type":"prose","content":"He will appoint for himself commanders of thousands and commanders of fifties, and  to do his plowing and to gather in his harvest, and to make his weapons of war and equipment for his chariots."}],[{"type":"prose","content":"He will also take your daughters  as perfumers, cooks, and bakers."}],[{"type":"prose","content":"He will take the best of your fields, your vineyards, and your olive groves, and give  to his servants."}],[{"type":"prose","content":"And he will take a tenth of your seed and your vineyards and give  to his high officials and his servants."}],[{"type":"prose","content":"He will also take your male servants and your female servants, and your best young men, and your donkeys, and use  for his work."}],[{"type":"prose","content":"He will take a tenth of your flocks, and you yourselves will become his servants."}],[{"type":"prose","content":"Then you will cry out on that day because of your king whom you have chosen for yourselves, but the  will not answer you on that day.”"}],[{"type":"prose","content":"Yet the people refused to listen to the voice of Samuel, and they said, “No, but there shall be a king over us,"}],[{"type":"prose","content":"so that we also may be like all the nations, and our king may judge us and go out before us and fight our battles.”"}],[{"type":"prose","content":"Now after Samuel had heard all the words of the people, he repeated them in the ’ hearing."}],[{"type":"prose","content":"And the  said to Samuel, “Listen to their voice and appoint a king for them.” So Samuel said to the men of Israel, “Go, every man to his city.”"}]]