[{"header":"Israel Demands a King"},{"num":8,"verse":"Now when Samuel grew old, he appointed his sons as judges over Israel. "},{"num":2,"verse":"The name of his firstborn was Joel and the name of his second Abijah—they were judges in Beersheba. "},{"num":3,"verse":"His sons, however, did not walk in his ways, but turned aside after dishonest gain—they took bribes and perverted justice."},{"num":4,"verse":"Then all the elders of Israel gathered together and came to Samuel at Ramah, "},{"num":5,"verse":"and said to him, “Behold, you have grown old and your sons do not walk in your ways. Now appoint for us a king to judge us—like all the nations.” "},{"num":6,"verse":"But the matter was displeasing in Samuel’s eyes when they said, “Give us a king to judge us.” So Samuel prayed to Adonai."},{"num":7,"verse":"Then Adonai said to Samuel, “Listen to the voice of the people in all that they say to you. For they have not rejected you, rather they have rejected Me from being king over them. "},{"num":8,"verse":"Like all the deeds that they have done since the day I brought them out of Egypt to this day—forsaking Me and worshiping other gods—so they are doing to you also. "},{"num":9,"verse":"So now, listen to their voice. However, you must earnestly forewarn them, and declare to them the rulings of the king who will reign over them.”"},{"num":10,"verse":"Now Samuel reported all the words of Adonai to the people who were asking him for a king. "},{"num":11,"verse":"“This will be the practice of the king that will reign over you,” he said. “He will draft your sons and assign them as his charioteers and horsemen, and they will run before his chariots. "},{"num":12,"verse":"He will appoint them as commanders of thousands and captains of fifties, also some to plow his fields, reap his harvest, make his weapons of war and the equipment for his chariots. "},{"num":13,"verse":"Also he will take your daughters to be perfumers, cooks and bakers. "},{"num":14,"verse":"He will seize the best of your fields, vineyards and olive groves, and give them to his courtiers. "},{"num":15,"verse":"He will take a tenth of your grain and your vintage and give it to his officials and slaves. "},{"num":16,"verse":"He will also take your male and female servants, your best young men and your donkeys and make them do his work. "},{"num":17,"verse":"He will also take the tenth of your flocks. Then you yourselves will become his slaves. "},{"num":18,"verse":"When the day comes and you cry out because of your king, whom you have chosen for yourselves, Adonai will not answer you on that day.”"},{"num":19,"verse":"But the people refused to listen to Samuel, and they said, “No! But a king should be over us! "},{"num":20,"verse":"So we may become like all the nations—having our king who will judge us, go out before us and fight our battles.”"},{"num":21,"verse":"After Samuel heard all the words of the people, he reported them back in the hearing of Adonai. "},{"num":22,"verse":"Adonai said to Samuel, “Listen to their voice and appoint a king to reign for them.” So Samuel said to the men of Israel, “Go, each one to his town.”"}]