[[],[{"type":"prose","content":"And it cometh to pass, when Samuel [is] aged, that he maketh his sons judges over Israel."}],[{"type":"prose","content":"And the name of his first-born son is Joel, and the name of his second Abiah, judges in Beer-Sheba:"}],[{"type":"prose","content":"and his sons have not walked in his ways, and turn aside after the dishonest gain, and take a bribe, and turn aside judgment."}],[{"type":"prose","content":"And all the elders of Israel gather themselves together, and come in unto Samuel to Ramath,"}],[{"type":"prose","content":"and say unto him, `Lo, thou hast become aged, and thy sons have not walked in thy ways; now, appoint to us a king, to judge us, like all the nations.'"}],[{"type":"prose","content":"And the thing is evil in the eyes of Samuel, when they have said, `Give to us a king to judge us;' and Samuel prayeth unto Jehovah."}],[{"type":"prose","content":"And Jehovah saith unto Samuel, `Hearken to the voice of the people, to all that they say unto thee, for thee they have not rejected, but Me they have rejected, from reigning over them."}],[{"type":"prose","content":"According to all the works that they have done from the day of My bringing them up out of Egypt, even unto this day, when they forsake Me, and serve other gods -- so they are doing also to thee."}],[{"type":"prose","content":"And now, hearken to their voice; only, surely thou dost certainly protest to them, and hast declared to them the custom of the king who doth reign over them.'"}],[{"type":"prose","content":"And Samuel speaketh all the words of Jehovah unto the people who are asking from him a king,"}],[{"type":"prose","content":"and saith, `This is the custom of the king who doth reign over you: Your sons he doth take, and hath appointed for himself among his chariots, and among his horsemen, and they have run before his chariots;"}],[{"type":"prose","content":"also to appoint for himself heads of thousands, and heads of fifties; also to plow his plowing, and to reap his reaping; and to make instruments of his war, and instruments of his charioteer."}],[{"type":"prose","content":"`And your daughters he doth take for perfumers, and for cooks, and for bakers;"}],[{"type":"prose","content":"and your fields, and your vineyards, and your olive-yards -- the best -- he doth take, and hath given to his servants."}],[{"type":"prose","content":"And your seed and your vineyards he doth tithe, and hath given to his eunuchs, and to his servants."}],[{"type":"prose","content":"And your men-servants, and your maid-servants, and your young men -- the best, and your asses, he doth take, and hath prepared for his own work;"}],[{"type":"prose","content":"your flock he doth tithe, and ye are to him for servants."}],[{"type":"prose","content":"And ye have cried out in that day because of the king whom ye have chosen for yourselves, and Jehovah doth not answer you in that day.'"}],[{"type":"prose","content":"And the people refuse to hearken to the voice of Samuel, and say, `Nay, but a king is over us,"}],[{"type":"prose","content":"and we have been, even we, like all the nations; and our king hath judged us, and gone out before us, and fought our battles.'"}],[{"type":"prose","content":"And Samuel heareth all the words of the people, and speaketh them in the ears of Jehovah;"}],[{"type":"prose","content":"and Jehovah saith unto Samuel, `Hearken to their voice, and thou hast caused to reign over them a king.' And Samuel saith unto the men of Israel, `Go ye each to his city.'"}]]