[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "42:1-20 In this chapter are described the priests' chambers, their use, and the dimensions of the holy mount on which the temple stood. These chambers were many. Jesus said, In my Father's house are many mansions: in his house on earth there are many; multitudes, by faith, are lodging in his sanctuary, and yet there is room. These chambers, though private, were near the temple. Our religious services in our chambers, must prepare for public devotions, and further us in improving them, as our opportunities are.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The Precincts. The temple and its courts were surrounded by an area of exact dimensions 3,000 cubits (1,500 yards) square. See Plan IV.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ezekiel 42:15",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 42:15",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The inner house - The temple and its courts, all that lay within the \"wall on the outside of the house Ezekiel 40:5; the gate\" is the eastern gate of the outer court.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The inner house - The temple and its courts, all that lay within the \"wall on the outside of the house ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 40:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; the gate\" is the eastern gate of the outer court.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Measured it round about - The precincts, into which he had brought the seer through the eastern gate of the outer court. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Measured it round about - The precincts, into which he had brought the seer through the eastern gate of the outer court. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "16. five hundred reeds—the Septuagint substitutes \"cubits\" for \"reeds,\" to escape the immense compass assigned to the whole, namely, a square of five hundred rods or three thousand cubits (two feet each; Eze 40:5), in all a square of one and one-seventh miles, that is, more than all ancient Jerusalem; also, there is much space thus left unappropriated. Fairbairn rightly supports English Version, which agrees with the Hebrew. The vast extent is another feature marking the ideal character of the temple. It symbolizes the great enlargement of the kingdom of God, when Jehovah-Messiah shall reign at Jerusalem, and from thence to the ends of the earth (Isa 2:2-4; Jer 3:17; Ro 11:12, 15).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "He measured the south side, five hundred reeds,.... From the two angles of that side, east and west; and it amounted to just the same number of reeds, even five hundred reeds, or one thousand seven hundred and fifty yards: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "with the measuring reed; the same as before; here, and in the next verse, the phrase \"round about\" is not used, but is to be understood; and having been repeated, there was no need of mentioning it again. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "with the measuring reed; the same as before; here, and in the next verse, the phrase \"round about\" is not used, but is to be understood; and having been repeated, there was no need of mentioning it again. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "He measured the south side, five hundred reeds, with the measuring reed.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Extent of the Holy Domain around the Temple",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ezekiel 42:15. And when he had finished the measurements of the inner house, he brought me out by the way of the gate, which is directed toward the east, and measured there round about. Ezekiel 42:16. He measured the eastern side with the measuring rod five hundred rods by the measuring rod round about; Ezekiel 42:17. He measured the northern side five hundred rods by the measuring rod round about; Ezekiel 42:18. The southern side he measured five hundred rods by the measuring rod; Ezekiel 42:19. He turned round to the western side, measured five hundred rods by the measuring rod. Ezekiel 42:20. To the four winds he measured it. It had a wall round about; the length was five hundred and the breadth five hundred, to divide between the holy and the common. - There has been a division of opinion from time immemorial concerning the area, the measuring of which is related in these verses, and the length and breadth of which are stated in Ezekiel 42:20 to have been five hundred; as the Seventy, and after them J. D. Michaelis, Bttcher, Maurer, Ewald, and Hitzig, understand by this the space occupied by the temple with its two courts. But as that space was five hundred cubits long and five hundred broad, according to the sum of the measurements given in Ezekiel 40-42:15, the lxx have omitted the word קנים in Ezekiel 42:16, Ezekiel 42:18, and Ezekiel 42:19, whilst they have changed it into πήχεις in Ezekiel 42:17, and have also attached this word to the numbers in Ezekiel 42:20. According to this, only the outer circumference of the temple area would be measured in our verses, and the wall which was five hundred cubits long and five hundred cubits broad (Ezekiel 42:20) would be the surrounding wall of the outer court mentioned in Ezekiel 40:5. Ezekiel 42:15 could certainly be made to harmonize with this view. For even if we understood by the \"inner house\" not merely the temple house, which the expression primarily indicates, but the whole of the inner building, i.e., all the buildings found in the inner and outer court, and by the east gate the eastern gate of the outer court; the expression 'מדדו סביב , \"he measured it round about,\" merely affirms that he measured something round about outside this gate. The suffix in מדדו is indefinite, and cannot be taken as referring to any of the objects mentioned before, either to השּׁער or to הבּית הפּנימי. The inner house he had already measured; and the measurements which follow are not applicable to the gate. Nor can the suffix be taken as referring to הבּית, illam sc. aedem (Ros.); or at any rate, there is nothing in Ezekiel 42:20 to sustain such a reference. Nevertheless, we might think of a measuring of the outer sides of the whole building comprehended under the idea of the inner house, and regard the wall mentioned in Ezekiel 42:20 as that which had been measured round about on the outer side both in length and breadth. But it is difficult to reconcile this view even with Ezekiel 42:20; and with the measurements given in Ezekiel 42:16-19 it is perfectly irreconcilable. Even if we were disposed to expunge קנים as a gloss in Ezekiel 42:16, Ezekiel 42:17, Ezekiel 42:18, and Ezekiel 42:19, the words, \"he measured the east side with the measuring rod, five hundred by the measuring rod,\" are equivalent to five hundred rods, according to the well-known Hebrew usage; just as indisputably as מאה, a hundred by the cubit, is equivalent to a hundred cubits (see the comm. on Ezekiel 40:21 at the close). The rejection of קנים as an imaginary gloss is therefore not only arbitrary, but also useless; as the appended words בּקנה המּדּה, even without קנים, affirm that the five hundred were not cubits, but rods.",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 42:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And when he had finished the measurements of the inner house, he brought me out by the way of the gate, which is directed toward the east, and measured there round about. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 42:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". He measured the eastern side with the measuring rod five hundred rods by the measuring rod round about; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 42:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". He measured the northern side five hundred rods by the measuring rod round about; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 42:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The southern side he measured five hundred rods by the measuring rod; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 42:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". He turned round to the western side, measured five hundred rods by the measuring rod. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 42:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". To the four winds he measured it. It had a wall round about; the length was five hundred and the breadth five hundred, to divide between the holy and the common. - There has been a division of opinion from time immemorial concerning the area, the measuring of which is related in these verses, and the length and breadth of which are stated in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 42:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " to have been five hundred; as the Seventy, and after them J. D. Michaelis, Bttcher, Maurer, Ewald, and Hitzig, understand by this the space occupied by the temple with its two courts. But as that space was five hundred cubits long and five hundred broad, according to the sum of the measurements given in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 40-42",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ":15, the lxx have omitted the word קנים in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 42:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 42:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 42:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", whilst they have changed it into πήχεις in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 42:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and have also attached this word to the numbers in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 42:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". According to this, only the outer circumference of the temple area would be measured in our verses, and the wall which was five hundred cubits long and five hundred cubits broad (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 42:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") would be the surrounding wall of the outer court mentioned in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 40:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 42:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " could certainly be made to harmonize with this view. For even if we understood by the \"inner house\" not merely the temple house, which the expression primarily indicates, but the whole of the inner building, i.e., all the buildings found in the inner and outer court, and by the east gate the eastern gate of the outer court; the expression 'מדדו סביב , \"he measured it round about,\" merely affirms that he measured something round about outside this gate. The suffix in מדדו is indefinite, and cannot be taken as referring to any of the objects mentioned before, either to השּׁער or to הבּית הפּנימי. The inner house he had already measured; and the measurements which follow are not applicable to the gate. Nor can the suffix be taken as referring to הבּית, illam sc. aedem (Ros.); or at any rate, there is nothing in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 42:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " to sustain such a reference. Nevertheless, we might think of a measuring of the outer sides of the whole building comprehended under the idea of the inner house, and regard the wall mentioned in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 42:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " as that which had been measured round about on the outer side both in length and breadth. But it is difficult to reconcile this view even with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 42:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and with the measurements given in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 42:16-19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " it is perfectly irreconcilable. Even if we were disposed to expunge קנים as a gloss in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 42:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 42:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 42:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 42:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the words, \"he measured the east side with the measuring rod, five hundred by the measuring rod,\" are equivalent to five hundred rods, according to the well-known Hebrew usage; just as indisputably as מאה, a hundred by the cubit, is equivalent to a hundred cubits (see the comm. on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 40:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " at the close). The rejection of קנים as an imaginary gloss is therefore not only arbitrary, but also useless; as the appended words בּקנה המּדּה, even without קנים, affirm that the five hundred were not cubits, but rods.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: The חמשׁ אמות for חמשׁ מאות in Ezekiel 42:16 is utterly useless as a proof that cubits and not rods are intended; as it is obviously a copyist's error, a fact which even the Masoretes admit. Rabbi ben-Asher's view of this writing is an interesting one. Prof. Dr. Delitzsch has sent me the following, taken from a fragment in his possession copied from a codex of the Royal Library at Copenhagen. R. ben-Asher reckons אמות among the מוקדם ומאוחר, i.e., words written ὑστερον προτερον, of which there are forty-seven in the whole of the Old Testament, the following being quoted by ben-Asher (l.c.) by way of example: גּלון, Joshua 20:8; Joshua 21:27; ויּקּלהוּ, 2 Samuel 20:14; בּעברות, 2 Samuel 15:28; והימשׁני, Judges 16:26; ותּראנה, 1 Samuel 14:27.)",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: The חמשׁ אמות for חמשׁ מאות in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 42:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is utterly useless as a proof that cubits and not rods are intended; as it is obviously a copyist's error, a fact which even the Masoretes admit. Rabbi ben-Asher's view of this writing is an interesting one. Prof. Dr. Delitzsch has sent me the following, taken from a fragment in his possession copied from a codex of the Royal Library at Copenhagen. R. ben-Asher reckons אמות among the מוקדם ומאוחר, i.e., words written ὑστερον προτερον, of which there are forty-seven in the whole of the Old Testament, the following being quoted by ben-Asher (l.c.) by way of example: גּלון, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 20:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 21:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ויּקּלהוּ, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 20:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; בּעברות, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Samuel 15:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; והימשׁני, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 16:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ותּראנה, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 14:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The סביב in Ezekiel 42:16 and Ezekiel 42:17 is not to be understood as signifying that on the east and north sides he measured a square on each side of five hundred rods in length and breadth, but simply indicates that he measured on all sides, as is obvious from Ezekiel 42:20. For according to this, the space which was measured toward every quarter at five hundred rods had a boundary wall, which was five hundred rods long on every side. This gives an area of 250,000 square rods; whereas the temple,with the inner and outer courts, covered only a square of five hundred cubits in length and breadth, or 250,000 square cubits. It is evident from this that the measuring related in Ezekiel 42:15-20 does not refer to the space occupied by the temple and its courts, and therefore that the wall which the measured space had around it (Ezekiel 42:20) cannot be the wall of the outer court mentioned in Ezekiel 40:5, the sides of which were not more than five hundred cubits long. The meaning is rather, that around this wall, which enclosed the temple and its courts, a further space of five hundred rods in length and breadth was measured off \"to separate between the holy and profane,\" i.e., a space which was intended to form a separating domain between the sanctuary and the common land. The purpose thus assigned for the space, which was measured off on all four sides of the \"inner house,\" leaves no doubt remaining that it was not the length of the surrounding wall of the outer court that was measured, but a space outside this wall. The following clause חומה , \"a wall was round about it,\" is irreconcilable with the idea that the suffix in מדדו (Ezekiel 40:20 and Ezekiel 40:15) refers to this wall, inasmuch as the לו can only refer to the object indicated by the suffix attached to מדדו. This object, i.e., the space which was five hundred rods long and the same broad round about, i.e., on every one of the four sides, had a wall enclosing it on the outside, and forming the partition between the holy and the common. הקּדשׁ is therefore הבּית הפּנימי, \"the inner house;\" but this is not the temple house with its side-building, but the sanctuary of the temple with its two courts and their buildings, which was measured in Ezekiel 40:5-42:12.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The סביב in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 42:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 42:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is not to be understood as signifying that on the east and north sides he measured a square on each side of five hundred rods in length and breadth, but simply indicates that he measured on all sides, as is obvious from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 42:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". For according to this, the space which was measured toward every quarter at five hundred rods had a boundary wall, which was five hundred rods long on every side. This gives an area of 250,000 square rods; whereas the temple,with the inner and outer courts, covered only a square of five hundred cubits in length and breadth, or 250,000 square cubits. It is evident from this that the measuring related in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 42:15-20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " does not refer to the space occupied by the temple and its courts, and therefore that the wall which the measured space had around it (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 42:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") cannot be the wall of the outer court mentioned in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 40:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the sides of which were not more than five hundred cubits long. The meaning is rather, that around this wall, which enclosed the temple and its courts, a further space of five hundred rods in length and breadth was measured off \"to separate between the holy and profane,\" i.e., a space which was intended to form a separating domain between the sanctuary and the common land. The purpose thus assigned for the space, which was measured off on all four sides of the \"inner house,\" leaves no doubt remaining that it was not the length of the surrounding wall of the outer court that was measured, but a space outside this wall. The following clause חומה , \"a wall was round about it,\" is irreconcilable with the idea that the suffix in מדדו (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 40:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 40:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") refers to this wall, inasmuch as the לו can only refer to the object indicated by the suffix attached to מדדו. This object, i.e., the space which was five hundred rods long and the same broad round about, i.e., on every one of the four sides, had a wall enclosing it on the outside, and forming the partition between the holy and the common. הקּדשׁ is therefore הבּית הפּנימי, \"the inner house;\" but this is not the temple house with its side-building, but the sanctuary of the temple with its two courts and their buildings, which was measured in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 40:5-42:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The arguments which have been adduced in opposition to this explanation of our verses, - the only one in harmony with the words of the text, - and in vindication of the alterations made in the text by the lxx, are without any force. According to Bttcher (p. 355), Hitzig, and others, קנים is likely to be a false gloss, (1) \"because בּקנה המּדּה stands close to it; and while this is quite needless after קנים, it may also have occasioned the gloss.\" But this tells rather against the suspicion that קנים is a gloss, since, as we have already observed, according to the Hebrew mode of expression, the \"five hundred\" would be defined as rods by בּקנה המּדּה, even without קנים. Ezekiel, however, had added בּקנה המּדּה for the purpose of expressing in the clearest manner the fact that the reference here is not to cubits, but to a new measurement of an extraordinary kind, to which nothing corresponding could be shown in the earlier temple. And the Seventy, by retaining this clause, ἐν καλάμῳ τοῦ μέτρου, have pronounced sentence upon their own change of the rods into cubits; and it is no answer to this that the Talmud (Midd. c. ii. note 5) also gives only five hundred cubits to the הר הבּ, since this Talmudic description is treating of the historical temple and not of Ezekiel's prophetic picture of a temple, although the Rabbins have transferred various statements from the latter to the former. The second and third reasons are weaker still - viz. \"because there is no other instance in which the measurement is expressed by rods in the plural; and, on the other hand, אמּה is frequently omitted as being the ordinary measurement, and therefore taken for granted.\" For the first assertion is proved to be erroneous, not only by our verses, but also by Ezekiel 45:1. and Ezekiel 48:16., whilst there is no force whatever in the second. The last argument employed is a more plausible one - namely, that \"the five hundred rods are not in keeping with the sanctuary, because the edifice with the courts and gates would look but a little pile according to the previous measurements in the wide expanse of 20,000 (?) rods.\" But although the space measured off around the temple-building for the separation between the holy and the profane was five times as long and five times as broad, according to the Hebrew text, or twenty-five times as large as the whole extent of the temple and its courts,",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The arguments which have been adduced in opposition to this explanation of our verses, - the only one in harmony with the words of the text, - and in vindication of the alterations made in the text by the lxx, are without any force. According to Bttcher (p. 355), Hitzig, and others, קנים is likely to be a false gloss, (1) \"because בּקנה המּדּה stands close to it; and while this is quite needless after קנים, it may also have occasioned the gloss.\" But this tells rather against the suspicion that קנים is a gloss, since, as we have already observed, according to the Hebrew mode of expression, the \"five hundred\" would be defined as rods by בּקנה המּדּה, even without קנים. Ezekiel, however, had added בּקנה המּדּה for the purpose of expressing in the clearest manner the fact that the reference here is not to cubits, but to a new measurement of an extraordinary kind, to which nothing corresponding could be shown in the earlier temple. And the Seventy, by retaining this clause, ἐν καλάμῳ τοῦ μέτρου, have pronounced sentence upon their own change of the rods into cubits; and it is no answer to this that the Talmud (Midd. c. ii. note 5) also gives only five hundred cubits to the הר הבּ, since this Talmudic description is treating of the historical temple and not of Ezekiel's prophetic picture of a temple, although the Rabbins have transferred various statements from the latter to the former. The second and third reasons are weaker still - viz. \"because there is no other instance in which the measurement is expressed by rods in the plural; and, on the other hand, אמּה is frequently omitted as being the ordinary measurement, and therefore taken for granted.\" For the first assertion is proved to be erroneous, not only by our verses, but also by ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 45:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 48:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "., whilst there is no force whatever in the second. The last argument employed is a more plausible one - namely, that \"the five hundred rods are not in keeping with the sanctuary, because the edifice with the courts and gates would look but a little pile according to the previous measurements in the wide expanse of 20,000 (?) rods.\" But although the space measured off around the temple-building for the separation between the holy and the profane was five times as long and five times as broad, according to the Hebrew text, or twenty-five times as large as the whole extent of the temple and its courts,",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) Area of the temple with the two courts, 500 cubits square.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) Surrounding space, five hundred rods  equals  3000 cubits square.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) Circuit of fifty cubits in breadth around the surrounding space. - Ezekiel 45:2",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(c) Circuit of fifty cubits in breadth around the surrounding space. - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 45:2",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "the appearance of the temple with its courts is not diminished in consequence, because the surrounding space was not covered with buildings; on the contrary, the fact that it was separated from the common by so large a surrounding space, would rather add to the importance of the temple with its courts. This broad separation is peculiar to Ezekiel's temple, and serves, like many other arrangements in the new sanctuary and worship, to symbolize the inviolable holiness of that sanctuary. The earlier sanctuary had nothing answering to this; and Kliefoth is wrong in supposing that the outer court served the same purpose in the tabernacle and Solomon's temple, whereas in the temple of Ezekiel this had also become part of the sanctuary, and was itself holy. The tabernacle had no outer court at all, and in Solomon's temple the outer court did form a component part of the sanctuary. The people might enter it, no doubt, when they desired to draw near to the Lord with sacrifices and gifts; but this continued to be the case in Ezekiel's temple, though with certain restrictions (cf. Ezekiel 46:9 and Ezekiel 46:10). Only, in the case of Solomon's temple, the outer court bordered directly upon the common soil of the city and the land, so that the defilement of the land produced by the sin of the people could penetrate directly even into the holy space of the courts. In the sanctuary of the future, a safeguard was to be placed against this by the surrounding space which separated the holy from the common. It is true that the surface of Moriah supplied no room for this space of five hundred rods square; but the new temple was not to be built upon the real Moriah, but upon a very high mountain, which the Lord would exalt and make ready for the purpose when the temple was erected. Moreover, the circumstance that Moriah was much too small for the extent of the new temple and its surroundings, cannot furnish any argument against the correctness of our view of the verses in question, for the simple reason that in Ezekiel 45 and 48 there follow still further statements concerning the separation of the sanctuary from the rest of the land, which are in perfect harmony with this, and show most indisputably that the temple seen by Ezekiel was not to have its seat in the ancient Jerusalem. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "the appearance of the temple with its courts is not diminished in consequence, because the surrounding space was not covered with buildings; on the contrary, the fact that it was separated from the common by so large a surrounding space, would rather add to the importance of the temple with its courts. This broad separation is peculiar to Ezekiel's temple, and serves, like many other arrangements in the new sanctuary and worship, to symbolize the inviolable holiness of that sanctuary. The earlier sanctuary had nothing answering to this; and Kliefoth is wrong in supposing that the outer court served the same purpose in the tabernacle and Solomon's temple, whereas in the temple of Ezekiel this had also become part of the sanctuary, and was itself holy. The tabernacle had no outer court at all, and in Solomon's temple the outer court did form a component part of the sanctuary. The people might enter it, no doubt, when they desired to draw near to the Lord with sacrifices and gifts; but this continued to be the case in Ezekiel's temple, though with certain restrictions (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 46:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 46:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Only, in the case of Solomon's temple, the outer court bordered directly upon the common soil of the city and the land, so that the defilement of the land produced by the sin of the people could penetrate directly even into the holy space of the courts. In the sanctuary of the future, a safeguard was to be placed against this by the surrounding space which separated the holy from the common. It is true that the surface of Moriah supplied no room for this space of five hundred rods square; but the new temple was not to be built upon the real Moriah, but upon a very high mountain, which the Lord would exalt and make ready for the purpose when the temple was erected. Moreover, the circumstance that Moriah was much too small for the extent of the new temple and its surroundings, cannot furnish any argument against the correctness of our view of the verses in question, for the simple reason that in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezekiel 45",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and 48 there follow still further statements concerning the separation of the sanctuary from the rest of the land, which are in perfect harmony with this, and show most indisputably that the temple seen by Ezekiel was not to have its seat in the ancient Jerusalem. ",
            "children": []
          }
        ]
      }
    ]
  }
]