[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(3) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Herod the king.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—When the Magi reached Jerusalem, the air was thick with fears and rumours, The old king (the title had been given by the Roman Senate in B.C. 40) was drawing to the close of his long and blood-stained reign. Two years before he had put to death, on a charge of treason, his two sons by Mariamne, his best-loved wife, through sheer jealousy of the favour with which the people looked on them. At the time when this history opens, his eldest son, Antipater, was under condemnation. The knowledge that priests and people were alike looking for the “consolation of Israel” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 2:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 2:38",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), the whispers that told that such a consolation had come, the uneasiness excited in the people by the “taxing” in which he had been forced to acquiesce, all these were elements of disquietude prior to the arrival of the Magi, and turned the last days of the Idumæan prince (his subjects never forgot his origin) into a time of frenzied and cruel suspicion. The excitement naturally spread throughout the city.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Matthew 2:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 2:3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "When Herod heard, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "— he was troubled ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "alarmed, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "as Dr. Waterland renders ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "εταραχθη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The word properly signifies a great emotion of mind, whatever the cause thereof be. Being a prince of a very suspicious temper, and his cruelties having rendered him obnoxious to his subjects, he feared losing his kingdom, especially as he had taken Jerusalem by force, and was settled on his throne by the aid of the Romans. Hence it is no wonder that he was concerned to hear of the birth of one that was to be king, and especially to have such an extraordinary confirmation of it, as that of persons coming from a far country, directed by an extraordinary impulse upon the sight of a new star, which pointed to Judea as the seat of his empire. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And all Jerusalem with him ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Fearing he should make it an occasion of renewing some of those tyrannical actions which had lately filled them with so much horror, as is related at large by Josephus. They dreaded likewise, it seems, a change of government, as knowing it does not usually happen without bloodshed, and that the Romans had great power, and would oppose any change in their affairs.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2:1-8 Those who live at the greatest distance from the means of grace often use most diligence, and learn to know the most of Christ and his salvation. But no curious arts, or mere human learning, can direct men unto him. We must learn of Christ by attending to the word of God, as a light that shineth in a dark place, and by seeking the teaching of the Holy Spirit. And those in whose hearts the day-star is risen, to give them any thing of the knowledge of Christ, make it their business to worship him. Though Herod was very old, and never had shown affection for his family, and was not himself likely to live till a new-born infant had grown up to manhood, he began to be troubled with the dread of a rival. He understood not the spiritual nature of the Messiah's kingdom. Let us beware of a dead faith. A man may be persuaded of many truths, and yet may hate them, because they interfere with his ambition, or sinful indulgences. Such a belief will make him uneasy, and the more resolved to oppose the truth and the cause of God; and he may be foolish enough to hope for success therein.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Had heard these things - Had heard of their coming, and of the star, and of the design of their coming.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "He was troubled - Herod had obtained the kingdom by great crimes, and by shedding much blood. He was therefore easily alarmed by any remarkable appearances; and the fact that this star appeared, and that it was regarded as proof that a King of the Jews was born, alarmed him. Besides, it was a common expectation that the Messiah was about to appear, and he feared that his reign was about to come to an end. He therefore began to inquire in what way he might secure his own safety and the permanency of his government.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "All Jerusalem - The people of Jerusalem, and particularly the friends of Herod. There were many in Jerusalem to whom the coming of the Messiah would be a matter of joy; but all of Herod's friends would doubtless be alarmed at his coming. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "All Jerusalem - The people of Jerusalem, and particularly the friends of Herod. There were many in Jerusalem to whom the coming of the Messiah would be a matter of joy; but all of Herod's friends would doubtless be alarmed at his coming. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3. When Herod the king had heard these things, he was troubled—viewing this as a danger to his own throne: perhaps his guilty conscience also suggested other grounds of fear.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and all Jerusalem with him—from a dread of revolutionary commotions, and perhaps also of Herod's rage.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Herod was hardly warm in his kingdom, and had taken Jerusalem by force, and was therefore much concerned to hear that there was a new King born; and supposing him to have been all his life acquainted with the Jewish writings and records, where were prophecies of the Messias under the notion of a King, and not knowing that the kingdom of the Messias was not to be of this world, but being possessed of the ordinary nation of the Jews, that the Messias should restore a temporal kingdom to Israel, he could not but be troubled at the news of one born who was to be the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "King of the Jews, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " especially having a confirmation of it by such an extraordinary means, as persons coming from a far country, and being directed to their journey by some extraordinary impulse, upon the sight of a new star, which pointed to Judea, as the place to which it related: Herod upon this might justly think that his newly acquired kingdom would not last long. And though most people are quickly weary of conquerors, yet their former miseries being fresh in their minds, and the renewing of them likely upon a change in the government, it is no wonder if the generality of the people were also troubled. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "When Herod the king had heard these things,.... That is, the report made by the wise men of the appearance of an unusual star, and of the birth of the king of the Jews, which they affirmed with all certainty, without any hesitation, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "he was troubled, and all Jerusalem with him. Herod was troubled, his mind was disturbed and made uneasy, fearing he should be deposed, and lose his kingdom, to which he knew he had no just right and claim, being a foreigner; and \"all Jerusalem\", i.e. all the inhabitants of Jerusalem, who heard of this, were also troubled, and showed a concern at it with him; either feignedly, as knowing his jealousy, suspicion and cruelty; or in reality, because of tumults, commotions and wars, they might fear would arise upon this, having lost the true notion of the Messiah, as a spiritual king, saviour and redeemer. And hereby was fulfilled, in part, the famous prophecy in Genesis 49:10 according to the sense of one (w) of the Targumists on it, who paraphrases it after this manner; ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "he was troubled, and all Jerusalem with him. Herod was troubled, his mind was disturbed and made uneasy, fearing he should be deposed, and lose his kingdom, to which he knew he had no just right and claim, being a foreigner; and \"all Jerusalem\", i.e. all the inhabitants of Jerusalem, who heard of this, were also troubled, and showed a concern at it with him; either feignedly, as knowing his jealousy, suspicion and cruelty; or in reality, because of tumults, commotions and wars, they might fear would arise upon this, having lost the true notion of the Messiah, as a spiritual king, saviour and redeemer. And hereby was fulfilled, in part, the famous prophecy in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 49:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " according to the sense of one (w) of the Targumists on it, who paraphrases it after this manner; ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Kings and governors shall not cease from the house of Judah, nor scribes, who teach the law, from his seed, until the time that the king Messiah, the least of his sons, comes, \"and because of him\", , \"the people shall melt.\"'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that is, they shall be distressed and troubled, their hearts shall melt like wax within them; which was their present case, though perhaps the paraphrast may design the Gentiles. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(w) Jonathan ben Uzziel in loc. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(w) Jonathan ben Uzziel in loc. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "When Herod the king had heard these things, he was {c} troubled, and all Jerusalem with him.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "When Herod the king had heard ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "these things",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", he was ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{c}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " troubled, and all Jerusalem with him.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) Was much moved, for he was a foreigner, and became ruler by force; and the Jews were troubled; for wickedness is mad and raging.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Meyer's NT Commentary",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 2:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Herod was afraid, because he dreaded the overthrow of his throne; the inhabitants of Jerusalem, however, not so much on account of the times of misfortune which were expected to precede the Messiah (Lightfoot on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 13:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; Bertholdt, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Christol",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". p. 45 f.), but in keeping with their special circumstances, because they dreaded the adoption by the tyrant, in the maintenance of his rule, of measures hostile to the people.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἱεροσόλυμα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Feminine",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " form, occurring only here and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 3:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and without any various reading in the Codd. It is found also in Latin (Tac. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Hist",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". v. 2; Sueton. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Aug",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". xciii.). To take the name as ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "neuter",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and to supply ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πόλις",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Wetstein, Grimm, Buttmann, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "neut. Gr",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". p. 16 [E. T. 18]), is not grammatically possible. The feminine form must have been in actual use, although the neuter, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 2:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἱερουσαλήμ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", were and remained the prevailing forms.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 2:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὁ βασιλεὺς Ἡρώδης ἐταράχθη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "βασιλεὺς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " before the name, not after, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 2:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the emphatic position suggesting that it was as king and because king that Herod was troubled. The foreigner and usurper feared a rival, and the tyrant feared the rival would be welcome. It takes little to put evildoers in fear. He had reigned long, men were weary, and the Pharisees, according to Joseph (A. J. xvii. 2–4), had predicted that his family would were long lose its place of power. His fear therefore, though the occasion may seem insignificant, is every way credible.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καὶ πᾶσα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " I., doubtless an exaggeration, yet substantially true. The spirit of the city was servile and selfish. They bowed to godless power, and cared for their own interest rather than for Herod’s. Few in that so-called holy city had healthy sympathies with truth and right. Whether the king’s fears were groundless or not they knew not nor cared. It was enough that the fears existed. The world is ruled not by truth but by opinion.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πᾶσα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": s ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἰεροσόλυμα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " feminine here, or is ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἡ πὀλις",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " understood? or is it a construction, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ad sensum",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", of the inhabitants? (Schanz).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "all Jerusalem with him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Fearing some fresh outbreak of cruelty.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 2:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἐταράχθη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "was troubled",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") The king, now seventy years old, might be troubled all the more easily, because the Pharisees, a short time before, had foretold (as we learn from Josephus, Antiquities xvii. 3), that the kingdom was about to be taken from the family of Herod. The trouble of the king is a testimony against the carelessness of the people. If Herod fears, why do not the Jews inquire? why do they not believe?—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πᾶσα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "all",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") sc. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πόλις",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the city",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "[79]—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "μέτʼ αὐτοῦ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "with him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") The people, who had been long accustomed to the king, followed his lead. Men are frequently overset by the sudden announcement of even good tidings.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[79] Which had been so long standing in a posture of expectation, awaiting the Messiah’s coming.—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Vers. Germ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 3.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "When",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "and when",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Revised Version. There is a contrast (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "δέ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") between the eager question of the Magi and the feelings of Herod. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Herod",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "the king",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In the true text the emphasis is not on the person (as in ver. 1, where the date was all-important), but on the office as then exercised. Tile king visibly regnant is contrasted with him who was born to be King. Heard. Through some of his many sources of information, for \"there were spies set everywhere\" (Josephus, 'Ant.,' 15:10. 4). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "These things",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "it",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Revised Version. Nothing is expressed in the original. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "He was troubled",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; perplexed, agitated (",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἐταράχθη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Fully in accordance with his jealous and suspicious character. For he had already slain, as actual or possible candidates for the throne, five of the Maccabean princes and princesses, including his favourite wife Mariamne (thus extirpating the direct line) and also his two sons by Mariamne. Josephus ('Ant.,' 17:02. 4; cf. Holtzmann) mentions a prediction of the Pharisees towards the end of Herod's life, that \"God had decreed that Herod's government should cease, and his posterity should be deprived of it.\" This seems to have a Messianic reference, though used at the time for an intrigue in favour of Pheroras, Herod's brother. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And all Jerusalem",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The feminine (here only, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "πᾶσα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "Ἰεροσόλυμα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") points to a Hebrew source. The reason for the inhabitants of Jerusalem feeling troubled is generally explained, by their fear, which was in fact only too well justified by experience, that the news would excite Herod to fresh crimes. It is also possible that many would shrink from the changes which the coming of Messiah could not but bring. Present ease, though only comparative, is with the unbelieving preferable to possibilities of the highest blessedness. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 21:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " affords both a parallel and a contrast. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "With him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". In this respect Jerusalem was one with Herod (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 1:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Matthew 2:3",
        "children": []
      }
    ]
  }
]