[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(8) Bethlehem was but a short six miles from Jerusalem. “Diligently,” better, as before, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "exactly.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " So far as the mission became known, it would impress the people with the belief that he too shared their hopes, and was ready to pay his homage to the new-born King.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Matthew 2:8. ",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 2:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "When ye have found him, bring me word again ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Viz., concerning the young child, his condition, and that of his parents, and all circumstances. It seems probable that Herod did not believe he was born, otherwise it is amazing that so suspicious and artful a prince as he was should put this important affair on so precarious a footing. How easily might he, if he had not himself accompanied these learned strangers, under pretence of doing honour to them, have sent a guard of soldiers with them, who might, humanly speaking, without any difficulty have slaughtered the child and his parents on the spot. But, perhaps, he might be unwilling to commit such an act of cruelty in the presence of these sages, lest their report of it should render him infamous abroad. Or rather, we must refer his conduct, in this matter, to that secret influence with which God, whenever he pleases, can infatuate the most sagacious of mankind, and disappoint their designs. See Doddridge. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "That I may come and worship him also ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— That I also, who would permit no interest of mine to interfere with the decrees of Heaven, may come with my family and court to pay homage to this new-born king; a duty to which I look upon myself as peculiarly obliged. Mark the hypocrisy of this perfidious tyrant! We may observe here, it is a peculiar excellence in the sacred writers, that they often describe a person’s character in one sentence, or even in one word, and that, by the by, when they are pursuing another object. An instance of this we have in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 2:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where the evangelist mentions Herod’s being ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "troubled ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "at the tidings brought by the wise men, an expression which exactly marked his character. Here again his disposition is perfectly developed; deep, crafty, subtle; pretending one thing but intending another; professing to have a design of worshipping Jesus, when his purpose was to murder him! In like manner having, according to Josephus, lib. 15. cap. 3, out of pretended friendship invited Aristobulus to an entertainment at Jericho, he contrived after dinner to have him drowned in a fish-pond, in which he was persuaded to bathe along with several of Herod’s attendants. For they, by Herod’s direction, as if in play and sport, dipped him so often, and kept him so long under water, that he died in their hands. And then, as if his death had been an unfortunate accident, which had happened without any previous design, Herod pretended great sorrow for it, shed abundance of tears, and bestowed upon his body a very splendid and expensive funeral.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2:1-8 Those who live at the greatest distance from the means of grace often use most diligence, and learn to know the most of Christ and his salvation. But no curious arts, or mere human learning, can direct men unto him. We must learn of Christ by attending to the word of God, as a light that shineth in a dark place, and by seeking the teaching of the Holy Spirit. And those in whose hearts the day-star is risen, to give them any thing of the knowledge of Christ, make it their business to worship him. Though Herod was very old, and never had shown affection for his family, and was not himself likely to live till a new-born infant had grown up to manhood, he began to be troubled with the dread of a rival. He understood not the spiritual nature of the Messiah's kingdom. Let us beware of a dead faith. A man may be persuaded of many truths, and yet may hate them, because they interfere with his ambition, or sinful indulgences. Such a belief will make him uneasy, and the more resolved to oppose the truth and the cause of God; and he may be foolish enough to hope for success therein.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Go, and search diligently ... - Herod took all possible means to obtain accurate information respecting the child, that he might be sure of destroying him. He not only ascertained the probable time of his birth, and the place where he would be born, but he sent the wise men that they might actually see him, and bring him word. All this might have looked suspicious if he had not clothed it with the appearance of religion. He said to them, therefore, that he did it that he might go and worship him also. From this we may learn,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. That wicked people often cloak their evil designs under the appearance of religion. They attempt to deceive those who are really good, and to make them suppose that they have the same design.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "2. Wicked people often attempt to make use of the pious to advance their evil purposes. Men like Herod will stop at nothing if they can carry out their ends. They endeavor to deceive the simple, to allure the unsuspecting, and to beguile the weak, in order to accomplish their own purposes of wickedness.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "3. The plans of wicked people are often well laid. Those plans occupy a long time. Such people make diligent inquiry, and all of it has the appearance of religion. But God sees through the design; and though people are deceived, yet God cannot be fooled, Proverbs 15:3. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "3. The plans of wicked people are often well laid. Those plans occupy a long time. Such people make diligent inquiry, and all of it has the appearance of religion. But God sees through the design; and though people are deceived, yet God cannot be fooled, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Proverbs 15:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8. And he sent them to Bethlehem, and said, Go and search diligently—\"Search out carefully.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for the young child; and when ye have found him, bring me word again, that I may come and worship him also—The cunning and bloody hypocrite! Yet this royal mandate would meantime serve as a safe conduct to the strangers.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " He tells the wise men that Bethlehem was the place, wherein his wise men had informed him that the King of the Jews was to be born, and sends them thither with these instructions: That they should go, and ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "search diligently",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " there ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "for the young Child, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " whom he doth not call King; thereby dissembling his bloody mind, and making as if he had no jealousy of him; yet withal he suggests to them that he was like to be a great Prince, or else he would never have pretended that he had a design, when once he knew certainly where he was, to go and pay a homage to him. This text lets us see the malignity of Herod’s heart, and indeed of all wicked men’s hearts. Herod knew that the Messiah was born. The extraordinary star and the coming of the wise men, the priests’ and scribes’ answer to him, could not but confirm him that he was born, who was long since promised, as a King and Governor to Israel; yet could he not obtain of his wretched heart to comply with the counsels of God, but, contrary to his own convictions, shows the folly of his heart, in thinking it was in his power to frustrate the Divine counsels, and be too hard for God himself. Nor is his folly less remarkable, not sending any of his own courtiers with them, whom he might better have trusted than mere strangers to have come back and brought him an account; but whether it was that he durst not trust any of the Jews, or that he was over credulous in trusting to the innocent simplicity of these wise men, being not made acquainted with his intentions, he suffereth them to go alone upon this errand, whom he might possibly think would be least suspected of Joseph and Mary, so as at their return he should have a more full account of all circumstances concerning him, than he could have expected from one who had been taken notice of as one that belonged to his court. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And he sent them to Bethlehem,.... Having got out of them all that he could, and was for his purpose, he informs them of the place where they might find the person they came to inquire after, according to the account of it which the chief priests and scribes had given him; and then sends them away to Bethlehem, where Christ, according to prophecy, was to be born, and now was born. It may seem strange that neither any of the Jews, nor Herod, or any of his ministers and courtiers, should go along with these men to Bethlehem; since it was but a little way off, not above five or six miles from Jerusalem; and since the birth of such a person was no trivial thing, but an affair of great concern and importance. The Jews might not care to go, lest Herod should suspect that they were going to revolt from him, and set up this new born king against him; and it might be a piece of policy in Herod and his courtiers not to accompany them, for they might imagine that the parents of the child would be jealous and afraid of them, and would therefore conceal it, when they would be in no fear of strangers: and no doubt but the wise providence of God overruled and directed this matter, that so the young child Jesus might be preserved from the bloody designs of this tyrant; who often takes the wise in their own craftiness, and carries the counsel of the froward headlong. When he dismissed them he gave them this charge and these orders, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "go and search diligently for the young child; go to Bethlehem, the place of his birth I have told you of, and there inquire and search in every house and family, omit none till you have found him; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and when you have found him bring me word again; give me a particular account of him, who are his parents, and where he dwells, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that I may come and worship him also: for they had declared, that the reason of their coming was to worship him; this he said hypocritically, in order to hide and cover his bloody intentions. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "that I may come and worship him also: for they had declared, that the reason of their coming was to worship him; this he said hypocritically, in order to hide and cover his bloody intentions. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And he sent them to Bethlehem, and said, Go and search diligently for the young child; and when ye have found him, bring me word again, that I may come and worship him also.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 2:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καὶ πέμψας",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " … ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "αὐτῷ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": his hypocrisy went further. He bade the strangers go to Bethlehem, find out the whereabouts of the child, come back and tell him, that he also might go and worship Him. Worship, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", murder! “Incredible motive!” (H.C.). Yes, as a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "real",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " motive for a man like Herod, but not as a pretended one, and quite likely to be believed by these simple, guileless souls from the east.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "πέμψας εἶπε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": the sending was synchronous with the directions according to De Wette, prior according to Meyer. It is a question of no importance here, but it is sometimes an important question in what relation the action expressed by the aorist participle stands to that expressed by the following finite verb. The rule certainly is that the participle expresses an action going before: one thing having happened, another thereafter took place. But there is an important class of exceptions. The aorist participle “may express time coincident with that of the verb, when the actions of the verb and the participle are practically one”. Goodwin, Syntax, p. 52, and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "vide",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " article there referred to by Prof. Ballantine in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Bibl. Sacra.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", 1884, on the application of this rule to the N. T., in which many instances of the kind occur. Most frequent in the Gospels is the expression ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀποκριθεὶς εἶπε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which does not mean “having first answered he then proceeded to say,” but “in answering he said”. The case before us may be one of this kind. He sent them by saying “Go and search,” etc.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he sent them to Bethlehem",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Up to this point the Magi are not said to have been guided by the Star; they go to Bethlehem in accordance with Herod’s directions, which were based on the report of the Sanhedrin; as they went the star again appeared in the East.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 2:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἐξετάσατε ἀκριβῶς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "enquire diligently",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") others read ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀκριβῶς ἐξετάσατε",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",[90] diligently enquire.[91] The variation is of no consequence, especially as it occurs in the words of Herod. Let us pass by such things without comment. The same phrase occurs in the Septuagint Version of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 19:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [where we read “",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καὶ ἐξετάσωσιν οἱ κριταὶ ἀκριβῶς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",” “and the judges shall enquire diligently.”]—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐπὰν δὲ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "but if",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")[92] The use of the particle gives an antithetical force to the succeeding words.—See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 11:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 11:34",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Herod did not accept the intelligence of the Magi as true, though he considered it as possible; it is not, therefore, to be wondered at that he did not immediately go with them to worship.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[90] This is the reading of E. M.—(I. B.)",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[91] BC (corrected later) D ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "abc",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Vulg. read with Beng. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐξετάσατέ ἀκριβῶς",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The reading of Rec. Text is without very ancient authority.—ED.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[92] Engl. Vers. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And when",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—(I. B.)",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 8.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And he sent them to Bethlehem",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Thus answering their question (ver. 2). And said, Go and search diligently for the young Child; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "and search out carefully concerning",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",  Revised Version; ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "ἐξετάσατε ἀκριβῶς περί",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Herod bade them make precise inquiry as to all particulars about the Child. The more details he could obtain, the more easily he could make away with him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And when ye have found him, bring me word again, that I may come and worship him also;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the Revised Version rightly joins, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "I",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "also -",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " I as well as you; I the king. It might well be at a secret conference with the Magi that Herod said this, for no Jew would have believed him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Worship",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ver. 2, note. Matthew 2:8",
        "children": []
      }
    ]
  }
]