[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(12) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "In hope.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The Christian’s hope, of which we have had more in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 8:20-25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Patient in tribulation.—This virtue was, of course, specially needed in the troublous times through which the Church was passing. So, again, in the next verse, the “hospitality” of which the Apostle speaks is something more than the ordinary entertainment of friends. The reference is to a state of things in which the Christian was liable to be persecuted and driven from city to city, and often compelled to seek for shelter with those who held the same faith as himself.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "Patient in tribulation.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—This virtue was, of course, specially needed in the troublous times through which the Church was passing. So, again, in the next verse, the “hospitality” of which the Apostle speaks is something more than the ordinary entertainment of friends. The reference is to a state of things in which the Christian was liable to be persecuted and driven from city to city, and often compelled to seek for shelter with those who held the same faith as himself.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Romans",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "ANOTHER TRIPLET OF GRACESRomans 12:12",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "ANOTHER TRIPLET OF GRACES",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 12:12",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " These three closely connected clauses occur, as you all know, in the midst of that outline of the Christian life with which the Apostle begins the practical part of this Epistle. Now, what he omits in this sketch of Christian duty seems to me quite as significant as what he inserts. It is very remarkable that in the twenty verses devoted to this subject, this is the only one which refers to the inner secrets of the Christian life. Paul’s notion of ‘deepening the spiritual life’ was ‘Behave yourself better in your relation to other people.’ So all the rest of this chapter is devoted to inculcating our duties to one another. Conduct is all-important. An orthodox creed is valuable if it influences action, but not otherwise. Devout emotion is valuable, if it drives the wheels of life, but not otherwise. Christians should make efforts to attain to clear views and warm feelings, but the outcome and final test of both is a daily life of visible imitation of Jesus. The deepening of spiritual life should be manifested by completer, practical righteousness in the market-place and the street and the house, which non-Christians will acknowledge.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But now, with regard to these three specific exhortations here, I wish to try to bring out their connection as well as the force of each of them.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. So I remark first, that the Christian life ought to be joyful because it is hopeful. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. So I remark first, that the Christian life ought to be joyful because it is hopeful.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Now, I do not suppose that many of us habitually recognise it as a Christian duty to be joyful. We think that it is a matter of temperament and partly a matter of circumstance. We are glad when things go well with us. If we have a sunny disposition, and are naturally light-hearted, all the better; if we have a melancholy or morose one, all the worse. But do we recognise this, that a Christian who is not joyful is not living up to his duty; and that there is no excuse, either in temperament or in circumstances, for our not being so, and always being so? ‘Rejoice in the Lord alway,’ says Paul; and then, as if he thought, ‘Some of you will be thinking that that is a very rash commandment, to aim at a condition quite impossible to make constant,’ he goes on-’and, to convince you that I do not say it hastily, I will repeat it-“and again I say, rejoice.”‘ Brethren, we shall have to alter our conceptions of what true gladness is before we can come to understand the full depth of the great thought that joy is a Christian duty. The true joy is not the kind of joy that a saying in the Old Testament compares to the ‘crackling of thorns under a pot,’ but something very much calmer, with no crackle in it; and very much deeper, and very much more in alliance with ‘whatsoever things are lovely and of good report,’ than that foolish, short-lived, and empty mirth that burns down so soon into black ashes.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " To be glad is a Christian duty. Many of us have as much religion as makes us sombre, and impels us often to look upon the more solemn and awful aspects of Christian truth, but we have not enough to make us glad. I do not need to dwell upon all the sources in Christian faith and belief, of that lofty and imperatively obligatory gladness, but I confine myself to the one in my text, ‘Rejoicing in hope.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Now, we all know-from the boy that is expecting to go home for his holidays in a week, up to the old man to whose eye the time-veil is wearing thin-that hope, if it is certain, is a source of gladness. How lightly one’s bosom’s lord sits upon its throne, when a great hope comes to animate us! how everybody is pleasant, and all things are easy, and the world looks different! Hope, if it is certain, will gladden, and if our Christianity grasps, as it ought to do, the only hope that is absolutely certain, and as sure as if it were in the past and had been experienced, then our hearts, too, will sing for joy. True joy is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "not",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a matter of temperament, so much as a matter of faith. It is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "not",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a matter of circumstances. All the surface drainage may be dry, but there is a well in the courtyard deep and cool and full and exhaustless, and a Christian who rightly understands and cherishes the Christian hope is lifted above temperament, and is not dependent upon conditions for his joys.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The Apostle, in an earlier part of this same letter, defines for us what that hope is, which thus is the secret of perpetual gladness, when he speaks about ‘rejoicing in hope of the glory of God.’ Yes, it is that great, supreme, calm, far off, absolutely certain prospect of being gathered into the divine glory, and walking there, like the three in the fiery furnace, unconsumed and at ease; it is that hope that will triumph over temperament, and over all occasions for melancholy, and will breathe into our life a perpetual gladness. Brethren, is it not strange and sad that with such a treasure by our sides we should consent to live such poor lives as we do?",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But remember, although I cannot say to myself, ‘Now I will be glad,’ and cannot attain to joy by a movement of the will or direct effort, although it is of no use to say to a man-which is all that the world can ever say to him-’Cheer up and be glad,’ whilst you do not alter the facts that make him sad, there is a way by which we can bring about feelings of gladness or of gloom. It is just this-we can choose what we will look at. If you prefer to occupy your mind with the troubles, losses, disappointments, hard work, blighted hopes of this poor sin-ridden world, of course sadness will come over you often, and a general grey tone will be the usual tone of your lives, as it is of the lives of many of us, broken only by occasional bursts of foolish mirth and empty laughter. But if you choose to turn away from all these, and instead of the dim, dismal, hard present, to sun yourselves in the light of the yet unrisen sun, which you can do, then, having rightly chosen the subjects to think about, the feeling will come as a matter of course. You cannot make yourselves glad by, as it were, laying hold of yourselves and lifting yourselves into gladness, but you can rule the direction of your thoughts, and so can bring around you summer in the midst of winter, by steadily contemplating the facts-and they are present facts, though we talk about them collectively as ‘the future’-the facts on which all Christian gladness ought to be based. We can carry our own atmosphere with us; like the people in Italy, who in frosty weather will be seen sitting in the market-place by their stalls with a dish of embers, which they grasp in their hands, and so make themselves comfortably warm on the bitterest day. You can bring a reasonable degree of warmth into the coldest weather, if you will lay hold of the vessel in which the fire is, and keep it in your hand and close to your heart. Choose what you think about, and feelings will follow thoughts.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But it needs very distinct and continuous effort for a man to keep this great source of Christian joy clear before him. We are like the dwellers in some island of the sea, who, in some conditions of the atmosphere, can catch sight of the gleaming mountain-tops on the mainland across the stormy channel between. But thick days, with a heavy atmosphere and much mist, are very frequent in our latitude, and then all the distant hills are blotted out, and we see nothing but the cold grey sea, breaking on the cold, grey stones. Still, you can scatter the mist if you will. You can make the atmosphere bright; and it is worth an effort to bring clear before us, and to keep high above the mists that cling to the low levels, the great vision which will make us glad. Brethren, I believe that one great source of the weakness of average Christianity amongst us to-day is the dimness into which so many of us have let the hope of the glory of God pass in our hearts. So I beg you to lay to heart this first commandment, and to rejoice in hope.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. Now, secondly, here is the thought that life, if full of joyful hope, will be patient. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. Now, secondly, here is the thought that life, if full of joyful hope, will be patient.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "I have been saying that the gladness of which my text speaks is independent of circumstances, and may persist and be continuous even when externals occasion sadness. It is possible-I do not say it is easy, God knows it is hard-I do not say it is frequently attained, but I do say it is possible-to realise that wonderful ideal of the Apostle’s ‘As sorrowful, yet always rejoicing.’ The surface of the ocean may be tossed and fretted by the winds, and churned into foam, but the great central depths ‘hear not the loud winds when they call,’ and are still in the midst of tempest. And we, dear brethren, ought to have an inner depth of spirit, down to the disturbance of which no surface-trouble can ever reach. That is the height of attainment of Christian faith, but it is a possible attainment for every one of us.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And if there be that burning of the light under the water, like ‘Greek fire,’ as it was called, which many waters could not quench-if there be that persistence of gladness beneath the surface-sorrow, as you find a running stream coming out below a glacier, then the joy and the hope, which co-exist with the sorrow, will make life patient.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Now, the Apostle means by these great words, ‘patient’ and ‘patience,’ which are often upon his lips, something more than simple endurance. That endurance is as much as many of us can often muster up strength to exercise. It sometimes takes all our faith and all our submission simply to say, ‘I opened not my mouth, because thou didst it; and I will bear what thine hand lays upon me.’ But that is not all that the idea of Christian ‘patience’ includes, for it also takes in the thought of active work, and it is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "perseverance",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as much as ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "patience",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Now, if my heart is filled with a calm gladness because my eye is fixed upon a celestial hope, then both the passive and active sides of Christian ‘patience’ will be realised by me. If my hope burns bright, and occupies a large space in my thoughts, then it will not be hard to take the homely consolation of good John Newton’s hymn and say-",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘Though painful at present,‘Twill cease before long;And then, oh, how pleasantThe conqueror’s song!’ ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "‘Though painful at present,",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "‘Twill cease before long;",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "And then, oh, how pleasant",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "The conqueror’s song!’",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "A man who is sailing to America, and knows that he will be in New York in a week, does not mind, although his cabin is contracted, and he has a great many discomforts, and though he has a bout of sea-sickness. The disagreeables are only going to last for a day or two. So our hope will make us bear trouble, and not make much of it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " And our hope will strengthen us, if it is strong, for all the work that is to be done. Persistence in the path of duty, though my heart be beating like a smith’s hammer on the anvil, is what Christian men should aim at, and possess. If we have within our hearts that fire of a certain hope, it will impel us to diligence in doing the humblest duty, whether circumstances be for or against us; as some great steamer is driven right on its course, through the ocean, whatever storms may blow in the teeth of its progress, because, deep down in it, there are furnaces and boilers which supply the steam that drives the engines. So a life that is joyful because it is hopeful will be full of calm endurance and strenuous work. ‘Rejoicing in hope; patient,’ persevering in tribulation.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. Lastly, our lives will be joyful, hopeful, and patient, in proportion as they are prayerful. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. Lastly, our lives will be joyful, hopeful, and patient, in proportion as they are prayerful.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘Continuing instant’-which, of course, just means steadfast-’in prayer.’ Paul uttered a paradox when he said, ‘Rejoice in the Lord alway,’ as he said long before this verse, in the very first letter that he ever wrote, or at least the first which has come down to us. There he bracketed it along with two other equally paradoxical sayings. ‘Rejoice evermore; pray without ceasing; in everything give thanks.’ If you pray without ceasing you can rejoice without ceasing.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But can I pray without ceasing? Not if by prayer you mean only words of supplication and petition, but if by prayer you mean also a mental attitude of devotion, and a kind of sub-conscious reference to God in all that you do, such unceasing prayer is possible. Do not let us blunt the edge of this commandment, and weaken our own consciousness of having failed to obey it, by getting entangled in the cobwebs of mere curious discussions as to whether the absolute ideal of perfectly unbroken communion with God is possible in this life. At all events it is possible to us to approximate to that ideal a great deal more closely than our consciences tell us that we ever yet have done. If we are trying to keep our hearts in the midst of daily duty in contact with God, and if, ever and anon in the press of our work, we cast a thought towards Him and a prayer, then joy and hope and patience will come to us, in a degree that we do not know much about yet, but might have known all about long, long ago.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " There is a verse in the Old Testament which we may well lay to heart: ‘They cried unto God in the battle, and He was entreated of them.’ Well, what sort of a prayer do you think that would be? Suppose that you were standing in the thick of battle with the sword of an enemy at your throat, there would not be much time for many words of prayer, would there? But the cry could go up, and the thought could go up, and as they went up, down would come the strong buckler which God puts between His servants and all evil. That is the sort of prayer that you, in the battle of business, in your shops and counting-houses and warehouses and mills, we students in our studies, and you mothers in your families and your kitchens, can send up to heaven. If thus we ‘pray without ceasing,’ then we shall ‘rejoice evermore,’ and our souls will be kept in patience and filled with the peace of God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Romans 12:12-18. ",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 12:12-18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Rejoicing in hope ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Of perfect holiness and everlasting happiness; or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of the glory of God; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 5:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ";) and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "of eternal life, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Titus 1:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "patient in tribulation ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— To which you may be exposed for the cause of Christ, or in whatever you may be called to suffer, according to the wise disposals of God’s gracious providence; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "continuing instant in prayer — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That you may stand firm in the faith, and have a seasonable deliverance from your trouble. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Distributing to the necessities of the saints",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " — As far as is in your power; accounting nothing your own which their relief requires you to communicate. It is remarkable that the apostle, treating expressly of the duties flowing from the communion of saints, yet never says one word about the dead. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Given to, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "διωκοντες",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "pursuing hospitality ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Not only embracing those that offer, but seeking opportunities to exercise it: a precept this, which the present circumstances of Christians rendered peculiarly proper, and indeed necessary; especially toward those strangers that were exiles from their own country, or were travelling in the cause of Christianity. To which we may add, that the want of public inns, (which were much less common than among us,) rendered it difficult for strangers to get accommodations. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Bless ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— That is, wish ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "well to, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and pray for, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "them which persecute you ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— That pursue you with evil intentions, and find means to bring upon you the greatest sufferings. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Bless, and curse not ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— No, not in your hearts, whatever provocations you may have to do so. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Rejoice with them that do rejoice, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — Maintain a constant sympathy with your Christian brethren, as the relation in which you stand to them, as members of the same body, requires. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Be of the same",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "mind one toward another ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Desire for others the same good which you wish for yourselves. Or, “let each condescend to the rest, and agree with them as far as he fairly and honourably can: and where you must differ, do not by any means quarrel about it, but allow the same liberty of sentiments you would claim.” So Doddridge. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Mind not high things ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Desire not riches, honour, or the company of the great; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "but condescend to men of low estate ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— To the meanest concerns of the meanest Christians, and stoop to all offices of Christian kindness toward them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Be not wise in your own conceits ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— So as to think you do not need the guidance of the divine wisdom, or the advice and counsel of your Christian brethren, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 3:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 3:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Recompense to no man evil for evil — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Nor imagine that any man’s injurious treatment of you will warrant your returning the injury. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Provide things honest in the sight of all men ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Think beforehand: contrive to give as little offence as may be to any. Take care that you do only such things as are justifiable and unexceptionable; such as may be above the need of excuse, and may appear, at the first view, fair and reputable. The word ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "προνοουμενοι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", rendered ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "provide, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "signifies, to think of the proper method of doing a thing, before we proceed to action. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "If it be possible ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— That is, so far as it may be done, 1st. Without dishonouring God; 2d, With a good conscience; 3d, If men’s abuses be not insufferable; that is, as far as is consistent with duty, honour, and conscience; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "live peaceably with all men",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " — Even with heathen and unbelievers, with whom you have any dealings.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12:9-16 The professed love of Christians to each other should be sincere, free from deceit, and unmeaning and deceitful compliments. Depending on Divine grace, they must detest and dread all evil, and love and delight in whatever is kind and useful. We must not only do that which is good, but we must cleave to it. All our duty towards one another is summed up in one word, love. This denotes the love of parents to their children; which is more tender and natural than any other; unforced, unconstrained. And love to God and man, with zeal for the gospel, will make the wise Christian diligent in all his wordly business, and in gaining superior skill. God must be served with the spirit, under the influences of the Holy Spirit. He is honoured by our hope and trust in him, especially when we rejoice in that hope. He is served, not only by working for him, but by sitting still quietly, when he calls us to suffer. Patience for God's sake, is true piety. Those that rejoice in hope, are likely to be patient in tribulation. We should not be cold in the duty of prayer, nor soon weary of it. Not only must there be kindness to friends and brethren, but Christians must not harbour anger against enemies. It is but mock love, which rests in words of kindness, while our brethren need real supplies, and it is in our power to furnish them. Be ready to entertain those who do good: as there is occasion, we must welcome strangers. Bless, and curse not. It means thorough good will; not, bless them when at prayer, and curse them at other times; but bless them always, and curse not at all. True Christian love will make us take part in the sorrows and joys of each other. Labour as much as you can to agree in the same spiritual truths; and when you come short of that, yet agree in affection. Look upon worldly pomp and dignity with holy contempt. Do not mind it; be not in love with it. Be reconciled to the place God in his providence puts you in, whatever it be. Nothing is below us, but sin. We shall never find in our hearts to condescend to others, while we indulge conceit of ourselves; therefore that must be mortified.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Rejoicing in hope - That is, in the hope of eternal life and glory which the gospel produces; see the notes at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 5:2-3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Patient in tribulation - In affliction patiently enduring all that maybe appointed. Christians may be enabled to do this by the sustaining influence of their hope of future glory; of being admitted to that world where there shall be no more death, and where all tears shall be wiped away from their eyes, Revelation 21:4; Revelation 7:17; compare James 1:4. See the influence of hope in sustaining us in affliction more fully considered in the notes at Romans 8:18-28.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Patient in tribulation - In affliction patiently enduring all that maybe appointed. Christians may be enabled to do this by the sustaining influence of their hope of future glory; of being admitted to that world where there shall be no more death, and where all tears shall be wiped away from their eyes, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 21:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 7:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "James 1:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". See the influence of hope in sustaining us in affliction more fully considered in the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 8:18-28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Continuing instant in prayer - That is, be persevering in prayer; see Colossians 4:2; see the notes at Luke 18:1. The meaning of this direction is, that in order to discharge aright the duties of the Christian life, and especially to maintain a joyful hope, and to be sustained in the midst of afflictions, it is necessary to cherish a spirit of prayer, and to live near to God. How often a Christian should pray, the Scriptures do not inform us. Of David we are told that he prayed seven times a day Psalm 119:164; of Daniel, that he was accustomed to pray three times a day Daniel 6:10; of our Saviour we have repeated instances of his praying mentioned; and the same of the apostles. The following rules, perhaps, may guide us in this.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Continuing instant in prayer - That is, be persevering in prayer; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Colossians 4:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; see the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 18:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The meaning of this direction is, that in order to discharge aright the duties of the Christian life, and especially to maintain a joyful hope, and to be sustained in the midst of afflictions, it is necessary to cherish a spirit of prayer, and to live near to God. How often a Christian should pray, the Scriptures do not inform us. Of David we are told that he prayed seven times a day ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 119:164",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; of Daniel, that he was accustomed to pray three times a day ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 6:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; of our Saviour we have repeated instances of his praying mentioned; and the same of the apostles. The following rules, perhaps, may guide us in this.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) every Christian should have some time allotted for this service, and some place where he may be alone with God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(2) it is not easy, perhaps not possible, to maintain a life of piety without regular habits of secret devotion.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(3) the morning, when we have experienced God's protecting care, when the mind is fresh, and the thoughts are as yet clear and unoccupied with the world, when we go forth to the duties, trials, and temptations of the day; and the evening, when we have again experienced his goodness, and are about to commit ourselves to his protecting care, and when we need his pardoning mercy for the errors and follies of the day, seem to be times which commend themselves to all as appropriate seasons for private devotion.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(4) every person will also find other times when private prayer will be needful, and when he will be inclined to it. In affliction, in perplexity, in moments of despondency, in danger, and want, and disappointment, and in the loss of friends, we shall feel the propriety of drawing near to God, and of pouring out the heart before him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(5) besides this, every Christian is probably conscious of times when he feels especially inclined to pray; he feels just like praying; he has a spirit of supplication; and nothing but prayer will meet the instinctive desires of his bosom. We are often conscious of an earnest desire to see and converse with an absent friend, to have communion with those we love; and we value such fellowship as among the happiest moments of life. So with the Christian. He may have an earnest desire to have communion with God; his heart pants for it; and he cannot resist the propensity to seek him, and pour out his desires before him. Compare the feelings expressed by David in Psalm 42:1-2, \"As the hart panteth after the water-brooks, so panteth my soul after thee O God. My soul thirsteth for God for the living God; when shall I come and appear before God;\" compare Psalm 63:1. Such seasons should be improved; they are the \"spring times\" of our piety; and we should expand every sail, that we may be \"filled with all the fullness of God.\" They are happy, blessed moments of our life; and then devotion is sweetest and most pure; and then the soul knows what it is to have fellowship with the Father and with his Son Jesus Christ, 1 John 1:3.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(5) besides this, every Christian is probably conscious of times when he feels especially inclined to pray; he feels just like praying; he has a spirit of supplication; and nothing but prayer will meet the instinctive desires of his bosom. We are often conscious of an earnest desire to see and converse with an absent friend, to have communion with those we love; and we value such fellowship as among the happiest moments of life. So with the Christian. He may have an earnest desire to have communion with God; his heart pants for it; and he cannot resist the propensity to seek him, and pour out his desires before him. Compare the feelings expressed by David in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 42:1-2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"As the hart panteth after the water-brooks, so panteth my soul after thee O God. My soul thirsteth for God for the living God; when shall I come and appear before God;\" compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 63:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Such seasons should be improved; they are the \"spring times\" of our piety; and we should expand every sail, that we may be \"filled with all the fullness of God.\" They are happy, blessed moments of our life; and then devotion is sweetest and most pure; and then the soul knows what it is to have fellowship with the Father and with his Son Jesus Christ, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 John 1:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(6) in addition to all this, Christians may be in the habit of praying to God without the formality of retirement, God locks upon the heart; and the heart may pour forth its secret desires to Him even when in business, when conversing with a friend, when walking, when alone, and when in society. Thus, the Christian may live a life of prayer; and it shall be one of the characteristics of his life that he prays! By this he shall be known; and in this he shall learn the way to possess peace in religion:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"In every joy that crowns my days,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In every pain Ibear.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "My heart shall find delight in praise,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Or seek relief in prayer.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "continued...",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12. Rejoicing, &c.—Here it is more lively to retain the order and the verbs of the original: \"In hope, rejoicing; in tribulation, enduring; in prayer, persevering.\" Each of these exercises helps the other. If our \"hope\" of glory is so assured that it is a rejoicing hope, we shall find the spirit of \"endurance in tribulation\" natural and easy; but since it is \"prayer\" which strengthens the faith that begets hope and lifts it up into an assured and joyful expectancy, and since our patience in tribulation is fed by this, it will be seen that all depends on our \"perseverance in prayer.\"",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Rejoicing in hope; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. in hope of deliverance here in due time, and of eternal salvation hereafter: ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole on \"Romans 5:2\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole on \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 5:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Continuing instant in prayer; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " be instant and constant in the duty. A metaphor from hounds, that give not over the game till they have got it: see ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Luke 18:1 Ephesians 6:18 Colossians 4:2 1 Thessalonians 5:17",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 18:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ephesians 6:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Colossians 4:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Thessalonians 5:17",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Rejoicing in hope,.... Of the glory of God, than the hope of which nothing can make a believer more cheerful in this world; the saints' joy is therefore called the \"rejoicing of the hope\", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 3:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This is placed between serving the Lord, and being patient in tribulation; for nothing tends more to animate the people of God to a cheerful serving of him, or to make them more patient under afflictions, than a hope of being for ever with the Lord: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "patient in tribulation; whilst the saints are in this world they must expect tribulation; their way to heaven lies through it; and it becomes them to be patient under it, not murmuring against God, on the one hand, nor reviling of men, on the other. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Continuing instant in prayer: prayer is needful at all times, but especially in a time of tribulation and distress, whether inward or outward. This should be made without ceasing; saints should watch unto it with all perseverance; men should pray always, and not faint; never give out and over, or be discouraged. This advice is rightly given and placed here, to teach us that we are to go to the throne of grace continually for fresh supplies of grace, and strength to enable us to exercise the grace, and perform the duties exhorted to both in preceding and following verses. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Continuing instant in prayer: prayer is needful at all times, but especially in a time of tribulation and distress, whether inward or outward. This should be made without ceasing; saints should watch unto it with all perseverance; men should pray always, and not faint; never give out and over, or be discouraged. This advice is rightly given and placed here, to teach us that we are to go to the throne of grace continually for fresh supplies of grace, and strength to enable us to exercise the grace, and perform the duties exhorted to both in preceding and following verses. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "{7} Rejoicing in hope; patient in tribulation; continuing instant in prayer;",
        "children": [
          {
            "element": "span",
            "class": "cverse3",
            "text": "{7}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Rejoicing in hope; patient in tribulation; continuing instant in prayer;",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(7) He reckons up different virtues together with their effects, that is, hope, patience in tribulation, evenness of mind, continuance in prayer, liberality towards the saints, hospitality, moderation of mind even in helping our enemies, feeling the same as others in their adversity as well as their prosperity, modesty, endeavouring to maintain honest agreement as much as we are able with all men, which cannot be extinguished by any man injuring us.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Meyer's NT Commentary",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 12:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "In virtue of hope",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (of the future ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "δόξα",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 5:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "joyful",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The dative denotes the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "motive",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Kühner, II. i. p. 380).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τῇ θλ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὑπομ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in the presence of tribulation holding out",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", remaining constant in it. On the dative, comp. Kühner, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "l.c",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". p. 385. Paul might have written ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τὴν θλῖψιν ὑπομ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Corinthians 13:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Timothy 2:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 10:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "et al",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "., and according to the classical use); he writes, however, in the line of formal symmetry with the other expressions, the dative and then the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "absolute",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὑπομέν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 10:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Timothy 2:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jam 5:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Peter 2:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "προσευχῇ προσκ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".] ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "perseveringly applying to prayer",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Colossians 4:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 1:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 12:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τῇ ἐλπίδι χαίροντες",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": the hope in which they are to rejoice is that of Christians: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 5:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The meaning is practically the same as in that passage, but the mental representation is not. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τῇ ἐλπίδι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is not = ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐπʼ ἐλπίδι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " there, but in a line with the other datives here: in point of hope, rejoicing. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τῇ θλίψει ὑπομένοντες",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὑπομ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". might have been construed with the accusative (",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τὴν θλῖψιν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), but the absolute use of it, as here, is common (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 10:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jam 5:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Peter 2:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and its employment in this instance enables the writer to conform the clause grammatically to the others. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τῇ προσευχῇ προσκαρτεροῦντες",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ": ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Colossians 4:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 1:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 2:42",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The strong word suggests not only the constancy with which they are to pray, but the effort that is needed to maintain a habit so much above nature.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Rejoicing in hope",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Better, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "In respect of the hope, rejoicing",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Cp. ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 5:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; where see note. On this holy gladness cp. also ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Peter 1:3-9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "patient",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.] Better, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "in respect of the tribulation, enduring",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—“",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The tribulation:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "” i.e. that which as Christians you are sure to find, in one form or another. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 16:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; also ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 5:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 8:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "continuing",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.] Better, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "in respect of the [duty",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "act, of] prayer, persevering",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Same word as ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Colossians 4:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Thessalonians 5:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Prayer would be either united (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 12:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), or individual (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 6:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); but in any case it would be diligent, painstaking, and real.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 12:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Ἐλπίδι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in hope",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") So far respecting faith and love, now also concerning hope, comp. ch. 5 and 8. Then concerning our duties to others, to the saints, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 12:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to persecutors, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 12:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", to friends, strangers, enemies, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 12:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "χαίροντες",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "rejoicing",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") True joy is not only an emotion of the mind and a benefit [privilege], but also a Christian duty, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Romans 12:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It is the highest complaisance in God. He wishes us to rejoice and to spend our spiritual life joyously.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 12-14.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "In hope rejoicing; in tribulation enduring; in prayer continuing instant; communicating to the necessities of the saints",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Christians); ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "given to",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "pursuing",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "hospitality",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": ". Bless them which persecute you: bless, and curse not",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "cmt_word",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Bless them which persecute you: bless, and curse not",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". In ver. 14 the form of the admonition passes from participles to direct imperatives, a positive command of Christ being adduced. In ver. 15 the gentler admonitory form of in the infinitive is taken up, passing to participles, as before in ver. 16. Romans 12:12",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Continuing instant (προσκαρτεροῦντες)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Compare Acts 1:4; Acts 6:4. Rev., steadfastly for instant, which has lost its original sense of urgent (Latin, instare to press upon). Thus Latimer: \"I preached at the instant request of a curate.\" Compare A.V., Luke 7:4; Acts 26:7. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 1:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 6:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Rev., steadfastly for instant, which has lost its original sense of urgent (Latin, instare to press upon). Thus Latimer: \"I preached at the instant request of a curate.\" Compare A.V., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 7:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 26:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      }
    ]
  }
]