[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(1) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "God of my praise.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—That is, God to whom as covenant God it was a privilege to make ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "tehillah. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 10:20-21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where Jehovah is said to be “the praise” of those who “swear by His name.” Comp. also ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 106:2-3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and Note, and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 33:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Perhaps ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "“",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "God of my glory or boast” would more nearly give the force of the original. The psalmist prays that Jehovah’s silence may not make his confident glorifying in the covenant promises vain.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 109:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 109:1",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Hold not thy peace — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Do not neglect me, but take notice of my extreme danger and misery, and let my sentence come forth from thy presence, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 17:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Delay not to give judgment upon the appeal made to thee. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "O God of my praise — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The author and matter of all my praises: in whom I glory, and not in any wisdom or strength of my own: who hast given me continual occasion to praise thee; whom I have praised, and will praise while I live, and hope to praise to all eternity.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "109:1-5. It is the unspeakable comfort of all believers, that whoever is against them, God is for them; and to him they may apply as to one pleased to concern himself for them. David's enemies laughed at him for his devotion, but they could not laugh him out of it.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Hold not thy peace - That is, Speak for my defense - as if God had looked with unconcern on the wrongs which were done to him. See the notes at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 83:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "O God of my praise - The God whom I praise; whom I worship and adore. It implies that he was accustomed to praise him, and desired still to praise him. He sought that God would interpose now that he might have new occasion for praise. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "O God of my praise - The God whom I praise; whom I worship and adore. It implies that he was accustomed to praise him, and desired still to praise him. He sought that God would interpose now that he might have new occasion for praise. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "PSALM 109",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ps 109:1-31. The writer complains of his virulent enemies, on whom he imprecates God's righteous punishment, and to a prayer for a divine interposition in his behalf appends the expression of his confidence and a promise of his praises. This Psalm is remarkable for the number and severity of its imprecations. Its evident typical character (compare Ps 109:8) justifies the explanation of these already given, that as the language of David respecting his own enemies, or those of Christ, it has respect not to the penitent, but to the impenitent and implacable foes of good men, and of God and His cause, whose inevitable fate is thus indicated by inspired authority.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "1. God of my praise—its object, thus recognizing God as a certain helper. Be not silent (compare Ps 17:13; 28:1).",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "1. God of my praise—its object, thus recognizing God as a certain helper. Be not silent (compare Ps 17:13; 28:1).",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "The Treasury of David",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1 Hold not thy peace, O God of my praise;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "2 For the mouth of the wicked and the mouth of the deceitful are opened against me; they have spoken against me with a lying tongue.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "3 They compassed me about also with words of hatred; and fought against me without a cause.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "4 For my love they are my adversaries; but I give myself unto prayer.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "5 And they have rewarded me evil for good, and hatred for my love.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 109:1",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 109:1",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Hold not thy peace.\" Mine enemies speak, be thou pleased to speak too. Break thy solemn silence, and silence those who slander me. It is the cry of a man whose confidence in God is deep, and whose communion with him is very close and bold. Note, that he only asks the Lord to speak: a word from God is all a believer needs. \"O God of my praise.\" Thou whom my whole soul praises, be pleased to protect my honour and guard my praise. \"My heart is fixed,\" said he in the former Psalm, \"I will sing and give praise,\" and now he appeals to the God whom he had praised. If we take care of God's honour he will take care of ours. We may look to him as the guardian of our character if we truly seek his glory. If we live to God's praise, he will in the long run give us praise among men.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 109:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 109:2",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"For the mouth of the wicked and the mouth of the deceitful are opened against me.\" Wicked men must needs say wicked things, and these we have reason to dread; but in addition they utter false and deceitful things, and these are worst of all. There is no knowing what may come out of mouths which are at once lewd and lying. The misery caused to a good man by slanderous reports no heart can imagine but that which is wounded by them: in all Satan's armoury there are no worse weapons than deceitful tongues. To have a reputation, over which we have watched with daily care, suddenly bespattered with the foulest aspersions, is painful beyond description; but when wicked and deceitful men get their mouths fully opened we can hardly expect to escape any more than others. \"They have spoken against me with a lying tongue.\" Lying tongues cannot lie still. Bad tongues are not content to vilify bad men, but choose the most gracious of saints to be the objects of their attacks. Here is reason enough for prayer. The heart sinks when assailed with slander, for we know not what may be said next, what friend may be alienated, what evil may be threatened, or what misery may be caused to us and others. The air is full of rumours, and shadows impalpable flit around; the mind is confused with dread of unseen foes and invisible arrows. What ill can be worse than to be assailed with slander,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Whose edge is sharper than the sword, whoso tongue",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Outvenoms all the worms of Nile\"?",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 109:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 109:3",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"They compassed me about also with words of hatred.\" Turn which way he would they hedged him in with falsehood, misrepresentation, accusation, and scorn. Whispers, sneers, insinuations, satires, and open charges filled his ear with a perpetual buzz, and all for no reason, but sheer hate. Each word was as full of venom as an egg is full of meat; they could not speak without showing their teeth. \"And fought against me without a cause.\" He had not provoked the quarrel or contributed to it, yet in a thousand ways they laboured to \"corrode his comfort, and destroy his case.\" All this tended to make the suppliant feel the more acutely the wrongs which were done to him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 109:4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 109:4",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...THE ARGUMENT It is sufficiently evident from the body of this Psalm, that it was composed by David when he was in a state of persecution, either by Saul or by Absalom; and that amongst and above all the rest of his enemies he takes very particular notice of, and breaks forth into vehement expressions of anger against one particular person which whether it were Doeg or Ahithophel is not certain, nor at all necessary to know. But as David was, and very well knew himself to be, a type of Christ, and consequently his enemies did typify or represent the enemies of Christ, and this particular adversary of his did represent some singular and eminent enemy of Christ, which though David might not, yet the Spirit of God which indited this Psalm did, know to be Judas, and accordingly directed all these bitter invectives and imprecations against him, who deserved and received far worse punishments for his monstrous wickedness than all which are here mentioned. And that he was the person principally aimed at in this Psalm, will seem very probable to him who considers David’s mild and merciful temper even towards his enemies, which he both professed in words in this very book, as Psalm 35:12,14, and practised in deeds, as 2 Samuel 16:10,11 19:22,23, and withal the severity of these imprecations, reaching not only to the persons of his enemies but to their children, who yet by the law of God were not to suffer for their parents’ sins, Deu 24:16. David, complaining of his false accusers, who requited him evil for good, devoteth them and their children to all misery and oblivion, Psalm 109:1-15, because of their unmercifulness and cruelty, Psalm 109:16-20; showeth his great affliction, prayeth for deliverance, and promiseth thankfulness, Psalm 109:21-31.  Hold not thy peace;  do not neglect me, but take notice of my extreme danger and misery, and deliver me, which thou canst do by the speaking of one word. O God of my praise; the author and matter of all my praises; who hast given me continual occasion to praise thee, whom I have used to praise, and will praise whilst I live; do not therefore now give me occasion to turn my praises into lamentations. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "continued...",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "THE ARGUMENT",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "It is sufficiently evident from the body of this Psalm, that it was composed by David when he was in a state of persecution, either by Saul or by Absalom; and that amongst and above all the rest of his enemies he takes very particular notice of, and breaks forth into vehement expressions of anger against one particular person which whether it were Doeg or Ahithophel is not certain, nor at all necessary to know. But as David was, and very well knew himself to be, a type of Christ, and consequently his enemies did typify or represent the enemies of Christ, and this particular adversary of his did represent some singular and eminent enemy of Christ, which though David might not, yet the Spirit of God which indited this Psalm did, know to be Judas, and accordingly directed all these bitter invectives and imprecations against him, who deserved and received far worse punishments for his monstrous wickedness than all which are here mentioned. And that he was the person principally aimed at in this Psalm, will seem very probable to him who considers David’s mild and merciful temper even towards his enemies, which he both professed in words in this very book, as ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 35:12,14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and practised in deeds, as ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "2 Samuel 16:10,11 19:22,23",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and withal the severity of these imprecations, reaching not only to the persons of his enemies but to their children, who yet by the law of God were not to suffer for their parents’ sins, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Deu 24:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "David, complaining of his false accusers, who requited him evil for good, devoteth them and their children to all misery and oblivion, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 109:1-15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", because of their unmercifulness and cruelty, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 109:16-20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; showeth his great affliction, prayeth for deliverance, and promiseth thankfulness, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 109:21-31",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Hold not thy peace; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " do not neglect me, but take notice of my extreme danger and misery, and deliver me, which thou canst do by the speaking of one word. ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "O God of my praise",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; the author and matter of all my praises; who hast given me continual occasion to praise thee, whom I have used to praise, and will praise whilst I live; do not therefore now give me occasion to turn my praises into lamentations. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Hold not thy peace,.... Or be not as a deaf or dumb man, or like one that turns a deaf ear and will give no answer; so the Lord seems to his people when he does not give an immediate answer to their prayers, and does not arise to help them; he seems to have forsaken them, and to stand at a distance from them; nor does he avenge them of their enemies; it is the Messiah, as man, that puts up this petition, and it agrees with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 22:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "O God of my praise; worthy of all praise, because of the perfections of his nature, and for the mercies he bestows; and is and ought to be the constant object of the praise of his people, and was the object of the praise of Christ; see Psalm 22:22, who praised him for his wonderful formation as man, having such a holy human nature, so suitable to his divine Person, and so fit for the service of his people; for his preservation from his enemies, and the deliverance of him from death and the grave, by his resurrection; for hearing his petitions, and for the special grace bestowed on his people; see Psalm 139:14. Or, \"O God of my glorying (w)\"; in whom he gloried, of whom he boasted; as he often with exultation spoke of him as his God and Father: or, \"the God that praises me\"; for his praise was not of men, but of God, who by a voice from heaven declared him his beloved Son, in whom he was well pleased, Matthew 3:17. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "O God of my praise; worthy of all praise, because of the perfections of his nature, and for the mercies he bestows; and is and ought to be the constant object of the praise of his people, and was the object of the praise of Christ; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 22:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", who praised him for his wonderful formation as man, having such a holy human nature, so suitable to his divine Person, and so fit for the service of his people; for his preservation from his enemies, and the deliverance of him from death and the grave, by his resurrection; for hearing his petitions, and for the special grace bestowed on his people; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 139:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Or, \"O God of my glorying (w)\"; in whom he gloried, of whom he boasted; as he often with exultation spoke of him as his God and Father: or, \"the God that praises me\"; for his praise was not of men, but of God, who by a voice from heaven declared him his beloved Son, in whom he was well pleased, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 3:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(w) \"gloriationis meae\", Cocceius; \"de quo glorior\", so some in Vatablus. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(w) \"gloriationis meae\", Cocceius; \"de quo glorior\", so some in Vatablus. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "<> Hold not thy peace, O God of my {a} praise;",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "<",
            "children": []
          },
          {
            "element": "to",
            "class": "",
            "text": "> Hold not thy peace, O God of my {a} praise;",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) Though all the world condemn me, yet you will approve my innocence and that is sufficient praise to me.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Hold not thy peace",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Or, Be not silent, but answer my prayer by pronouncing and executing judgement upon my persecutors. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 35:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 39:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 50:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 83:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". God’s silence is contrasted with the noisy clamour of his foes.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "O God of my praise",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "[65]] Thou, Who art the object of my praise, Whom I have had cause to praise in times past, leave me not without cause to praise thee now. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Psalm 109:30",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 109:30",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 22:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and particularly Jeremiah’s prayer (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 17:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") “Heal me, O Lord, and I shall be healed; save me and I shall be saved; for thou art my praise,” based on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 10:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[65] In most editions of the Prayer Book the Latin heading is wrongly given as ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Deus laudum",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which appears to have been introduced as a rendering of this phrase, the proper heading ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Deus laudem",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [meam ne tacueris]; ‘O God, pass not over my praise in silence’, seeming to be unintelligible.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "1–5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Psalmist appeals to God to interpose and defend him from his persecutors, whose hostility is not only causeless, but aggravated by gross ingratitude.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 1-5.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - The initial prayer and complaint. The prayer occupies one verse only (ver. 1); the complaint four verses (vers. 2-5). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 1.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Hold not thy peace, O God of my praise",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 28:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 35:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 39:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). If God makes no sign when men arc grievously persecuted, he seems to be indifferent to their sufferings. Surely he will not thus treat one who praises him continually (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 22:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 71:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Psalm 109:1",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "A sign for help and complaints of ungrateful persecutors form the beginning of the Psalm. \"God of my praise\" is equivalent to God, who art my praise, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 17:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 10:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The God whom the Psalmist has hitherto had reason to praise will also now show Himself to him as worthy to be praised. Upon this faith he bases the prayer: be not silent (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 28:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 35:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")! A mouth such as belongs to the \"wicked,\" a mouth out of which comes \"deceit,\" have they opened against him; they have spoken with him a tongue (accusative, vid., on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 64:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), i.e., a language, of falsehood. דּברי of things and utterances as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 35:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It would be capricious to take the suffix of אהבתי in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 109:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as genit. object. (love which they owe me), and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 109:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as genit. subject.; from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 38:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it may be seen that the love which he has shown to them is also meant in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 109:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The assertion that he is \"prayer\" is intended to say that he, repudiating all revenges of himself, takes refuge in God in prayer and commits his cause into His hands. They have loaded him with evil for good, and hatred for the love he has shown to them. Twice he lays emphasis on the fact that it is love which they have requited to him with its opposite. Perfects alternate with aorists: it is no enmity of yesterday; the imprecations that follow presuppose an inflexible obduracy on the side of the enemies. ",
        "children": []
      }
    ]
  }
]