[{"header":"Avoid people like this"},{"num":3,"verse":"Understand that the last days will be dangerous times."},{"num":2,"verse":"People will be selfish and love money. They will be the kind of people who brag and who are proud. They will slander others, and they will be disobedient to their parents. They will be ungrateful, unholy,"},{"num":3,"verse":"unloving, contrary, and critical. They will be without self-control and brutal, and they won’t love what is good."},{"num":4,"verse":"They will be people who are disloyal, reckless, and conceited. They will love pleasure instead of loving God."},{"num":5,"verse":"They will look like they are religious but deny God’s power. Avoid people like this."},{"num":6,"verse":"Some will slither into households and control immature women who are burdened with sins and driven by all kinds of desires."},{"num":7,"verse":"These women are always learning, but they can never arrive at an understanding of the truth."},{"num":8,"verse":"These people oppose the truth in the same way that Jannes and Jambres opposed Moses. Their minds are corrupt and their faith is counterfeit."},{"num":9,"verse":"But they won’t get very far. Their foolishness will become obvious to everyone like those others."},{"header":"Take Paul as your model"},{"num":10,"verse":"But you have paid attention to my teaching, conduct, purpose, faithfulness, patience, love, and endurance."},{"num":11,"verse":"You have seen me experience physical abuse and ordeals in places such as Antioch, Iconium, and Lystra. I put up with all sorts of abuse, and the Lord rescued me from it all!"},{"num":12,"verse":"In fact, anyone who wants to live a holy life in Christ Jesus will be harassed."},{"num":13,"verse":"But evil people and swindlers will grow even worse, as they deceive others while being deceived themselves."},{"num":14,"verse":"But you must continue with the things you have learned and found convincing. You know who taught you."},{"num":15,"verse":"Since childhood you have known the holy scriptures that help you to be wise in a way that leads to salvation through faith that is in Christ Jesus."},{"num":16,"verse":"Every scripture is inspired by God and is useful for teaching, for showing mistakes, for correcting, and for training character,"},{"num":17,"verse":"so that the person who belongs to God can be equipped to do everything that is good."}]