[{"num":1,"verse":"the king sent a message, and all of Judah’s and Jerusalem’s elders gathered before him."},{"num":2,"verse":"Then the king went up to the Lord’s temple, together with all the people of Judah and all the citizens of Jerusalem, the priests and the prophets, and all the people, young and old alike. There the king read out loud all the words of the covenant scroll that had been found in the Lord’s temple."},{"num":3,"verse":"The king stood beside the pillar and made a covenant with the Lord that he would follow the Lord by keeping his commandments, his laws, and his regulations with all his heart and all his being in order to fulfill the words of this covenant that were written in this scroll. All of the people accepted the covenant."},{"num":4,"verse":"The king then commanded the high priest Hilkiah, the second-order priests, and the doorkeepers to remove from the Lord’s temple all the religious objects made for Baal, Asherah, and all the heavenly bodies. The king burned them outside Jerusalem in the Kidron fields and took the ashes to Bethel."},{"num":5,"verse":"He got rid of the pagan priests that the Judean kings had appointed to burn incense at the shrines in Judah’s cities and the areas around Jerusalem. He did the same to those who burned incense to Baal, to the sun, to the moon, to the constellations, and to all the heavenly bodies."},{"num":6,"verse":"He removed the Asherah image from the Lord’s temple, taking it to the Kidron Valley outside Jerusalem. There he burned it, ground it to dust, and threw the dust on the public graveyard."},{"num":7,"verse":"The king tore down the shrines for the consecrated workers that were in the Lord’s temple, where women made woven coverings for Asherah."},{"num":8,"verse":"Then Josiah brought all the priests out of Judah’s cities. From Geba to Beer-sheba, he defiled the shrines where the priests had been burning incense. He also tore down the shrines at the gates at the entrance to the gate of Joshua the city’s governor, which were on the left as one entered the city gate."},{"num":9,"verse":"Although the priests of these shrines didn’t go up on the Lord’s altar in Jerusalem, they did eat unleavened bread with their fellow priests."},{"num":10,"verse":"Josiah defiled the Topheth in the Ben-hinnom Valley so no one could burn their child alive in honor of the god Molech."},{"num":11,"verse":"He did away with the horses that Judah’s kings had dedicated to the sun. They were kept at the entrance to the Lord’s temple near a room in the annex that belonged to an official named Nathan-melech. Josiah set fire to the chariots that were dedicated to the sun."},{"num":12,"verse":"The king also tore down the altars that were on the roof of Ahaz’s upper story, which had been made by the Judean kings, and he did the same with the altars that Manasseh had built in the two courtyards of the Lord’s temple. He broke them up there and threw their dust into the Kidron Valley."},{"num":13,"verse":"The king then defiled the shrines facing Jerusalem, south of the Mountain of Destruction. Solomon the king of Israel had built these for Ashtoreth, the monstrous Sidonian god, for Chemosh, the monstrous Moabite god, and for Milcom, the detestable Ammonite god."},{"num":14,"verse":"He smashed the sacred pillars and cut down the sacred poles, filling the places where they had been with human bones."},{"num":15,"verse":"Josiah also tore down the altar that was in Bethel. That was the shrine made by Jeroboam, Nebat’s son, who caused Israel to sin. Josiah tore down that altar and its shrine. He burned the shrine, grinding it into dust. Then he burned its sacred pole."},{"num":16,"verse":"When Josiah turned around, he noticed tombs up on the hillside. So he ordered the bones to be taken out of the tombs. He then burned them on the altar, desecrating it. (This was in agreement with the word that the Lord announced by the man of God when Jeroboam stood by the altar at the festival.) Josiah then turned and saw the tomb of the man of God who had predicted these things."},{"num":17,"verse":"“What’s this gravestone I see?” Josiah asked."},{"num":18,"verse":"“Let it be,” Josiah said. “No one should disturb his bones.” So they left his bones untouched, along with the bones of the prophet who came from Samaria."},{"num":19,"verse":"Moreover, Josiah removed all the shrines on the high hills that the Israelite kings had constructed throughout the cities of Samaria. These had made the Lord angry. Josiah did to them just what he did at Bethel."},{"num":20,"verse":"He actually slaughtered on those altars all the priests of the shrines who were there, and he burned human bones on them. Then Josiah returned to Jerusalem."},{"num":21,"verse":"The king commanded all the people, “Celebrate a Passover to the Lord your God following what is instructed in this scroll containing the covenant.”"},{"num":22,"verse":"A Passover like this hadn’t been celebrated since the days when the judges judged Israel; neither had it been celebrated during all the days of the Israelite and Judean kings."},{"num":23,"verse":"But in the eighteenth year of King Josiah’s rule, this Passover was celebrated to the Lord in Jerusalem."},{"num":24,"verse":"Josiah burned those who consulted dead spirits and the mediums, the household gods and the worthless idols—all the monstrous things that were seen in the land of Judah and in Jerusalem. In this way Josiah fulfilled the words of the Instruction written in the scroll that the priest Hilkiah found in the Lord’s temple."},{"num":25,"verse":"There’s never been a king like Josiah, whether before or after him, who turned to the Lord with all his heart, all his being, and all his strength, in agreement with everything in the Instruction from Moses."},{"num":26,"verse":"Even so, the Lord didn’t turn away from the great rage that burned against Judah on account of all that Manasseh had done to make him angry."},{"num":27,"verse":"The Lord said, “I will remove Judah from my presence just as I removed Israel. I will reject this city, Jerusalem, which I chose, and this temple where I promised my name would reside.”"},{"num":28,"verse":"The rest of Josiah’s deeds and all that he accomplished, aren’t they written in the official records of Judah’s kings?"},{"num":29,"verse":"In his days, the Egyptian king Pharaoh Neco marched against the Assyrian king at the Euphrates River. King Josiah marched out to intercept him. But when Neco encountered Josiah in Megiddo, he killed the king."},{"num":30,"verse":"Josiah’s servants took his body from Megiddo in a chariot. They brought him to Jerusalem and buried him in his own tomb. The people of the land took Jehoahaz, Josiah’s son, anointed him, and made him king after his father."},{"header":"Jehoahaz rules Judah"},{"num":31,"verse":"Jehoahaz was 23 years old when he became king, and he ruled for three months in Jerusalem. His mother’s name was Hamutal; she was Jeremiah’s daughter and was from Libnah."},{"num":32,"verse":"He did what was evil in the Lord’s eyes, just as all his ancestors had done."},{"num":33,"verse":"Pharaoh Neco made Jehoahaz a prisoner at Riblah in the land of Hamath, ending his rule in Jerusalem. Pharaoh Neco imposed a fine on the land totaling one hundred kikkars of silver and one kikkar of gold."},{"header":"Jehoiakim rules Judah"},{"num":34,"verse":"Pharaoh Neco made Eliakim, Josiah’s son, king after his father Josiah. Neco changed Eliakim’s name to Jehoiakim. Neco took Jehoahaz away; he later died in Egypt."},{"num":35,"verse":"Jehoiakim gave Pharaoh the silver and gold, but he taxed the land in order to meet Pharaoh’s financial demands. Each person was taxed appropriately. Jehoiakim exacted silver and the gold from the land’s people in order to give it to Pharaoh Neco."},{"num":36,"verse":"Jehoiakim was 25 years old when he became king, and he ruled for eleven years in Jerusalem. His mother’s name was Zebidah; she was Pedaiah’s daughter and was from Rumah."},{"num":37,"verse":"He did what was evil in the Lord’s eyes, just as all his ancestors had done."}]