[{"header":"King Josiah’s Religious Reforms(A)"},{"num":23,"verse":"Then the king sent for all the respected leaders of Judah and Jerusalem to join him. "},{"num":2,"verse":"The king, everyone in Judah, everyone living in Jerusalem, the priests, the prophets, and all the people (young and old) went to Yahweh’s temple. Josiah read everything written in the Book of the Promise found in Yahweh’s temple so that they could hear it. "},{"num":3,"verse":"The king stood beside the pillar and made a promise to Yahweh that he would follow Yahweh and obey his commands, instructions, and laws with all his heart and soul. He confirmed the terms of the promise written in this book. And all the people joined in the promise."},{"num":4,"verse":"Then the king ordered the chief priest Hilkiah, the priests who served under Hilkiah, and the doorkeepers to take out of Yahweh’s temple all the utensils that had been made for Baal, Asherah, and the entire army of heaven. Josiah burned the utensils outside Jerusalem in an open field near the Kidron Brook. Then he carried their ashes to Bethel."},{"num":5,"verse":"He got rid of the pagan priests whom the kings of Judah had appointed to sacrifice at the illegal places of worship in the cities of Judah and all around Jerusalem. They had been sacrificing to Baal, the sun god, the moon god, the zodiac, and the entire army of heaven. "},{"num":6,"verse":"He took the pole dedicated to the goddess Asherah from the temple to the Kidron Valley outside Jerusalem. He burned it in the Kidron Valley, ground it to dust, and threw its ashes on the tombs of the common people. "},{"num":7,"verse":"He tore down the houses of the male temple prostitutes who were in Yahweh’s temple, where women did weaving for Asherah."},{"num":8,"verse":"He brought all the priests out of the cities of Judah from Geba to Beersheba and made the places where those priests sacrificed unclean. He tore down the worship site at the entrance of the Gate of Joshua, the gate named after the mayor of the city. (The worship site was to the left of anyone going through the city gate.)"},{"num":9,"verse":"The priests of the illegal worship sites had never gone to Yahweh’s altar in Jerusalem. Instead, they ate their unleavened bread among the other worshipers."},{"num":10,"verse":"Josiah also made Topheth in the valley of Ben Hinnom unclean so that people would never again sacrifice their sons or daughters by burning them to the god Molech."},{"num":11,"verse":"He removed the horses that Judah’s kings had dedicated to the sun god at the entrance of Yahweh’s temple. They were in the temple courtyard near the room of the eunuch Nathan Melech. He also burned the chariots of the sun god, "},{"num":12,"verse":"the altars that Judah’s kings had made and placed on the roof of Ahaz’s upstairs room, and the altars Manasseh had made in the two courtyards of Yahweh’s temple. The king tore them down from there, crushed them, and dumped their rubble in the Kidron Valley."},{"num":13,"verse":"The king made the illegal places of worship east of Jerusalem unclean. They were on the southern part of the Hill of Destruction. King Solomon of Israel had built them for Astarte (the disgusting goddess of the Sidonians), Chemosh (the disgusting god of Moab), and Milcom (the disgusting god of the Ammonites). "},{"num":14,"verse":"Josiah crushed the sacred stones, cut down the poles dedicated to Asherah, and filled their places with human bones. "},{"num":15,"verse":"He also tore down the altar at Bethel—the place of worship made by Jeroboam (Nebat’s son), who had made Israel sin. He tore down both the altar and the place of worship. They burned the worship site, crushing it to powder and burning the pole dedicated to Asherah."},{"num":16,"verse":"When Josiah turned and saw the tombs on the hill there, he sent men to take the bones out of the tombs and burn them on the altar to make it unclean. This fulfilled the word of Yahweh announced by the man of Elohim. "},{"num":17,"verse":"Then he asked, “What is this monument that I see?”"},{"num":18,"verse":"So Josiah said, “Let him rest. Don’t disturb his bones.” So they left his bones with the bones of the prophet who had come from Samaria."},{"num":19,"verse":"Josiah also got rid of all the temples at the illegal places of worship in the cities of Samaria. The kings of Israel had built these places to make Yahweh furious. He did to them everything that he had done to the worship places at Bethel. "},{"num":20,"verse":"He slaughtered all the priests of the illegal worship sites on their altars and then burned human bones on them. He went back to Jerusalem."},{"num":21,"verse":"The king ordered all the people to celebrate the Passover for Yahweh their Elohim as it is written in this Book of the Promise. "},{"num":22,"verse":"The Passover had never been celebrated like this during the time of the judges who governed Israel or during the entire time of the kings of Israel and Judah. "},{"num":23,"verse":"But in the eighteenth year of King Josiah’s reign, this Passover was celebrated in Jerusalem for Yahweh."},{"num":24,"verse":"Josiah also got rid of the mediums, psychics, family idols, other idols, and disgusting gods that could be seen in the land of Judah and in Jerusalem. He did this to confirm the words of the Teachings written in the book that the priest Hilkiah found in Yahweh’s temple."},{"num":25,"verse":"No king before Josiah had turned to Yahweh with all his heart, soul, and strength, as directed in Moses’ Teachings. No other king was like Josiah."},{"num":26,"verse":"But Yahweh still didn’t turn his hot, burning anger from Judah. After all, Manasseh had done all these things to make him furious. "},{"num":27,"verse":"Yahweh had said, “I will put Judah out of my sight as I put Israel out of my sight. I will reject Jerusalem, the city that I chose, and I will reject the temple where I said my name would be.”"},{"num":28,"verse":"Isn’t everything else about Josiah—everything he did—written in the official records of the kings of Judah?"},{"num":29,"verse":"In Josiah’s days Pharaoh Necoh (the king of Egypt) came to help the king of Assyria at the Euphrates River. King Josiah went to attack Necoh. When Pharaoh saw him at Megiddo, Pharaoh killed him. "},{"num":30,"verse":"His officers put his dead body in a chariot and brought it from Megiddo to Jerusalem. They buried Josiah in his tomb."},{"header":"King Jehoahaz of Judah(B)"},{"num":31,"verse":"Jehoahaz was 23 years old when he became king, and he was king for 3 months in Jerusalem. His mother was Hamutal, daughter of Jeremiah from Libnah. "},{"num":32,"verse":"He did what Yahweh considered evil, as his ancestors had done. "},{"num":33,"verse":"Pharaoh Necoh made him a prisoner at Riblah in the territory of Hamath during his reign in Jerusalem and fined the country 7,500 pounds of silver and 75 pounds of gold."},{"num":34,"verse":"Then Pharaoh Necoh made Josiah’s son Eliakim king in place of his father Josiah and changed Eliakim’s name to Jehoiakim. He took Jehoahaz away to Egypt, where he died. "},{"num":35,"verse":"Jehoiakim gave Pharaoh the silver and the gold. But he had to tax the country to pay the silver Pharaoh had demanded. He taxed each person according to his wealth so that he could get the silver and gold from the people of the land and give it to Pharaoh Necoh."},{"header":"King Jehoiakim of Judah(C)"},{"num":36,"verse":"Jehoiakim was 25 years old when he began to rule, and he was king for 11 years in Jerusalem. His mother was Zebidah, daughter of Pedaiah from Rumah. "},{"num":37,"verse":"Jehoiakim did what Yahweh considered evil, as his ancestors had done."}]