[{"header":"Moses’ birth"},{"num":2,"verse":"Now a man from Levi’s household married a Levite woman."},{"num":2,"verse":"The woman became pregnant and gave birth to a son. She saw that the baby was healthy and beautiful, so she hid him for three months."},{"num":3,"verse":"When she couldn’t hide him any longer, she took a reed basket and sealed it up with black tar. She put the child in the basket and set the basket among the reeds at the riverbank."},{"num":4,"verse":"The baby’s older sister stood watch nearby to see what would happen to him."},{"num":5,"verse":"Pharaoh’s daughter came down to bathe in the river, while her women servants walked along beside the river. She saw the basket among the reeds, and she sent one of her servants to bring it to her."},{"num":6,"verse":"When she opened it, she saw the child. The boy was crying, and she felt sorry for him. She said, “This must be one of the Hebrews’ children.”"},{"num":7,"verse":"Then the baby’s sister said to Pharaoh’s daughter, “Would you like me to go and find one of the Hebrew women to nurse the child for you?”"},{"num":8,"verse":"Pharaoh’s daughter agreed, “Yes, do that.” So the girl went and called the child’s mother."},{"num":9,"verse":"Pharaoh’s daughter said to her, “Take this child and nurse it for me, and I’ll pay you for your work.” So the woman took the child and nursed it."},{"num":10,"verse":"After the child had grown up, she brought him back to Pharaoh’s daughter, who adopted him as her son. She named him Moses, “because,” she said, “I pulled him out of the water.”"},{"header":"Moses runs away to Midian"},{"num":11,"verse":"One day after Moses had become an adult, he went out among his people and he saw their forced labor. He saw an Egyptian beating a Hebrew, one of his own people."},{"num":12,"verse":"He looked around to make sure no one else was there. Then he killed the Egyptian and hid him in the sand."},{"num":13,"verse":"When Moses went out the next day, he saw two Hebrew men fighting with each other. Moses said to the one who had started the fight, “Why are you abusing your fellow Hebrew?”"},{"num":14,"verse":"He replied, “Who made you a boss or judge over us? Are you planning to kill me like you killed the Egyptian?”"},{"num":15,"verse":"When Pharaoh heard about it, he tried to kill Moses."},{"num":16,"verse":"Now there was a Midianite priest who had seven daughters. The daughters came to draw water and fill the troughs so that their father’s flock could drink."},{"num":17,"verse":"But some shepherds came along and rudely chased them away. Moses got up, rescued the women, and gave their flock water to drink."},{"num":18,"verse":"When they went back home to their father Reuel, he asked, “How were you able to come back home so soon today?”"},{"num":19,"verse":"They replied, “An Egyptian man rescued us from a bunch of shepherds. Afterward, he even helped us draw water to let the flock drink.”"},{"num":20,"verse":"Reuel said to his daughters, “So where is he? Why did you leave this man? Invite him to eat a meal with us.”"},{"num":21,"verse":"Moses agreed to come and live with the man, who gave his daughter Zipporah to Moses as his wife."},{"num":22,"verse":"She gave birth to a son, and Moses named him Gershom, “because,” he said, “I’ve been an immigrant living in a foreign land.”"},{"num":23,"verse":"A long time passed, and the Egyptian king died. The Israelites were still groaning because of their hard work. They cried out, and their cry to be rescued from the hard work rose up to God."},{"num":24,"verse":"God heard their cry of grief, and God remembered his covenant with Abraham, Isaac, and Jacob."},{"num":25,"verse":"God looked at the Israelites, and God understood."}]