[{"num":2,"verse":"A man from the family of Levi took a woman also descended from Levi as his wife. "},{"num":2,"verse":"When she conceived and had a son, upon seeing what a fine child he was, she hid him for three months. "},{"num":3,"verse":"When she could no longer hide him, she took a papyrus basket, coated it with clay and tar, put the child in it and placed it among the reeds on the riverbank. "},{"num":4,"verse":"His sister stood at a distance to see what would happen to him."},{"num":5,"verse":"The daughter of Pharaoh came down to bathe in the river while her maids-in-attendance walked along the riverside. Spotting the basket among the reeds, she sent her slave-girl to get it. "},{"num":6,"verse":"She opened it and looked inside, and there in front of her was a crying baby boy! Moved with pity, she said, “This must be one of the Hebrews’ children.” "},{"num":7,"verse":"At this point, his sister said to Pharaoh’s daughter, “Would you like me to go and find you one of the Hebrew women to nurse the baby for you?” "},{"num":8,"verse":"Pharaoh’s daughter answered, “Yes, go.” So the girl went and called the baby’s own mother. "},{"num":9,"verse":"Pharaoh’s daughter told her, “Take this child away, and nurse it for me, and I will pay you for doing it.” So the woman took the child and nursed it. "},{"num":10,"verse":"Then, when the child had grown some, she brought him to Pharaoh’s daughter; and she began to raise him as her son. She called him Moshe [pull out], explaining, “Because I pulled him out of the water.”"},{"num":11,"verse":"(iii) One day, when Moshe was a grown man, he went out to visit his kinsmen; and he watched them struggling at forced labor. He saw an Egyptian strike a Hebrew, one of his kinsmen. "},{"num":12,"verse":"He looked this way and that; and when he saw that no one was around, he killed the Egyptian and hid his body in the sand. "},{"num":13,"verse":"The next day, he went out and saw two Hebrew men fighting with each other. To the one in the wrong he said, “Why are you hitting your companion?” "},{"num":14,"verse":"He retorted, “Who appointed you ruler and judge over us? Do you intend to kill me the way you killed the Egyptian?” Moshe became frightened. “Clearly,” he thought, “the matter has become known.” "},{"num":15,"verse":"When Pharaoh heard of it, he tried to have Moshe put to death. But Moshe fled from Pharaoh to live in the land of Midyan."},{"num":16,"verse":"the seven daughters of the priest of Midyan came to draw water. They had filled the troughs to water their father’s sheep, "},{"num":17,"verse":"when the shepherds came and tried to drive them away. But Moshe got up and defended them; then he watered their sheep. "},{"num":18,"verse":"When they came to Re‘u’el their father, he said, “How come you’re back so soon today?” "},{"num":19,"verse":"They answered, “An Egyptian rescued us from the shepherds; more than that, he drew water for us and watered the sheep.” "},{"num":20,"verse":"He asked his daughters, “Where is he? Why did you leave the man there? Invite him to have something to eat.”"},{"num":21,"verse":"Moshe was glad to stay on with the man, and he gave Moshe his daughter Tzipporah in marriage. "},{"num":22,"verse":"She gave birth to a son, and he named him Gershom [foreigner there], for he said, “I have been a foreigner in a foreign land.”"},{"num":23,"verse":"Sometime during those many years the king of Egypt died, but the people of Isra’el still groaned under the yoke of slavery, and they cried out, and their cry for rescue from slavery came up to God. "},{"num":24,"verse":"God heard their groaning, and God remembered his covenant with Avraham, Yitz’chak and Ya‘akov. "},{"num":25,"verse":"God saw the people of Isra’el, and God acknowledged them."}]