[[],[],[{"type":"header","content":"Moses"},{"type":"prose","content":"A man from the family of Levi married a Levite woman. The woman became pregnant and had a son. She saw there was something special about him and hid him. She hid him for three months. When she couldn’t hide him any longer she got a little basket-boat made of papyrus, waterproofed it with tar and pitch, and placed the child in it. Then she set it afloat in the reeds at the edge of the Nile."}],[{"type":"prose","content":"The baby’s older sister found herself a vantage point a little way off and watched to see what would happen to him. Pharaoh’s daughter came down to the Nile to bathe; her maidens strolled on the bank. She saw the basket-boat floating in the reeds and sent her maid to get it. She opened it and saw the child—a baby crying! Her heart went out to him. She said, “This must be one of the Hebrew babies.”"}],[{"type":"prose","content":"Then his sister was before her: “Do you want me to go and get a nursing mother from the Hebrews so she can nurse the baby for you?”"}],[{"type":"prose","content":"Pharaoh’s daughter said, “Yes. Go.” The girl went and called the child’s mother."}],[{"type":"prose","content":"Pharaoh’s daughter told her, “Take this baby and nurse him for me. I’ll pay you.” The woman took the child and nursed him."}],[{"type":"prose","content":"After the child was weaned, she presented him to Pharaoh’s daughter who adopted him as her son. She named him Moses (Pulled-Out), saying, “I pulled him out of the water.”"}],[{"type":"prose","content":"Time passed. Moses grew up. One day he went and saw his brothers, saw all that hard labor. Then he saw an Egyptian hit a Hebrew—one of his relatives! He looked this way and then that; when he realized there was no one in sight, he killed the Egyptian and buried him in the sand."}],[{"type":"prose","content":"The next day he went out there again. Two Hebrew men were fighting. He spoke to the man who started it: “Why are you hitting your neighbor?”"}],[{"type":"prose","content":"The man shot back: “Who do you think you are, telling us what to do? Are you going to kill me the way you killed that Egyptian?”Then Moses panicked: “Word’s gotten out—people know about this.”* * *"}],[{"type":"prose","content":"Pharaoh heard about it and tried to kill Moses, but Moses got away to the land of Midian. He sat down by a well."}],[{"type":"prose","content":"The priest of Midian had seven daughters. They came and drew water, filling the troughs and watering their father’s sheep. When some shepherds came and chased the girls off, Moses came to their rescue and helped them water their sheep."}],[{"type":"prose","content":"When they got home to their father, Reuel, he said, “That didn’t take long. Why are you back so soon?”"}],[{"type":"prose","content":"“An Egyptian,” they said, “rescued us from a bunch of shepherds. Why, he even drew water for us and watered the sheep.”"}],[{"type":"prose","content":"He said, “So where is he? Why did you leave him behind? Invite him so he can have something to eat with us.”"}],[{"type":"prose","content":"Moses agreed to settle down there with the man, who then gave his daughter Zipporah (Bird) to him for his wife. She had a son, and Moses named him Gershom (Sojourner), saying, “I’m a sojourner in a foreign country.”* * *"}],[{"type":"prose","content":"Many years later the king of Egypt died. The Israelites groaned under their slavery and cried out. Their cries for relief from their hard labor ascended to God:"}],[{"type":"prose","content":"God listened to their groanings.God remembered his covenant with Abraham, with Isaac, and with Jacob."}],[{"type":"prose","content":"God saw what was going on with Israel.God understood.* * *"}]]