[{"header":"The Birth of Moses"},{"num":2,"verse":"About this time, a man and woman from the tribe of Levi got married."},{"num":2,"verse":"The woman became pregnant and gave birth to a son. She saw that he was a special baby and kept him hidden for three months."},{"num":3,"verse":"But when she could no longer hide him, she got a basket made of papyrus reeds and waterproofed it with tar and pitch. She put the baby in the basket and laid it among the reeds along the bank of the Nile River."},{"num":4,"verse":"The baby’s sister then stood at a distance, watching to see what would happen to him."},{"num":5,"verse":"Soon Pharaoh’s daughter came down to bathe in the river, and her attendants walked along the riverbank. When the princess saw the basket among the reeds, she sent her maid to get it for her."},{"num":6,"verse":"When the princess opened it, she saw the baby. The little boy was crying, and she felt sorry for him. “This must be one of the Hebrew children,” she said."},{"num":7,"verse":"Then the baby’s sister approached the princess. “Should I go and find one of the Hebrew women to nurse the baby for you?” she asked."},{"num":8,"verse":"“Yes, do!” the princess replied. So the girl went and called the baby’s mother."},{"num":9,"verse":"“Take this baby and nurse him for me,” the princess told the baby’s mother. “I will pay you for your help.” So the woman took her baby home and nursed him."},{"num":10,"verse":"Later, when the boy was older, his mother brought him back to Pharaoh’s daughter, who adopted him as her own son. The princess named him Moses, for she explained, “I lifted him out of the water.”"},{"header":"Moses Escapes to Midian"},{"num":11,"verse":"Many years later, when Moses had grown up, he went out to visit his own people, the Hebrews, and he saw how hard they were forced to work. During his visit, he saw an Egyptian beating one of his fellow Hebrews."},{"num":12,"verse":"After looking in all directions to make sure no one was watching, Moses killed the Egyptian and hid the body in the sand."},{"num":13,"verse":"The next day, when Moses went out to visit his people again, he saw two Hebrew men fighting. “Why are you beating up your friend?” Moses said to the one who had started the fight."},{"num":14,"verse":"The man replied, “Who appointed you to be our prince and judge? Are you going to kill me as you killed that Egyptian yesterday?”"},{"num":15,"verse":"And sure enough, Pharaoh heard what had happened, and he tried to kill Moses. But Moses fled from Pharaoh and went to live in the land of Midian."},{"num":16,"verse":"Now the priest of Midian had seven daughters who came as usual to draw water and fill the water troughs for their father’s flocks."},{"num":17,"verse":"But some other shepherds came and chased them away. So Moses jumped up and rescued the girls from the shepherds. Then he drew water for their flocks."},{"num":18,"verse":"When the girls returned to Reuel, their father, he asked, “Why are you back so soon today?”"},{"num":19,"verse":"“An Egyptian rescued us from the shepherds,” they answered. “And then he drew water for us and watered our flocks.”"},{"num":20,"verse":"“Then where is he?” their father asked. “Why did you leave him there? Invite him to come and eat with us.”"},{"num":21,"verse":"Moses accepted the invitation, and he settled there with him. In time, Reuel gave Moses his daughter Zipporah to be his wife."},{"num":22,"verse":"Later she gave birth to a son, and Moses named him Gershom, for he explained, “I have been a foreigner in a foreign land.”"},{"num":23,"verse":"Years passed, and the king of Egypt died. But the Israelites continued to groan under their burden of slavery. They cried out for help, and their cry rose up to God."},{"num":24,"verse":"God heard their groaning, and he remembered his covenant promise to Abraham, Isaac, and Jacob."},{"num":25,"verse":"He looked down on the people of Israel and knew it was time to act."}]