[{"header":"The Letter to the Church in Ephesus"},{"num":2,"verse":"“To the messenger of the church in Ephesus, write:"},{"num":2,"verse":"‘I know what you’ve been doing, your toil, and your endurance. I also know that you cannot tolerate evil people. You have tested those who call themselves apostles, but are not, and have found them to be false. "},{"num":3,"verse":"You have endured and suffered because of my name, yet you have not grown weary. "},{"num":4,"verse":"However, I have this against you: You have abandoned the love you had at first. "},{"num":5,"verse":"Therefore, remember how far you have fallen. Repent and go back to what you were doing at first. If you don’t, I will come to you and remove your lamp stand from its place—unless you repent. "},{"num":6,"verse":"But this is to your credit: You hate the actions of the Nicolaitans, which I also hate."},{"num":7,"verse":"‘Let everyone listen to what the Spirit says to the churches. I will give the privilege of eating from the tree of life that is in God’s paradise to everyone who overcomes.’”"},{"header":"The Letter to the Church in Smyrna"},{"num":8,"verse":"“To the messenger of the church in Smyrna, write:"},{"num":9,"verse":"‘I know your suffering and your poverty—though you are rich—and the slander committed by those who claim to be Jews but are not. They are the synagogue of Satan. "},{"num":10,"verse":"Don’t be afraid of what you are going to suffer. Look! The Devil is going to throw some of you into prison so that you may be tested. For ten days you will undergo suffering. Be faithful until death, and I will give you the victor’s crown of life."},{"num":11,"verse":"‘Let everyone listen to what the Spirit says to the churches. The one who overcomes will never be hurt by the second death.’”"},{"header":"The Letter to the Church in Pergamum"},{"num":12,"verse":"“To the messenger of the church in Pergamum, write:"},{"num":13,"verse":"‘I know where you live. Satan’s throne is there. Yet you hold on to my name and have not denied your faith in me, even in the days of Antipas, my faithful witness, who was killed in your presence, where Satan lives. "},{"num":14,"verse":"But I have a few things against you: You have there some who hold to the teaching of Balaam, the one who taught Balak to put a stumbling block before the people of Israel so that they would eat food sacrificed to idols and practice immorality. "},{"num":15,"verse":"You also have some who hold to the teaching of the Nicolaitans. "},{"num":16,"verse":"So repent. If you don’t, I will come to you quickly and wage war against them with the sword of my mouth."},{"num":17,"verse":"‘Let everyone listen to what the Spirit says to the churches. I will give some of the hidden manna to everyone who overcomes.’” I will also give him a white stone. On the white stone is written a new name that no one knows except the person who receives it.’”"},{"header":"The Letter to the Church in Thyatira"},{"num":18,"verse":"“To the messenger of the church in Thyatira, write:"},{"num":19,"verse":"‘I know what you’ve been doing—your love, faithfulness, service, and endurance—and that your last actions are greater than the first. "},{"num":20,"verse":"But I have this against you: You tolerate that woman Jezebel, who calls herself a prophet and who teaches and leads my servants to practice immorality and to eat food sacrificed to idols. "},{"num":21,"verse":"I gave her time to repent, but she refused to repent of her immorality. "},{"num":22,"verse":"Look! I am going to strike her with illness. Those who commit adultery with her will also suffer greatly, unless they repent from acting like her. "},{"num":23,"verse":"I will strike her children dead. Then all the churches will know that I am the one who searches minds and hearts. I will reward each of you as your actions deserve."},{"num":24,"verse":"‘But as for the rest of you in Thyatira—you who do not hold to this teaching and who have not learned what some people call the deep things of Satan—I won’t burden you with anything else. "},{"num":25,"verse":"Just hold on to what you have until I come. "},{"num":26,"verse":"I will give authority over the nations to the person who overcomes and continues to do what I’ve commanded to the end, and"},{"num":28,"verse":"‘Just as I have received authority from my Father, I will also give him the morning star."},{"num":29,"verse":"‘Let everyone listen to what the Spirit says to the churches.’”"}]