[{"num":9,"verse":"And the Lord said to Moses: Go in to Pharao, and speak to him: Thus saith the Lord God of the Hebrews: Let my people go to sacrifice to me."},{"num":2,"verse":"But if thou refuse, and withhold them still:"},{"num":3,"verse":"Behold my hand shall be upon thy fields: and a very grievous murrain upon thy horses, and asses, and camels, and oxen, and sheep."},{"num":4,"verse":"And the Lord will make a wonderful difference between the possessions of Israel and the possessions of the Egyptians, that nothing at all shall die of those things that belong to the children of Israel."},{"num":5,"verse":"And the Lord appointed a time, saying: To morrow will the Lord do this thing in the land."},{"num":6,"verse":"The Lord therefore did this thing the next day: and all the beasts of the Egyptians died, but of the beasts of the children of Israel there died not one."},{"num":7,"verse":"And Pharao sent to see: and there was not any thing dead of that which Israel possessed. And Pharao's heart was hardened, and he did not let the people go."},{"num":8,"verse":"And the Lord said to Moses and Aaron: Take to you handfuls of ashes out of the chimney, and let Moses sprinkle it in the air in the presence of Pharao."},{"num":9,"verse":"And be there dust upon all the land of Egypt: for there shall be boils and swelling blains both in men and beasts in the whole land of Egypt."},{"num":10,"verse":"And they took ashes out of the chimney, and stood before Pharao, and Moses sprinkled it in the air: and there came boils with swelling blains in men and beasts."},{"num":11,"verse":"Neither could the magicians stand before Moses for the boils that were upon them, and in all the land of Egypt."},{"num":12,"verse":"And the Lord hardened Pharao's heart, and he hearkened not unto them, as the Lord had spoken to Moses."},{"num":13,"verse":"And the Lord said to Moses: Arise in the morning, and stand before Pharao, and thou shalt say to him: Thus saith the Lord the God of the Hebrews: Let my people go to sacrifice to me."},{"num":14,"verse":"For I will at this time send all my plagues upon thy heart, and upon thy servants, and upon thy people: that thou mayst know there is none like me in all the earth."},{"num":15,"verse":"For now I will stretch out my hand to strike thee, and thy people with pestilence, and thou shalt perish from the earth."},{"num":16,"verse":"And therefore have I raised thee, that I may shew my power in thee, and my name may be spoken of throughout all the earth."},{"num":17,"verse":"Dost thou yet hold back my people: and wilt thou not let them go?"},{"num":18,"verse":"Behold I will cause it to rain to morrow at this same hour, an exceeding great hail: such as hath not been in Egypt from the day that it was founded, until this present time."},{"num":19,"verse":"Send therefore now presently, and gather together thy cattle, and all that thou hast in the field: for men and beasts, and all things that shall be found abroad, and not gathered together out of the fields, which the hail shall fall upon, shall die."},{"num":20,"verse":"He that feared the word of the Lord among Pharao's servants, made his servants and his cattle flee into houses:"},{"num":21,"verse":"But he that regarded not the word of the Lord, left his servants and his cattle in the fields:"},{"num":22,"verse":"And the Lord said to Moses: Stretch forth thy hand towards heaven, that there may be hail in the whole land of Egypt, upon men, and upon beasts, and upon every herb of the field in the land of Egypt."},{"num":23,"verse":"And Moses stretched forth his rod towards heaven, and the Lord sent thunder and hail, and lightning running along the ground: and the Lord rained hail upon the land of Egypt."},{"num":24,"verse":"And the hail and fire mixed with it drove on together: and it was of so great bigness, as never before was seen in the whole land of Egypt since that nation was founded."},{"num":25,"verse":"And the hail destroyed through all the land of Egypt all things that were in the fields, both man and beast: and the hail smote every herb of the field, and it broke every tree of the country."},{"num":26,"verse":"Only in the land of Gessen, where the children of Israel were, the hail fell not."},{"num":27,"verse":"And Pharao sent and called Moses and Aaron, saying to them: I have sinned this time also; the Lord is just: I and my people are wicked."},{"num":28,"verse":"Pray ye to the Lord, that the thunderings of God and the hail may cease: that I may let you go, and that you may stay here no longer."},{"num":29,"verse":"Moses said: As soon as I am gone out of the city, I will stretch forth my hands to the Lord, and the thunders shall cease, and the hail shall be no more: that thou mayst know that the earth is the Lord's."},{"num":30,"verse":"But I know that neither thou, nor thy servants do yet fear the Lord God."},{"num":31,"verse":"The flax therefore and the barley were hurt, because the barley was green, and the flax was now boiled:"},{"num":32,"verse":"But the wheat, and other winter corn were not hurt, because they were lateward."},{"num":33,"verse":"And when Moses was gone from Pharao out of the city, he stretched forth his hands to the Lord: and the thunders and the hail ceased, neither did there drop any more rain upon the earth."},{"num":34,"verse":"And Pharao seeing that the rain and the hail, and the thunders were ceased, increased his sin."},{"num":35,"verse":"And his heart was hardened, and the heart of his servants, and it was made exceeding hard: neither did he let the children of Israel go, as the Lord had commanded by the hand of Moses."}]