[{"header":"The Disease of the Farm Animals"},{"num":9,"verse":"Then the Lord told Moses to go to Pharaoh and tell him: “The Lord, the God of the Hebrews, says, ‘Let my people go to worship me!’"},{"num":2,"verse":"If you continue to hold them and refuse to let them go,"},{"num":3,"verse":"then the Lord will use his power against your animals in the fields. He will cause all of your horses, donkeys, camels, cattle, and sheep to get sick with a terrible disease."},{"num":4,"verse":"But the Lord will treat Israel’s animals differently from the animals of Egypt. None of the animals that belong to the Israelites will die."},{"num":5,"verse":"The Lord has set the time for this to happen. He said, ‘Tomorrow the Lord will make this happen in this country.’”"},{"num":6,"verse":"The next morning the Lord did what he said. All the farm animals of the Egyptians died, but none of the animals that belonged to the Israelites died."},{"num":7,"verse":"Pharaoh sent people to see if any of the animals of Israel died. Not one of them died. But Pharaoh remained stubborn and did not let the people go."},{"header":"The Boils"},{"num":8,"verse":"The Lord said to Moses and Aaron, “Fill your hands with the ashes from a furnace. Moses, you throw the ashes into the air in front of Pharaoh."},{"num":9,"verse":"This will become dust that will go throughout the land of Egypt. Whenever the dust touches a person or an animal in Egypt, sores will break out on the skin.”"},{"num":10,"verse":"So Moses and Aaron took ashes from a furnace and went and stood before Pharaoh. Moses threw the ashes into the air, and sores began breaking out on people and animals."},{"num":11,"verse":"The magicians could not stop Moses from doing this, because even the magicians had the sores. This happened everywhere in Egypt."},{"num":12,"verse":"But the Lord made Pharaoh stubborn, so he refused to listen to Moses and Aaron, just as the Lord had said."},{"header":"The Hail"},{"num":13,"verse":"Then the Lord said to Moses, “Get up in the morning and go to Pharaoh. Tell him that the Lord, the God of the Hebrews, says, ‘Let my people go to worship me!"},{"num":14,"verse":"This time, I will use my full power against you, your officials, and your people. Then you will know that there is no god in the world like me."},{"num":15,"verse":"I could use my power and cause a disease that would wipe you and your people off the earth."},{"num":16,"verse":"But I have put you here for a reason. I have put you here so that I could show you my power. Then people all over the world will learn about me!"},{"num":17,"verse":"You are still against my people. You are not letting them go free."},{"num":18,"verse":"So at this time tomorrow, I will cause a very bad hailstorm. There has never been a hailstorm like this in Egypt, not since Egypt became a nation."},{"num":19,"verse":"Now, you must put your animals in a safe place. Everything you own that is now in the fields must be put in a safe place. Any person or animal that remains in the fields will be killed. The hail will fall on everything that is not gathered into your houses.’”"},{"num":20,"verse":"Some of Pharaoh’s officials paid attention to the Lord’s message. They quickly put all of their animals and slaves into houses."},{"num":21,"verse":"But other people ignored the Lord’s message and lost all their slaves and animals that were in the fields."},{"num":22,"verse":"The Lord told Moses, “Raise your hand into the air and the hail will start falling all over Egypt. The hail will fall on all the people, animals, and plants in all the fields of Egypt.”"},{"num":23,"verse":"So Moses raised his walking stick into the air, and the Lord sent hail with thunder and lightning down on the earth. The Lord caused hail to fall all over Egypt."},{"num":24,"verse":"The hail was falling, and lightning was flashing all through it. It was the worst hailstorm that had ever hit Egypt since it had become a nation."},{"num":25,"verse":"The storm destroyed everything in the fields in Egypt. The hail destroyed people, animals, and plants. The hail also broke all the trees in the fields."},{"num":26,"verse":"The only place that did not get hail was the land of Goshen, where the Israelites lived."},{"num":27,"verse":"Pharaoh sent for Moses and Aaron and told them, “This time I have sinned. The Lord is right, and I and my people are wrong."},{"num":28,"verse":"We have had enough of this hail and thunder! Ask the Lord to stop the storm, and I will let you go. You don’t have to stay here.”"},{"num":29,"verse":"Moses told Pharaoh, “When I leave the city, I will lift my hands in prayer to the Lord, and the thunder and hail will stop. Then you will know that the Lord is in this land."},{"num":30,"verse":"But I know that you and your officials don’t really fear and respect the Lord yet.”"},{"num":31,"verse":"The flax had already developed its seeds, and the barley was already blooming. So these plants were destroyed."},{"num":32,"verse":"But wheat and spelt ripen later than the other grains, so these plants were not destroyed."},{"num":33,"verse":"Moses left Pharaoh and went outside the city. He lifted his hands in prayer to the Lord. And the thunder and hail stopped, and then even the rain stopped."},{"num":34,"verse":"When Pharaoh saw that the rain, hail, and thunder had stopped, he again did wrong. He and his officials became stubborn again."},{"num":35,"verse":"Pharaoh refused to let the Israelites go free, just as the Lord had said through Moses."}]