[{"header":"The Plague on Livestock"},{"num":9,"verse":"Then the Lord spoke to Moses. He said, “Go to Pharaoh. Tell him, ‘The Lord, the God of the Hebrews, says, “Let my people go. Then they will be able to worship me. "},{"num":2,"verse":"Do not refuse to let them go. Do not keep holding them back. "},{"num":3,"verse":"If you refuse, my powerful hand will bring a terrible plague on you. I will strike your livestock in the fields. I will strike your horses, donkeys, camels, cattle, sheep and goats. "},{"num":4,"verse":"But I will treat Israel’s livestock differently from yours. No animal that belongs to the people of Israel will die.” ’ ”"},{"num":5,"verse":"The Lord set a time for the plague. He said, “Tomorrow I will send it on the land.” "},{"num":6,"verse":"So the next day the Lord sent it. All the livestock of the Egyptians died. But not one animal that belonged to the Israelites died. "},{"num":7,"verse":"Pharaoh searched and found out what had happened. He discovered that not even one animal that belonged to the Israelites had died. But he was still very stubborn. He wouldn’t let the people go."},{"header":"The Plague of Boils"},{"num":8,"verse":"Then the Lord spoke to Moses and Aaron. He said, “Take handfuls of ashes from a furnace. Have Moses toss them into the air in front of Pharaoh. "},{"num":9,"verse":"The ashes will turn into fine dust over the whole land of Egypt. Then painful boils will break out on people and animals all over the land. Their bodies will be covered with them.”"},{"num":10,"verse":"So Moses and Aaron took ashes from a furnace and stood in front of Pharaoh. Moses tossed them into the air. Then boils broke out on people and animals alike. "},{"num":11,"verse":"The bodies of all the Egyptians were covered with boils. The magicians couldn’t stand in front of Moses because of the boils that were all over them. "},{"num":12,"verse":"But the Lord made Pharaoh stubborn. Pharaoh wouldn’t listen to Moses and Aaron, just as the Lord had said to Moses."},{"header":"The Plague of Hail"},{"num":13,"verse":"Then the Lord spoke to Moses. He said, “Get up early in the morning. Go to Pharaoh and say to him, ‘The Lord, the God of the Hebrews, says, “Let my people go. Then they will be able to worship me. "},{"num":14,"verse":"If you do not let them go, I will send the full force of my plagues against you this time. They will strike your officials and your people. Then you will know that there is no one like me in the whole earth. "},{"num":15,"verse":"By now I could have reached out my hand. I could have struck you and your people with a plague that would have wiped you off the earth. "},{"num":16,"verse":"But I had a special reason for making you king. I decided to show you my power. I wanted my name to become known everywhere on earth. "},{"num":17,"verse":"But you are still against my people. You will not let them go. "},{"num":18,"verse":"So at this time tomorrow I will send the worst hailstorm ever to fall on Egypt in its entire history. "},{"num":19,"verse":"Give an order now to bring your livestock inside to a safe place. Bring in everything that is outside. The hail will fall on all the people and animals that are left outside. They will die.” ’ ”"},{"num":20,"verse":"The officials of Pharaoh who had respect for what the Lord had said obeyed him. They hurried to bring their slaves and their livestock inside. "},{"num":21,"verse":"But others didn’t pay attention to what the Lord had said. They left their slaves and livestock outside."},{"num":22,"verse":"Then the Lord spoke to Moses. He said, “Reach out your hand toward the sky. Then hail will fall all over Egypt. It will beat down on people and animals alike. It will strike everything growing in the fields of Egypt.” "},{"num":23,"verse":"Moses reached out his walking stick toward the sky. Then the Lord sent thunder and hail. Lightning flashed down to the ground. The Lord rained hail on the land of Egypt. "},{"num":24,"verse":"Hail fell and lightning flashed back and forth. It was the worst storm in Egypt’s entire history. "},{"num":25,"verse":"Hail struck everything in the fields all over Egypt. It fell on people and animals alike. It beat down everything growing in the fields. It tore all the leaves off the trees. "},{"num":26,"verse":"The only place it didn’t hail was in the area of Goshen. That’s where the people of Israel were."},{"num":27,"verse":"Then Pharaoh sent for Moses and Aaron. “This time I’ve sinned,” he said to them. “The Lord has done what is right. I and my people have done what is wrong. "},{"num":28,"verse":"Pray to the Lord, because we’ve had enough thunder and hail. I’ll let you and your people go. You don’t have to stay here any longer.”"},{"num":29,"verse":"Moses replied, “When I’ve left the city, I’ll lift up my hands and pray to the Lord. The thunder will stop. There won’t be any more hail. Then you will know that the earth belongs to the Lord. "},{"num":30,"verse":"But I know that you and your officials still don’t have any respect for the Lord God.”"},{"num":31,"verse":"The barley was ripe. The flax was in bloom. So they were both destroyed. "},{"num":32,"verse":"But the wheat and spelt weren’t destroyed. That’s because they ripen later."},{"num":33,"verse":"Then Moses left Pharaoh and went out of the city. Moses lifted up his hands and prayed to the Lord. The thunder and hail stopped. The rain didn’t pour down on the land any longer. "},{"num":34,"verse":"Pharaoh saw that the rain, hail and thunder had stopped. So he sinned again. He and his officials became stubborn. "},{"num":35,"verse":"So Pharaoh was stubborn. He wouldn’t let the people of Israel go, just as the Lord had said through Moses."}]