[{"num":14,"verse":"¶ In the second year of Joash, son of Jehoahaz, king of Israel, Amaziah, the son of Joash, king of Judah, began to reign."},{"num":2,"verse":"He was twenty-five years old when he began to reign and reigned twenty-nine years in Jerusalem. And his mother’s name was Jehoaddan of Jerusalem."},{"num":3,"verse":"And he did that which was right in the sight of the LORD, yet not like David his father; he did according to all things as Joash his father did."},{"num":4,"verse":"With all this, the high places were not taken away; as yet the people sacrificed and burnt incense on the high places."},{"num":5,"verse":"And as soon as the kingdom was confirmed in his hand, he slew his slaves which had slain the king, his father."},{"num":6,"verse":"But the sons of those who had slain him he slew not; according unto that which is written in the book of the law of Moses where the LORD commanded, saying, The fathers shall not be put to death for the children, nor the children be put to death for the fathers; but each one shall die for their own sin."},{"num":7,"verse":"He slew of Edom in the valley of salt ten thousand and took Selah by war and called the name of it Joktheel unto this day."},{"num":8,"verse":"¶ Then Amaziah sent messengers to Jehoash, the son of Jehoahaz, son of Jehu, king of Israel, saying, Come, let us look each other in the face."},{"num":9,"verse":"And Jehoash, the king of Israel, sent to Amaziah, king of Judah, this reply, The thistle that was in Lebanon sent to the cedar that was in Lebanon, saying, Give thy daughter to my son to wife. And the wild beasts that were in Lebanon passed by and trode down the thistle."},{"num":10,"verse":"Thou hast indeed smitten Edom, and thy heart has lifted thee up; glory in this, but tarry at home. Why should thou meddle in evil that thou should fall, even thou, and Judah with thee?"},{"num":11,"verse":"But Amaziah would not hear. Therefore Jehoash, king of Israel, went up; and he and Amaziah, king of Judah, looked each other in the face at Bethshemesh, which is in Judah."},{"num":12,"verse":"But Judah fell before Israel, and they fled each man to their tents."},{"num":13,"verse":"Furthermore, Jehoash, king of Israel, took Amaziah, king of Judah, the son of Jehoash, the son of Ahaziah, at Bethshemesh and came to Jerusalem and broke down the wall of Jerusalem from the gate of Ephraim unto the corner gate, four hundred cubits."},{"num":14,"verse":"And he took all the gold and silver and all the vessels that were found in the house of the LORD and in the treasury of the king’s house and the sons as hostages and returned to Samaria."},{"num":15,"verse":"¶ Now the rest of the acts of Jehoash, which he did, and his might and how he fought with Amaziah, king of Judah, are they not written in the book of the chronicles of the kings of Israel?"},{"num":16,"verse":"And Jehoash slept with his fathers and was buried in Samaria with the kings of Israel; and Jeroboam, his son, reigned in his stead."},{"num":17,"verse":"And Amaziah, the son of Joash, king of Judah, lived after the death of Jehoash, son of Jehoahaz, king of Israel, fifteen years."},{"num":18,"verse":"And the rest of the acts of Amaziah, are they not written in the book of the chronicles of the kings of Judah?"},{"num":19,"verse":"Now they made a conspiracy against him in Jerusalem, and he fled to Lachish; but they sent after him to Lachish and slew him there."},{"num":20,"verse":"And they brought him on horses, and he was buried at Jerusalem with his fathers in the city of David."},{"num":21,"verse":"Then all the people of Judah took Azariah, who was sixteen years old, and made him king instead of his father Amaziah."},{"num":22,"verse":"He built Elath and restored it to Judah, after the king slept with his fathers."},{"num":23,"verse":"¶ In the fifteenth year of Amaziah, the son of Joash, king of Judah, Jeroboam, the son of Joash, king of Israel, began to reign in Samaria and reigned forty-one years."},{"num":24,"verse":"And he did that which was evil in the sight of the LORD; he did not depart from all the sins of Jeroboam, the son of Nebat, who caused Israel to sin."},{"num":25,"verse":"He restored the borders of Israel from the entering of Hamath unto the sea of the plain, according to the word of the LORD God of Israel, which he had spoken by the hand of his slave Jonah, the son of Amittai, the prophet, who was of Gathhepher."},{"num":26,"verse":"For the LORD saw the affliction of Israel, that it was very bitter, for there was no one shut up nor any left nor any to help Israel;"},{"num":27,"verse":"and the LORD had not yet determined to blot out the name of Israel from under heaven; therefore, he saved them by the hand of Jeroboam, the son of Joash."},{"num":28,"verse":"Now the rest of the acts of Jeroboam and all that he did and his might, how he warred and how he recovered Damascus and Hamath to Judah in Israel, are they not written in the book of the chronicles of the kings of Israel?"},{"num":29,"verse":"And Jeroboam slept with his fathers, with the kings of Israel, and Zachariah, his son, reigned in his stead."}]