[{"header":"Chapter 14"},{"num":1,"verse":"Reign of Amaziah of Judah. In the second year of Joash, son of Jehoahaz, king of Israel, Amaziah, son of Joash, king of Judah, became king. "},{"num":2,"verse":"He was twenty-five years old when he became king, and he reigned twenty-nine years in Jerusalem. His mother’s name was Jehoaddin, from Jerusalem."},{"num":3,"verse":"He did what was right in the Lord’s eyes, though not like David his father. He did just as his father Joash had done, "},{"num":4,"verse":"though the high places did not disappear, and the people continued to sacrifice and to burn incense on the high places."},{"num":5,"verse":"When Amaziah had the kingdom firmly in hand, he struck down the officials who had struck down the king, his father. "},{"num":6,"verse":"But their children he did not put to death, according to what is written in the book of the law of Moses, which the Lord commanded: “Parents shall not be put to death for their children, nor shall children be put to death for their parents; only for one’s own crimes shall a person be put to death.”"},{"num":7,"verse":"Amaziah struck down ten thousand Edomites in the Salt Valley. He took Sela in battle and renamed it Joktheel, the name it has to this day."},{"num":8,"verse":"Then Amaziah sent messengers to Joash, son of Jehoahaz, son of Jehu, king of Israel, with this message: “Come, let us meet face to face.” "},{"num":9,"verse":"Joash, king of Israel, sent this reply to Amaziah, king of Judah: “A thistle of Lebanon sent word to a cedar of Lebanon, ‘Give your daughter to my son in marriage,’ but an animal of Lebanon passed by and trampled the thistle underfoot. "},{"num":10,"verse":"You have indeed struck down Edom, and your heart is lifted up; enjoy your glory, but stay home! Why bring misfortune and failure on yourself and on Judah with you?” "},{"num":11,"verse":"But Amaziah did not listen. So Joash, king of Israel, advanced, and he and Amaziah, king of Judah, met face to face at Beth-shemesh of Judah, "},{"num":12,"verse":"and Judah was defeated by Israel, and all fled to their tents. "},{"num":13,"verse":"But Amaziah, king of Judah, son of Joash, son of Ahaziah, was captured by Joash, king of Israel, at Beth-shemesh. When they came to Jerusalem Joash tore down the wall of Jerusalem, from the Gate of Ephraim to the Corner Gate, four hundred cubits. "},{"num":14,"verse":"He took all the gold and silver and all the vessels found in the house of the Lord and in the treasuries of the king’s house, and hostages as well. Then he returned to Samaria."},{"num":15,"verse":"The rest of the acts of Joash, what he did and his valor, and how he made war against Amaziah, king of Judah, are recorded in the book of the chronicles of the kings of Israel. "},{"num":16,"verse":"Joash rested with his ancestors; he was buried in Samaria with the kings of Israel, and his son Jeroboam succeeded him as king."},{"num":17,"verse":"Amaziah, son of Joash, king of Judah, survived Joash, son of Jehoahaz, king of Israel, by fifteen years. "},{"num":18,"verse":"The rest of the acts of Amaziah are recorded in the book of the chronicles of the kings of Judah. "},{"num":19,"verse":"When a conspiracy was formed against him in Jerusalem, he fled to Lachish. But he was pursued to Lachish and killed there. "},{"num":20,"verse":"He was brought back on horses and was buried in Jerusalem with his ancestors in the City of David. "},{"num":21,"verse":"Thereupon all the people of Judah took Azariah, who was only sixteen years old, and made him king to succeed Amaziah, his father. "},{"num":22,"verse":"It was he who rebuilt Elath and restored it to Judah, after the king rested with his ancestors."},{"num":23,"verse":"Reign of Jeroboam II of Israel. In the fifteenth year of Amaziah, son of Joash, king of Judah, Jeroboam, son of Joash, king of Israel, became king in Samaria for forty-one years."},{"num":24,"verse":"He did evil in the Lord’s sight; he did not desist from any of the sins that Jeroboam, son of Nebat, had caused Israel to commit. "},{"num":25,"verse":"He restored the boundaries of Israel from Lebo-hamath to the sea of the Arabah, as the Lord, the God of Israel, had foretold through his servant, the prophet Jonah, son of Amittai, from Gath-hepher. "},{"num":26,"verse":"For the Lord saw the very bitter affliction of Israel, where there was neither bond nor free, no one at all to help Israel. "},{"num":27,"verse":"Since the Lord had not resolved to wipe out the name of Israel from under the heavens, he saved them through Jeroboam, son of Joash."},{"num":28,"verse":"The rest of the acts of Jeroboam, with all that he did and his valor, how he fought, and how he regained Damascus and Hamath for Israel, are recorded in the book of the chronicles of the kings of Israel. "},{"num":29,"verse":"Jeroboam rested with his ancestors, the kings of Israel, and his son Zechariah succeeded him as king."}]