[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(32) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "They shall drive thee.—",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "This verse is only slightly abridged from ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 4:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " by the omission of the clause “they shall wet thee with the dew of heaven.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "4:28-37 Pride and self-conceit are sins that beset great men. They are apt to take that glory to themselves which is due to God only. While the proud word was in the king's mouth, the powerful word came from God. His understanding and his memory were gone, and all the powers of the rational soul were broken. How careful we ought to be, not to do any thing which may provoke God to put us out of our senses! God resists the proud. Nebuchadnezzar would be more than a man, but God justly makes him less than a man. We may learn to believe concerning God, that the most high God lives for ever, and that his kingdom is like himself, everlasting, and universal. His power cannot be resisted. When men are brought to honour God, by confession of sin and acknowledging his sovereignty, then, and not till then, they may expect that God will honour them; not only restore them to the dignity they lost by the sin of the first Adam, but add excellent majesty to them, from the righteousness and grace of the Second Adam. Afflictions shall last no longer than till they have done the work for which they were sent. There can be no reasonable doubt that Nebuchadnezzar was a true penitent, and an accepted believer. It is thought that he did not live more than a year after his restoration. Thus the Lord knows how to abase those that walk in pride, but gives grace and consolation to the humble, broken-hearted sinner who calls upon Him.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And they shall drive thee from men ... - See the note at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 4:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "31. While, &c.—in the very act of speaking, so that there could be no doubt as to the connection between the crime and the punishment. So Lu 12:19, 20.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "O king … to thee it is spoken—Notwithstanding thy kingly power, to thee thy doom is now spoken, there is to be no further respite.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "From men; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " from the society and conversation of men. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And they shall drive thee from men,.... According to the interpretation of the dream given by Daniel, which this voice from heaven confirms; See Gill on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 4:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where the same things are said as here. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And they shall drive thee from men, and thy dwelling shall be with the beasts of the field: they shall make thee to eat grass as oxen, and seven times shall pass over thee, until thou know that the most High ruleth in the kingdom of men, and giveth it to whomsoever he will.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "thou shalt be driven … shalt be made",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "to eat grass as oxen",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The passives, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Daniel 4:25",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 4:25",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ",—with which, indeed, except that one clause is omitted, the present verse agrees almost verbally.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Daniel 4:32",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In this verse there is a brief comprehensive statement regarding the fulfilment of the dream to the king, which is then extended from v. 26 to 30. At the end of twelve months, i.e., after the expiry of twelve months from the time of the dream, the king betook himself to his palace at Babylon, i.e., to the flat roof of the palace; cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 11:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The addition at Babylon does not indicate that the king was then living at a distance from Babylon, as Berth., v. Leng., Maur., and others imagine, but is altogether suitable to the matter, because Nebuchadnezzar certainly had palaces outside of Babylon, but it is made with special reference to the language of the king which follows regarding the greatness of Babylon. ענה means here not simply to begin to speak, but properly to answer, and suggests to us a foregoing colloquy of the king with himself in his own mind. Whether one may conclude from that, in connection with the statement of time, after twelve months, that Nebuchadnezzar, exactly one year after he had received the important dream, was actively engaging himself regarding that dream, must remain undetermined, and can be of no use to a psychological explanation of the occurrence of the dream. The thoughts which Nebuchadnezzar expresses in v. 26 (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 4:29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") are not favourable to such a supposition. Had the king remembered that dream and its interpretation, he would scarcely have spoken so proudly of his splendid city which he had built as he does in v. 27 (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Daniel 4:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "When he surveyed the great and magnificent city from the top of his palace, \"pride overcame him,\" so that he dedicated the building of this great city as the house of his kingdom to the might of his power and the honour of his majesty. From the addition רבּתא it does not follow that this predicate was a standing Epitheton ornans of Babylon, as with חמת , Amos 6:2, and other towns of Asia; for although Pausanias and Strabo call Babylon μεγάλη and μεγίστη πόλις, yet it bears this designation as a surname in no ancient author. But in Revelation 14:8 this predicate, quoted from the passage before us, is given to Babylon, and in the mouth of Nebuchadnezzar it quite corresponds to the self-praise of his great might by which he had built Babylon as the residence of a great king. בּנה designates, as בּנה more frequently, not the building or founding of a city, for the founding of Babylon took place in the earliest times after the Flood (Genesis 11), and was dedicated to the god Belus, or the mythic Semiramis, i.e., in the pre-historic time; but בּנה means the building up, the enlargement, the adorning of the city מלכוּ לבּית, for the house of the kingdom, i.e., for a royal residence; cf. The related expression ממלכה בּית, Amos 7:13. בּית stands in this connection neither for town nor for היכל (Daniel 4:29), but has the meaning dwelling-place. The royalty of the Babylonian kingdom has its dwelling-place, its seat, in Babylon, the capital of the kingdom.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "When he surveyed the great and magnificent city from the top of his palace, \"pride overcame him,\" so that he dedicated the building of this great city as the house of his kingdom to the might of his power and the honour of his majesty. From the addition רבּתא it does not follow that this predicate was a standing Epitheton ornans of Babylon, as with חמת , ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 6:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and other towns of Asia; for although Pausanias and Strabo call Babylon μεγάλη and μεγίστη πόλις, yet it bears this designation as a surname in no ancient author. But in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 14:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " this predicate, quoted from the passage before us, is given to Babylon, and in the mouth of Nebuchadnezzar it quite corresponds to the self-praise of his great might by which he had built Babylon as the residence of a great king. בּנה designates, as בּנה more frequently, not the building or founding of a city, for the founding of Babylon took place in the earliest times after the Flood (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and was dedicated to the god Belus, or the mythic Semiramis, i.e., in the pre-historic time; but בּנה means the building up, the enlargement, the adorning of the city מלכוּ לבּית, for the house of the kingdom, i.e., for a royal residence; cf. The related expression ממלכה בּית, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Amos 7:13",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". בּית stands in this connection neither for town nor for היכל (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 4:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), but has the meaning dwelling-place. The royalty of the Babylonian kingdom has its dwelling-place, its seat, in Babylon, the capital of the kingdom.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "With reference to the great buildings of Nebuchadnezzar in Babylon, vide the statements of Berosus in Josephi Ant. x. 11, 1, and con. Ap. i. 19, and of Abydenus in Eusebii praepar. evang. ix. 41, and Chron. i. p. 59; also the delineation of these buildings in Duncker's Gesch. des Alterth. i. p. 854ff. The presumption of this language appears in the words, \"by the strength of my might, and for the splendour (honour) of my majesty.\" Thus Nebuchadnezzar describes himself as the creator of his kingdom and of its glory, while the building up of his capital as a residence bearing witness to his glory and his might pointed at the same time to the duration of his dynasty. This proud utterance is immediately followed by his humiliation by the omnipotent God. A voice fell from heaven. נפל as in Isaiah 9:7, of the sudden coming of a divine revelation. אמרין for the passive, as Daniel 3:4. The perf. עדּת denotes the matter as finished. At the moment when Nebuchadnezzar heard in his soul the voice from heaven, the prophecy begins to be fulfilled, the king becomes deranged, and is deprived of his royalty.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "With reference to the great buildings of Nebuchadnezzar in Babylon, vide the statements of Berosus in Josephi Ant. x. 11, 1, and con. Ap. i. 19, and of Abydenus in Eusebii praepar. evang. ix. 41, and Chron. i. p. 59; also the delineation of these buildings in Duncker's Gesch. des Alterth. i. p. 854ff. The presumption of this language appears in the words, \"by the strength of my might, and for the splendour (honour) of my majesty.\" Thus Nebuchadnezzar describes himself as the creator of his kingdom and of its glory, while the building up of his capital as a residence bearing witness to his glory and his might pointed at the same time to the duration of his dynasty. This proud utterance is immediately followed by his humiliation by the omnipotent God. A voice fell from heaven. נפל as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 9:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", of the sudden coming of a divine revelation. אמרין for the passive, as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 3:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The perf. עדּת denotes the matter as finished. At the moment when Nebuchadnezzar heard in his soul the voice from heaven, the prophecy begins to be fulfilled, the king becomes deranged, and is deprived of his royalty.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Daniel 4:29-30 (Daniel 4:32-33)",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 4:29-30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 4:32-33",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ")",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(4:25-30)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The fulfilling of the dream.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Nebuchadnezzar narrates the fulfilment of the dream altogether objectively, so that he speaks of himself in the third person. Berth., Hitz., and others find here that the author falls out of the role of the king into the narrative tone, and thus betrays the fact that some other than the king framed the edict. But this conclusion is opposed by the fact that Nebuchadnezzar from v. 31 speaks of his recovery again in the first person. Thus it is beyond doubt that the change of person has its reason in the matter itself. Certainly it could not be in this that Nebuchadnezzar thought it unbecoming to speak in his own person of his madness; for if he had had so tender a regard for his own person, he would not have published the whole occurrence in a manifesto addressed to his subjects. But the reason of his speaking of his madness in the third person, as if some other one were narrating it, lies simply in this, that in that condition he was not Ich  equals  Ego (Kliefoth). With the return of the Ich, I, on the recovery from his madness, Nebuchadnezzar begins again to narrate in the first person (v. 31 34).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Here the contents of the prophecy, v. 22 (v. 25), are repeated, and then in v. 30 (v. 33) it is stated that the word regarding Nebuchadnezzar immediately began to be fulfilled. On שׁעתא בהּ, cf. Daniel 3:6. ספת, from סוּף, to go to an end. The prophecy goes to an end when it is realized, is fulfilled. The fulfilling is related in the words of the prophecy. Nebuchadnezzar is driven from among men, viz., by his madness, in which he fled from intercourse with men, and lived under the open air of heaven as a beast among the beasts, eating grass like the cattle; and his person was so neglected, that his hair became like the eagles' fathers and his nails like birds' claws. כּנשׁרין and כּצפּרין are abbreviated comparisons; vide under Daniel 4:16. That this condition was a peculiar appearance of the madness is expressly mentioned in v. 31 (Daniel 4:34), where the recovery is designated as the restoration of his understanding.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Here the contents of the prophecy, v. 22 (v. 25), are repeated, and then in v. 30 (v. 33) it is stated that the word regarding Nebuchadnezzar immediately began to be fulfilled. On שׁעתא בהּ, cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 3:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ספת, from סוּף, to go to an end. The prophecy goes to an end when it is realized, is fulfilled. The fulfilling is related in the words of the prophecy. Nebuchadnezzar is driven from among men, viz., by his madness, in which he fled from intercourse with men, and lived under the open air of heaven as a beast among the beasts, eating grass like the cattle; and his person was so neglected, that his hair became like the eagles' fathers and his nails like birds' claws. כּנשׁרין and כּצפּרין are abbreviated comparisons; vide under ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 4:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". That this condition was a peculiar appearance of the madness is expressly mentioned in v. 31 (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 4:34",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), where the recovery is designated as the restoration of his understanding.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "This malady, in which men regard themselves as beasts and imitate their manner of life, is called insania zoanthropica, or, in the case of those who think themselves wolves, lycanthropia. The condition is described in a manner true to nature. Even \"as to the eating of grass,\" as G. Rsch, in the Deutsch. Morgenl. Zeitschr. xv. p. 521, remarks, \"there is nothing to perplex or that needs to be explained. It is a circumstance that has occurred in recent times, as e.g., in the case of a woman in the Wrttemberg asylum for the insane.\" Historical documents regarding this form of madness have been collected by Trusen in his Sitten, Gebr. u. Krank. der alten Hebrer, p. 205f., 2nd ed., and by Friedreich in Zur Bibel, i. p. 308f.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Regarding the statement, \"his hair grew as the feathers of an eagle,\" etc., Friedr. remarks, p. 316, that, besides the neglect of the external appearance, there is also to be observed the circumstance that sometimes in psychical maladies the nails assume a peculiarly monstrous luxuriance with deformity. Besides, his remaining for a long time in the open air is to be considered, \"for it is an actual experience that the hair, the more it is exposed to the influences of the rough weather and to the sun's rays, the more does it grow in hardness, and thus becomes like unto the feathers of an eagle.\") ",
        "children": []
      }
    ]
  }
]