[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(12, 13) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "She gave me . . . —",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "There is again in Adam the same passiveness which we noticed on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 3:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". He has little sense of responsibility, and no feeling that he had a duty towards Eve, and ought to have watched over her, and helped her when tempted. It is a mistake to suppose that he wished to shift the blame, first upon Eve, and then upon God, who had given her to him; rather, he recapitulates the history, as if, in his view, it was a matter of course that he should act as he had done (see on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 3:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and as if he had no sense that there was any blame whatever attaching to any one. His conscience still seems utterly unmoved. Far nobler is the woman’s answer. She acknowledges that she had been led astray, and, under the influence of the serpent’s deceit, had broken God’s commandment.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "3:9-13 Observe the startling question, Adam, where art thou? Those who by sin go astray from God, should seriously consider where they are; they are afar off from all good, in the midst of their enemies, in bondage to Satan, and in the high road to utter ruin. This lost sheep had wandered without end, if the good Shepherd had not sought after him, and told him, that where he was straying he could not be either happy or easy. If sinners will but consider where they are, they will not rest till they return to God. It is the common fault and folly of those that have done ill, when questioned about it, to acknowledge only that which is so manifest that they cannot deny it. Like Adam, we have reason to be afraid of approaching to God, if we are not covered and clothed with the righteousness of Christ. Sin appears most plainly in the glass of the commandment, therefore God set it before Adam; and in it we should see our faces. But instead of acknowledging the sin in its full extent, and taking shame to themselves, Adam and Eve excuse the sin, and lay the shame and blame on others. There is a strange proneness in those that are tempted, to say, they are tempted of God; as if our abuse of God's gifts would excuse our breaking God's laws. Those who are willing to take the pleasure and profit of sin, are backward to take the blame and shame of it. Learn hence, that Satan's temptations are all beguilings; his arguments are all deceits; his allurements are all cheats; when he speaks fair, believe him not. It is by the deceitfulness of sin the heart is hardened. See Ro 7:11; Heb 3:13. But though Satan's subtlety may draw us into sin, yet it will not justify us in sin. Though he is the tempter, we are the sinners. Let it not lessen our sorrow for sin, that we were beguiled into it; but let it increase our self-indignation, that we should suffer ourselves to be deceived by a known cheat, and a sworn enemy, who would destroy our souls.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Adam confesses that he was afraid of God, because he was naked. There is an instinctive hiding of his thoughts from God in this very speech. The nakedness is mentioned, but not the disobedience from which the sense of it arose. To the direct interrogatory of the Almighty, he confesses who made him acquainted with his nakedness and the fact of his having eaten of the forbidden fruit: \"The woman\" gave me of the tree, and \"I did eat.\"",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12. The woman … gave me—He blames God [Calvin]. As the woman had been given him for his companion and help, he had eaten of the tree from love to her; and perceiving she was ruined, was determined not to survive her [M'knight].",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "I have eaten, not by my own choice and inclination, but by the persuasion of this woman, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "whom thou gavest to be with me, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as a meet help, a faithful friend, and constant companion, supposing that it was not good for me to be alone, which the event shows would have been much better for me. Thus Adam excuseth himself, and chargeth God foolishly with his sin. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I did eat, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " out of complacency to her, not from any evil design against thee. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the man said,.... Not being able any longer to conceal the truth, though he shifts off the blame as much as possible from himself: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the woman whom thou gavest to be with me: to be his wife and his companion, to be an help meet unto him, and share with him in the blessings of paradise, to assist in civil and domestic affairs, and join with him in acts of religion and devotion: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "she gave me of the tree, and I did eat; she first ate of it herself, through the solicitations of the serpent, and then she persuaded me to eat of it; and accordingly I did, I own it. By this answer Adam endeavours to cast the blame partly upon his wife, and partly upon God; though in what he said he told the truth, and what was matter of fact, yet it carries this innuendo, that if it had not been for his wife he had never ate of it, which was a foolish excuse; for he, being her head and husband, should have taught her better, and been more careful to have prevented her eating of this fruit, and should have dissuaded her from it, and have reproved her for it, instead of following her example, and taking it from her hands: and more than this he tacitly reflects upon God, that he had given him a woman, who, instead of being an help meet to him, had helped to ruin him; and that if he had not given him this woman, he had never done what he had: but at this rate a man may find fault with God for the greatest blessings and mercies of life bestowed on him, which are abused by him, and so aggravate his condemnation. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "she gave me of the tree, and I did eat; she first ate of it herself, through the solicitations of the serpent, and then she persuaded me to eat of it; and accordingly I did, I own it. By this answer Adam endeavours to cast the blame partly upon his wife, and partly upon God; though in what he said he told the truth, and what was matter of fact, yet it carries this innuendo, that if it had not been for his wife he had never ate of it, which was a foolish excuse; for he, being her head and husband, should have taught her better, and been more careful to have prevented her eating of this fruit, and should have dissuaded her from it, and have reproved her for it, instead of following her example, and taking it from her hands: and more than this he tacitly reflects upon God, that he had given him a woman, who, instead of being an help meet to him, had helped to ruin him; and that if he had not given him this woman, he had never done what he had: but at this rate a man may find fault with God for the greatest blessings and mercies of life bestowed on him, which are abused by him, and so aggravate his condemnation. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And the man said, The woman whom thou {k} gavest to be with me, she gave me of the tree, and I did eat.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And the man said, The woman whom thou ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{k}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " gavest ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "to be",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " with me, she gave me of the tree, and I did eat.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(k) His wickedness and lack of true repentance appears in this that he blamed God because he had given him a wife.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The woman",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.] The man, unable to deny the charge, seeks to excuse himself by laying the blame primarily on the woman, and secondarily on Jehovah Himself, for having given him the woman as his companion. Guilt makes the man first a coward, and then insolent.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Genesis 3:12",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The man could not hide himself from God. \"Jehovah God called unto Adam, and said unto him, Where art thou?\" Not that He was ignorant of his hiding-place, but to bring him to a confession of his sin. And when Adam said that he had hidden himself through fear of his nakedness, and thus sought to hide the sin behind its consequences, his disobedience behind the feeling of shame; this is not to be regarded as a sign of peculiar obduracy, but easily admits of a psychological explanation, viz., that at the time he actually thought more of his nakedness and shame than of his transgression of the divine command, and his consciousness of the effects of his sin was keener than his sense of the sin itself. To awaken the latter God said, \"Who told thee that thou wast naked?\" and asked him whether he had broken His command. He could not deny that he had, but sought to excuse himself by saying, that the woman whom God gave to be with him had given him of the tree. When the woman was questioned, she pleaded as her excuse, that the serpent had beguiled her (or rather deceived her, ἐξαπάτησεν, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Corinthians 11:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). In offering these excuses, neither of them denied the fact. But the fault in both was, that they did not at once smite upon their breasts. \"It is so still; the sinner first of all endeavours to throw the blame upon others as tempters, and then upon circumstances which God has ordained.\" ",
        "children": []
      }
    ]
  }
]