[{"num":22,"verse":"The Lord said to Moses, "},{"num":2,"verse":"“Tell Aaron and his sons: ‘The people of Israel will give offerings to me. These offerings are holy, and they are mine. So you must respect these offerings. This will show that you respect my holy name. I am the Lord. "},{"num":3,"verse":"The people of Israel made the offerings holy for me. One of your descendants might be unclean and touch the offerings. From now on, anyone who does must be separated from appearing before me. I am the Lord."},{"num":4,"verse":"“‘One of Aaron’s descendants might have one of the harmful skin diseases. Or he might discharge a body fluid. He cannot eat the holy offerings until he becomes clean. He can become unclean from touching a dead body or from his own semen. "},{"num":5,"verse":"He will become unclean if he touches any unclean crawling animal. He will become unclean if he touches an unclean person. It doesn’t matter what made him unclean. "},{"num":6,"verse":"Anyone who touches those things will become unclean until evening. That person must not eat the holy offerings. But if he washes with water, he may eat the holy offerings. "},{"num":7,"verse":"He will be clean only after the sun goes down. Then he may eat the holy offerings. The offerings are his food."},{"num":8,"verse":"“‘A priest might find an animal that died by itself. Or he might find one that was killed by some other animal. He must not eat that dead animal. If he eats it, he will become unclean. I am the Lord."},{"num":9,"verse":"“‘The priests must keep all the rules I have given. That way they will not become guilty. If they are careful, they will not die. I am the Lord. I have made them holy. "},{"num":10,"verse":"Only people in a priest’s family may eat the holy offerings. A visitor staying with the priest must not eat it. A hired worker must not eat it. "},{"num":11,"verse":"But the priest might buy a slave with his own money. If he does, that slave may eat the holy offerings. Slaves who were born in the priest’s house may also eat the priest’s food. "},{"num":12,"verse":"A priest’s daughter might marry a person who is not a priest. If she does, she must not eat any of the holy offerings. "},{"num":13,"verse":"The husband of a priest’s daughter might die. Or the daughter might become divorced. She might not have children to support her. So she might go back to her father’s house where she lived as a child. If this happens, she may eat some of her father’s food. But only people from a priest’s family may eat this food."},{"num":14,"verse":"“‘Someone might eat some of the holy offering by mistake. That person must pay back the priest for that holy food. He must also pay the priest another one-fifth of the price of that food."},{"num":15,"verse":"“‘The people of Israel will give offerings to the Lord. These gifts become holy. So the priest must not treat these holy things as though they were not holy. "},{"num":16,"verse":"The priests might allow someone who is not a priest to eat the holy offerings. If they do, they are treating those offerings as though they were not holy. The person who eats will become guilty. He will have to pay for it. I am the Lord. I make them holy.’”"},{"num":17,"verse":"The Lord said to Moses, "},{"num":18,"verse":"“Tell Aaron and his sons and all the people of Israel: ‘A citizen of Israel or a foreigner living in Israel might want to bring a whole burnt offering. It might be for some special promise he has made. Or it might be a special gift he wanted to give to the Lord. "},{"num":19,"verse":"If he does, he must bring a male animal. It must have nothing wrong with it. The gift might be a bull, a sheep or a goat. This is so it might be accepted for him. "},{"num":20,"verse":"He must not bring an animal that has something wrong with it. It will not be accepted for him."},{"num":21,"verse":"“‘Someone might bring a fellowship offering to the Lord. That offering might be payment for a special promise the person made. Or it may be a special gift the person wanted to give the Lord. It might be a bull or a sheep. But it must be healthy. There must be nothing wrong with it. This is so it might be accepted for him. "},{"num":22,"verse":"You must not offer to the Lord any animal that is blind. It must not have broken bones or be crippled. It must not have running sores or any sort of skin disease. You must not offer any animals like these on the altar. They cannot be used as an offering by fire to the Lord."},{"num":23,"verse":"“‘Sometimes a bull or lamb is smaller than normal. Or it may not be perfectly formed. If someone wants to give that animal as a special gift to the Lord, it will be accepted. But it will not be accepted as payment for a special promise the person made."},{"num":24,"verse":"“‘An animal might have bruised, crushed, torn or cut sex glands. If it does, you must not offer that animal to the Lord in your own land. "},{"num":25,"verse":"You must not take such animals from foreigners as sacrifices to the Lord. This is because the animals have been hurt in some way. They have something wrong with them. They will not be accepted for you.’”"},{"num":26,"verse":"The Lord said to Moses, "},{"num":27,"verse":"“When an ox, a sheep or a goat is born, it must stay seven days with its mother. But from the eighth day on, this animal will be accepted as a sacrifice. It may be offered by fire to the Lord. "},{"num":28,"verse":"But you must not kill the animal and its mother on the same day. This rule is the same for an ox or a sheep."},{"num":29,"verse":"“You might want to offer some special offering of thanks to the Lord. But you must do it in a way that pleases the Lord. "},{"num":30,"verse":"You must eat the whole animal that same day. You must not leave any of the meat for the next morning. I am the Lord."},{"num":31,"verse":"“Remember my commands and obey them. I am the Lord. "},{"num":32,"verse":"Show respect for my holy name. You Israelites must remember that I am holy. I am the Lord. I have made you holy. "},{"num":33,"verse":"I brought you out of Egypt. I became your God. I am the Lord.”"}]