[[],[{"type":"prose","content":"Strengthen yourselves, sons of Benjamin, From the midst of Jerusalem, And in Tekoa blow ye a trumpet, And over Beth-Haccerem lift ye up a flame, For evil hath been seen from the north, And great destruction."}],[{"type":"prose","content":"The comely and the delicate one I have cut off, The daughter of Zion."}],[{"type":"prose","content":"Unto her come do shepherds and their droves, They have stricken tents by her round about, They have fed each [in] his own station."}],[{"type":"prose","content":"Sanctify ye against her the battle, Rise, and we go up at noon. Wo to us, for turned hath the day, For stretched out are the shades of evening,"}],[{"type":"prose","content":"`Rise, and we go up by night, And we destroy her palaces.'"}],[{"type":"prose","content":"For thus said Jehovah of Hosts: Cut down her wood, And pour out against Jerusalem a mount, She [is] the city to be inspected, Wholly -- she is oppression in her midst."}],[{"type":"prose","content":"As the digging of a well, is [for] its waters, So she hath digged [for] her wickedness, Violence and spoil is heard in her, Before My face continually [are] sickness and smiting."}],[{"type":"prose","content":"Be instructed, O Jerusalem, Lest My soul be alienated from thee, Lest I make thee a desolation, a land not inhabited."}],[{"type":"prose","content":"Thus said Jehovah of Hosts: They surely glean, as a vine, the remnant of Israel, Put back thy hand, as a gatherer to the baskets."}],[{"type":"prose","content":"To whom do I speak, and testify, and they hear? Lo, their ear [is] uncircumcised, And they are not able to attend. Lo, a word of Jehovah hath been to them for a reproach, They delight not in it."}],[{"type":"prose","content":"And with the fury of Jehovah I have been filled, (I have been weary of containing,) To pour [it] on the suckling in the street, And on the assembly of youths together, For even husband with wife are captured, An elder with one full of days,"}],[{"type":"prose","content":"And their houses have been turned to others, Fields and wives together, For I stretch out My hand against the inhabitants of the land, An affirmation of Jehovah."}],[{"type":"prose","content":"For from their least unto their greatest, Every one is gaining dishonest gain, And from prophet even unto priest, Every one is dealing falsely,"}],[{"type":"prose","content":"And they heal the breach of the daughter of my people slightly, Saying, `Peace, peace!' and there is no peace."}],[{"type":"prose","content":"They were ashamed when they did abomination! Yea, they are not at all ashamed, Yea, blushing they have not known, Therefore they do fall among those falling, In the time I have inspected them, They stumble, said Jehovah."}],[{"type":"prose","content":"Thus said Jehovah: Stand ye by the ways and see, and ask for paths of old, Where [is] this -- the good way? and go ye in it, And find rest for yourselves. And they say, `We do not go.'"}],[{"type":"prose","content":"And I have raised up for you watchmen, Attend ye to the voice of the trumpet. And they say, `We do not attend.'"}],[{"type":"prose","content":"Therefore hear, O nations, and know, O company, That which [is] upon them."}],[{"type":"prose","content":"Hear, O earth, lo, I am bringing evil on this people, The fruit of their devices, For to My words they gave no attention, And My law -- they kick against it."}],[{"type":"prose","content":"Why [is] this to Me? frankincense from Sheba cometh, And the sweet cane from a land afar off, Your burnt-offerings [are] not for acceptance, And your sacrifices have not been sweet to Me."}],[{"type":"prose","content":"Therefore thus said Jehovah: Lo, I do give to this people stumbling blocks, And stumbled against them have fathers and sons together, The neighbour and his friend do perish."}],[{"type":"prose","content":"Thus said Jehovah: Lo, a people hath come from a north country, And a great nation is stirred up from the sides of the earth."}],[{"type":"prose","content":"Bow and javelin they take hold of, Fierce it [is], and they have no mercy, Their voice as a sea doth sound, And on horses they ride, set in array as a man of war, Against thee, O daughter of Zion."}],[{"type":"prose","content":"`We have heard its sound, feeble have been our hands, Distress hath seized us, pain as of a travailing woman."}],[{"type":"prose","content":"Go not forth to the field, And in the way walk not, For a sword hath the enemy, fear [is] round about."}],[{"type":"prose","content":"O daughter of My people, Gird on sackcloth, and roll thyself in ashes, The mourning of an only one make for thee, A lamentation most bitter, For suddenly come doth the spoiler against us."}],[{"type":"prose","content":"A watch-tower I have given thee, Among My people a fortress, And thou knowest, and hast tried their way."}],[{"type":"prose","content":"All of them are turned aside by apostates, Walking slanderously -- brass and iron, All of them are corrupters."}],[{"type":"prose","content":"The bellows have been burnt, By fire hath the lead been consumed, In vain hath a refiner refined, And the wicked have not been drawn away."}],[{"type":"prose","content":"`Silver rejected,' they have called to them, For Jehovah hath kicked against them!"}]]