[{"header":"Asa Succeeds Abijah in Judah"},{"num":14,"verse":"So Abijah slept with his fathers [in death], and they buried him in the City of David; and Asa his son became king in his place. The land was at peace for ten years during his days."},{"num":2,"verse":"Asa did what was good and right in the sight of the Lord his God. "},{"num":3,"verse":"He removed the foreign altars and high places and tore down the [pagan] pillars (obelisks, memorial stones), and cut to pieces the Asherim [the symbols of the goddess Asherah]. "},{"num":4,"verse":"And he commanded Judah to seek the Lord God of their fathers [to inquire of and for Him and seek Him as a vital necessity], and to observe the law [given to Moses] and the commandment. "},{"num":5,"verse":"Asa also removed the [idolatrous] high places and the incense altars from all the cities of Judah. The kingdom was at rest and undisturbed under his reign. "},{"num":6,"verse":"He built fortified cities in Judah, since the land was at rest, and there was no one at war with him in those years, because the Lord had given him rest. "},{"num":7,"verse":"So he said to Judah, “Let us build these cities and surround them with walls, towers, gates and bars [to secure the doors]. The land is still ours because we have sought the Lord our God; we have sought Him [longing for Him with all our heart] and He has given us peace on every side.” So they built and prospered. "},{"num":8,"verse":"Now Asa had an army of 300,000 men from Judah, who carried large shields and spears, and 280,000 from Benjamin, who carried shields and drew bows, all courageous men."},{"num":9,"verse":"Now Zerah the Ethiopian (Cushite) came out against Judah with an army of a million men and three hundred chariots, and he came as far as Mareshah. "},{"num":10,"verse":"Then Asa went out against him, and they drew up in battle formation in the Valley of Zephathah at Mareshah. "},{"num":11,"verse":"Asa called out to the Lord his God, saying, “O Lord, there is no one besides You to help in the battle between the powerful and the weak; so help us, O Lord our God, for we trust in and rely on You, and in Your name we have come against this multitude. O Lord, You are our God; let not man prevail against You.” "},{"num":12,"verse":"So the Lord struck the Ethiopians [with defeat] before Asa and Judah, and the Ethiopians fled. "},{"num":13,"verse":"Asa and the people who were with him pursued them as far as Gerar; and so many Ethiopians fell that none of them were found alive; for they were destroyed before the Lord and His army. And they carried away a very large amount of spoil. "},{"num":14,"verse":"They attacked and destroyed all the cities around Gerar, for the dread of the Lord had fallen on them. They plundered all the cities, for there was a large amount of spoil in them. "},{"num":15,"verse":"They also struck down the people [living] in tents who had livestock, and took captive large numbers of sheep and camels. Then they returned to Jerusalem."}]