[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(11) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Heifer",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".—Translate, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ephraim is a trained heifer, which loves to thresh.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Here the idea may be that Ephraim loves the easy and free work of treading out the corn, and so becomes fat and sleek; or the act of treading and threshing may point to the rough treatment which Ephraim has in her pride dealt out to her neighbours and enemies. But the former interpretation is more probable. The verse should continue to read thus:—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And I passed by the fairness of her neck",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (to arrest her self-indulgence). ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I will harness Ephraim for riding",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e.,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " I will cause a rider, Assyria, to take possession of her, and she shall be bound in unwelcome toil to do the bidding of another.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Hosea 10:11",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 10:11",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Ephraim is a heifer that is taught — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that is teachable; and loveth to tread out the corn — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "In opposition to ploughing; that is, loves the booty not gained by its own labour; or to tread out, and freely eat of the corn which is not its own. The mouth of the ox which trod out the corn was not muzzled. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "But I passed over — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Or caused a yoke to pass over; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "her fair neck — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Laid a light yoke upon her. Ephraim being here compared to a heifer, every thing that is said about him is therefore expressed in the same way as if a heifer were really spoken of. The meaning, laying aside the figurative expression, is, that God imposed a law upon Ephraim, or the Israelites, to direct and govern them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Will make Ephraim to ride — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "It seems this should rather be rendered, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I will ride upon Ephraim, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "that is, I will be his ruler or director: those who had the management of oxen or heifers in those countries, used often to ride upon them. Thus Bishop Horsley: “This and the following clause give the image of a husbandman mounting his bullock to direct it over the corn.” ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Judah shall plough, and Jacob shall break his clods — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "By Jacob here is meant Israel, or the ten tribes, as separated from the two tribes of Judah and Benjamin; and the clause seems to signify that the kingdom of Judah should be superior to that of Israel. Or, the general sense of the verse may be, that the descendants of Jacob should be employed in servile offices by their enemies. Bishop Horsley interprets this difficult passage differently, thus: “The first three clauses of this verse express what had been done for the instruction of Ephraim by the Mosaic institution. The last two predict the final conversion of the Ephraimites, with the rest of the people, and their restoration to a condition of national splendour and prosperity. As if he had said, Notwithstanding the judgments that are to fall upon Ephraim, he was long under the training of my holy law; and the effect of that early discipline shall not be ultimately lost. I will, in the end, bring Ephraim to obedience. Judah shall be diligent in the works I prepare for him; and the whole race of Jacob shall take part in the same labours of the spiritual field, with profit and advantage to themselves.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10:9-15 Because God does not desire the death and ruin of sinners, therefore in mercy he desires their chastisement. The children of iniquity still remained in Israel. The enemies would be gathered against them. It is just with God to make those know what hardships mean, who indulge themselves in ease and pleasure. Let them cleanse their hearts from all corrupt affections and lusts, and be a broken and contrite spirit. Let them abound in works of piety towards God, and of justice and charity towards one another: herein let them sow to the Spirit. Seeking the Lord is to be every day's work, but there are special occasions when to seek him. Christ shall come as the Lord our righteousness, and grant us of it abundantly. If we sow in righteousness, we shall reap according to mercy; a reward not of debt, but of grace. Even the gains of sin yield the sinner no satisfaction. As our comforts, so our confidences in the service of sin will certainly fail us. Come and seek the Lord, and thy hope in him shall not deceive thee. See what cruel work war makes. Whatever mischief is done, it is sin that does it. What miseries men's sins bring on them, even in this world!",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Ephraim is an heifer that is taught and that loveth to tread out the corn - The object of the metaphor in these three verses seems to be, to picture, under operations of husbandry, what God willed and trained His people to do, how they took as much pains in evil, as He willed them to do for good. One thing only they did \"which\" He willed, but not because He willed it - what pleased themselves. Corn was threshed in the East chiefly by means of oxen, who were either driven round and round, so as to trample it out with their feet, or drew a cylinder armed with iron, or harrow-shaped planks, set with sharp stones which at the same time cut up the straw for provender. The treading out the grain was an easy and luxurious service, since God had forbidden to \"muzzle the ox\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 25:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", while doing it. It pictures then the sweet gentle ways by which God wins us to His service. Israel would serve thus far, for she liked the service, \"she was accustomed\" to it, and \"she loved it,\" but she would do no more. \"She waxed fat and kicked\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": ": \"The heifer when accustomed to the labor of treading out the corn, mostly, even unconstrained, returns to the same labor. So the mind of the ungodly, devoted to the slaveries of this world, and accustomed to the fatigues of temporal things, even if it may have leisure for itself, hastens to subject itself to earthly toils, and, inured to its miserable conversation, seeks the renewal of toil, and will not, though it may, cease from the yoke of this world's slavery. This yoke our Lord would remove from the necks of His disciples, saying, \"Take heed, lest at any time your hearts be overcharged with cares of this life, and that day come upon you unawares\" Luke 21:34. And again, \"Come unto Me, all ye who labor and are heavy laden, and I will refresh you. Take My yoke upon you.\" : \"Some, in order to appear somewhat in this world, overload themselves with earthly toils, and although, amid their labors, they feel their strength fail, yet, overcome by love of earthly things, they delight in their fatigue. To these it is said by the prophet, \"Ephraim is a heifer taught and loving to tread out the corn.\" They ask that they may be oppressed; in rest, they deem that they have lighted unto a great peril.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": ": \"The heifer when accustomed to the labor of treading out the corn, mostly, even unconstrained, returns to the same labor. So the mind of the ungodly, devoted to the slaveries of this world, and accustomed to the fatigues of temporal things, even if it may have leisure for itself, hastens to subject itself to earthly toils, and, inured to its miserable conversation, seeks the renewal of toil, and will not, though it may, cease from the yoke of this world's slavery. This yoke our Lord would remove from the necks of His disciples, saying, \"Take heed, lest at any time your hearts be overcharged with cares of this life, and that day come upon you unawares\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 21:34",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". And again, \"Come unto Me, all ye who labor and are heavy laden, and I will refresh you. Take My yoke upon you.\" : \"Some, in order to appear somewhat in this world, overload themselves with earthly toils, and although, amid their labors, they feel their strength fail, yet, overcome by love of earthly things, they delight in their fatigue. To these it is said by the prophet, \"Ephraim is a heifer taught and loving to tread out the corn.\" They ask that they may be oppressed; in rest, they deem that they have lighted unto a great peril.\"",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And I passed over her fair neck - handling her gently and tenderly, as men put the yoke gently on a young untamed animal, and inure it softly to take the yoke upon it. Yet \"to pass over\" , especially when it is said of God, always signifies inflictions and troubles.\" To pass over sins, is to remit them; to pass over the sinner, is to punish him. \"I will make Ephraim to ride or I will make it,\" i. e., the yoke, \"to ride on Ephraim's\" neck, as the same word is used for \"place the hand on the bow;\" or, perhaps better, \"I will set a rider on Ephraim,\" who should tame and subdue him. Since he would not submit himself freely to the easy yoke of God, God would set a ruler upon him, who should be his master. Thus, the Psalmist complains, \"Thou hast made men to ride on our head\" Psalm 66:12, directing us at their pleasure.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And I passed over her fair neck - handling her gently and tenderly, as men put the yoke gently on a young untamed animal, and inure it softly to take the yoke upon it. Yet \"to pass over\" , especially when it is said of God, always signifies inflictions and troubles.\" To pass over sins, is to remit them; to pass over the sinner, is to punish him. \"I will make Ephraim to ride or I will make it,\" i. e., the yoke, \"to ride on Ephraim's\" neck, as the same word is used for \"place the hand on the bow;\" or, perhaps better, \"I will set a rider on Ephraim,\" who should tame and subdue him. Since he would not submit himself freely to the easy yoke of God, God would set a ruler upon him, who should be his master. Thus, the Psalmist complains, \"Thou hast made men to ride on our head\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 66:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", directing us at their pleasure.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": ": \"'The beauty of the neck' designates those who sin and take pleasure in their sins. That passing over or ascending, said both in the past and the future, 'I passed, I will make to ride,' signifies that what He purposes is most certain. It expresses that same vengeance as, 'Ye are a stiffnecked people; I will come up into the midst of thee in a moment, and cosume thee' Exodus 33:5. The 'beauty' of the 'neck' here is the same as the ornament there, when the Lord says, 'therefore now put off thy ornaments from thee, that I may know what to do unto thee.' As long as the sinner goes adorned, i. e., is proud in his sins, as long as he stiffens his fair neck, self-complacent, taking pleasure in the ills which he has done, God, in a measure, knows not what to do to him; mercy knows not how, apart from the severity of judgment, to approach him; and so after the sentence of the judge, 'thou art a stiffnecked people, etc.' He gives the counsel 'put off thine ornaments etc.' i. e., humble thyself in penitence, that I may have mercy upon thee.\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": ": \"'The beauty of the neck' designates those who sin and take pleasure in their sins. That passing over or ascending, said both in the past and the future, 'I passed, I will make to ride,' signifies that what He purposes is most certain. It expresses that same vengeance as, 'Ye are a stiffnecked people; I will come up into the midst of thee in a moment, and cosume thee' ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 33:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The 'beauty' of the 'neck' here is the same as the ornament there, when the Lord says, 'therefore now put off thy ornaments from thee, that I may know what to do unto thee.' As long as the sinner goes adorned, i. e., is proud in his sins, as long as he stiffens his fair neck, self-complacent, taking pleasure in the ills which he has done, God, in a measure, knows not what to do to him; mercy knows not how, apart from the severity of judgment, to approach him; and so after the sentence of the judge, 'thou art a stiffnecked people, etc.' He gives the counsel 'put off thine ornaments etc.' i. e., humble thyself in penitence, that I may have mercy upon thee.\"",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Judah shall plow, Jacob shall break his clods - In the will of God, Judah and Israel were to unite in His service, Judah first, Jacob, after him, breaking the clods, which would hinder the seed from shooting up. Judah being mentioned in the same incidental way, as elsewhere by Hosea, it may be, that he would speak of what should follow on Ephraim's chastisement. : \"When they shall see this, the two tribes shall no longer employ themselves in treading out the grain, but shall plow. To \"tread out the corn\" is to act \"in hope of present gain; to \"plow,\" is to labor in that, which has no instant fruit, but promiseth it hereafter, i. e., the fulfillment of God's commands.\" \"Jacob\" will then be the remnant of the ten tribes, who, at Hezekiah's invitation, out of Ephraim, Manasseh, Issachar, Asher, and Zebulun, joined in celebrating the passover at Jerusalem, and subsequently in destroying idolatry 2 Chronicles 30; 31. Hosea had already foretold that Judah and Israel shall be \"gathered together,\" under \"one Head\" Hosea 1:11. Here, again, he unites them in one, preparing His way first in themselves, then, in others. Judah is placed first, for to him was the promise in his forefather, the patriarch, and then in David. Ephraim was to be partaker of his blessings, by being united to him. The image of the heifer has been dropped. He had spoken of them as farmers; as such he addresses them. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Judah shall plow, Jacob shall break his clods - In the will of God, Judah and Israel were to unite in His service, Judah first, Jacob, after him, breaking the clods, which would hinder the seed from shooting up. Judah being mentioned in the same incidental way, as elsewhere by Hosea, it may be, that he would speak of what should follow on Ephraim's chastisement. : \"When they shall see this, the two tribes shall no longer employ themselves in treading out the grain, but shall plow. To \"tread out the corn\" is to act \"in hope of present gain; to \"plow,\" is to labor in that, which has no instant fruit, but promiseth it hereafter, i. e., the fulfillment of God's commands.\" \"Jacob\" will then be the remnant of the ten tribes, who, at Hezekiah's invitation, out of Ephraim, Manasseh, Issachar, Asher, and Zebulun, joined in celebrating the passover at Jerusalem, and subsequently in destroying idolatry ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 30",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; 31. Hosea had already foretold that Judah and Israel shall be \"gathered together,\" under \"one Head\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hosea 1:11",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Here, again, he unites them in one, preparing His way first in themselves, then, in others. Judah is placed first, for to him was the promise in his forefather, the patriarch, and then in David. Ephraim was to be partaker of his blessings, by being united to him. The image of the heifer has been dropped. He had spoken of them as farmers; as such he addresses them. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11. taught—that is, accustomed.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "loveth to tread out … corn—a far easier and more self-indulgent work than ploughing. In treading corn, cattle were not bound together under a yoke, but either trod it singly with their feet, or drew a threshing sledge over it (Isa 28:27, 28): they were free to eat some of the corn from time to time, as the law required they should be unmuzzled (De 25:4), so that they grew fat in this work. An image of Israel's freedom, prosperity, and self-indulgence heretofore. But now God will put the Assyrian yoke upon her, instead of freedom, putting her to servile work.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I passed over upon—I put the yoke upon.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "make … to ride—as in Job 30:22; that is, hurry Ephraim away to a distant region [Calvin]. Lyra translates, \"I will make (the Assyrian) to ride upon Ephraim.\" Maurer, \"I will make Ephraim to carry,\" namely, a charioteer.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "his clods—\"the clods before him.\"",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "As an heifer; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " a young and wanton heifer, unaccustomed to the yoke, not used to hard labour. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Taught; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " used to, and so skilled in or acquainted with. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Loveth to tread out the corn:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " what we do by thrashing, the Jews did by these heifers or oxen, tread out the corn, and in doing this the law provided that the ox should not be muzzled, but should eat what it would: so it was with Ephraim, he loved that work that was so pleasant, which so well fed him. And God doth let Ephraim know that he had been very much indulged herein: God had given them all abundance and prosperity, and with little labour or care; and he expected thankfulness for it; but no such thing was done by Ephraim, he grew more insolent, untractable, and perfidious. When I found it so, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I passed over upon her fair neck, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " laid some lighter yoke upon her, brought some gentler afflictions upon that people, to tame them, and make them serviceable; but this hath not prevailed. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I will make Ephraim to ride; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " I will now deal more rigorously, I will try another course, and as horses are brought to work by one that can bring them to bear and carry the rider, so I will deal with Ephraim; I will ride on Ephraim, and tame him, i.e. by the Assyrians, who should subdue and enslave them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Judah shall plough; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Judah, though less sinful, hath been used to harder labour, and more rugged treatment, hath ploughed when Ephraim hath reaped, yet I have spared Ephraim more. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Jacob shall break his clods; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the same in other proverbial speech repeated; their work is at present harder, but there is a harvest follows; though Judah plough, and Jacob break his clods, labour hard, and for their sins suffer, yet they sow in tears when harassed by Ephraim or going into Babylon, and shall reap in joy at the return. But Ephraim, who abused all my bounty and kindness, who worked only for his own profit, shall be more severely punished, and when he goeth forth shall return no more. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Ephraim is as an heifer that is taught, and loveth to tread out the corn,.... Like a heifer taught to bear the yoke, and to plough; but learned it not, as the Targum; does not like it; chooses to tread out the corn where it can feed upon it, its mouth not being then muzzled, according to the law; oxen or heifers were used both in ploughing and treading out corn, to which the allusion is. The sense is, that Ephraim or the ten tribes were taught to bear the yoke of the law, and yield obedience to it, and perform good works; but did not like such a course of life; had no further regard for religion than as they found their own worldly profit and advantage in it: or they did not care to labour much in it; they liked the fruit and advantage arising from working, rather than the work itself; and thus, like a heifer, doing little, and living well, they grew fat, increased in power, wealth, and riches; and so became proud and haughty, and kicked against the house of David, and rent themselves from it; and set up a kingdom of their own, and lived and reigned according to their own will and pleasure, like a heifer without yoke and muzzle: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "but I passed over upon her fair neck; or, \"the goodness of her neck\" (c); which is expressive of the flourishing and opulent state and condition of the ten tribes, especially in the times of Jeroboam the second, which made them proud and haughty: but the Lord was determined to humble them, and first in a more light and gentle manner; or caused the rod of correction to pass over them more lightly; or put upon them a more easy yoke of affliction, by causing Pul king of Assyria to come against them; and to get rid of whom a present was given him, exacted of the people; and afterwards Tiglathpileser, another king of Assyria, who carried captive part of their land; and this not having its proper effect, the Lord was determined to proceed against them in a heavier manner: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "I will make Ephraim to ride; some, taking the future for the past, render it, \"I have made Ephraim to ride\" (d); that is, to rule and govern, having royal dignity and power given them, and that greater than that of Judah; and ride over the tribes of Judah and Benjamin, who were sometimes very much afflicted by them; and this is thought to be the sense of the following phrases, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Judah shall plough, and Jacob shall break his clods; or, \"break the clods for him\" (e); for Ephraim while he rides, and uses them very hard; as in the days of Joash and Pekah, kings of Israel, when many of the tribes of Judah were slain by them, 2 Kings 14:12; but rather the meaning is, \"I will cause to ride on Ephraim\" (f); that is, the Assyrians shall ride upon them, get the dominion over them, carry them captive, and use them to hard service and bondage, as a heifer rid upon by a severe rider while ploughing; and the other tribes shall not escape, though they shall not be so hardly dealt with: \"Judah shall plough, and Jacob shall break his clods\"; these shall be carried captive into Babylon, and employed in hard and servile work, but more tolerable; as ploughing and breaking clods are easier than to ride upon; and as they had hope of deliverance at the end of seventy years; whereas no promise of return was made to the ten tribes, which is the sense some give; but Pocock and others think that these words regard the tender and gentle methods God took with these people to bring them to obedience to his law. Ephraim being teachable like a heifer, he took hold of her fair neck, and stroked it to encourage her, and accustom her to the hand, and to the yoke; and then put the yoke of his law upon them, add trained them up in his institutions, and used also gentle methods to keep them in obedience; and also set Judah to \"plough\", and Jacob to \"break the clods\", prescribed for them; and employed them in good works, in the duties of religion, from whence answerable fruit might have been expected; saying to them, by his prophets, as follows: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Judah shall plough, and Jacob shall break his clods; or, \"break the clods for him\" (e); for Ephraim while he rides, and uses them very hard; as in the days of Joash and Pekah, kings of Israel, when many of the tribes of Judah were slain by them, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 14:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; but rather the meaning is, \"I will cause to ride on Ephraim\" (f); that is, the Assyrians shall ride upon them, get the dominion over them, carry them captive, and use them to hard service and bondage, as a heifer rid upon by a severe rider while ploughing; and the other tribes shall not escape, though they shall not be so hardly dealt with: \"Judah shall plough, and Jacob shall break his clods\"; these shall be carried captive into Babylon, and employed in hard and servile work, but more tolerable; as ploughing and breaking clods are easier than to ride upon; and as they had hope of deliverance at the end of seventy years; whereas no promise of return was made to the ten tribes, which is the sense some give; but Pocock and others think that these words regard the tender and gentle methods God took with these people to bring them to obedience to his law. Ephraim being teachable like a heifer, he took hold of her fair neck, and stroked it to encourage her, and accustom her to the hand, and to the yoke; and then put the yoke of his law upon them, add trained them up in his institutions, and used also gentle methods to keep them in obedience; and also set Judah to \"plough\", and Jacob to \"break the clods\", prescribed for them; and employed them in good works, in the duties of religion, from whence answerable fruit might have been expected; saying to them, by his prophets, as follows: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(c)   \"super bonitatem cervicis ejus\", Montanus; \"super bonitatem colli ipsius\", Schmidt; \"super praestantiam\", Junius & Tremellius, Piscator. (d) \"equitare feci\", Munster, Rivet. (e)  \"occabit ei\", De Dieu; \"occabit illi?\" Schmidt. (f) \"Equitare faciam in Ephraim\", Lyra, Tarnovius; \"equitare faciam super Ephraim\", so some in Calvin. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(c)   \"super bonitatem cervicis ejus\", Montanus; \"super bonitatem colli ipsius\", Schmidt; \"super praestantiam\", Junius & Tremellius, Piscator. (d) \"equitare feci\", Munster, Rivet. (e)  \"occabit ei\", De Dieu; \"occabit illi?\" Schmidt. (f) \"Equitare faciam in Ephraim\", Lyra, Tarnovius; \"equitare faciam super Ephraim\", so some in Calvin. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Ephraim is as an heifer that is taught, and loveth to {p} tread out the corn; but I passed over upon her {q} fair neck: I will make Ephraim to ride; Judah shall plow, and Jacob shall break his clods.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And Ephraim ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "is as",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " an heifer ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "that is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " taught, ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "and",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " loveth to ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{p}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " tread out ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "the corn",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; but I passed over upon her ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{q}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " fair neck: I will make Ephraim to ride; Judah shall plow, ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "and",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " Jacob shall break his clods.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(p) In which is pleasure, whereas in plowing there is labour and pain.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(q) I will lay my yoke upon her fat neck.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And Ephraim",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", &c.] Rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ephraim indeed is a heifer broken in and loving to thresh, and I have spared the beauty of her neck; (but now) will I make Ephraim to draw.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Israel’s punishment is enhanced by contrast with her former prosperity, which, as a mark of the Divine goodness, is compared to the consideration with which a young heifer is treated by its master. The work of treading out the corn was pleasant and easy; the heifer could eat freely as it walked without a muzzle round and round the threshing-floor (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 25:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). But this heifer, that is, Israel, has abused the kindness of its Lord (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and henceforth shall be put to the heavy labour of the field—a figure for the depressing conditions of life under a foreign master. The rendering ‘spared’ (literally, ‘passed by’) is justified by ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 7:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Proverbs 19:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; it adds a beautiful distinctness to the figure, for the heavy yokes used in the East not only gall the necks of the animals, but often produce deep wounds. The meaning is that Jehovah has hitherto preserved his people from the yoke of captivity; compare the different applications of the same figure in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 11:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ‘Make to draw’; lit. ‘make to ride’, but ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "râkab",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as the usage of the cognate word in Arabic shows, can have various secondary meanings. [Space forbids a record of all the explanations of this passage; none is so simple as that of Buhl given above. The objection that to ‘pass by’ is elsewhere used with reference to transgression is not conclusive; the idiom is just as applicable in the present case. There is good authority, however, for the rendering or paraphrase, ‘I mounted upon her fair neck’, though why the ‘beauty’ of the neck should be mentioned, is not clear.]",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Judah shall plow",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Judah, then, is also a ‘stubborn heifer’, and cannot be exempted from her sister’s punishment.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 11.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And Ephraim is as an heifer that is taught, and loveth to tread out the corn.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Ephraim is compared to a heifer trained. The work she was taught to do was treading cut the corn; by training and habit it had became a second nature, so that she took delight in it. The connecting vowel occurs seldom, and usually with an antique coloring in prose, according to Ewald; it is poetical besides, and used in the concourse of words somewhat closely connected, but not in the strict construct state. Thus is ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "לֺאהַבֵתִּי",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " accounted for. This work was probably easier, at all events pleasanter, than plowing or harrowing. In treading out corn oxen were not yoked together, but worked singly, treading it with their feet, or drawing a threshing-sledge, or iron-armed cylinder, over it; they were unmuzzled also, so that they were free to snatch an occasional mouthful of the grain, and frequently fattened by such indulgence. Such had been the position of Ephraim in easy employment, comfortable circumstances like the heifer threshing and allowed to eat at pleasure, pleasantly situated prosperous, self-indulgent, and luxurious. The victories of Ephraim - threshing and treading down may perhaps be also hinted at. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "But I passed over upon her fair neck",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (margin, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "the beauty of her neck",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "): ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "I will make Ephraim to ride; Judak shall plough, and Jacob shall break his clods.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Times have changed, as is here indicated a yoke, that of Assyria, is placed on the fair neck, a rider is set on the sleek back. Mere onerous and less pleasant labor is now imposed. Judah too is to share the toil, being put to the heavier work of plowing while Jacob - the ten tribes, or the twelve including both Judah and Israel - shall cross plough; and thus both alike shall be henceforth employed in the heaviest labors of the field and the severest toils of agriculture. Once victorious, Ephraim is now to be subdued; once free and intractable, it must now receive the yoke and engage in laborious service. The expression ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "עבר",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", followed by ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "על",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", is generally used in a bad sense; \"to ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "pass over",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",\" says Jerome, \"especially when it is said of God, always signifies inflictions and troubles.\" The fatness of the neck is the ox's ornament or beauty. That is now to be assaulted or invaded gently it may be, and softly, as men are wont to approach a young untamed animal in order to put the yoke upon it. This passing over, however tender, fixes the yoke on Ephraim's neck all the same. A more difficult word is ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "אדכיב",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which Ewald ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(1)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " renders, \"I will set a rider\" on Ephraim, of course to subdue and tame; ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(2)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Jerome has, \"I will mount or ride,\" thus representing Jehovah himself as the mediate rider on Ephraim. The first sense has a parallel in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 56:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"Thou hast made men to ride over our head,\" and thus ruling them at pleasure. Unwilling to bear the easy yoke of their Divine Ruler, they shall be subjected to the tyrant mastery of man. But ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "note_emph",
        "text": "(3)",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Keil says the word here is \"not\" to mount or ride, 'but' to drive or use for drawing and driving,' ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e. to",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " harness,\" as to the plough and harrow. This meaning is best reached by understanding the words thus: \"I will make the yoke to ride on Ephraim's neck;\" as ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "הרכב",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is used in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 13:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", for \"put thine hand upon the bow,\" margin, \"make thine hand to ride upon the bow.\" The remaining clauses of the verse is a further development of this expression, but extending to Judah; and thus including both Judah and Ephraim, or Jacob - both kingdoms. The Septuagint version of the last clause is peculiar; it is ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "Παρασιωπήσομαι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "Ἰούδαν ἐνισχύσει αὐτῷ Ἰακώβ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". That is, as explained by Jerome, \"I shall leave Judah for the present and say nothing about him; but whoever, whether of Ephraim or Judah, shall observe my precepts, he shall acquire strength for himself and be called Jacob.\" Hosea 10:11",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "In the next verse the punishment is still further defined, and also extended to Judah. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 10:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"And Ephraim is an instructed cow, which loves to thresh; and I, I have come over the beauty of her neck: I yoke Ephraim; Judah will plough, Jacob harrow itself.\" Melummâdâh, instructed, trained to work, received its more precise definition from the words \"loving to thresh\" ('ōhabhtı̄, a participle with the connecting Yod in the constructive: see Ewald, 211, b), not as being easier work in comparison with the hard task of driving, ploughing, and harrowing, but because in threshing the ox was allowed to eat at pleasure (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 25:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), from which Israel became fat and strong (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 32:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Threshing, therefore, is a figurative representation not of the conquest of other nations (as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Micah 4:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 41:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), but of pleasant, productive, profitable labour. Israel had accustomed itself to this, from the fact that God had bestowed His blessing upon it (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 13:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). But it would be different now. עברתּי על, a prophetic perfect: I come over the neck, used in a hostile sense, and answering to our \"rushing in upon a person.\" The actual idea is that of putting a heavy yoke upon the neck, not of putting a rider upon it. ארכּיב not to mount or ride, but to drive, or use for drawing and driving, i.e., to harness, and that, as the following clauses show, to the plough and harrow, for the performance of hard field-labour, which figuratively represents subjugation and bondage. Judah is also mentioned here again, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 8:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 6:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc. Jacob, in connection with Judah, is not a name for the whole nation (or the twelve tribes), but is synonymous with Ephraim, i.e., Israel of the ten tribes. This is required by the correspondence between the last two clauses, which are simply a further development of the expression ארכיב אף, with an extension of the punishment threatened against Ephraim to Judah also. ",
        "children": []
      }
    ]
  }
]