[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(30) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Behold, two blind men sitting.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Two difficulties present themselves on comparing this narrative with the accounts of the same or a similar event in St. Mark and St. Luke. (1.) The former agrees with St. Matthew as to time and place, but speaks of ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "one",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " blind man only, and gives his name as “Bartimseus, the son of Timaeus.” (2.) The latter speaks of one only, and fixes the time of the miracle at our Lord’s entry into Jericho. The probable explanation of (1) is, that of the two men, the one whom St. Mark names was the more conspicuous and better known, and of (2), that St. Luke, visiting the scene and having the spot pointed out to him outside the gates of the city, was left to conjecture, or was misinformed, as to the work having been done when our Lord drew nigh unto it. The fact that St. Luke alone records the incident connected with Zacchæus (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 19:1-10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") indicates either that he had been on the spot as an inquirer, or had sought for local sources of information. The assumption that he recorded a different miracle from St. Matthew and St. Mark is possible, but hardly probable, and certainly needless, except on a very rigid and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a priori",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " theory of inspiration. It is possible, again, that St. Luke’s local inquiries may have made his narrative more accurate than the recollection on which St. Matthew’s and St. Mark’s rested.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "O Lord, thou son of David.—The blind men probably echoed the whispered murmurs of the crowd that was sweeping by, or, in any case, used (as did the woman of Canaan, Matthew 15:22) the most popular and widely diffused of the names of the Messiah. They were beggars, and they appealed to the pity of the King.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "O Lord, thou son of David.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The blind men probably echoed the whispered murmurs of the crowd that was sweeping by, or, in any case, used (as did the woman of Canaan, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 15:22",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") the most popular and widely diffused of the names of the Messiah. They were beggars, and they appealed to the pity of the King.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "20:29-34 It is good for those under the same trial, or infirmity of body or mind, to join in prayer to God for relief, that they may quicken and encourage one another. There is mercy enough in Christ for all that ask. They were earnest in prayer. They cried out as men in earnest. Cold desires beg denials. They were humble in prayer, casting themselves upon, and referring themselves cheerfully to, the Mediator's mercy. They showed faith in prayer, by the title they gave to Christ. Surely it was by the Holy Ghost that they called Jesus, Lord. They persevered in prayer. When they were in pursuit of such mercy, it was no time for timidity or hesitation: they cried earnestly. Christ encouraged them. The wants and burdens of the body we are soon sensible of, and can readily relate. Oh that we did as feelingly complain of our spiritual maladies, especially our spiritual blindness! Many are spiritually blind, yet say they see. Jesus cured these blind men; and when they had received sight, they followed him. None follow Christ blindly. He first by his grace opens men's eyes, and so draws their hearts after him. These miracles are our call to Jesus; may we hear it, and make it our daily prayer to grow in grace and in the knowledge of the Lord and Saviour Jesus Christ.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Two blind men - Mark and Luke mention but one.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "They do not say, however, that there was no more than one. They mention one because he was probably well known; perhaps the son of a distinguished citizen reduced to poverty. His name was Bartimeus. Bar is a Syriac word, meaning \"son;\" and the name means, therefore, \"the son of Timeus.\" Probably \"Timeus\" was a man of distinction; and as the case of his son attracted most attention, Mark and Luke recorded it particularly. If they had said that there was only one healed, there would have been a contradiction. As it is, there is no more contradiction or difficulty than there is in the fact that the evangelists, like all other historians, often omit many facts which they do not choose to record.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Heard that Jesus passed by - They learned who he was by inquiring. They heard a noise, and asked who it was (Luke). They had doubtless heard much of his fame, but had never before been where he was, and probably would not be again. They were therefore more earnest in calling upon him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Son of David - That is, \"Messiah,\" or \"Christ.\" This was the name by which the Messiah was commonly known. He was the illustrious descendant of David in whom the promises especially centered, Psalm 132:11-12; Psalm 89:3-4. It was the universal opinion of the Jews that the Messiah was to be the descendant of David. See Matthew 22:42. On the use of the word son, see the notes at Matthew 1:1.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Son of David - That is, \"Messiah,\" or \"Christ.\" This was the name by which the Messiah was commonly known. He was the illustrious descendant of David in whom the promises especially centered, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 132:11-12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 89:3-4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". It was the universal opinion of the Jews that the Messiah was to be the descendant of David. See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 22:42",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". On the use of the word son, see the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 1:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Mt 20:29-34. Two Blind Men Healed. ( = Mr 10:46-52; Lu 18:35-43).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "For the exposition, see on [1332]Lu 18:35-43.   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole on \"Matthew 20:34\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole on \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 20:34",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And behold, two blind men,.... Mark and Luke make mention but of one; which is no contradiction to Matthew; for they neither of them say that there was but one. A greater difficulty occurs in Luke's account; for whereas Matthew and Mark both agree, that it was when Jesus came out of Jericho, that this cure was wrought, Luke says it was \"when he came nigh unto it\"; which some reconcile by observing, that that phrase may be rendered, \"while he was near Jericho\"; and so only signifies his distance from it, and not motion to it; but this will not solve the difficulty, because we after read of his entrance into it, and passing through it. Some therefore have thought, that Christ met with, and cured one blind man before he entered the city, and another when he came out of it and that Matthew has put the history of both together: but to me it seems, that there were three blind men cured; one before he went into Jericho, which Luke only relates, and two as he came out of Jericho, which Matthew here speaks of; and one of which, according to Mark, was by name Bartimaeus, the son of Timaeus; for so Bartimaeus signifies. Tima, or Timaeus, was a name in use among the Jews: we often read of R. Judah , Ben Tima (k), the son of Tima, or Timaeus. Origen (l) thinks, he had his name from the Greek word  which signifies \"honour\"; and so  \"Time\", with the Jews, is used for honour and profit (m). This man's father might have been a very honourable and useful man, though the son was fallen into poverty and distress, through blindness; for which reason he may be mentioned, as being a person well known to the Jews. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Sitting by the wayside; Mark says, \"begging\", where such were wont to sit, in order to ask alms of persons, as they passed by; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "when they heard that Jesus passed by; who, upon perceiving that there was an unusual concourse of people, might ask the reason of it, when it was told them that Jesus of Nazareth was coming that way: or, without asking, they might hear the people speak of him; and inasmuch as they had heard many things concerning him, and the miracles he wrought, applied to him for help, and ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "cried out, saying, have mercy on us, O Lord, thou son of David: in which may be observed the titles of honour they give him, which declare their faith in him; calling him Lord, expressing their sense of his deity, dominion, and power; and \"Son of David\", thereby owning and professing him to be the Messiah, that being a common name of him, well known among the Jews; See Gill on Matthew 1:1, the petition they make is, that he would \"have mercy on them\", who, through blindness, were in a poor, helpless, and miserable condition; and this was made with great vehemency: they \"cried\" out aloud, that he might hear them, and take pity on them; being eagerly desirous of having their sight, and firmly believing that he was able to restore it to them. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "cried out, saying, have mercy on us, O Lord, thou son of David: in which may be observed the titles of honour they give him, which declare their faith in him; calling him Lord, expressing their sense of his deity, dominion, and power; and \"Son of David\", thereby owning and professing him to be the Messiah, that being a common name of him, well known among the Jews; See Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 1:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", the petition they make is, that he would \"have mercy on them\", who, through blindness, were in a poor, helpless, and miserable condition; and this was made with great vehemency: they \"cried\" out aloud, that he might hear them, and take pity on them; being eagerly desirous of having their sight, and firmly believing that he was able to restore it to them. ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(k) T. Hieros. Nazir, fol. 52. 1. Erubin, fol. 19. 4. T. Bab. Gittin, fol. 84. 1. Bava Metzig, fol. 94. 1. Massech. Semachot, c. 9. Juchasin, fol. 159. 2.((l) Comment. in Matt. vol. 1. p. 428. Ed. Huet. (m) Targum in Esther 3.8. & v. 13. T. Hicros. Peah, fol. 15. 4. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(k) T. Hieros. Nazir, fol. 52. 1. Erubin, fol. 19. 4. T. Bab. Gittin, fol. 84. 1. Bava Metzig, fol. 94. 1. Massech. Semachot, c. 9. Juchasin, fol. 159. 2.((l) Comment. in Matt. vol. 1. p. 428. Ed. Huet. (m) Targum in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Esther 3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".8. & v. 13. T. Hicros. Peah, fol. 15. 4. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And, behold, two blind men sitting by the way side, when they heard that Jesus passed by, cried out, saying, Have mercy on us, O Lord, thou son of David.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 20:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀκούσαντες",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc. Luke explains that the blind man learnt that Jesus was passing in answer to inquiry suggested by the noise of a crowd. He knew who Jesus was: the fame of Jesus the Nazarene (Mk. and Lk.), the great Healer, had reached his ear.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "υἱὸς Δ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".: popular Messianic title (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 9:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 15:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 20:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Δύο",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "two",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") St Mark (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 10:46",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") mentions only one, Bartimaeus, the most distinguished”[897] as St Matthew in the next chapter mentions both the ass and the colt, St Mark only the colt which was actually employed by our Lord; as St Luke (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 24:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") the two angels who appeared, St Matthew and St Mark, the one who spoke.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[897] The same one is meant also in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 18:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", that Evangelist having had occasion to transpose the order of the narration, owing to the fact that one of the two blind men made acquaintance with the Divine Physician on the way, when Jesus was entering Jericho. In the meantime, whilst the Saviour was dining or rather passing the night with Zaccheus, the other of the two blind men, whom Matthew adds to the former one, joined Bartimaeus.—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Harm.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", pp. 434, 435.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 30.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Two blind men.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " St. Matthew is doubtless accurate in this statement. Tradition might easily drop one of the sufferers in the course of time, but it is not likely to have multiplied one into two. These sufferers had heard of the miracles of healing performed by Jesus in his various circuits, and especially of the late cure at Jerusalem of one born blind, and they were ready to believe in his power and to profit by his mercy. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Heard",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The beggars (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 10:46",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), debarred from sight, had their attention aroused by the tread of numerous feet, and the voices of the excited crowd, and naturally asked the bystanders to tell them what it all meant. When they heard that Jesus was there, the hope of relief immediately rushed into their mind. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Have mercy on us, O Lord, thou Son of David!",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " \"O Lord\" is only the usual respectful address of an inferior to one in higher station; but to call on Jesus as \"Son of David\" was virtually to acknowledge him to be the Messiah, who, as old prophets foretold, was to open the eyes of the blind (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 29:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 35:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The same cry had been raised by the blind men who were cured earlier in the ministry (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 9:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and by the Syro-Phoenician woman (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 15:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", where see note), How these men had learned the truth we know not; they could not see or read for themselves; their faith must have come by hearing, and the inward illumination of the Holy Spirit. Matthew 20:30",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "That Jesus passed by (ὅτι Ἰησοῦς παράγει)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The ὅτι is equivalent to quotation marks. They heard the crowd cry Jesus, is passing! ",
        "children": []
      }
    ]
  }
]