[{"num":17,"verse":"This was the territory chosen by lot for the tribe of M’nasheh, for he was the firstborn of Yosef. As for Makhir the firstborn of M’nasheh, the father of Gil‘ad, because he was a warrior he got Gil‘ad and Bashan. "},{"num":2,"verse":"So the lot was drawn for the other descendants of M’nasheh according to their families — for the descendants of Avi‘ezer, Helek, Asri’el, Sh’khem, Hefer and Sh’mida; these were the male descendants of M’nasheh according to their families."},{"num":3,"verse":"But Tz’lof’chad the son of Hefer, the son of Gil‘ad, the son of Makhir, the son of M’nasheh, had no sons, only daughters; these are the names of his daughters: Machlah, No‘ah, Hoglah, Milkah and Tirtzah. "},{"num":4,"verse":"They approached El‘azar the cohen, Y’hoshua the son of Nun and the leaders and said, “Adonai ordered Moshe to give us an inheritance together with our kinsmen.” Therefore, in keeping with Adonai’s order, he gave them an inheritance together with the kinsmen of their father. "},{"num":5,"verse":"Thus ten parts fell to M’nasheh, in addition to the land of Gil‘ad and Bashan beyond the Yarden, "},{"num":6,"verse":"because the daughters of M’nasheh had an inheritance along with his descendants; but the land of Gil‘ad belonged to the rest of the descendants of M’nasheh."},{"num":7,"verse":"The border of M’nasheh began at Asher and went to Mikhm’tat, which is across from Sh’khem; next the border went along to the right, to the people of ‘Ein-Tapuach. "},{"num":8,"verse":"The land of Tapuach belonged to M’nasheh, but Tapuach on the border of M’nasheh belonged to the descendants of Efrayim. "},{"num":9,"verse":"The border descended to Vadi Kanah, south of the vadi, by cities which belonged to Efrayim among the cities of M’nasheh; but the border with M’nasheh was on the north side of the vadi, and it ended at the sea. "},{"num":10,"verse":"Southward it was Efrayim’s, northward it was M’nasheh’s, and the sea was its border; while to the north they extended to Asher, and on the east to Yissakhar."},{"num":11,"verse":"In Asher and Yissakhar, M’nasheh had Beit-Sh’an and its villages; Yivle‘am and its villages; and the inhabitants of Dor and its villages, of ‘Ein-Dor and its villages, of Ta‘anakh and its villages, and of Megiddo and its villages — three districts in all. "},{"num":12,"verse":"But the descendants of M’nasheh could not drive out the inhabitants of those cities; the Kena‘ani wanted to stay in that land. "},{"num":13,"verse":"After the people of Isra’el had become strong, they made the Kena‘ani do heavy labor but didn’t completely drive them out."},{"num":14,"verse":"Then the descendants of Yosef spoke to Y’hoshua; they said, “Why have you given me only one lot and only one portion to inherit? After all, I am a great people, since Adonai has blessed me so.” "},{"num":15,"verse":"Y’hoshua answered them, “If you are a great people, go up to the forest, and clear land for yourself there in the territory of the P’rizi and the Refa’im — since the hills of Efrayim don’t give you enough space.” "},{"num":16,"verse":"The descendants of Yosef replied, “The hills won’t be enough for us; and all the Kena‘ani living in the valleys have iron chariots — both those in Beit-Sh’an and its villages and those in the Yizre‘el Valley.” "},{"num":17,"verse":"Then Y’hoshua said to the house of Yosef, to both Efrayim and M’nasheh, “You are a great people with much power; you will not have only one lot, "},{"num":18,"verse":"but the hills too will be yours. Although it is a forest, you will clear it, and the resulting open land will be yours. You will drive out the Kena‘ani, even though they have iron chariots and are strong.”"}]