[{"header":"The Other Half-Tribe of Manasseh (West)"},{"num":17,"verse":"Then allotment was made to the tribe of Manas′seh, for he was the first-born of Joseph. To Machir the first-born of Manas′seh, the father of Gilead, were allotted Gilead and Bashan, because he was a man of war. "},{"num":2,"verse":"And allotments were made to the rest of the tribe of Manas′seh, by their families, Abi-e′zer, Helek, As′ri-el, Shechem, Hepher, and Shemi′da; these were the male descendants of Manas′seh the son of Joseph, by their families."},{"num":3,"verse":"Now Zeloph′ehad the son of Hepher, son of Gilead, son of Machir, son of Manas′seh, had no sons, but only daughters; and these are the names of his daughters: Mahlah, Noah, Hoglah, Milcah, and Tirzah. "},{"num":4,"verse":"They came before Elea′zar the priest and Joshua the son of Nun and the leaders, and said, “The Lord commanded Moses to give us an inheritance along with our brethren.” So according to the commandment of the Lord he gave them an inheritance among the brethren of their father. "},{"num":5,"verse":"Thus there fell to Manas′seh ten portions, besides the land of Gilead and Bashan, which is on the other side of the Jordan; "},{"num":6,"verse":"because the daughters of Manas′seh received an inheritance along with his sons. The land of Gilead was allotted to the rest of the Manas′sites."},{"num":7,"verse":"The territory of Manas′seh reached from Asher to Michme′thath, which is east of Shechem; then the boundary goes along southward to the inhabitants of En-Tap′pu-ah. "},{"num":8,"verse":"The land of Tap′pu-ah belonged to Manas′seh, but the town of Tap′pu-ah on the boundary of Manas′seh belonged to the sons of E′phraim. "},{"num":9,"verse":"Then the boundary went down to the brook Kanah. The cities here, to the south of the brook, among the cities of Manas′seh, belong to E′phraim. Then the boundary of Manas′seh goes on the north side of the brook and ends at the sea; "},{"num":10,"verse":"the land to the south being E′phraim’s and that to the north being Manas′seh’s, with the sea forming its boundary; on the north Asher is reached, and on the east Is′sachar. "},{"num":11,"verse":"Also in Is′sachar and in Asher Manas′seh had Beth-she′an and its villages, and Ibleam and its villages, and the inhabitants of Dor and its villages, and the inhabitants of En-dor and its villages, and the inhabitants of Ta′anach and its villages, and the inhabitants of Megid′do and its villages; the third is Naphath. "},{"num":12,"verse":"Yet the sons of Manas′seh could not take possession of those cities; but the Canaanites persisted in dwelling in that land. "},{"num":13,"verse":"But when the people of Israel grew strong, they put the Canaanites to forced labor, and did not utterly drive them out."},{"header":"The Tribe of Joseph Protests"},{"num":14,"verse":"And the tribe of Joseph spoke to Joshua, saying, “Why have you given me but one lot and one portion as an inheritance, although I am a numerous people, since hitherto the Lord has blessed me?” "},{"num":15,"verse":"And Joshua said to them, “If you are a numerous people, go up to the forest, and there clear ground for yourselves in the land of the Per′izzites and the Reph′aim, since the hill country of E′phraim is too narrow for you.” "},{"num":16,"verse":"The tribe of Joseph said, “The hill country is not enough for us; yet all the Canaanites who dwell in the plain have chariots of iron, both those in Beth-she′an and its villages and those in the Valley of Jezre′el.” "},{"num":17,"verse":"Then Joshua said to the house of Joseph, to E′phraim and Manas′seh, “You are a numerous people, and have great power; you shall not have one lot only, "},{"num":18,"verse":"but the hill country shall be yours, for though it is a forest, you shall clear it and possess it to its farthest borders; for you shall drive out the Canaanites, though they have chariots of iron, and though they are strong.”"}]