[{"num":2,"verse":"For I want you to have da’as of how great a ma’avak (struggle) I have for you and the ones in Laodicea, and as many as have not seen me panim el panim (directly, in person),"},{"num":2,"verse":"That their levavot may be given chozek (strength), having been made an aguda of ahavah and all osher (wealth) of the full assurance of binah, resulting in the da’as of the raz of Hashem, namely Moshiach,"},{"num":3,"verse":"In whom is nistar (hidden) all the otzarot (treasures) of chochmah and da’as. [YESHAYAH 11:2; YIRMEYAH 23:5]"},{"num":4,"verse":"This I say so that no one may delude you with the sleight of hand of the ba’al melitzot (rhetorician)."},{"num":5,"verse":"For, though absent in basar, but present with you in the Ruach Hakodesh, with lev same’ach (glad heart) I am seeing your order and the firmness of your [Orthodox Jewish] emunah in Moshiach."},{"num":6,"verse":"Therefore, as you became mekabel Moshiach and received Moshiach Adoneinu Yehoshua, so let your halichah be in Him,"},{"num":7,"verse":"Having been rooted and built up in Moshiach and being firmly founded in the emunah as you were given Messianic [orthodox] lernen [study], abounding in hodayah."},{"num":8,"verse":"Beware lest there be anyone of you taken captive through philosophical tevunah (wisdom) and empty deceit according to the kabbalah (oral tradition) of mere Bnei Adam, according to the ikkarim (basic principles) of the Olam Hazeh and not according to Moshiach;"},{"num":9,"verse":"Because in Moshiach kol melo Elohim (all the plentitude of G-d) finds its bodily maon laShechinah (dwelling place for the Shechinah)."},{"num":10,"verse":"And you have been granted melo (plentitude) in Moshiach, who is the Rosh of all rule and authority."},{"num":11,"verse":"In Moshiach also you were circumcised with a Bris Milah not made with human hands, a Bris Milah of the surgically removing of the body of the basar (old fallen and unregenerate nature) in the Bris Milah of Moshiach,"},{"num":12,"verse":"Having been buried in the Ohel of Rebbe, Melech HaMoshiach’s tevilah with him, with whom also you were made to stand up spiritually in the Techiyah together through your emunah and bitachon in the ma’aseh of Hashem who made Moshiach stand up from the Mesim."},{"num":13,"verse":"And you being dead in your peysha’im (YESHAYAH 53:8) and your orlat basar (uncircumcision of flesh) he made alive together, you together with Moshiach, having granted you selicha for all your peysha’im;"},{"num":14,"verse":"Having erased the handsigned sefer of guilt choiv (debt), the heavenly indictment against us in the maleh chukat haTorah (full statute requirement of the Torah), which was against us. Moshiach has done away with this opposing record, having nailed it to Moshiach’s Etz."},{"num":15,"verse":"Having disarmed the rulers and the authorities, He made a public spectacle of them, having triumphed over them by Moshiach’s Etz."},{"num":16,"verse":"Therefore, let no one judge you [Goyim] in eating and in drinking or in respect to a yom tov (yontev) or a rosh chodesh or Shabbos;"},{"num":17,"verse":"Which are a shadow of the things to come in the Olam HaBah; but the reality, the substance, is Moshiach."},{"num":18,"verse":"Let no one deprive you of the prize by delighting in his mystical asceticism and his veneration of malachim and delving into his chazonot (visions) and being vainly puffed up by the machshavot (thoughts) of his basar (old nature unrenewed and unregenerated by the Ruach Hakodesh),"},{"num":19,"verse":"And not holding on to the Rosh, out of whom all the Moshiach’s Guf, being fully supplied and being be’ichud (united) together through the joints and ligaments, grows with the growth of Hashem."},{"num":20,"verse":"Als (Since) you died with Rebbe, Melech HaMoshiach to the ikkarim (basic principles) of the Olam Hazeh, why, as though you still belonged to the keyam (existence) of the Olam Hazeh, do you (Goyim) chain yourself to chumra legalisms?"},{"num":21,"verse":"\"Do not touch; do not taste; do not handle.\""},{"num":22,"verse":"The things referred to are all destined to deterioration with use, according to the humanly contrived mitzvot and the humanly contrived chukim (laws) of mere Bnei Adam [i.e., non-Biblical teachings and humanly contrived religious tradition]YESHAYAH 29:13],"},{"num":23,"verse":"Which things have a superficial appearance of chochmah in self-imposed religion and mystical asceticism and severe physical mortification, but are of no value against the indulgence of the basar (the old nature unrenewed and unregenerated by the Ruach Hakodesh)."}]