[{"num":58,"verse":"Cry aloud, restrain not, lift up thy kol (voice) like the shofar, and preach to My people their peysha (transgression, rebellion) and Bais Ya’akov their chattot."},{"num":2,"verse":"Yet they seek Me yom yom (daily), and for the da’as of My Drakhim they seem eager, like a Goy (Nation) that doeth tzedakah, like one that did not forsake mishpat Elohav; they ask of Me the mishpeteitzedek; they seem eager for kirvat Elohim (getting close to G-d, revival)."},{"num":3,"verse":"Why have we done a tzom, say they, and Thou seest not? Why have we afflicted nafsheinu, and Thou takest no notice? See, in your yom tzom ye find chefetz (pleasure, personal advantage) and exploit all your toilers."},{"num":4,"verse":"See, ye undergo a tzom for grievance and strife, and to strike with the fist of resha; ye shall not do a tzom as ye do today, to make your voice to be heard on marom."},{"num":5,"verse":"Is such as this a tzom that I have chosen? Merely for adam to afflict his nefesh? To bow down his rosh like a bulrush, and to spread sackcloth and efer (ashes) under him? Wilt thou call this a tzom, and a yom ratzon (a day of acceptance, an acceptable day) unto Hashem?"},{"num":6,"verse":"Is not this the tzom that I have chosen? To loose the chartzubbot resha (chains of wickedness, injustice), to undo the aguddot motah (bindings of the yoke bar), and to let the retzutzim (oppressed ones) go as chafeshim (free ones), and that ye break kol motah (every yoke of oppression)?"},{"num":7,"verse":"Is it not paras lechem (breaking bread of thine, i.e., serving food) to the hungry, and that thou bring the homeless aniyyim (poor) to thy bais? When thou seest the arom (naked), that thou cover him with clothing; and that thou hide not thyself from thine own basar (flesh and blood, kinspeople)?"},{"num":8,"verse":"Then shall thy light break forth like the shachar (dawn), and thine healing titzmach (shall spring forth; Tzemach) speedily; and thy tzedek shall go before thee; the kavod Hashem shall be thy rearguard."},{"num":9,"verse":"Then shalt thou call, and Hashem shall answer; thou shalt cry for help, and He shall say, Hineni! If thou remove from the midst of thee the motah (yoke), the pointing of the etzba (finger [of contempt]) and speaking aven (evil, lashon hora);"},{"num":10,"verse":"And if thou draw out thy nefesh to the hungry, and satisfy the nefesh of the afflicted, then shall thy ohr rise in choshech, and thy darkness shall be as the noon;"},{"num":11,"verse":"And Hashem shall guide thee tamid, and satisfy thy nefesh in drought, and strengthen thy atzmot; and thou shalt be like a gan raveh (well-watered garden), and like a motzah mayim (spring of water), whose mayim fail not."},{"num":12,"verse":"And they that shall be of thee shall rebuild the charevot olam (ancient ruins); thou shalt raise up the mosedei dor vador (the foundations of many generations); and thou shalt be called, Goder Peretz; Meshovev Netivot Lashevet (Repairer of the Breach; Restorer of the Streets For Habitation)."},{"num":13,"verse":"If thou turn away thy regel on account of Shabbos, from doing thy chefetz on My Yom Kodesh; and call Shabbos an Oneg (Delight), the Kedosh Hashem (Holy Day of Hashem), \"honored\"; and if thou shalt honor it, not doing thine darkhim nor finding thine own chefetz, nor speaking [worldly] words:"},{"num":14,"verse":"Then shalt thou delight in Hashem; and I will cause thee to ride upon the high places of eretz, and feed thee with the nachalat Ya’akov Avicha; for the mouth of Hashem hath spoken."}]