[{"num":31,"verse":"Now the Philistines fought against Israel; and the men of Israel fled before [them] and fell slain on Mount Gilboa."},{"num":2,"verse":"And the Philistines pursued Saul and his sons, and slew Jonathan and Abinadab and Malchi-shua, Saul’s sons."},{"num":3,"verse":"The battle went heavily against Saul, and the archers severely wounded him."},{"num":4,"verse":"Saul said to his armor-bearer, Draw your sword and thrust me through, lest these uncircumcised come and thrust me through and abuse and mock me. But his armor-bearer would not, for he was terrified. So Saul took a sword and fell upon it."},{"num":5,"verse":"When his armor-bearer saw that Saul was dead, he likewise fell upon his sword and died with him."},{"num":6,"verse":"So Saul, his three sons, his armor-bearer, and all his men died that day together."},{"num":7,"verse":"And when the men of Israel on the other side of the valley and beyond the Jordan saw that the Israelites had fled and that Saul and his sons were dead, they forsook the cities and fled; and the Philistines came and dwelt in them."},{"num":8,"verse":"The next day, when the Philistines came to strip the slain, they found Saul and his three sons fallen on Mount Gilboa."},{"num":9,"verse":"They cut off Saul’s head and stripped off his armor and sent them round about the land of the Philistines to publish it in the house of their idols and among the people."},{"num":10,"verse":"And they put Saul’s armor in the house of the Ashtaroth [the idols representing the female deities Ashtoreth and Asherah], and they fastened his body to the wall of Beth-shan."},{"num":11,"verse":"When the people of Jabesh-gilead heard what the Philistines had done to Saul,"},{"num":12,"verse":"All the valiant men arose and went all night, and they took the bodies of Saul and his sons from the wall of Beth-shan and came to Jabesh and cremated them there."},{"num":13,"verse":"And they took their bones and buried them under a tree at Jabesh, and fasted seven days."}]