[{"header":"Saul Disobeys the Lord"},{"num":15,"verse":"One day, Samuel told Saul:"},{"num":4,"verse":"Saul sent messengers who told every town and village to send men to join the army at Telaim. There were two hundred ten thousand troops in all, and ten thousand of these were from Judah. Saul organized them, "},{"num":5,"verse":"then led them to a valley near one of the towns in Amalek, where they got ready to make a surprise attack. "},{"num":6,"verse":"Some Kenites lived nearby, and Saul told them, “Your people were kind to our nation when we left Egypt, and I don’t want you to get killed when I wipe out the Amalekites. Leave here and stay away from them.”"},{"num":7,"verse":"and Saul attacked the Amalekites from Havilah to Shur, which is just east of Egypt. "},{"num":8,"verse":"Every Amalekite was killed except King Agag. "},{"num":9,"verse":"Saul and his army let Agag live, and they also spared the best sheep and cattle. They didn’t want to destroy anything of value, so they only killed the animals that were worthless or weak."},{"header":"The Lord Rejects Saul"},{"num":10,"verse":"The Lord told Samuel, "},{"num":11,"verse":"“Saul has stopped obeying me, and I’m sorry that I made him king.”"},{"num":12,"verse":"Early the next morning he went to talk with Saul. Someone told him, “Saul went to Carmel, where he had a monument built so everyone would remember his victory. Then he left for Gilgal.”"},{"num":13,"verse":"Samuel finally caught up with Saul, and Saul told him, “I hope the Lord will bless you! I have done what the Lord told me.”"},{"num":14,"verse":"“Then why,” Samuel asked, “do I hear sheep and cattle?”"},{"num":15,"verse":"“The army took them from the Amalekites,” Saul explained. “They kept the best sheep and cattle, so they could sacrifice them to the Lord your God. But we destroyed everything else.”"},{"num":16,"verse":"“Stop!” Samuel said. “Let me tell you what the Lord told me last night.”"},{"num":17,"verse":"Samuel continued, “You may not think you’re very important, but the Lord chose you to be king, and you are in charge of the tribes of Israel. "},{"num":18,"verse":"When the Lord sent you on this mission, he told you to wipe out those worthless Amalekites. "},{"num":19,"verse":"Why didn’t you listen to the Lord? Why did you keep the animals and make him angry?”"},{"num":20,"verse":"“But I did listen to the Lord!” Saul answered. “He sent me on a mission, and I went. I captured King Agag and destroyed his nation. "},{"num":21,"verse":"All the animals were going to be destroyed anyway. That’s why the army brought the best sheep and cattle to Gilgal as sacrifices to the Lord your God.”"},{"num":22,"verse":"“Tell me,” Samuel said. “Does the Lord really want sacrifices and offerings? No! He doesn’t want your sacrifices. He wants you to obey him. "},{"num":23,"verse":"Rebelling against God or disobeying him because you are proud is just as bad as worshiping idols or asking them for advice. You refused to do what God told you, so God has decided that you can’t be king.”"},{"num":24,"verse":"“I have sinned,” Saul admitted. “I disobeyed both you and the Lord. I was afraid of the army, and I listened to them instead. "},{"num":25,"verse":"Please forgive me and come back with me so I can worship the Lord.”"},{"num":26,"verse":"“No!” Samuel replied, “You disobeyed the Lord, and I won’t go back with you. Now the Lord has said that you can’t be king of Israel any longer.”"},{"num":27,"verse":"As Samuel turned to go, Saul grabbed the edge of Samuel’s robe. It tore! "},{"num":28,"verse":"Samuel said, “The Lord has torn the kingdom of Israel away from you today, and he will give it to someone who is better than you. "},{"num":29,"verse":"Besides, the eternal God of Israel isn’t a human being. He doesn’t tell lies or change his mind.”"},{"num":30,"verse":"Saul said, “I did sin, but please honor me in front of the leaders of the army and the people of Israel. Come back with me, so I can worship the Lord your God.”"},{"num":31,"verse":"Samuel followed Saul back, and Saul worshiped the Lord. "},{"num":32,"verse":"Then Samuel shouted, “Bring me King Agag of Amalek!”"},{"num":33,"verse":"But Samuel said, “Agag, you have snatched children from their mothers' arms and killed them. Now your mother will be without children.” Then Samuel chopped Agag to pieces at the place of worship in Gilgal."},{"num":34,"verse":"Samuel went home to Ramah, and Saul returned to his home in Gibeah. "},{"num":35,"verse":"Even though Samuel felt sad about Saul, Samuel never saw him again."},{"header":"The Lord Chooses David To Be King"}]