[{"header":"Saul Destroys the Amalekites"},{"num":15,"verse":"One day Samuel said to Saul, “The Lord sent me to anoint you king over his people Israel. Now listen to his message."},{"num":2,"verse":"The Lord All-Powerful says: ‘When the Israelites came out of Egypt, the Amalekites tried to stop them from going to Canaan. I saw what the Amalekites did."},{"num":3,"verse":"Now go fight against the Amalekites. You must completely destroy the Amalekites and everything that belongs to them. Don’t let anything live; you must kill all the men and women and all of their children and little babies. You must kill all of their cattle and sheep and all of their camels and donkeys.’”"},{"num":4,"verse":"Saul gathered the army together at Telaim. There were 200,000 foot soldiers and 10,000 other men, including the men from Judah."},{"num":5,"verse":"Then Saul went to the city of Amalek and waited in the valley."},{"num":6,"verse":"He said to the Kenites, “Go away! Leave the Amalekites. Then I won’t destroy you with the Amalekites. You showed kindness to the Israelites when they came out of Egypt.” So the Kenites left the Amalekites."},{"num":7,"verse":"Saul defeated the Amalekites. He fought them and chased them all the way from Havilah to Shur, at the border of Egypt."},{"num":8,"verse":"Agag was the king of the Amalekites. Saul captured Agag alive. Saul let Agag live, but he killed all the men in Agag’s army."},{"num":9,"verse":"Saul and the Israelite soldiers felt bad about destroying everything. So they let Agag live. They also kept the fat cattle, the best sheep, and the lambs. They kept everything that was worth keeping. They didn’t want to destroy those things. They destroyed only what was not worth keeping."},{"header":"Samuel Tells Saul About His Sin"},{"num":10,"verse":"Then Samuel received this message from the Lord:"},{"num":11,"verse":"“Saul has stopped following me, so I am sorry that I made him king. He is not doing what I tell him.” Samuel became angry and cried to the Lord all night."},{"num":12,"verse":"Samuel got up early the next morning and went to meet Saul. But the people told Samuel, “Saul went to Carmel. He went there to set up a stone monument to honor himself. Then he left there and went down to Gilgal.”"},{"num":13,"verse":"When Samuel came near to Saul, Saul greeted him and said, “The Lord bless you! I have obeyed the Lord’s commands.”"},{"num":14,"verse":"But Samuel said, “Then what is that sound I hear? Why do I hear sheep and cattle?”"},{"num":15,"verse":"Saul said, “The soldiers took them from the Amalekites. They saved the best sheep and cattle to burn as sacrifices to the Lord your God. But we destroyed everything else.”"},{"num":16,"verse":"Samuel said to Saul, “Stop! Let me tell you what the Lord told me last night.”"},{"num":17,"verse":"Samuel said, “In the past you didn’t think that you were important, but the Lord chose you to be the king. So you became the leader of the tribes of Israel."},{"num":18,"verse":"The Lord sent you on a special mission. He said, ‘Go and destroy all the Amalekites. They are evil people. Destroy them all! Fight them until they are completely finished.’"},{"num":19,"verse":"So why didn’t you listen to the Lord? You did what the Lord said is wrong because you wanted to keep what you took in battle.”"},{"num":20,"verse":"Saul said, “But I did obey the Lord! I went where the Lord sent me. I destroyed all the Amalekites. I brought back only one—their king Agag."},{"num":21,"verse":"And the soldiers took the best sheep and cattle to sacrifice to the Lord your God at Gilgal.”"},{"num":22,"verse":"But Samuel answered, “Which pleases the Lord more: burnt offerings and sacrifices or obeying his commands? It is better to obey the Lord than to offer sacrifices to him. It is better to listen to him than to offer the fat from rams."},{"num":23,"verse":"Refusing to obey is as bad as the sin of sorcery. Being stubborn and doing what you want is like the sin of worshiping idols. You refused to obey the Lord’s command, so he now refuses to accept you as king.”"},{"num":24,"verse":"Then Saul said to Samuel, “I have sinned. I did not obey the Lord’s commands, and I did not do what you told me. I was afraid of the people, and I did what they said."},{"num":25,"verse":"Now I beg you, forgive me for doing this sin. Come back with me, so I may worship the Lord.”"},{"num":26,"verse":"But Samuel said to Saul, “I won’t go back with you. You rejected the Lord’s command, and now the Lord rejects you as king of Israel.”"},{"num":27,"verse":"When Samuel turned to leave, Saul caught Samuel’s robe. The robe tore."},{"num":28,"verse":"Samuel said to Saul, “In this same way the Lord has torn the kingdom of Israel from you today. He has given the kingdom to one of your friends, a man who is a better person than you."},{"num":29,"verse":"The one who lives forever, the God of Israel, does not lie and will not change his mind. He is not like a man who is always changing his mind.”"},{"num":30,"verse":"Saul answered, “All right, I sinned! But please come back with me. Show me some respect in front of the leaders and the Israelites. Come back with me so that I may worship the Lord your God.”"},{"num":31,"verse":"Samuel went back with Saul, and Saul worshiped the Lord."},{"num":32,"verse":"Samuel said, “Bring King Agag of the Amalekites to me.”"},{"num":33,"verse":"But Samuel said to Agag, “Your sword took babies from their mothers. So now, your mother will have no children.” And Samuel cut Agag to pieces before the Lord at Gilgal."},{"num":34,"verse":"Then Samuel left and went to Ramah. And Saul went up to his home in Gibeah."},{"num":35,"verse":"After that Samuel never saw Saul again. Samuel was very sad for Saul. And the Lord was very sorry that he had made Saul king of Israel."}]