[{"header":"Saul Defeats the Amalekites but Spares Their King"},{"num":15,"verse":"And Samuel said to Saul, “The Lord sent me to anoint you king over his people Israel; now therefore hearken to the words of the Lord. "},{"num":2,"verse":"Thus says the Lord of hosts, ‘I will punish what Am′alek did to Israel in opposing them on the way, when they came up out of Egypt. "},{"num":3,"verse":"Now go and smite Am′alek, and utterly destroy all that they have; do not spare them, but kill both man and woman, infant and suckling, ox and sheep, camel and ass.’”"},{"num":4,"verse":"So Saul summoned the people, and numbered them in Tela′im, two hundred thousand men on foot, and ten thousand men of Judah. "},{"num":5,"verse":"And Saul came to the city of Am′alek, and lay in wait in the valley. "},{"num":6,"verse":"And Saul said to the Ken′ites, “Go, depart, go down from among the Amal′ekites, lest I destroy you with them; for you showed kindness to all the people of Israel when they came up out of Egypt.” So the Ken′ites departed from among the Amal′ekites. "},{"num":7,"verse":"And Saul defeated the Amal′ekites, from Hav′ilah as far as Shur, which is east of Egypt. "},{"num":8,"verse":"And he took Agag the king of the Amal′ekites alive, and utterly destroyed all the people with the edge of the sword. "},{"num":9,"verse":"But Saul and the people spared Agag, and the best of the sheep and of the oxen and of the fatlings, and the lambs, and all that was good, and would not utterly destroy them; all that was despised and worthless they utterly destroyed."},{"header":"Saul Rejected as King"},{"num":10,"verse":"The word of the Lord came to Samuel: "},{"num":11,"verse":"“I repent that I have made Saul king; for he has turned back from following me, and has not performed my commandments.” And Samuel was angry; and he cried to the Lord all night. "},{"num":12,"verse":"And Samuel rose early to meet Saul in the morning; and it was told Samuel, “Saul came to Carmel, and behold, he set up a monument for himself and turned, and passed on, and went down to Gilgal.” "},{"num":13,"verse":"And Samuel came to Saul, and Saul said to him, “Blessed be you to the Lord; I have performed the commandment of the Lord.” "},{"num":14,"verse":"And Samuel said, “What then is this bleating of the sheep in my ears, and the lowing of the oxen which I hear?” "},{"num":15,"verse":"Saul said, “They have brought them from the Amal′ekites; for the people spared the best of the sheep and of the oxen, to sacrifice to the Lord your God; and the rest we have utterly destroyed.” "},{"num":16,"verse":"Then Samuel said to Saul, “Stop! I will tell you what the Lord said to me this night.” And he said to him, “Say on.”"},{"num":17,"verse":"And Samuel said, “Though you are little in your own eyes, are you not the head of the tribes of Israel? The Lord anointed you king over Israel. "},{"num":18,"verse":"And the Lord sent you on a mission, and said, ‘Go, utterly destroy the sinners, the Amal′ekites, and fight against them until they are consumed.’ "},{"num":19,"verse":"Why then did you not obey the voice of the Lord? Why did you swoop on the spoil, and do what was evil in the sight of the Lord?” "},{"num":20,"verse":"And Saul said to Samuel, “I have obeyed the voice of the Lord, I have gone on the mission on which the Lord sent me, I have brought Agag the king of Am′alek, and I have utterly destroyed the Amal′ekites. "},{"num":21,"verse":"But the people took of the spoil, sheep and oxen, the best of the things devoted to destruction, to sacrifice to the Lord your God in Gilgal.” "},{"num":22,"verse":"And Samuel said,"},{"num":24,"verse":"And Saul said to Samuel, “I have sinned; for I have transgressed the commandment of the Lord and your words, because I feared the people and obeyed their voice. "},{"num":25,"verse":"Now therefore, I pray, pardon my sin, and return with me, that I may worship the Lord.” "},{"num":26,"verse":"And Samuel said to Saul, “I will not return with you; for you have rejected the word of the Lord, and the Lord has rejected you from being king over Israel.” "},{"num":27,"verse":"As Samuel turned to go away, Saul laid hold upon the skirt of his robe, and it tore. "},{"num":28,"verse":"And Samuel said to him, “The Lord has torn the kingdom of Israel from you this day, and has given it to a neighbor of yours, who is better than you. "},{"num":29,"verse":"And also the Glory of Israel will not lie or repent; for he is not a man, that he should repent.” "},{"num":30,"verse":"Then he said, “I have sinned; yet honor me now before the elders of my people and before Israel, and return with me, that I may worship the Lord your God.” "},{"num":31,"verse":"So Samuel turned back after Saul; and Saul worshiped the Lord."},{"num":32,"verse":"Then Samuel said, “Bring here to me Agag the king of the Amal′ekites.” And Agag came to him cheerfully. Agag said, “Surely the bitterness of death is past.” "},{"num":33,"verse":"And Samuel said, “As your sword has made women childless, so shall your mother be childless among women.” And Samuel hewed Agag in pieces before the Lord in Gilgal."},{"num":34,"verse":"Then Samuel went to Ramah; and Saul went up to his house in Gib′e-ah of Saul. "},{"num":35,"verse":"And Samuel did not see Saul again until the day of his death, but Samuel grieved over Saul. And the Lord repented that he had made Saul king over Israel."}]