[{"num":15,"verse":"One day Samuel said to Saul, “I crowned you king of Israel because God told me to. Now be sure that you obey him. "},{"num":2,"verse":"Here is his commandment to you: ‘I have decided to settle accounts with the nation of Amalek for refusing to allow my people to cross their territory when Israel came from Egypt. "},{"num":3,"verse":"Now go and completely destroy the entire Amalek nation—men, women, babies, little children, oxen, sheep, camels, and donkeys.’”"},{"num":4,"verse":"So Saul mobilized his army at Telaim. There were two hundred thousand troops in addition to ten thousand men from Judah. "},{"num":5,"verse":"The Amalekites were camped in the valley below them. "},{"num":6,"verse":"Saul sent a message to the Kenites, telling them to get out from among the Amalekites or else die with them. “For you were kind to the people of Israel when they came out of the land of Egypt,” he explained. So the Kenites packed up and left."},{"num":7,"verse":"Then Saul butchered the Amalekites from Havilah all the way to Shur, east of Egypt. "},{"num":8,"verse":"He captured Agag, the king of the Amalekites, but killed everyone else. "},{"num":9,"verse":"However, Saul and his men kept the best of the sheep and oxen and the fattest of the lambs—everything, in fact, that appealed to them. They destroyed only what was worthless or of poor quality."},{"num":10,"verse":"Then the Lord said to Samuel, "},{"num":11,"verse":"“I am sorry that I ever made Saul king, for he has again refused to obey me.”"},{"num":12,"verse":"Early the next morning he went out to find Saul. Someone said that he had gone to Mount Carmel to erect a monument to himself and had then gone on to Gilgal. "},{"num":13,"verse":"When Samuel finally found him, Saul greeted him cheerfully."},{"num":14,"verse":"“Then what was all the bleating of sheep and lowing of oxen I heard?” Samuel demanded."},{"num":15,"verse":"“It’s true that the army spared the best of the sheep and oxen,” Saul admitted, “but they are going to sacrifice them to the Lord your God; and we have destroyed everything else.”"},{"num":16,"verse":"Then Samuel said to Saul, “Stop! Listen to what the Lord told me last night!”"},{"num":17,"verse":"And Samuel told him, “When you didn’t think much of yourself, God made you king of Israel. "},{"num":18,"verse":"And he sent you on an errand and told you, ‘Go and completely destroy the sinners, the Amalekites, until they are all dead.’ "},{"num":19,"verse":"Then why didn’t you obey the Lord? Why did you rush for the loot and do exactly what God said not to?”"},{"num":20,"verse":"“But I have obeyed the Lord,” Saul insisted. “I did what he told me to; and I brought King Agag but killed everyone else. "},{"num":21,"verse":"And it was only when my troops demanded it that I let them keep the best of the sheep and oxen and loot to sacrifice to the Lord.”"},{"num":22,"verse":"Samuel replied, “Has the Lord as much pleasure in your burnt offerings and sacrifices as in your obedience? Obedience is far better than sacrifice. He is much more interested in your listening to him than in your offering the fat of rams to him. "},{"num":23,"verse":"For rebellion is as bad as the sin of witchcraft, and stubbornness is as bad as worshiping idols. And now because you have rejected the word of Jehovah, he has rejected you from being king.”"},{"num":24,"verse":"“I have sinned,” Saul finally admitted. “Yes, I have disobeyed your instructions and the command of the Lord, for I was afraid of the people and did what they demanded. "},{"num":25,"verse":"Oh, please pardon my sin now and go with me to worship the Lord.”"},{"num":26,"verse":"But Samuel replied, “It’s no use! Since you have rejected the commandment of the Lord, he has rejected you from being the king of Israel.”"},{"num":27,"verse":"As Samuel turned to go, Saul grabbed at him to try to hold him back and tore his robe."},{"num":28,"verse":"And Samuel said to him, “See? The Lord has torn the kingdom of Israel from you today and has given it to a countryman of yours who is better than you are. "},{"num":29,"verse":"And he who is the glory of Israel is not lying, nor will he change his mind, for he is not a man!”"},{"num":30,"verse":"Then Saul pleaded again, “I have sinned; but oh, at least honor me before the leaders and before my people by going with me to worship the Lord your God.”"},{"num":31,"verse":"So Samuel finally agreed and went with him."},{"num":32,"verse":"Then Samuel said, “Bring King Agag to me.” Agag arrived all full of smiles, for he thought, “Surely the worst is over and I have been spared!” "},{"num":33,"verse":"But Samuel said, “As your sword has killed the sons of many mothers, now your mother shall be childless.” And Samuel chopped him in pieces before the Lord at Gilgal. "},{"num":34,"verse":"Then Samuel went home to Ramah, and Saul returned to Gibeah. "},{"num":35,"verse":"Samuel never saw Saul again, but he mourned constantly for him; and the Lord was sorry that he had ever made Saul king of Israel."}]