[{"num":6,"verse":"1 The genealogy of the sons of Levi. 31 Their order in the ministry of the Tabernacle. 49 Aaron and his sons Priests. 54, 57 Their inhabitations."},{"num":1,"verse":"The sons of Levi were Gershon, Kohath, and Merari."},{"num":2,"verse":"And the sons of Kohath, Amram, Izhar, and Hebron, and Uzziel."},{"num":3,"verse":"And the children of Amram, Aaron, and Moses and Miriam. And the sons of Aaron, Nadab, and Abihu, and Eleazar, and Ithamar."},{"num":4,"verse":"Eleazar begat Phinehas, Phinehas begat Abishua,"},{"num":5,"verse":"And Abishua begat Bukki, and Bukki begat Uzzi,"},{"num":6,"verse":"And Uzzi begat Zerahiah, and Zerahiah begat Meraioth."},{"num":7,"verse":"Meraioth begat Amariah, and Amariah begat Ahitub,"},{"num":8,"verse":"And Ahitub begat Zadok, and Zadok begat Ahimaaz,"},{"num":9,"verse":"And Ahimaaz begat Azariah, and Azariah begat Johanan,"},{"num":10,"verse":"And Johanan begat Azariah (it was he that was Priest in the house that Solomon built in Jerusalem.)"},{"num":11,"verse":"And Azariah begat Amariah, and Amariah begat Ahitub,"},{"num":12,"verse":"And Ahitub begat Zadok, and Zadok begat Shallum,"},{"num":13,"verse":"And Shallum begat Hilkiah, and Hilkiah begat Azariah,"},{"num":14,"verse":"And Azariah begat Seraiah, and Seraiah begat Jehozadak,"},{"num":15,"verse":"And Jehozadak departed when the Lord carried away into captivity Judah and Jerusalem by the hand of Nebuchadnezzar."},{"num":16,"verse":"¶ The sons of Levi were Gershon, Kohath and Merari."},{"num":17,"verse":"And these be the names of the sons of Gershon, Libni, and Shimei."},{"num":18,"verse":"And the sons of Kohath were Amram, and Izhar, and Hebron and Uzziel."},{"num":19,"verse":"The sons of Merari, Mahli and Mushi: and these are the families of Levi concerning their fathers."},{"num":20,"verse":"Of Gershon, Libni his son, Jahath his son, Zimmah his son,"},{"num":21,"verse":"Joah his son, Iddo his son, Zerah his son, Jeatherai his son."},{"num":22,"verse":"The sons of Kohath, Amminadab his son, Korah his son, Assir his son,"},{"num":23,"verse":"Elkanah his son, and Ebiasaph his son, and Assir his son,"},{"num":24,"verse":"Tahath his son, Uriel his son, Uzziah his son, and Shaul his son,"},{"num":25,"verse":"And the sons of Elkanah, Amasai, and Ahimoth."},{"num":26,"verse":"Elkanah, the sons of Elkanah, Zophai his son, and Nahath his son,"},{"num":27,"verse":"Eliab his son, Jeroham his son, Elkanah his son,"},{"num":28,"verse":"And the sons of Samuel, the eldest Vasheni, then Abijah."},{"num":29,"verse":"¶ The sons of Merari were Mahli, Libni his son, Shimei his son, Uzzah his son,"},{"num":30,"verse":"Shimea his son, Haggiah his son, Asaiah his son."},{"num":31,"verse":"And these be they whom David set for to sing in the house of the Lord, after that the Ark had rest."},{"num":32,"verse":"And they ministered before the Tabernacle, even the Tabernacle of the Congregation with singing, until Solomon had built the house of the Lord in Jerusalem: then they continued in their office, according to their custom."},{"num":33,"verse":"And these ministered with their children: of the sons of Kohath, Heman a singer, the son of Joel, the son of Samuel,"},{"num":34,"verse":"The son of Elkanah, the son of Jeroham, the son of Eliel, the son of Toah,"},{"num":35,"verse":"The son of Zuph, the son of Elkanah, the son of Mahath, the son of Amasai,"},{"num":36,"verse":"The son of Elkanah, the son of Joel, the son of Azariah, the son of Zephaniah,"},{"num":37,"verse":"The son of Tahath, the son of Assir, the son of Ebiasaph, the son of Korah,"},{"num":38,"verse":"The son of Izhar, the son of Kohath, the son of Levi, the son of Israel,"},{"num":39,"verse":"And his brother Asaph stood on his right hand: and Asaph was the son of Berachiah, the son of Shimea,"},{"num":40,"verse":"The son of Michael, the son of Baaseiah, the son of Malchijah,"},{"num":41,"verse":"The son of Ethni, the son of Zerah, the son of Adaiah,"},{"num":42,"verse":"The son of Ethan, the son of Zimmah, the son of Shimei,"},{"num":43,"verse":"The son of Jahath, the son of Gershon, the son of Levi."},{"num":44,"verse":"And their brethren the sons of Merari were on the left hand, even Ethan the son of Kishi, the son of Abdi, the son of Malluch,"},{"num":45,"verse":"The son of Hashabiah, the son of Amaziah, the son of Hilkiah,"},{"num":46,"verse":"The son of Amzi, the son of Bani, the son of Shamer,"},{"num":47,"verse":"The son of Mahli, the son of Mushi, the son of Merari, the son of Levi."},{"num":48,"verse":"¶ And their brethren the Levites were appointed unto all the service of the Tabernacle of the house of God,"},{"num":49,"verse":"But Aaron and his sons burnt incense upon the altar of burnt offering, and on the altar of incense, for all that was to do in the most holy place, and to make an atonement for Israel according to all that Moses the servant of God had commanded."},{"num":50,"verse":"These are also the sons of Aaron, Eleazar his son, Phinehas his son, Abishua his son,"},{"num":51,"verse":"Bukki his son, Uzzi his son, Zerahiah his son,"},{"num":52,"verse":"Meraioth his son, Amariah his son, Ahitub his son,"},{"num":53,"verse":"Zadok his son, and Ahimaaz his son."},{"num":54,"verse":"¶ And these are the dwelling places of them throughout their towns and coasts, even of the sons of Aaron for the family of the Kohathites, for the lot was theirs."},{"num":55,"verse":"So they gave them Hebron in the land of Judah and the suburbs thereof round about it."},{"num":56,"verse":"But the field of the city, and the villages thereof they gave to Caleb the son of Jephunneh."},{"num":57,"verse":"And to the sons of Aaron they gave the cities of Judah for refuge, even Hebron and Libnah with their suburbs, and Jattir, and Eshtemoa with their suburbs,"},{"num":58,"verse":"And Hilen with her suburbs, and Debir with her suburbs,"},{"num":59,"verse":"And Ashan and her suburbs, and Beth Shemesh and her suburbs:"},{"num":60,"verse":"¶ And of the tribe of Benjamin, Geba and her suburbs, and Alemeth with her suburbs, and Anathoth with her suburbs: all their cities were thirteen cities by their families."},{"num":61,"verse":"And unto the sons of Kohath the remnant of the family of the tribe, even of the half tribe of the half of Manasseh, by lot ten cities."},{"num":62,"verse":"And to the sons of Gershon according to their families out of the tribe of Issachar, and out of the tribe of Asher, and out of the tribe of Naphtali, and out of the tribe of Manasseh in Bashan, thirteen cities."},{"num":63,"verse":"Unto the sons of Merari according to their families out of the tribe of Reuben, and out of the tribe of Gad, and out of the tribe of Zebulun, by lot twelve cities."},{"num":64,"verse":"Thus the children of Israel gave to the Levites cities with their suburbs."},{"num":65,"verse":"And they gave by lot out of the tribe of the children of Judah, and out of the tribe of the children of Simeon, and out of the tribe of the children of Benjamin, these cities, which they called by their names."},{"num":66,"verse":"And they of the families of the sons of Kohath, had cities and their coasts out of the tribe of Ephraim."},{"num":67,"verse":"And they gave unto them cities of refuge, Shechem in mount Ephraim, and her suburbs, and Gezer and her suburbs,"},{"num":68,"verse":"Jokmeam also and her suburbs, and Beth Horon with her suburbs,"},{"num":69,"verse":"And Aijalon and her suburbs, and Gath Rimmon and her suburbs."},{"num":70,"verse":"And out of the half tribe of Manasseh, Aner and her suburbs, and Bileam and her suburbs, for the families of the remnant of the sons of Kohath."},{"num":71,"verse":"Unto the sons of Gershon out of the family of the half tribe of Manasseh, Golan in Bashan, and her suburbs, and Ashtaroth with her suburbs."},{"num":72,"verse":"And out of the tribe of Issachar, Kedesh and her suburbs, Daberath and her suburbs,"},{"num":73,"verse":"Ramoth also and her suburbs, and Anem with her suburbs."},{"num":74,"verse":"And out of the tribe of Asher, Mashal and her suburbs, and Abdon and her suburbs,"},{"num":75,"verse":"And Hukok and her suburbs, and Rehob and her suburbs,"},{"num":76,"verse":"And out of the tribe of Naphtali, Kedesh in Galilee and her suburbs, and Hammon and her suburbs, and Kirjathaim and her suburbs."},{"num":77,"verse":"Unto the rest of the children of Merari were given out of the tribe of Zebulun Rimmon and her suburbs, Tabor and her suburbs,"},{"num":78,"verse":"And on the other side Jordan by Jericho, even on the Eastside of Jordan, out of the tribe of Reuben, Bezer in the wilderness with her suburbs, and Jahzah with her suburbs,"},{"num":79,"verse":"And Kedemoth with her suburbs, and Mephaath with her suburbs."},{"num":80,"verse":"And out of the tribe of Gad Ramoth in Gilead with her suburbs, and Mahanaim with her suburbs,"},{"num":81,"verse":"And Heshbon with her suburbs, and Jazer with her suburbs."}]