[{"header":"The Levites"},{"header":"The Musicians"},{"num":31,"verse":"These are the men David put in charge of the music in the Lord’s temple after the ark came to rest there. "},{"num":32,"verse":"They ministered with song in front of the tabernacle, the tent of meeting, until Solomon built the Lord’s temple in Jerusalem, and they performed their task according to the regulations given to them. "},{"num":33,"verse":"These are the men who served with their sons."},{"header":"Aaron’s Descendants"},{"num":48,"verse":"Their relatives, the Levites, were assigned to all the service of the tabernacle, God’s temple. "},{"num":49,"verse":"But Aaron and his sons did all the work of the most holy place. They presented the offerings on the altar of burnt offerings and on the altar of incense to make atonement for Israel according to all that Moses the servant of God had commanded."},{"header":"The Settlements of the Levites"},{"num":54,"verse":"These were the places assigned to Aaron’s sons from the Kohathite family for their settlements in their territory, because the first lot was for them. "},{"num":55,"verse":"They were given Hebron in the land of Judah and its surrounding pasturelands, "},{"num":56,"verse":"but the fields and villages around the city were given to Caleb son of Jephunneh. "},{"num":57,"verse":"Aaron’s sons were given:"},{"num":61,"verse":"To the rest of the Kohathites, 10 towns from half the tribe of Manasseh were assigned by lot."},{"num":62,"verse":"The Gershomites were assigned 13 towns from the tribes of Issachar, Asher, Naphtali, and Manasseh in Bashan according to their families."},{"num":63,"verse":"The Merarites were assigned by lot 12 towns from the tribes of Reuben, Gad, and Zebulun according to their families. "},{"num":64,"verse":"So the Israelites gave these towns and their pasturelands to the Levites. "},{"num":65,"verse":"They assigned by lot the towns named above from the tribes of the Judahites, Simeonites, and Benjaminites."},{"num":66,"verse":"Some of the families of the Kohathites were given towns from the tribe of Ephraim for their territory:"},{"num":71,"verse":"The Gershomites received:"},{"num":77,"verse":"The rest of the Merarites received:"}]