[{"header":"Descendants of Levi"},{"num":6,"verse":" The sons of Levi: Gershom, Kohath, and Merari. "},{"num":2,"verse":"The sons of Kohath: Amram, Izhar, Hebron, and Uzziel. "},{"num":3,"verse":"The children of Amram: Aaron, Moses, and Miriam. The sons of Aaron: Nadab, Abihu, Eleazar, and Ithamar. "},{"num":4,"verse":"Eleazar became the father of Phinehas, Phinehas of Abishua, "},{"num":5,"verse":"Abishua of Bukki, Bukki of Uzzi, "},{"num":6,"verse":"Uzzi of Zerahiah, Zerahiah of Meraioth, "},{"num":7,"verse":"Meraioth of Amariah, Amariah of Ahitub, "},{"num":8,"verse":"Ahitub of Zadok, Zadok of Ahimaaz, "},{"num":9,"verse":"Ahimaaz of Azariah, Azariah of Johanan, "},{"num":10,"verse":"and Johanan of Azariah (it was he who served as priest in the house that Solomon built in Jerusalem). "},{"num":11,"verse":"Azariah became the father of Amariah, Amariah of Ahitub, "},{"num":12,"verse":"Ahitub of Zadok, Zadok of Shallum, "},{"num":13,"verse":"Shallum of Hilkiah, Hilkiah of Azariah, "},{"num":14,"verse":"Azariah of Seraiah, Seraiah of Jehozadak; "},{"num":15,"verse":"and Jehozadak went into exile when the Lord sent Judah and Jerusalem into exile by the hand of Nebuchadnezzar."},{"num":16,"verse":" The sons of Levi: Gershom, Kohath, and Merari. "},{"num":17,"verse":"These are the names of the sons of Gershom: Libni and Shimei. "},{"num":18,"verse":"The sons of Kohath: Amram, Izhar, Hebron, and Uzziel. "},{"num":19,"verse":"The sons of Merari: Mahli and Mushi. These are the clans of the Levites according to their ancestry. "},{"num":20,"verse":"Of Gershom: Libni his son, Jahath his son, Zimmah his son, "},{"num":21,"verse":"Joah his son, Iddo his son, Zerah his son, Jeatherai his son. "},{"num":22,"verse":"The sons of Kohath: Amminadab his son, Korah his son, Assir his son, "},{"num":23,"verse":"Elkanah his son, Ebiasaph his son, Assir his son, "},{"num":24,"verse":"Tahath his son, Uriel his son, Uzziah his son, and Shaul his son. "},{"num":25,"verse":"The sons of Elkanah: Amasai and Ahimoth, "},{"num":26,"verse":"Elkanah his son, Zophai his son, Nahath his son, "},{"num":27,"verse":"Eliab his son, Jeroham his son, Elkanah his son. "},{"num":28,"verse":"The sons of Samuel: Joel his firstborn, the second Abijah. "},{"num":29,"verse":"The sons of Merari: Mahli, Libni his son, Shimei his son, Uzzah his son, "},{"num":30,"verse":"Shimea his son, Haggiah his son, and Asaiah his son."},{"header":"Musicians Appointed by David"},{"num":31,"verse":"These are the men whom David put in charge of the service of song in the house of the Lord, after the ark came to rest there. "},{"num":32,"verse":"They ministered with song before the tabernacle of the tent of meeting, until Solomon had built the house of the Lord in Jerusalem; and they performed their service in due order. "},{"num":33,"verse":"These are the men who served; and their sons were: Of the Kohathites: Heman, the singer, son of Joel, son of Samuel, "},{"num":34,"verse":"son of Elkanah, son of Jeroham, son of Eliel, son of Toah, "},{"num":35,"verse":"son of Zuph, son of Elkanah, son of Mahath, son of Amasai, "},{"num":36,"verse":"son of Elkanah, son of Joel, son of Azariah, son of Zephaniah, "},{"num":37,"verse":"son of Tahath, son of Assir, son of Ebiasaph, son of Korah, "},{"num":38,"verse":"son of Izhar, son of Kohath, son of Levi, son of Israel; "},{"num":39,"verse":"and his brother Asaph, who stood on his right, namely, Asaph son of Berechiah, son of Shimea, "},{"num":40,"verse":"son of Michael, son of Baaseiah, son of Malchijah, "},{"num":41,"verse":"son of Ethni, son of Zerah, son of Adaiah, "},{"num":42,"verse":"son of Ethan, son of Zimmah, son of Shimei, "},{"num":43,"verse":"son of Jahath, son of Gershom, son of Levi. "},{"num":44,"verse":"On the left were their kindred the sons of Merari: Ethan son of Kishi, son of Abdi, son of Malluch, "},{"num":45,"verse":"son of Hashabiah, son of Amaziah, son of Hilkiah, "},{"num":46,"verse":"son of Amzi, son of Bani, son of Shemer, "},{"num":47,"verse":"son of Mahli, son of Mushi, son of Merari, son of Levi; "},{"num":48,"verse":"and their kindred the Levites were appointed for all the service of the tabernacle of the house of God."},{"num":49,"verse":"But Aaron and his sons made offerings on the altar of burnt offering and on the altar of incense, doing all the work of the most holy place, to make atonement for Israel, according to all that Moses the servant of God had commanded. "},{"num":50,"verse":"These are the sons of Aaron: Eleazar his son, Phinehas his son, Abishua his son, "},{"num":51,"verse":"Bukki his son, Uzzi his son, Zerahiah his son, "},{"num":52,"verse":"Meraioth his son, Amariah his son, Ahitub his son, "},{"num":53,"verse":"Zadok his son, Ahimaaz his son."},{"header":"Settlements of the Levites"},{"num":54,"verse":"These are their dwelling places according to their settlements within their borders: to the sons of Aaron of the families of Kohathites—for the lot fell to them first— "},{"num":55,"verse":"to them they gave Hebron in the land of Judah and its surrounding pasture lands, "},{"num":56,"verse":"but the fields of the city and its villages they gave to Caleb son of Jephunneh. "},{"num":57,"verse":"To the sons of Aaron they gave the cities of refuge: Hebron, Libnah with its pasture lands, Jattir, Eshtemoa with its pasture lands, "},{"num":58,"verse":"Hilen with its pasture lands, Debir with its pasture lands, "},{"num":59,"verse":"Ashan with its pasture lands, and Beth-shemesh with its pasture lands. "},{"num":60,"verse":"From the tribe of Benjamin, Geba with its pasture lands, Alemeth with its pasture lands, and Anathoth with its pasture lands. All their towns throughout their families were thirteen."},{"num":61,"verse":"To the rest of the Kohathites were given by lot out of the family of the tribe, out of the half-tribe, the half of Manasseh, ten towns. "},{"num":62,"verse":"To the Gershomites according to their families were allotted thirteen towns out of the tribes of Issachar, Asher, Naphtali, and Manasseh in Bashan. "},{"num":63,"verse":"To the Merarites according to their families were allotted twelve towns out of the tribes of Reuben, Gad, and Zebulun. "},{"num":64,"verse":"So the people of Israel gave the Levites the towns with their pasture lands. "},{"num":65,"verse":"They also gave them by lot out of the tribes of Judah, Simeon, and Benjamin these towns that are mentioned by name."},{"num":66,"verse":"And some of the families of the sons of Kohath had towns of their territory out of the tribe of Ephraim. "},{"num":67,"verse":"They were given the cities of refuge: Shechem with its pasture lands in the hill country of Ephraim, Gezer with its pasture lands, "},{"num":68,"verse":"Jokmeam with its pasture lands, Beth-horon with its pasture lands, "},{"num":69,"verse":"Aijalon with its pasture lands, Gath-rimmon with its pasture lands; "},{"num":70,"verse":"and out of the half-tribe of Manasseh, Aner with its pasture lands, and Bileam with its pasture lands, for the rest of the families of the Kohathites."},{"num":71,"verse":"To the Gershomites: out of the half-tribe of Manasseh: Golan in Bashan with its pasture lands and Ashtaroth with its pasture lands; "},{"num":72,"verse":"and out of the tribe of Issachar: Kedesh with its pasture lands, Daberath with its pasture lands, "},{"num":73,"verse":"Ramoth with its pasture lands, and Anem with its pasture lands; "},{"num":74,"verse":"out of the tribe of Asher: Mashal with its pasture lands, Abdon with its pasture lands, "},{"num":75,"verse":"Hukok with its pasture lands, and Rehob with its pasture lands; "},{"num":76,"verse":"and out of the tribe of Naphtali: Kedesh in Galilee with its pasture lands, Hammon with its pasture lands, and Kiriathaim with its pasture lands. "},{"num":77,"verse":"To the rest of the Merarites out of the tribe of Zebulun: Rimmono with its pasture lands, Tabor with its pasture lands, "},{"num":78,"verse":"and across the Jordan from Jericho, on the east side of the Jordan, out of the tribe of Reuben: Bezer in the steppe with its pasture lands, Jahzah with its pasture lands, "},{"num":79,"verse":"Kedemoth with its pasture lands, and Mephaath with its pasture lands; "},{"num":80,"verse":"and out of the tribe of Gad: Ramoth in Gilead with its pasture lands, Mahanaim with its pasture lands, "},{"num":81,"verse":"Heshbon with its pasture lands, and Jazer with its pasture lands."}]