[{"header":"A Warning to Rich People"},{"num":5,"verse":"You rich people, listen to me. Cry and weep, because you will soon be suffering. "},{"num":2,"verse":"Your riches have rotted. Moths have eaten your clothes. "},{"num":3,"verse":"Your gold and silver have lost their brightness. Their dullness will be a witness against you. Your wanting more and more will eat your body like fire. You have stored up riches in these last days. "},{"num":4,"verse":"You have even failed to pay the workers who mowed your fields. Their pay is crying out against you. The cries of those who gathered the harvest have reached the ears of the Lord. He rules over all. "},{"num":5,"verse":"You have lived an easy life on earth. You have given yourselves everything you wanted. You have made yourselves fat like cattle that will soon be butchered. "},{"num":6,"verse":"You have judged and murdered people who aren’t guilty. And they weren’t even opposing you."},{"header":"Be Patient When You Suffer"},{"num":7,"verse":"Brothers and sisters, be patient until the Lord comes. See how the farmer waits for the land to produce its rich crop. See how patient the farmer is for the fall and spring rains. "},{"num":8,"verse":"You too must be patient. You must remain strong. The Lord will soon come back. "},{"num":9,"verse":"Brothers and sisters, don’t find fault with one another. If you do, you will be judged. And the Judge is standing at the door!"},{"num":10,"verse":"Brothers and sisters, think about the prophets who spoke in the name of the Lord. They are an example of how to be patient when you suffer. "},{"num":11,"verse":"As you know, we think that people who don’t give up are blessed. You have heard that Job was patient. And you have seen what the Lord finally did for him. The Lord is full of tender mercy and loving concern."},{"num":12,"verse":"My brothers and sisters, here is what is most important. Don’t make a promise by giving your word. Don’t promise by heaven or earth. And don’t promise by anything else to back up what you say. All you need to say is a simple “Yes” or “No.” If you do more than this, you will be judged."},{"header":"The Prayer of Faith"},{"num":13,"verse":"Is anyone among you in trouble? Then that person should pray. Is anyone among you happy? Then that person should sing songs of praise. "},{"num":14,"verse":"Is anyone among you sick? Then that person should send for the elders of the church to pray over them. They should ask the elders to anoint them with olive oil in the name of the Lord. "},{"num":15,"verse":"The prayer offered by those who have faith will make the sick person well. The Lord will heal them. If they have sinned, they will be forgiven. "},{"num":16,"verse":"So confess your sins to one another. Pray for one another so that you might be healed. The prayer of a godly person is powerful. Things happen because of it."},{"num":17,"verse":"Elijah was a human being, just as we are. He prayed hard that it wouldn’t rain. And it didn’t rain on the land for three and a half years. "},{"num":18,"verse":"Then he prayed again. That time it rained. And the earth produced its crops."},{"num":19,"verse":"My brothers and sisters, suppose one of you wanders away from the truth. And suppose someone brings that person back. "},{"num":20,"verse":"Then here is what I want you to remember. Anyone who keeps a sinner from going astray will save them from death. God will erase many sins by forgiving them."}]