[{"num":6,"verse":"Take heed that you do not your justice before men, to be seen by them: otherwise you shall not have a reward of your Father who is in heaven."},{"num":2,"verse":"Therefore when thou dost an almsdeed, sound not a trumpet before thee, as the hypocrites do in the synagogues and in the streets, that they may be honoured by men. Amen I say to you, they have received their reward."},{"num":3,"verse":"But when thou dost alms, let not thy left hand know what thy right hand doth."},{"num":4,"verse":"That thy alms may be in secret, and thy Father who seeth in secret will repay thee."},{"num":5,"verse":"And when ye pray, you shall not be as the hypocrites, that love to stand and pray in the synagogues and corners of the streets, that they may be seen by men: Amen I say to you, they have received their reward."},{"num":6,"verse":"But thou when thou shalt pray, enter into thy chamber, and having shut the door, pray to thy Father in secret: and thy Father who seeth in secret will repay thee."},{"num":7,"verse":"And when you are praying, speak not much, as the heathens. For they think that in their much speaking they may be heard."},{"num":8,"verse":"Be not you therefore like to them, for your Father knoweth what is needful for you, before you ask him."},{"num":9,"verse":"Thus therefore shall you pray: Our Father who art in heaven, hallowed be thy name."},{"num":10,"verse":"Thy kingdom come. Thy will be done on earth as it is in heaven."},{"num":11,"verse":"Give us this day our supersubstantial bread."},{"num":12,"verse":"And forgive us our debts, as we also forgive our debtors."},{"num":13,"verse":"And lead us not into temptation. But deliver us from evil. Amen."},{"num":14,"verse":"For if you will forgive men their offences, your heavenly Father will forgive you also your offences."},{"num":15,"verse":"But if you will not forgive men, neither will your Father forgive you your offences."},{"num":16,"verse":"And when you fast, be not as the hypocrites, sad. For they disfigure their faces, that they may appear unto men to fast. Amen I say to you, they have received their reward."},{"num":17,"verse":"But thou, when thou fastest anoint thy head, and wash thy face;"},{"num":18,"verse":"That thou appear not to men to fast, but to thy Father who is in secret: and thy Father who seeth in secret, will repay thee."},{"num":19,"verse":"Lay not up to yourselves treasures on earth: where the rust, and moth consume, and where thieves break through and steal."},{"num":20,"verse":"But lay up to yourselves treasures in heaven: where neither the rust nor moth doth consume, and where thieves do not break through, nor steal."},{"num":21,"verse":"For where thy treasure is, there is thy heart also."},{"num":22,"verse":"The light of thy body is thy eye. If thy eye be single, thy whole body shall be lightsome."},{"num":23,"verse":"But if thy eye be evil thy whole body shall be darksome. If then the light that is in thee, be darkness: the darkness itself how great shall it be!"},{"num":24,"verse":"No man can serve two masters. For either he will hate the one, and love the other: or he will sustain the one, and despise the other. You cannot serve God and mammon."},{"num":25,"verse":"Therefore I say to you, be not solicitous for your life, what you shall eat, nor for your body, what you shall put on. Is not the life more than the meat: and the body more than the raiment?"},{"num":26,"verse":"Behold the birds of the air, for they neither sow, nor do they reap, nor gather into barns: and your heavenly Father feedeth them. Are not you of much more value than they?"},{"num":27,"verse":"And which of you by taking thought, can add to his stature by one cubit?"},{"num":28,"verse":"And for raiment why are you solicitous? Consider the lilies of the field, how they grow: they labour not, neither do they spin."},{"num":29,"verse":"But I say to you, that not even Solomon in all his glory was arrayed as one of these."},{"num":30,"verse":"And if the grass of the field, which is to day, and to morrow is cast into the oven, God doth so clothe: how much more you, O ye of little faith?"},{"num":31,"verse":"Be not solicitous therefore, saying, What shall we eat: or what shall we drink, or wherewith shall we be clothed?"},{"num":32,"verse":"For after all these things do the heathens seek. For your Father knoweth that you have need of all these things."},{"num":33,"verse":"Seek ye therefore first the kingdom of God, and his justice, and all these things shall be added unto you."},{"num":34,"verse":"Be not therefore solicitous for to morrow; for the morrow will be solicitous for itself. Sufficient for the day is the evil thereof."}]