[{"header":"Teaching about Charity"},{"num":6,"verse":"“Make certain you do not perform your religious duties in public so that people will see what you do. If you do these things publicly, you will not have any reward from your Father in heaven."},{"num":2,"verse":"“So when you give something to a needy person, do not make a big show of it, as the hypocrites do in the houses of worship and on the streets. They do it so that people will praise them. I assure you, they have already been paid in full. "},{"num":3,"verse":"But when you help a needy person, do it in such a way that even your closest friend will not know about it. "},{"num":4,"verse":"Then it will be a private matter. And your Father, who sees what you do in private, will reward you."},{"header":"Teaching about Prayer(B)"},{"num":5,"verse":"“When you pray, do not be like the hypocrites! They love to stand up and pray in the houses of worship and on the street corners, so that everyone will see them. I assure you, they have already been paid in full. "},{"num":6,"verse":"But when you pray, go to your room, close the door, and pray to your Father, who is unseen. And your Father, who sees what you do in private, will reward you."},{"num":7,"verse":"“When you pray, do not use a lot of meaningless words, as the pagans do, who think that their gods will hear them because their prayers are long. "},{"num":8,"verse":"Do not be like them. Your Father already knows what you need before you ask him. "},{"num":9,"verse":"This, then, is how you should pray:"},{"num":14,"verse":"“If you forgive others the wrongs they have done to you, your Father in heaven will also forgive you. "},{"num":15,"verse":"But if you do not forgive others, then your Father will not forgive the wrongs you have done."},{"header":"Teaching about Fasting"},{"num":16,"verse":"“And when you fast, do not put on a sad face as the hypocrites do. They neglect their appearance so that everyone will see that they are fasting. I assure you, they have already been paid in full. "},{"num":17,"verse":"When you go without food, wash your face and comb your hair, "},{"num":18,"verse":"so that others cannot know that you are fasting—only your Father, who is unseen, will know. And your Father, who sees what you do in private, will reward you."},{"header":"Riches in Heaven(G)"},{"num":19,"verse":"“Do not store up riches for yourselves here on earth, where moths and rust destroy, and robbers break in and steal. "},{"num":20,"verse":"Instead, store up riches for yourselves in heaven, where moths and rust cannot destroy, and robbers cannot break in and steal. "},{"num":21,"verse":"For your heart will always be where your riches are."},{"header":"The Light of the Body(J)"},{"num":22,"verse":"“The eyes are like a lamp for the body. If your eyes are sound, your whole body will be full of light; "},{"num":23,"verse":"but if your eyes are no good, your body will be in darkness. So if the light in you is darkness, how terribly dark it will be!"},{"header":"God and Possessions(K)"},{"num":24,"verse":"“You cannot be a slave of two masters; you will hate one and love the other; you will be loyal to one and despise the other. You cannot serve both God and money."},{"num":25,"verse":"“This is why I tell you: do not be worried about the food and drink you need in order to stay alive, or about clothes for your body. After all, isn't life worth more than food? And isn't the body worth more than clothes? "},{"num":26,"verse":"Look at the birds: they do not plant seeds, gather a harvest and put it in barns; yet your Father in heaven takes care of them! Aren't you worth much more than birds? "},{"num":27,"verse":"Can any of you live a bit longer by worrying about it?"},{"num":28,"verse":"“And why worry about clothes? Look how the wild flowers grow: they do not work or make clothes for themselves. "},{"num":29,"verse":"But I tell you that not even King Solomon with all his wealth had clothes as beautiful as one of these flowers. "},{"num":30,"verse":"It is God who clothes the wild grass—grass that is here today and gone tomorrow, burned up in the oven. Won't he be all the more sure to clothe you? What little faith you have!"},{"num":31,"verse":"“So do not start worrying: ‘Where will my food come from? or my drink? or my clothes?’ "},{"num":32,"verse":"(These are the things the pagans are always concerned about.) Your Father in heaven knows that you need all these things. "},{"num":33,"verse":"Instead, be concerned above everything else with the Kingdom of God and with what he requires of you, and he will provide you with all these other things. "},{"num":34,"verse":"So do not worry about tomorrow; it will have enough worries of its own. There is no need to add to the troubles each day brings."}]