[[],[{"type":"prose","content":"`Take heed your kindness not to do before men, to be seen by them, and if not -- reward ye have not from your Father who [is] in the heavens;"}],[{"type":"prose","content":"whenever, therefore, thou mayest do kindness, thou mayest not sound a trumpet before thee as the hypocrites do, in the synagogues, and in the streets, that they may have glory from men; verily I say to you -- they have their reward!"}],[{"type":"prose","content":"`But thou, doing kindness, let not thy left hand know what thy right hand doth,"}],[{"type":"prose","content":"that thy kindness may be in secret, and thy Father who is seeing in secret Himself shall reward thee manifestly."}],[{"type":"prose","content":"`And when thou mayest pray, thou shalt not be as the hypocrites, because they love in the synagogues, and in the corners of the broad places -- standing -- to pray, that they may be seen of men; verily I say to you, that they have their reward."}],[{"type":"prose","content":"`But thou, when thou mayest pray, go into thy chamber, and having shut thy door, pray to thy Father who [is] in secret, and thy Father who is seeing in secret, shall reward thee manifestly."}],[{"type":"prose","content":"`And -- praying -- ye may not use vain repetitions like the nations, for they think that in their much speaking they shall be heard,"}],[{"type":"prose","content":"be ye not therefore like to them, for your Father doth know those things that ye have need of before your asking him;"}],[{"type":"prose","content":"thus therefore pray ye: `Our Father who [art] in the heavens! hallowed be Thy name."}],[{"type":"prose","content":"`Thy reign come: Thy will come to pass, as in heaven also on the earth."}],[{"type":"prose","content":"`Our appointed bread give us to-day."}],[{"type":"prose","content":"`And forgive us our debts, as also we forgive our debtors."}],[{"type":"prose","content":"`And mayest Thou not lead us to temptation, but deliver us from the evil, because Thine is the reign, and the power, and the glory -- to the ages. Amen."}],[{"type":"prose","content":"`For, if ye may forgive men their trespasses He also will forgive you -- your Father who [is] in the heavens;"}],[{"type":"prose","content":"but if ye may not forgive men their trespasses, neither will your Father forgive your trespasses."}],[{"type":"prose","content":"`And when ye may fast, be ye not as the hypocrites, of sour countenances, for they disfigure their faces, that they may appear to men fasting; verily I say to you, that they have their reward."}],[{"type":"prose","content":"`But thou, fasting, anoint thy head, and wash thy face,"}],[{"type":"prose","content":"that thou mayest not appear to men fasting, but to thy Father who [is] in secret, and thy Father, who is seeing in secret, shall reward thee manifestly."}],[{"type":"prose","content":"`Treasure not up to yourselves treasures on the earth, where moth and rust disfigure, and where thieves break through and steal,"}],[{"type":"prose","content":"but treasure up to yourselves treasures in heaven, where neither moth nor rust doth disfigure, and where thieves do not break through nor steal,"}],[{"type":"prose","content":"for where your treasure is, there will be also your heart."}],[{"type":"prose","content":"`The lamp of the body is the eye, if, therefore, thine eye may be perfect, all thy body shall be enlightened,"}],[{"type":"prose","content":"but if thine eye may be evil, all thy body shall be dark; if, therefore, the light that [is] in thee is darkness -- the darkness, how great!"}],[{"type":"prose","content":"`None is able to serve two lords, for either he will hate the one and love the other, or he will hold to the one, and despise the other; ye are not able to serve God and Mammon."}],[{"type":"prose","content":"`Because of this I say to you, be not anxious for your life, what ye may eat, and what ye may drink, nor for your body, what ye may put on. Is not the life more than the nourishment, and the body than the clothing?"}],[{"type":"prose","content":"look to the fowls of the heaven, for they do not sow, nor reap, nor gather into storehouses, and your heavenly Father doth nourish them; are not ye much better than they?"}],[{"type":"prose","content":"`And who of you, being anxious, is able to add to his age one cubit?"}],[{"type":"prose","content":"and about clothing why are ye anxious? consider well the lilies of the field; how do they grow? they do not labour, nor do they spin;"}],[{"type":"prose","content":"and I say to you, that not even Solomon in all his glory was arrayed as one of these."}],[{"type":"prose","content":"`And if the herb of the field, that to-day is, and to-morrow is cast to the furnace, God doth so clothe -- not much more you, O ye of little faith?"}],[{"type":"prose","content":"therefore ye may not be anxious, saying, What may we eat? or, What may we drink? or, What may we put round?"}],[{"type":"prose","content":"for all these do the nations seek for, for your heavenly Father doth know that ye have need of all these;"}],[{"type":"prose","content":"but seek ye first the reign of God and His righteousness, and all these shall be added to you."}],[{"type":"prose","content":"Be not therefore anxious for the morrow, for the morrow shall be anxious for its own things; sufficient for the day [is] the evil of it."}]]