[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(11) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Forth into the field.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Song of Solomon 2:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Song of Solomon 6:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The same reminiscence of the sweet courtship in the happy “woodland places.” It has been conjectured that this verse suggested to Milton the passage beginning, “To-morrow, ere fresh morning streak the East,” &c. (P. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "L. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "4:623, &c)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "7:10-13 The church, the believing soul, triumphs in its relation to Christ, and interest in him. She humbly desires communion with him. Let us walk together, that I may receive counsel, instruction, and comfort from thee; and may make known my wants and my grievances to thee, with freedom, and without interruption. Communion with Christ is what all that are made holy earnestly breathe after. And those who would converse with Christ, must go forth from the world. Wherever we are, we may keep up communion with God. Nor should we go where we cannot in faith ask him to go with us. Those who would go abroad with Christ, must begin early in the morning of their days; must begin every day with him, seek him early, seek him diligently. A gracious soul can reconcile itself to the poorest places, if it may have communion with God in them; but the most delightful fields will not satisfy, unless the Beloved is there. Let us not think to be satisfied with any earthly object. Our own souls are our vineyards; they should be planted with useful trees. We should often search whether we are fruitful in righteousness. Christ's presence will make the vine flourish, and the tender grapes appear, as the returning sun revives the gardens. If we can appeal to him, Thou knowest all things, thou knowest that I love thee; if his Spirit witness with our spirit, that our souls prosper, it is enough. And we must beg of him to search and try us, to discover us to ourselves. The fruits and exercises of graces are pleasant to the Lord Jesus. These must be laid up, and always ready; that by our bringing forth much fruit, he may be glorified. It is all from him, therefore it is fit it should be all for him.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "His desire is toward me - All his affection has me for its object. The bride proceeds to exercise her power over his loving will. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11. field—the country. \"The tender grape (Maurer translates, flowers) and vines\" occurred before (So 2:13). But here she prepares for Him all kinds of fruit old and new; also, she anticipates, in going forth to seek them, communion with Him in \"loves.\" \"Early\" implies immediate earnestness. \"The villages\" imply distance from Jerusalem. At Stephen's death the disciples were scattered from it through Judea and Samaria, preaching the word (Ac 8:4-25). Jesus Christ was with them, confirming the word with miracles. They gathered the old fruits, of which Jesus Christ had sown the seed (Joh 4:39-42), as well as new fruits.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "lodge—forsaking home for Jesus Christ's sake (Mt 19:29).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Let us go forth into the field; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that being retired from the crowd, we may more freely and sweetly converse together, and may observe the state of the fruits of the earth. In the villages; in one of the villages, as cities is put for one of the cities, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Judges 12:7",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 12:7",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Come, my beloved,.... The word come is often used by Christ, and here by the church, in imitation of him; see Sol 2:10. This call is the call of the church upon Christ, to make good his promise, Sol 7:8; and is an earnest desire after the presence of Christ, and the manifestations of his love; which desire is increased the more it is enjoyed; and it shows the sense she had of her own insufficiency for the work she was going about: she knew that visiting the several congregations of the saints would be to little purpose, unless Christ was with her, and therefore she urges him to it; not that he was backward and unwilling to go with her, but he chooses to seem so, to make his people the more earnest for his presence, and to prize it the more when they have it; and it is pleasing to him to hear them ask for it. The endearing character, \"my beloved\", is used by the church, not only to express her affection for Christ, and faith of interest in him, but as an argument to engage him to go along with her. Her requests follow; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "let us go forth into the field; from the city, where she had been in quest of Christ, and had now found him, Sol 5:7; into the country, for recreation and pleasure: the allusion may be to such who keep their country houses, to which they retire from the city, and take their walks in the fields, to see how the fruits grow, and enjoy the country air. The church is for going abroad into the fields; but then she would have Christ with her; walking in the fields yields no pleasure unless Christ is there; there is no recreation without him: the phrase expresses her desire of his presence everywhere, at home and abroad, in the city and the fields; and of her being with him alone, that she might tell him all her mind, and impart her love to him, which she could better do alone than in company it may also signify her desire to have the Gospel spread in the world, in the barren parts of it, which looked like uncultivated fields, the Gentile world; and so, in one of the Jewish Midrashes (c), these \"fields\", and the \"villages\" in the next clause, are interpreted of the nations of the world; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "let us lodge in the villages; which, though places of mean entertainment for food and lodging, yet, Christ being with her, were more eligible to her than the greatest affluence of good things without him; and, being places of retirement from the noise and hurry of the city, she chose them, that she might be free of the cares of life, and enjoy communion with Christ, which she would have continued; and therefore was desirous of \"lodging\", at least all night, as in Sol 1:13. Some (d) render the words, \"by\", \"in\", or \"among the Cyprus trees\"; see Sol 1:14; by which may be meant the saints, comparable to such trees for their excellency, fragrancy, and fruitfulness; and an invitation to lodge by or with these could not be unwelcome to Christ, they being the excellent in the earth, in whom is all his delight. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) Shir Hashirim Rabba in loc. (d) Junius & Tremellius, Piscator, Brightman, Michaelis. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(c) Shir Hashirim Rabba in loc. (d) Junius & Tremellius, Piscator, Brightman, Michaelis. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Come, my beloved, let us go forth into the field; let us lodge in the villages.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "let us lodge in the villages",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The verb ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "lûn",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " = ‘to pass the night,’ does not always mean a passing sojourn. Consequently there is no hint here that the home of the Shulammite and her lover was distant several days’ journey. The verb is often used where simply ‘dwelling,’ ‘remaining,’ is meant; but it must be admitted that the cases where this meaning is clear are nearly all figurative, e.g. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 19:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 41:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 49:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 5:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "in the villages",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "bak-kěphârîm",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " may mean ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "among the henna flowers",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as in ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Song of Solomon 4:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "among the villages",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Either signification would give a good meaning here, but perhaps the former is preferable. ‘Let us dwell among the henna flowers’ would suit the tone of the passage best.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verses 11, 12.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Come, my beloved, let us go forth into the field; let us lodge in the",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "  ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "villages",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Let us get up early to the vineyards; let us see whether the vine hath budded and its blossom be open, and the pomegranates be in flower: there will I give thee my love.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " All true poets will sympathize with the exquisite sentiment of the bride in this passage. The solitude and glory and reality of external nature are dearer to her than the bustle and splendour of the city and of the court. By \"the field\" is meant the country generally. The village or little town surrounded with vineyards and gardens was the scene of Shulamith's early life, and would always be delightful to her. The word is the plural of an unused form. It is found in the form ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "copher",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 6:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), meaning \"a district of level country.\" Delitzsch renders, \"let us get up early,\" rather differently - \"in the morning we will start\" - but the meaning is the same. The word ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "dodhai",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"my love,\" is \"the evidences or expressions of my love\" (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Song of Solomon 4:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Song of Solomon 1:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). No doubt the bride is speaking in the springtime, the Wonnemond of May, when the pulses beat in sympathy with the rising life of nature. Song of Solomon 7:11",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "11 Up, my lover, we will go into the country,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "     Lodge in the villages.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Hitzig here begins a new scene, to which he gives the superscription: \"Shulamith making haste to return home with her lov.\" The advocate of the shepherd-hypothesis thinks that the faithful Shulamith, after hearing Solomon's panegyric, shakes her head and says: \"I am my beloved's.\" To him she calls, \"Come, my beloved;\" for, as Ewald seeks to make this conceivable: the golden confidence of her near triumph lifts her in spirit forthwith above all that is present and all that is actual; only to him may she speak; and as if she were half here and half already there, in the midst of her rural home along with him, she says, \"Let us go out into the fields,\" etc. In fact, there is nothing more incredible than this Shulamitess, whose dialogue with Solomon consists of Solomon's addresses, and of answers which are directed, not to Solomon, but in a monologue to her shepherd; and nothing more cowardly and more shadowy than this lover, who goes about in the moonlight seeking his beloved shepherdess whom he has lost, glancing here and there through the lattices of the windows and again disappearing. How much more justifiable is the drama of the Song by the French Jesuit C. F. Menestrier (born in Sion 1631, died 1705), who, in his two little works on the opera and the ballet, speaks of Solomon as the creator of the opera, and regards the Song as a shepherd-play, in which his love-relation to the daughter of the king of Egypt is set forth under the allegorical figures of the love of a shepherd and a shepherdess! ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Vid., Eugne Despris in the Revue politique et litteraire 1873. The idea was not new. This also was the sentiment of Fray Luis de Leon; vid., his Biographie by Wilkens (1866), p. 209.)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "For Shulamith is thought of as a רעה shepherdess, Sol 1:8, and she thinks of Solomon as a רעה shepherd. She remains so in her inclination even after her elevation to the rank of a queen. The solitude and glory of external nature are dearer to her than the bustle and splendour of the city and the court. Hence her pressing out of the city to the country. השׂדה is local, without external designation, like rus (to the country).     כּפרים (here and at 1 Chronicles 27:25) is plur. of the unused form כּפר (constr. כּפר, Joshua 18:24) or כּפר, Arab. kafar (cf. the Syr. dimin. kafrûno, a little town), instead of which it is once pointed כּפר,    1 Samuel 6:18, of that name of a district of level country with which a multitude of later Palest. names of places, such as כּפר נחוּם, are connected. Ewald, indeed, understands kephārim as at Sol 4:13 : we will lodge among the fragrant Al-henna bushes. But yet בּכּף cannot be equivalent to תּחת הכפרים; and since לין (probably changed from ליל) and השׁכים,   Sol 7:13, stand together, we must suppose that they wished to find a bed in the henna bushes; which, if it were conceivable, would be too gipsy-like, even for a pair of lovers of the rank of shepherds (vid., Job 30:7). No. Shulamith's words express a wish for a journey into the country: they will there be in freedom, and at night find shelter (בכף, as 1 Chronicles 27:25 and Nehemiah 6:2, where also the plur. is similarly used), now in this and now in that country place. Spoken to the supposed shepherd, that would be comical, for a shepherd does not wander from village to village; and that, returning to their home, they wished to turn aside into villages and spend the night there, cannot at all be the meaning. But spoken of a shepherdess, or rather a vine-dresser, who has been raised to the rank of queen, it accords with her relation to Solomon, - they are married, - as well as with the inexpressible impulse of her heart after her earlier homely country-life. The former vine-dresser, the child of the Galilean hills, the lily of the valley, speaks in the verses following. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "For Shulamith is thought of as a רעה shepherdess, Sol 1:8, and she thinks of Solomon as a רעה shepherd. She remains so in her inclination even after her elevation to the rank of a queen. The solitude and glory of external nature are dearer to her than the bustle and splendour of the city and the court. Hence her pressing out of the city to the country. השׂדה is local, without external designation, like rus (to the country).     כּפרים (here and at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 27:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") is plur. of the unused form כּפר (constr. כּפר, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Joshua 18:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") or כּפר, Arab. kafar (cf. the Syr. dimin. kafrûno, a little town), instead of which it is once pointed כּפר,    ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Samuel 6:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", of that name of a district of level country with which a multitude of later Palest. names of places, such as כּפר נחוּם, are connected. Ewald, indeed, understands kephārim as at Sol 4:13 : we will lodge among the fragrant Al-henna bushes. But yet בּכּף cannot be equivalent to תּחת הכפרים; and since לין (probably changed from ליל) and השׁכים,   Sol 7:13, stand together, we must suppose that they wished to find a bed in the henna bushes; which, if it were conceivable, would be too gipsy-like, even for a pair of lovers of the rank of shepherds (vid., ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 30:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). No. Shulamith's words express a wish for a journey into the country: they will there be in freedom, and at night find shelter (בכף, as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Chronicles 27:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Nehemiah 6:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where also the plur. is similarly used), now in this and now in that country place. Spoken to the supposed shepherd, that would be comical, for a shepherd does not wander from village to village; and that, returning to their home, they wished to turn aside into villages and spend the night there, cannot at all be the meaning. But spoken of a shepherdess, or rather a vine-dresser, who has been raised to the rank of queen, it accords with her relation to Solomon, - they are married, - as well as with the inexpressible impulse of her heart after her earlier homely country-life. The former vine-dresser, the child of the Galilean hills, the lily of the valley, speaks in the verses following. ",
            "children": []
          }
        ]
      }
    ]
  }
]