[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(3) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ishmael also slew all the Jews. . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—We wonder at first that ten men were able to effect so much. It does not follow, however, that the massacre went beyond the Jews and Chaldæan officers who were sharing Gedaliah’s hospitality, and they may easily have been surprised, like Gedaliah, unarmed, and in the act of feasting. Possibly, too, the ten princes may each have brought their retinue of attendants. Greek history presents two analogous massacres—that of the Persian generals by Alexander, the son of Amyntas (Herod, v. 19, 20); and that of Archias and Leontiades, the tyrants of Thebes, by Pelopidas and his associates. The massacre in this case was so complete that none escaped to tell the tale (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 41:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The italics in the last clause of the verse indicate that the conjunction “and” is not in the Hebrew, and that the words, “the men of war,” are in apposition with the previous clause, and limit their extent.",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Benson CommentaryJeremiah 41:3-4. Ishmael also slew all the Jews and the men of war — That is, all that joined in opposing him, and in assisting Gedaliah: for several of the commanders, as well as the greater part of the people, were still left alive, as appears by the sequel of the story. And on the second day after, &c., no man knew it — That is, no man who lived at any considerable distance from Mizpah, for Ishmael undoubtedly used every means in his power to keep this slaughter secret, lest the news of it should reach the ears of some of the Chaldean commanders, and so he should be prevented from making his escape.Matthew Henry's Concise Commentary41:1-10 Those who hate the worshippers of God, often put on the appearance of piety, that they may the easier hurt them. As death often meets men where they least expect it, we should continually search whether we are in such a state and frame of mind, as we would wish to be found in when called to appear before our Judge. Sometimes the ransom of a man's life is his riches. But those who think to bribe death, saying, Slay us not, for we have treasures in the field, will find themselves wretchedly deceived. This melancholy history warns us, never to be secure in this world. We never can be sure of peace on this side heaven.Barnes' Notes on the BibleThe seventh month - Gedaliah's government lasted less than two months.Even - Rather, and. Ishmael was descended probably from Elishama the son of David 2 Samuel 5:16. Ten grandees each with his retinue would have aroused suspicion, but the smallness of Ishmael's following put Gedaliah completely off his guard. Jamieson-Fausset-Brown Bible Commentary3. slew all the Jews—namely, the attendants and ministers of Gedaliah; or, the military alone, about his person; translate, \"even (not 'and,' as English Version) the men of war.\" The main portion of the people with Gedaliah, including Jeremiah, Ishmael carried away captive (Jer 41:10, 16).Matthew Poole's Commentary It appeareth from Jeremiah 41:10, that by all the Jews here must be understood only all those who were about the court of Gedaliah, for it is there said that he carried away many that were with him. Gill's Exposition of the Entire BibleIshmael also slew all the Jews that were with him, even with Gedaliah, at Mizpah,.... Not only those that were at table, but that were in the city also. Josephus (f) says, that having slain those that were at the feast with him, he went out in the night, and slew all the Jews in the city, and the soldiers that were left by the Babylonians in it; but this cannot be understood of all the individuals there, or of the main body of the people, for they were carried captive by him, Jeremiah 41:9; but of those that opposed him, or were able to avenge the death of their governor, and he might suspect would do it: and the Chaldeans that were found there, and the men of war; or, \"even the men of war\" (g); this describes more particularly who they were that were slain, those of the Jews, and especially the Chaldeans, who were in military service; either the bodyguards of the governor, or the city guards, or both, whom Ishmael thought it advisable to cut off, lest they should fall upon him, and revenge the death of Gedaliah, and prevent his further designs. (f) Antiqu. l. 10. c. 9. sect. 4. (g)   \"inquam viros belli\", Schmidt; \"bellatores scilicet\", Piscator. Geneva Study BibleIshmael also slew all the Jews that were with him, even with Gedaliah, at Mizpah, and the Chaldeans that were found there, and the men of war.",
        "children": [
          {
            "element": "p",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Benson Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Jeremiah 41:3-4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Ishmael also slew all the Jews and the men of war ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "— That is, all that joined in opposing him, and in assisting Gedaliah: for several of the commanders, as well as the greater part of the people, were still left alive, as appears by the sequel of the story. ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "And on the second day after, &c., no man knew it ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "— That is, no man who lived at any considerable distance from Mizpah, for Ishmael undoubtedly used every means in his power to keep this slaughter secret, lest the news of it should reach the ears of some of the Chaldean commanders, and so he should be prevented from making his escape.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Matthew Henry's Concise Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "41:1-10 Those who hate the worshippers of God, often put on the appearance of piety, that they may the easier hurt them. As death often meets men where they least expect it, we should continually search whether we are in such a state and frame of mind, as we would wish to be found in when called to appear before our Judge. Sometimes the ransom of a man's life is his riches. But those who think to bribe death, saying, Slay us not, for we have treasures in the field, will find themselves wretchedly deceived. This melancholy history warns us, never to be secure in this world. We never can be sure of peace on this side heaven.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Barnes' Notes on the Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "The seventh month - Gedaliah's government lasted less than two months.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "Even - Rather, and. Ishmael was descended probably from Elishama the son of David 2 Samuel 5:16. Ten grandees each with his retinue would have aroused suspicion, but the smallness of Ishmael's following put Gedaliah completely off his guard. ",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Jamieson-Fausset-Brown Bible Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "3. slew all the Jews—namely, the attendants and ministers of Gedaliah; or, the military alone, about his person; translate, \"even (not 'and,' as English Version) the men of war.\" The main portion of the people with Gedaliah, including Jeremiah, Ishmael carried away captive (Jer 41:10, 16).",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Matthew Poole's Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " It appeareth from ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Jeremiah 41:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", that by all the Jews here must be understood only all those who were about the court of Gedaliah, for it is there said that he carried away many that were with him. ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Gill's Exposition of the Entire Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Ishmael also slew all the Jews that were with him, even with Gedaliah, at Mizpah,.... Not only those that were at table, but that were in the city also. Josephus (f) says, that having slain those that were at the feast with him, he went out in the night, and slew all the Jews in the city, and the soldiers that were left by the Babylonians in it; but this cannot be understood of all the individuals there, or of the main body of the people, for they were carried captive by him, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 41:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; but of those that opposed him, or were able to avenge the death of their governor, and he might suspect would do it: ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "and the Chaldeans that were found there, and the men of war; or, \"even the men of war\" (g); this describes more particularly who they were that were slain, those of the Jews, and especially the Chaldeans, who were in military service; either the bodyguards of the governor, or the city guards, or both, whom Ishmael thought it advisable to cut off, lest they should fall upon him, and revenge the death of Gedaliah, and prevent his further designs. ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "(f) Antiqu. l. 10. c. 9. sect. 4. (g)   \"inquam viros belli\", Schmidt; \"bellatores scilicet\", Piscator. ",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Geneva Study Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse2",
            "text": "Ishmael also slew all the Jews that were with him, even with Gedaliah, at Mizpah, and the Chaldeans that were found there, and the men of war.",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Jews on their return from the exile used to keep the third day of the seventh month (Tisri) as a fast in memory of Ishmael’s deed (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 7:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 8:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "even the men of war",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Gedaliah’s body-guard. But the words are absent, probably rightly, from LXX.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 3.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The Chaldeans.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Gedaliah's Chaldean bodyguard. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And the men of war;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " rather, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "even the men of war.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Jewish as well as Chaldean warriors are meant; the non-military Jews, including the prophet, were carried away captive (see vers. 10,16). Jeremiah 41:3",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Murder of Gedaliah and his followers, as well as other Jews, by Ishmael. - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 41:1-3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The warning of Johanan had been only too well founded. In the seventh month - only two months, therefore, after the destruction of Jerusalem and the appointment of Gedaliah as governor - Ishmael came with the men to Mizpah, and was hospitably received by Gedaliah and invited to his table. Ishmael is here more exactly described as to his family descent, for the purpose of throwing a stronger light upon the exceeding cruelty of the murders afterwards ascribed to him. He was the son of Nethaniah, the son of Elishama - perhaps the secretary of state mentioned ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 36:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or more likely the son of David who bore this name, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 5:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 3:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 14:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; so that Ishmael would belong to a lateral branch of the house of David, be of royal extraction, and one of the royal lords. ורבּי המּלך cannot be joined with Ishmael as the subject, because in what follows there is no further mention made of the royal lords, but only of Ishmael and his ten men; it belongs to what precedes, מזּרע המּלוּכּה, so that we must repeat מן before רבּי. The objections of Ngelsbach to this view will not stand examination. It is not self-evident that Ishmael, because he was of royal blood, was therefore also one of the royal nobles; for the רבּים certainly did not form a hereditary caste, but were perhaps a class of nobles in the service of the king, to which class the princes did not belong simply in virtue of their being princes. But the improbability that Ishmael should have been able with ten men to overpower the whole of the Jewish followers of Gedaliah, together with the Chaldean warriors, and (according to ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 41:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") out of eighty men to kill some, making prisoners of the rest, is not so great as to compel us to take רבּי המּלך in such a meaning as to make it stand in contradiction with the statement, repeated twice, over, that Ishmael, with his ten men, did all this. Eleven men who are determined to commit murder can kill a large number of persons who are not prepared against such an attempt, and may also keep a whole district in terror.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: There is still less ground, with Hitzig, Graf, and Ngelsbach, for assuming that ורבּי המּלך is a gloss that has crept into the text. The fact that רבּים, which is used here, is elsewhere applied only to Chaldean nobles, is insufficient to show this; and even Ewald has remarked that \"the last king (Zedekiah) may well be supposed to have appointed a number of grandees, after the example of the Chaldeans, and given them, too, Chaldean names.\")",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"And they did eat bread there together,\" i.e., they were invited by Gedaliah to his table. While at meat, Ishmael and his ten men rose and slew Gedaliah with the sword. On account of ויּמת אתו, which comes after, Hitzig and Graf would change ויּכּוּ into ויּכּוּ, he slew him, Gedaliah; this alteration is possibly warranted, but by no means absolutely necessary. The words 'ויּמת אתו וגו, \"and he killed him,\" contain a reflection of the narrator as to the greatness of the crime; in conformity with the facts of the case, the murder is ascribed only to the originator of the deed, since the ten men of Ishmael's retinue were simply his executioners. Besides Gedaliah, Ishmael killed \"all the Jews that were with him, with Gedaliah in Mizpah, and the Chaldeans that were found there, the men of war.\" The very expression shows that, of the Jews, only those are meant who were present in the house with Gedaliah, and, of the Chaldean soldiers, only those warriors who had been allowed him as a guard, who for the time being were his servants, and who, though they were not, as Schmidt thinks, hausto liberalius vino inebriati, yet, as Chr. B. Michaelis remarks, were tunc temporis inermes et imparati. The Jews of post-exile times used to keep the third day of the seventh month as a fast-day, in commemoration of the murder of Gedaliah; see on Zechariah 7:3. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"And they did eat bread there together,\" i.e., they were invited by Gedaliah to his table. While at meat, Ishmael and his ten men rose and slew Gedaliah with the sword. On account of ויּמת אתו, which comes after, Hitzig and Graf would change ויּכּוּ into ויּכּוּ, he slew him, Gedaliah; this alteration is possibly warranted, but by no means absolutely necessary. The words 'ויּמת אתו וגו, \"and he killed him,\" contain a reflection of the narrator as to the greatness of the crime; in conformity with the facts of the case, the murder is ascribed only to the originator of the deed, since the ten men of Ishmael's retinue were simply his executioners. Besides Gedaliah, Ishmael killed \"all the Jews that were with him, with Gedaliah in Mizpah, and the Chaldeans that were found there, the men of war.\" The very expression shows that, of the Jews, only those are meant who were present in the house with Gedaliah, and, of the Chaldean soldiers, only those warriors who had been allowed him as a guard, who for the time being were his servants, and who, though they were not, as Schmidt thinks, hausto liberalius vino inebriati, yet, as Chr. B. Michaelis remarks, were tunc temporis inermes et imparati. The Jews of post-exile times used to keep the third day of the seventh month as a fast-day, in commemoration of the murder of Gedaliah; see on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 7:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      }
    ]
  }
]