[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(15) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And the four angels . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Better, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And there were loosed the four angels who had been made ready unto",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for, i.e.,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ready for) ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (not “an hour,” but ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the) hour, and day, and month, and year, that they should slay the third part of mankind.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The English version reads as though the hour, day, month and year were to be understood as the length of time over which this plague of war should last. This idea has been adopted by many of the historical school of interpreters, and great ingenuity has been exercised to find some period which exactly corresponds with this, and during which disastrous wars prevailed. But the expression (“made ready unto the hour,” &c.) is not to be taken to imply that such was the duration of the plague; it implies that the loosing of the angels would take place at a definite period, the year, month, day and hour of which were known; the expression corresponds somewhat with our Lord’s words, “Of that day and hour knoweth no man.” It reminds us that there is a period—an unknown period, but nevertheless a certain period—at which the latent powers of retribution wake and begin to avenge themselves, at which the restraints which have withheld the long-deserved scourges are removed. Men and nations little think of this. Peace they cry, where there is no peace, for they have been by their sins mining the ground under their feet, or dwelling in that abode of false security which Bunyan might have called the city of Meanwell, and that abode is built on the sands; and when the angels of judgment are loosed, and the restraining influences of public opinion broken, the tempest is abroad, the frail house of formal religion falls, and the time of testing leaves its inmates unsheltered. Happy only are they who are ready for the hour of the Lord’s return. The angels are made ready that they should kill the third part of mankind. The way in which this slaughter is to take place is explained in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 9:17-18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : it is a wide and devastating slaughter carrying away a large portion of the human race.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9:13-21 The sixth angel sounded, and here the power of the Turks seems the subject. Their time is limited. They not only slew in war, but brought a poisonous and ruinous religion. The antichristian generation repented not under these dreadful judgments. From this sixth trumpet learn that God can make one enemy of the church a scourge and a plague to another. The idolatry in the remains of the eastern church and elsewhere, and the sins of professed Christians, render this prophecy and its fulfilment more wonderful. And the attentive reader of Scripture and history, may find his faith and hope strengthened by events, which in other respects fill his heart with anguish and his eyes with tears, while he sees that men who escape these plagues, repent not of their evil works, but go on with idolatries, wickedness, and cruelty, till wrath comes upon them to the utmost.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the four angels were loosed - Who had this mighty host under restraint. The loosening of the angels was, in fact, also a letting loose of all these hosts, that they might accomplish the work which they were commissioned to do.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Which were prepared - See Revelation 9:7. The word used here properly refers to what is made ready, suited up, arranged for anything: as persons prepared for a journey, horses for battle, a road for travelers, food for the hungry, a house to live in, etc. See Robinson's Lexicon, sub. voce Ἑτοιμάζω  Hetoimazō. As used here, the word means \"that whatever was necessary to prepare these angels\" - the leaders of this host - for the work which they were commissioned to perform, was now done, and that they stood in a state of readiness to execute the design. In the fulfillment of this it will be necessary to look for some arrangements existing in the vicinity of the Euphrates, by which these restrained hosts were in a state of readiness to be summoned forth to the execution of this work, or in such a condition that they would go forth spontaneously if the restraints existing were removed.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Which were prepared - See ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 9:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The word used here properly refers to what is made ready, suited up, arranged for anything: as persons prepared for a journey, horses for battle, a road for travelers, food for the hungry, a house to live in, etc. See Robinson's Lexicon, sub. voce Ἑτοιμάζω  Hetoimazō. As used here, the word means \"that whatever was necessary to prepare these angels\" - the leaders of this host - for the work which they were commissioned to perform, was now done, and that they stood in a state of readiness to execute the design. In the fulfillment of this it will be necessary to look for some arrangements existing in the vicinity of the Euphrates, by which these restrained hosts were in a state of readiness to be summoned forth to the execution of this work, or in such a condition that they would go forth spontaneously if the restraints existing were removed.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "For an hour, ... - Margin, \"at.\" The Greek - εἰς  eis - means properly \"unto, with reference to\"; and the sense is, that, with reference to that hour, they had all the requisite preparation. Prof. Stuart explains it as meaning that they were \"prepared for the particular year, month, day, and hour, destined by God for the great catastrophe which is to follow.\" The meaning, however, rather seems to be that they were prepared, not for the commencement of such a period, but they were prepared for the whole period indicated by the hour, the day, the month, and the year; that is, that the continuance of this \"woe\" would extend along through the whole period. For:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) this is the natural interpretation of the word \"for\" - εἰς  eis;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(b) it makes the whole sentence intelligible - for though it might be proper to say of anything that it was \"prepared for an hour,\" indicating the commencement of what was to be done, it is not usual to say of anything that it is \"prepared for an hour, a month, a day, a year,\" when the design is merely to indicate the beginning of it; and,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) it is in accordance with the prediction respecting the first \"woe\" Revelation 9:5, where the time is specified in language similar to this, to wit, \"five months.\" It seems to me, therefore, that we are to regard the time here mentioned as a prophetic indication of the period during which this woe would continue.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(c) it is in accordance with the prediction respecting the first \"woe\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 9:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where the time is specified in language similar to this, to wit, \"five months.\" It seems to me, therefore, that we are to regard the time here mentioned as a prophetic indication of the period during which this woe would continue.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "An hour, and a day, and a month, and a year - If this were to be taken literally, it would, of course, be but little more than a year. If it be taken, however, in the common prophetic style, where a day is put for a year (see the notes on Daniel 9:24 ff; also Editor's Preface, p. xxv. etc.), then the amount of time (360 + 30 + 1 + an hour) would be 391 years, and the portion of a year indicated by an hour - a twelfth part or twenty-fourth part, according as the day was supposed to be divided into twelve or twenty-four hours. That this is the true view seems to be clear, because this accords with the usual style in this book; because it can hardly be supposed that the \"preparation\" here referred to would have been for so brief a period as the time would be if literally interpreted; and because the mention of so small a portion of time as an \"hour,\" if literally taken, would be improbable in so great transactions. The fair interpretation, therefore, will require us to find some events that will fill up the period of about 391 years.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "An hour, and a day, and a month, and a year - If this were to be taken literally, it would, of course, be but little more than a year. If it be taken, however, in the common prophetic style, where a day is put for a year (see the notes on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Daniel 9:24",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ff; also Editor's Preface, p. xxv. etc.), then the amount of time (360 + 30 + 1 + an hour) would be 391 years, and the portion of a year indicated by an hour - a twelfth part or twenty-fourth part, according as the day was supposed to be divided into twelve or twenty-four hours. That this is the true view seems to be clear, because this accords with the usual style in this book; because it can hardly be supposed that the \"preparation\" here referred to would have been for so brief a period as the time would be if literally interpreted; and because the mention of so small a portion of time as an \"hour,\" if literally taken, would be improbable in so great transactions. The fair interpretation, therefore, will require us to find some events that will fill up the period of about 391 years.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "For to slay the third part of men - Compare Revelation 8:7, Revelation 8:9,Revelation 8:12. The meaning here is, that the immense host which was restrained on the Euphrates would, when loosed, spread desolation over about a third part of the world. We are not to suppose that this is to be understood in exactly a literal sense; but the meaning is, that the desolation would be so widespread that it would seem to embrace a third of the world. No such event as the cutting off of a few thousands of Jews in the siege of Jerusalem would correspond with the language here employed, and we must look for events more general and more disastrous to mankind at large. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "For to slay the third part of men - Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 8:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 8:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 8:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The meaning here is, that the immense host which was restrained on the Euphrates would, when loosed, spread desolation over about a third part of the world. We are not to suppose that this is to be understood in exactly a literal sense; but the meaning is, that the desolation would be so widespread that it would seem to embrace a third of the world. No such event as the cutting off of a few thousands of Jews in the siege of Jerusalem would correspond with the language here employed, and we must look for events more general and more disastrous to mankind at large. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "15. were—\"which had been prepared\" [Tregelles rightly].",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for an hour, and a day, and a month, and a year—rather as Greek, \"for (that is, against) THE hour, and day, and month, and year,\" namely, appointed by God. The Greek article (teen), put once only before all the periods, implies that the hour in the day, and the day in the month, and the month in the year, and the year itself, had been definitely fixed by God. The article would have been omitted had a sum-total of periods been specified, namely, three hundred ninety-one years and one month (the period from A.D. 1281, when the Turks first conquered the Christians, to 1672, their last conquest of them, since which last date their empire has declined).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "slay—not merely to \"hurt\" (Re 9:10), as in the fifth trumpet.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "third part—(See on [2696]Re 8:7-12).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "of men—namely, of earthy men, Re 8:13, \"inhabiters of the earth,\" as distinguished from God's sealed people (of which the sealed of Israel, Re 7:1-8, form the nucleus).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "For an hour, and a day, and a month, and a year; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that is, say some, for any time whatsoever God would have them move; or for that certain time which God had determined; but Mr. Mede hath here a peculiar notion; he observeth that an hour, and a day, and a month, and a year, make just three hundred and ninety-six years. In a year are three hundred and sixty-five days in a month thirty, which make three hundred and ninety-five, to which add the odd day, they make three hundred and ninety-six. The Turks began their empire under Ottoman, who began his reign Anno 1296: but their leader, Tangrolipix, upon the taking of Bagdad was inaugurated, and put on the imperial robe, Anno 1057. Constantinople was taken by them Anno 1453, between which are just three hundred and ninety-six years. In which time they slew a numberless number of men, called here ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "the third part.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the four angels were loosed,.... The time being come, fixed by the decrees of God, making use of the Turks for the destruction of the eastern empire, the restraints of divine Providence were taken off from them, and they were suffered to pass the river Euphrates; they were let loose like so many furies, and in a little time overran and destroyed the whole empire, and settled their own, now called the Turkish or Ottoman empire; and which was done about the year 1301. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Which were prepared for an hour and a day, and a month, and a year,  ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for to slay the third part of men; which may in general denote their readiness, vigilance, and quick dispatch: they lay for a good while hovering over the banks of the river Euphrates, as if they were waiting for an order, or a commission to go over it: they were ready not only at a year's, a month's, a day's, but at an hour's warning, and all of them together; and as soon as ever they had the divine permission, they lost no time; they improved every opportunity, every year, every month, every day, every hour, to settle and enlarge their dominions to the ruin of others; and in a very short time did they accomplish what they desired: though others think this refers to a certain time fixed by God, in which they should be employed in killing men; and the sense is, that these people were prepared in the purposes and decrees of God, or were appointed for such a length of time here signified, by several dates, in which they should destroy a large multitude of men, by way of punishment for their idolatries, murders, sorceries, fornication, and thefts, Revelation 9:20. An hour, which is the twenty fourth of a day or year, in the prophetic style, is fifteen days, and a day is a year, and a month is thirty years, and a year is three hundred sixty five years and a quarter, or ninety one days; in all, three hundred and ninety six years, and a hundred and six days; which is the precise time between A. D. 1057, when the Turkish empire begun, the empire of the Saracens being entirely demolished by Togrul Beg, or Tangrolipix, and A. D. 1453, in which year Constantinople was taken by the Turks, and an end put to the eastern Roman empire, signified by the third part of men; or else this space of time may be reckoned from the date of Ottoman's reign, May 19, 1301, which, to September 1, 1697, is just this term of time, when Prince Eugene obtained a remarkable victory over the Turks, the effect of which was the peace at Carlowitz the next year, since which time the Turks have done but little in Europe: and by this it should seem that their time of killing men here is over, and that their own destruction is hastening on. Mr. Daubuz rejects these computations, since a prophetic year consists of 360 days or years, and not 365, as those suppose; and thinks there is no mystery in these dates, and only signify the angels' unanimous execution of their commission at once. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "for to slay the third part of men; which may in general denote their readiness, vigilance, and quick dispatch: they lay for a good while hovering over the banks of the river Euphrates, as if they were waiting for an order, or a commission to go over it: they were ready not only at a year's, a month's, a day's, but at an hour's warning, and all of them together; and as soon as ever they had the divine permission, they lost no time; they improved every opportunity, every year, every month, every day, every hour, to settle and enlarge their dominions to the ruin of others; and in a very short time did they accomplish what they desired: though others think this refers to a certain time fixed by God, in which they should be employed in killing men; and the sense is, that these people were prepared in the purposes and decrees of God, or were appointed for such a length of time here signified, by several dates, in which they should destroy a large multitude of men, by way of punishment for their idolatries, murders, sorceries, fornication, and thefts, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 9:20",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". An hour, which is the twenty fourth of a day or year, in the prophetic style, is fifteen days, and a day is a year, and a month is thirty years, and a year is three hundred sixty five years and a quarter, or ninety one days; in all, three hundred and ninety six years, and a hundred and six days; which is the precise time between A. D. 1057, when the Turkish empire begun, the empire of the Saracens being entirely demolished by Togrul Beg, or Tangrolipix, and A. D. 1453, in which year Constantinople was taken by the Turks, and an end put to the eastern Roman empire, signified by the third part of men; or else this space of time may be reckoned from the date of Ottoman's reign, May 19, 1301, which, to September 1, 1697, is just this term of time, when Prince Eugene obtained a remarkable victory over the Turks, the effect of which was the peace at Carlowitz the next year, since which time the Turks have done but little in Europe: and by this it should seem that their time of killing men here is over, and that their own destruction is hastening on. Mr. Daubuz rejects these computations, since a prophetic year consists of 360 days or years, and not 365, as those suppose; and thinks there is no mystery in these dates, and only signify the angels' unanimous execution of their commission at once. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "{13} And the four angels were loosed, which were prepared for an hour, and a day, and a month, and a year, for to slay the third part of men.",
        "children": [
          {
            "element": "span",
            "class": "cverse3",
            "text": "{13}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " And the four angels were loosed, which were prepared for an hour, and a day, and a month, and a year, for to slay the third part of men.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(13) The execution of the commandment is in two parts: one, that those butchers are let loose, that out of their tower of the spiritual Babylon they might with fury run abroad through all the world, as well the chief of that crew who are most prompt to all the work, in this verse: as their multitudes, both most copious, of which a number certain is named for a number infinite Re 9:16 and in themselves by all means fully furnished to hide and to hurt Re 9:17 as being armed with fire, smoke and brimstone, as appears in the colour of this armour, which dazzles the eyes to all men, and have the strength of lions to cause pain, from which (as out of their mouth) the fiery, smoky, and stinking darts of the pope are shot out Re 9:18 The other part, that these butchers have effected the commandment of God by fraud and violence, in the two verses following Re 9:16,17.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 9:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This quartette of angels (= complete ruin, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Zechariah 1:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " f.) has been kept in readiness, or reserved for this occasion, though they are not to be connected (as by Spitta) with the four moments of time—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "hour, day, month",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "year",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Like the use of ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "δεῖ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "μέλλει",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐδόθη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", this touch of predestined action brings out the strong providential belief running through the Apocalypse. On the rôle of destructive angels in Jewish eschatology ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Charles on Slav. En. x. 3 and for the astrological basis (En. lxxvi. 10 f.) of this tradition see Fries in ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Jahrb f. d. klass. Alterth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". (1902) 705 f. Probably the author means that the angels set in motion the hordes of cavalry (two hundred million) described in the semi-mythical, semi-historical pageant of the next passage. But he does not directly connect the two, and it is evident that here as at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 7:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " f., we have “dream-like inconsequences” (Simcox), or else two fragments of apocalyptic tradition, originally heterogeneous, which are pieced together (at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 9:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The four angels here do not correspond in function or locality to the four unfettered angels of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 7:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; they rather represent some variation of that archaic tradition in which four angels (perhaps angel-princes of the pagan hordes) were represented as bound (like winds?) at the Euphrates—a geographical touch due to the history of contemporary warfare, in which the Parthians played a rôle similar to that of the Huns, the Vikings, or the Moors in later ages. Since the first century B.C. a Parthian invasion of some kind had formed part of the apocalyptic apparatus so that there is no particular need to allegorise the Euphrates into the Tiber or to find the four angels in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 78:49",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (LXX). The bloody and disastrous Parthian campaign of 58–62 (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 6:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") may account for the heightened colour of the scene, whether the fragment was composed at that period, or (as is most probable) written with it in retrospect. But the entire vision is one powerful imaginative development of a tradition preserved in a Syriac Apocalypse of Ezra (published by Baethgen) which may be based on old Jewish materials: “and a voice was heard, Let those four kings be loosed, who are bound at the great river Euphrates, who are to destroy a third part of men. And they were loosed, and there was a mighty uproar.” Could this be reckoned as proof of an independent tradition it would help to illumine the application of the idea in John’s Apocalypse, especially if one could accept with Köhler the attractive conjecture of Iselin that ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀγγέλους",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " represents a confusion (or variety of reading, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 11:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 20:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") between ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "מלאכים",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (= ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἄγγ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) and ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "מלכים",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in a Hebrew original of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 9:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Zeits. aus der Schweis",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", 1887, 64). The conjecture (Spitta, de Faye, J. Weiss) ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀγέλαι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (= hosts, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Ma 3:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.) is less likely, and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐπὶ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " cannot be taken with ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "λῦσον",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Bruston). Cavalry formed a standing feature of the final terror for the Jewish imagination ever since the Parthians loomed on the political horizon (Ass. Mos. iii. 1). The whole passage was one of those denounced by the Alogi as fantastic and ridiculous (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cf.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Epiph, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Haer.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " li. 34). Gaius also criticised it as inconsistent with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 24:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for an hour",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Should be “for ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "the",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " hour.” The article is not repeated, but plainly the one article belongs to all the nouns: they are “prepared for the hour, and day, and month, and year,” when God has decreed to execute the vengeance here foretold.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 9:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Τὴν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") The article removes the distributive force, as E. Schmid teaches in his Notes on the New Testament, f. 806; wherefore it is not any ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "hour, day, month, year",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", whatever that is meant, but a definite period of times; that is, a period of about 207 years, if it seem correct, from A. 629 to A. 836, or from A. 634 to A. 840, that is, from the last time of Abubeker[100] to the death of Motassem.[101] See especially the Saracenic Chronicle of Drechsler enlarged by ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Reiske",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", pp. 14–37, and Hottinger Eccl. Hist. Sec. vii. viii. and ix., and Comp. Theatr. Orient. Part i. ch. 3.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[100] Abubeker, the friend and successor of Mahomet.—T.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[101] Motassem, the last of the Caliphs.—T.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 15.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - And the four angels were loosed, which were prepared for an hour, and a day, and a month, and a year, for to slay the third part of men. The alterations in the Revised Version make the meaning much plainer: ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "which had been prepared for the bout, and day, and month, and year, that they should kill",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc. That is to say those \"which had\" in God's foreknowledge \"been prepared\" in order to operate at the exact period required - the exact ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "year, month, day",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and even ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "hour.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Each knew his appointed time. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Four",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is the number used to denote universality in things of this world (see on Revelation 4:6). The number, therefore, seems to imply that the power of the angels is of universal extent. The ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "third part",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " are destroyed; that is, a great part, though not the larger (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 8:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "et seq.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Revelation 9:15",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "For an hour and a day and a month and a year",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This rendering is wrong, since it conveys the idea that the four periods mentioned are to be combined as representing the length of the preparation or of the continuance of the plague. But it is to be noted that neither the article nor the preposition are repeated before day and month and year. The meaning is that the angels are prepared unto the hour appointed by God, and that this hour shall fall in its appointed day and month and year. ",
        "children": []
      }
    ]
  }
]