[{"header":"The Lamb and the 144,000 on Mount Zion"},{"num":14,"verse":"And I looked, and behold, the Lamb standing on Mount Zion, and with him one hundred forty-four thousand who had his name and the name of his Father written on their foreheads. "},{"num":2,"verse":"And I heard a sound from heaven like the sound of many waters and like the sound of loud thunder, and the sound that I heard was like harpists playing on their harps. "},{"num":3,"verse":"And they were singing something like a new song before the throne and before the four living creatures and the elders, and no one was able to learn the song except the one hundred forty-four thousand who had been bought from the earth."},{"num":4,"verse":"These are those who have not been defiled with women, for they are virgins. These are the ones who follow the Lamb wherever he goes. These were bought from humanity as first fruits to God and to the Lamb, "},{"num":5,"verse":"and in their mouth a lie was not found; they are blameless."},{"header":"The Three Angels and Their Messages"},{"num":6,"verse":"And I saw another angel flying directly overhead, having an eternal gospel to proclaim to those who reside on the earth, and to every nation and tribe and language and people, "},{"num":7,"verse":"saying with a loud voice, “Fear God and give him glory, because the hour of his judgment has come, and worship the one who made the heaven and the earth and the sea and the springs of water!”"},{"num":8,"verse":"And another second angel followed, saying, “Fallen, fallen is Babylon the great, who caused all the nations to drink from the wine of the passion of her sexual immorality.”"},{"num":9,"verse":"And another third angel followed them, saying with a loud voice, “If anyone worships the beast and his image and receives a mark on his forehead or on his hand, "},{"num":10,"verse":"he himself also will drink of the wine of the anger of God that has been mixed full strength in the cup of his wrath, and will be tortured with fire and sulphur in the presence of the holy angels and in the presence of the Lamb. "},{"num":11,"verse":"And the smoke of their torture went up forever and ever, and those who worshiped the beast and his image did not have rest day and night, along with anyone who received the mark of his name. "},{"num":12,"verse":"Here is the patient endurance of the saints, those who keep the commandments of God and the faith in Jesus."},{"num":13,"verse":"And I heard a voice from heaven saying, “Write:"},{"header":"The Earth is Harvested"},{"num":14,"verse":"And I looked, and behold, a white cloud, and on the cloud was seated one like a son of man, having on his head a golden crown, and in his hand a sharp sickle. "},{"num":15,"verse":"And another angel came out of the temple, crying out with a loud voice to the one seated on the cloud, “Send out your sickle and reap, because the hour to reap has come, because the harvest of the earth is ripe!” "},{"num":16,"verse":"And the one seated on the cloud swung his sickle on the earth, and the earth was reaped."},{"num":17,"verse":"And another angel came out of the temple that is in heaven; he also had a sharp sickle. "},{"num":18,"verse":"And another angel who had authority over the fire went out from the altar, and he called out with a loud voice to the one who had the sharp sickle, saying, “Send out your sharp sickle and harvest the clusters of grapes from the vine of the earth, because its grapes are at their prime!” "},{"num":19,"verse":"And the angel swung his sickle into the earth and harvested the vine of the earth, and threw the grapes into the great winepress of the wrath of God. "},{"num":20,"verse":"And the winepress was stomped outside the city, and blood went out from the winepress up to the bridles of the horses, about one thousand six hundred stadia."}]