[{"header":"The Song of the Saved"},{"num":14,"verse":"Then I looked, and there before me was the Lamb standing on Mount Zion. With him were one hundred forty-four thousand people who had his name and his Father’s name written on their foreheads. "},{"num":2,"verse":"And I heard a sound from heaven like the noise of flooding water and like the sound of loud thunder. The sound I heard was like people playing harps. "},{"num":3,"verse":"And they sang a new song before the throne and before the four living creatures and the elders. No one could learn the new song except the one hundred forty-four thousand who had been bought from the earth. "},{"num":4,"verse":"These are the ones who did not do sinful things with women, because they kept themselves pure. They follow the Lamb every place he goes. These one hundred forty-four thousand were bought from among the people of the earth as people to be offered to God and the Lamb. "},{"num":5,"verse":"They were not guilty of telling lies; they are without fault."},{"header":"The Three Angels"},{"num":6,"verse":"Then I saw another angel flying high in the air. He had the eternal Good News to preach to those who live on earth—to every nation, tribe, language, and people. "},{"num":7,"verse":"He preached in a loud voice, “Fear God and give him praise, because the time has come for God to judge all people. So worship God who made the heavens, and the earth, and the sea, and the springs of water.”"},{"num":8,"verse":"Then the second angel followed the first angel and said, “Ruined, ruined is the great city of Babylon! She made all the nations drink the wine of the anger of her adultery.”"},{"num":9,"verse":"Then a third angel followed the first two angels, saying in a loud voice: “If anyone worships the beast and his idol and gets the beast’s mark on the forehead or on the hand, "},{"num":10,"verse":"that one also will drink the wine of God’s anger, which is prepared with all its strength in the cup of his anger. And that person will be put in pain with burning sulfur before the holy angels and the Lamb. "},{"num":11,"verse":"And the smoke from their burning pain will rise forever and ever. There will be no rest, day or night, for those who worship the beast and his idol or who get the mark of his name.” "},{"num":12,"verse":"This means God’s holy people must be patient. They must obey God’s commands and keep their faith in Jesus."},{"num":13,"verse":"Then I heard a voice from heaven saying, “Write this: Blessed are the dead who die from now on in the Lord.”"},{"header":"The Earth Is Harvested"},{"num":14,"verse":"Then I looked, and there before me was a white cloud, and sitting on the white cloud was One who looked like a Son of Man. He had a gold crown on his head and a sharp sickle in his hand. "},{"num":15,"verse":"Then another angel came out of the temple and called out in a loud voice to the One who was sitting on the cloud, “Take your sickle and harvest from the earth, because the time to harvest has come, and the fruit of the earth is ripe.” "},{"num":16,"verse":"So the One who was sitting on the cloud swung his sickle over the earth, and the earth was harvested."},{"num":17,"verse":"Then another angel came out of the temple in heaven, and he also had a sharp sickle. "},{"num":18,"verse":"And then another angel, who has power over the fire, came from the altar. This angel called to the angel with the sharp sickle, saying, “Take your sharp sickle and gather the bunches of grapes from the earth’s vine, because its grapes are ripe.” "},{"num":19,"verse":"Then the angel swung his sickle over the earth. He gathered the earth’s grapes and threw them into the great winepress of God’s anger. "},{"num":20,"verse":"They were trampled in the winepress outside the city, and blood flowed out of the winepress as high as horses’ bridles for a distance of about one hundred eighty miles."}]