[[],[{"type":"header","content":"Spiritual Gifts"},{"type":"prose","content":"Now, dear brothers and sisters, regarding your question about the special abilities the Spirit gives us. I don’t want you to misunderstand this."}],[{"type":"prose","content":"You know that when you were still pagans, you were led astray and swept along in worshiping speechless idols."}],[{"type":"prose","content":"So I want you to know that no one speaking by the Spirit of God will curse Jesus, and no one can say Jesus is Lord, except by the Holy Spirit."}],[{"type":"prose","content":"There are different kinds of spiritual gifts, but the same Spirit is the source of them all."}],[{"type":"prose","content":"There are different kinds of service, but we serve the same Lord."}],[{"type":"prose","content":"God works in different ways, but it is the same God who does the work in all of us."}],[{"type":"prose","content":"A spiritual gift is given to each of us so we can help each other."}],[{"type":"prose","content":"To one person the Spirit gives the ability to give wise advice; to another the same Spirit gives a message of special knowledge."}],[{"type":"prose","content":"The same Spirit gives great faith to another, and to someone else the one Spirit gives the gift of healing."}],[{"type":"prose","content":"He gives one person the power to perform miracles, and another the ability to prophesy. He gives someone else the ability to discern whether a message is from the Spirit of God or from another spirit. Still another person is given the ability to speak in unknown languages, while another is given the ability to interpret what is being said."}],[{"type":"prose","content":"It is the one and only Spirit who distributes all these gifts. He alone decides which gift each person should have."}],[{"type":"header","content":"One Body with Many Parts"},{"type":"prose","content":"The human body has many parts, but the many parts make up one whole body. So it is with the body of Christ."}],[{"type":"prose","content":"Some of us are Jews, some are Gentiles, some are slaves, and some are free. But we have all been baptized into one body by one Spirit, and we all share the same Spirit."}],[{"type":"prose","content":"Yes, the body has many different parts, not just one part."}],[{"type":"prose","content":"If the foot says, “I am not a part of the body because I am not a hand,” that does not make it any less a part of the body."}],[{"type":"prose","content":"And if the ear says, “I am not part of the body because I am not an eye,” would that make it any less a part of the body?"}],[{"type":"prose","content":"If the whole body were an eye, how would you hear? Or if your whole body were an ear, how would you smell anything?"}],[{"type":"prose","content":"But our bodies have many parts, and God has put each part just where he wants it."}],[{"type":"prose","content":"How strange a body would be if it had only one part!"}],[{"type":"prose","content":"Yes, there are many parts, but only one body."}],[{"type":"prose","content":"The eye can never say to the hand, “I don’t need you.” The head can’t say to the feet, “I don’t need you.”"}],[{"type":"prose","content":"In fact, some parts of the body that seem weakest and least important are actually the most necessary."}],[{"type":"prose","content":"And the parts we regard as less honorable are those we clothe with the greatest care. So we carefully protect those parts that should not be seen,"}],[{"type":"prose","content":"while the more honorable parts do not require this special care. So God has put the body together such that extra honor and care are given to those parts that have less dignity."}],[{"type":"prose","content":"This makes for harmony among the members, so that all the members care for each other."}],[{"type":"prose","content":"If one part suffers, all the parts suffer with it, and if one part is honored, all the parts are glad."}],[{"type":"prose","content":"All of you together are Christ’s body, and each of you is a part of it."}],[{"type":"prose","content":"Here are some of the parts God has appointed for the church:"}],[{"type":"prose","content":"Are we all apostles? Are we all prophets? Are we all teachers? Do we all have the power to do miracles?"}],[{"type":"prose","content":"Do we all have the gift of healing? Do we all have the ability to speak in unknown languages? Do we all have the ability to interpret unknown languages? Of course not!"}],[{"type":"prose","content":"So you should earnestly desire the most helpful gifts.But now let me show you a way of life that is best of all."}]]