[{"num":12,"verse":"Now I do not want you to lack da’as concerning the things of the Ruach Hakodesh, Achim b’Moshiach."},{"num":2,"verse":"You have da’as that when you WERE Goyim [T.N. i.e., you are no longer heathen pagans], somehow you were influenced and led astray to the ELILIM ILLEMIM (\"Dumb idols, idols incapable of speech\" CHABAKUK 2:18-19)."},{"num":3,"verse":"Therefore, I make known to you that no one speaking by the Ruach Hakodesh of Hashem says, \"Al Yehoshua ki Cherem hu\" (\"a curse of the ban of destruction is on Yehoshua\"), and no one is able to say, \"Yehoshua hu HaAdon\" except by the Ruach Hakodesh."},{"num":4,"verse":"There are different kinds of matanot (gifts), but the same Ruach Hakodesh."},{"num":5,"verse":"There are different avodot hakodesh (ministries), but the one Adonoi."},{"num":6,"verse":"And there are a variety of activities [of the Ruach Hakodesh], but the same G-d working all in all."},{"num":7,"verse":"But to each is given the disclosure of the Ruach Hakodesh for benefit:"},{"num":8,"verse":"To one through the Ruach Hakodesh is given a dvar chochmah (a dvar of wisdom Ac 16:7); to another, according to the same Ruach Hakodesh, a dvar da’as (word of knowledge Ac 5:3);"},{"num":9,"verse":"To another, by the same Ruach Hakodesh, emunah (Mt 17:20-21); to another, by the one Ruach Hakodesh, matanot harippuy (gifts of healing [refuah]) Ac 3:6-16);"},{"num":10,"verse":"to another those of cholel niflaot (\"accomplishing miracles\" SHEMOT 4:21; Yn 11:42-43) And to another divrei hanevu’ah (words of prophecy MELACHIM ALEF 17:1), and to another discernings (being about to make a nafka mina distinction) of ruchot (spirits MELACHIM ALEF 22:22), to another kinds of leshonot (tongues Ac 2:4), and to another, pitronim (interpretations) of leshonot (tongues—1C 14:13)."},{"num":11,"verse":"All these things are activated by the one and same Ruach Hakodesh, distributing individually to each one as He determines."},{"num":12,"verse":"For even as the body is echad, and has many evarim (members), and all the evarim (members) of the body, though many, are one body, so is Moshiach."},{"num":13,"verse":"For also in one Ruach Hakodesh we were all given a tevilah into one body, whether Yehudim or Yevanim (Greeks), whether avadim (slaves) or bnei Chorin (freedman), and all were given to drink, as it were, from one Ruach Hakodesh."},{"num":14,"verse":"For the body is not one, but many, evarim (members)."},{"num":15,"verse":"If the regel (foot) says, \"Because I am not a yad (hand), I am not of the body,\" that would not make it any less one of the evarim of the body."},{"num":16,"verse":"And if the ozen (ear) says, \"Because I am no ayin (eye), I am not of the body,\" that would not make it any less one of the evarim of the body."},{"num":17,"verse":"If the whole body were an ayin (eye), where would be the hearing? If the whole body were hearing, where would be the smelling?"},{"num":18,"verse":"But now Hashem set the evarim (members), each one of them, in the body according to His ratzon (will), as He wanted."},{"num":19,"verse":"And if all were all one evar (member), where would the body be?"},{"num":20,"verse":"As it is, though there are many evarim (members), there is but one body."},{"num":21,"verse":"And the ayin (eye) is not able to say to the yad (hand), “I do not have need of you.” Or, again, the rosh (head), speaking to the raglayim (feet), is not to say, “I have no need of you.”"},{"num":22,"verse":"Just the opposite, the evarim of the body appearing to be weaker are vital."},{"num":23,"verse":"And those evarim of the body which we presume to be dishonorable, on these we clothe with even more honor, and our parts with lesser kibbud (respect, honor) are treated with greater."},{"num":24,"verse":"Whereas, our evarim with greater kibbud have no need of more. However, Hashem has so composed the achdus yichudim (unit, harmony of unifications) of the body, giving the superior kibbud to the inferior,"},{"num":25,"verse":"lest there be schisms (1:10; 11:18) in the body. But the evarim should have the same gemilut chasadim (deeds of lovingkindness and caring) for one another."},{"num":26,"verse":"And when one evar (member) has tza’ar (pain and suffering), all the evarim (members) have tza’ar with it; or one evar has the aliyah of kibbud, all the evarim has simcha with it."},{"num":27,"verse":"Now you are Moshiach’s body (BERESHIS 47:18-19) and individually evarim of it."},{"num":28,"verse":"Now Hashem placed some in the Adat HaMoshiach (community of Moshiach), in the Kehillah, rishon (first): shlichim, second, nevi’im, third, morim (teachers), then those of cholel nifla’aot (“accomplishing miracles—Ex 4:21), then matanot harippuy (gifts of healing), then matanot of helps, then manhigut ruchanit (spiritual leadership, administration), kinds of leshonot."},{"num":29,"verse":"Surely not all are shlichim? Surely not all are nevi’im? Surely not all are rabbinical morim? Surely not all are those cholel nifa’ot (accomplishing miracles”)?"},{"num":30,"verse":"Surely not all have matanot harippuy (gifts of healing)? Surely not all speak in leshonot (cf 1C 14:23, 26)? Surely not all have the pitron (interpretation) of leshonot?"},{"num":31,"verse":"But earnestly desire the greater matanot (gifts) [of the Ruach Hakodesh]….And yet now I show you a more feste derech. T.N. Rav Sha’ul now turns to the need for balance. Not that he is trying to terminate the miraculous in Moshiach’s Kehillah [a futile endeavor!], but that he is showing the need for the fruit of the Ruach Hakodesh to balance His gifts, especially in an environment where pride and carnality have quenched ahavah, which is the Yn 3:16 center of Moshiach’s saving histalkus (passing, the death of Moshiach in midst of his Redemptive mission on the analogy of Moses dying before he crosses into the Promised Land.)"}]