[{"header":"Unity in the Midst of Diversity"},{"num":14,"verse":"Offer an open hand of fellowship to welcome every true believer, even though their faith may be weak and immature. And refuse to engage in debates with them concerning nothing more than opinions."},{"num":2,"verse":"For example, one believer has no problem with eating all kinds of food, but another with weaker faith will eat only vegetables. "},{"num":3,"verse":"The one who eats freely shouldn’t judge and look down on the one who eats only vegetables. And the vegetarian must not judge and look down on the one who eats everything. Remember, God has welcomed him and taken him as his partner."},{"num":4,"verse":"Who do you think you are to sit in judgment of someone else’s household servant? His own master is the one to evaluate whether he succeeds or fails. And God’s servants will succeed, for God’s power supports them and enables them to stand."},{"num":5,"verse":"In the same way, one person regards a certain day as more sacred than another, and another person regards them all alike. There is nothing wrong with having different personal convictions about such matters. "},{"num":6,"verse":"For the person who observes one day as especially sacred does it to honor the Lord. And the same is true regarding what a person eats. The one who eats everything eats to honor the Lord, because he gives thanks to God, and the one who has a special diet does it to honor the Lord, and he also gives thanks to God."},{"num":7,"verse":"No one lives to himself and no one dies to himself. "},{"num":8,"verse":"While we live, we must live for our Master, and in death we must bring honor to him. So dead or alive we belong to our Master. "},{"num":9,"verse":"For this very reason the Anointed One died and was brought back to life again, so that he would become the Lord God over both the dead and the living."},{"num":10,"verse":"Why would you judge your brothers or sisters because of their diet, despising them for what they eat or don’t eat? For we each will have our turn to stand before God’s judgment seat. "},{"num":11,"verse":"Just as it is written:"},{"num":12,"verse":"Therefore, each one must answer for himself and give a personal account of his own life before God."},{"header":"Walking in Love"},{"num":13,"verse":"So stop being critical and condemning of other believers, but instead determine to never deliberately cause a brother or sister to stumble and fall because of your actions."},{"num":14,"verse":"I know and am convinced by personal revelation from the Lord Jesus that there is nothing wrong with eating any food. But to the one who considers it to be unclean, it is unacceptable. "},{"num":15,"verse":"If your brother or sister is offended because you insist on eating what you want, it is no longer love that rules your conduct. Why would you wound someone for whom the Messiah gave his life, just so you can eat what you want? "},{"num":16,"verse":"So don’t give people the opportunity to slander what you know to be good. "},{"num":17,"verse":"For the kingdom of God is not a matter of rules about food and drink, but is in the realm of the Holy Spirit, filled with righteousness, peace, and joy. "},{"num":18,"verse":"Serving the Anointed One by walking in these kingdom realities pleases God and earns the respect of others."},{"num":19,"verse":"So then, make it your top priority to live a life of peace with harmony in your relationships, eagerly seeking to strengthen and encourage one another. "},{"num":20,"verse":"Stop ruining the work of God by insisting on your own opinions about food. You can eat anything you want, but it is wrong to deliberately cause someone to be offended over what you eat. "},{"num":21,"verse":"Consider it an act of love to refrain from eating meat or drinking wine or doing anything else that would cause a fellow believer to be offended or tempted to be weakened in his faith. "},{"num":22,"verse":"Keep the convictions you have about these matters between yourself and God, and don’t impose them upon others. You’ll be happy when you don’t judge yourself in doing what your conscience approves. "},{"num":23,"verse":"But the one who has misgivings feels miserable if he eats meat, because he doubts and doesn’t eat in faith. For anything we do that doesn’t spring from faith is, by definition, sinful."}]