[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(10) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "When he prayed for his friends.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Job’s personal discipline was not complete till he passed from the sphere of his own sorrows to the work of intercession for his friends, and it was through the very act of this self-oblivion and self-sacrifice that his own deliverance was brought about. When he prayed for his friends, we are told, the Lord turned his own captivity: that is, restored and re-instated him in prosperity even greater than before.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This is the true moral of all human history, which is to be accomplished in the world of the regeneration, if not here. All sorrow is fraught with the promise and the hope of future blessedness, and to know that is to rob sorrow of its pain. It is impossible to reap the full gain of it when the burden presses, but, as far as it can be done, sorrow is mitigated. Had Job been able to look forward with confidence to his actual deliverance, he would have been able to bear his affliction; it was because he could not that all was dark. And after all there are sorrows and afflictions for which there is no deliverance like Job’s; there is a captivity which can never be turned in this life, and for this the only hope is the sure hope of the Gospel, and the promise which in its degree is afforded by the history of Job: for if Job’s is a representative history, as we are bound to believe it must be, then the lesson of it must be that what is not explained or mended here will be explained and mended hereafter. It is God alone who can enlighten the darkness which surrounds His counsels; but at the same time we must remember that with Him is the well of life, and in His light we shall see light.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Job 42:10. ",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 42:10",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And the Lord turned the captivity of Job — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Brought him out of that state of bondage in which he had so long been held by Satan, and out of all his distresses and miseries. The words may be rendered, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The Lord brought back Job’s captivity; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "that is, as some understand it, the persons and things that had been taken from him; not, indeed, the very same which he had lost, but others equivalent to them, and that with advantage. But the meaning seems principally to be, that all his bodily distempers were thoroughly healed, and probably in a moment; his mind was calmed; his peace returned; and the consolations of God were not small with him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "When he prayed for his friends — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Whereby he manifested his obedience to God, and his true love to them, in being so ready to forgive them, and heartily to pray for them; for which God would not let him lose his reward. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Also the Lord gave Job twice as much, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — He not only gave him as much as he lost, but double to it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "42:10-17 In the beginning of this book we had Job's patience under his troubles, for an example; here, for our encouragement to follow that example, we have his happy end. His troubles began in Satan's malice, which God restrained; his restoration began in God's mercy, which Satan could not oppose. Mercy did not return when Job was disputing with his friends, but when he was praying for them. God is served and pleased with our warm devotions, not with our warm disputes. God doubled Job's possessions. We may lose much for the Lord, but we shall not lose any thing by him. Whether the Lord gives us health and temporal blessings or not, if we patiently suffer according to his will, in the end we shall be happy. Job's estate increased. The blessing of the Lord makes rich; it is he that gives us power to get wealth, and gives success in honest endeavours. The last days of a good man sometimes prove his best, his last works his best works, his last comforts his best comforts; for his path, like that of the morning light, shines more and more unto the perfect day.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the Load turned the captivity of Job - Restored him to his former prosperity. The language is taken from restoration to country and home after having been a captive in a foreign land. This language is often applied in the Scriptures to the return of the Jews from their captivity in Babylon, and some writers have made use of it as an argument to show that ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 54",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "ed \"after\" that event. But this conclusion is unwarranted. The language is so general that it might be taken from the return from \"any\" captivity, and is such as would naturally be employed in the early periods of the world to denote restoration from calamity. It was common in the earliest ages to convey captives in war to the land of the conqueror, and thus make a land desolate by the removal of its inhabitants; and it would be natural to use the language expressive of their return to denote a restoration from \"any\" great calamity to former privileges and comforts. Such is undoubtedly its meaning as applied to the case of Job. He was restored from his series of protracted trials to a state of prosperity.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "When he prayed for his friends - Or after he had prayed for his friends. It is not implied of necessity that his praying for them had any particular effect in restoring his prosperity.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Also the Lord gave Job twice as much as he had before - Margin, \"added all that\" had been to \"Job unto the double.\" The margin is a literal translation, but the meaning is the same. It is not to be understood that this occurred at once - for many of these blessings were bestowed gradually. Nor are we to understand it in every respect literally - for he had the same number of sons and daughters as before; but it is a general declaration, and was true in all essential respects. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Also the Lord gave Job twice as much as he had before - Margin, \"added all that\" had been to \"Job unto the double.\" The margin is a literal translation, but the meaning is the same. It is not to be understood that this occurred at once - for many of these blessings were bestowed gradually. Nor are we to understand it in every respect literally - for he had the same number of sons and daughters as before; but it is a general declaration, and was true in all essential respects. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10. turned … captivity—proverbial for restored, or amply indemnified him for all he had lost (Eze 16:53; Ps 14:7; Ho 6:11). Thus the future vindication of man, body and soul, against Satan (Job 1:9-12), at the resurrection (Job 19:25-27), has its earnest and adumbration in the temporal vindication of Job at last by Jehovah in person.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "twice—so to the afflicted literal and spiritual Jerusalem (Isa 40:2; 60:7; 61:7; Zec 9:12). As in Job's case, so in that of Jesus Christ, the glorious recompense follows the \"intercession\" for enemies (Isa 53:12).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Turned the captivity of Job, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. brought him out of that state of bondage in which he had been so long held by Satan and by his own Spirit, and out of all his distresses and miseries. Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "returned Job’s captivity",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", i.e. the persons and things which had been taken from him; not the same which he had lost, but other equivalent to them, and that with advantage. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "When he prayed for his friends; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " whereby he manifesteth his obedience to God, and his true love and charity to them, in being so ready to forgive them, and heartily to pray for them; for which God would not let him lose his reward. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Also; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " an emphatical particle. He not only gave him as much as he lost, but double to it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the Lord turned the captivity of Job,.... Not literally, in such sense as Lot's captivity was turned, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 14:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; for Job's person was not seized on and carried away, though his cattle were: nor spiritually, being delivered from the captivity of sin; that had been his case many years ago, when first converted: but it is to be understood of his restoration from afflictions and calamities to a happy state; as of the return of his substance, his health and friends, and especially of his deliverance from Satan, in whose hands he had been some time, and by him distressed both in body and mind. But now his captivity was turned, and he was freed from all his distresses; and even from those which arose from the dealings of God with him, which he was now fully satisfied about; and this was done, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "when he prayed for his friends; as he was directed to do. A good man will not only pray for himself, as Job doubtless did, but for others also; for his natural and spiritual friends, yea, for unkind friends, and even for enemies likewise: and the prayer of an upright man is very acceptable to the Lord; and many mercies and blessings come by it; and even prayer for others is profitable to a man's self; and sometimes he soon reaps the benefit of it, as Job now did. For when and while he was praying, or quickly upon it, there was a turn in his affairs: he presently found himself in better health; his friends came about him, and his substance began to increase; Satan had no more power over him, and the presence of God was with him. All which was of the Lord; and he enjoyed it in the way of prayer, and as the fruit of that; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "also the Lord gave Job twice as much as he had before: or added to him double. Which chiefly respects his substance; his cattle, as appears from Job 42:12, and might be true both with respect to things temporal and spiritual. \"Double\" may denote an abundance, a large measure of good things; see Zechariah 9:12. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "also the Lord gave Job twice as much as he had before: or added to him double. Which chiefly respects his substance; his cattle, as appears from ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 42:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and might be true both with respect to things temporal and spiritual. \"Double\" may denote an abundance, a large measure of good things; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Zechariah 9:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And the LORD turned the {i} captivity of Job, when he prayed for his friends: also the LORD gave Job twice as much as he had before.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And the LORD turned the ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{i}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " captivity of Job, when he prayed for his friends: also the LORD gave Job twice as much as he had before.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(i) He delivered him out of the affliction he was in.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "turned the captivity",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The metaphorical use of the phrase would readily arise in a state of society like that in the East. The expression means that Job’s afflictions were removed and his prosperity restored.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "10–16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Job is restored to a prosperity double that which he formerly enjoyed; his former friends gather around him; he is again blessed with children; and dies, old and full of days.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And the Lord turned the captivity of Job",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The literal use of this phrase is common, the metaphorical use of it uncommon, in Scripture. Still, it is so simple a metaphor, and captivity so common a thing among ancient peoples, that it may well have been in general use among the nations of Western Asia from very primitive times. It signifies, as Professor Lee remarks, \"a restoration to former happy circumstances.\" When he prayed for his friends. Perhaps his complete forgiveness by God was contingent on his own complete forgiveness of his \"friends\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 6:12, 14, 15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 18:32-35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); at any rate, his restoration immediately followed his intercession. Also the Lord gave Job twice as much as he had before; literally, added to ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "all",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "that had been Job's to the double",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (comp. ver. 12). Job 42:10",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10  And Jehovah turned the captivity of Job, when he prayed for his friends; and Jehovah increased everything that Job had possessed to the double.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "רעהוּ is to be understood generally, as Job 16:21, and the בּ signifies not \"because,\" but \"when.\" The moment in which Job prayed for his friends became, as the climax of a life that is well-pleasing with God, the turning-point of glory to him. The Talmud has borrowed from here the true proverb: תחלה כל־המתפלל בעד חברו נענה, i.e., he who prays for his fellow-men always finds acceptance for himself first of all. The phrase (שׁבית) שׁוּב שׁבוּת signifies properly to turn captivity, then in general to make an end of misery; also in German, elend, old High Germ. elilenti, originally signified another, foreign country (vid., Psalter, ii. 192), since an involuntary removal from one's native land is regarded as the emblem of a lamentable condition. This phrase does not exactly stamp Job as the Mashal of the Israel of the Exile, but it favoured this interpretation. Now when Job was recovered, and doubly blessed by God, as is also promised to the Israel of the Exile, Isaiah 61:7 and freq., sympathizing friends also appeared in abundance. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "רעהוּ is to be understood generally, as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 16:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and the בּ signifies not \"because,\" but \"when.\" The moment in which Job prayed for his friends became, as the climax of a life that is well-pleasing with God, the turning-point of glory to him. The Talmud has borrowed from here the true proverb: תחלה כל־המתפלל בעד חברו נענה, i.e., he who prays for his fellow-men always finds acceptance for himself first of all. The phrase (שׁבית) שׁוּב שׁבוּת signifies properly to turn captivity, then in general to make an end of misery; also in German, elend, old High Germ. elilenti, originally signified another, foreign country (vid., Psalter, ii. 192), since an involuntary removal from one's native land is regarded as the emblem of a lamentable condition. This phrase does not exactly stamp Job as the Mashal of the Israel of the Exile, but it favoured this interpretation. Now when Job was recovered, and doubly blessed by God, as is also promised to the Israel of the Exile, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 61:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and freq., sympathizing friends also appeared in abundance. ",
            "children": []
          }
        ]
      }
    ]
  }
]