[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Job 42:15",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 42:15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "In all the land were no women found so fair, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — In the Old Testament we often find women praised for their beauty, but never in the New, because the beauty of holiness is brought to a much clearer light by the gospel. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Their father gave them inheritance. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — Gave his daughters a share, and, possibly, an equal share with his sons in his inheritance, which, in so plentiful an estate, he might easily do, especially to such amiable sisters, without the envy of their brethren; and which, per- adventure, he did, to oblige them to settle themselves among their brethren, and to marry into their own religious kindred, not to strangers, who, in those times, were generally swallowed up in the gulf of idolatry.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "42:10-17 In the beginning of this book we had Job's patience under his troubles, for an example; here, for our encouragement to follow that example, we have his happy end. His troubles began in Satan's malice, which God restrained; his restoration began in God's mercy, which Satan could not oppose. Mercy did not return when Job was disputing with his friends, but when he was praying for them. God is served and pleased with our warm devotions, not with our warm disputes. God doubled Job's possessions. We may lose much for the Lord, but we shall not lose any thing by him. Whether the Lord gives us health and temporal blessings or not, if we patiently suffer according to his will, in the end we shall be happy. Job's estate increased. The blessing of the Lord makes rich; it is he that gives us power to get wealth, and gives success in honest endeavours. The last days of a good man sometimes prove his best, his last works his best works, his last comforts his best comforts; for his path, like that of the morning light, shines more and more unto the perfect day.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And their father gave them inheritance among their brethren - This is mentioned as a proof of his special regard, and is also recorded because it was not common. Among the Hebrews the daughter inherited only in the case where there was no son, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 27:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The property was divided equally among the sons, with the exception that the oldest received a double portion; see Jahn's \"Bib. Arch.\" section 168. This custom, prevailing still extensively in the East, it seems existed in the time of Job, and it is mentioned as a remarkable circumstance that he made his daughters heirs to his property with their brothers. It would also be rather implied in the passage before us that they were equal heirs. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "15. inheritance among … brethren—An unusual favor in the East to daughters, who, in the Jewish law, only inherited, if there were no sons (Nu 27:8), a proof of wealth and unanimity.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Gave his daughters a share, and possibly an equal share, with his sons in his inheritance; which in so plentiful an estate he might easily do, especially to such amiable sisters, without the envy of their brethren; and which peradventure he did to oblige them to settle themselves amongst their brethren, and to marry into their own religious kindred, not to strangers, who in those times were generally swallowed up in the gulf of idolatry. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And in all the land were no women found so fair as the daughters of Job,.... Either in the whole world, which is not improbable: or it may be rather in the land or country in which they dwelt; and which may be gathered from their names, as before observed. The people of God, and children of Christ, the antitype of Job, are all fair, and there is no spot in them; a perfection of beauty, perfectly comely, through the comeliness of Christ put upon them, and are without spot or wrinkle, or any such thing; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and their father gave them inheritance among their brethren; which was done not on account of their beauty or virtue; nor is this observed so much to show the great riches of Job, that he could give his daughters as much as his sons, as his impartiality to his children, and his strict justice and equity in distributing his substance to them all alike, making no difference between male and female. And so in Christ, the antitype of Job, there is neither male nor female, no difference between them, Galatians 3:28, but being all children, they are heirs, heirs of God and joint heirs with Christ, and equally partake of the same inheritance with the saints in light, Romans 8:17. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and their father gave them inheritance among their brethren; which was done not on account of their beauty or virtue; nor is this observed so much to show the great riches of Job, that he could give his daughters as much as his sons, as his impartiality to his children, and his strict justice and equity in distributing his substance to them all alike, making no difference between male and female. And so in Christ, the antitype of Job, there is neither male nor female, no difference between them, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Galatians 3:28",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", but being all children, they are heirs, heirs of God and joint heirs with Christ, and equally partake of the same inheritance with the saints in light, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Romans 8:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And in all the land were no women found so fair as the daughters of Job: and their father gave them inheritance among their brethren.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "inheritance among their brethren",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The Hebrew practice was that the daughters inherited only when there was no son, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 27:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "seq",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The disposition of his property made by Job would retain the sisters in the midst of their brethren even after marriage, and allow the affectionate relations existing among Job’s children to continue.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 15.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And in all the land were no women found so fair as the daughters of Job",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Beauty has always been highly valued in the East; and Job would feel himself highly favoured in having three beautiful daughters. It may have been on account of their great beauty that their father gave them inheritance among their brethren, which was certainly an unusual practice in the East. Job 42:15",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "15  And in all the land there were not found women so fair as the daughters of Job: and their father gave them inheritance among their brothers.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "On נמצא, followed by the acc., vid., Ges. 143, 1, b. להם, etc., referring to the daughters, is explained from the deficiency in Hebrew in the distinction of the genders. Job 42:15 sounds more Arabian than Israelitish, for the Thora only recognises a daughter as heiress where there are no sons, Numbers 27:8 The writer is conscious that he is writing an extra-Israelitish pre-Mosaic history. The equal distribution of the property again places before our eyes the pleasing picture of family concord in the commencement of the history; at the same time it implies that Job will not have been wanting in son-in-law for his fair, richly-dowried daughters, - a fact which Job 42:16 establishes: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "On נמצא, followed by the acc., vid., Ges. 143, 1, b. להם, etc., referring to the daughters, is explained from the deficiency in Hebrew in the distinction of the genders. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 42:15",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " sounds more Arabian than Israelitish, for the Thora only recognises a daughter as heiress where there are no sons, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 27:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " The writer is conscious that he is writing an extra-Israelitish pre-Mosaic history. The equal distribution of the property again places before our eyes the pleasing picture of family concord in the commencement of the history; at the same time it implies that Job will not have been wanting in son-in-law for his fair, richly-dowried daughters, - a fact which ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 42:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " establishes: ",
            "children": []
          }
        ]
      }
    ]
  }
]