[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Job 42:2",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 42:2",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I know thou canst do every thing — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Job here subscribes to God’s unlimited power, knowledge, and dominion, to prove which was the scope of God’s discourse out of the whirlwind. And his judgment being convinced of these, his conscience also was convinced of his own folly in speaking so irreverently concerning him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "No thought can be withholden from thee — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "No thought of ours can be withholden from thy knowledge. And there is no thought of thine which thou canst be hindered from bringing into execution.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "42:1-6 Job was now sensible of his guilt; he would no longer speak in his own excuse; he abhorred himself as a sinner in heart and life, especially for murmuring against God, and took shame to himself. When the understanding is enlightened by the Spirit of grace, our knowledge of Divine things as far exceeds what we had before, as the sight of the eyes excels report and common fame. By the teachings of men, God reveals his Son to us; but by the teachings of his Spirit he reveals his Son in us, Ga 1:16, and changes us into the same image, 2Co 3:18. It concerns us to be deeply humbled for the sins of which we are convinced. Self-loathing is ever the companion of true repentance. The Lord will bring those whom he loveth, to adore him in self-abasement; while true grace will always lead them to confess their sins without self-justifying.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "I know that thou canst do everything - This is said by Job in view of what had been declared by the Almighty in the previous chapters. It is an acknowledgment that God was omnipotent, and that man ought to be submissive, under the putting forth of his infinite power. One great object of the address of the Almighty was to convince Job of his majesty, and that object was fully accomplished.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And that no thought - No purpose or plan of thine. God was able to execute all his designs.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Can be withholden from thee - Margin, \"or, of thine can be hindered.\" Literally, \"cut off\" - בצר  bâtsar. The word, however, means also \"to cut off access to,\" and then to prevent, hinder, restrain. This is its meaning here; so Genesis 11:6, \"Nothing will be restrained (יבצר  yibâtsar) from them, which they have imagined to do.\" ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Can be withholden from thee - Margin, \"or, of thine can be hindered.\" Literally, \"cut off\" - בצר  bâtsar. The word, however, means also \"to cut off access to,\" and then to prevent, hinder, restrain. This is its meaning here; so ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 11:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", \"Nothing will be restrained (יבצר  yibâtsar) from them, which they have imagined to do.\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2. In the first clause he owns God to be omnipotent over nature, as contrasted with his own feebleness, which God had proved (Job 40:15; 41:34); in the second, that God is supremely just (which, in order to be governor of the world, He must needs be) in all His dealings, as contrasted with his own vileness (Job 42:6), and incompetence to deal with the wicked as a just judge (Job 40:8-14).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "thought—\"purpose,\" as in Job 17:11; but it is usually applied to evil devices (Job 21:27; Ps 10:2): the ambiguous word is designedly chosen to express that, while to Job's finite view, God's plans seem bad, to the All-wise One they continue unhindered in their development, and will at last be seen to be as good as they are infinitely wise. No evil can emanate from the Parent of good (Jas 1:13, 17); but it is His prerogative to overrule evil to good.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Thou canst do; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " not only by power, (for that he always thought,) but also by right; about which he had in some sort doubted and disputed. It is a maxim in law, that a man can only do that which he hath a right to do. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Every thing; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " whatsoever it pleaseth thee to do with thy creatures. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "No thought can be withholden from thee; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " he speaks either, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. Of Job’s thoughts. Thou knowest me and all my sinful and unworthy thoughts of thy providential dealings with me, though I was not able to see the evil of them. Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. Of God’s thoughts. Whatsoever thou thinkest or proposest to do thou canst or mayst do it; and neither I nor any of thy creatures can either restrain thee from it, or condemn thee for it, as I have boldly and wickedly presumed to do. So this last clause of the verse explains the former. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "I know that thou canst do every thing,.... As the works of creation, and the sustentation of them, show; so the Targum, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"thou sustainest all things,'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and can manage, every creature made by him, even such as were not tractable by men, such as behemoth and leviathan, the creatures last instanced in; and was able to abase and bring low the proud, which Job could not do; and could also save him by his right hand, and bring him out of his low estate in which he was, and raise him to great prosperity again, which Job always despaired of till now; and though he had a theoretical knowledge of the omnipotence of God before, see Job 9:4; yet not a practical experimental knowledge of it; at least not to such a degree as he now had, working upon his heart, bowing his will, and bringing him to a resignation to the will of God; he not only knew he could do all things, but that he had a right to do what he pleased; and that whatever he did he did well and wisely, and in a righteous manner, of which before he seemed to have some doubt. And that no thought can be withholden from thee; either no thought of men, good or bad, of God or of themselves, and so is an acknowledgment of the omniscience of God, and may be an appeal to that; that God, who knows the secrets of men's hearts, knew what thoughts Job now had of God; of the wisdom, righteousness, and goodness of God in the dispensations of his providence, different from what he had before; see John 21:17; or rather it may be understood of every thought of God's heart, of every secret purpose and wise counsel of his; which, as they are all well known to him, and cannot be withheld from having effect, or the performance of them hindered, Job now saw and was fully assured that all that had befallen him was according to the sovereign and inscrutable purposes of God, and according to the wise counsels of his will; he knew that not only God could do everything, but that he also did whatever he pleased. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and can manage, every creature made by him, even such as were not tractable by men, such as behemoth and leviathan, the creatures last instanced in; and was able to abase and bring low the proud, which Job could not do; and could also save him by his right hand, and bring him out of his low estate in which he was, and raise him to great prosperity again, which Job always despaired of till now; and though he had a theoretical knowledge of the omnipotence of God before, see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 9:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; yet not a practical experimental knowledge of it; at least not to such a degree as he now had, working upon his heart, bowing his will, and bringing him to a resignation to the will of God; he not only knew he could do all things, but that he had a right to do what he pleased; and that whatever he did he did well and wisely, and in a righteous manner, of which before he seemed to have some doubt. And that no thought can be withholden from thee; either no thought of men, good or bad, of God or of themselves, and so is an acknowledgment of the omniscience of God, and may be an appeal to that; that God, who knows the secrets of men's hearts, knew what thoughts Job now had of God; of the wisdom, righteousness, and goodness of God in the dispensations of his providence, different from what he had before; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 21:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; or rather it may be understood of every thought of God's heart, of every secret purpose and wise counsel of his; which, as they are all well known to him, and cannot be withheld from having effect, or the performance of them hindered, Job now saw and was fully assured that all that had befallen him was according to the sovereign and inscrutable purposes of God, and according to the wise counsels of his will; he knew that not only God could do everything, but that he also did whatever he pleased. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "I know that thou canst do every thing, and that no {a} thought can be withholden from thee.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I know that thou canst do every ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "thing",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "that",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " no ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{a}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " thought can be withholden from thee.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(a) No thought so secret but you see it, nor anything that you think but that you can bring it to pass.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "do every thing",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "canst do all",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "no thought can be withholden",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] That is, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "no purpose",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The meaning is that there is no purpose which the Almighty cannot carry out. Though literally the words seem merely an acknowledgement of power, they are also an admission of wisdom, the plans or purposes of which may be beyond the understanding of man (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Job 42:3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 42:3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "). Job does not, as might have been expected, acknowledge the Divine righteousness. His confession corresponds to the Almighty’s address to him. That address did not insist on any one Divine attribute, but rather presented God in the whole circle of His attributes, power and wisdom but also goodness, for He refreshes the thirsty ground where no man is. He feeds the ravens, and presides over the birth-pangs of the goats of the rock; and His omnipotence goes hand in hand with His moral rule (ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 40:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "seq",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".). The Divine nature is not a segment but a circle. Any one Divine attribute implies all others. Omnipotence cannot exist apart from righteousness. Similarly Job’s reply reflects the great, general impression of God now made on him. The exhibition of the Divine wisdom as it operates in nature has led him to feel that within his own history also there is a divine “thought” or “counsel,” though he is unable to understand it. It can hardly, however, be the Author’s purpose to teach the general principle that the “counsel” of God is incomprehensible, because he gives an explanation of it in the Prologue. He is not teaching general principles here, but shewing the position which just thoughts of God will induce a man to take, even when God’s dealings may be beyond his understanding.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Job 42:2",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "  1  Then Job answered Jehovah, and said:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "  2  Now I know that Thou canst do all things,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And no plan is impracticable to Thee.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "  3  \"Who then hideth counsel - ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Without knowledge?\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Thus have I judged without understanding,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "What was too wonderful for me, without knowing.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "He indeed knew previously what he acknowledges in Job 42:2, but now this knowledge has risen upon him in a new divinely-worked clearness, such as he has not hitherto experienced. Those strange but wondrous monsters are a proof to him that God is able to put everything into operation, and that the plans according to which He acts are beyond the reach of human comprehension. If even that which is apparently most contradictory, rightly perceived, is so glorious, his affliction is also no such monstrous injustice as he thinks; on the contrary, it is a profoundly elaborated מזמּה, a well-digested, wise עצה of God. In Job 42:3 he repeats to himself the chastening word of Jehovah, Job 38:2, while he chastens himself with it; for he now perceives that his judgment was wrong, and that he consequently has merited the reproof. With לכן he draws a conclusion from this confession which the chastening word of Jehovah has presented to him: he has rashly pronounced an opinion upon things that lie beyond his power of comprehension, without possessing the necessary capacity of judging and perception. On the mode of writing ידעתּ, Cheth., which recalls the Syriac form med'et (with the pronominal suff. cast off), vid., Ges. 44, rem. 4; on the expression Job 42:2, comp. Genesis 11:6. The repetition of Job 38:2 in Job 42:3 is not without some variations according to the custom of authors noticed in Psalter, i. 330. הגּדתּי, \"I have affirmed,\" i.e., judged, is, Job 42:3, so that the notion of judging goes over into that of pronouncing a judgment. The clauses with ולא are circumstantial clauses, Ew. 341, a. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "He indeed knew previously what he acknowledges in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 42:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", but now this knowledge has risen upon him in a new divinely-worked clearness, such as he has not hitherto experienced. Those strange but wondrous monsters are a proof to him that God is able to put everything into operation, and that the plans according to which He acts are beyond the reach of human comprehension. If even that which is apparently most contradictory, rightly perceived, is so glorious, his affliction is also no such monstrous injustice as he thinks; on the contrary, it is a profoundly elaborated מזמּה, a well-digested, wise עצה of God. In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 42:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " he repeats to himself the chastening word of Jehovah, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 38:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", while he chastens himself with it; for he now perceives that his judgment was wrong, and that he consequently has merited the reproof. With לכן he draws a conclusion from this confession which the chastening word of Jehovah has presented to him: he has rashly pronounced an opinion upon things that lie beyond his power of comprehension, without possessing the necessary capacity of judging and perception. On the mode of writing ידעתּ, Cheth., which recalls the Syriac form med'et (with the pronominal suff. cast off), vid., Ges. 44, rem. 4; on the expression ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 42:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 11:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The repetition of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 38:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 42:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is not without some variations according to the custom of authors noticed in Psalter, i. 330. הגּדתּי, \"I have affirmed,\" i.e., judged, is, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 42:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", so that the notion of judging goes over into that of pronouncing a judgment. The clauses with ולא are circumstantial clauses, Ew. 341, a. ",
            "children": []
          }
        ]
      }
    ]
  }
]