[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(8) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Therefore take unto you now seven bullocks and seven rams.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—It is remarkable that the sacrifices prescribed for Job’s friends were similar to those which Balaam prescribed for Balak (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 23:2-29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). This is probably one indication out of many that the age of Job was that of Moses, or before it. “My servant Job shall pray for you.” This, strange to say, was the very promise with which Eliphaz himself had closed his third and last speech. His words therefore received a striking fulfilment in the case of himself and his friends. The intercession of Job seems to show us that his character is a typical one, representing to us the character of Christ as the sufferer and the mediator on behalf of man; and as in Job there is no trace of acquaintance with the Divine covenant, the book shows us a sort of anticipation of the Gospel to the Gentile world, that the mercies of God are not limited, as some have thought, to the chosen race, but that the principles of God’s action are the same universally. He deals with men upon a principle of mediation: whether the mediator be Moses, as the mediator of the first covenant; or Job, who was the accepted mediator for his friends beyond the pale of the covenant; or whether the mediator be Jesus Christ, as the one Mediator between God and man.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Job 42:8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 42:8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Therefore take now seven bullocks, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — To make an atonement for what you have said amiss. It seems they were each of them to bring seven bullocks and seven rams, which were to be wholly offered up to God as a burnt-offering; for before, the law of Moses, all sacrifices, even those of atonement, appear to have been wholly burned, and therefore were called burnt-offerings. They thought, doubtless, that they had spoken wonderfully well, and had done a righteous act in pleading God’s cause; but they are told quite the contrary, that God was displeased with them, required a sacrifice from them, and threatened, if they did not bring it, he would deal with them according to their folly. Many times is God angry at that in us which we ourselves are ready to be proud of; and sees much amiss in that which we think was well done. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And go to my servant Job — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Whom, though you condemned him as a hypocrite, I own for my faithful servant. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And offer up a burnt-offering — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "By the hand of Job, whom I hereby constitute your priest, to pray and sacrifice for you. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Lest I deal with you after your folly — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Lest my just judgment take hold of you for your false and foolish speeches.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "42:7-9 After the Lord had convinced and humbled Job, and brought him to repentance, he owned him, comforted him, and put honour upon him. The devil had undertaken to prove Job a hypocrite, and his three friends had condemned him as a wicked man; but if God say, Well done, thou good and faithful servant, it is of little consequence who says otherwise. Job's friends had wronged God, by making prosperity a mark of the true church, and affliction a certain proof of God's wrath. Job had referred things to the future judgment and the future state, more than his friends, therefore he spake of God that which was right, better than his friends had done. And as Job prayed and offered sacrifice for those that had grieved and wounded his spirit, so Christ prayed for his persecutors, and ever lives, making intercession for the transgressors. Job's friends were good men, and belonged to God, and He would not let them be in their mistake any more than Job; but having humbled him by a discourse out of the whirlwind, he takes another way to humble them. They are not to argue the matter again, but they must agree in a sacrifice and a prayer, and that must reconcile them, Those who differ in judgment about lesser things, yet are one in Christ the great Sacrifice, and ought therefore to love and bear with one another. When God was angry with Job's friends, he put them in a way to make peace with him. Our quarrels with God always begin on our part, but the making peace begins on his. Peace with God is to be had only in his own way, and upon his own terms. These will never seem hard to those who know how to value this blessing: they will be glad of it, like Job's friends, upon any terms, though ever so humbling. Job did not insult over his friends, but God being graciously reconciled to him, he was easily reconciled to them. In all our prayers and services we should aim to be accepted of the Lord; not to have praise of men, but to please God.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Therefore take unto you - Or, FOR yourselves.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Seven bullocks and seven rams - The number \"seven\" was a common number in offering animals for sacrifice; see Leviticus 23:18; Numbers 29:32. It was not a number, however, confined at all to Jewish sacrifices, for we find that Balaam gave the direction to Balak, king of Moab, to prepare just this number for sacrifice. \"And Balaam said unto Balak, Build me here seven altars, and prepare me here seven oxen and seven rams;\" Numbers 23:1, Numbers 23:29. The number \"seven\" was early regarded as a perfect number, and it was probably with reference to this that that number of victims was selected, with an intention of offering a sacrifice that would be complete or perfect.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Seven bullocks and seven rams - The number \"seven\" was a common number in offering animals for sacrifice; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Leviticus 23:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 29:32",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". It was not a number, however, confined at all to Jewish sacrifices, for we find that Balaam gave the direction to Balak, king of Moab, to prepare just this number for sacrifice. \"And Balaam said unto Balak, Build me here seven altars, and prepare me here seven oxen and seven rams;\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 23:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Numbers 23:29",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The number \"seven\" was early regarded as a perfect number, and it was probably with reference to this that that number of victims was selected, with an intention of offering a sacrifice that would be complete or perfect.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And go to my servant Job - An acknowledgment of his superiority. It is probably to be understood, also, that Job would act as the officiating priest in offering up the sacrifice. It is observable that no allusion is made in this book to the priestly office, and the conclusion is obvious that the scene is laid before the institution of that office among the Jews; compare the notes at Job 1:5.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And go to my servant Job - An acknowledgment of his superiority. It is probably to be understood, also, that Job would act as the officiating priest in offering up the sacrifice. It is observable that no allusion is made in this book to the priestly office, and the conclusion is obvious that the scene is laid before the institution of that office among the Jews; compare the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 1:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And offer up for yourselves - That is, by the aid of Job. They were to make the offering, though Job was evidently to be the officiating priest.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "A burnt-offering - Notes, Job 1:5.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "A burnt-offering - Notes, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 1:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And my servant Job shall pray for you - In connection with the offering, or as the officiating priest. This is a beautiful instance of the nature and propriety of intercession for others. Job was a holy man; his prayers would be acceptable to God, and his friends were permitted to avail themselves of his powerful intercession in their behalf. It is also an instance showing the nature of the patriarchal worship. It did not consist merely in offering sacrifices. Prayer was to be connected with sacrifices, nor is there any evidence that bloody offerings were regarded as available in securing acceptance with God, except in connection with fervent prayer. It is also an instance showing the nature of the patriarchal \"piety.\" It was \"presumed\" that Job would be ready to do this, and would not hesitate thus to pray for his \"friends.\" Yet it could not be forgotten how much they had wounded his feelings; how severe had been their reproaches; nor how confidently they had maintained that he was an eminently bad man. But it was presumed now that Job would be ready to forgive all this; to welcome his friends to a participation in the same act of worship with him, and to pray for them that their sins might be forgiven. Such is religion, alike in the patriarchal age and under the gospel, prompting us to be ready to forgive those who have pained or injured us, and making us ready to pray that God would pardon and bless them.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "For him will I accept - Margin, \"his face,\" or \"person.\" So the Hebrew. So in Genesis 19:21 (\"margin,\") compare Deuteronomy 28:50. The word \"face\" is thus used to denote the \"person,\" or man. The meaning is, that Job was so holy and upright that God would regard his prayers.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "For him will I accept - Margin, \"his face,\" or \"person.\" So the Hebrew. So in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 19:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " (\"margin,\") compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 28:50",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The word \"face\" is thus used to denote the \"person,\" or man. The meaning is, that Job was so holy and upright that God would regard his prayers.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Lest I deal with you after your folly - As their folly had deserved. There is particular reference here to the sentiments which they had advanced respecting the divine character and government. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Lest I deal with you after your folly - As their folly had deserved. There is particular reference here to the sentiments which they had advanced respecting the divine character and government. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8. seven—(See [565]Introduction). The number offered by the Gentile prophet (Nu 23:1). Job plainly lived before the legal priesthood, &c. The patriarchs acted as priests for their families; and sometimes as praying mediators (Ge 20:17), thus foreshadowing the true Mediator (1Ti 2:5), but sacrifice accompanies and is the groundwork on which the mediation rests.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "him—rather, \"His person [face] only\" (see on [566]Job 22:30). The \"person,\" must be first accepted, before God can accept his offering and work (Ge 4:4); that can be only through Jesus Christ.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "folly—impiety (Job 1:22; 2:10).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Go to my servant Job; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " whom though you have censured and condemned as a hypocrite, I own for my faithful servant, human infirmity excepted. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Offer up",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " by the hand of Job, whom I do hereby constitute your priest, to pray and sacrifice for you. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Him will I accept, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to wit, on your behalf, as well as on his own. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Lest I deal with you after your folly; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " lest my wrath and just judgment take hold of you for your false and foolish speeches. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Therefore take unto you now seven bullocks, and seven rams,.... Creatures used in sacrifice before the giving of the Levitical law, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 4:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and the same number of the same creatures were offered by Balaam in the country of Moab, not far from where ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 54",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "ed, nor at any great distance of time from his age, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 23:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and among the Gentiles in later times (q). And these were typical of Christ, being strong creatures, especially the bullocks, and which were used for labour; and the number seven may point at the perfection of Christ's sacrifice; to which these men were directed in their sacrifices to look for the complete atonement of their sins: now though they were not at their own dwellings, and could not take these out of their own herds and flocks, and Job had none, yet they could purchase them of others; and which having done, they are bid to do as follows: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and go to my servant Job, and offer up for yourselves a burnt offering; that is, by Job, who was to offer it for them in their name, and at whose hands the Lord would accept it, and for his sake. Job, as the head and master of his family, was wont to sacrifice, as every such man did before the Aaronic priesthood took place, Job 1:5. Now this was doing Job a great deal of honour, both by calling him his servant, as before in Job 42:7, and twice more in this; which was plainly giving the cause on his side; confirming the character he always bore, and still retained; and declaring he had other thoughts of him than his friends had; as well by sending them to him with their sacrifices to offer for them; which was saying, that they had sinned, and must offer sacrifice, and that Job was in the right; and therefore must offer the sacrifice for them. This was putting them on a great piece of self-denial; that men, who were older than Job, great personages, heads of families, and who had been wont to offer sacrifices in them, yet are now sent to Job to offer them for them; a man now in mean circumstances, and who in they had treated with great contempt; and he in his turn had used them as roughly. And it was also a trial of Job's grace, and of his forgiving spirit, to do this for them, and pray to God on their behalf: and the Lord's design in it was, to exercise the graces of them both, and to reconcile them to one another, and to himself; ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and go to my servant Job, and offer up for yourselves a burnt offering; that is, by Job, who was to offer it for them in their name, and at whose hands the Lord would accept it, and for his sake. Job, as the head and master of his family, was wont to sacrifice, as every such man did before the Aaronic priesthood took place, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 1:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Now this was doing Job a great deal of honour, both by calling him his servant, as before in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 42:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and twice more in this; which was plainly giving the cause on his side; confirming the character he always bore, and still retained; and declaring he had other thoughts of him than his friends had; as well by sending them to him with their sacrifices to offer for them; which was saying, that they had sinned, and must offer sacrifice, and that Job was in the right; and therefore must offer the sacrifice for them. This was putting them on a great piece of self-denial; that men, who were older than Job, great personages, heads of families, and who had been wont to offer sacrifices in them, yet are now sent to Job to offer them for them; a man now in mean circumstances, and who in they had treated with great contempt; and he in his turn had used them as roughly. And it was also a trial of Job's grace, and of his forgiving spirit, to do this for them, and pray to God on their behalf: and the Lord's design in it was, to exercise the graces of them both, and to reconcile them to one another, and to himself; ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and my servant Job shall pray for you; that their sacrifice might be accepted, and their sin pardoned. In this Job was a type of Christ, as he was in many other things; see the notes on Job 16:9. There is an agreement in his name; Job, whether it signifies love or hatred, desired or hated, in both ways the etymology of it is given; it agrees with Christ, who is beloved of God and man, and the desire of all nations; who hates iniquity, and was hated for his inveighing against it. Job was a type of him in his threefold state; before his low estate, in it, and after it; see Philippians 2:6. In his temptations by Satan, and sufferings from men; and particularly in his office as a priest, who both offered himself a sacrifice for his people, and offers their services and sacrifices of prayer and praise to God; and who prayed for his disciples, and for all the Father has given him, for transgressors and sinners, and even for his enemies that used him ill; ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and my servant Job shall pray for you; that their sacrifice might be accepted, and their sin pardoned. In this Job was a type of Christ, as he was in many other things; see the notes on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 16:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". There is an agreement in his name; Job, whether it signifies love or hatred, desired or hated, in both ways the etymology of it is given; it agrees with Christ, who is beloved of God and man, and the desire of all nations; who hates iniquity, and was hated for his inveighing against it. Job was a type of him in his threefold state; before his low estate, in it, and after it; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Philippians 2:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". In his temptations by Satan, and sufferings from men; and particularly in his office as a priest, who both offered himself a sacrifice for his people, and offers their services and sacrifices of prayer and praise to God; and who prayed for his disciples, and for all the Father has given him, for transgressors and sinners, and even for his enemies that used him ill; ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "for him will I accept; or his face, that is, hear his prayer, and grant what is asked by him; as well as accept his sacrifice; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "lest I deal with you after your folly; as all sin is, being committed against God, a breach of his law, and injurious to men themselves; see Deuteronomy 32:6. Though here it seems to be restrained to their particular sin and folly in their dispute with Job; want of wisdom in them was discerned by Elihu, Job 32:7. So it follows: ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "lest I deal with you after your folly; as all sin is, being committed against God, a breach of his law, and injurious to men themselves; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 32:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Though here it seems to be restrained to their particular sin and folly in their dispute with Job; want of wisdom in them was discerned by Elihu, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 32:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". So it follows: ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "in that ye have not spoken of me the thing which is right, like my servant Job; and if by neglect of his advice, which would have been another instance of their folly, they had provoked the Lord to deal with them as their sin deserved, it must have gone hard with them. The Targum is, ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"lest I should do with you \"what would be\" a reproach'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(or disgrace); would put them to shame, and make them appear ignominious to men; as by stripping them of their substance and honour, and reducing them to the condition Job was in. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(q) \"----Septem mactare juvencos\", &c. Virgil. Aeneid. 6. v. 38, 39. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(q) \"----Septem mactare juvencos\", &c. Virgil. Aeneid. 6. v. 38, 39. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Therefore take unto you now seven bullocks and seven rams, and go to my servant Job, and offer up for yourselves a burnt offering; and my servant Job shall {h} pray for you: for him will I accept: lest I deal with you after your folly, in that ye have not spoken of me the thing which is right, like my servant Job.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Therefore take unto you now seven bullocks and seven rams, and go to my servant Job, and offer up for yourselves a burnt offering; and my servant Job shall ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{h}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " pray for you: for him will I accept: lest I deal with you ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "after your",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " folly, in that ye have not spoken of me ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "the thing which is",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " right, like my servant Job.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(h) When you have reconciled yourselves to him for the faults that you have committed against him, he will pray for you, and I will hear him.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 8.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Therefore take unto you now seven bullocks and seven rams",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". (On the early and widespread prevalence of the rite of sacrifice,-see the comment upon ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 1:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) (On the preference, for sacrificial purposes, of the number seven, see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 23:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 23:1, 14, 29",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 28:11, 19, 27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 29:2, 8, 36",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 15:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " . ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 29:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezra 8:35",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 45:23",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.) It is noticeable that \"seven bullocks and seven rams\" was ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "exactly",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the offering of the Moabite king Balak, and his prophet Balaam, contemporary with Moses. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And go to my servant Job",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Humble yourselves before the man whom you have striven to abase and bring low. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Go to him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - make application to him, that he will be pleased to come to your aid, joining and assisting in the offering which I require at your hands. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And offer up for yourselves a burnt offering",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Do as Job had done for his sins (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 1:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), \"offer a burnt offering;\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "and then my servant Job shall pray for you",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Present at your sacrifice, and sharing in it, he shall assume the highest priestly function, and intercede on your behalf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "For him will I accept",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "his face",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "his person",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "will",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " I ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "accept.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " It is implied that, apart from Job, the three \"comforters\" would not have been listened to, much less have obtained pardon. Lest I deal with you after your folly, in that ye have not spoken of me the thing which is right, like my servant Job (see the comment on the preceding verse). Job 42:8",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "8  And now take unto you seven bullocks and seven rams, and go to My servant Job, and offer an offering for yourselves, and Job My servant shall pray for you; only his person will I accept, that I recompense not unto you your folly: for ye have not spoken what is correct in reference to Me, as My servant Job.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Schlottm., like Ew., translates נכונה what is sincere, and understands it of Job's inward truthfulness, in opposition to the words of the friends contrary to their better knowledge and conscience. But nkwn has not this signification anywhere: it signifies either directum  equals  rectum or erectum  equals  stabile, but not sincerum. However, objective truth and subjective truthfulness are here certainly blended in the notion \"correct.\" The \"correct\" in Job's speeches consists of his having denied that affliction is always a punishment of sin, and in his holding fast the consciousness of his innocence, without suffering himself to be persuaded of the opposite. That denial was correct; and this truthfulness was more precious to God than the untruthfulness of the friends, who were zealous for the honour of God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "After Job has penitently acknowledged his error, God decides between him and the friends according to his previous supplicatory wish, Job 16:21. The heavenly Witness makes Himself heard on earth, and calls Job by the sweet name of עבדי. And the servant of Jehovah is not only favoured himself, but he also becomes the instrument of grace to sinners. As where his faith shone forth he became the prophet of his own and the friends' future, so now he is the priestly mediator between the friends and God. The friends against whom God is angry, but yet not as against רשׁעים, but only as against those who have erred, must bring an offering as their atonement, in connection with which Job shall enter in with a priestly intercession for them, and only him (כּי אם, non alium sed  equals  non nisi), whom they regarded as one punished of God, will God accept (comp. Genesis 19:21) - under what deep shame must it have opened their eyes!",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "After Job has penitently acknowledged his error, God decides between him and the friends according to his previous supplicatory wish, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 16:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The heavenly Witness makes Himself heard on earth, and calls Job by the sweet name of עבדי. And the servant of Jehovah is not only favoured himself, but he also becomes the instrument of grace to sinners. As where his faith shone forth he became the prophet of his own and the friends' future, so now he is the priestly mediator between the friends and God. The friends against whom God is angry, but yet not as against רשׁעים, but only as against those who have erred, must bring an offering as their atonement, in connection with which Job shall enter in with a priestly intercession for them, and only him (כּי אם, non alium sed  equals  non nisi), whom they regarded as one punished of God, will God accept (comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 19:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ") - under what deep shame must it have opened their eyes!",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Here also, as in the introduction of the book, it is the עולה which effects the atonement. It is the oldest and, according to its meaning, the most comprehensive of all the blood-offerings. Bullocks and rams are also the animals for the whole burnt-offerings of the Mosaic ritual; the proper animal for the sin-offering, however, is the he-goat together with the she-goat, which do not occur here, because the age and scene are strange to the Israelitish branching off of the חטאת from the עולה. The double seven gives the mark of the profoundest solemnity to the offering that was to be offered. The three also obey the divine direction; for although they have erred, God's will is above everything in their estimation, and they cheerfully subordinate themselves as friends to the friend.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Hence the Talmudic proverb (vid., Frst's Perlenschnre, S. 80): או איתותא או חברא כחברי איוב, either a friend like Job's friends or death!) ",
        "children": []
      }
    ]
  }
]