[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Job 42:9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 42:9",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "So Eliphaz, &c., did as the Lord commanded — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Showing their repentance by their submission to God, and to Job for God’s sake, and by taking shame to themselves. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The Lord also accepted Job — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Both for his friends and for himself, as the next verse explains it. And as Job prayed and offered sacrifice for those who had grieved and wounded his spirit, so Christ prayed and died for his persecutors, and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ever lives making intercession for transgressors.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "42:7-9 After the Lord had convinced and humbled Job, and brought him to repentance, he owned him, comforted him, and put honour upon him. The devil had undertaken to prove Job a hypocrite, and his three friends had condemned him as a wicked man; but if God say, Well done, thou good and faithful servant, it is of little consequence who says otherwise. Job's friends had wronged God, by making prosperity a mark of the true church, and affliction a certain proof of God's wrath. Job had referred things to the future judgment and the future state, more than his friends, therefore he spake of God that which was right, better than his friends had done. And as Job prayed and offered sacrifice for those that had grieved and wounded his spirit, so Christ prayed for his persecutors, and ever lives, making intercession for the transgressors. Job's friends were good men, and belonged to God, and He would not let them be in their mistake any more than Job; but having humbled him by a discourse out of the whirlwind, he takes another way to humble them. They are not to argue the matter again, but they must agree in a sacrifice and a prayer, and that must reconcile them, Those who differ in judgment about lesser things, yet are one in Christ the great Sacrifice, and ought therefore to love and bear with one another. When God was angry with Job's friends, he put them in a way to make peace with him. Our quarrels with God always begin on our part, but the making peace begins on his. Peace with God is to be had only in his own way, and upon his own terms. These will never seem hard to those who know how to value this blessing: they will be glad of it, like Job's friends, upon any terms, though ever so humbling. Job did not insult over his friends, but God being graciously reconciled to him, he was easily reconciled to them. In all our prayers and services we should aim to be accepted of the Lord; not to have praise of men, but to please God.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The Lord also accepted Job - Margin, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 42:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"the face of.\" The meaning is, that he accepted his prayers and offerings in behalf of his friends. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9. The forgiving spirit of Job foreshadows the love of Jesus Christ and of Christians to enemies (Mt 5:44; Lu 23:34; Ac 7:60; 16:24, 28, 30, 31).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Did according as the Lord commanded them; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " showing their repentance by their submission to God, and to Job for God’s sake, and by taking shame to themselves. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The Lord also accepted Job, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " both for his friends and for himself, as the next verse explains it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "So Eliphaz the Temanite, and Bildad the Shuhite, and Zophar the Naamathite, went,.... Having taken the above creatures for sacrifice, as directed, they went to Job with them; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and did according as the Lord commanded them; offered them by Job for a burnt offering, and desired him to pray for them. This they did, both as to matter and manner, as the Lord ordered them; and they did it immediately, without consulting flesh and blood, the pride and other passions of their hearts; and they all united in it, and served the Lord with one consent, which showed them to be good men; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "the Lord also accepted Job; the sacrifice he offered; perhaps by sending fire from heaven, which consumed the burnt offering: or \"the face of Job\"; he heard his prayer for his friends, and granted his request for them: or \"the person of Job\", as Mr. Broughton renders it; Job in this was a type of Christ also, who is always heard in his intercession and mediation for his people. God has respect to his person, which always acceptable to him, and in whom he is well pleased; and he has respect to his offering and sacrifice, which is of a sweet smelling savour to him. And the persons of his people are accepted in him the Beloved, and all their services and sacrifices of prayer and praise, Matthew 3:17. The Targum is, ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "the Lord also accepted Job; the sacrifice he offered; perhaps by sending fire from heaven, which consumed the burnt offering: or \"the face of Job\"; he heard his prayer for his friends, and granted his request for them: or \"the person of Job\", as Mr. Broughton renders it; Job in this was a type of Christ also, who is always heard in his intercession and mediation for his people. God has respect to his person, which always acceptable to him, and in whom he is well pleased; and he has respect to his offering and sacrifice, which is of a sweet smelling savour to him. And the persons of his people are accepted in him the Beloved, and all their services and sacrifices of prayer and praise, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 3:17",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The Targum is, ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"they did as the Word of the Lord spake unto them, and the Word of the Lord accepted the face of Job.'' ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "\"they did as the Word of the Lord spake unto them, and the Word of the Lord accepted the face of Job.'' ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "So Eliphaz the Temanite and Bildad the Shuhite and Zophar the Naamathite went, and did according as the LORD commanded them: the LORD also accepted Job.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 9.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "So Eliphaz the Temanite and Bildad the Shuhite and Zophar the Naamathite went, and did according as the Lord commanded them",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " \"went\" to Job, and asked his aid and interposition, and obtained it. The Lord also accepted Job; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " looked favourably on Job's intercession, and for his sake pardoned those for whom he made his prayer. Job is thus a type of Christ, not merely in his sufferings, but also in his mediatorial character. Job 42:9",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9  The Eliphaz of Teman, and Bildad of Shuach, and Zophar of Naamah, went forth and did as Jehovah had said to them; and Jehovah accepted the person of Job.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Jehovah has now risen up as a witness for Job, the spiritual redemption is already accomplished; and all that is wanting is, that He who has acknowledged and testified to Job as His servant should also act outwardly and visibly, and in mercy show Himself the righteous One. ",
        "children": []
      }
    ]
  }
]