[{"num":5,"verse":"It is actually being reported that there is sexual sin among you, and it is sexual sin of a kind that is condemned even by pagans — a man is living with his stepmother! "},{"num":2,"verse":"And you stay proud? Shouldn’t you rather have felt some sadness that would have led you to remove from your company the man who has done this thing? "},{"num":3,"verse":"For I myself, even though I am absent physically, am with you spiritually; and I have already judged the man who has done this as if I were present. "},{"num":4,"verse":"In the name of the Lord Yeshua, when you are assembled, with me present spiritually and the power of our Lord Yeshua among us, "},{"num":5,"verse":"hand over such a person to the Adversary for his old nature to be destroyed, so that his spirit may be saved in the Day of the Lord."},{"num":6,"verse":"Your boasting is not good. Don’t you know the saying, “It takes only a little hametz to leaven a whole batch of dough?” "},{"num":7,"verse":"Get rid of the old hametz, so that you can be a new batch of dough, because in reality you are unleavened. For our Pesach lamb, the Messiah, has been sacrificed. "},{"num":8,"verse":"So let us celebrate the Seder not with leftover hametz, the hametz of wickedness and evil, but with the matzah of purity and truth."},{"num":9,"verse":"In my earlier letter I wrote you not to associate with people who engage in sexual immorality. "},{"num":10,"verse":"I didn’t mean the sexually immoral people outside your community, or the greedy, or the thieves or the idol-worshippers — for then you would have to leave the world altogether! "},{"num":11,"verse":"No, what I wrote you was not to associate with anyone who is supposedly a brother but who also engages in sexual immorality, is greedy, worships idols, is abusive, gets drunk or steals. With such a person you shouldn’t even eat! "},{"num":12,"verse":"For what business is it of mine to judge outsiders? Isn’t it those who are part of the community that you should be judging? "},{"num":13,"verse":"God will judge those who are outside. Just expel the evildoer from among yourselves."}]