[{"header":"Don’t Let Your People Live in Sin"},{"num":5,"verse":"I don’t want to believe what I am hearing—that there is sexual sin among you. And it is such a bad kind of sexual sin that even those who have never known God don’t allow it. People say that a man there has his father’s wife."},{"num":2,"verse":"And still you are proud of yourselves! You should have been filled with sadness. And the man who committed that sin should be put out of your group."},{"num":3,"verse":"I cannot be there with you in person, but I am with you in spirit. And I have already judged the man who did this. I judged him the same as I would if I were really there."},{"num":4,"verse":"Come together in the name of our Lord Jesus. I will be with you in spirit, and you will have the power of our Lord Jesus with you."},{"num":5,"verse":"Then turn this man over to Satan. His sinful self has to be destroyed so that his spirit will be saved on the day when the Lord comes again."},{"num":6,"verse":"Your proud talk is not good. You know the saying, “Just a little yeast makes the whole batch of dough rise.”"},{"num":7,"verse":"Take out all the old yeast, so that you will be a new batch of dough. You really are bread without yeast—Passover bread. Yes, Christ our Passover Lamb has already been killed."},{"num":8,"verse":"So let us eat our Passover meal, but not with the bread that has the old yeast, the yeast of sin and wrongdoing. But let us eat the bread that has no yeast. This is the bread of goodness and truth."},{"num":9,"verse":"I wrote to you in my letter that you should not associate with people who sin sexually."},{"num":10,"verse":"But I did not mean the people of this world. You would have to leave the world to get away from all the people who sin sexually, or who are greedy and cheat each other, or who worship idols."},{"num":11,"verse":"I meant you must not associate with people who claim to be believers but continue to live in sin. Don’t even eat with a brother or sister who sins sexually, is greedy, worships idols, abuses others with insults, gets drunk, or cheats people."},{"num":12,"verse":"It is not my business to judge those who are not part of the group of believers. God will judge them, but you must judge those who are part of your group. The Scriptures say, “Make the evil person leave your group.”"}]