[{"header":"Immorality in the Church"},{"num":1,"verse":"It’s been widely reported that there is gross sexual immorality among you—the kind of immorality that’s so revolting it’s not even tolerated by the social norms of unbelievers. Are you proud of the fact that one of your men is having sex with his stepmother? Shouldn’t this heartbreaking scandal bring you to your knees in tears? You must remove the offender from among you!"},{"num":3,"verse":"Even though I am physically far away from you, my spirit is present with you. And as one who is present with you, I have already evaluated and judged the perpetrator. "},{"num":4,"verse":"So call a meeting, and when you gather together in the name of our Lord Jesus, and you know my spirit is present with you in the infinite power of our Lord Jesus, "},{"num":5,"verse":"release this man over to Satan for the destruction of his rebellious flesh, in hope that his spirit may be rescued and restored in the day of the Lord."},{"num":6,"verse":"Boasting over your tolerance of sin is inappropriate. Don’t you understand that even a small compromise with sin permeates the entire fellowship, just as a little leaven permeates a batch of dough? "},{"num":7,"verse":"So remove every trace of your “leaven” of compromise with sin so that you might become new and pure again. For indeed, you are clean because Christ, our Passover Lamb, has been sacrificed for us. "},{"num":8,"verse":"So now we can celebrate our continual feast, not with the old “leaven,” the yeast of wickedness or bitterness, but we will feast on the freshly baked bread of innocence and holiness."},{"header":"Correcting a Misunderstanding"},{"num":9,"verse":"I wrote you in my previous letter asking you not to associate with those who practice sexual immorality. "},{"num":10,"verse":"Yet in no way was I referring to avoiding contact with unbelievers who are immoral, or greedy, or swindlers, or those who worship other gods—for that would mean you’d have to isolate yourself from the world entirely! "},{"num":11,"verse":"But now I’m writing to you so that you would exclude from your fellowship anyone who calls himself a fellow believer and practices sexual immorality, or is consumed with greed, or is an idolater, or is verbally abusive or a drunkard or a swindler. Don’t mingle with them or even have a meal with someone like that. "},{"num":12,"verse":"What right do I have to pronounce judgment on unbelievers? That’s God’s responsibility. But those who are inside the church family are our responsibility to discern and judge. So it’s your duty to remove that wicked one from among you."}]