[{"num":14,"verse":"And it came to pass in Iconium that together they both went into the synagogue of the Jews, and so spoke that a great multitude of both the Jews and also of the Greeks believed."},{"num":2,"verse":"But the unbelieving Jews stirred up the Gentiles and planted evil in their minds against the brethren."},{"num":3,"verse":"A long time therefore they tarried among them, speaking boldly in the Lord, which gave testimony unto the word of His grace, and granted signs and wonders to be done by their hands."},{"num":4,"verse":"But the multitude of the city was divided, and part held with the Jews and part with the apostles."},{"num":5,"verse":"And when there was an assault made both by the Gentiles and also the Jews, with their rulers, to use them spitefully and to stone them,"},{"num":6,"verse":"they were aware of it and fled unto Lystra and Derbe, cities of Lycaonia, and unto the region that lieth round about."},{"num":7,"verse":"And there they preached the Gospel."},{"num":8,"verse":"And there sat at Lystra a certain man, impotent in his feet, being a cripple from his mother’s womb, who never had walked."},{"num":9,"verse":"This same one heard Paul speak who, steadfastly beholding him and perceiving that he had faith to be healed,"},{"num":10,"verse":"said with a loud voice, “Stand upright on thy feet!” And he leaped and walked."},{"num":11,"verse":"And when the people saw what Paul had done, they lifted up their voices, saying in the language of Lycaonia, “The gods have come down to us in the likeness of men.”"},{"num":12,"verse":"And they called Barnabas, Jupiter, and Paul, Mercury, because he was the chief speaker."},{"num":13,"verse":"Then the priest of Jupiter, who was in front of the city, brought oxen and garlands unto the gates and would have done sacrifice along with the people."},{"num":14,"verse":"But when the apostles Barnabas and Paul heard of this, they rent their clothes and ran in among the people, crying out and saying,"},{"num":15,"verse":"“Sirs, why do ye these things? We also are men of like passions as you, and preach unto you that ye should turn from these vanities unto the living God, who made heaven and earth and the sea, and all things that are therein,"},{"num":16,"verse":"and who in times past suffered all nations to walk in their own ways."},{"num":17,"verse":"Nevertheless, He left not Himself without witness, in that He did good, and gave us rain from heaven and fruitful seasons, filling our hearts with food and gladness.”"},{"num":18,"verse":"But even with these sayings they scarcely restrained the people from doing sacrifice unto them."},{"num":19,"verse":"And there came thither certain Jews from Antioch and Iconium who persuaded the people; and having stoned Paul, they dragged him out of the city, supposing he was dead."},{"num":20,"verse":"However, as the disciples stood round about him, he rose up and came into the city; and the next day he departed with Barnabas to Derbe."},{"num":21,"verse":"And when they had preached the Gospel to that city and had taught many, they returned again to Lystra and to Iconium and Antioch,"},{"num":22,"verse":"confirming the souls of the disciples and exhorting them to continue in the faith, and that we must through much tribulation enter into the Kingdom of God."},{"num":23,"verse":"And when they had ordained elders in every church and had prayed with fasting, they commended them to the Lord in whom they believed."},{"num":24,"verse":"And after they had passed throughout Pisidia, they came to Pamphylia."},{"num":25,"verse":"And when they had preached the Word in Perga, they went down into Attalia"},{"num":26,"verse":"and thence sailed to Antioch, from whence they had been commended to the grace of God for the work which they had fulfilled."},{"num":27,"verse":"And when they had come and had gathered the church together, they recounted all that God had done with them, and how He had opened the door of faith unto the Gentiles."},{"num":28,"verse":"And there they remained a long time with the disciples."}]