[{"header":"Paul and Barnabas in Iconium"},{"num":14,"verse":"The same thing happened in the city of Iconium. Paul and Barnabas went into the synagogue and spoke in such a way that a large crowd of Jews and Greeks believed. "},{"num":2,"verse":"But the Jews who refused to believe stirred up some people who were not Jewish and poisoned their minds against the believers. "},{"num":3,"verse":"Paul and Barnabas stayed in the city of Iconium for a long time. They spoke boldly about the Lord, who confirmed their message about his good will by having them perform miracles and do amazing things. "},{"num":4,"verse":"But the people of Iconium were divided. Some were for the Jews, while others were for the apostles."},{"num":5,"verse":"In the meantime, Paul and Barnabas found out that the non-Jewish people and the Jewish people with their rulers planned to attack them and stone them to death. "},{"num":6,"verse":"So they escaped to Lystra and Derbe, cities of Lycaonia, and to the surrounding territory. "},{"num":7,"verse":"They spread the Good News there."},{"header":"Paul and Barnabas in Lystra"},{"num":8,"verse":"A man who was born lame was in Lystra. He was always sitting because he had never been able to walk. "},{"num":9,"verse":"He listened to what Paul was saying. Paul observed him closely and saw that the man believed he could be made well. "},{"num":10,"verse":"So Paul said in a loud voice, “Stand up.” The man jumped up and began to walk."},{"num":11,"verse":"The crowds who saw what Paul had done shouted in the Lycaonian language, “The gods have come to us, and they look human.” "},{"num":12,"verse":"They addressed Barnabas as Zeus and Paul as Hermes because Paul did most of the talking. "},{"num":13,"verse":"Zeus’ temple was at the entrance to the city. The priest of the god Zeus brought bulls with flowery wreaths around their necks to the temple gates. The priest and the crowd wanted to offer a sacrifice to Paul and Barnabas."},{"num":14,"verse":"When the apostles Barnabas and Paul heard what was happening, they were very upset. They rushed into the crowd "},{"num":15,"verse":"and said, “Men, what are you doing? We’re human beings like you. We’re spreading the Good News to you to turn you away from these worthless gods to the living God. The living God made the sky, the land, the sea, and everything in them. "},{"num":16,"verse":"In the past God allowed all people to live as they pleased. "},{"num":17,"verse":"Yet, by doing good, he has given evidence of his existence. He gives you rain from heaven and crops in their seasons. He fills you with food and your lives with happiness.” "},{"num":18,"verse":"Although Paul and Barnabas said these things, they hardly kept the crowd from sacrificing to them."},{"num":19,"verse":"However, Jews from the cities of Antioch and Iconium arrived in Lystra and won the people over. They tried to stone Paul to death and dragged him out of the city when they thought that he was dead. "},{"num":20,"verse":"But when the disciples gathered around him, he got up and went back into the city."},{"header":"Paul and Barnabas Return to Antioch in Syria"},{"num":21,"verse":"They spread the Good News in that city and won many disciples. Then they went back to the cities of Lystra, Iconium, and Antioch (which is in Pisidia). "},{"num":22,"verse":"They strengthened the disciples in these cities and encouraged the disciples to remain faithful. Paul and Barnabas told them, “We must suffer a lot to enter the kingdom of God.” "},{"num":23,"verse":"They had the disciples in each church choose spiritual leaders, and with prayer and fasting they entrusted the leaders to the Lord in whom they believed."},{"num":24,"verse":"After they had gone through Pisidia, they went to Pamphylia. "},{"num":25,"verse":"They spoke the message in the city of Perga and went to the city of Attalia. "},{"num":26,"verse":"From Attalia they took a boat and headed home to the city of Antioch in Syria. (In Antioch they had been entrusted to God’s care for the work they had now finished.) "},{"num":27,"verse":"When they arrived, they called the members of the church together. They reported everything God had done through them, especially that he had given people who were not Jewish the opportunity to believe. "},{"num":28,"verse":"They stayed for a long time with these disciples."}]