[{"num":14,"verse":"And it so happened in Iconium that they went together into the synagogue of the Jews and spoke, so that a great multitude of both the Jews and the Hellenists believed."},{"num":2,"verse":"And the unbelieving Jews stirred up and corrupted the minds of the Gentiles against the brothers."},{"num":3,"verse":"So therefore they stayed there a long time, and spoke boldly in the Lord, Who gave testimony to the word of His grace, and caused signs and wonders to be done by their hands."},{"num":4,"verse":"But the multitude of the city was divided. And some were with the Jews, and some with the Apostles."},{"num":5,"verse":"And when a violent attempt to stone them was made by both the Gentiles and the Jews, with their rulers,"},{"num":6,"verse":"they were made aware of it, and fled to Lystra and Derbe, cities of Lycaonia, and to the surrounding region,"},{"num":7,"verse":"and preached the Gospel there."},{"num":8,"verse":"Now there sat a certain man at Lystra, without strength in his feet, who had been a cripple from his mother’s womb, and had never walked."},{"num":9,"verse":"He heard Paul speak - who, looking at him and perceiving that he had faith to be healed,"},{"num":10,"verse":"said with a loud voice, “Stand upright on your feet!” - And he leaped up and walked."},{"num":11,"verse":"Then, when the people saw what Paul had done, they lifted up their voices, saying in the Lycaonian language, “Gods have come down to us in the likeness of men!”"},{"num":12,"verse":"And they called Barnabas ‘Zeus’, and Paul ‘Hermes’, because he was the chief speaker."},{"num":13,"verse":"Then the priest of Zeus, who dwelt in front of their city, brought bulls with garlands to the gates, and would have sacrificed with the people."},{"num":14,"verse":"But when the Apostles Barnabas and Paul heard it, they tore their clothes, and ran in among the people, crying,"},{"num":15,"verse":"and saying, “O men, why do you do these things!? We are just men, subject to the same passions that you are. And we preach to you that you should turn from these meaningless things, to the living God; Who made heaven and earth, and the sea, and all things in them!"},{"num":16,"verse":"“Who in times past allowed all the Gentiles to walk in their own ways."},{"num":17,"verse":"“Nevertheless, He did not leave Himself without witness, in that He did good, gave us rain from the heaven and fruitful seasons, filling our hearts with food and gladness.”"},{"num":18,"verse":"And, speaking these things, they scarcely restrained the multitude from sacrificing to them."},{"num":19,"verse":"Then some Jews came from Antioch and Iconium who - when they had persuaded the people - stoned Paul and dragged him out of the city, supposing he was dead."},{"num":20,"verse":"But as the disciples stood around him, he rose up, and came into the city. And the next day he left for Derbe with Barnabas."},{"num":21,"verse":"And after they had preached the glad tidings of the Gospel to that city (and had taught many) they returned to Lystra, and to Iconium, and to Antioch,"},{"num":22,"verse":"confirming the disciples’ hearts and exhorting them to continue in the faith: that we must enter into the kingdom of God through many afflictions."},{"num":23,"verse":"And when they had prayed and fasted and ordained them as elders by election in every church, they commended them to the Lord in Whom they believed."},{"num":24,"verse":"Thus they went throughout Pisidia and came to Pamphylia."},{"num":25,"verse":"And when they had preached the word in Perga, they came down to Attalia,"},{"num":26,"verse":"And from there sailed to Antioch, where they had been commended to the grace of God for the work which they had fulfilled."},{"num":27,"verse":"And when they had come and gathered the church together, they recounted all the things which God had done through them, and how He had opened the door of faith to the Gentiles."},{"num":28,"verse":"So they stayed there with the disciples a long time."}]