[{"num":1,"verse":"Joseph took five of his brothers to the king and told him, “My father and my brothers have come from Canaan. They have brought their sheep, goats, cattle, and everything else they own to the region of Goshen.”"},{"num":3,"verse":"who asked them, “What do you do for a living?”"},{"num":4,"verse":"But in our country all the pastures are dried up, and our sheep have no grass to eat. So we, your servants, have come here. Please let us live in the region of Goshen.”"},{"num":5,"verse":"The king said to Joseph, “It’s good that your father and brothers have arrived. "},{"num":6,"verse":"I will let them live anywhere they choose in the land of Egypt, but I suggest that they settle in Goshen, the best part of our land. I would also like for your finest shepherds to watch after my own sheep and goats.”"},{"num":7,"verse":"Then Joseph brought his father Jacob and introduced him to the king. Jacob gave the king his blessing, "},{"num":8,"verse":"and the king asked him, “How old are you?”"},{"num":9,"verse":"Jacob answered, “I have lived only a hundred thirty years, and I have had to move from place to place. My parents and my grandparents also had to move from place to place. But they lived much longer, and their life was not as hard as mine.” "},{"num":10,"verse":"Then Jacob gave the king his blessing once again and left. "},{"num":11,"verse":"Joseph obeyed the king’s orders and gave his father and brothers some of the best land in Egypt near the city of Rameses. "},{"num":12,"verse":"Joseph also provided food for their families."},{"header":"A Famine in Egypt"},{"num":13,"verse":"The famine was bad everywhere in Egypt and Canaan, and the people were suffering terribly. "},{"num":14,"verse":"So Joseph sold them the grain that had been stored up, and he put the money in the king’s treasury. "},{"num":15,"verse":"But when everyone had run out of money, the Egyptians came to Joseph and demanded, “Give us more grain! If you don’t, we’ll soon be dead, because our money’s all gone.”"},{"num":16,"verse":"“If you don’t have any money,” Joseph answered, “give me your animals, and I’ll let you have some grain.” "},{"num":17,"verse":"From then on, they brought him their horses and donkeys and their sheep and goats in exchange for grain."},{"num":18,"verse":"Then the people came to him and said:"},{"num":20,"verse":"The famine became so severe that Joseph finally bought every piece of land in Egypt for the king "},{"num":21,"verse":"and made everyone the king’s slaves, "},{"num":22,"verse":"except the priests. The king gave the priests a regular food allowance, so they did not have to sell their land. "},{"num":23,"verse":"Then Joseph said to the people, “You and your land now belong to the king. I’m giving you seed to plant, "},{"num":24,"verse":"but one-fifth of your crops must go to the king. You can keep the rest as seed or as food for your families.”"},{"num":25,"verse":"“Sir, you have saved our lives!” they answered. “We are glad to be slaves of the king.” "},{"num":26,"verse":"Then Joseph made a law that one-fifth of the harvest would always belong to the king. Only the priests did not lose their land."},{"header":"Jacob Becomes an Old Man"},{"num":27,"verse":"The people of Israel made their home in the land of Goshen, where they became prosperous and had large families. "},{"num":28,"verse":"Jacob himself lived there for seventeen years, before dying at the age of one hundred forty-seven. "},{"num":29,"verse":"When Jacob knew he did not have long to live, he called in Joseph and said, “If you really love me, you must make a solemn promise not to bury me in Egypt. "},{"num":30,"verse":"Instead, bury me in the place where my ancestors are buried.”"},{"num":31,"verse":"“Will you give me your word?” Jacob asked."}]