[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(15) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "All Judah.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The entire southern kingdom.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "With their whole desire.—Or, assent; with perfect willingness. Vulg., “in tota voluntate.”",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "With their whole desire.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Or, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "assent",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; with perfect willingness. Vulg., “in tota voluntate.”",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "And he was found of them.—Or, was at hand to them; in accordance with the promise of Azariah the prophet (2Chronicles 15:2).",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "And he was found of them.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Or, ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "was at hand to them;",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " in accordance with the promise of Azariah the prophet (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2Chronicles 15:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ").",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "The Lord gave them rest.—Another period of tranquility, like that mentioned in 2Chronicles 14:6-7; and perhaps of equal duration. (See on 2Chronicles 16:1.)",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "The Lord gave them rest.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—Another period of tranquility, like that mentioned in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2Chronicles 14:6-7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and perhaps of equal duration. (See on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2Chronicles 16:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".)",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2 Chronicles",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "THE SEARCH THAT ALWAYS FINDS2 Chronicles 15:15",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "THE SEARCH THAT ALWAYS FINDS",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 15:15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " These words occur in one of the least familiar passages of the Old Testament. They describe an incident in the reign of Asa, who was the grandson of Solomon’s foolish son Rehoboam, and was consequently the third king of Judah after the secession of the North. He had just won a great victory, and was returning with his triumphant army to Jerusalem, when there met him a prophet, unknown otherwise, who poured out fiery words, exhorting Asa and his people to cleave to God and to cast away their idols. Asa, encouraged by the prophetic words of this bold speaker for God, screwed himself up, and was able to induce also his people, to effect a great religious reformation. He made a clean sweep of the idols, and gathered the sadly-dwindled nation together in Jerusalem, where they renewed the covenant with the Lord God of their fathers. The text sums up their work and its result. ‘They sought Him with their whole heart, and He was found of them; and the Lord gave them rest round about.’ The words express in simplest form what should be the chief desire of our hearts and occupation of our lives, and what will then be our peaceful experience. We shall best bring out these points if we take the words just as they lie, and consider the seeking, the finding which certainly crowns that seeking, and the rest which ensues on finding God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. The seeking. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I. The seeking.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Now, of course, there is no doubt that what the chronicler meant to describe by the phrase, ‘seeking the Lord,’ was largely the mere external acts of ritual worship, the superficial turning from idols to a purely external recognition of God as the God of Israel. But while there may have been nothing deeper than a change in the nominal object of nominal worship, so far as many were concerned, no doubt a very real turning of heart to God underlay the external change in many other cases, of which the destruction of idols and the renewed observance of the form of Jehovah’s worship were the consequence and sign. That turning of mind, will, and affection towards God must be ours if we are to be among those wise and happy seekers who are sure to find that which-or rather Him whom-they seek and to rest in Him whom they find. That search is not after a lost treasure, nor does it imply ignorance of where its object is to be found. We seek that which we know, and which we may be assured of finding. Therefore there need be no tremors of uncertainty in our quest, and the blessedness of the search is as real as, though different from, the blessedness of the possession which ends it. The famous saying which prefers the search after, to the possession of truth, is more proud than wise; but the comparison which it institutes is so far true that there is a joy in the aspiration after and the efforts towards truth only less joyous than that which attends its attainment. But truth divorced from God is finite and may pall, become familiar and lose its radiance, like a gathered flower; and hence the preference for the search is intelligible though one-sided. But God does not pall, and the more we find Him the more we delight in Him; the highest bliss is to find Him, the next highest is to seek Him; and, since seeking and finding Him are never wholly separate, these kindred joys blend their lights in the experience of all His children.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " But our text lays emphasis on the whole-heartedness of the people’s seeking of God. The search must be earnest and engaged in with the whole energy of our whole being, if any blessing is to come from it. Why! one reason why the great mass of professing Christians make so little of their religion is because they are only half-hearted in it. If you divide a river into two streams the force of each is less than half the power of the original current; and the chances are that you will make a stagnant marsh where there used to be a flowing stream. ‘All in all, or not at all,’ is the rule for life, in all departments. It is the rule in daily business. A man that puts only half himself in his profession or trade, while the other half of his wits is gone woolgathering and dreaming, is predestined from all eternity to fail. The same is true about our religion. If you and I attend to it as a kind of by-occupation; if we give the balance of our time and the superfluity of our energy, after we have done a hard day’s work-say, an hour upon a Sunday-to seeking God, and devote all the rest of the week to seeking worldly prosperity, it is no wonder if our religion languishes, and is mainly a matter of forms, as it is with such hosts of people that call themselves Christians.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Oh! dear brethren, I do believe there is more unconscious unreality in the average Christian man’s endeavour to be a better Christian than there is in almost anything else in the world:-",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘One foot on sea, and one on shore,To one thing constant never.’ ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "‘One foot on sea, and one on shore,",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "To one thing constant never.’",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "That is why so many of us know nothing of a progressive strengthening of our faith, and an increasing conquest of ourselves, and a firmer grasp of God, and a fuller realisation of the blessedness of walking in His ways.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ‘They sought Him with all their heart.’ That does not mean, remember, that there are to be no other desires, for it is a great mistake to pit religion against other things which are meant to be its instruments and its helps. We are not required to seek nothing else in order to seek God wholly. He demands no impossible and fantastic detachment of ourselves from the ordinary and legitimate occupations, affections, and duties of human life, but He does ask that the dominant desire after Him should be powerful enough to express itself through all our actions, and that we should seek for God in them, and for them in God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Whilst thus we are to give the right interpretation to that whole-heartedness in our seeking God, on which the text lays stress, do not let us forget that the one token of it which the text specifies is, casting out our idols. There must be detachment if there is to be attachment. If some climbing plant, for instance, has twisted itself round the unprofitable thorns in the hedge, the gardener, before he can get it to go up the support that it is meant to encircle, has carefully to detach it from the stays to which it has wantonly clung, taking care that in the process he does not break its tendrils and destroy its power of growth. So, to train our souls to cleave to God, and to grow up round the great Stay that is provided for us, there is needed, as an essential part of the process, the voluntary, conscious, conscientious, and constant guarding of ourselves from the vagrancies of our desires, which send out their shoots away from Him; and when the objects of these become idols, then there is nothing for it but that, like Asa and his people, we should hew them to pieces and make a bonfire of them; and then renew our covenant before God. I desire to press that upon you and upon myself. The heart must be emptied of baser liquors, if the new wine of the Kingdom is to be poured into it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " True it is, of course-and thank God for it!-that the most powerful agent in effecting that detachment of ourselves from lower things is our fruition of higher. It is when God comes into the temple that Dagon falls on the threshold. It is when a new affection begins to spring in the heart that old loves are thrust out of it. But whilst that is true, it is also true that the two processes run on simultaneously; and that whilst, on the one hand, if we are ever to overcome our love of the world it must be through the love of God, on the other hand, if we are ever to be confirmed in a whole-hearted love of God, it must be through our conquest of our love of the world. ‘Unite my heart to fear Thy name’ was the profound prayer of the old Psalmist; and the ‘heart,’ according to Old Testament usage, is the central fountain from which flow all the streams of conscious life. To seek Him with the whole heart is to engage the whole self in the quest, and that is the only kind of seeking which has the certainty of success.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. The finding which crowns such seeking. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "II. The finding which crowns such seeking.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘He was found of them.’ Yes; anything is possible rather than that a whole-hearted search after God should be a vain search. For there are, in that case, two seekers-God is seeking for us more truly than we are seeking for Him. And if the mother is seeking her child, and the child its mother, it will be a very wide desert where they will not meet. ‘The Father seeketh such to worship Him,’ that is-the divine activity is going about the world, searching for the heart that turns to Him, and it cannot but be that they that seek Him shall find Him, or ‘shall be found of Him.’ Open the windows, and you cannot keep out the sunshine; open your lungs and you cannot keep out the air. ‘In Him we live and move and have our being,’ and if our desires turn, however blindly, to Him, and are accompanied with the appropriate action, heaven and earth are more likely to rush to ruin than such a searching to be frustrated of its aim.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Brethren! is there anything else in the world of which you can say, ‘Seek, and ye shall find’? You, with white hairs on your heads, have you found anything else in which the chase was sure to result in the capture; in which capture was sure to yield all that the hunter had wished? There is only one direction for a man’s desires and aims, in which disappointment is an impossibility. In all other regions the most that can be promised is ‘Seek, and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "perhaps",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " you will find’; and, when you have found, perhaps you will feel that the prize was not worth the finding. Or it is, ‘Seek, and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "possibly",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " you will find; and after you have found and kept for a little while, you will lose.’ Though it may be",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "‘Better to have loved and lost,Than never to have loved at all,’ ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "‘Better to have loved and lost,",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Than never to have loved at all,’",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "a treasure that slips out of our fingers is not the best treasure that we can search for. But here the assurance is, ‘Seek, and ye ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "shall",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " find; and shall never lose. Find, and you shall always possess.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " What would you think of a company of gold-seekers, hunting about in some exhausted claim, for hypothetical grains, ragged, starving-and all the while in the next gully were lying lumps of gold for the picking up? And that figure fairly represents what people do and suffer who seek for good and do not seek for God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "III. The rest which ensues on finding God. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "III. The rest which ensues on finding God.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "‘The Lord gave them rest round about.’ We believe that the Jewish nation was under special supernatural guidance, so that national adherence to the Law was always followed by external prosperity. That is not, of course, the case with us. But which is the better thing, ‘rest round about’ or rest within? We have no immunity from toil or conflict. Seeking God does not cover our heads from the storm of external calamities, nor arm our hearts against the darts and daggers of many a pain, anxiety, and care, but disturbance around is a very small matter if there be a better thing, rest within.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Do you remember who it was that said, ‘In the world ye shall have tribulation . . . but in Me ye shall have peace’? Then we have, as it were, two abodes-one, as far as regards the life of sense, in the world of sense-another, as far as regards the inmost self, which may, if we will, be in Christ. A vessel with an outer casing and a layer of air between it and the inner will keep its contents hot. So we may have round us the very opposite of repose, and, if God so wills, let us not kick against His will; we may have conflict and stir and strife, and yet a better rest than that of my text may be ours. ‘Rest round about’ is sometimes good and sometimes bad. It is often bad, for it is the people that ‘have no changes’ who most usually ‘do not fear God.’ But rest within, that is sure to come when a man has sought with all his desire for God, whom he has found in all His fullness, is only good and best of all.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " We all know, thank God! in worldly matters and in inferior degree, how blessed and restful it is when some strong affection is gratified, some cherished desire fulfilled. Though these satisfactions are not perpetual, nor perfect, they may teach us what a depth of blessed and calm repose, incapable of being broken by any storms or by any tasks, will come to and abide with the man whose deepest love is satisfied in God, and whose most ardent desires have found more than they sought for in Him. Be sure of this, dear friends! that if we do thus seek, and thus find, it is not in the power of anything ‘that is at enmity with joy’ utterly to ‘abolish or destroy’ the quietness of our hearts. ‘Rest in the Lord, and wait patiently for Him.’ They who thus repose will have peace in their hearts, even whilst tasks and temptations, changes and sorrows, disturb their outward lives. ‘In the world ye shall have tribulation.’ Be it so; it may be borne with submission and thankfulness if in Christ we have peace.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Thus we may have the peace of God, rest in and from Him, entering into us, and in due time, by His gracious guidance and help, we shall enter into eternal rest. Whilst to seek is to find Him, in a very deep and blessed sense, even in this life; in another aspect all our earthly life may be regarded as seeking after Him, and the future as the true finding of Him. That future will bring to those whose hearts have turned from the shows and vanities of time to God a possession of Him so much fuller than was experienced here that the lesser discoveries and enjoyments of Him which are experienced here, scarcely deserve in comparison to be called by the same name. So my text may be taken, as in its first part, a description of the blessed life here-’They sought Him with all their heart’-and in its second, as a shadowy vision of the yet more blessed life hereafter, ‘He was found of them, and the Lord gave them rest round about,’ as well as within, in the land of peace, where sorrow and sighing, and toil and care, shall pass from memory; and they that warred against us shall be far away.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "2 Chronicles 15:15",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Chronicles 15:15",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And all Judah rejoiced at the oath — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That is, a great number of the people; as such general expressions are frequently to be understood: for, doubtless, there were many dissemblers, and ungodly men, at this time among them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "For they had sworn with all their heart, and sought him with their whole desire — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "They professed to do so, and, no doubt, many of them did at this time, though afterward they apostatized from his love and service. Thus the times of renewing our covenant with God should be times of rejoicing. It is an honour and happiness to be in bonds with God, and the closer the better. It was an extraordinary good frame that Judah was now in: O that there had always been such a heart in them!",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "15:1-19 The people make a solemn covenant with God. - The work of complete reformation appeared so difficult, that Asa had not courage to attempt it, till assured of Divine assistance and acceptance. He and his people offered sacrifices to God; thanksgiving for the favours they had received, and supplication for further favours. Prayers and praises are now our spiritual sacrifices. The people, of their own will, covenanted to seek the Lord, each for himself, with earnestness. What is religion but seeking God, inquiring after him, applying to him upon all occasions? We make nothing of our religion, if we do not make heart-work of it; God will have all the heart, or none. Our devotedness to God our Saviour, should be avowed and shown in the most solemn and public manner. What is done in hypocrisy is a mere drudgery.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Solemn renewals of the original covenant which God made with their fathers in the wilderness ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 24:3-8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " occur from time to time in the history of the Jews, following upon intervals of apostasy. This renewal in the reign of Asa is the first on record. The next falls 300 years later in the reign of Josiah. There is a third in the time of Nehemiah (see the marginal references). On such occasions, the people bound themselves by a solem oath to observe all the directions of the Law, and called down God's curse upon them if they forsook it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "10-14. the third month—when was held the feast of pentecost. On this occasion, it was celebrated at Jerusalem by an extraordinary sacrifice of seven hundred oxen and seven thousand sheep, the spoil of the Ethiopians being offered. The assembled worshippers entered with great and holy enthusiasm into a national covenant \"to seek the Lord their God … with all their heart and with all their soul;\" and, at the same time, to execute with rigor the laws which made idolatry punishable with death (2Ch 15:13; De 17:2-5; Heb 10:28). The people testified unbounded satisfaction with this important religious movement, and its moral influence was seen in the promotion of piety, order, and tranquillity throughout the land.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "All Judah rejoiced, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. a great number of the people, as such general expressions are frequently understood; for none doubt but there were many dissemblers and ungodly men at this time among them. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And all Judah rejoiced at the oath,.... The greater part of them; for some there might be who were dissemblers: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for they had sworn with all their heart; in the sincerity and uprightness of their souls: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and sought him with their whole desire; none being more or so desirable as he: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and he was found of them: and favoured them with his presence: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the Lord gave them rest round about; from all their enemies. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and the Lord gave them rest round about; from all their enemies. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And all Judah rejoiced at the oath: for they had sworn with all their heart, and sought him with their whole desire; and he was {h} found of them: and the LORD gave them rest round about.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And all Judah rejoiced at the oath: for they had sworn with all their heart, and sought him with their whole desire; and he was ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{h}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " found of them: and the LORD gave them rest round about.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(h) As long as they served him correctly, so long did he preserve and prosper them.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he was found of them",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] A fulfilment of the promise given in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 15:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 15.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - For the probable duration of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "rest round about",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", spoken of in the last clause, see under ver. 19. 2 Chronicles 15:15",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "This return to the Lord brought joy to all Judah, i.e., to the whole kingdom, because they had sworn with all their heart, and sought the Lord בכל־רצונם, with perfect willingness and alacrity. Therefore Jahve was found of them, and gave them rest round about. - In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 15:16-18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", in conclusion, everything which still remained to be said of Asa's efforts to promote the Jahve-worship is gathered up. Even the queen-mother Maachah was deposed by him from the dignity of ruler because she had made herself an image of Asherah; yet he did not succeed in wholly removing the altars on the high places from the land, etc. These statements are also to be found in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 15:13-16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and are commented upon at that place. Only in the Chronicle we have אסא אם instead of אמּו (Kings), because there Maachah had just been named (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 15:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); and to the statement as to the abolition of idolatry, ירק, crushed, is added, and in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 15:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " מיּשׂראל; while, on the other hand, after שׁלם, יהוה עם is omitted, as not being necessary to the expression of the meaning. ",
        "children": []
      }
    ]
  }
]