[{"header":"Cornelius Sees a Vision"},{"num":10,"verse":"At Caesarea there was a man named Cornelius, who was a centurion in what was called the Italian Regiment. "},{"num":2,"verse":"He was devout and God-fearing, as was his entire family. He gave generous gifts to the poor and always prayed to God."},{"num":3,"verse":"One day at about the ninth hour, he clearly saw a vision in which an angel of God came to him and said, “Cornelius!”"},{"num":4,"verse":"Cornelius stared at him in terror and replied, “What is it, Lord?”"},{"num":5,"verse":"Now send men to Joppa to get a man named Simon, who is called Peter. "},{"num":6,"verse":"He is staying as a guest with Simon the tanner, whose house is by the sea.”"},{"num":7,"verse":"When the angel who spoke to him had left, Cornelius called two of his household servants and a devout soldier who was one of his personal attendants. "},{"num":8,"verse":"After explaining everything to them, he sent them to Joppa."},{"header":"Peter Sees a Vision"},{"num":9,"verse":"The next day, as they were on their way and approaching the city, Peter went up on the roof to pray at about the sixth hour. "},{"num":10,"verse":"He became hungry and wanted to eat, but while they were preparing the meal, he fell into a trance. "},{"num":11,"verse":"He saw heaven opened and an object coming down. It was like a large sheet being let down to earth by its four corners. "},{"num":12,"verse":"In it were all kinds of four-footed animals and reptiles of the earth and birds of the sky."},{"num":13,"verse":"Then a voice said to him, “Get up, Peter, kill and eat!”"},{"num":14,"verse":"But Peter said, “Certainly not, Lord, for I have never eaten anything impure or unclean.”"},{"num":15,"verse":"Yet the voice came to him a second time: “What God has made clean, you must not continue to call unclean.”"},{"num":16,"verse":"This happened three times, and then the object was immediately taken up to heaven."},{"num":17,"verse":"While Peter was inwardly perplexed about what the vision he had seen might mean, just then the men who were sent by Cornelius arrived. They had asked for directions to Simon’s house and were standing at the gate. "},{"num":18,"verse":"They called out, asking if Simon, who was also called Peter, was staying there as a guest."},{"num":19,"verse":"While Peter was still deep in thought about the vision, the Spirit said to him, “See, three men are looking for you! "},{"num":20,"verse":"Now get up, go downstairs, and don’t hesitate to go with them, because I have sent them.”"},{"num":21,"verse":"Peter went down to the men and said, “I am the one you are looking for. Why have you come?”"},{"num":22,"verse":"They replied, “Cornelius the centurion is a righteous and God-fearing man, who is highly respected by the whole Jewish nation. He was directed by a holy angel to send for you to come to his house and to listen to what you have to say.” "},{"num":23,"verse":"So Peter invited them in and received them as guests."},{"header":"Peter Goes to the Home of Cornelius"},{"num":24,"verse":"The following day, he arrived in Caesarea. Cornelius was expecting them and had called together his relatives and close friends. "},{"num":25,"verse":"As Peter was about to enter the house, Cornelius met him, fell at his feet, and worshipped him. "},{"num":26,"verse":"But Peter helped him up and said, “Stand up! I too am just a man.”"},{"num":27,"verse":"While he talked with him, Peter went inside and found many people gathered there. "},{"num":28,"verse":"He said to them, “You understand how unlawful it is for a Jewish man to associate with or visit anyone who is not a Jew. But God showed me that I should no longer continue to call anyone impure or unclean. "},{"num":29,"verse":"That is why I came without objection when you sent for me. May I ask why you sent for me?”"},{"num":30,"verse":"Cornelius replied, “From four days ago to this hour, I have been fasting. At the ninth hour, I was praying in my house when a man in shining clothes suddenly stood in front of me. "},{"num":31,"verse":"He said, ‘Cornelius, your prayer has been heard and your gifts to the poor have been remembered in God’s sight. "},{"num":32,"verse":"Therefore send to Joppa and call for Simon, who is called Peter. He is staying as a guest in the house of Simon the tanner, by the sea. When he comes, he will speak to you.’ "},{"num":33,"verse":"So I sent for you immediately, and it was good of you to come. Now then, we are all here in the presence of God to listen to everything that the Lord has instructed you to say.”"},{"header":"The Holy Spirit Comes on All Who Listen"},{"num":34,"verse":"Then Peter began to speak: “Now I really am beginning to understand that God does not show favoritism, "},{"num":35,"verse":"but in every nation, anyone who fears him and does what is right is acceptable to him. "},{"num":36,"verse":"He sent his word to the people of Israel, proclaiming the good news of peace through Jesus Christ, who is Lord of all."},{"num":37,"verse":"“You know what happened throughout Judea, beginning in Galilee after the baptism that John preached. "},{"num":38,"verse":"God anointed Jesus of Nazareth with the Holy Spirit and with power. He went around doing good and healing all who were oppressed by the Devil, because God was with him."},{"num":39,"verse":"“Indeed, we are witnesses of all the things he did in the country of the Jews and in Jerusalem, yet they killed him by hanging him on a cross. "},{"num":40,"verse":"But God raised him on the third day and caused him to be seen, "},{"num":41,"verse":"not by all the people, but by the witnesses God had already chosen—by us, who ate and drank with him after he rose from the dead. "},{"num":42,"verse":"He commanded us to preach to the people and to testify solemnly that he is the one appointed by God as judge of the living and the dead. "},{"num":43,"verse":"All the prophets testify about him that, through his name, everyone who believes in him receives forgiveness of sins.”"},{"num":44,"verse":"While Peter was still speaking these words, the Holy Spirit came on all who were listening to the message. "},{"num":45,"verse":"All the circumcised believers who had come with Peter were amazed that the gift of the Holy Spirit had been poured out, even on the Gentiles. "},{"num":46,"verse":"For they heard them speaking in other languages and praising God."},{"num":47,"verse":"“Certainly no one can refuse water for baptizing these people! They have received the Holy Spirit just as we have.” "},{"num":48,"verse":"He gave directions that they be baptized in the name of Jesus Christ. Then they asked him to stay for a few days."}]