[{"header":"God’s chest is returned"},{"num":6,"verse":"The Lord’s chest was in Philistine territory for seven months."},{"num":2,"verse":"The Philistines called for the priests and the diviners. “What should we do with the Lord’s chest?” they asked. “Tell us how we should send it back to its own home.”"},{"num":3,"verse":"They replied, “If you are returning the chest of Israel’s God, don’t send it back empty, but be sure to return a guilt offering to him. Then you will be healed, and it will become clear to you why God’s hand hasn’t left you alone.”"},{"num":4,"verse":"“What compensation offering should we return to him?” they asked."},{"num":5,"verse":"You must make images of your tumors and the mice that have devastated the land. Honor Israel’s God. Perhaps he will lighten the weight of his hand on you, your gods, and your land."},{"num":6,"verse":"Why be stubborn like the Egyptians and Pharaoh? After God had dealt harshly with them, didn’t they send the Israelites on their way?"},{"num":7,"verse":"So get a new cart ready along with two nursing cows that have never been yoked before. Harness the cows to the cart, but take any of their calves that are following back home."},{"num":8,"verse":"Next, take the Lord’s chest and put it in the cart. Set the gold items that you are giving God as a compensation offering in a box next to the chest. Then send it on its way."},{"num":9,"verse":"Then watch what happens: If the cart goes up the road to its own territory toward Beth-shemesh, then Israel’s God has brought this great disaster on us. If the cart goes another way, then we’ll know that it wasn’t God’s hand that struck us. It happened to us randomly.”"},{"num":10,"verse":"The rulers did just that. They took two nursing cows and harnessed them to the cart, penning their calves up at home."},{"num":11,"verse":"They put the Lord’s chest on the cart along with the box containing the gold mice and the images of their tumors."},{"num":12,"verse":"The cows went straight ahead, following the road to Beth-shemesh. They kept to one route, mooing as they went, without turning right or left. The Philistine rulers followed them as far as the territory of Beth-shemesh."},{"num":13,"verse":"Now the people of Beth-shemesh were harvesting wheat in the valley. When they looked up and saw the chest, they were overjoyed at the sight."},{"num":14,"verse":"The cart entered the field belonging to Joshua of Beth-shemesh and stopped right by a large stone. They chopped up the wood of the cart and offered the cows as an entirely burned offering to the Lord."},{"num":15,"verse":"The Levites unloaded the Lord’s chest and the box that was with it that contained all the gold items, and they set them on the large stone. That very day the people of Beth-shemesh offered entirely burned offerings and made sacrifices to the Lord."},{"num":16,"verse":"When the five Philistine rulers witnessed this, they went straight back to Ekron."},{"num":17,"verse":"These are the gold tumors that the Philistines returned as a compensation offering to the Lord: one for Ashdod, one for Gaza, one for Ashkelon, one for Gath, and one for Ekron."},{"num":18,"verse":"The gold mice matched the number of Philistine cities belonging to the five rulers, from fortified cities to country villages. And the large stone they set the Lord’s chest on is a witness even now in the field that belongs to Joshua of Beth-shemesh."},{"num":19,"verse":"But God struck down some of the people from Beth-shemesh because they looked into the Lord’s chest. God struck seventy people, and the community grieved because the Lord had struck them so severely."},{"num":20,"verse":"The people of Beth-shemesh said, “Who can stand before the Lord, this holy God? Where can he go that is away from us here?”"},{"num":21,"verse":"They sent messengers to the inhabitants of Kiriath-jearim. “The Philistines returned the Lord’s chest!” they said. “Come down and take it back with you.”"}]