[{"header":"The Philistines Return the Ark to Israel"},{"num":6,"verse":"The ark of the Lord had been in Philistine territory for seven months. "},{"num":2,"verse":"The Philistines called for the priests and for those who practice evil magic. They wanted their advice. They said to them, “What should we do with the ark of the Lord? Tell us how we should send it back to its place.”"},{"num":3,"verse":"They answered, “If you return the ark of the god of Israel, don’t send it back to him without a gift. Be sure you send a guilt offering to their god along with it. Then you will be healed. You will find out why his power has continued to be against you.”"},{"num":4,"verse":"The Philistines asked, “What guilt offering should we send to him?”"},{"num":5,"verse":"Make models of the rats and the growths that are destroying the country. Give honor to Israel’s god. Then perhaps his power will no longer be against you, your gods and your land. "},{"num":6,"verse":"Why are you stubborn, as Pharaoh and the people of Egypt were? Israel’s god was very hard on them. Only then did they send the Israelites out. Only then did they let them go on their way."},{"num":7,"verse":"“Now then, get a new cart ready. Get two cows that have just had calves. Be sure the cows have never pulled a cart before. Tie the cart to them. But take their calves away and put them in a pen. "},{"num":8,"verse":"Then put the ark of the Lord on the cart. Put the gold models in a chest beside the ark. Send them back to the Lord as a guilt offering. Send the cart on its way. "},{"num":9,"verse":"But keep an eye on the cart. See if it goes up toward Beth Shemesh to its own territory. If it does, then it’s the Lord who has brought this horrible trouble on us. But if it doesn’t, then we’ll know it wasn’t his hand that struck us. We’ll know it happened to us by chance.”"},{"num":10,"verse":"So that’s what they did. They took the two cows and tied the cart to them. They put the calves in a pen. "},{"num":11,"verse":"They placed the ark of the Lord on the cart. They put the chest there along with it. The chest held the gold models of the rats and of the growths. "},{"num":12,"verse":"Then the cows went straight up toward Beth Shemesh. They stayed on the road. They were mooing all the way. They didn’t turn to the right or the left. The Philistine rulers followed them all the way to the border of Beth Shemesh."},{"num":13,"verse":"The people of Beth Shemesh were working in the valley. They were gathering their wheat crop. They looked up and saw the ark. When they saw it, they were filled with joy. "},{"num":14,"verse":"The cart came to the field of Joshua of Beth Shemesh. It stopped there beside a large rock. The people chopped up the wood the cart was made out of. They sacrificed the cows as a burnt offering to the Lord. "},{"num":15,"verse":"Some Levites had taken the ark of the Lord off the cart. They had also taken off the chest that held the gold models. They placed them on the large rock. On that day the people of Beth Shemesh offered burnt offerings to the Lord. They also made sacrifices to him. "},{"num":16,"verse":"The five Philistine rulers saw everything that happened. On that same day they returned to Ekron."},{"num":17,"verse":"The Philistines sent gold models of growths as a guilt offering to the Lord. There was one each for Ashdod, Gaza, Ashkelon, Gath and Ekron. "},{"num":18,"verse":"They also sent five gold models of rats. There was one for each of the Philistine towns that belonged to the five rulers. Each of those towns had high walls around it. The towns also had country villages around them. The Levites set the ark of the Lord on the large rock. To this day the rock is a witness to what happened there. It’s in the field of Joshua of Beth Shemesh."},{"num":19,"verse":"But some of the people of Beth Shemesh looked into the ark of the Lord. So he struck them down. He put 70 of them to death. The rest of the people were filled with sorrow. That’s because the Lord had killed so many of them. "},{"num":20,"verse":"The people of Beth Shemesh said, “The Lord is a holy God. Who can stand in front of him? Where can the ark go up to from here?”"},{"num":21,"verse":"Then messengers were sent to the people of Kiriath Jearim. The messengers said, “The Philistines have returned the ark of the Lord. Come down and take it up to your town.” "}]