[{"header":"The Special Box Returned to Israel"},{"num":6,"verse":"The special box of the Lord had been in the country of the Philistines seven months. "},{"num":2,"verse":"The Philistines called for the religious leaders and those who were wise in secret ways, saying, “What should we do with the special box of the Lord? Tell us how we should send it to its place.” "},{"num":3,"verse":"And they said, “If you send away the special box of the God of Israel, do not send it empty. But be sure to return to Him a sin gift. Then you will be healed, and it will be known to you why His hand does not turn away from you.” "},{"num":4,"verse":"Then they said, “What should we return to Him for a sin gift?” And they said, “Five sores made of gold and five gold mice, as many as there are Philistine leaders. For the same trouble was upon all of you and on your leaders. "},{"num":5,"verse":"So make objects to look like your sores and your mice that destroyed the land, and you will give honor to the God of Israel. It may be that He will be easier on you, your gods, and your land. "},{"num":6,"verse":"Why do you make your hearts hard as the Egyptians and Pharaoh made their hearts hard? Do not forget how the God of Israel made it hard for them. And did they not let the people go? "},{"num":7,"verse":"So now take and make ready a new wagon and two milk cows that have never pulled a load. Tie the cows to the wagon and take their calves away from them. "},{"num":8,"verse":"Take the special box of the Lord and put it on the wagon. Put the objects of gold which you return to Him as a sin gift in a box by its side. Then send it away, and let it be gone. "},{"num":9,"verse":"And watch. If it goes on the way to its own land, to Bethshemesh, then He has done this very bad thing to us. But if not, then we will know that it was not His hand that destroyed us. It will have just happened for no reason.”"},{"num":10,"verse":"The men did so. They took two milk cows and tied them to the wagon, and shut up their calves at home. "},{"num":11,"verse":"They put the special box of the Lord on the wagon, and the box with the gold mice and the objects made to look like their sores. "},{"num":12,"verse":"And the cows went straight toward Bethshemesh. They went along the straight road, making a sound as they went. They did not turn aside to the right or to the left. And the leaders of the Philistines followed them to the outside of Bethshemesh. "},{"num":13,"verse":"Now the people of Bethshemesh were gathering their grain in the valley. They looked up and saw the special box of the Lord, and were glad to see it. "},{"num":14,"verse":"The wagon came into the field of Joshua the Bethshemite and stopped there by a big stone. They cut the wood of the wagon into pieces and gave the cows as a burnt gift to the Lord. "},{"num":15,"verse":"The Levites took down the special box of the Lord and the box that was with it that had the objects of gold, and put them on the big stone. The men of Bethshemesh gave burnt gifts in worship that day to the Lord. "},{"num":16,"verse":"When the five leaders of the Philistines saw it, they returned that day to Ekron."},{"num":17,"verse":"These are the sores made of gold which the Philistines returned for a sin gift to the Lord. There was one each for Ashdod, Gaza, Ashkelon, Gath, and Ekron. "},{"num":18,"verse":"And the gold mice were as many as the number of all the cities of the Philistines belonging to the five leaders, both cities with walls and country towns. The big stone where they set the special box of the Lord is there in the field of Joshua the Bethshemite to this day."},{"num":19,"verse":"The Lord killed some of the men of Bethshemesh because they had looked into the special box of the Lord. He killed 70 (50,070) men. And the people were filled with sorrow because the Lord had killed so many of them."},{"header":"The Special Box at Kiriath-jearim"},{"num":20,"verse":"The men of Bethshemesh said, “Who is able to stand before the Lord, this holy God? To whom can we send Him?” "},{"num":21,"verse":"So they sent men to the people living in Kiriath-jearim, saying, “The Philistines have returned the special box of the Lord. Come down and get it.”"}]