[{"num":1,"verse":"Subject: a message from the Lord."},{"num":2,"verse":"“I will sweep away everything in all your land,” says the Lord. “I will destroy it to the ground. "},{"num":3,"verse":"I will sweep away both men and animals alike. Mankind and all the idols that he worships—all will vanish. Even the birds of the air and the fish in the sea will perish. "},{"num":4,"verse":"I will crush Judah and Jerusalem with my fist and destroy every remnant of those who worship Baal; I will put an end to their idolatrous priests, so that even the memory of them will disappear. "},{"num":5,"verse":"They go up on their roofs and bow to the sun, moon, and stars. They ‘follow the Lord,’ but worship Molech too! I will destroy them. "},{"num":6,"verse":"And I will destroy those who formerly worshiped the Lord, but now no longer do, and those who never loved him and never wanted to.”"},{"num":7,"verse":"Stand in silence in the presence of the Lord. For the awesome Day of his Judgment has come; he has prepared a great slaughter of his people and has chosen their executioners. "},{"num":8,"verse":"“On that Day of Judgment I will punish the leaders and princes of Judah and all others wearing heathen clothing. "},{"num":9,"verse":"Yes, I will punish those who follow heathen customs and who rob and kill to fill their masters’ homes with evil gain of violence and fraud. "},{"num":10,"verse":"A cry of alarm will begin at the farthest gate of Jerusalem, coming closer and closer until the noise of the advancing army reaches the very top of the hill where the city is built."},{"num":11,"verse":"“Wail in sorrow, you people of Jerusalem. All your greedy businessmen, all your loan sharks—all will die."},{"num":12,"verse":"“I will search with lanterns in Jerusalem’s darkest corners to find and punish those who sit contented in their sins, indifferent to God, thinking he will leave them alone. "},{"num":13,"verse":"They are the very ones whose property will be plundered by the enemy, whose homes will be ransacked; they will never have a chance to live in the new homes they have built. They will never drink wine from the vineyards they have planted."},{"num":14,"verse":"“That terrible day is near. Swiftly it comes—a day when strong men will weep bitterly. "},{"num":15,"verse":"It is a day of the wrath of God poured out; it is a day of terrible distress and anguish, a day of ruin and desolation, a day of darkness and gloom, of clouds, blackness, "},{"num":16,"verse":"trumpet calls, and battle cries; down go the walled cities and strongest battlements!"},{"num":17,"verse":"“I will make you as helpless as a blind man searching for a path because you have sinned against the Lord; therefore, your blood will be poured out into the dust and your bodies will lie there rotting on the ground.”"},{"num":18,"verse":"Your silver and gold will be of no use to you in that day of the Lord’s wrath. You cannot ransom yourselves with it. For the whole land will be devoured by the fire of his jealousy. He will make a speedy riddance of all the people of Judah."}]