[{"header":"Azariah Reigns over Judah"},{"num":15,"verse":"In the twenty-seventh year of King Jeroboam of Israel King Azariah son of Amaziah of Judah began to reign. "},{"num":2,"verse":"He was sixteen years old when he began to reign, and he reigned fifty-two years in Jerusalem. His mother’s name was Jecoliah of Jerusalem. "},{"num":3,"verse":"He did what was right in the sight of the Lord, just as his father Amaziah had done. "},{"num":4,"verse":"Nevertheless the high places were not taken away; the people still sacrificed and made offerings on the high places. "},{"num":5,"verse":"The Lord struck the king, so that he was leprous to the day of his death, and lived in a separate house. Jotham the king’s son was in charge of the palace, governing the people of the land. "},{"num":6,"verse":"Now the rest of the acts of Azariah, and all that he did, are they not written in the Book of the Annals of the Kings of Judah? "},{"num":7,"verse":"Azariah slept with his ancestors; they buried him with his ancestors in the city of David; his son Jotham succeeded him."},{"header":"Zechariah Reigns over Israel"},{"num":8,"verse":"In the thirty-eighth year of King Azariah of Judah, Zechariah son of Jeroboam reigned over Israel in Samaria six months. "},{"num":9,"verse":"He did what was evil in the sight of the Lord, as his ancestors had done. He did not depart from the sins of Jeroboam son of Nebat, which he caused Israel to sin. "},{"num":10,"verse":"Shallum son of Jabesh conspired against him, and struck him down in public and killed him, and reigned in place of him. "},{"num":11,"verse":"Now the rest of the deeds of Zechariah are written in the Book of the Annals of the Kings of Israel. "},{"num":12,"verse":"This was the promise of the Lord that he gave to Jehu, “Your sons shall sit on the throne of Israel to the fourth generation.” And so it happened."},{"header":"Shallum Reigns over Israel"},{"num":13,"verse":"Shallum son of Jabesh began to reign in the thirty-ninth year of King Uzziah of Judah; he reigned one month in Samaria. "},{"num":14,"verse":"Then Menahem son of Gadi came up from Tirzah and came to Samaria; he struck down Shallum son of Jabesh in Samaria and killed him; he reigned in place of him. "},{"num":15,"verse":"Now the rest of the deeds of Shallum, including the conspiracy that he made, are written in the Book of the Annals of the Kings of Israel. "},{"num":16,"verse":"At that time Menahem sacked Tiphsah, all who were in it and its territory from Tirzah on; because they did not open it to him, he sacked it. He ripped open all the pregnant women in it."},{"header":"Menahem Reigns over Israel"},{"num":17,"verse":"In the thirty-ninth year of King Azariah of Judah, Menahem son of Gadi began to reign over Israel; he reigned ten years in Samaria. "},{"num":18,"verse":"He did what was evil in the sight of the Lord; he did not depart all his days from any of the sins of Jeroboam son of Nebat, which he caused Israel to sin. "},{"num":19,"verse":"King Pul of Assyria came against the land; Menahem gave Pul a thousand talents of silver, so that he might help him confirm his hold on the royal power. "},{"num":20,"verse":"Menahem exacted the money from Israel, that is, from all the wealthy, fifty shekels of silver from each one, to give to the king of Assyria. So the king of Assyria turned back, and did not stay there in the land. "},{"num":21,"verse":"Now the rest of the deeds of Menahem, and all that he did, are they not written in the Book of the Annals of the Kings of Israel? "},{"num":22,"verse":"Menahem slept with his ancestors, and his son Pekahiah succeeded him."},{"header":"Pekahiah Reigns over Israel"},{"num":23,"verse":"In the fiftieth year of King Azariah of Judah, Pekahiah son of Menahem began to reign over Israel in Samaria; he reigned two years. "},{"num":24,"verse":"He did what was evil in the sight of the Lord; he did not turn away from the sins of Jeroboam son of Nebat, which he caused Israel to sin. "},{"num":25,"verse":"Pekah son of Remaliah, his captain, conspired against him with fifty of the Gileadites, and attacked him in Samaria, in the citadel of the palace along with Argob and Arieh; he killed him, and reigned in place of him. "},{"num":26,"verse":"Now the rest of the deeds of Pekahiah, and all that he did, are written in the Book of the Annals of the Kings of Israel."},{"header":"Pekah Reigns over Israel"},{"num":27,"verse":"In the fifty-second year of King Azariah of Judah, Pekah son of Remaliah began to reign over Israel in Samaria; he reigned twenty years. "},{"num":28,"verse":"He did what was evil in the sight of the Lord; he did not depart from the sins of Jeroboam son of Nebat, which he caused Israel to sin."},{"num":29,"verse":"In the days of King Pekah of Israel, King Tiglath-pileser of Assyria came and captured Ijon, Abel-beth-maacah, Janoah, Kedesh, Hazor, Gilead, and Galilee, all the land of Naphtali; and he carried the people captive to Assyria. "},{"num":30,"verse":"Then Hoshea son of Elah made a conspiracy against Pekah son of Remaliah, attacked him, and killed him; he reigned in place of him, in the twentieth year of Jotham son of Uzziah. "},{"num":31,"verse":"Now the rest of the acts of Pekah, and all that he did, are written in the Book of the Annals of the Kings of Israel."},{"header":"Jotham Reigns over Judah"},{"num":32,"verse":"In the second year of King Pekah son of Remaliah of Israel, King Jotham son of Uzziah of Judah began to reign. "},{"num":33,"verse":"He was twenty-five years old when he began to reign and reigned sixteen years in Jerusalem. His mother’s name was Jerusha daughter of Zadok. "},{"num":34,"verse":"He did what was right in the sight of the Lord, just as his father Uzziah had done. "},{"num":35,"verse":"Nevertheless the high places were not removed; the people still sacrificed and made offerings on the high places. He built the upper gate of the house of the Lord. "},{"num":36,"verse":"Now the rest of the acts of Jotham, and all that he did, are they not written in the Book of the Annals of the Kings of Judah? "},{"num":37,"verse":"In those days the Lord began to send King Rezin of Aram and Pekah son of Remaliah against Judah. "},{"num":38,"verse":"Jotham slept with his ancestors, and was buried with his ancestors in the city of David, his ancestor; his son Ahaz succeeded him."}]