[{"header":"The Vision of the Golden Menorah"},{"num":4,"verse":"Then the angel who had been speaking with me returned and woke me up as if I had been asleep. "},{"num":2,"verse":"Then he asked me, “What do you see?”"},{"num":3,"verse":"Two olive trees are near it, one on the right side of the bowl and one on the left.”"},{"num":4,"verse":"Then I asked the angel who had been speaking with me, “Sir, what are these?”"},{"num":5,"verse":"The angel who had been speaking with me answered by asking, “You don’t know what these mean, do you?”"},{"header":"The Lord’s First Charge to Zerubbabel"},{"num":6,"verse":"Then he replied to me, “This is this message from the Lord to Zerubbabel: ‘Not by valor nor by strength, but only by my Spirit,’ says the Lord of the Heavenly Armies. "},{"num":7,"verse":"‘Who are you, great mountain? You will become a plain in Zerubbabel’s presence, and he will position the capstone, exulting over it, “How beautiful! How beautiful!”’”"},{"header":"The Lord’s Second Charge to Zerubbabel"},{"num":8,"verse":"Then this message from the Lord came to me again: "},{"num":9,"verse":"“Zerubbabel’s hands have laid the foundation of this Temple, and his hands will finish it, so that you will know that the Lord of the Heavenly Armies has sent me to all of you. "},{"num":10,"verse":"For who has despised the time of insignificant things? They will rejoice to see the plumb line in the hand of Zerubbabel. These seven lights represent the eyes of the Lord, which are looking throughout all of the earth.”"},{"header":"The Two Anointed Ones"},{"num":11,"verse":"Then I asked the angel, “What are these two olive trees, one on the right of the menorah and one on the left?” "},{"num":12,"verse":"I also asked him a second question: “What are these two olive branches on either side of the two golden feeder channels that carry the golden oil to the seven lights?”"},{"num":13,"verse":"The angel replied, “You don’t know what these are, do you?”"},{"num":14,"verse":"He said, “These are the two anointed ones, who stand continuously beside the Lord of the whole earth.”"}]