[[],[{"type":"header","content":"Fifth Vision: The Lampstand and Olive Trees"},{"type":"prose","content":"The angel who talked with me came again, and wakened me, as one is wakened from sleep. "}],[{"type":"prose","content":"He said to me, “What do you see?” And I said, “I see a lampstand all of gold, with a bowl on the top of it; there are seven lamps on it, with seven lips on each of the lamps that are on the top of it. "}],[{"type":"prose","content":"And by it there are two olive trees, one on the right of the bowl and the other on its left.” "}],[{"type":"prose","content":"I said to the angel who talked with me, “What are these, my lord?” "}],[{"type":"prose","content":"Then the angel who talked with me answered me, “Do you not know what these are?” I said, “No, my lord.” "}],[{"type":"prose","content":"He said to me, “This is the word of the  to Zerubbabel: Not by might, nor by power, but by my spirit, says the  of hosts. "}],[{"type":"prose","content":"What are you, O great mountain? Before Zerubbabel you shall become a plain; and he shall bring out the top stone amid shouts of ‘Grace, grace to it!’”"}],[{"type":"prose","content":"Moreover the word of the  came to me, saying, "}],[{"type":"prose","content":"“The hands of Zerubbabel have laid the foundation of this house; his hands shall also complete it. Then you will know that the  of hosts has sent me to you. "}],[{"type":"prose","content":"For whoever has despised the day of small things shall rejoice, and shall see the plummet in the hand of Zerubbabel.“These seven are the eyes of the , which range through the whole earth.” "}],[{"type":"prose","content":"Then I said to him, “What are these two olive trees on the right and the left of the lampstand?” "}],[{"type":"prose","content":"And a second time I said to him, “What are these two branches of the olive trees, which pour out the oil through the two golden pipes?” "}],[{"type":"prose","content":"He said to me, “Do you not know what these are?” I said, “No, my lord.” "}],[{"type":"prose","content":"Then he said, “These are the two anointed ones who stand by the Lord of the whole earth.”"}]]