[{"header":"Jehoshaphat and Ahab"},{"num":18,"verse":"Even though Jehoshaphat already had great wealth and honor, he allied himself with Ahab through marriage."},{"num":2,"verse":"A few years later, while Jehoshaphat was visiting Ahab in Samaria, Ahab slaughtered many sheep and oxen for Jehoshaphat and those who were with him in order to persuade him to attack Ramoth-gilead."},{"num":3,"verse":"“Will you go with me to Ramoth-gilead?” Israel’s King Ahab asked Judah’s King Jehoshaphat."},{"num":4,"verse":"But,” Jehoshaphat said to Israel’s king, “first, let’s see what the Lord has to say.”"},{"num":5,"verse":"So Israel’s king gathered four hundred prophets and asked them, “Should we go to war with Ramoth-gilead or not?”"},{"num":6,"verse":"But Jehoshaphat said, “Isn’t there any other prophet of the Lord around whom we could ask?”"},{"num":7,"verse":"“There’s one other man who could ask the Lord for us,” Israel’s king told Jehoshaphat, “but I hate him because he never prophesies anything good about me, only bad. His name is Micaiah, Imlah’s son.”"},{"num":8,"verse":"So Israel’s king called an officer and ordered, “Bring Micaiah, Imlah’s son, right away.”"},{"num":9,"verse":"Now Israel’s king and Judah’s King Jehoshaphat were sitting on their thrones dressed in their royal robes at the threshing floor beside the entrance to the gate of Samaria. All the prophets were prophesying in front of them."},{"num":10,"verse":"Zedekiah, Chenaanah’s son, made iron horns for himself and said, “This is what the Lord says: With these horns you will gore the Arameans until there’s nothing left of them!”"},{"num":11,"verse":"The other prophets agreed: “Attack Ramoth-gilead and win! The Lord will hand it over to the king!”"},{"num":12,"verse":"Meanwhile, the messenger who had gone to summon Micaiah said to him, “Listen, the prophets all agree that the king will succeed. You should say the same thing they say and prophesy success.”"},{"num":13,"verse":"But Micaiah answered, “As surely as the Lord lives, I will say only what God tells me to say.”"},{"num":14,"verse":"When Micaiah arrived, the king asked him, “Micaiah, should we go to war with Ramoth-gilead or not?”"},{"num":15,"verse":"But the king said, “How many times must I demand that you tell me the truth when you speak in the Lord’s name?”"},{"num":16,"verse":"Then Micaiah replied, “I saw all Israel scattered on the hills like sheep without a shepherd! And then the Lord said: ‘They have no master. Let them return safely to their own homes.’”"},{"num":17,"verse":"Then Israel’s king said to Jehoshaphat, “Didn’t I tell you? He never prophesies anything good about me, only bad.”"},{"num":18,"verse":"Then Micaiah said, “Listen now to the Lord’s word: I saw the Lord enthroned with all the heavenly forces stationed at his right and at his left."},{"num":19,"verse":"The Lord said, ‘Who will persuade Israel’s King Ahab so that he attacks Ramoth-gilead and dies there?’ There were several suggestions,"},{"num":20,"verse":"until one particular spirit approached the Lord and said, ‘I will persuade him.’ ‘How?’ the Lord asked."},{"num":21,"verse":"‘I will be a lying spirit in the mouths of all his prophets,’ he said. The Lord agreed: ‘You will succeed in persuading him! Go ahead!’"},{"num":22,"verse":"So now, since the Lord placed a lying spirit in the mouths of these prophets of yours, it is the Lord who has pronounced disaster against you!”"},{"num":23,"verse":"Zedekiah, Chenaanah’s son, approached Micaiah and slapped him on the cheek. “Just how did the Lord’s spirit leave me to speak to you?” he asked."},{"num":24,"verse":"Micaiah answered, “You will find out on the day you try to hide in an inner room.”"},{"num":25,"verse":"“Arrest him,” ordered Israel’s king, “and turn him over to Amon the city governor and to Joash the king’s son."},{"num":26,"verse":"Tell them, ‘The king says: Put this man in prison and feed him minimum rations of bread and water until I return safely.’”"},{"num":27,"verse":"“If you ever return safely,” Micaiah replied, “then the Lord wasn’t speaking through me.” Then he added, “Mark my words, every last one of you!”"},{"num":28,"verse":"So Israel’s king and Judah’s King Jehoshaphat attacked Ramoth-gilead."},{"num":29,"verse":"Israel’s king said to Jehoshaphat, “I will disguise myself when we go into battle, but you should wear your royal attire.” When the king of Israel had disguised himself, they entered the battle."},{"num":30,"verse":"Meanwhile, Aram’s king had commanded his chariot officers, “Don’t bother with anyone big or small. Fight only with Israel’s king.”"},{"num":31,"verse":"When the chariot officers saw Jehoshaphat, they assumed that he must be Israel’s king, so they turned to attack him. But when Jehoshaphat cried out, the Lord helped him, and God lured them away from him."},{"num":32,"verse":"When the chariot officers realized that he wasn’t Israel’s king, they stopped chasing him."},{"num":33,"verse":"Someone, however, randomly shot an arrow that struck Israel’s king between the joints in his armor. “Turn around and get me out of the battle,” the king told his chariot driver. “I’ve been hit!”"},{"num":34,"verse":"While the battle raged all that day, Israel’s king stood propped up in his chariot facing the Arameans. But that evening he died, just as the sun was going down."}]