[{"header":"Micaiah Prophesies Against Ahab"},{"num":18,"verse":"Jehoshaphat had great wealth and honor. He joined forces with Ahab by marrying Ahab’s daughter. "},{"num":2,"verse":"Some years later he went down to see Ahab in Samaria. Ahab killed a lot of sheep and cattle for Jehoshaphat and the people with him. Ahab tried to get Jehoshaphat to attack Ramoth Gilead. "},{"num":3,"verse":"Ahab was the king of Israel. He spoke to Jehoshaphat, the king of Judah. He asked, “Will you go with me to fight against Ramoth Gilead?”"},{"num":4,"verse":"He continued, “First ask the Lord for advice.”"},{"num":5,"verse":"So the king of Israel brought 400 prophets together. He asked them, “Should we go to war against Ramoth Gilead, or not?”"},{"num":6,"verse":"But Jehoshaphat asked, “Is there no longer a prophet of the Lord here? If there is, ask him what we should do.”"},{"num":7,"verse":"The king of Israel answered Jehoshaphat. He said, “There is still one prophet we can go to. We can ask the Lord for advice through him. But I hate him. He never prophesies anything good about me. He only prophesies bad things. His name is Micaiah. He’s the son of Imlah.”"},{"num":8,"verse":"So the king of Israel called for one of his officials. He told him, “Bring Micaiah, the son of Imlah, right away.”"},{"num":9,"verse":"The king of Israel and Jehoshaphat, the king of Judah, were wearing their royal robes. They were sitting on their thrones at the threshing floor. It was near the entrance of the gate of Samaria. All the prophets were prophesying in front of them. "},{"num":10,"verse":"Zedekiah was the son of Kenaanah. Zedekiah had made horns out of iron. They looked like animal horns. He announced, “The Lord says, ‘With these horns you will drive back the men of Aram until they are destroyed.’ ”"},{"num":11,"verse":"All the other prophets were prophesying the same thing. “Attack Ramoth Gilead,” they said. “Win the battle over it. The Lord will hand it over to you.”"},{"num":12,"verse":"A messenger went to get Micaiah. He said to him, “Look. The other prophets agree. All of them are saying the king will have success. So agree with them. Say the same thing they do.”"},{"num":13,"verse":"But Micaiah said, “You can be sure that the Lord lives. And you can be just as sure that I can only tell the king what my God says.”"},{"num":14,"verse":"When Micaiah arrived, the king spoke to him. He asked, “Should we go to war against Ramoth Gilead, or not?”"},{"num":15,"verse":"The king said to him, “I’ve made you promise to tell the truth many times before. So don’t tell me anything but the truth in the name of the Lord.”"},{"num":16,"verse":"Then Micaiah answered, “I saw all the Israelites scattered on the hills. They were like sheep that didn’t have a shepherd. The Lord said, ‘These people do not have a master. Let each of them go home in peace.’ ”"},{"num":17,"verse":"The king of Israel spoke to Jehoshaphat. He said, “Didn’t I tell you he never prophesies anything good about me? He only prophesies bad things.”"},{"num":18,"verse":"Micaiah continued, “Listen to the Lord’s message. I saw the Lord sitting on his throne. Some of the angels of heaven were standing at his right side. The others were standing at his left side. "},{"num":19,"verse":"The Lord said, ‘Who will get Ahab, the king of Israel, to attack Ramoth Gilead? I want him to die there.’"},{"num":20,"verse":"Finally, a spirit came forward and stood in front of the Lord. The spirit said, ‘I’ll get Ahab to do it.’"},{"num":21,"verse":"“The spirit said, ‘I’ll go and put lies in the mouths of all his prophets.’"},{"num":22,"verse":"“So the Lord has put lies in the mouths of your prophets. He has said that great harm will come to you.”"},{"num":23,"verse":"Then Zedekiah, the son of Kenaanah, went up and slapped Micaiah in the face. Zedekiah asked Micaiah, “Do you think the spirit sent by the Lord left me? Do you think that spirit went to speak to you?”"},{"num":24,"verse":"Micaiah replied, “You will find out on the day you go to hide in an inside room to save your life.”"},{"num":25,"verse":"Then the king of Israel gave an order. He said, “Take Micaiah away. Send him back to Amon. Amon is the ruler of the city of Samaria. And send Micaiah back to Joash. Joash is a member of the royal court. "},{"num":26,"verse":"Tell them, ‘The king says, “Put this fellow in prison. Don’t give him anything but bread and water until I return safely.” ’ ”"},{"num":27,"verse":"Micaiah announced, “Do you really think you will return safely? If you do, the Lord hasn’t spoken through me.” He continued, “All you people, remember what I’ve said!”"},{"header":"Ahab Is Killed at Ramoth Gilead"},{"num":28,"verse":"So the king of Israel went up to Ramoth Gilead. Jehoshaphat, the king of Judah, went there too. "},{"num":29,"verse":"The king of Israel spoke to Jehoshaphat. He said, “I’ll go into battle wearing different clothes. Then people won’t recognize me. But you wear your royal robes.” So the king of Israel put on different clothes. Then he went into battle."},{"num":30,"verse":"The king of Aram had given an order to his chariot commanders. He had said, “Fight only against the king of Israel. Don’t fight against anyone else.” "},{"num":31,"verse":"The chariot commanders saw Jehoshaphat. They thought, “That’s the king of Israel.” So they turned to attack him. But Jehoshaphat cried out. And the Lord helped him. God drew the commanders away from him. "},{"num":32,"verse":"They saw he wasn’t the king of Israel after all. So they stopped chasing him."},{"num":33,"verse":"But someone shot an arrow without taking aim. The arrow hit the king of Israel between the parts of his armor. The king told the chariot driver, “Turn the chariot around. Get me out of this battle. I’ve been wounded.” "},{"num":34,"verse":"All day long the battle continued. The king of Israel kept himself standing up by leaning against the inside of his chariot. He kept his face toward the men of Aram until evening. At sunset he died."}]