[{"header":"Prophecy of the Deceiving Spirit"},{"num":18,"verse":"Now Jehoshaphat had wealth and honor in abundance but he allied himself with Ahab by marriage. "},{"num":2,"verse":"Some years later he went down to visit Ahab in Samaria. Ahab slaughtered many sheep and bulls for him and the people with him, and urged him to march with him against Ramoth-gilead."},{"num":3,"verse":"King Ahab of Israel asked King Jehoshaphat of Judah, “Will you go with me against Ramoth-gilead?”"},{"num":4,"verse":"Jehoshaphat then said to the king of Israel, “Please, let us seek, today, the word of Adonai.”"},{"num":5,"verse":"So the king of Israel assembled the prophets—400 men—and asked them, “Should we go to war against Ramoth-gilead, or should I hold off?”"},{"num":6,"verse":"But Jehoshaphat asked, “Isn’t there another prophet of Adonai here of whom we should inquire?”"},{"num":7,"verse":"The king of Israel said to Jehoshaphat, “There is still one man through whom we can inquire of Adonai—but I hate him, because he has never prophesied anything good about me but always evil. He is Micaiah son of Imlah.”"},{"num":8,"verse":"So the king of Israel called an official and said, “Bring Micaiah son of Imlah quickly!”"},{"num":9,"verse":"Now the king of Israel and King Jehoshaphat of Judah, wearing their robes, were sitting on their thrones on the threshing floor at the entrance of the gate of Samaria with all the prophets prophesying before them. "},{"num":10,"verse":"Zedekiah son of Henaanah made for himself iron horns and declared, “Thus says Adonai, ‘With these you will gore the Arameans until they are exterminated!’”"},{"num":11,"verse":"All the other prophets were prophesying similarly, saying “March against Ramoth-gilead and succeed, for Adonai will give it into the hand of the king.”"},{"num":12,"verse":"Now the messenger who had gone to summon Micaiah spoke to him saying, “Look, the words of the prophets are unanimously favorable to the king. So please let your word be like one of them and speak favorably.”"},{"num":13,"verse":"But Micaiah replied, “As Adonai lives, what my God says that is what I will say.”"},{"num":14,"verse":"When he came to the king, the king asked him, “Micaiah, should we go to war against Ramoth-gilead, or should I hold off?”"},{"num":15,"verse":"But the king said to him, “How many times must I make you swear to tell me nothing but the truth in the Name of Adonai?”"},{"num":16,"verse":"So he said, “I saw all Israel scattered on the hills like sheep without a shepherd, and Adonai said, ‘These have no master—let each man return home in shalom.”"},{"num":17,"verse":"So the king of Israel said to Jehoshaphat, “Didn’t I tell you that he never prophesies good about me, only evil?”"},{"num":18,"verse":"Micaiah continued, “Therefore hear the word of Adonai. I saw Adonai sitting on His throne with the whole host of heaven standing on His right and on His left. "},{"num":19,"verse":"And Adonai said: ‘Who will entice Ahab king of Israel to go up and fall at Ramoth-gilead?’"},{"num":20,"verse":"until a spirit came forward and stood before Adonai and said, ‘I will entice him.’"},{"num":21,"verse":"He answered, ‘I will go and be a deceiving spirit in the mouth of all his prophets.’"},{"num":22,"verse":"So now, behold, Adonai has put a lying spirit in the mouth of these prophets of yours and Adonai has decreed disaster against you.”"},{"num":23,"verse":"Then Zedekiah son of Chenaanah approached Micaiah, slapped him on the cheek and said, “How did the spirit of Adonai pass over me to speak to you?”"},{"num":24,"verse":"Micaiah replied, “Behold, you will see on the day that you go to hide in an inner room.”"},{"num":25,"verse":"Then the king of Israel said, “Take Micaiah and turn him over to Amon, governor of the city, and to Joash the king’s son, "},{"num":26,"verse":"and say, ‘Thus says the king, “Put this fellow in prison and make him eat the bread and water of affliction—until I return in shalom.”’”"},{"num":27,"verse":"Then Micaiah said, “If you ever return in shalom, Adonai has not spoken through me.” He added: “Listen, all you people!”"},{"header":"Ahab Dies in Battle"},{"num":28,"verse":"So the king of Israel and Jehoshaphat the king of Judah marched against Ramoth-gilead. "},{"num":29,"verse":"Then the king of Israel said to Jehoshaphat, “I will disguise myself and go into the battle, but you put on your robes.” So the king of Israel disguised himself and they went into the battle."},{"num":30,"verse":"Now the king of Aram had already ordered his chariot commanders saying: “Don’t attack anyone, small or great, except the king of Israel alone.”"},{"num":31,"verse":"So when the chariot commanders saw Jehoshaphat they thought, “This is the king of Israel.” So they turned to attack him but Jehoshaphat cried out. Adonai helped him and God diverted them from him. "},{"num":32,"verse":"When the chariot commanders realized that he was not the king of Israel, they turned back from pursuing him."},{"num":33,"verse":"But a man drew his bow aimlessly and struck the king of Israel between the lower armor and the breastplate. The king said to the charioteer, “Turn around and take me out of the battle, for I am wounded.”"},{"num":34,"verse":"The battle raged that day and the king of Israel remained propped up in his chariot facing the Arameans until dusk. Then at sunset he died."}]