[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(9) See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 33:2-3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "O God.—The only instance of Elohim in the last two books of the psalter with the exception of Psalms 108, which is a compilation from two older songs.",
        "children": [
          {
            "element": "span",
            "class": "bld",
            "text": "O",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "God.",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "—The only instance of ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Elohim ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "in the last two books of the psalter with the exception of Psalms 108, which is a compilation from two older songs.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 144:9-10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 144:9-10",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "I will sing a new song unto thee — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "When thou hast granted this my request, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 144:7-8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which I know assuredly thou wilt do. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "He giveth salvation to kings — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Who are not preserved by their own power or prudence, but by God’s special providence, which, for the public good of the world, watcheth over them.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "144:9-15 Fresh favours call for fresh returns of thanks; we must praise God for the mercies we hope for by his promise, as well as those we have received by his providence. To be saved from the hurtful sword, or from wasting sickness, without deliverance from the dominion of sin and the wrath to come, is but a small advantage. The public prosperity David desired for his people, is stated. It adds much to the comfort and happiness of parents in this world, to see their children likely to do well. To see them as plants, not as weeds, not as thorns; to see them as plants growing, not withered and blasted; to see them likely to bring forth fruit unto God in their day; to see them in their youth growing strong in the Spirit. Plenty is to be desired, that we may be thankful to God, generous to our friends, and charitable to the poor; otherwise, what profit is it to have our garners full? Also, uninterrupted peace. War brings abundance of mischiefs, whether it be to attack others or to defend ourselves. And in proportion as we do not adhere to the worship and service of God, we cease to be a happy people. The subjects of the Saviour, the Son of David, share the blessings of his authority and victories, and are happy because they have the Lord for their God.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "I will sing a new song unto thee, O God - There will be occasion in such a deliverance, or manifestation of mercy, for a new expression of praise. On the phrase, \"a new song,\" see the notes at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 33:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Upon a psaltery, and an instrument of ten strings - The word \"and\" should not have been inserted here. The idea is, \"Upon a lyre or harp (Nebel) of ten strings, will I sing praise.\" See the notes at Isaiah 5:12; and notes at Psalm 33:2. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Upon a psaltery, and an instrument of ten strings - The word \"and\" should not have been inserted here. The idea is, \"Upon a lyre or harp (Nebel) of ten strings, will I sing praise.\" See the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 5:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 33:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "PSALM 144",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Ps 144:1-15. David's praise of God as his all-sufficient help is enhanced by a recognition of the intrinsic worthlessness of man. Confidently imploring God's interposition against his enemies, he breaks forth into praise and joyful anticipations of the prosperity of his kingdom, when freed from vain and wicked men.   ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Ps 144:1-15. David's praise of God as his all-sufficient help is enhanced by a recognition of the intrinsic worthlessness of man. Confidently imploring God's interposition against his enemies, he breaks forth into praise and joyful anticipations of the prosperity of his kingdom, when freed from vain and wicked men.   ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "The Treasury of David",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "9 I will sing a new song unto thee, O God: upon a psaltery and an instrument of ten strings will I sing praises unto thee.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "10 It is he that giveth salvation unto kings: who delivereth David his servant from the hurtful sword.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "11 Rid me, and deliver me from the hand of strange children, whose mouth speaketh vanity, and their right hand is a right hand of falsehood.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 144:9",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 144:9",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"I will sing a new song unto thee, O God.\" Weary of the false, I will adore the true. Fired with fresh enthusiasm, my gratitude shall make a new channel for itself. I will sing as others have done; but it shall be a new song, such as no others have sung. That song shall be all and altogether for my God: I will extol none but the Lord, from whom my deliverance has come. \"Upon a Psaltery and an instrument of ten strings will I sing praises unto thee.\" His hand should aid his tongue, not as in the case of the wicked, co-operating in deceit; but his hand should unite with his mouth in truthful praise. David intended to tune his best instruments as well as to use his best vocal music: the best is all too poor for so great a God, and therefore we must not fall short of our utmost. He meant to use many instruments of music, that by all means he might express his great joy in God. The Old Testament dispensation abounded in types, and figures, and outward ritual, and therefore music dropped naturally into its place in the \"worldly sanctuary\"; but, after all, it can do no more than represent praise, and assist our expression of it; the real praise is in the heart, the true music is that of the soul. When music drowns the voice, and artistic skill takes a higher place than hearty singing, it is time that instruments were banished from public worship; but when they are subordinate to the song, as here, it is not for us to prohibit them, or condemn those who use them, though we ourselves greatly prefer to do without them, since it seems to us that the utmost simplicity of praise is far more congruous with the spirit of the gospel than pomp of organs. The private worshipper, singing his solo unto the Lord, has often found it helpful to accompany himself on some familiar instrument, and of this David in the present Psalm is an instance, for he says, \"I will sing praise unto thee,\" - that is, not so much in the company of others as by himself alone. He saith not \"we,\" but \"I.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 144:10",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 144:10",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"It is he that giveth salvation unto kings.\" Those whom the Lord sets up he will keep up. Kings, from their conspicuous position, are exposed to special danger, and when their lives and their thrones are preserved to them they should give the Lord the glory of it. In his many battles David would have perished had not almighty care preserved him. He had by his valour wrought salvation for Israel, but he lays his laurels at the feet of his Lord and Preserver. If any men need salvation kings do, and if they get it the fact is so astonishing that it deserves a verse to itself in the Psalm of praise. \"Who delivereth David his servant from the hurtful sword.\" He traces his escape from death to the delivering hand of God. Note, he speaks in the present tense - delivereth, for this was an act which covered his whole life. He puts his name to the confession of his indebtness: it Is David who owns without demur to mercy given to himself. He styles himself the Lord's servant, accepting this as the highest title he had attained or desired.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Psalm 144:11",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 144:11",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Because of what the Lord had done, David returns to his pleading. He begs deliverance from him who is ever delivering him. \"Rid me, and deliver me from the hand of strange children.\" This is in measure the refrain of the song, and the burden of the prayer. He desired to be delivered from his open and foreign adversaries, who had broken compacts, and treated treaties as vain things. \"Whose mouth speaketh vanity, and their right hand is a right hand of falsehood.\" He would not strike hands with those who carried a lie in their right hand: he would be quit of such at once, if possible. Those who are surrounded by such serpents know not how to deal with them, and the only available method seems to be payer to God for a riddance and deliverance. David in Psalm 144:7, according to the original, had sought the help of both the Lord's hands, and well he might for his deceitful enemies with remarkable unanimity, were with one mouth and one hand seeking his destruction. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Because of what the Lord had done, David returns to his pleading. He begs deliverance from him who is ever delivering him. \"Rid me, and deliver me from the hand of strange children.\" This is in measure the refrain of the song, and the burden of the prayer. He desired to be delivered from his open and foreign adversaries, who had broken compacts, and treated treaties as vain things. \"Whose mouth speaketh vanity, and their right hand is a right hand of falsehood.\" He would not strike hands with those who carried a lie in their right hand: he would be quit of such at once, if possible. Those who are surrounded by such serpents know not how to deal with them, and the only available method seems to be payer to God for a riddance and deliverance. David in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 144:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", according to the original, had sought the help of both the Lord's hands, and well he might for his deceitful enemies with remarkable unanimity, were with one mouth and one hand seeking his destruction. ",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " When thou hast granted this request of mine, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Psalm 144:7,8",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 144:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",8",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", which I know assuredly thou wilt do. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "I will sing a new song unto thee, O God,.... The author of his being, the Father of mercies, temporal and spiritual, and therefore to him praise is always due; a new song of praise is to be sung for new mercies; and as these are new every morning, and are renewed day by day, new songs should be sung continually: or this is a song suited to New Testament times, in which all things are become new; there is a new covenant of grace; and a new and living way to the throne of grace; a newly slain sacrifice; redemption newly wrought out, and therefore the new song of redeeming grace must be sung. Arama suggests that this refers to the days of the Messiah; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "upon a psaltery, and an instrument of ten strings, will I sing praises unto thee; such instruments of music were used in the Old Testament dispensation, and were typical of the hearts of God's people; which are the harps they now strike upon, and where they make melody to the Lord; see Psalm 33:2. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "upon a psaltery, and an instrument of ten strings, will I sing praises unto thee; such instruments of music were used in the Old Testament dispensation, and were typical of the hearts of God's people; which are the harps they now strike upon, and where they make melody to the Lord; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Psalm 33:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "I will sing a {h} new song unto thee, O God: upon a psaltery and an instrument of ten strings will I sing praises unto thee.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "I will sing a ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{h}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " new song unto thee, O God: upon a psaltery ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "and",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " an instrument of ten strings will I sing praises unto thee.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(h) That is, a rare and excellent song, as your great benefits deserve.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". From ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 33:2-3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "O God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] An imitation of the usage of the Elohistic Psalms of Books II and III. Nowhere else in Books IV, V is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Elohim",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (God) used absolutely for Jehovah, except in Psalms 108, which is directly taken from two Elohistic Psalms. See ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Introd",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". p. lv.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "upon a psaltery",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "an instrument of ten strings",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] R.V. upon a psaltery of ten strings.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "9–11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". A promise to give thanks for the victory which he is confident will be granted, and a repetition of his prayer for deliverance.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 9.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "I will sing a new song unto thee, O God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Another change of strain. The psalmist returns to his original theme of the praise of God (see vers. 1, 2), and promises a \"new song,\" as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 40:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Upon a psaltery and an instrument of ten strings will I sing praises unto thee",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; rather, upon ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "a psaltery of ten strings",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (see the Revised Version, and comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 33:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Assyrian harps had commonly, in the earlier ages, either eight, nine, or ten strings ('Ancient Monarchies,' vol. 1. p. 530, 2nd edit.). Psalm 144:9",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "With the exception of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 108:1-13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which is composed of two Davidic Elohim-Psalms, the Elohim in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 144:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of this strophe is the only one in the last two Books of the Psalter, and is therefore a feeble attempt also to reproduce the Davidic Elohimic style. The \"new song\" calls to mind ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 33:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 40:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and נבל עשׂור also recalls ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 33:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (which see). The fact that David mentions himself by name in his own song comes about in imitation of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 18:51",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". From the eminence of thanksgiving the song finally descends again to petition, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 144:7-8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", being repeated as a refrain. The petition developes itself afresh out of the attributes of the Being invoked (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 144:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and these are a pledge of its fulfilment. For how could the God to whom all victorious kings owe their victory (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 33:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 5:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 17:47",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") possibly suffer His servant David to succumb to the sword of the enemy! חרב רעה is the sword that is engaged in the service of evil. ",
        "children": []
      }
    ]
  }
]