[{"header":"Guilt Written on the Heart"},{"header":"Trusting in People and Trusting in God"},{"header":"Jeremiah’s Third Complaint"},{"header":"Keeping the Sabbath Day Holy"},{"num":19,"verse":"This is what the Lord said to me: “Jeremiah, go and stand at the People’s Gate, where the kings of Judah go in and out. Tell the people my message, and then go to all the other gates of Jerusalem and do the same.”"},{"num":20,"verse":"Say to the people, “Listen to this message from the Lord. Listen, kings of Judah. Listen, all you people of Judah. All you who come through these gates into Jerusalem, listen to me!"},{"num":21,"verse":"This is what the Lord says: ‘Be careful that you don’t carry a load on the Sabbath day. And don’t bring a load through the gates of Jerusalem on the Sabbath day."},{"num":22,"verse":"Don’t bring a load out of your houses on the Sabbath day. Don’t do any work on that day. You must make the Sabbath day a holy day. I gave this same command to your ancestors,"},{"num":23,"verse":"but they did not obey me. They did not pay attention to me. Your ancestors were very stubborn. I punished them, but it did not do any good. They did not listen to me."},{"num":24,"verse":"But you must be careful to obey me, says the Lord. You must not bring a load through the gates of Jerusalem on the Sabbath. You must make the Sabbath day a holy day. You will do this by not doing any work on that day."},{"num":25,"verse":"“‘If you obey this command, the kings and leaders will be from David’s family. It will be the kings who sit on David’s throne and the leaders from Judah and Jerusalem who come through the gates of Jerusalem riding on chariots and on horses. And Jerusalem will have people living in it forever."},{"num":26,"verse":"People will come to Jerusalem from the towns and villages of Judah, from the land where the tribe of Benjamin lives, from the western foothills, from the hill country, and from the Negev. All these people will bring burnt offerings, sacrifices, grain offerings, incense, and thank offerings to the Temple of the Lord in Jerusalem."},{"num":27,"verse":"“‘But if you don’t listen to me and obey me, bad things will happen. If you carry loads into Jerusalem on the Sabbath day, you are not keeping it as a holy day. So I will start a fire that cannot be put out. That fire will start at the gates of Jerusalem, and it will burn until it burns even the palaces.’”"}]