[{"header":"Judah’s Sin and Punishment"},{"header":"Wisdom from the Lord"},{"header":"Jeremiah’s Trust in the Lord"},{"header":"Observing the Sabbath"},{"num":19,"verse":"This is what the Lord said to me: “Go and stand in the gates of Jerusalem, first in the gate where the king goes in and out, and then in each of the other gates."},{"num":20,"verse":"Say to all the people, ‘Listen to this message from the Lord, you kings of Judah and all you people of Judah and everyone living in Jerusalem."},{"num":21,"verse":"This is what the Lord says: Listen to my warning! Stop carrying on your trade at Jerusalem’s gates on the Sabbath day."},{"num":22,"verse":"Do not do your work on the Sabbath, but make it a holy day. I gave this command to your ancestors,"},{"num":23,"verse":"but they did not listen or obey. They stubbornly refused to pay attention or accept my discipline."},{"num":24,"verse":"“‘But if you obey me, says the Lord, and do not carry on your trade at the gates or work on the Sabbath day, and if you keep it holy,"},{"num":25,"verse":"then kings and their officials will go in and out of these gates forever. There will always be a descendant of David sitting on the throne here in Jerusalem. Kings and their officials will always ride in and out among the people of Judah in chariots and on horses, and this city will remain forever."},{"num":26,"verse":"And from all around Jerusalem, from the towns of Judah and Benjamin, from the western foothills and the hill country and the Negev, the people will come with their burnt offerings and sacrifices. They will bring their grain offerings, frankincense, and thanksgiving offerings to the Lord’s Temple."},{"num":27,"verse":"“‘But if you do not listen to me and refuse to keep the Sabbath holy, and if on the Sabbath day you bring loads of merchandise through the gates of Jerusalem just as on other days, then I will set fire to these gates. The fire will spread to the palaces, and no one will be able to put out the roaring flames.’”"}]