[{"num":5,"verse":"Afterward Moses and Aaron went in and told Pharaoh, Thus says the Lord, the God of Israel, Let My people go, that they may hold a feast to Me in the wilderness."},{"num":2,"verse":"But Pharaoh said, Who is the Lord, that I should obey His voice to let Israel go? I know not the Lord, neither will I let Israel go."},{"num":3,"verse":"And they said, The God of the Hebrews has met with us; let us go, we pray you, three days’ journey into the desert and sacrifice to the Lord our God, lest He fall upon us with pestilence or with the sword."},{"num":4,"verse":"The king of Egypt said to Moses and Aaron, Why do you take the people from their jobs? Get to your burdens!"},{"num":5,"verse":"Pharaoh said, Behold, the people of the land now are many, and you make them rest from their burdens!"},{"num":6,"verse":"The very same day Pharaoh commanded the taskmasters of the people and their officers,"},{"num":7,"verse":"You shall no more give the people straw to make brick; let them go and gather straw for themselves."},{"num":8,"verse":"But the number of the bricks which they made before you shall still require of them; you shall not diminish it in the least. For they are idle; that is why they cry, Let us go and sacrifice to our God."},{"num":9,"verse":"Let heavier work be laid upon the men that they may labor at it and pay no attention to lying words."},{"num":10,"verse":"The taskmasters of the people went out, and their officers, and they said to the people, Thus says Pharaoh, I will not give you straw."},{"num":11,"verse":"Go, get straw where you can find it; but your work shall not be diminished in the least."},{"num":12,"verse":"So the people were scattered through all the land of Egypt to gather the short stubble instead of straw."},{"num":13,"verse":"And the taskmasters were urgent, saying, Finish your work, your daily quotas, as when there was straw."},{"num":14,"verse":"And the Hebrew foremen, whom Pharaoh’s taskmasters had set over them, were beaten and were asked, Why have you not fulfilled all your quota of making bricks yesterday and today, as before?"},{"num":15,"verse":"Then the Hebrew foremen came to Pharaoh and cried, Why do you deal like this with your servants?"},{"num":16,"verse":"No straw is given to your servants, yet they say to us, Make bricks! And behold, your servants are beaten, but the fault is in your own people."},{"num":17,"verse":"But [Pharaoh] said, You are idle, lazy and idle! That is why you say, Let us go and sacrifice to the Lord."},{"num":18,"verse":"Get out now and get to work; for no straw shall be given you, yet you shall deliver the full quota of bricks."},{"num":19,"verse":"And the Hebrew foremen saw that they were in an evil situation when it was said, You shall not diminish in the least your full daily quota of bricks."},{"num":20,"verse":"And the foremen met Moses and Aaron, who were standing in the way as they came forth from Pharaoh."},{"num":21,"verse":"And the foremen said to them, The Lord look upon you and judge, because you have made us a rotten stench to be detested by Pharaoh and his servants and have put a sword in their hand to slay us."},{"num":22,"verse":"Then Moses turned again to the Lord and said, O Lord, why have You dealt evil to this people? Why did You ever send me?"},{"num":23,"verse":"For since I came to Pharaoh to speak in Your name, he has done evil to this people, neither have You delivered Your people at all."}]