[{"header":"Moses and Aaron Confront Pharaoh"},{"num":5,"verse":"Later Moses and Aaron went to Pharaoh and said, “This is what Yahweh Elohim of Israel says: Let my people go into the desert to celebrate a festival in my honor.”"},{"num":2,"verse":"Pharaoh asked, “Who is Yahweh? Why should I obey him and let Israel go? I don’t know Yahweh, and I won’t let Israel go.”"},{"num":3,"verse":"They replied, “The Elohim of the Hebrews has met with us. Please let us travel three days into the desert to offer sacrifices to Yahweh our Elohim. If we don’t go, he may kill us with a plague or a war.”"},{"num":4,"verse":"The king of Egypt said to them, “Moses and Aaron, why are you distracting the people from their work? Get back to work!” "},{"num":5,"verse":"Then Pharaoh added, “Look how many people there are in the land! Do you want them to quit working?”"},{"header":"Pharaoh Increases the Israelites’ Labor"},{"num":6,"verse":"That same day Pharaoh gave these orders to the slave drivers and foremen: "},{"num":7,"verse":"“Don’t give the people any more straw to make bricks as you have been doing. Let them gather their own straw, "},{"num":8,"verse":"but insist that they make the same number of bricks they were making before. Making fewer bricks will not be acceptable. They’re lazy! That’s why they’re crying, ‘Let us go offer sacrifices to our Elohim.’ "},{"num":9,"verse":"Make the work harder for these people so that they will be too busy to listen to lies.”"},{"num":10,"verse":"The slave drivers and foreman went out and said to them, “This is what Pharaoh says: I’m no longer giving you straw. "},{"num":11,"verse":"Get your own straw wherever you can find it, but your work load will not be reduced one bit.”"},{"num":12,"verse":"So the people scattered all over Egypt to gather stubble for straw. "},{"num":13,"verse":"The slave drivers kept hurrying them. They said, “Finish the same amount of work each day, just as when you had straw.”"},{"num":14,"verse":"Pharaoh’s slave drivers had placed Israelite foremen in charge of the people. The slave drivers beat the foremen and said, “You didn’t finish all the bricks you were ordered to make yesterday or today. Why didn’t you make as many as you used to?”"},{"num":15,"verse":"Then the Israelite foremen complained to Pharaoh. They asked, “Why are you treating us this way? "},{"num":16,"verse":"We’re given no straw, and yet we’re told to make bricks. We’re being beaten, but your men are at fault.”"},{"num":17,"verse":"“You’re lazy! Just plain lazy!” Pharaoh answered. “That’s why you keep saying, ‘Let us go offer sacrifices to Yahweh.’ "},{"num":18,"verse":"Now get back to work! You won’t be given any straw, but you must still make the same number of bricks.”"},{"num":19,"verse":"The Israelite foremen realized they were in trouble when they were told, “Don’t make fewer bricks each day than you’re supposed to.”"},{"num":20,"verse":"As they left Pharaoh, they found Moses and Aaron waiting for them. "},{"num":21,"verse":"So they said, “May Yahweh see what you have done and judge you! You have made Pharaoh and his officials hate us. You have given them an excuse to kill us.”"},{"num":22,"verse":"Moses went back to Yahweh and asked, “Why have you brought this trouble on your people? Why did you send me? "},{"num":23,"verse":"Ever since I went to Pharaoh to speak for you, he has treated your people cruelly, and you have done nothing at all to rescue your people.”"}]