[{"num":32,"verse":"Behold, a king shall reign in righteousness, and princes shall rule in judgment."},{"num":2,"verse":"And a man shall be as a hiding-place from the wind, and a covert from the storm; as brooks of water in a dry place, as the shadow of a great rock in a thirsty land."},{"num":3,"verse":"And the eyes of them that see shall not be dim, and the ears of them that hear shall hearken;"},{"num":4,"verse":"and the heart of the rash shall understand knowledge, and the tongue of the stammerers shall be ready to speak plainly."},{"num":5,"verse":"The vile man shall be no more called noble, nor the churl said to be bountiful:"},{"num":6,"verse":"for the vile man will speak villainy, and his heart will work iniquity, to practise hypocrisy, and to utter error against Jehovah, to make empty the soul of the hungry, and to cause the drink of the thirsty to fail."},{"num":7,"verse":"The instruments also of the churl are evil: he deviseth wicked devices to destroy the meek with lying words, even when the needy speaketh right."},{"num":8,"verse":"But the noble deviseth noble things; and to noble things doth he stand."},{"num":9,"verse":"Rise up, ye women that are at ease, hear my voice; ye careless daughters, give ear unto my speech."},{"num":10,"verse":"In a year and [some] days shall ye be troubled, ye careless women; for the vintage shall fail, the ingathering shall not come."},{"num":11,"verse":"Tremble, ye women that are at ease; be troubled, ye careless ones; strip you, and make you bare, and gird [sackcloth] on your loins!"},{"num":12,"verse":"They shall smite on the breasts [in lamentation] for the pleasant fields, for the fruitful vineyards."},{"num":13,"verse":"Upon the land of my people shall come up thistles [and] briars, yea, upon all the houses of joy in the joyous city."},{"num":14,"verse":"For the palace shall be deserted, the multitude of the city shall be forsaken; hill and watchtower shall be caves for ever, a joy of wild asses, a pasture of flocks;"},{"num":15,"verse":"until the Spirit be poured upon us from on high, and the wilderness become a fruitful field, and the fruitful field be counted for a forest."},{"num":16,"verse":"And judgment shall inhabit the wilderness, and righteousness dwell in the fruitful field."},{"num":17,"verse":"And the work of righteousness shall be peace; and the effect of righteousness, quietness and assurance for ever."},{"num":18,"verse":"And my people shall dwell in a peaceable habitation, and in sure dwellings, and in quiet resting-places."},{"num":19,"verse":"And it shall hail, coming down on the forest; and the city shall be low in a low place."},{"num":20,"verse":"Blessed are ye that sow beside all waters, that send forth the feet of the ox and the ass."}]