[{"header":"A Nation of Right Living"},{"num":32,"verse":"See, a king will rule by what is right and good and princes will be fair. "},{"num":2,"verse":"Each will be like a safe place from the wind, and a covering from the storm. Each will be like rivers of water in a dry country, and like the shadow of a large rock in a waste land. "},{"num":3,"verse":"Then the eyes of those who see will be able to see. And the ears of those who hear will listen. "},{"num":4,"verse":"The mind of those who act in a hurry will understand the truth. And the tongue of those who have trouble speaking will hurry to speak well. "},{"num":5,"verse":"The fool will no more be called great. The bad man will no more be called a man of honor. "},{"num":6,"verse":"For a fool speaks foolish things. His mind plans wrong-doing, to sin and to say false things against the Lord, to keep the hungry person hungry, and to keep drink from the thirsty. "},{"num":7,"verse":"The ways of the bad man are sinful. He makes sinful plans to destroy the suffering with lies, even when the one in need asks for what is right. "},{"num":8,"verse":"But the man of honor makes good plans, and he stands for what is good."},{"header":"The Women of Jerusalem"},{"num":9,"verse":"Rise up, you women who live an easy life, and hear my voice. Listen to what I say, you daughters. "},{"num":10,"verse":"In a little more than a year, you will be troubled. There will be no grapes to gather, the wine will not be made. "},{"num":11,"verse":"Shake with fear, you women who live an easy life. Be troubled, you daughters, who feel safe. Take off your clothes and cover your bodies with cloth made from hair. "},{"num":12,"verse":"Beat your breasts for the good fields, for the vine full of fruit, "},{"num":13,"verse":"and for the land of my people in which thorns and thistles will come up. Yes, be sorry for all the houses of joy, and for the happy city, "},{"num":14,"verse":"because the king’s house will be empty. The city full of people will be left empty. The hill and the watch-tower will become a place for wild animals forever, a happy place for wild donkeys, a field for flocks. "},{"num":15,"verse":"It will be this way until the Spirit is poured out upon us from heaven, and the desert becomes a field giving so much fruit, that it seems as if it has many trees. "},{"num":16,"verse":"Then what is right and fair will be in the desert. What is right and good will be in the field of much fruit. "},{"num":17,"verse":"The work of being right and good will give peace. From the right and good work will come quiet trust forever. "},{"num":18,"verse":"Then my people will live in a place of peace, in safe homes, and in quiet resting places. "},{"num":19,"verse":"But it will hail when the many trees come down and all the city will be laid waste. "},{"num":20,"verse":"How happy will you be, you who plant seeds beside all waters, and let the cattle and donkeys eat in any field."}]