[{"header":"Let God Be the Judge"},{"num":2,"verse":"So do you think that you can judge those other people? You are wrong. You too are guilty of sin. You judge them, but you do the same things they do. So when you judge them, you are really condemning yourself."},{"num":2,"verse":"God judges all who do such things, and we know his judgment is right."},{"num":3,"verse":"And since you do the same things as those people you judge, surely you understand that God will punish you too. How could you think you would be able to escape his judgment?"},{"num":4,"verse":"God has been kind to you. He has been very patient, waiting for you to change. But you think nothing of his kindness. Maybe you don’t understand that God is kind to you so that you will decide to change your lives."},{"num":5,"verse":"But you are so stubborn! You refuse to change. So you are making your own punishment greater and greater. You will be punished on the day when God will show his anger. On that day everyone will see how right God is to judge people."},{"num":6,"verse":"He will reward or punish everyone for what they have done."},{"num":7,"verse":"Some people live for God’s glory, for honor, and for life that cannot be destroyed. They live for those things by always continuing to do good. God will give eternal life to them."},{"num":8,"verse":"But others are selfish and refuse to follow truth. They follow evil. God will show his anger and punish them."},{"num":9,"verse":"He will give trouble and suffering to everyone who does evil—to the Jews first and also to those who are not Jews."},{"num":10,"verse":"But he will give glory, honor, and peace to everyone who does good—to the Jews first and also to those who are not Jews."},{"num":11,"verse":"God judges everyone the same. It doesn’t matter who they are."},{"num":12,"verse":"People who have the law and those who have never heard of the law are all the same when they sin. People who don’t have the law and are sinners will be lost. And, in the same way, those who have the law and are sinners will be judged by the law."},{"num":13,"verse":"Hearing the law does not make people right with God. They will be right before him only if they always do what the law says."},{"num":14,"verse":"Those who are not Jews don’t have the law. But when they naturally do what the law commands without even knowing the law, then they are their own law. This is true even though they don’t have the written law."},{"num":15,"verse":"They show that in their hearts they know what is right and wrong, the same as the law commands, and their consciences agree. Sometimes their thoughts tell them that they have done wrong, and this makes them guilty. And sometimes their thoughts tell them that they have done right, and this makes them not guilty."},{"num":16,"verse":"All this will happen on the day when God will judge people’s secret thoughts through Jesus Christ. This is part of the Good News that I tell everyone."},{"header":"The Jews and the Law"},{"num":17,"verse":"What about you? You say you are a Jew. You trust in the law and proudly claim to be close to God."},{"num":18,"verse":"You know what God wants you to do. And you know what is important, because you have learned the law."},{"num":19,"verse":"You think you are a guide for people who don’t know the right way, a light for those who are in the dark."},{"num":20,"verse":"You think you can show foolish people what is right. And you think you are a teacher for those who are just beginning to learn. You have the law, and so you think you know everything and have all truth."},{"num":21,"verse":"You teach others, so why don’t you teach yourself? You tell them not to steal, but you yourself steal."},{"num":22,"verse":"You say they must not commit adultery, but you yourself are guilty of that sin. You hate idols, but you steal them from their temples."},{"num":23,"verse":"You are so proud that you have God’s law, but you bring shame to God by breaking his law."},{"num":24,"verse":"As the Scriptures say, “People in other nations insult God because of you.”"},{"num":25,"verse":"If you follow the law, then your circumcision has meaning. But if you break the law, then it is as if you were never circumcised."},{"num":26,"verse":"Those who are not Jews are not circumcised. But if they do what the law says, it is as if they were circumcised."},{"num":27,"verse":"You have the written law and circumcision, but you break the law. So those who are not circumcised in their bodies, but still obey the law, will show that you are guilty."},{"num":28,"verse":"You are not a true Jew if you are only a Jew in your physical body. True circumcision is not only on the outside of the body."},{"num":29,"verse":"A true Jew is one who is a Jew inside. True circumcision is done in the heart. It is done by the Spirit, not by the written law. And anyone who is circumcised in the heart by the Spirit gets praise from God, not from people."}]