[{"num":6,"verse":"Children, obey your parents in the Lord: for this is right. "},{"num":2,"verse":"Honor thy father and mother (which is the first commandment with promise), "},{"num":3,"verse":"that it may be well with thee, and thou mayest live long on the earth. "},{"num":4,"verse":"And, ye fathers, provoke not your children to wrath: but nurture them in the chastening and admonition of the Lord."},{"num":5,"verse":"Servants, be obedient unto them that according to the flesh are your masters, with fear and trembling, in singleness of your heart, as unto Christ; "},{"num":6,"verse":"not in the way of eyeservice, as men-pleasers; but as servants of Christ, doing the will of God from the heart; "},{"num":7,"verse":"with good will doing service, as unto the Lord, and not unto men: "},{"num":8,"verse":"knowing that whatsoever good thing each one doeth, the same shall he receive again from the Lord, whether he be bond or free. "},{"num":9,"verse":"And, ye masters, do the same things unto them, and forbear threatening: knowing that he who is both their Master and yours is in heaven, and there is no respect of persons with him."},{"num":10,"verse":"Finally, be strong in the Lord, and in the strength of his might. "},{"num":11,"verse":"Put on the whole armor of God, that ye may be able to stand against the wiles of the devil. "},{"num":12,"verse":"For our wrestling is not against flesh and blood, but against the principalities, against the powers, against the world-rulers of this darkness, against the spiritual hosts of wickedness in the heavenly places. "},{"num":13,"verse":"Wherefore take up the whole armor of God, that ye may be able to withstand in the evil day, and, having done all, to stand. "},{"num":14,"verse":"Stand therefore, having girded your loins with truth, and having put on the breastplate of righteousness, "},{"num":15,"verse":"and having shod your feet with the preparation of the gospel of peace; "},{"num":16,"verse":"withal taking up the shield of faith, wherewith ye shall be able to quench all the fiery darts of the evil one. "},{"num":17,"verse":"And take the helmet of salvation, and the sword of the Spirit, which is the word of God: "},{"num":18,"verse":"with all prayer and supplication praying at all seasons in the Spirit, and watching thereunto in all perseverance and supplication for all the saints, "},{"num":19,"verse":"and on my behalf, that utterance may be given unto me in opening my mouth, to make known with boldness the mystery of the gospel, "},{"num":20,"verse":"for which I am an ambassador in chains; that in it I may speak boldly, as I ought to speak."},{"num":21,"verse":"But that ye also may know my affairs, how I do, Tychicus, the beloved brother and faithful minister in the Lord, shall make known to you all things: "},{"num":22,"verse":"whom I have sent unto you for this very purpose, that ye may know our state, and that he may comfort your hearts."},{"num":23,"verse":"Peace be to the brethren, and love with faith, from God the Father and the Lord Jesus Christ. "},{"num":24,"verse":"Grace be with all them that love our Lord Jesus Christ with a love incorruptible."}]