[{"num":6,"verse":"Children, obey your parents in [the] Lord, for this is just."},{"num":2,"verse":"Honour thy father and thy mother, which is the first commandment with a promise,"},{"num":3,"verse":"that it may be well with thee, and that thou mayest be long-lived on the earth."},{"num":4,"verse":"And [ye] fathers, do not provoke your children to anger, but bring them up in [the] discipline and admonition of [the] Lord."},{"num":5,"verse":"Bondmen, obey masters according to flesh, with fear and trembling, in simplicity of your heart as to the Christ;"},{"num":6,"verse":"not with eye-service as men-pleasers; but as bondmen of Christ, doing the will of God from [the] soul,"},{"num":7,"verse":"serving with good will as to the Lord, and not to men;"},{"num":8,"verse":"knowing that whatever good each shall do, this he shall receive of [the] Lord, whether bond or free."},{"num":9,"verse":"And, masters, do the same things towards them, giving up threatening, knowing that both their and your Master is in heaven, and there is no acceptance of persons with him."},{"num":10,"verse":"For the rest, brethren, be strong in [the] Lord, and in the might of his strength."},{"num":11,"verse":"Put on the panoply of God, that ye may be able to stand against the artifices of the devil:"},{"num":12,"verse":"because our struggle is not against blood and flesh, but against principalities, against authorities, against the universal lords of this darkness, against spiritual [power] of wickedness in the heavenlies."},{"num":13,"verse":"For this reason take [to you] the panoply of God, that ye may be able to withstand in the evil day, and, having accomplished all things, to stand."},{"num":14,"verse":"Stand therefore, having girt about your loins with truth, and having put on the breastplate of righteousness,"},{"num":15,"verse":"and shod your feet with [the] preparation of the glad tidings of peace:"},{"num":16,"verse":"besides all [these], having taken the shield of faith with which ye will be able to quench all the inflamed darts of the wicked one."},{"num":17,"verse":"Have also the helmet of salvation, and the sword of the Spirit, which is God's word;"},{"num":18,"verse":"praying at all seasons, with all prayer and supplication in [the] Spirit, and watching unto this very thing with all perseverance and supplication for all the saints;"},{"num":19,"verse":"and for me in order that utterance may be given to me in [the] opening of my mouth to make known with boldness the mystery of the glad tidings,"},{"num":20,"verse":"for which I am an ambassador [bound] with a chain, that I may be bold in it as I ought to speak."},{"num":21,"verse":"But in order that *ye* also may know what concerns me, how I am getting on, Tychicus, the beloved brother and faithful minister in [the] Lord, shall make all things known to you;"},{"num":22,"verse":"whom I have sent to you for this very thing, that ye may know of our affairs and that he may encourage your hearts."},{"num":23,"verse":"Peace to the brethren, and love with faith, from God [the] Father and [the] Lord Jesus Christ."},{"num":24,"verse":"Grace with all them that love our Lord Jesus Christ in incorruption."}]