[[],[{"type":"header","content":"Children and Parents"},{"type":"prose","content":"Children, obey your parents in the Lord, for this is right."}],[{"type":"prose","content":" (which is the first commandment with a promise),"}],[{"type":"prose","content":"."}],[{"type":"prose","content":"Fathers, do not provoke your children to anger, but bring them up in the discipline and instruction of the Lord."},{"type":"header","content":"Slaves and Masters"}],[{"type":"prose","content":"Slaves, be obedient to those who are your masters according to the flesh, with fear and trembling, in the sincerity of your heart, as to Christ;"}],[{"type":"prose","content":"not by way of eye-service, as people-pleasers, but as slaves of Christ, doing the will of God from the heart."}],[{"type":"prose","content":"With goodwill render service, as to the Lord, and not to people,"}],[{"type":"prose","content":"knowing that whatever good thing each one does, he will receive this back from the Lord, whether slave or free."}],[{"type":"prose","content":"And masters, do the same things to them, and give up threatening, knowing that both their Master and yours is in heaven, and there is no partiality with Him."},{"type":"header","content":"The Armor of God"}],[{"type":"prose","content":"Finally, be strong in the Lord and in the strength of His might."}],[{"type":"prose","content":"Put on the full armor of God, so that you will be able to stand firm against the schemes of the devil."}],[{"type":"prose","content":"For our struggle is not against flesh and blood, but against the rulers, against the powers, against the world forces of this darkness, against the spiritual  of wickedness in the heavenly ."}],[{"type":"prose","content":"Therefore, take up the full armor of God, so that you will be able to resist on the evil day, and having done everything, to stand firm."}],[{"type":"prose","content":"Stand firm therefore, having belted your waist with truth, and having put on the breastplate of righteousness,"}],[{"type":"prose","content":"and having strapped on your feet the preparation of the gospel of peace;"}],[{"type":"prose","content":"in addition to all, taking up the shield of faith with which you will be able to extinguish all the flaming arrows of the evil ."}],[{"type":"prose","content":"And take the helmet of salvation and the sword of the Spirit, which is the word of God."}],[{"type":"prose","content":"With every prayer and request, pray at all times in the Spirit, and with this in view, be alert with all perseverance and  request for all the saints,"}],[{"type":"prose","content":"and  in my behalf, that speech may be given to me in the opening of my mouth, to make known with boldness the mystery of the gospel,"}],[{"type":"prose","content":"for which I am an ambassador in chains; that in  it I may speak boldly, as I ought to speak."}],[{"type":"prose","content":"Now, so that you also may know about my circumstances  what I am doing, Tychicus, the beloved brother and faithful servant in the Lord, will make everything known to you."}],[{"type":"prose","content":"I have sent him to you for this very purpose, so that you may know about us, and that he may comfort your hearts."}],[{"type":"prose","content":"Peace be to the brothers , and love with faith, from God the Father and the Lord Jesus Christ."}],[{"type":"prose","content":"Grace be with all those who love our Lord Jesus Christ with incorruptible ."}]]