[[],[{"type":"header","content":"Change the Way You’re Living"},{"type":"prose","content":"At the beginning of the reign of Jehoiakim son of Josiah king of Judah, this Message came from  to Jeremiah:"}],[{"type":"prose","content":"“’s Message: Stand in the court of ’s Temple and preach to the people who come from all over Judah to worship in ’s Temple. Say everything I tell you to say to them. Don’t hold anything back. Just maybe they’ll listen and turn back from their bad lives. Then I’ll reconsider the disaster that I’m planning to bring on them because of their evil behavior."}],[{"type":"prose","content":"“Say to them, ‘This is ’s Message: If you refuse to listen to me and live by my teaching that I’ve revealed so plainly to you, and if you continue to refuse to listen to my servants the prophets that I tirelessly keep on sending to you—but you’ve never listened! Why would you start now?—then I’ll make this Temple a pile of ruins like Shiloh, and I’ll make this city nothing but a bad joke worldwide.’”"}],[{"type":"prose","content":"Everybody there—priests, prophets, and people—heard Jeremiah preaching this Message in the Temple of . When Jeremiah had finished his sermon, saying everything God had commanded him to say, the priests and prophets and people all grabbed him, yelling, “Death! You’re going to die for this! How dare you preach—and using ’s name!—saying that this Temple will become a heap of rubble like Shiloh and this city be wiped out without a soul left in it!”All the people mobbed Jeremiah right in the Temple itself.* * *"}],[{"type":"prose","content":"Officials from the royal court of Judah were told of this. They left the palace immediately and came to ’s Temple to investigate. They held court on the spot, at the New Gate entrance to ’s Temple."}],[{"type":"prose","content":"The prophets and priests spoke first, addressing the officials, but also the people: “Death to this man! He deserves nothing less than death! He has preached against this city—you’ve heard the evidence with your own ears.”"}],[{"type":"prose","content":"Jeremiah spoke next, publicly addressing the officials before the crowd: “ sent me to preach against both this Temple and city everything that’s been reported to you. So do something about it! Change the way you’re living, change your behavior. Listen obediently to the Message of your . Maybe  will reconsider the disaster he has threatened."}],[{"type":"prose","content":"“As for me, I’m at your mercy—do whatever you think is best. But take warning: If you kill me, you’re killing an innocent man, and you and the city and the people in it will be liable. I didn’t say any of this on my own.  sent me and told me what to say. You’ve been listening to  speak, not Jeremiah.”"}],[{"type":"prose","content":"The court officials, backed by the people, then handed down their ruling to the priests and prophets: “Acquittal. No death sentence for this man. He has spoken to us with the authority of our .”"}],[{"type":"prose","content":"Then some of the respected leaders stood up and addressed the crowd: “In the reign of Hezekiah king of Judah, Micah of Moresheth preached to the people of Judah this sermon: This is -of-the-Angel-Armies’ Message for you:"},{"type":"poetry","content":"“‘Because of people like you,"},{"type":"poetry","content":"Jerusalem end up as a pile of rubble,"}],[{"type":"prose","content":"“Did King Hezekiah or anyone else in Judah kill Micah of Moresheth because of that sermon? Didn’t Hezekiah honor him and pray for mercy from ? And then didn’t  call off the disaster he had threatened?“Friends, we’re at the brink of bringing a terrible calamity upon ourselves.”* * *"}],[{"type":"prose","content":"(At another time there had been a man, Uriah son of Shemaiah from Kiriath-jearim, who had preached similarly in the name of . He preached against this same city and country just as Jeremiah did. When King Jehoiakim and his royal court heard his sermon, they determined to kill him. Uriah, afraid for his life, went into hiding in Egypt. King Jehoiakim sent Elnathan son of Achbor with a posse of men after him. They brought him back from Egypt and presented him to the king. And the king had him killed. They dumped his body unceremoniously outside the city."}],[{"type":"prose","content":"But in Jeremiah’s case, Ahikam son of Shaphan stepped forward and took his side, preventing the mob from lynching him.)"}]]