[{"num":3,"verse":"What advantage then hath the Jew? or what is the profit of circumcision? "},{"num":2,"verse":"Much every way: first of all, that they were intrusted with the oracles of God. "},{"num":3,"verse":"For what if some were without faith? shall their want of faith make of none effect the faithfulness of God? "},{"num":4,"verse":"God forbid: yea, let God be found true, but every man a liar; as it is written,"},{"num":5,"verse":"But if our unrighteousness commendeth the righteousness of God, what shall we say? Is God unrighteous who visiteth with wrath? (I speak after the manner of men.) "},{"num":6,"verse":"God forbid: for then how shall God judge the world? "},{"num":7,"verse":"But if the truth of God through my lie abounded unto his glory, why am I also still judged as a sinner? "},{"num":8,"verse":"and why not (as we are slanderously reported, and as some affirm that we say), Let us do evil, that good may come? whose condemnation is just."},{"num":9,"verse":"What then? are we better than they? No, in no wise: for we before laid to the charge both of Jews and Greeks, that they are all under sin; "},{"num":10,"verse":"as it is written,"},{"num":19,"verse":"Now we know that what things soever the law saith, it speaketh to them that are under the law; that every mouth may be stopped, and all the world may be brought under the judgment of God: "},{"num":20,"verse":"because by the works of the law shall no flesh be justified in his sight; for through the law cometh the knowledge of sin."},{"num":21,"verse":"But now apart from the law a righteousness of God hath been manifested, being witnessed by the law and the prophets; "},{"num":22,"verse":"even the righteousness of God through faith in Jesus Christ unto all them that believe; for there is no distinction; "},{"num":23,"verse":"for all have sinned, and fall short of the glory of God; "},{"num":24,"verse":"being justified freely by his grace through the redemption that is in Christ Jesus: "},{"num":25,"verse":"whom God set forth to be a propitiation, through faith, in his blood, to show his righteousness because of the passing over of the sins done aforetime, in the forbearance of God; "},{"num":26,"verse":"for the showing, I say, of his righteousness at this present season: that he might himself be just, and the justifier of him that hath faith in Jesus. "},{"num":27,"verse":"Where then is the glorying? It is excluded. By what manner of law? of works? Nay: but by a law of faith. "},{"num":28,"verse":"We reckon therefore that a man is justified by faith apart from the works of the law. "},{"num":29,"verse":"Or is God the God of Jews only? is he not the God of Gentiles also? Yea, of Gentiles also: "},{"num":30,"verse":"if so be that God is one, and he shall justify the circumcision by faith, and the uncircumcision through faith."},{"num":31,"verse":"Do we then make the law of none effect through faith? God forbid: nay, we establish the law."}]