[{"num":3,"verse":"So, do Jews have anything that others don’t have? Do they get any benefit from being circumcised?"},{"num":2,"verse":"Yes, the Jews have many benefits. The most important one is this: God trusted the Jews with his teachings."},{"num":3,"verse":"It is true that some Jews were not faithful to God. But will that stop God from doing what he promised?"},{"num":4,"verse":"No, even if everyone else is a liar, God will always do what he says. As the Scriptures say about him,"},{"num":5,"verse":"When we do wrong, that shows more clearly that God is right. So can we say that God does wrong when he punishes us? (That’s the way some people think.)"},{"num":6,"verse":"Of course not. If God could not punish us, how could he judge the world?"},{"num":7,"verse":"Someone might say, “When I lie, it really gives God glory, because my lie makes his truth easier to see. So why am I judged a sinner?”"},{"num":8,"verse":"It would be the same to say, “We should do evil so that good will come.” Many people criticize us, saying that’s what we teach. They are wrong, and they should be condemned for saying that."},{"header":"All People Are Guilty"},{"num":9,"verse":"So are we Jews better than other people? No, we have already said that those who are Jews, as well as those who are not Jews, are the same. They are all guilty of sin."},{"num":10,"verse":"As the Scriptures say,"},{"num":19,"verse":"What the law says is for those who are under the law. It stops anyone from making excuses. And it brings the whole world under God’s judgment,"},{"num":20,"verse":"because no one can be made right with God by following the law. The law only shows us our sin."},{"header":"How God Makes People Right"},{"num":21,"verse":"But God has a way to make people right, and it has nothing to do with the law. He has now shown us that new way, which the law and the prophets told us about."},{"num":22,"verse":"God makes people right through their faith in Jesus Christ. He does this for all who believe in Christ. Everyone is the same."},{"num":23,"verse":"All have sinned and are not good enough to share God’s divine greatness."},{"num":24,"verse":"They are made right with God by his grace. This is a free gift. They are made right with God by being made free from sin through Jesus Christ."},{"num":25,"verse":"God gave Jesus as a way to forgive people’s sins through their faith in him. God can forgive them because the blood sacrifice of Jesus pays for their sins. God gave Jesus to show that he always does what is right and fair. He was right in the past when he was patient and did not punish people for their sins. And in our own time he still does what is right. God worked all this out in a way that allows him to judge people fairly and still make right any person who has faith in Jesus."},{"num":27,"verse":"So do we have any reason to boast about ourselves? No reason at all. And why not? Because we are depending on the way of faith, not on what we have done in following the law."},{"num":28,"verse":"I mean we are made right with God through faith, not through what we have done to follow the law. This is what we believe."},{"num":29,"verse":"God is not only the God of the Jews. He is also the God of those who are not Jews."},{"num":30,"verse":"There is only one God. He will make Jews right with him by their faith, and he will also make non-Jews right with him through their faith."},{"num":31,"verse":"So do we destroy the law by following the way of faith? Not at all! In fact, faith causes us to be what the law actually wants."}]