[{"header":"Everyone is a Sinner"},{"num":3,"verse":"What advantage, then, does the Jew have, or what value is there in circumcision? "},{"num":2,"verse":"There are all kinds of advantages! First of all, the Jews have been entrusted with the utterances of God. "},{"num":3,"verse":"What if some of the Jews were unfaithful? Their unfaithfulness cannot cancel God’s faithfulness, can it? "},{"num":4,"verse":"Of course not! God is true, even if everyone else is a liar. As it is written,"},{"num":5,"verse":"But if our unrighteousness serves to confirm God’s righteousness, what can we say? God is not unrighteous when he vents his wrath on us, is he? (I am talking in human terms.) "},{"num":6,"verse":"Of course not! Otherwise, how could God judge the world? "},{"num":7,"verse":"For if through my falsehood God’s truthfulness glorifies him even more, why am I still being condemned as a sinner? "},{"num":8,"verse":"Or can we say—as some people slander us by claiming that we say—“Let’s do evil that good may result”? They deserve to be condemned!"},{"num":9,"verse":"What, then, does this mean? Are we Jews any better off? Not at all! For we have already accused everyone, both Jews and Greeks, of being under the power of sin. "},{"num":10,"verse":"As it is written,"},{"num":19,"verse":"Now we know that whatever the Law says applies to those who are under the Law, so that every mouth may be silenced and the whole world held accountable to God. "},{"num":20,"verse":"Therefore, God will not justify any human being by means of the actions prescribed by the Law, for through the Law comes the full knowledge of sin."},{"header":"God Gives Us Righteousness through Faith"},{"num":21,"verse":"But now, apart from the Law, God’s righteousness is revealed and is attested by the Law and the Prophets— "},{"num":22,"verse":"God’s righteousness through the faithfulness of Jesus the Messiah— for all who believe. For there is no distinction among people, "},{"num":23,"verse":"since all have sinned and continue to fall short of God’s glory. "},{"num":24,"verse":"By his grace they are justified freely through the redemption that is in the Messiah Jesus, "},{"num":25,"verse":"whom God offered as a place where atonement by the Messiah’s blood would occur through faith. He did this to demonstrate his righteousness, because he had waited patiently to deal with sins committed in the past. "},{"num":26,"verse":"He wanted to demonstrate at the present time that he himself is righteous and that he justifies anyone who has the faithfulness of Jesus."},{"num":27,"verse":"What, then, is there to boast about? That has been eliminated. On what principle? On that of actions? No, but on the principle of faith. "},{"num":28,"verse":"For we maintain that a person is justified by faith apart from the actions prescribed by the Law. "},{"num":29,"verse":"Is God the God of the Jews only? Is he not the God of the gentiles, too? Yes, of the gentiles, too, "},{"num":30,"verse":"since there is only one God who will justify the circumcised on the basis of faith and the uncircumcised by that same faith. "},{"num":31,"verse":"Do we, then, abolish the Law by this faith? Of course not! Instead, we uphold the Law."}]