[{"num":1,"verse":"So what difference does it make who’s a Jew and who isn’t, who has been trained in God’s ways and who hasn’t? As it turns out, it makes a lot of difference—but not the difference so many have assumed."},{"num":2,"verse":"First, there’s the matter of being put in charge of writing down and caring for God’s revelation, these Holy Scriptures. So, what if, in the course of doing that, some of those Jews abandoned their post? God didn’t abandon them. Do you think their faithlessness cancels out his faithfulness? Not on your life! Depend on it: God keeps his word even when the whole world is lying through its teeth. Scripture says the same:"},{"num":7,"verse":"It’s simply perverse to say, “If my lies serve to show off God’s truth all the more gloriously, why blame me? I’m doing God a favor.” Some people are actually trying to put such words in our mouths, claiming that we go around saying, “The more evil we do, the more good God does, so let’s just do it!” That’s pure slander, as I’m sure you’ll agree."},{"header":"We’re All in the Same Sinking Boat"},{"num":9,"verse":"So where does that put us? Do we Jews get a better break than the others? Not really. Basically, all of us, whether insiders or outsiders, start out in identical conditions, which is to say that we all start out as sinners. Scripture leaves no doubt about it:"},{"header":"God Has Set Things Right"},{"num":21,"verse":"But in our time something new has been added. What Moses and the prophets witnessed to all those years has happened. The God-setting-things-right that we read about has become Jesus-setting-things-right for us. And not only for us, but for everyone who believes in him. For there is no difference between us and them in this. Since we’ve compiled this long and sorry record as sinners (both us and them) and proved that we are utterly incapable of living the glorious lives God wills for us, God did it for us. Out of sheer generosity he put us in right standing with himself. A pure gift. He got us out of the mess we’re in and restored us to where he always wanted us to be. And he did it by means of Jesus Christ."},{"num":25,"verse":"God sacrificed Jesus on the altar of the world to clear that world of sin. Having faith in him sets us in the clear. God decided on this course of action in full view of the public—to set the world in the clear with himself through the sacrifice of Jesus, finally taking care of the sins he had so patiently endured. This is not only clear, but it’s now—this is current history! God sets things right. He also makes it possible for us to live in his rightness."},{"num":27,"verse":"So where does that leave our proud Jewish insider claims and counterclaims? Canceled? Yes, canceled. What we’ve learned is this: God does not respond to what we do; we respond to what God does. We’ve finally figured it out. Our lives get in step with God and all others by letting him set the pace, not by proudly or anxiously trying to run the parade."},{"num":29,"verse":"And where does that leave our proud Jewish claim of having a corner on God? Also canceled. God is the God of outsider non-Jews as well as insider Jews. How could it be otherwise since there is only one God? God sets right all who welcome his action and enter into it, both those who follow our religious system and those who have never heard of our religion."},{"num":31,"verse":"But by shifting our focus from what we do to what God does, don’t we cancel out all our careful keeping of the rules and ways God commanded? Not at all. What happens, in fact, is that by putting that entire way of life in its proper place, we confirm it."}]