[{"header":"Chapter 3"},{"num":1,"verse":"The Value of Judaism. Is there any advantage, therefore, in being a Jew? Or what is the value of circumcision?"},{"num":2,"verse":"A great deal in every respect. In the first place, they were entrusted with the words of God."},{"num":3,"verse":"What if some were unfaithful? Will their lack of faith nullify the fidelity of God?"},{"num":4,"verse":"By no means! God must be true even if every human being is a liar, as it is written,"},{"num":5,"verse":"But if our wickedness serves to confirm the righteousness of God, what are we to say? Is God unjust (I speak of him in human terms) to bring retribution upon us?"},{"num":6,"verse":"Of course not! For that would imply that God could not judge the world."},{"num":7,"verse":"But if, as a result of my falsehood, God demonstrates his truthfulness, to his greater glory, why am I still being condemned as a sinner?"},{"num":8,"verse":"And why not say, as some people slanderously accuse us of proposing, “Let us do evil so that good may result”? Such people deserve their condemnation."},{"num":9,"verse":"The Whole World Guilty before God. Well, then, are we any better? No, not at all. For we have already charged that both Jews and Gentiles alike are all under the power of sin."},{"num":10,"verse":"As it is written,"},{"num":19,"verse":"Now we know that what the Law says is addressed to those who are under the Law, so that every mouth may be silenced and the entire world may be seen as guilty before God."},{"num":20,"verse":"For no one can be regarded as justified in the sight of God by keeping the Law. The Law brings only the consciousness of sin."},{"header":"The Redemption in Jesus Christ[d]"},{"num":21,"verse":"God’s Righteousness through Faith in Jesus Christ. But now the righteousness of God that is attested by the Law and the Prophets has been manifested apart from law:"},{"num":22,"verse":"the righteousness of God through faith in Jesus Christ for all who believe. No distinction has been made."},{"num":23,"verse":"For all have sinned and thereby are deprived of the glory of God,"},{"num":24,"verse":"and all are justified by the gift of his grace that is given freely through the redemption in Christ Jesus."},{"num":25,"verse":"God designated him to be a sacrifice of expiation of sin through faith by the shedding of his blood because in his divine forbearance he allowed to be unpunished the sins previously committed."},{"num":26,"verse":"He thus demonstrated his righteousness in the present time so that he might show himself to be just as the one who justifies anyone who has faith in Jesus."},{"num":27,"verse":"Justification through Faith Apart from the Works of the Law. What reason then does one have to boast? It is excluded! By works of the Law? No, rather by the law of faith."},{"num":28,"verse":"For we maintain that one is justified by faith apart from the works of the Law."},{"num":29,"verse":"Is God the God only of the Jews? Is he not also the God of the Gentiles? Yes, he is the God of the Gentiles too,"},{"num":30,"verse":"since there is only one God, and he will justify both the circumcised and the uncircumcised on the basis of their faith."},{"num":31,"verse":"Are we thereby nullifying the Law by this faith? By no means! On the contrary, we are upholding the Law."}]