[[],[{"type":"prose","content":"Therefore what advantage does the Jew have, or what is the value of circumcision? "}],[{"type":"prose","content":"Actually, there are many advantages. First of all, the Jews were entrusted with the oracles of God. "}],[{"type":"prose","content":"What then? If some were unfaithful, their unfaithfulness will not nullify God’s faithfulness, will it? "}],[{"type":"prose","content":"Absolutely not! Let God be proven true, and every human being shown up as a liar, just as it is written: “ .”"}],[{"type":"prose","content":"But if our unrighteousness demonstrates the righteousness of God, what shall we say? The God who inflicts wrath is not unrighteous, is he? (I am speaking in human terms.) "}],[{"type":"prose","content":"Absolutely not! For otherwise how could God judge the world? "}],[{"type":"prose","content":"For if by my lie the truth of God enhances his glory, why am I still actually being judged as a sinner? "}],[{"type":"prose","content":"And why not say, “Let us do evil so that good may come of it”?—as some who slander us allege that we say. (Their condemnation is deserved!)"},{"type":"header","content":"The Condemnation of the World"}],[{"type":"prose","content":"What then? Are we better off? Certainly not, for we have already charged that Jews and Greeks alike are all under sin, "}],[{"type":"prose","content":"just as it is written:"}],[{"type":"prose","content":"Now we know that whatever the law says, it says to those who are under the law, so that every mouth may be silenced and the whole world may be held accountable to God. "}],[{"type":"prose","content":"For  by the works of the law, for through the law comes the knowledge of sin. "}],[{"type":"prose","content":"But now apart from the law the righteousness of God (although it is attested by the law and the prophets) has been disclosed—"}],[{"type":"prose","content":"namely, the righteousness of God through the faithfulness of Jesus Christ for all who believe. For there is no distinction, "}],[{"type":"prose","content":"for all have sinned and fall short of the glory of God. "}],[{"type":"prose","content":"But they are justified freely by his grace through the redemption that is in Christ Jesus. "}],[{"type":"prose","content":"God publicly displayed him at his death as the mercy seat accessible through faith. This was to demonstrate his righteousness, because God in his forbearance had passed over the sins previously committed. "}],[{"type":"prose","content":"This was also to demonstrate his righteousness in the present time, so that he would be just and the justifier of the one who lives because of Jesus’ faithfulness."}],[{"type":"prose","content":"Where, then, is boasting? It is excluded! By what principle? Of works? No, but by the principle of faith! "}],[{"type":"prose","content":"For we consider that a person is declared righteous by faith apart from the works of the law. "}],[{"type":"prose","content":"Or is God the God of the Jews only? Is he not the God of the Gentiles too? Yes, of the Gentiles too! "}],[{"type":"prose","content":"Since God is one, he will justify the circumcised by faith and the uncircumcised through faith. "}],[{"type":"prose","content":"Do we then nullify the law through faith? Absolutely not! Instead we uphold the law."}]]