[{"header":"The Journey Resumed"},{"num":33,"verse":"The Lord spoke to Moses, saying, “Depart, go up from here, you and the people whom you have brought from the land of Egypt, to the land which I swore to Abraham, Isaac, and Jacob (Israel), saying, ‘To your descendants I will give it.’ "},{"num":2,"verse":"I will send an Angel before you and I will drive out the Canaanite, the Amorite, the Hittite, the Perizzite, the Hivite, and the Jebusite. "},{"num":3,"verse":"Go up to a land [of abundance] flowing with milk and honey; for I will not go up in your midst, because you are a stiff-necked (stubborn, rebellious) people, and I might destroy you on the way.”"},{"num":4,"verse":"When the people heard this sad word, they mourned, and none of them put on his ornaments. "},{"num":5,"verse":"For the Lord had said to Moses, “Say to the sons of Israel, ‘You are a stiff-necked (stubborn, rebellious) people! If I should come among you for one moment, I would destroy you. Now therefore, [penitently] take off your ornaments, so that I may know what to do with you.’” "},{"num":6,"verse":"So the Israelites left off all their ornaments [in repentance], from Mount Horeb (Sinai) onward."},{"num":7,"verse":"Now Moses used to take his own tent and pitch it outside the camp, far away from the camp, and he called it the tent of meeting [of God with His own people]. And everyone who sought the Lord would go out to the [temporary] tent of meeting which was outside the camp. "},{"num":8,"verse":"Whenever Moses went out to the tent, all the people would rise and stand, each at his tent door, and look at Moses until he entered the tent. "},{"num":9,"verse":"Whenever Moses entered the tent, the pillar of cloud would descend and stand at the doorway of the tent; and the Lord would speak with Moses. "},{"num":10,"verse":"When all the people saw the pillar of cloud standing at the tent door, all the people would rise and worship, each at his tent door. "},{"num":11,"verse":"And so the Lord used to speak to Moses face to face, just as a man speaks to his friend. When Moses returned to the camp, his attendant Joshua, the son of Nun, a young man, would not depart from the tent."},{"header":"Moses Intercedes"},{"num":12,"verse":"Moses said to the Lord, “See, You say to me, ‘Bring up this people,’ but You have not let me know whom You will send with me. Yet You have said, ‘I know you by name, and you have also found favor in My sight.’ "},{"num":13,"verse":"Now therefore, I pray you, if I have found favor in Your sight, let me know Your ways so that I may know You [becoming more deeply and intimately acquainted with You, recognizing and understanding Your ways more clearly] and that I may find grace and favor in Your sight. And consider also, that this nation is Your people.” "},{"num":14,"verse":"And the Lord said, “My presence shall go with you, and I will give you rest [by bringing you and the people into the promised land].” "},{"num":15,"verse":"And Moses said to Him, “If Your presence does not go [with me], do not lead us up from here. "},{"num":16,"verse":"For how then can it be known that Your people and I have found favor in Your sight? Is it not by Your going with us, so that we are distinguished, Your people and I, from all the [other] people on the face of the earth?”"},{"num":17,"verse":"The Lord said to Moses, “I will also do this thing that you have asked; for you have found favor (lovingkindness, mercy) in My sight and I have known you [personally] by name.” "},{"num":18,"verse":"Then Moses said, “Please, show me Your glory!” "},{"num":19,"verse":"And God said, “I will make all My goodness pass before you, and I will proclaim the Name of the Lord before you; for I will be gracious to whom I will be gracious, and will show compassion (lovingkindness) on whom I will show compassion.” "},{"num":20,"verse":"But He said, “You cannot see My face, for no man shall see Me and live!” "},{"num":21,"verse":"Then the Lord said, “Behold, there is a place beside Me, and you shall stand there on the rock; "},{"num":22,"verse":"and while My glory is passing by, I will put you in a cleft of the rock and protectively cover you with My hand until I have passed by. "},{"num":23,"verse":"Then I will take away My hand and you shall see My back; but My face shall not be seen.”"}]