[{"header":"The Lord Instructs Israel to Leave"},{"num":33,"verse":"The Lord told Moses, “Go up from here, you and the people whom you brought out of Egypt, to the land about which I swore to Abraham, Isaac, and Jacob saying, ‘I’ll give it to your descendants.’ "},{"num":2,"verse":"I’ll send an angel in front of you and I’ll drive out the Canaanites, the Amorites, the Hittites, the Perizzites, the Hivites, and the Jebusites. "},{"num":3,"verse":"Go up to a land flowing with milk and honey, but I won’t go up among you, because you are an obstinate people, and otherwise I might consume you along the way.”"},{"num":4,"verse":"When the people heard this troubling word, they mourned, and no one put on his ornaments. "},{"num":5,"verse":"The Lord had told Moses, “Say to the Israelis, ‘You are an obstinate people, and if for one moment I went up among you, I would put an end to you. Now take off your ornaments so I may decide what to do with you.’” "},{"num":6,"verse":"So the Israelis did not wear their ornaments from Mount Horeb onward."},{"header":"God’s Presence at the Tent of Meeting"},{"num":7,"verse":"Moses used to take the tent and set it up outside the camp at a distance from the camp, and he called it the Tent of Meeting. When anyone sought the Lord, he would go out to the Tent of Meeting which was outside the camp. "},{"num":8,"verse":"When Moses would go out to the tent, all the people would get up, and each would stand in the doorway of his tent, watching Moses until he entered the tent. "},{"num":9,"verse":"When Moses entered the tent, the pillar of cloud would come down and stand at the doorway of the tent while God spoke with Moses. "},{"num":10,"verse":"When all the people saw the pillar of cloud standing at the doorway of the tent, all of them would get up and prostrate themselves in worship, each one at the doorway of his tent. "},{"num":11,"verse":"The Lord would speak to Moses face to face just as a man speaks with his friend. When Moses returned to the camp, Nun’s son Joshua, his young servant, would not leave the tent."},{"header":"The Promise of God’s Presence on the Journey"},{"num":12,"verse":"Moses told the Lord, “Look, you have told me, ‘Bring up this people,’ but you haven’t let me know whom you will send with me. Yet you have said, ‘I know you by name,’ and also, ‘You have found favor in my sight.’ "},{"num":13,"verse":"Now, if I’ve found favor in your sight, please show me your ways so I may know you in order to find favor in your sight. And remember, this nation is your people.”"},{"num":14,"verse":"He said, “My presence will go with you, and I’ll give you rest.” "},{"num":15,"verse":"Then Moses told the Lord, “If your presence does not go with us, don’t bring us up from here. "},{"num":16,"verse":"Otherwise, how shall it be known that your people and I have received favor from you, unless you go with us and that we, your people and I, are distinguished from all the people on the surface of the earth?”"},{"header":"Moses Sees God’s Glory"},{"num":17,"verse":"The Lord told Moses, “I’ll do the very thing that you have said, because you have found favor in my sight and I know you by name.”"},{"num":18,"verse":"Then Moses said, “Please show me your glory.”"},{"num":19,"verse":"God said, “I’ll cause all my goodness to pass before you, and I’ll proclaim the name ‘the Lord’ before you. I’ll be gracious to whom I’ll be gracious, and I’ll show compassion on whom I’ll show compassion. "},{"num":20,"verse":"But,” he said, “You cannot see my face, because a man cannot see me and live.”"},{"num":21,"verse":"The Lord said, “Look, there is a place near me where you can stand on the rock; "},{"num":22,"verse":"and as my glory passes by, I’ll put you in a crevice in the rock, and cover you with my hand until I’ve passed by. "},{"num":23,"verse":"Then I’ll remove my hand so you may see my back, but my face must not be seen.”"}]