[{"num":33,"verse":"¶ And the LORD said unto Moses, Depart and go up from here, thou and the people which thou hast brought up out of the land of Egypt unto the land which I swore unto Abraham, Isaac, and Jacob, saying, Unto thy seed will I give it."},{"num":2,"verse":"(And I will send an angel before thee; and I will drive out the Canaanite, the Amorite, the Hittite, the Perizzite, the Hivite, and the Jebusite.)"},{"num":3,"verse":"Unto the land flowing with milk and honey; for I will not go up in the midst of thee; for thou art a stiffnecked people lest I consume thee in the way."},{"num":4,"verse":"And when the people heard these evil tidings, they mourned, and no one put on their ornaments."},{"num":5,"verse":"For the LORD had said unto Moses, Say unto the sons of Israel, Ye are a stiffnecked people; I will come up into the midst of thee in a moment and consume thee; therefore now put off thy ornaments from thee that I may know what to do unto thee."},{"num":6,"verse":"Then the sons of Israel stripped themselves of their ornaments from Mount Horeb on."},{"num":7,"verse":"¶ And Moses took the tabernacle and pitched it outside the camp, afar off from the camp, and called it the tabernacle of the testimony. And it came to pass that every one who sought the LORD went out unto the tabernacle of the testimony, which was outside the camp."},{"num":8,"verse":"And it came to pass when Moses would go out unto the tabernacle, that all the people would rise up and stand each one at the door of their tent, with their gaze following Moses until he was gone into the tabernacle."},{"num":9,"verse":"And when Moses would enter into the tabernacle, the pillar of cloud would descend and stand at the door of the tabernacle, and the LORD would talk with Moses."},{"num":10,"verse":"And when all the people saw the cloudy pillar stand at the tabernacle door, all the people would rise up, each one in the door of their tent, and worship."},{"num":11,"verse":"And the LORD would speak unto Moses face to face, as anyone would speak unto their friend. And he would turn again into the camp, but his servant Joshua, the son of Nun, a young man, did not depart out of the tabernacle."},{"num":12,"verse":"¶ And Moses said unto the LORD, See, thou sayest unto me, Bring this people out, and thou hast not let me know whom thou wilt send with me. Yet thou saith, I know thee by name, and thou hast also found grace in my sight."},{"num":13,"verse":"Now therefore, I pray thee, if I have found grace in thy sight, show me now thy way, that I may know thee, that I may find grace in thy sight; and consider that this nation is thy people."},{"num":14,"verse":"And he said, My presence {Heb. faces} shall go with thee, and I will give thee rest."},{"num":15,"verse":"And he said unto him, If thy presence {Heb. faces} is not to go before us, do not bring us out of here."},{"num":16,"verse":"For in what shall it be known here that I have found grace in thy sight, I and thy people, but in that thou goest with us, and I and thy people will be separated from all the peoples that are upon the face of the earth?"},{"num":17,"verse":"And the LORD said unto Moses, I will do this thing also that thou hast spoken because thou hast found grace in my sight, and I have known thee by name."},{"num":18,"verse":"Then he said, I beseech thee, show me thy glory."},{"num":19,"verse":"And he replied, I will make all my goodness pass before thee, and I will proclaim the name that I AM before thee; and I will have mercy on whom I will have mercy and will show clemency on whom I will show clemency."},{"num":20,"verse":"He further said, Thou canst not see my face; for no man shall see me and live."},{"num":21,"verse":"And the LORD continued saying, Behold, there is a place by me, and thou shalt stand upon the rock;"},{"num":22,"verse":"and it shall come to pass while my glory passes by, that I will put thee in a cleft of the rock and will cover thee with my hand until I have passed by."},{"num":23,"verse":"Then I will take away my hand, and thou shalt see my back parts, but my face {Heb. faces} shall not be seen."}]