[{"header":"The Command to Leave Sinai"},{"num":33,"verse":"Then the Lord said to Moses, “Depart, go up from here, you and the people whom you have brought up from the land of Egypt, to the land which I swore to Abraham, Isaac, and Jacob, saying, ‘To your descendants I will give it.’ "},{"num":2,"verse":"I will send an angel before you, and I will drive out the Canaanite, the Amorite, the Hittite, the Perizzite, the Hivite, and the Jebusite. "},{"num":3,"verse":"Go up to a land flowing with milk and honey. However, I will not go up in your midst, for you are a stiff-necked people, and I might destroy you on the way.”"},{"num":4,"verse":"When the people heard this disturbing word, they mourned. And no one put on his ornaments. "},{"num":5,"verse":"For the Lord had said to Moses, “Say to the children of Israel, ‘You are a stiff-necked people. If I went up among you for one moment, I might destroy you. Now therefore, take off your ornaments, so that I may know what I will do to you.’ ” "},{"num":6,"verse":"The children of Israel stripped themselves of their ornaments by Mount Horeb."},{"header":"The Tent of Meeting"},{"num":7,"verse":"Moses took the tent and pitched it outside the camp, a good distance from the camp, and called it the tent of meeting. And anyone who sought the Lord would go out to the tent of meeting which was outside the camp. "},{"num":8,"verse":"So whenever Moses went out to the tent, all the people would rise up and stand, every man at the entrance of his tent, and gaze after Moses until he entered the tent. "},{"num":9,"verse":"And whenever Moses entered the tent, the pillar of cloud descended and stood at the entrance of the tent, and the Lord spoke with Moses. "},{"num":10,"verse":"When all the people saw the pillar of cloud standing at the entrance of the tent, all the people rose up and worshipped, every man at the entrance of his tent. "},{"num":11,"verse":"The Lord spoke to Moses face to face, just as a man speaks to his friend. When he returned to the camp, his servant Joshua, the son of Nun, a young man, did not depart from the tent."},{"header":"The Glory of God"},{"num":12,"verse":"Moses said to the Lord, “See, You say to me, ‘Bring up this people,’ but You have not let me know whom You will send with me. Yet You have said, ‘I know you by name, and you have also found grace in My sight.’ "},{"num":13,"verse":"Now therefore, I pray You, if I have found favor in Your sight, show me now Your way, that I may know You, and that I may find favor in Your sight. Consider too that this nation is Your people.”"},{"num":14,"verse":"And He said, “My Presence will go with you, and I will give you rest.”"},{"num":15,"verse":"Then he said to Him, “If Your Presence does not go with us, do not bring us up from here. "},{"num":16,"verse":"For how will it be known that I have found favor in Your sight, I and Your people? Is it not by Your going with us, so that we will be distinguished, I and Your people, from all the people who are on the face of the earth?”"},{"num":17,"verse":"The Lord said to Moses, “I will do this thing of which you have spoken, for you have found favor in My sight, and I know you by name.”"},{"num":18,"verse":"Then Moses said, “I pray, show me Your glory.”"},{"num":19,"verse":"Then He said, “I will make all My goodness pass before you, and I will proclaim the name of the Lord before you. I will be gracious to whom I will be gracious and will show mercy on whom I will show mercy.” "},{"num":20,"verse":"He said, “You cannot see My face, for no man can see Me and live.”"},{"num":21,"verse":"Then the Lord said, “Indeed, there is a place by Me. You must stand on the rock. "},{"num":22,"verse":"While My glory passes by, I will put you in a cleft of the rock and will cover you with My hand while I pass by. "},{"num":23,"verse":"Then I will take away My hand, and you will see My back, but My face may not be seen.”"}]