[{"header":"Chapter 33"},{"num":1,"verse":"The Lord spoke to Moses: Go! You and the people whom you have brought up from the land of Egypt are to go up from here to the land about which I swore to Abraham, Isaac, and Jacob: I will give it to your descendants. "},{"num":2,"verse":"Driving out the Canaanites, Amorites, Hittites, Perizzites, Hivites and Jebusites, I will send an angel before you "},{"num":3,"verse":"to a land flowing with milk and honey. But I myself will not go up in your company, because you are a stiff-necked people; otherwise I might consume you on the way. "},{"num":4,"verse":"When the people heard this painful news, they mourned, and no one wore any ornaments."},{"num":5,"verse":"The Lord spoke to Moses: Speak to the Israelites: You are a stiff-necked people. Were I to go up in your company even for a moment, I would destroy you. Now off with your ornaments! Let me think what to do with you. "},{"num":6,"verse":"So, from Mount Horeb onward, the Israelites stripped off their ornaments."},{"num":7,"verse":"Moses’ Intimacy with God. Moses used to pitch a tent outside the camp at some distance. It was called the tent of meeting. Anyone who wished to consult the Lord would go to the tent of meeting outside the camp. "},{"num":8,"verse":"Whenever Moses went out to the tent, the people would all rise and stand at the entrance of their own tents, watching Moses until he entered the tent. "},{"num":9,"verse":"As Moses entered the tent, the column of cloud would come down and stand at its entrance while the Lord spoke with Moses. "},{"num":10,"verse":"On seeing the column of cloud stand at the entrance of the tent, all the people would rise and bow down at the entrance of their own tents. "},{"num":11,"verse":"The Lord used to speak to Moses face to face, as a person speaks to a friend. Moses would then return to the camp, but his young assistant, Joshua, son of Nun, never left the tent. "},{"num":12,"verse":"Moses said to the Lord, “See, you are telling me: Lead this people. But you have not let me know whom you will send with me. Yet you have said: You are my intimate friend; You have found favor with me. "},{"num":13,"verse":"Now, if I have found favor with you, please let me know your ways so that, in knowing you, I may continue to find favor with you. See, this nation is indeed your own people. "},{"num":14,"verse":"The Lord answered: I myself will go along, to give you rest. "},{"num":15,"verse":"Moses replied, “If you are not going yourself, do not make us go up from here. "},{"num":16,"verse":"For how can it be known that I and your people have found favor with you, except by your going with us? Then we, your people and I, will be singled out from every other people on the surface of the earth.” "},{"num":17,"verse":"The Lord said to Moses: This request, too, which you have made, I will carry out, because you have found favor with me and you are my intimate friend."},{"num":18,"verse":"Then Moses said, “Please let me see your glory!” "},{"num":19,"verse":"The Lord answered: I will make all my goodness pass before you, and I will proclaim my name, “Lord,” before you; I who show favor to whom I will, I who grant mercy to whom I will. "},{"num":20,"verse":"But you cannot see my face, for no one can see me and live. "},{"num":21,"verse":"Here, continued the Lord, is a place near me where you shall station yourself on the rock. "},{"num":22,"verse":"When my glory passes I will set you in the cleft of the rock and will cover you with my hand until I have passed by. "},{"num":23,"verse":"Then I will remove my hand, so that you may see my back; but my face may not be seen."}]