[{"num":33,"verse":"The Lord said to Moses, “Lead these people you brought from Egypt to the land I promised Abraham, Isaac, and Jacob; for I said, ‘I will give this land to your descendants.’ "},{"num":2,"verse":"I will send an Angel before you to drive out the Canaanites, Amorites, Hittites, Perizzites, Hivites, and Jebusites. "},{"num":3,"verse":"It is a land ‘flowing with milk and honey’; but I will not travel among you, for you are a stubborn, unruly people, and I would be tempted to destroy you along the way.”"},{"num":4,"verse":"When the people heard these stern words, they went into mourning and stripped themselves of their jewelry and ornaments."},{"num":5,"verse":"For the Lord had told Moses to tell them, “You are an unruly, stubborn people. If I were there among you for even a moment, I would exterminate you. Remove your jewelry and ornaments until I decide what to do with you.” "},{"num":6,"verse":"So, after that, they wore no jewelry."},{"num":7,"verse":"Moses always erected the sacred tent (the “Tent for Meeting with God,” he called it) far outside the camp, and everyone who wanted to consult with Jehovah went out there."},{"num":8,"verse":"Whenever Moses went to the Tabernacle, all the people, when they saw it, stood and would rise and stand in their tent doors. "},{"num":9,"verse":"As he entered, the pillar of cloud would come down and stand at the door while the Lord spoke with Moses. "},{"num":10,"verse":"Then all the people worshiped from their tent doors, bowing low to the pillar of cloud. "},{"num":11,"verse":"Inside the tent the Lord spoke to Moses face-to-face, as a man speaks to his friend. Afterwards Moses would return to the camp, but the young man who assisted him, Joshua (son of Nun), stayed behind in the Tabernacle."},{"num":12,"verse":"Moses talked there with the Lord and said to him, “You have been telling me, ‘Take these people to the Promised Land,’ but you haven’t told me whom you will send with me. You say you are my friend, and that I have found favor before you; "},{"num":13,"verse":"please, if this is really so, guide me clearly along the way you want me to travel so that I will understand you and walk acceptably before you. For don’t forget that this nation is your people.”"},{"num":14,"verse":"And the Lord replied, “I myself will go with you and give you success.”"},{"num":15,"verse":"For Moses had said, “If you aren’t going with us, don’t let us move a step from this place. "},{"num":16,"verse":"If you don’t go with us, who will ever know that I and my people have found favor with you, and that we are different from any other people upon the face of the earth?”"},{"num":17,"verse":"And the Lord had replied to Moses, “Yes, I will do what you have asked, for you have certainly found favor with me, and you are my friend.”"},{"num":18,"verse":"Then Moses asked to see God’s glory."},{"num":19,"verse":"The Lord replied, “I will make my goodness pass before you, and I will announce to you the meaning of my name Jehovah, the Lord. I show kindness and mercy to anyone I want to. "},{"num":20,"verse":"But you may not see the glory of my face, for man may not see me and live. "},{"num":21,"verse":"However, stand here on this rock beside me. "},{"num":22,"verse":"And when my glory goes by, I will put you in the cleft of the rock and cover you with my hand until I have passed. "},{"num":23,"verse":"Then I will remove my hand, and you shall see my back but not my face.”"}]