[{"header":"The Great Day of Forgiveness"},{"num":1,"verse":"Two of Aaron’s sons had already lost their lives for disobeying the Lord, so the Lord told Moses to say to Aaron:"},{"num":3,"verse":"Before entering this most holy place, you must offer a bull as a sacrifice for your sins and a ram as a sacrifice to please me. "},{"num":4,"verse":"You will take a bath and put on the sacred linen clothes, including the underwear, the robe, the sash, and the turban. "},{"num":5,"verse":"Then the community of Israel will bring you a ram and two goats, both of them males. The goats are to be used as sacrifices for sin, and the ram is to be used as a sacrifice to please me."},{"num":6,"verse":"Aaron, you must offer the bull as a sacrifice of forgiveness for your own sins and for the sins of your family. "},{"num":7,"verse":"Then you will lead the two goats into my presence at the front of the sacred tent, "},{"num":8,"verse":"where I will show you which goat will be sacrificed to me and which one will be sent into the desert to the demon Azazel. "},{"num":9,"verse":"After you offer the first goat as a sacrifice for sin, "},{"num":10,"verse":"the other one must be presented to me alive, before you send it into the desert to take away the sins of the people."},{"num":11,"verse":"You must offer the bull as a sacrifice to ask forgiveness for your own sins and for the sins of your family. "},{"num":12,"verse":"Then you will take a fire pan of live coals from the bronze altar, together with two handfuls of finely ground incense, into the most holy place. "},{"num":13,"verse":"There you will present them to me by placing the incense on the coals, so that the place of mercy will be covered with a cloud of smoke. Do this, or you will die right there! "},{"num":14,"verse":"Next, use a finger to sprinkle some of the blood on the place of mercy, which is on the lid of the sacred chest; then sprinkle blood seven times in front of the chest."},{"num":15,"verse":"Aaron, you must next sacrifice the goat for the sins of the people, and you must sprinkle its blood inside the most holy place, just as you did with the blood of the bull. "},{"num":16,"verse":"By doing this, you will take away the sins that make both the most holy place and the people of Israel unclean. Do the same for the sacred tent, which is here among the people. "},{"num":17,"verse":"Only you are allowed in the sacred tent from the time you enter until the time you come out. "},{"num":18,"verse":"After leaving the tent, you will purify the bronze altar by smearing each of its four corners with some of the blood from the bull and from the goat. "},{"num":19,"verse":"Use a finger to sprinkle the altar seven times with the blood, and it will be completely clean from the sins of the people."},{"num":20,"verse":"After you have purified the most holy place, the sacred tent, and the bronze altar, you must bring the live goat to the front of the tent. "},{"num":21,"verse":"There you will lay your hands on its head, while confessing every sin the people have committed, and you will appoint someone to lead the goat into the desert, so that it can take away their sins. "},{"num":22,"verse":"Finally, this goat that carries the heavy burden of Israel’s sins must be released deep in the desert."},{"num":23,"verse":"Aaron, after this you must go inside the sacred tent, take a bath, put on your regular priestly clothes, and leave there the clothes you put on before entering the most holy place. Then you will come out and offer sacrifices to please me and sacrifices for your sins and for the sins of the people. "},{"num":25,"verse":"The fat from these sacrifices for sin must be sent up in smoke on the bronze altar."},{"num":26,"verse":"The one who led the goat into the desert and sent it off to the demon Azazel must take a bath and wash his clothes before coming back into camp. "},{"num":27,"verse":"The remains of the bull and the goat whose blood was taken into the most holy place must be taken outside the camp and burned. "},{"num":28,"verse":"And whoever does this must take a bath and change clothes before coming back into camp."},{"num":29,"verse":"On the tenth day of the seventh month of each year, you must go without eating to show sorrow for your sins, and no one, including foreigners who live among you, is allowed to work. "},{"num":30,"verse":"This is the day on which the sacrifice for the forgiveness of your sins will be made in my presence, "},{"num":31,"verse":"and from now on, it must be celebrated each year. Go without eating and make this a day of complete rest just like the Sabbath. "},{"num":32,"verse":"The high priest must offer the sacrifices for cleansing from sin, while wearing the sacred linen clothes. "},{"num":33,"verse":"He will offer these sacrifices for the most holy place, the sacred tent, the bronze altar, all the priests, and for the whole community. "},{"num":34,"verse":"You must celebrate this day each year—it is the Great Day of Forgiveness for all the sins of the people of Israel."}]