[{"num":16,"verse":"¶ And the LORD spoke unto Moses after the death of the two sons of Aaron, when they came near before the LORD and died;"},{"num":2,"verse":"and the LORD said unto Moses, Speak unto Aaron, thy brother, that he not enter at all times into the sanctuary inside the veil before the seat of reconciliation, which is upon the ark, that he not die; for I will appear in the cloud above the seat of reconciliation."},{"num":3,"verse":"Thus shall Aaron come into the holy place: with a young bullock as sin and a ram as a burnt offering."},{"num":4,"verse":"He shall put on the holy linen coat, and he shall have the linen underwear upon his flesh and shall be girded with a linen girdle, and with the linen mitre shall he cover himself. These are holy garments; and he shall wash his flesh with water and put them on."},{"num":5,"verse":"¶ And he shall take of the congregation of the sons of Israel two he goats as the sin and one ram as a burnt offering."},{"num":6,"verse":"And Aaron shall cause the bullock of his sin to be brought, and make reconciliation for himself and for his house."},{"num":7,"verse":"After that, he shall take the two goats and present them before the LORD at the door of the tabernacle of the testimony."},{"num":8,"verse":"And Aaron shall cast lots upon the two he goats, one lot for the LORD and the other lot for Azazel. {Heb. entire removal}"},{"num":9,"verse":"And Aaron shall cause the he goat upon which the LORD’s lot fell to be brought and offer him for the sin."},{"num":10,"verse":"But the he goat on which the lot fell for Azazel shall be presented alive before the LORD, to make the reconciliation upon him and to send him to Azazel into the wilderness."},{"num":11,"verse":"And Aaron shall cause the bullock of his own sin to be brought and shall make the reconciliation for himself and for his house and shall kill the bullock of his own sin."},{"num":12,"verse":"After that he shall take the censer full of burning coals of fire from off the altar before the LORD and his hands full of aromatic incense beaten small and bring it inside the veil."},{"num":13,"verse":"And he shall put the incense upon the fire before the LORD, and the cloud of the incense shall cover the seat of reconciliation that is upon the testimony, and he shall not die."},{"num":14,"verse":"Then he shall take of the blood of the bullock and sprinkle it with his finger towards the seat of reconciliation eastward; towards the seat of reconciliation he shall sprinkle of the blood with his finger seven times."},{"num":15,"verse":"¶ After that, he shall kill the goat of the sin of the people and bring its blood inside the veil and do with that blood as he did with the blood of the bullock and sprinkle it upon the seat of reconciliation and before the seat of reconciliation;"},{"num":16,"verse":"and he shall cleanse the sanctuary of the uncleanness of the sons of Israel and of their rebellions and of all their sins; in the same manner so shall he do for the tabernacle of the testimony, which dwells among them in the midst of their uncleanness."},{"num":17,"verse":"And no man shall be in the tabernacle of the testimony when he enters in to make reconciliation in the sanctuary until he comes out and has made reconciliation for himself and for his household and for all the congregation of Israel."},{"num":18,"verse":"And he shall go out unto the altar that is before the LORD and reconcile it and shall take of the blood of the bullock and of the blood of the he goat and put it upon the horns of the altar round about."},{"num":19,"verse":"And he shall sprinkle of the blood upon it with his finger seven times and cleanse it and sanctify it from the uncleanness of the sons of Israel."},{"num":20,"verse":"¶ And when he has made an end of reconciling the sanctuary and the tabernacle of the testimony and the altar, he shall cause the live he goat to be brought;"},{"num":21,"verse":"and Aaron shall lay both his hands upon the head of the live he goat and confess over it all the iniquities of the sons of Israel and all their rebellions and all their sins, putting them thus upon the head of the he goat and shall send him away into the wilderness by the hand of a man prepared for this;"},{"num":22,"verse":"and that he goat shall bear upon itself all their iniquities unto an uninhabitable land; and he shall send the he goat into the wilderness."},{"num":23,"verse":"After that, Aaron shall come into the tabernacle of the testimony and shall put off the linen garments, which he put on to enter into the sanctuary, and shall put them there."},{"num":24,"verse":"Then he shall wash his flesh with water in the holy place and put on his garments and come forth after that and make his burnt offering and the burnt offering of the people and make reconciliation for himself and for the people."},{"num":25,"verse":"And the fat of the sin he shall incense upon the altar."},{"num":26,"verse":"And he that took the he goat to Azazel shall wash his clothes and bathe his flesh with water and afterward come into the camp."},{"num":27,"verse":"And he shall take outside the camp the bullock of the sin and the goat of the sin, whose blood was brought in to make the reconciliation in the sanctuary; and they shall burn in the fire their skins and their flesh and their dung."},{"num":28,"verse":"And he that burns them shall wash his clothes and bathe his flesh in water, and afterward he shall come into the camp."},{"num":29,"verse":"¶ And you shall hold this as a perpetual statute: In the seventh month, on the tenth day of the month, ye shall afflict your souls and do no work at all, whether it is a natural of your own country or a stranger that sojourns among you;"},{"num":30,"verse":"for on that day he shall reconcile you to cleanse you that ye may be clean from all your sins before the LORD."},{"num":31,"verse":"It shall be a sabbath of rest unto you, and ye shall afflict your souls, by a perpetual statute."},{"num":32,"verse":"And the reconciliation shall be made by the priest who is anointed and whose hand has been filled to be priest in the place of his father; and he shall put on the linen clothes, the holy garments;"},{"num":33,"verse":"and he shall reconcile the holy sanctuary and reconcile the tabernacle of the testimony; he shall also reconcile the altar and the priests and all the people of the congregation."},{"num":34,"verse":"And you shall hold this as a perpetual statute to reconcile the sons of Israel of all their sins once a year. And Moses did as the LORD commanded him."}]