[{"num":16,"verse":"Then Adonai spoke to Moses after the death of the two sons of Aaron, when they approached the presence of Adonai and died. "},{"num":2,"verse":"Adonai said to Moses, “Tell Aaron your brother not to come at just any time into the Holiest Place behind the curtain—before the atonement cover which is on the Ark—so that he would not die. For I will be appearing in the cloud over the atonement cover."},{"header":"Yom Kippur Service"},{"num":3,"verse":"“In this way should Aaron come into the Sanctuary: with a young bull for a sin offering and a ram for a burnt offering. "},{"num":4,"verse":"He is to put on the holy linen garment, have the linen undergarments on his body, put on the linen sash, and wear the linen turban—they are the holy garments. He should bathe his body in water, and put them on."},{"num":5,"verse":"“Then he is to take from the congregation of Bnei-Yisrael two he-goats for a sin offering and one ram for a burnt offering. "},{"num":6,"verse":"Then Aaron is to offer the bull for the sin offering which is for himself and make atonement for himself and his house. "},{"num":7,"verse":"Then he is take the two goats and present them before Adonai at the entrance of the Tent of Meeting. "},{"num":8,"verse":"Aaron will then cast lots for the two goats—one lot for Adonai, and the other lot for the scapegoat. "},{"num":9,"verse":"Aaron is to present the goat on which the lot for Adonai fell and make it a sin offering. "},{"num":10,"verse":"But the goat upon which the lot for the scapegoat fell is to be presented alive before Adonai, to make atonement upon it, by sending it away as the scapegoat into the wilderness."},{"num":11,"verse":"“Also Aaron is to present the bull of the sin offering which is for himself and so make atonement for himself and his house. He is to slaughter the bull of the sin offering which is for himself."},{"num":12,"verse":" He is to take a firepan full of coals of fire from off the altar before Adonai plus two handfuls of sweet powdered incense and bring it within the curtain. "},{"num":13,"verse":"Then he is to put the incense on the fire before Adonai, so that the cloud of the incense may cover the atonement cover that is on the Ark, so that he would not die. "},{"num":14,"verse":"He is then to take some of the blood of the bull and sprinkle it with his finger on the atonement cover, on the east side. Before the atonement cover he is to sprinkle some of the blood with his finger seven times."},{"num":15,"verse":"“Then he is to slaughter the goat of the sin offering which is for the people, bring its blood behind the curtain, and do with its as he did with the blood of the bull—sprinkle it upon the atonement cover, and before the atonement cover."},{"num":16,"verse":" So he is to make atonement for the Holy Place, because of the uncleanness of Bnei-Yisrael and because of their transgressions, all their sins. He is to do the same for the Tent of Meeting, which dwells with them in the midst of their impurities. "},{"num":17,"verse":"No one is to be in the Tent of Meeting when he enters to make atonement in the Holy Place until he comes out, and has made atonement for himself and for his household, and for all the assembly of Israel."},{"num":18,"verse":"“Then he is to go out to the altar that is before Adonai and make atonement for it. He is to take some of the bull’s blood and some of the goat’s blood and dab it around on the horns of the altar. "},{"num":19,"verse":"He is to sprinkle some of the blood on it with his finger seven times, and cleanse it, and consecrate it from the uncleanness of Bnei-Yisrael."},{"num":20,"verse":"“When he has finished atoning for the Holy Place, the Tent of Meeting and the altar, then he is to present the live goat. "},{"num":21,"verse":"Aaron shall lay both his hands on the head of the live goat and confess over it all the iniquities of Bnei-Yisrael and all their transgressions, all their sins. He should place them on the head of the goat and send it away into the wilderness by the hand of a man who is in readiness. "},{"num":22,"verse":"The goat will carry all their iniquities by itself into a solitary land and he is to leave the goat in the wilderness."},{"num":23,"verse":"“Then Aaron is to come into the Tent of Meeting, take off the linen garments that he put on when he went into the Holy Place, and leave them there. "},{"num":24,"verse":"He is to bathe himself with water in a holy place, put on his garments, and come out to offer his burnt offering and the burnt offering of the people, to make atonement for himself and for the people."},{"num":25,"verse":"“Then he is to burn up fat of the sin offering in smoke on the altar. "},{"num":26,"verse":"The man who leaves the goat as a scapegoat is to wash his clothes and bathe his body in water. Afterward he may come into the camp."},{"num":27,"verse":"“The bull for the sin offering and the goat for the sin offering, whose blood was brought in to make atonement in the Holy Place, should be carried outside the camp, and their hides, their flesh, and their dung burned with fire."},{"num":28,"verse":" The one who burns them is to wash his clothes and bathe his body in water. Then afterward he may come into the camp."},{"num":29,"verse":"“It is to be a statute to you forever, that in the seventh month, on the tenth day of the month, you are to afflict your souls, and do no kind of work—both the native-born and the outsider dwelling among you. "},{"num":30,"verse":"For on this day atonement will be made for you, to cleanse you. From all your sins you will be clean before Adonai. "},{"num":31,"verse":"It is a Shabbat of solemn rest to you, and you are to afflict your souls. It is a statute forever. "},{"num":32,"verse":"The kohen who is anointed and who is consecrated to be kohen in his father’s place will make the atonement, and put on the linen garments, the holy garments. "},{"num":33,"verse":"He is to make atonement for the Holy Sanctuary, for the Tent of Meeting, for the altar, for the kohanim, and for all the people of the assembly."},{"num":34,"verse":"“This will be an everlasting statute for you, to make atonement for Bnei-Yisrael once in the year because of all their sins.” It was done as Adonai commanded Moses."}]