[{"num":8,"verse":"Now Elisha had said to the woman whose son he had restored to life, “Move away, you and your household, and stay wherever you can; because Adonai has called for a famine; and it will be on the land for seven years.” "},{"num":2,"verse":"The woman acted at once and did as the man of God had said — she went with her household and stayed in the land of the P’lishtim for seven years. "},{"num":3,"verse":"At the end of seven years the woman returned from the land of the P’lishtim and sought an audience with the king to claim her house and land. "},{"num":4,"verse":"The king was talking with Geichazi the servant of the man of God. “Tell me,” he said, “all the great things Elisha has done.” "},{"num":5,"verse":"Just as he was telling the king how he had restored a dead person to life, at that very moment the woman whose son he had restored to life came to the king with her claim for her house and land. Geichazi said, “My lord, king, this is the woman; and this is her son, the one Elisha restored to life.” "},{"num":6,"verse":"On being asked by the king, the woman verified it. At this, the king appointed a special officer and charged him, “Restore everything that belongs to her, including the income her fields have produced from the day she left them until now.”"},{"num":7,"verse":"Elisha went to Dammesek. Ben-Hadad the king of Aram was ill; and he was told, “The man of God has come here.” "},{"num":8,"verse":"The king said to Haza’el, “Take with you a gift, go meet the man of God and consult Adonai through him; ask if I will recover from this illness.” "},{"num":9,"verse":"Haza’el went to meet him, taking with him a gift that included everything good Dammesek had, forty camel-loads. He came, stood before him and said, “Your son Ben-Hadad king of Aram has sent me to you; he asks, ‘Will I recover from this illness?’” "},{"num":10,"verse":"Elisha answered, “Go and say to him, ‘You will surely recover’ — even though Adonai has shown me that he will surely die.” "},{"num":11,"verse":"Then the man of God fixed his gaze on him for so long that Haza’el became embarrassed; finally Elisha began to cry. "},{"num":12,"verse":"Haza’el asked, “Why is my lord crying?” He answered, “Because I know the disasters you will bring on the people of Isra’el — you will set their fortresses on fire, you will kill their young men with the sword, you will dash their little ones to pieces and rip their pregnant women apart.” "},{"num":13,"verse":"Haza’el said, “But what is your servant? Nothing but a dog! How could he do anything of such magnitude?” Elisha answered, “Adonai has shown me that you will be king over Aram.”"},{"num":14,"verse":"Then he left Elisha and returned to his master, who asked him, “What did Elisha say to you?” “He told me you would surely recover.” "},{"num":15,"verse":"The next day he took a blanket, dipped it in water and spread it on his face, so that he died; and Haza’el took his place as king."},{"num":16,"verse":"It was when Yoram the son of Ach’av king of Isra’el was in the fifth year of his reign that Y’horam the son of Y’hoshafat began his rule over Y’hudah. "},{"num":17,"verse":"He was thirty-two years old when he began to rule, and he ruled eight years in Yerushalayim. "},{"num":18,"verse":"He lived after the example of the kings of Isra’el, as did the house of Ach’av; because he had married Ach’av’s daughter; he did what was evil from Adonai’s perspective. "},{"num":19,"verse":"However, Adonai was unwilling to destroy Y’hudah, because of his servant David; inasmuch as he had promised to give him and his children a lamp that would burn forever."},{"num":20,"verse":"During his time Edom revolted against Y’hudah and set up its own king. "},{"num":21,"verse":"In response, Yoram crossed to Tza‘ir with all his chariots. At night he and his chariot commanders set out and attacked Edom who had surrounded him; then the people fled to their tents. "},{"num":22,"verse":"Nevertheless, since that day Edom has remained free of Y’hudah’s domination. Livnah revolted at the same time. "},{"num":23,"verse":"Other activities of Yoram and all his accomplishments are recorded in the Annals of the Kings of Y’hudah. "},{"num":24,"verse":"Yoram slept with his ancestors and was buried with his ancestors in the City of David, and Achazyah his son took his place as king."},{"num":25,"verse":"It was in the twelfth year of Yoram the son of Ach’av king of Isra’el that Achazyah the son of Y’horam king of Y’hudah began his reign. "},{"num":26,"verse":"Achazyah was twenty-two years old when he began to rule, and he ruled for one year in Yerushalayim. His mother’s name was ‘Atalyahu the daughter of ‘Omri king of Isra’el. "},{"num":27,"verse":"He lived after the example of the house of Ach’av; he did what was evil from Adonai’s perspective, as had the house of Ach’av; for he was a son-in-law in the house of Ach’av."},{"num":28,"verse":"With Yoram the son of Ach’av he went to war against Haza’el king of Aram at Ramot-Gil‘ad, and the Aramim wounded Yoram. "},{"num":29,"verse":"King Yoram returned to Yizre‘el to be healed of the wounds which the Aramim had inflicted on him at Ramah while fighting Haza’el king of Aram. Achazyah the son of Y’horam, king of Y’hudah, went down to visit Yoram the son of Ach’av in Yizre‘el, because he was not feeling well."}]