[{"num":1,"verse":"Years before, Elisha had told the woman whose son he had brought to life, “Leave here and go, you and your family, and live someplace else. God has ordered a famine in the land; it will last for seven years.” The woman did what the Holy Man told her and left. She and her family lived as aliens in the country of Philistia for seven years. Then, when the seven years were up, the woman and her family came back. She went directly to the king and asked for her home and farm."},{"num":4,"verse":"The king was talking with Gehazi, servant to the Holy Man, saying, “Tell me some stories of the great things Elisha did.” It so happened that as he was telling the king the story of the dead person brought back to life, the woman whose son was brought to life showed up asking for her home and farm."},{"num":6,"verse":"The king wanted to know all about it, and so she told him the story. The king assigned an officer to take care of her, saying, “Make sure she gets everything back that’s hers, plus all profits from the farm from the time she left until now.”"},{"num":7,"verse":"Elisha traveled to Damascus. Ben-Hadad, king of Aram, was sick at the time. He was told, “The Holy Man is in town.”"},{"num":8,"verse":"The king ordered Hazael, “Take a gift with you and go meet the Holy Man. Ask God through him, ‘Am I going to recover from this sickness?’”"},{"num":9,"verse":"Hazael went and met with Elisha. He brought with him every choice thing he could think of from Damascus—forty camel-loads of items! When he arrived he stood before Elisha and said, “Your son Ben-Hadad, king of Aram, sent me here to ask you, ‘Am I going to recover from this sickness?’”"},{"num":10,"verse":"Elisha answered, “Go and tell him, ‘Don’t worry; you’ll live.’ The fact is, though—God showed me—that he’s doomed to die.” Elisha then stared hard at Hazael, reading his heart. Hazael felt exposed and dropped his eyes. Then the Holy Man wept."},{"num":12,"verse":"Hazael said, “Why does my master weep?”"},{"num":13,"verse":"Hazael said, “Am I a mongrel dog that I’d do such a horrible thing?”"},{"num":14,"verse":"Hazael left Elisha and returned to his master, who asked, “So, what did Elisha tell you?”"},{"num":15,"verse":"But the very next day, someone took a heavy quilt, soaked it in water, covered the king’s face, and suffocated him."},{"header":"Jehoram of Judah"},{"num":16,"verse":"In the fifth year of the reign of Joram son of Ahab king of Israel, Jehoram son of Jehoshaphat king of Judah became king. He was thirty-two years old when he began his rule, and was king for eight years in Jerusalem. He copied the way of life of the kings of Israel, marrying into the Ahab family and continuing the Ahab line of sin—from God’s point of view, an evil man living an evil life. But despite that, because of his servant David, God was not ready to destroy Judah. He had, after all, promised to keep a lamp burning through David’s descendants."},{"num":20,"verse":"During Jehoram’s reign, Edom revolted against Judah’s rule and set up their own king. Jehoram responded by taking his army of chariots to Zair."},{"num":22,"verse":"Edom continues in revolt against Judah right up to the present. Even little Libnah revolted at that time."},{"num":23,"verse":"The rest of the life and times of Jehoram, the record of his rule, is written in The Chronicles of the Kings of Judah. Jehoram died and was buried in the family grave in the City of David. His son Ahaziah succeeded him as king."},{"header":"Ahaziah of Judah"},{"num":25,"verse":"In the twelfth year of the reign of Joram son of Ahab king of Israel, Ahaziah son of Jehoram king of Judah began his reign. Ahaziah was twenty-two years old when he became king; he ruled only a year in Jerusalem. His mother was Athaliah, granddaughter of Omri king of Israel. He lived and ruled just like the Ahab family had done, continuing the same evil-in-God’s-sight line of sin, related by both marriage and sin to the Ahab clan."},{"num":28,"verse":"He joined Joram son of Ahab king of Israel in a war against Hazael king of Aram at Ramoth Gilead. The archers wounded Joram. Joram pulled back to Jezreel to convalesce from the injuries he had received in the fight with Hazael. Ahaziah son of Jehoram king of Judah paid a visit to Joram son of Ahab on his sickbed in Jezreel."}]