[{"header":"The Shunammite’s land restored"},{"num":8,"verse":"Now Elisha had said to the woman whose son he had restored to life, ‘Go away with your family and stay for a while wherever you can, because the Lord has decreed a famine in the land that will last seven years.’ "},{"num":2,"verse":"The woman proceeded to do as the man of God said. She and her family went away and stayed in the land of the Philistines for seven years."},{"num":3,"verse":"At the end of the seven years she came back from the land of the Philistines and went to appeal to the king for her house and land. "},{"num":4,"verse":"The king was talking to Gehazi, the servant of the man of God, and had said, ‘Tell me about all the great things Elisha has done.’ "},{"num":5,"verse":"Just as Gehazi was telling the king how Elisha had restored the dead to life, the woman whose son Elisha had brought back to life came to appeal to the king for her house and land."},{"num":6,"verse":"The king asked the woman about it, and she told him."},{"header":"Hazael murders Ben-Hadad"},{"num":7,"verse":"Elisha went to Damascus, and Ben-Hadad king of Aram was ill. When the king was told, ‘The man of God has come all the way up here,’ "},{"num":8,"verse":"he said to Hazael, ‘Take a gift with you and go to meet the man of God. Consult the Lord through him; ask him, “Will I recover from this illness?”’"},{"num":9,"verse":"Hazael went to meet Elisha, taking with him as a gift forty camel-loads of all the finest wares of Damascus. He went in and stood before him, and said, ‘Your son Ben-Hadad king of Aram has sent me to ask, “Will I recover from this illness?”’"},{"num":10,"verse":"Elisha answered, ‘Go and say to him, “You will certainly recover.” Nevertheless, the Lord has revealed to me that he will in fact die.’ "},{"num":11,"verse":"He stared at him with a fixed gaze until Hazael was embarrassed. Then the man of God began to weep."},{"num":12,"verse":"‘Why is my lord weeping?’ asked Hazael."},{"num":13,"verse":"Hazael said, ‘How could your servant, a mere dog, accomplish such a feat?’"},{"num":14,"verse":"Then Hazael left Elisha and returned to his master. When Ben-Hadad asked, ‘What did Elisha say to you?’ Hazael replied, ‘He told me that you would certainly recover.’ "},{"num":15,"verse":"But the next day he took a thick cloth, soaked it in water and spread it over the king’s face, so that he died. Then Hazael succeeded him as king."},{"header":"Jehoram king of Judah"},{"num":16,"verse":"In the fifth year of Joram son of Ahab king of Israel, when Jehoshaphat was king of Judah, Jehoram son of Jehoshaphat began his reign as king of Judah. "},{"num":17,"verse":"He was thirty-two years old when he became king, and he reigned in Jerusalem for eight years. "},{"num":18,"verse":"He followed the ways of the kings of Israel, as the house of Ahab had done, for he married a daughter of Ahab. He did evil in the eyes of the Lord. "},{"num":19,"verse":"Nevertheless, for the sake of his servant David, the Lord was not willing to destroy Judah. He had promised to maintain a lamp for David and his descendants for ever."},{"num":20,"verse":"In the time of Jehoram, Edom rebelled against Judah and set up its own king. "},{"num":21,"verse":"So Jehoram went to Zair with all his chariots. The Edomites surrounded him and his chariot commanders, but he rose up and broke through by night; his army, however, fled back home. "},{"num":22,"verse":"To this day Edom has been in rebellion against Judah. Libnah revolted at the same time."},{"num":23,"verse":"As for the other events of Jehoram’s reign, and all he did, are they not written in the book of the annals of the kings of Judah? "},{"num":24,"verse":"Jehoram rested with his ancestors and was buried with them in the City of David. And Ahaziah his son succeeded him as king."},{"header":"Ahaziah king of Judah"},{"num":25,"verse":"In the twelfth year of Joram son of Ahab king of Israel, Ahaziah son of Jehoram king of Judah began to reign. "},{"num":26,"verse":"Ahaziah was twenty-two years old when he became king, and he reigned in Jerusalem for one year. His mother’s name was Athaliah, a granddaughter of Omri king of Israel. "},{"num":27,"verse":"He followed the ways of the house of Ahab and did evil in the eyes of the Lord, as the house of Ahab had done, for he was related by marriage to Ahab’s family."},{"num":28,"verse":"Ahaziah went with Joram son of Ahab to war against Hazael king of Aram at Ramoth Gilead. The Arameans wounded Joram; "},{"num":29,"verse":"so King Joram returned to Jezreel to recover from the wounds the Arameans had inflicted on him at Ramoth in his battle with Hazael king of Aram."}]