[{"header":"The Tribes of Judah and Simeon Fight the Canaanites"},{"num":1,"verse":"After the death of Joshua, the Israelites asked the Lord, “Which of our tribes should attack the Canaanites first?”"},{"num":2,"verse":"“Judah!” the Lord answered. “I’ll help them take the land.”"},{"num":3,"verse":"The people of Judah went to their relatives, the Simeon tribe, and said, “Canaanites live in the land God gave us. Help us fight them, and we will help you.”"},{"num":4,"verse":"Together they attacked an army of ten thousand Canaanites and Perizzites at Bezek, and the Lord helped Judah defeat them. During the battle, Judah’s army found out where the king of Bezek was, and they attacked there. "},{"num":6,"verse":"Bezek tried to escape, but soldiers from Judah caught him. They cut off his thumbs and big toes, "},{"num":7,"verse":"and he said, “I’ve cut off the thumbs and big toes of seventy kings and made those kings crawl around under my table for scraps of food. Now God is paying me back.”"},{"num":8,"verse":"They attacked Jerusalem, captured it, killed everyone who lived there, and then burned it to the ground."},{"num":9,"verse":"Judah’s army fought the Canaanites who lived in the hill country, the Southern Desert, and the foothills to the west. "},{"num":10,"verse":"After that, they attacked the Canaanites who lived at Hebron, defeating the three clans called Sheshai, Ahiman, and Talmai. At that time, Hebron was called Kiriath-Arba."},{"num":11,"verse":"From Hebron, Judah’s army went to attack Debir, which at that time was called Kiriath-Sepher. "},{"num":12,"verse":"Caleb told his troops, “The man who captures Kiriath-Sepher can marry my daughter Achsah.”"},{"num":13,"verse":"Caleb’s nephew Othniel captured Kiriath-Sepher, so Caleb let him marry Achsah. Othniel was the son of Caleb’s younger brother Kenaz. "},{"num":14,"verse":"Right after the wedding, Achsah started telling Othniel that he ought to ask her father for a field. She went to see her father, and while she was getting down from her donkey, Caleb asked, “What’s bothering you?”"},{"num":15,"verse":"She answered, “I need your help. The land you gave me is in the Southern Desert, so please give me some spring-fed ponds for a water supply.”"},{"num":16,"verse":"The people who belonged to the Kenite clan were the descendants of the father-in-law of Moses. They left Jericho with the people of Judah and settled near Arad in the Southern Desert of Judah not far from the Amalekites."},{"num":17,"verse":"Judah’s army helped Simeon’s army attack the Canaanites who lived at Zephath. They completely destroyed the town and renamed it Hormah."},{"num":18,"verse":"The Lord helped the army of Judah capture Gaza, Ashkelon, Ekron, and the land near those towns. They also took the hill country. But the people who lived in the valleys had iron chariots, so Judah was not able to make them leave or to take their land."},{"num":20,"verse":"The tribe of Judah gave the town of Hebron to Caleb, as Moses had told them to do. Caleb defeated the three Anakim clans and took over the town."},{"header":"The Benjamin Tribe Does Not Capture Jerusalem"},{"num":21,"verse":"The Jebusites were living in Jerusalem, and the Benjamin tribe did not defeat them or capture the town. That’s why Jebusites still live in Jerusalem along with the people of Benjamin."},{"header":"The Ephraim and Manasseh Tribes Capture Bethel"},{"num":22,"verse":"The Ephraim and Manasseh tribes were getting ready to attack Bethel, which at that time was called Luz. And the Lord helped them when they sent spies to find out as much as they could about Bethel. "},{"num":24,"verse":"While the spies were watching the town, a man came out, and they told him, “If you show us how our army can get into the town, we will make sure that you aren’t harmed.” "},{"num":25,"verse":"The man showed them, and the two Israelite tribes attacked Bethel, killing everyone except the man and his family. The two tribes made the man and his family leave, "},{"num":26,"verse":"so they went to the land of the Hittites, where he built a town. He named the town Luz, and that is still its name."},{"header":"Israel Does Not Get Rid of All the Canaanites"},{"num":27,"verse":"Canaanites lived in the towns of Beth-Shan, Taanach, Dor, Ibleam, Megiddo, and all the villages nearby. The Canaanites were determined to stay, and the Manasseh tribe never did get rid of them. But later on, when the Israelites grew more powerful, they made slaves of the Canaanites."},{"num":29,"verse":"The Ephraim tribe did not get rid of the Canaanites who lived in Gezer, so the Canaanites lived there with Israelites all around them."},{"num":30,"verse":"The Zebulun tribe did not get rid of the Canaanites who lived in Kitron and Nahalol, and the Canaanites stayed there with Israelites around them. But the people of Zebulun did force the Canaanites into slave labor."},{"num":31,"verse":"The Asher tribe did not get rid of the Canaanites who lived in Acco, Sidon, Ahlab, Achzib, Helbah, Aphik, and Rehob, and the Asher tribe lived with Canaanites all around them."},{"num":33,"verse":"The Naphtali tribe did not get rid of the Canaanites who lived in Beth-Shemesh and Beth-Anath, but they did force the Canaanites into slave labor. The Naphtali tribe lived with Canaanites around them."},{"num":34,"verse":"The Amorites were strong enough to keep the tribe of Dan from settling in the valleys, so Dan had to stay in the hill country."},{"num":35,"verse":"The Amorites on Mount Heres and in Aijalon and Shaalbim were also determined to stay. Later on, as Ephraim and Manasseh grew more powerful, they forced those Amorites into slave labor."},{"header":"The Amorite-Edomite Border"},{"num":36,"verse":"The old Amorite-Edomite border used to go from Sela through Scorpion Pass into the hill country."}]