[{"header":"The Tribes of Judah and Simeon Capture Adonibezek"},{"num":1,"verse":"After Joshua's death the people of Israel asked the Lord, “Which of our tribes should be the first to go and attack the Canaanites?”"},{"num":2,"verse":"The Lord answered, “The tribe of Judah will go first. I am giving them control of the land.”"},{"num":3,"verse":"The people of Judah said to the people of Simeon, “Go with us into the territory assigned to us, and we will fight the Canaanites together. Then we will go with you into the territory assigned to you.” So the tribes of Simeon "},{"num":4,"verse":"and Judah went into battle together. The Lord gave them victory over the Canaanites and the Perizzites, and they defeated ten thousand men at Bezek. "},{"num":5,"verse":"They found Adonibezek there and fought him. "},{"num":6,"verse":"He ran away, but they chased him, caught him, and cut off his thumbs and big toes. "},{"num":7,"verse":"Adonibezek said, “Seventy kings with their thumbs and big toes cut off have picked up scraps under my table. God has now done to me what I did to them.” He was taken to Jerusalem, where he died."},{"header":"The Tribe of Judah Conquers Jerusalem and Hebron"},{"num":8,"verse":"The people of Judah attacked Jerusalem and captured it. They killed its people and set fire to the city. "},{"num":9,"verse":"After this they went on to fight the Canaanites who lived in the hill country, in the foothills, and in the dry country to the south. "},{"num":10,"verse":"They marched against the Canaanites living in the city of Hebron, which used to be called Kiriath Arba. There they defeated the clans of Sheshai, Ahiman, and Talmai."},{"header":"Othniel Conquers the City of Debir(A)"},{"num":11,"verse":"From there the men of Judah marched against the city of Debir, at that time called Kiriath Sepher. "},{"num":12,"verse":"One of them, called Caleb, said, “I will give my daughter Achsah in marriage to the man who succeeds in capturing Kiriath Sepher.” "},{"num":13,"verse":"Othniel, the son of Caleb's younger brother Kenaz, captured the city, so Caleb gave him his daughter Achsah in marriage. "},{"num":14,"verse":"On the wedding day Othniel urged her to ask her father for a field. She got down from her donkey, and Caleb asked her what she wanted. "},{"num":15,"verse":"She answered, “I want some water holes. The land you have given me is in the dry country.” So Caleb gave her the upper and lower springs."},{"header":"The Victories of the Tribes of Judah and Benjamin"},{"num":16,"verse":"The descendants of Moses' father-in-law, the Kenite, went on with the people of Judah from Jericho, the city of palm trees, into the barren country south of Arad in Judah. There they settled among the Amalekites. "},{"num":17,"verse":"The people of Judah went with the people of Simeon, and together they defeated the Canaanites who lived in the city of Zephath. They put a curse on the city, destroyed it, and named it Hormah. "},{"num":18,"verse":"The Lord helped the people of Judah, and they took possession of the hill country. But they did not capture Gaza, Ashkelon, or Ekron, with their surrounding territories. These people living along the coast had iron chariots, and so the people of Judah were not able to drive them out. "},{"num":20,"verse":"As Moses had commanded, Hebron was given to Caleb, who drove out of the city the three clans descended from Anak. "},{"num":21,"verse":"But the people of the tribe of Benjamin did not drive out the Jebusites living in Jerusalem, and the Jebusites have continued to live there with the people of Benjamin ever since."},{"header":"The Tribes of Ephraim and Manasseh Conquer Bethel"},{"num":22,"verse":"The tribes of Ephraim and Manasseh went to attack the city of Bethel, at that time called Luz. The Lord helped them. They sent spies to the city, "},{"num":24,"verse":"who saw a man leaving and said to him, “Show us how to get into the city, and we won't hurt you.” "},{"num":25,"verse":"So he showed them, and the people of Ephraim and Manasseh killed everyone in the city, except this man and his family. "},{"num":26,"verse":"He later went to the land of the Hittites, built a city there, and named it Luz, which is still its name."},{"header":"People Who Were Not Driven Out by the Israelites"},{"num":27,"verse":"The tribe of Manasseh did not drive out the people living in the cities of Beth Shan, Taanach, Dor, Ibleam, Megiddo, and the nearby towns; the Canaanites continued to live there. "},{"num":28,"verse":"When the Israelites became stronger, they forced the Canaanites to work for them, but still they did not drive them all out."},{"num":29,"verse":"The tribe of Ephraim did not drive out the Canaanites living in the city of Gezer, and so the Canaanites continued to live there with them."},{"num":30,"verse":"The tribe of Zebulun did not drive out the people living in the cities of Kitron and Nahalal, and so the Canaanites continued to live there with them and were forced to work for them."},{"num":31,"verse":"The tribe of Asher did not drive out the people living in the cities of Acco, Sidon, Ahlab, Achzib, Helbah, Aphek, and Rehob. "},{"num":32,"verse":"The people of Asher lived with the local Canaanites, since they had not been driven out."},{"num":33,"verse":"The tribe of Naphtali did not drive out the people living in the cities of Beth Shemesh and Bethanath. The people of Naphtali lived with the local Canaanites, but forced them to work for them."},{"num":34,"verse":"The Amorites forced the people of the tribe of Dan into the hill country and did not let them come down to the plain. "},{"num":35,"verse":"The Amorites continued to live at Aijalon, Shaalbim, and Mount Heres, but the tribes of Ephraim and Manasseh kept them under their rule and forced them to work for them."},{"num":36,"verse":"North of Sela, the Edomite border ran through Akrabbim Pass."}]