[{"num":1,"verse":"Now after the mot Yehoshua it came to pass, that the Bnei Yisroel asked Hashem, saying, Who shall go up for us against the Kena’ani first, to fight against him [them]?"},{"num":2,"verse":"And Hashem said, Yehudah shall go up; hinei, I have delivered HaAretz into his yad."},{"num":3,"verse":"And Yehudah said unto Shim’on his brother, Come up with me into my goral (lot), and we will fight against the Kena’ani; and I likewise will go with thee into thy goral. So Shim’on went with him."},{"num":4,"verse":"And Yehudah went up; and Hashem delivered the Kena’ani and the Perizzi into their yad; and they struck them down at Bezek ten thousand ish."},{"num":5,"verse":"And they found Adoni-Bezek at Bezek; and they fought against him, and they struck down the Kena’ani and the Perizzi."},{"num":6,"verse":"But Adoni-Bezek fled; and they pursued after him, and caught him, and cut off his thumbs and his big toes."},{"num":7,"verse":"And Adoni-Bezek said, Threescore and ten melachim, having their thumbs and their big toes cut off, picked up their scraps under my shulchan; as I have done, so Elohim hath requited me. And they brought him to Yerushalayim, and there he died."},{"num":8,"verse":"Now the Bnei Yehudah had fought against Yerushalayim, and had taken it, and put it to the edge of the cherev, and set eish to the Ir."},{"num":9,"verse":"And afterward the Bnei Yehudah went down to fight against the Kena’ani that dwelt in the har, and in the Negev, and in the western foothills."},{"num":10,"verse":"And Yehudah went against the Kena’ani that dwelt in Chevron; (now the shem of Chevron formerly was Kiryat-Arba); and they struck down Sheshai, and Achiman, and Talmai."},{"num":11,"verse":"And from thence Yehudah went against the inhabitants of Devir; and the shem of Devir formerly was Yiryat-Sepher;"},{"num":12,"verse":"And Kalev said, He that striketh Yiryat-Sepher, and taketh it, to him will I give Achsah my bat as isha."},{"num":13,"verse":"And Otniel ben Kenaz, Kalev’s younger brother, took it; and he gave him Achsah his bat as isha."},{"num":14,"verse":"And it came to pass, when she came to him, that she urged him to ask of her av the sadeh; and she dismounted her donkey; and Kalev said unto her, What wilt thou?"},{"num":15,"verse":"And she said unto him, Give me bracha; since thou hast given me eretz hanegev; give me also gullot mayim. And Kalev gave her the upper gullot and the lower gullot."},{"num":16,"verse":"And the Bnei Keni, khoten Moshe, went up out of the Ir HaTemarim with the Bnei Yehudah into the midbar of Yehudah, which lieth in the Negev of Arad; and they went and dwelt among the people."},{"num":17,"verse":"And Yehudah went with Shim’on his brother, and they struck down the Kena’ani that inhabited Tzephat, and utterly destroyed it. And the shem of the Ir was called Chormah."},{"num":18,"verse":"Also Yehudah took Azah (Gaza) and the territory thereof, and Askelon and the territory thereof, and Ekron and the territory thereof."},{"num":19,"verse":"And Hashem was with Yehudah; and he possessed the inhabitants of the hill country; but could not drive out the inhabitants of the [broad] valley [areas], because they had chariots of barzel (iron)."},{"num":20,"verse":"And they gave Chevron unto Kalev, just as Moshe promised; and he expelled from there the three Bnei Anak."},{"num":21,"verse":"And the Bnei Binyamin did not drive out the Yevusi that inhabited Yerushalayim; and the Yevusi dwell with the Bnei Binyamin in Yerushalayim unto this day."},{"num":22,"verse":"And Bais Yosef, they also went up against Beit-El; and Hashem was with them."},{"num":23,"verse":"And Bais Yosef sent shomrim (spies) to Beit-El. (Now the shem of the Ir formerly was Luz.)"},{"num":24,"verse":"And the shomrim saw an ish come forth out of the Ir, and they said unto him, Show us, now, the way to enter into the Ir, and we will show thee chesed."},{"num":25,"verse":"And when he showed them the way to enter into the Ir, they struck down the Ir with the edge of the cherev; but they spared the ish and all his mishpakhah."},{"num":26,"verse":"And the ish went into the eretz HaChittim, and built an Ir, and called the shem thereof Luz; which is the shem thereof unto this day."},{"num":27,"verse":"Neither did Menasheh drive out the Beit-Sh’an and her villages, nor Ta’nach and her villages, nor the inhabitants of Dor and her villages, nor the inhabitants of Yivleam and her villages, nor the inhabitants of Megiddo and her villages; so the Kena’ani were determined to dwell in that land."},{"num":28,"verse":"And it came to pass, when Yisroel was chazak, that they put the Kena’ani to forced labor, and did not utterly drive them out."},{"num":29,"verse":"Neither did Ephrayim drive out the Kena’ani that dwelt in Gezer; but the Kena’ani dwelt in Gezer among them."},{"num":30,"verse":"Neither did Zevulun drive out the inhabitants of Kitron, nor the inhabitants of Nahalol; but the Kena’ani dwelt among them, and became subject to forced labor."},{"num":31,"verse":"Neither did Asher drive out the inhabitants of Akko, nor the inhabitants of Tzidon, nor of Achlav, nor of Achziv, nor of Chelbah, nor of Aphik, nor of Rechov;"},{"num":32,"verse":"But the Asheri dwelt among the Kena’ani, the inhabitants of HaAretz: for they did not drive them out."},{"num":33,"verse":"Neither did Naphtali drive out the inhabitants of Beit-Shemesh, nor the inhabitants of Beit-Anat; but he dwelt among the Kena’ani, the inhabitants of HaAretz: nevertheless the inhabitants of Beit-Shemesh and of Beit-Anat were unto them subject to forced labor."},{"num":34,"verse":"And the Emori forced the Bnei Dan into the hill country; for they would not allow them to come down into the [broad] valley [area];"},{"num":35,"verse":"But the Emori would dwell in Mt Cheres in Ayalon, and in Shaalvim: yet the yad Bais Yosef prevailed, so that they became subject to forced labor."},{"num":36,"verse":"And the territory of the Emori was from the Akrabbim Ascent and the Rock, upward."}]