[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(2) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The time is not come.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Better (unless we alter the received text), ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "It is not yet time to come",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e.,",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it is not yet time to assemble and commence preparations for building. It is not stated on what grounds the people based this assumption; but probably they palliated their indifference to religion by a pretended dread of Persian hostility. Darius, however, unlike his predecessor Artaxerxes, gave the enemies of the Jews no countenance when a report was actually made to him on the subject. (See Ezra 5, 6)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Haggai 1:2-4",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Haggai 1:2-4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "This people say, The time is not come, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — They had no just cause for saying this; but their own private concerns and conveniences (as appears from what follows) employed all their thoughts, and they preferred them to the rebuilding of the temple. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Then — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "When the people were thus sluggish, made excuses, and delayed the work; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "came the word of the Lord to Haggai — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "To reprove them for their neglect, and excite them to their duty. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Is it time for you, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "&c. — You think it full time to build your own houses: you judge it seasonable enough to lay out much cost on adorning them; what pretence then can you make, that it is not seasonable to build my house? Ought not that first to be set about, and the ornamenting of your own houses to be left till afterward? The reproof here given seems to allude to the different spirit with which David was actuated, Psalms 132., who vowed that he would ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "not come into the tabernacle of his house, &c., until he found out a place for the Lord. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "It certainly argues a contempt of God, when men give the preference to themselves before him, or think no cost or grandeur is too much for themselves, but the meanest accommodation good enough for the service of God. It is true an humble and devout mind is the only temple which God delights to dwell in; and he dwells not in, nor regards, temples made with hands; but yet, for the public solemnization of his worship, and as an outward testimony of men’s respect toward him, it is proper that places should be erected for, and appropriated to his worship; which places ought not to be neglected, but made as decent and becoming the design of their erection as the circumstances of things will admit of.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1:1-11 Observe the sin of the Jews, after their return from captivity in Babylon. Those employed for God may be driven from their work by a storm, yet they must go back to it. They did not say that they would not build a temple, but, Not yet. Thus men do not say they will never repent and reform, and be religious, but, Not yet. And so the great business we were sent into the world to do, is not done. There is a proneness in us to think wrongly of discouragements in our duty, as if they were a discharge from our duty, when they are only for the trial of our courage and faith. They neglected the building of God's house, that they might have more time and money for worldly affairs. That the punishment might answer to the sin, the poverty they thought to prevent by not building the temple, God brought upon them for not building it. Many good works have been intended, but not done, because men supposed the proper time was not come. Thus believers let slip opportunities of usefulness, and sinners delay the concerns of their souls, till too late. If we labour only for the meat that perishes, as the Jews here, we are in danger of losing our labour; but we are sure it shall not be in vain in the Lord, if we labour for the meat which lasts to eternal life. If we would have the comfort and continuance of temporal enjoyments, we must have God as our Friend. See also Lu 12:33. When God crosses our temporal affairs, and we meet with trouble and disappointment, we shall find the cause is, that the work we have to do for God and our own souls is left undone, and we seek our own things more than the things of Christ. How many, who plead that they cannot afford to give to pious or charitable designs, often lavish ten times as much in needless expenses on their houses and themselves! But those are strangers to their own interests, who are full of care to adorn and enrich their own houses, while God's temple in their hearts lies waste. It is the great concern of every one, to apply to the necessary duty of self-examination and communion with our own hearts concerning our spiritual state. Sin is what we must answer for; duty is what we must do. But many are quick-sighted to pry into other people's ways, who are careless of their own. If any duty has been neglected, that is no reason why it should still be so. Whatever God will take pleasure in when done, we ought to take pleasure in doing. Let those who have put off their return to God, return with all their heart, while there is time.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Thus speaketh the Lord of hosts, saying, This people say - Not Zerubbabel or Joshua, but \"this people.\" He says not, \"My people,\" but reproachfully \"this people,\" as, in acts, disowning Him, and so deserving to be disowned by Him. \"The time is not come,\" literally \"It is not time to come, time for the house of the Lord to be built\" . They might yet sit still; the time for them \"to come\" was not yet, for not yet was the \"time for the house of the Lord to be built.\" Why it was not time, they did not say. The government did not help them; the original grant by Cyrus ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezra 3:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " was exhausted; the Samaritans hindered them, because they would not own them, (amid their mishmash of worship, \"worshiping,\" our Lord tells them ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 4:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"they know not what\"), as worshipers of the same God. It was a bold excuse, if they said, that the 70 years during which the temple was to lie waste, were not yet ended.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The time had long since come, when, 16 years before, Cyrus had given command that the house of God should be built. The prohibition to build, under Artaxerxes or Pseudo-Smerdis, applied directly to the city and its walls, not to the temple, except so far as the temple itself, from its position, might be capable of being used as a fort, as it was in the last siege of, Jerusalem. Yet in itself a building of the size of the temple, apart from outer buildings, could scarcely so be used. The prohibition did not hinder the building of stately private houses, as appears from Haggai's rebuke. The hindrances also, whatever they were, had not begun with that decree. The death of Pseudo-Smerdis had now, for a year, set them free, if had they had any zeal for the glory and service of God. Otherwise, Haggai would not blamed them. God, knowing that He would bend the heart of Darius, as He had that of Cyrus, requires the house to be built without the king's decree. It was built in faith, that God would bring through what He had enjoined, although outward things were as adverse now as before. And what He commanded He prospered Ezra 5-6.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The time had long since come, when, 16 years before, Cyrus had given command that the house of God should be built. The prohibition to build, under Artaxerxes or Pseudo-Smerdis, applied directly to the city and its walls, not to the temple, except so far as the temple itself, from its position, might be capable of being used as a fort, as it was in the last siege of, Jerusalem. Yet in itself a building of the size of the temple, apart from outer buildings, could scarcely so be used. The prohibition did not hinder the building of stately private houses, as appears from Haggai's rebuke. The hindrances also, whatever they were, had not begun with that decree. The death of Pseudo-Smerdis had now, for a year, set them free, if had they had any zeal for the glory and service of God. Otherwise, Haggai would not blamed them. God, knowing that He would bend the heart of Darius, as He had that of Cyrus, requires the house to be built without the king's decree. It was built in faith, that God would bring through what He had enjoined, although outward things were as adverse now as before. And what He commanded He prospered ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezra 5-6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "There was indeed a second fulfillment of 70 years, from the destruction of the temple by Nebuchadnezzar 586 b.c., to its consecration in the 6th year of Darius 516 b.c. But this was through the willfulness of man, prolonging the desolation decreed by God, and Jeremiah's prophecy relates to the people not to the temple.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": " \"The prophet addresses his discourse to the chiefs (in Church and state) and yet accuses directly, not their listlessness but that of the people, in order both to honor them before the people and to teach that their sins are to be blamed privately not publicly, lest their authority should be injured, and the people incited to rebel against them; and also to shew that this fault was directly that of the people, whom he reproves before their princes, that, being openly convicted before them, it might be ashamed, repent, and obey God; but that indirectly this fault touched the chiefs themselves, whose office it was to urge the people to this work of God\" . \"For seldom is the prince free from the guilt of his subjects, as either assenting to, or winking at them, or not coercing them, though able.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Since also Christians are the temple of God, all this prophecy of Haggai is applicable to them . \"When thou seest one who has lapsed thinking and preparing to build through chastity the temple which he had before destroyed through passion, and yet delaying day by day, say to him, 'Truly thou also art of the people of the captivity, and sayest, The time is not yet come for building the house of the Lord.' Whoso has once settled to restore the temple of God, to him every time is suited for building, and the prince, Satan, cannot hinder, nor, the enemies around. As soon as being thyself converted, thou callest upon the name of the Lord, He will say, \"Behold Me\" . \"To him who willeth to do right, the time is always present; the good and right-minded have power to fulfill what is to the glory of God, in every time and place.\" ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Since also Christians are the temple of God, all this prophecy of Haggai is applicable to them . \"When thou seest one who has lapsed thinking and preparing to build through chastity the temple which he had before destroyed through passion, and yet delaying day by day, say to him, 'Truly thou also art of the people of the captivity, and sayest, The time is not yet come for building the house of the Lord.' Whoso has once settled to restore the temple of God, to him every time is suited for building, and the prince, Satan, cannot hinder, nor, the enemies around. As soon as being thyself converted, thou callest upon the name of the Lord, He will say, \"Behold Me\" . \"To him who willeth to do right, the time is always present; the good and right-minded have power to fulfill what is to the glory of God, in every time and place.\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "2. the Lord of hosts—Jehovah, Lord of the powers of heaven and earth, and therefore requiring implicit obedience.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "This people—\"This\" sluggish and selfish \"people.\" He does not say, My people, since they had neglected the service of God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The time—the proper time for building the temple. Two out of the seventy predicted years of captivity (dating from the destruction of the temple, 558 B.C., 2Ki 25:9) were yet unexpired; this they make their plea for delay [Henderson]. The seventy years of captivity were completed long ago in the first year of Cyrus, 536 B.C. (Jer 29:10); dating from 606 B.C., Jehoiakim's captivity (2Ch 36:6). The seventy years to the completion of the temple (Jer 25:12) were completed this very year, the second of Darius [Vatablus]. Ingenious in excuses, they pretended that the interruption in the work caused by their enemies proved it was not yet the proper time; whereas their real motive was selfish dislike of the trouble, expense, and danger from enemies. \"God,\" say they, \"hath interposed many difficulties to punish our rash haste\" [Calvin]. Smerdis' interdict was no longer in force, now that Darius the rightful king was on the throne; therefore they had no real excuse for not beginning at once to build. Auberlen denies that by \"Artaxerxes\" in Ezr 4:7-22 is meant Smerdis. Whether Smerdis or Artaxerxes Longimanus be meant, the interdict referred only to the rebuilding of the city, which the Persian kings feared might, if rebuilt, cause them trouble to subdue; not to the rebuilding of the temple. But the Jews were easily turned aside from the work. Spiritually, like the Jews, men do not say they will never be religious, but, It is not time yet. So the great work of life is left undone.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Thus speaketh, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " by way of reproof, and to awaken the drowsy Jews; he who knew their heart tells them what they both thought and spoke. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "This people, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " whom mercy preserved in, redeemed out of Babylon, and brought into their land on purpose to build the temple. This people, whom Cyrus by proclamation sent to do this, who seemed to long for a temple when they were in Babylon. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Say; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " discourse thus among themselves, and discourage all that were forward. The time is not come; the proper season of rebuilding the house of God seems to be not come, for since the prohibition by Cambyses in the days of Cyrus, and through all the time of Cambyses, and in the first year and part of the second of Darius, we have no commission to do it, but are required not to do any thing in this affair without further order, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ezra 4:21",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Ezra 4:21",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Thus speaketh the Lord of hosts,.... Of armies above and below; whom all ought to reverence, honour, and obey; who was able to support his people in building his house, and protect them from their enemies, which should have been an encouragement to them; and to punish them for their neglect of it, which might have deterred them from it. This preface is made, to show that what follow were not the words of the prophet, but of the Lord; and therefore to be the more regarded, and the truth of them not to be doubted of: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "saying, This people say; repeating the words of the people of the Jews to Zerubbabel and Joshua, that they might observe them, and the wickedness and ingratitude in them. \"This people\", lately brought out of the captivity of Babylon, and loaded with various blessings and benefits; and not a few of them, but the generality of them, the body of them, expressed themselves after this manner, when pressed to build the temple: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "The time is not come, the time that the Lord's house should be built; suggesting that the seventy years of Jerusalem and the temple lying in ruins, reckoning from the destruction of them in the nineteenth year of Nebuchadnezzar, were not yet fulfilled; or rather intimating that it was not the time in Providence, since they had been forbid and hindered in former reigns from going on with the work; or, since it had been a time of famine and distress with them, it was not a time fit and convenient to carry on such a service; and though they did not lay aside all thoughts of it, yet they judged it right and proper to defer it to a more convenient time, when they were better settled, and in a better capacity to engage in it. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "The time is not come, the time that the Lord's house should be built; suggesting that the seventy years of Jerusalem and the temple lying in ruins, reckoning from the destruction of them in the nineteenth year of Nebuchadnezzar, were not yet fulfilled; or rather intimating that it was not the time in Providence, since they had been forbid and hindered in former reigns from going on with the work; or, since it had been a time of famine and distress with them, it was not a time fit and convenient to carry on such a service; and though they did not lay aside all thoughts of it, yet they judged it right and proper to defer it to a more convenient time, when they were better settled, and in a better capacity to engage in it. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "Thus speaketh the LORD of hosts, saying, This people say, The time is not come, the time {c} that the LORD'S house should be built.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Thus speaketh the LORD of hosts, saying, This people say, The time is not come, the time ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{c}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " that the LORD'S house should be built.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(c) Not that they condemned the building of it, but they preferred policy and personal profit to religion, being content with small beginnings.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "speaketh",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Lit. ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "saith",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the same word as throughout the verse.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "this people",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] possibly used as a term of reproach: comp. ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Haggai 2:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 8:11-12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the time is not come",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Lit., ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "not time to come.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The sentence is evidently elliptical, and there is much difference of opinion as to what should be supplied. The simplest way of taking it appears to be, “it is not (yet) the time (for it, i.e. the matter in hand, or proposed undertaking) to come.” Then what that matter or undertaking is, is explained in the next clause, “the time of the House of Jehovah, for it to be built.” The LXX., however, and other Ancient Versions render, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The time is not come for the Lord’s house to be built",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". R. V. margin.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "It has been thought by some, that in saying the time was not come the Jews meant to allege, that the seventy years of desolation which had been predicted were not yet fulfilled. But if that had really been the case their excuse would have been valid. “There was indeed,” as Pusey observes, “a second fulfilment of seventy years, from the destruction of the temple by Nebuchadnezzar, b.c. 586, to its consecration in the sixth year of Darius, b.c. 516. But this was through the wilfulness of man prolonging the desolation decreed by God, and Jeremiah’s prophecy relates to the people not to the temple.” It is clear from the sharp rebuke here administered, and from the severe judgments with which their procrastination had been visited (ver. 6, 9–11), that the excuse was idle and the delay worldly and culpable.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 2.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The Lord of hosts.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Haggai, as the other prophets, always uses this formula in enunciating his messages (see note on Amos 9:5). Trochon justly remarks that this expression is not found in the earlier books of the Bible - the Pentateuch, Joshua, and Judges. If these books were contemporary with the prophets, the phrase would certainly occur in them (see a valuable note in the Appendix to Archdeacon Perowne's Commentary on Haggai, in 'The Canibridge Bible for Schools'). ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "This people;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "populus iste",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Vulgate), with some contempt, as if they were no longer worthy to be called the Lord's people (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Haggai 2:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). It looks as if they had often before been admonished to proceed with the work, and had this answer ready. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "The time is not come;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "it is not time to",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " come (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 2:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), which is explained by the new clause, ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "the time that the Lord's house should be built.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The versions shorten the sentence, rendering,\" the time for building the Lord's house has not come.\" The excuse for their inaction may have had various grounds. They may have said, reckoning from the final destruction of Jerusalem ( ",
        "children": []
      },
      {
        "element": "span",
        "class": "date",
        "text": "B.C. 586",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), that the seventy years' captivity was not complete; that there was still danger from the neighbouring population; that the Persians were adverse to the undertaking; that the unfruitful season rendered them unable to engage in such a great work; and that the very fact of these difficulties existing showed that God did not favour the design. Haggai 1:2",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The prophet begins by charging the people with their unconcern about building the house of God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Haggai 1:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"Thus saith Jehovah of hosts: This people saith, It is not time to come, the time for the house of Jehovah to be built.\" העם הזּה, iste populus, not my people, or Jehovah's people, but hazzeh (this) in a contemptuous sense. Of the two clauses, (a) \"It is not time to come,\" and (b) \"The time of the house of Jehovah,\" the latter gives the more precise definition of the former, the בּא (to come) being explained as meaning the time to build the house of Jehovah. The meaning is simply this: the time has not yet arrived to come and build the house of Jehovah; for לא in this connection signifies \"not yet,\" as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 2:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Job 22:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". A distinction is drawn between coming to the house of Jehovah and building the house, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Haggai 1:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". There is no ground, therefore, for altering the text, as Hitzig proposes, inasmuch as the defective mode of writing the infinitive בּא is by no means rare (compare, for example, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 2:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 14:48",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 32:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 13:28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 20:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); and there is no foundation whatever for the absurd rendering of the words of the text, \"It is not the time of the having arrived of the time of the house,\" etc. (Hitzig). ",
        "children": []
      }
    ]
  }
]