[{"num":11,"verse":"In the spring, at the time when kings go out to war, David sent out Yo’av, his servants who were with him and all Isra’el. They ravaged the people of ‘Amon and laid siege to Rabbah. But David stayed in Yerushalayim. "},{"num":2,"verse":"Once, after his afternoon nap, David got up from his bed and went strolling on the roof of the king’s palace. From the roof he saw a woman bathing, who was very beautiful. "},{"num":3,"verse":"David made inquiries about the woman and was told that she was Bat-Sheva the daughter of Eli‘am, the wife of Uriyah the Hitti. "},{"num":4,"verse":"David sent messengers to get her, and she came to him, and he went to bed with her (for she had been purified from her uncleanness). Then she returned to her house. "},{"num":5,"verse":"The woman conceived; and she sent a message to David, “I am pregnant.”"},{"num":6,"verse":"David sent this order to Yo’av: “Send me Uriyah the Hitti.” Yo’av sent Uriyah to David. "},{"num":7,"verse":"When Uriyah had come to him, David asked him how Yo’av was doing, how the people were feeling and how the war was going. "},{"num":8,"verse":"Then David said to Uriyah, “Go down to your house and wash your feet.” Uriyah left the king’s palace and was followed by a present of food from the king. "},{"num":9,"verse":"But Uriyah slept at the door of the king’s palace with all the servants of his lord and didn’t go down to his house. "},{"num":10,"verse":"When they told David, “Uriyah didn’t go down to his house,” David said to Uriyah, “Haven’t you just arrived from a journey? Why didn’t you go down to your house?” "},{"num":11,"verse":"Uriyah answered David, “The ark, Isra’el and Y’hudah stay in tents; and my lord Yo’av and the servants of my lord are camping in the countryside. So should I go into my house to eat and drink and go to bed with my wife? As surely as you live, I will not do such a thing!” "},{"num":12,"verse":"David said to Uriyah, “Stay here today also; tomorrow I will let you leave.” So Uriyah stayed in Yerushalayim that day and the following day. "},{"num":13,"verse":"David summoned him, ate and drank with him, and got him drunk. But in the evening he went out and lay on his bed with his lord’s servants and did not go down to his house."},{"num":14,"verse":"In the morning David wrote a letter to Yo’av and sent it with Uriyah. "},{"num":15,"verse":"In the letter he wrote, “Put Uriyah on the front lines of the fiercest fighting; then pull back from him, so that he will be wounded and killed.” "},{"num":16,"verse":"So while Yo’av had the city under siege, he assigned Uriyah to the place where he knew the toughest defenders were. "},{"num":17,"verse":"The men of the city went out and fought Yo’av; a number of people fell, including some of David’s servants, with Uriyah the Hitti among the dead."},{"num":18,"verse":"Yo’av sent a message to David reporting all the news concerning the war, "},{"num":19,"verse":"and he instructed the messenger, “When you have finished telling the king all the news about the war, "},{"num":20,"verse":"he may become angry and ask you, ‘Why did you get so close to the city to fight? Didn’t you know they would shoot from the wall? "},{"num":21,"verse":"Didn’t you think about the person who struck Avimelekh the son of Yerubeshet, that a woman threw an upper millstone down on him from the wall, so that he died at Tevetz? Why did you go so near the wall?’ If he says this, tell him, ‘Your servant Uriyah is dead also.’” "},{"num":22,"verse":"So the messenger left, and on arrival he told David all that Yo’av had sent him to say. "},{"num":23,"verse":"The messenger said to David, “The men were overpowering us and came out after us into the countryside. But we chased them back all the way to the entrance of the city gate. "},{"num":24,"verse":"The archers shot at your servants from the wall; some of the king’s servants are dead; also your servant Uriyah the Hitti is dead.” "},{"num":25,"verse":"David said to the messenger, “Tell Yo’av, ‘Don’t let this matter get you down — the sword devours in one way or another. Intensify your battle against the city, and overthrow it.’ And encourage him.”"},{"num":26,"verse":"When the wife of Uriyah heard that Uriyah her husband was dead, she mourned her husband. "},{"num":27,"verse":"When the mourning was over, David sent and took her home to his palace, and she became his wife and bore him a son."}]