[{"header":"David and Bathsheba"},{"num":11,"verse":"The following spring, at the time of the year when kings usually go to war, David sent out Joab with his officers and the Israelite army; they defeated the Ammonites and besieged the city of Rabbah. But David himself stayed in Jerusalem."},{"num":2,"verse":"One day, late in the afternoon, David got up from his nap and went to the palace roof. As he walked around up there, he saw a woman taking a bath in her house. She was very beautiful. "},{"num":3,"verse":"So he sent a messenger to find out who she was, and learned that she was Bathsheba, the daughter of Eliam and the wife of Uriah the Hittite. "},{"num":4,"verse":"David sent messengers to get her; they brought her to him and he made love to her. (She had just finished her monthly ritual of purification.) Then she went back home. "},{"num":5,"verse":"Afterward she discovered that she was pregnant and sent a message to David to tell him."},{"num":6,"verse":"David then sent a message to Joab: “Send me Uriah the Hittite.” So Joab sent him to David. "},{"num":7,"verse":"When Uriah arrived, David asked him if Joab and the troops were well, and how the fighting was going. "},{"num":8,"verse":"Then he said to Uriah, “Go on home and rest a while.” Uriah left, and David had a present sent to his home. "},{"num":9,"verse":"But Uriah did not go home; instead he slept at the palace gate with the king's guards. "},{"num":10,"verse":"When David heard that Uriah had not gone home, he asked him, “You have just returned after a long absence; why didn't you go home?”"},{"num":11,"verse":"Uriah answered, “The men of Israel and Judah are away in battle, and the Covenant Box is with them; my commander Joab and his officers are camping out in the open. How could I go home, eat and drink, and sleep with my wife? By all that's sacred, I swear that I could never do such a thing!”"},{"num":12,"verse":"So David said, “Then stay here the rest of the day, and tomorrow I'll send you back.” So Uriah stayed in Jerusalem that day and the next. "},{"num":13,"verse":"David invited him to supper and got him drunk. But again that night Uriah did not go home; instead he slept on his blanket in the palace guardroom."},{"num":14,"verse":"The next morning David wrote a letter to Joab and sent it by Uriah. "},{"num":15,"verse":"He wrote: “Put Uriah in the front line, where the fighting is heaviest, then retreat and let him be killed.” "},{"num":16,"verse":"So while Joab was besieging the city, he sent Uriah to a place where he knew the enemy was strong. "},{"num":17,"verse":"The enemy troops came out of the city and fought Joab's forces; some of David's officers were killed, and so was Uriah."},{"num":18,"verse":"Then Joab sent a report to David telling him about the battle, "},{"num":19,"verse":"and he instructed the messenger, “After you have told the king all about the battle, "},{"num":20,"verse":"he may get angry and ask you, ‘Why did you go so near the city to fight them? Didn't you realize that they would shoot arrows from the walls? "},{"num":21,"verse":"Don't you remember how Abimelech son of Gideon was killed? It was at Thebez, where a woman threw a millstone down from the wall and killed him. Why, then, did you go so near the wall?’ If the king asks you this, tell him, ‘Your officer Uriah was also killed.’”"},{"num":22,"verse":"So the messenger went to David and told him what Joab had commanded him to say. "},{"num":23,"verse":"He said, “Our enemies were stronger than we were and came out of the city to fight us in the open, but we drove them back to the city gate. "},{"num":24,"verse":"Then they shot arrows at us from the wall, and some of Your Majesty's officers were killed; your officer Uriah was also killed.”"},{"num":25,"verse":"David said to the messenger, “Encourage Joab and tell him not to be upset, since you never can tell who will die in battle. Tell him to launch a stronger attack on the city and capture it.”"},{"num":26,"verse":"When Bathsheba heard that her husband had been killed, she mourned for him. "},{"num":27,"verse":"When the time of mourning was over, David had her brought to the palace; she became his wife and bore him a son. But the Lord was not pleased with what David had done."}]