[{"header":"David Commits Adultery with Bathsheba"},{"num":11,"verse":"It came about in the spring, at the time kings go out, David sent Joab and his servants with him and all of Israel. They ravaged all of the Ammonites and besieged Rabbah, but David was remaining in Jerusalem. "},{"num":2,"verse":"It happened late one afternoon that David got up from his bed and walked about on the roof of the king’s house, and he saw a woman bathing on her roof. Now the woman was very beautiful. "},{"num":3,"verse":"David sent and inquired about the woman, and someone said, “Is this not Bathsheba the daughter of Eliam, the wife of Uriah the Hittite?” "},{"num":4,"verse":"Then David sent messengers and took her, and she came to him, and he slept with her. (Now she had been purifying herself from her uncleanness.) And she returned to her house. "},{"num":5,"verse":"The woman became pregnant, and she sent and told David, and she said, “I am pregnant.” "},{"num":6,"verse":"So David sent to Joab, “Send Uriah the Hittite to me.” So Joab sent Uriah to David. "},{"num":7,"verse":"Uriah came to him, and David asked how Joab and the army fared and how the war was going. "},{"num":8,"verse":"David said to Uriah, “Go down to your house, and wash your feet.” So Uriah went out from the king’s house, and a gift from the king went out after him. "},{"num":9,"verse":"But Uriah slept at the entrance of the king’s house with all the servants of his master and did not go down to his house. "},{"num":10,"verse":"They told David, “Uriah did not go down to his house.” David said to Uriah, “Are you not coming from a journey? Why did you not go down to your house?” "},{"num":11,"verse":"Uriah said to David, “The ark and Israel and Judah are living in the booths; and my lord Joab and the servants of my lord are camping on the surface of the open field; and I, shall I go to my house to eat and to drink and to sleep with my wife? By your life and the life of your soul, I surely will not do this thing.” "},{"num":12,"verse":"David said to Uriah, “Remain here today, and tomorrow I will send you away.” So Uriah remained in Jerusalem on that day and the next. "},{"num":13,"verse":"David invited him, and he ate and drank in his presence so that he became drunk, and he went out in the evening to lie on his bed with the servants of his lord, but he did not go down to his house. "},{"num":14,"verse":"And it happened in the morning, David wrote a letter to Joab, and he sent it by the hand of Uriah. "},{"num":15,"verse":"He had written in the letter, “Put Uriah in the front, in the face of the fiercest fighting, then draw back from behind him so that he may be struck down and die.”"},{"num":16,"verse":"When Joab was besieging the city, he put Uriah toward the place which he knew there were valiant warriors. "},{"num":17,"verse":"The men of the city came out and fought with Joab. Some from the army from the servants of David fell; Uriah the Hittite also died. "},{"num":18,"verse":"Joab sent and told David all of the news of the battle. "},{"num":19,"verse":"He instructed the messenger, saying, “As you are finishing to speak all the news of the battle to the king, "},{"num":20,"verse":"if the anger of the king rises and he says to you, ‘Why did you go near the city to fight? Did you not know that they would shoot from atop the wall? "},{"num":21,"verse":"Who killed Abimelech the son of Jerub-bosheth, if not a woman who threw an upper millstone on him from atop the wall and he died at Thebez? Why did you go near the wall?’ Then you shall say, ‘Your servant Uriah the Hittite also died.’” "},{"num":22,"verse":"Then the messenger left, and he came and told David all that Joab had sent him to say. "},{"num":23,"verse":"The messenger said to David, “Because the men overpowered us, the men came out to us in the field, but we forced them back to the entrance of the gate. "},{"num":24,"verse":"The archers shot at your servant from atop the wall, and some of the servants of the king died; your servant Uriah the Hittite also died.” "},{"num":25,"verse":"Then David said to the messenger, “Thus you shall say to Joab, ‘Do not feel badly about this matter; now one and then another the sword will devour. Intensify your attack on the city and overthrow it.’” And he encouraged him. "},{"num":26,"verse":"When the wife of Uriah heard that Uriah her husband was dead, she mourned over her husband. "},{"num":27,"verse":"When the mourning was over, David sent and brought her to his household, and she became his wife and bore him a son. But the thing which David had done was evil in the eyes of Yahweh."}]