[{"header":"Chapter 11"},{"num":1,"verse":"David’s Sin. At the turn of the year, the time when kings go to war, David sent out Joab along with his officers and all Israel, and they laid waste the Ammonites and besieged Rabbah. David himself remained in Jerusalem. "},{"num":2,"verse":"One evening David rose from his bed and strolled about on the roof of the king’s house. From the roof he saw a woman bathing; she was very beautiful. "},{"num":3,"verse":"David sent people to inquire about the woman and was told, “She is Bathsheba, daughter of Eliam, and wife of Uriah the Hittite, Joab’s armor-bearer.” "},{"num":4,"verse":"Then David sent messengers and took her. When she came to him, he took her to bed, at a time when she was just purified after her period; and she returned to her house. "},{"num":5,"verse":"But the woman had become pregnant; she sent a message to inform David, “I am pregnant.”"},{"num":6,"verse":"So David sent a message to Joab, “Send me Uriah the Hittite.” Joab sent Uriah to David. "},{"num":7,"verse":"And when he came, David asked him how Joab was, how the army was, and how the war was going, and Uriah answered that all was well. "},{"num":8,"verse":"David then said to Uriah, “Go down to your house and bathe your feet.” Uriah left the king’s house, and a portion from the king’s table was sent after him. "},{"num":9,"verse":"But Uriah slept at the entrance of the king’s house with the other officers of his lord, and did not go down to his own house. "},{"num":10,"verse":"David was told, “Uriah has not gone down to his house.” So he said to Uriah, “Have you not come from a journey? Why, then, did you not go down to your house?” "},{"num":11,"verse":"Uriah answered David, “The ark and Israel and Judah are staying in tents, and my lord Joab and my lord’s servants are encamped in the open field. Can I go home to eat and to drink and to sleep with my wife? As the Lord lives and as you live, I will do no such thing.” "},{"num":12,"verse":"Then David said to Uriah, “Stay here today also, and tomorrow I will send you back.” So Uriah stayed in Jerusalem that day. On the following day, "},{"num":13,"verse":"David summoned him, and he ate and drank with David, who got him drunk. But in the evening he went out to sleep on his bed among his lord’s servants, and did not go down to his house. "},{"num":14,"verse":"The next morning David wrote a letter to Joab which he sent by Uriah. "},{"num":15,"verse":"This is what he wrote in the letter: “Place Uriah up front, where the fighting is fierce. Then pull back and leave him to be struck down dead.” "},{"num":16,"verse":"So while Joab was besieging the city, he assigned Uriah to a place where he knew the defenders were strong. "},{"num":17,"verse":"When the men of the city made a sortie against Joab, some officers of David’s army fell, and Uriah the Hittite also died."},{"num":18,"verse":"Then Joab sent David a report of all the details of the battle, "},{"num":19,"verse":"instructing the messenger, “When you have finished giving the king all the details of the battle, "},{"num":20,"verse":"the king may become angry and say to you: ‘Why did you go near the city to fight? Did you not know that they would shoot from the wall above? "},{"num":21,"verse":"Who killed Abimelech, son of Jerubbaal? Was it not a woman who threw a millstone down on him from the wall above, so that he died in Thebez? Why did you go near the wall?’ Then you in turn are to say, ‘Your servant Uriah the Hittite is also dead.’” "},{"num":22,"verse":"The messenger set out, and on his arrival he reported to David everything Joab had sent him to tell. "},{"num":23,"verse":"He told David: “The men had the advantage over us and came out into the open against us, but we pushed them back to the entrance of the city gate. "},{"num":24,"verse":"Then the archers shot at your servants from the wall above, and some of the king’s servants died; and your servant Uriah the Hittite is also dead.” "},{"num":25,"verse":"David said to the messenger: “This is what you shall say to Joab: ‘Do not let this be a great evil in your sight, for the sword devours now here and now there. Strengthen your attack on the city and destroy it.’ Encourage him.”"},{"num":26,"verse":"When the wife of Uriah heard that her husband had died, she mourned her lord. "},{"num":27,"verse":"But once the mourning was over, David sent for her and brought her into his house. She became his wife and bore him a son. But in the sight of the Lord what David had done was evil."}]