[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(2) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Stand in the court of the Lord’s house.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The occasion was probably one of the Feasts, and drew worshippers from all parts of the kingdom. As in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 7:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the prophet had to stand in the crowded court of the Temple and utter his warning. Some critics have supposed, indeed, that in Jeremiah 7-11 we have the full text of the discourse, while here there is only an epitome of the discourse itself, and a narrative of the circumstances connected with it. The command, “diminish not a word,” reminds us of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 4:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 12:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 22:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". There was something in the message that the prophet felt himself called to deliver from which he would naturally have shrunk.",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Benson CommentaryJeremiah 26:2-3. Stand in the court of the Lord’s house — The great court where both men and women ordinarily worshipped, says Dr. Lightfoot, when they brought no sacrifice; for when they did so, they were to bring it into the inner court, otherwise called the court of Israel, or of the priests, as the same learned author has observed in his treatise concerning the temple service. And speak unto all the cities of Judah — Here it is evident that ערו, cities, are put for their inhabitants; and we may conjecture from hence, that this transaction passed at one of the great festivals, when the people of Judah were assembled, out of all their cities, to worship at Jerusalem. All the words that I command thee — Not in the least varying from them, either to please men or to save thyself harmless. Diminish not a word — Either out of fear, favour, or flattery: declare not only the truth, but the whole truth, and give them faithful warning. Thus must all God’s ambassadors keep close to their instructions, and neither add to, nor diminish from, the word of the truth of the gospel, but must faithfully make known the whole counsel of God. If so be they will hearken and turn, &c. — Not that God was ignorant of their obstinacy, or did not foreknow that they would harden their hearts, and remain impenitent; yet it was for the glory of his justice, mercy, and holiness, to afford them both time for, and the means of, repentance. And he did give them time, for it was at least six years after this before the captivity of Jehoiakim, and seventeen before that of Zedekiah took place; and as for means, God favoured them not only with such as were ordinary, but such as were extraordinary, namely, with the ministry of this prophet.Matthew Henry's Concise Commentary26:1-6 God's ambassadors must not seek to please men, or to save themselves from harm. See how God waits to be gracious. If they persisted in disobedience, it would ruin their city and temple. Can any thing else be expected? Those who will not be subject to the commands of God, make themselves subject to the curse of God.Barnes' Notes on the BibleJeremiah 26 is a narrative of the danger to which Jeremiah was exposed by reason of the prophecy contained in Jeremiah 7 and should be read in connection with it. Jeremiah 26:4-6 contain a summary of the prediction contained in Jeremiah 7, and that again is but an outline of what was a long address. Jamieson-Fausset-Brown Bible Commentary2. in the court—the largest court, from which he could be heard by the whole people.come to worship—Worship is vain without obedience (1Sa 15:21, 22).all the words—(Eze 3:10).diminish not a word—(De 4:2; 12:32; Pr 30:6; Ac 20:27; 2Co 2:17; 4:2; Re 22:19). Not suppressing or softening aught for fear of giving offense; nor setting forth coldly and indirectly what can only by forcible statement do good.Matthew Poole's Commentary Stand in the court of the Lord’s house;  in the largest court of the temple, where the most may hear what thou sayest, and there speak to all those that dwell in any of the cities of Judah (from whence they were wont to come up, more especially thrice in a year to the temple to worship, Psalm 122:4). In the gate or court of that house wherein they have such a confidence do thou stand, so Jeremiah 7:2 and declare unto them what I command thee. Diminish not a word;  neither smoothing what may appear rough, nor suppressing what may offend them, entirely delivering my will unto them, not shunning to declare unto them the whole counsel of God, as Paul, Acts 20:27. Gill's Exposition of the Entire BibleThus saith the Lord, stand in the court of the Lord's house,.... It, the great court of Israel, where the people used to meet together for worship: and speak unto all the cities of Judah; the inhabitants of them; not only to those that dwelt at Jerusalem but in the rest of the cities of Judah; for what he was to say concerned them all, they having all sinned, and needed repentance and reformation; without which they would be involved in the general calamity of the nation: which come to worship in the Lord's house; as they did three times in the year, at the feasts of passover, pentecost, and tabernacles; and it was now the last of these, as Bishop Usher thinks, when this prophecy was to be delivered to them: all the words that I command thee to speak to them: nothing must be kept back, the whole counsel of God must be declared; not a word suppressed through affection to them, or fear of them; God commanded, and must be obeyed, let the consequence be what it will: diminish not a word; soften not any expression or alter any word, by putting one more smooth for one rough; or change the accent, or abate of the vehemency of delivering it; but both for matter manner, and form let it be as directed, without any subtraction and diminution, change or alteration: a rule which every minister of the word ought to attend to; seeking not to please men, but God that sends him and Christ whose minister he is. Geneva Study BibleThus saith the LORD; Stand in the {a} court of the LORD'S house, and speak to all the cities of Judah, which come to worship in the LORD'S house, all the words that I command thee to speak to them; diminish not a word:(a) That is, in that place of the temple to which the people resort out of all Judah to sacrifice.(b) To the intent that they should pretend no ignorance, as in Ac 20:27.",
        "children": [
          {
            "element": "p",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Benson Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Jeremiah 26:2-3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Stand in the court of the Lord’s house ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "— The great court where both men and women ordinarily worshipped, says Dr. Lightfoot, when they brought no sacrifice; for when they did so, they were to bring it into the inner court, otherwise called the court of Israel, or of the priests, as the same learned author has observed in his treatise concerning the temple service. ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "And speak unto all the cities of Judah ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "— Here it is evident that ",
            "children": []
          },
          {
            "element": "span",
            "class": "greekheb",
            "text": "ערו",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "cities, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "are put for their inhabitants; and we may conjecture from hence, that this transaction passed at one of the great festivals, when the people of Judah were assembled, out of all their cities, to worship at Jerusalem. ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "All the words that I command thee ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "— Not in the least varying from them, either to please men or to save thyself harmless. ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "Diminish not a",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "word ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "— Either out of fear, favour, or flattery: declare not only the truth, but the whole truth, and give them faithful warning. Thus must all God’s ambassadors keep close to their instructions, and neither add to, nor diminish from, the word of the truth of the gospel, but must faithfully make known the whole counsel of God. ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "If so be they will hearken and turn, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "&c. — Not that God was ignorant of their obstinacy, or did not foreknow that they would harden their hearts, and remain impenitent; yet it was for the glory of his justice, mercy, and holiness, to afford them both time for, and the means of, repentance. And he did give them ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "time, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "for it was at least six years after this before the captivity of Jehoiakim, and seventeen before that of Zedekiah took place; and as for ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "means, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "God favoured them not only with such as were ordinary, but such as were extraordinary, namely, with the ministry of this prophet.",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Matthew Henry's Concise Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "26:1-6 God's ambassadors must not seek to please men, or to save themselves from harm. See how God waits to be gracious. If they persisted in disobedience, it would ruin their city and temple. Can any thing else be expected? Those who will not be subject to the commands of God, make themselves subject to the curse of God.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Barnes' Notes on the Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " is a narrative of the danger to which Jeremiah was exposed by reason of the prophecy contained in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and should be read in connection with it. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 26:4-6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " contain a summary of the prediction contained in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", and that again is but an outline of what was a long address. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Jamieson-Fausset-Brown Bible Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "2. in the court—the largest court, from which he could be heard by the whole people.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "come to worship—Worship is vain without obedience (1Sa 15:21, 22).",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "all the words—(Eze 3:10).",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "diminish not a word—(De 4:2; 12:32; Pr 30:6; Ac 20:27; 2Co 2:17; 4:2; Re 22:19). Not suppressing or softening aught for fear of giving offense; nor setting forth coldly and indirectly what can only by forcible statement do good.",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Matthew Poole's Commentary",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Stand in the court of the Lord’s house; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " in the largest court of the temple, where the most may hear what thou sayest, and there speak to all those that dwell in any of the cities of Judah (from whence they were wont to come up, more especially thrice in a year to the temple to worship, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Psalm 122:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). In the gate or court of that house wherein they have such a confidence do thou ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "stand",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", so ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Jeremiah 7:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " and declare unto them what I command thee. ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Diminish not a word; ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " neither smoothing what may appear rough, nor suppressing what may offend them, entirely delivering my will unto them, not shunning to declare unto them the whole counsel of God, as Paul, ",
            "children": []
          },
          {
            "element": "span",
            "class": "bld",
            "text": "Acts 20:27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Gill's Exposition of the Entire Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "Thus saith the Lord, stand in the court of the Lord's house,.... It, the great court of Israel, where the people used to meet together for worship: ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "and speak unto all the cities of Judah; the inhabitants of them; not only to those that dwelt at Jerusalem but in the rest of the cities of Judah; for what he was to say concerned them all, they having all sinned, and needed repentance and reformation; without which they would be involved in the general calamity of the nation: ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "which come to worship in the Lord's house; as they did three times in the year, at the feasts of passover, pentecost, and tabernacles; and it was now the last of these, as Bishop Usher thinks, when this prophecy was to be delivered to them: ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "all the words that I command thee to speak to them: nothing must be kept back, the whole counsel of God must be declared; not a word suppressed through affection to them, or fear of them; God commanded, and must be obeyed, let the consequence be what it will: ",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "diminish not a word; soften not any expression or alter any word, by putting one more smooth for one rough; or change the accent, or abate of the vehemency of delivering it; but both for matter manner, and form let it be as directed, without any subtraction and diminution, change or alteration: a rule which every minister of the word ought to attend to; seeking not to please men, but God that sends him and Christ whose minister he is. ",
            "children": []
          },
          {
            "element": "div",
            "class": "vheading2",
            "text": "Geneva Study Bible",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse2",
            "text": "Thus saith the LORD; Stand in the {a} court of the LORD'S house, and speak to all the cities of Judah, which come to worship in the LORD'S house, all the words that I command thee to speak to them; diminish not a word:",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "(a) That is, in that place of the temple to which the people resort out of all Judah to sacrifice.",
            "children": []
          },
          {
            "element": "p",
            "class": "",
            "text": "(b) To the intent that they should pretend no ignorance, as in Ac 20:27.",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the court of the Lord’s house",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] probably the outer court, as that in which the people would assemble; so ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 19:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the cities of",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] LXX omit; introduced perhaps to harmonize with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 11:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "keep not back a word",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The temptation in the way of suppression would be through natural shrinking from the danger involved. Cp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 4:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 12:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 2.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - Jeremiah is to take his stand ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "in the court of the Lord's house",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the outer court, where the people assembled (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 19:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), and preach ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "unto all the",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "cities of Judah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to the pilgrims who had come from the provincial towns (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 11:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). His discourse is not to be an eloquent appeal to the feelings, but a strict and peremptory announcement; he is to ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "diminish",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "subtract",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "not a word",
        "children": [
          {
            "element": "span",
            "class": "cmt_word",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "not a word",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " (comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 4:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 12:32",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 22:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Jeremiah 26:2",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Accusation and Acquittal of Jeremiah. - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 26:1-7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". His prophecy that temple and city would be destroyed gave occasion to the accusation of the prophet. - ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 26:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"In the beginning of the reign of Jehoiakim, the son of Josiah king of Judah, came this word from Jahveh, saying: ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 26:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Thus said Jahveh: Stand in the court of the house of Jahveh, and speak to all the cities of Judah which come to worship in Jahveh's house, all the words that I have commanded thee to speak to them; take not a word therefrom. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 26:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Perchance they will hearken and turn each from his evil way, that I may repent me of the evil which I purpose to do unto them for the evil of their doings. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 26:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And say unto them: Thus saith Jahveh: If ye hearken not to me, to walk in my law which I have set before you, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 26:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". To hearken to the words of my servants the prophets whom I sent unto you, from early morning on sending, but ye have not hearkened. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 26:6",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Then I make this house like Shiloh, and this city a curse to all the peoples of the earth. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 26:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And the priests and the prophets and all the people heard Jeremiah speaking these words in the house of Jahveh.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "In the discourse of Jeremiah 7, where he was combating the people's false reliance upon the temple, Jeremiah had already threatened that the temple should share the fate of Shiloh, unless the people turned from its evil ways. Now, since that discourse was also delivered in the temple, and since Jeremiah 26:2-6 of the present chapter manifestly communicate only the substance of what the prophet said, several comm. have held these discourses to be identical, and have taken it for granted that the discourse here referred to, belonging to the beginning of Jehoiakim's reign, was given in full in Jeremiah 7, while the history of it has been given in the present chapter by way of supplement (cf. the introductory remarks to Jeremiah 7). But considering that it is a peculiarity of Jeremiah frequently to repeat certain of the main thoughts of his message, the saying of God, that He will do to the temple as He has done to Shiloh, is not sufficient to warrant this assumption. Jeremiah frequently held discourses in the temple, and more than once foretold the destruction of Jerusalem; so that it need not be surprising if on more than one occasion he threatened the temple with the fate of Shiloh. Between the two discourses there is further this distinction: Whereas in Jeremiah 7 the prophet speaks chiefly of the spoliation or destruction of the temple and the expulsion of the people into exile, here in brief incisive words he intimates the destruction of the city of Jerusalem as well; and the present chapter throughout gives the impression that by this, so to speak, peremptory declaration, the prophet sought to move the people finally to decide for Jahveh its God, and that he thus so exasperated the priests and prophets present, that they seized him and pronounced him worthy of death. - According to the heading, this took place in the beginning of the reign of Jehoiakim. The like specification in the heading of Jeremiah 27 does not warrant us to refer the date to the fourth year of this king. \"The beginning\" intimates simply that the discourse belongs to the earlier period of Jehoiakim's reign, without minuter information as to year and day. \"To Jeremiah\" seems to have been dropped out after \"came this word,\" Jeremiah 26:1. The court of the house of God is not necessarily the inner or priests' court of the temple; it may have been the outer one where the people assembled; cf. Jeremiah 19:14. All the \"cities of Judah\" for their inhabitants, as in Jeremiah 11:12. The addition: \"take not a word therefrom,\" cf. Deuteronomy 4:2; Deuteronomy 13:1, indicates the peremptory character of the discourse. In full, without softening the threat by the omission of anything the Lord commanded him, i.e., he is to proclaim the word of the Lord in its full unconditional severity, to move the people, if possible, to repentance, acc. to Jeremiah 26:3. With Jeremiah 26:3, cf. Jeremiah 18:8, etc. - In Jeremiah 26:4-6 we have the contents of the discourse. If they hearken not to the words of the prophet, as has hitherto been the case, the Lord will make the temple as Shiloh, and this city, i.e., Jerusalem, a curse, i.e., an object of curses (cf. Jeremiah 24:9), for all peoples. On this cf. Jeremiah 7:12. But ye have not hearkened. The Chet. הזּאתה Hitz. holds to be an error of transcription; Ew. 173, g, and Olsh. Gramm. 101, c, and 133, a paragogically lengthened form; Bttcher, Lehrb. 665. iii. and 897, 3, a toneless appended suffix, strengthening the demonstrative force: this (city) here.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "In the discourse of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", where he was combating the people's false reliance upon the temple, Jeremiah had already threatened that the temple should share the fate of Shiloh, unless the people turned from its evil ways. Now, since that discourse was also delivered in the temple, and since ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 26:2-6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " of the present chapter manifestly communicate only the substance of what the prophet said, several comm. have held these discourses to be identical, and have taken it for granted that the discourse here referred to, belonging to the beginning of Jehoiakim's reign, was given in full in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", while the history of it has been given in the present chapter by way of supplement (cf. the introductory remarks to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). But considering that it is a peculiarity of Jeremiah frequently to repeat certain of the main thoughts of his message, the saying of God, that He will do to the temple as He has done to Shiloh, is not sufficient to warrant this assumption. Jeremiah frequently held discourses in the temple, and more than once foretold the destruction of Jerusalem; so that it need not be surprising if on more than one occasion he threatened the temple with the fate of Shiloh. Between the two discourses there is further this distinction: Whereas in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " the prophet speaks chiefly of the spoliation or destruction of the temple and the expulsion of the people into exile, here in brief incisive words he intimates the destruction of the city of Jerusalem as well; and the present chapter throughout gives the impression that by this, so to speak, peremptory declaration, the prophet sought to move the people finally to decide for Jahveh its God, and that he thus so exasperated the priests and prophets present, that they seized him and pronounced him worthy of death. - According to the heading, this took place in the beginning of the reign of Jehoiakim. The like specification in the heading of ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 27",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " does not warrant us to refer the date to the fourth year of this king. \"The beginning\" intimates simply that the discourse belongs to the earlier period of Jehoiakim's reign, without minuter information as to year and day. \"To Jeremiah\" seems to have been dropped out after \"came this word,\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 26:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The court of the house of God is not necessarily the inner or priests' court of the temple; it may have been the outer one where the people assembled; cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 19:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". All the \"cities of Judah\" for their inhabitants, as in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 11:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The addition: \"take not a word therefrom,\" cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 4:2",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 13:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", indicates the peremptory character of the discourse. In full, without softening the threat by the omission of anything the Lord commanded him, i.e., he is to proclaim the word of the Lord in its full unconditional severity, to move the people, if possible, to repentance, acc. to ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 26:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". With ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 26:3",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 18:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", etc. - In ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 26:4-6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " we have the contents of the discourse. If they hearken not to the words of the prophet, as has hitherto been the case, the Lord will make the temple as Shiloh, and this city, i.e., Jerusalem, a curse, i.e., an object of curses (cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 24:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), for all peoples. On this cf. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jeremiah 7:12",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". But ye have not hearkened. The Chet. הזּאתה Hitz. holds to be an error of transcription; Ew. 173, g, and Olsh. Gramm. 101, c, and 133, a paragogically lengthened form; Bttcher, Lehrb. 665. iii. and 897, 3, a toneless appended suffix, strengthening the demonstrative force: this (city) here.",
            "children": []
          }
        ]
      }
    ]
  }
]