[{"num":6,"verse":"¶ Woe unto those that are at ease in Zion and to those that trust in the mountain of Samaria, who are named principals among the same nations which shall come upon them, O house of Israel!"},{"num":2,"verse":"Pass unto Calneh and see, and from there go to Hamath the great; then go down to Gath of the Palestinians. Are they better than these kingdoms? or their border greater than your border?"},{"num":3,"verse":"Ye that put far away the evil day and cause the seat of violence to come near;"},{"num":4,"verse":"that lie upon beds of ivory and stretch themselves upon their couches and eat the lambs out of the flock and the calves out of the midst of the stall;"},{"num":5,"verse":"that chant to the sound of the flute and invent to themselves instruments of music, like David;"},{"num":6,"verse":"that drink wine in bowls, and anoint themselves with the chief ointments, but they are not grieved for the affliction of Joseph."},{"num":7,"verse":"Therefore now they shall go captive with the first that go captive, and the banquet of those that stretched themselves upon their couches shall be removed."},{"num":8,"verse":"¶ The Lord GOD has sworn by himself, the LORD God of the hosts said, I abhor the grandeur of Jacob, and hate his palaces: therefore I will give the city with all that is therein over to the enemy."},{"num":9,"verse":"And it shall come to pass, if there remain ten men in one house, that they shall die."},{"num":10,"verse":"And their uncle shall take each one and burn them to bring out the bones out of the house and shall say unto him that is by the sides of the house, Is there yet any with thee? and he shall say, No. Then he shall say, Hold thy tongue, for we may not make mention of the name of the LORD."},{"num":11,"verse":"For, behold, the LORD shall command, and he will smite the great house with breaches and the little house with clefts."},{"num":12,"verse":"Shall horses run upon the rocks? will one plow there with oxen? why have ye turned judgment into hemlock, and the fruit of righteousness into wormwood?"},{"num":13,"verse":"Ye who rejoice in a thing of nought, who say, Have we not taken to us horns by our own strength?"},{"num":14,"verse":"But, behold, I will raise up against you Gentiles, O house of Israel, said the LORD God of the hosts, and they shall afflict you from the entering in of Hemath unto the river of the wilderness."}]