[{"num":11,"verse":"And when they came nigh to Jerusalem, unto Bethphage and Bethany at the Mount of Olives, He sent forth two of His disciples"},{"num":2,"verse":"and said unto them, “Go your way into the village opposite you, and as soon as ye have entered into it, ye shall find a colt tied, whereon man never sat. Loose him and bring him."},{"num":3,"verse":"And if any man say unto you, ‘Why do ye this?’ say ye that the Lord hath need of him, and straightway he will send him hither.”"},{"num":4,"verse":"And they went their way and found the colt tied outside by the door at a place where two ways met, and they loosed him."},{"num":5,"verse":"And certain of those who stood there said unto them, “What do ye, loosing the colt?”"},{"num":6,"verse":"And they said unto them even as Jesus had commanded, and they let them go."},{"num":7,"verse":"And they brought the colt to Jesus and cast their garments on him, and He sat upon him."},{"num":8,"verse":"And many spread their garments upon the way, and others cut down branches off the trees and strewed them upon the way."},{"num":9,"verse":"And those who went before, and those who followed, cried, saying, “Hosanna! Blessed is He that cometh in the name of the Lord!"},{"num":10,"verse":"Blessed be the kingdom of our father David, that cometh in the name of the Lord! Hosanna in the highest!”"},{"num":11,"verse":"And Jesus entered into Jerusalem and into the temple. And when He had looked round about upon all things, as now the eventide had come, He went out unto Bethany with the twelve."},{"num":12,"verse":"And on the morrow, when they had come from Bethany, He was hungry;"},{"num":13,"verse":"and seeing a fig tree afar off having leaves, He went to see if perhaps He might find any thing thereon. But when He came to it He found nothing but leaves, for the time for figs was not yet."},{"num":14,"verse":"And Jesus spoke and said unto it, “Let no man eat fruit of thee hereafter for ever.” And His disciples heard it."},{"num":15,"verse":"And they came to Jerusalem. And Jesus went into the temple, and began to cast out those who sold and bought in the temple, and overthrew the tables of the moneychangers and the seats of those who sold doves."},{"num":16,"verse":"And He would not suffer that any man should carry any vessel through the temple."},{"num":17,"verse":"And He taught, saying unto them, “Is it not written, ‘My house shall be called for all nations the house of prayer’? But ye have made it a den of thieves.”"},{"num":18,"verse":"And the scribes and chief priests heard it, and sought how they might destroy Him; for they feared Him, because all the people were astonished at His doctrine."},{"num":19,"verse":"And when evening had come, He went out of the city."},{"num":20,"verse":"And in the morning as they passed by, they saw the fig tree dried up from the roots."},{"num":21,"verse":"And Peter, calling to remembrance, said unto Him, “Master, behold, the fig tree which Thou cursed is withered away.”"},{"num":22,"verse":"And Jesus answering, said unto them, “Have faith in God."},{"num":23,"verse":"For verily I say unto you, that whosoever shall say unto this mountain, ‘Be thou removed, and be thou cast into the sea,’ and shall not doubt in his heart, but shall believe that those things which he saith shall come to pass, he shall have whatsoever he saith."},{"num":24,"verse":"Therefore I say unto you, what things so ever ye desire when ye pray, believe that ye receive them, and ye shall have them."},{"num":25,"verse":"And when ye stand praying, forgive if ye have aught against any, that your Father also who is in Heaven may forgive you your trespasses."},{"num":26,"verse":"But if ye do not forgive, neither will your Father who is in Heaven forgive your trespasses.”"},{"num":27,"verse":"And they came again to Jerusalem. And as He was walking in the temple, there came to Him the chief priests and the scribes and the elders,"},{"num":28,"verse":"and said unto Him, “By what authority doest thou these things? And who gave thee this authority to do these things?”"},{"num":29,"verse":"And Jesus answered and said unto them, “I will also ask of you one question; answer Me, and I will tell you by what authority I do these things."},{"num":30,"verse":"The baptism of John: was it from Heaven, or of men? Answer Me.”"},{"num":31,"verse":"And they reasoned among themselves, saying, “If we shall say ‘From Heaven,’ he will say ‘Why then did ye not believe him?’"},{"num":32,"verse":"But if we shall say ‘Of men’” — they feared the people, for all men counted John that he was a prophet indeed."},{"num":33,"verse":"And they answered and said unto Jesus, “We cannot tell.” And Jesus answering, said unto them, “Neither do I tell you by what authority I do these things.”"}]