[{"header":"Jesus’ Triumphant Entry"},{"num":11,"verse":"As Jesus and his disciples approached Jerusalem, they came to the towns of Bethphage and Bethany on the Mount of Olives. Jesus sent two of them on ahead."},{"num":2,"verse":"“Go into that village over there,” he told them. “As soon as you enter it, you will see a young donkey tied there that no one has ever ridden. Untie it and bring it here."},{"num":3,"verse":"If anyone asks, ‘What are you doing?’ just say, ‘The Lord needs it and will return it soon.’”"},{"num":4,"verse":"The two disciples left and found the colt standing in the street, tied outside the front door."},{"num":5,"verse":"As they were untying it, some bystanders demanded, “What are you doing, untying that colt?”"},{"num":6,"verse":"They said what Jesus had told them to say, and they were permitted to take it."},{"num":7,"verse":"Then they brought the colt to Jesus and threw their garments over it, and he sat on it."},{"num":8,"verse":"Many in the crowd spread their garments on the road ahead of him, and others spread leafy branches they had cut in the fields."},{"num":9,"verse":"Jesus was in the center of the procession, and the people all around him were shouting,"},{"num":11,"verse":"So Jesus came to Jerusalem and went into the Temple. After looking around carefully at everything, he left because it was late in the afternoon. Then he returned to Bethany with the twelve disciples."},{"header":"Jesus Curses the Fig Tree"},{"num":12,"verse":"The next morning as they were leaving Bethany, Jesus was hungry."},{"num":13,"verse":"He noticed a fig tree in full leaf a little way off, so he went over to see if he could find any figs. But there were only leaves because it was too early in the season for fruit."},{"num":14,"verse":"Then Jesus said to the tree, “May no one ever eat your fruit again!” And the disciples heard him say it."},{"header":"Jesus Clears the Temple"},{"num":15,"verse":"When they arrived back in Jerusalem, Jesus entered the Temple and began to drive out the people buying and selling animals for sacrifices. He knocked over the tables of the money changers and the chairs of those selling doves,"},{"num":16,"verse":"and he stopped everyone from using the Temple as a marketplace."},{"num":17,"verse":"He said to them, “The Scriptures declare, ‘My Temple will be called a house of prayer for all nations,’ but you have turned it into a den of thieves.”"},{"num":18,"verse":"When the leading priests and teachers of religious law heard what Jesus had done, they began planning how to kill him. But they were afraid of him because the people were so amazed at his teaching."},{"num":19,"verse":"That evening Jesus and the disciples left the city."},{"num":20,"verse":"The next morning as they passed by the fig tree he had cursed, the disciples noticed it had withered from the roots up."},{"num":21,"verse":"Peter remembered what Jesus had said to the tree on the previous day and exclaimed, “Look, Rabbi! The fig tree you cursed has withered and died!”"},{"num":22,"verse":"Then Jesus said to the disciples, “Have faith in God."},{"num":23,"verse":"I tell you the truth, you can say to this mountain, ‘May you be lifted up and thrown into the sea,’ and it will happen. But you must really believe it will happen and have no doubt in your heart."},{"num":24,"verse":"I tell you, you can pray for anything, and if you believe that you’ve received it, it will be yours."},{"num":25,"verse":"But when you are praying, first forgive anyone you are holding a grudge against, so that your Father in heaven will forgive your sins, too.”"},{"header":"The Authority of Jesus Challenged"},{"num":27,"verse":"Again they entered Jerusalem. As Jesus was walking through the Temple area, the leading priests, the teachers of religious law, and the elders came up to him."},{"num":28,"verse":"They demanded, “By what authority are you doing all these things? Who gave you the right to do them?”"},{"num":29,"verse":"“I’ll tell you by what authority I do these things if you answer one question,” Jesus replied."},{"num":30,"verse":"“Did John’s authority to baptize come from heaven, or was it merely human? Answer me!”"},{"num":31,"verse":"They talked it over among themselves. “If we say it was from heaven, he will ask why we didn’t believe John."},{"num":32,"verse":"But do we dare say it was merely human?” For they were afraid of what the people would do, because everyone believed that John was a prophet."},{"num":33,"verse":"So they finally replied, “We don’t know.”"}]