[{"header":"Chapter 26"},{"num":19,"verse":"The Second Census. After the plague "},{"num":1,"verse":"the Lord said to Moses and Eleazar, son of Aaron the priest: "},{"num":2,"verse":"Take a census, by ancestral houses, throughout the community of the Israelites of all those of twenty years or more who are eligible for military service in Israel. "},{"num":3,"verse":"So on the plains of Moab along the Jordan at Jericho, Moses and Eleazar the priest enrolled them, "},{"num":4,"verse":"those of twenty years or more, as the Lord had commanded Moses."},{"num":5,"verse":"Reuben, the firstborn of Israel. The descendants of Reuben by their clans were: through Hanoch, the clan of the Hanochites; through Pallu, the clan of the Palluites; "},{"num":6,"verse":"through Hezron, the clan of the Hezronites; through Carmi, the clan of the Carmites. "},{"num":7,"verse":"These were the clans of the Reubenites, and those enrolled numbered forty-three thousand seven hundred and thirty."},{"num":8,"verse":"From Pallu descended Eliab. "},{"num":9,"verse":"The sons of Eliab were Nemuel, Dathan, and Abiram—the same Dathan and Abiram, ones designated by the community, who contended with Moses and Aaron as part of Korah’s faction when they contended with the Lord. "},{"num":10,"verse":"The earth opened its mouth and swallowed them, along with Korah, as a warning. The faction was destroyed when the fire consumed two hundred and fifty men. "},{"num":11,"verse":"The descendants of Korah, however, did not die out."},{"num":12,"verse":"The descendants of Simeon by clans were: through Nemuel, the clan of the Nemuelites; through Jamin, the clan of the Jaminites; through Jachin, the clan of the Jachinites; "},{"num":13,"verse":"through Zerah, the clan of the Zerahites; through Shaul, the clan of the Shaulites. "},{"num":14,"verse":"These were the clans of the Simeonites, twenty-two thousand two hundred."},{"num":15,"verse":"The descendants of Gad by clans were: through Zephon, the clan of the Zephonites; through Haggi, the clan of the Haggites; through Shuni, the clan of the Shunites; "},{"num":16,"verse":"through Ozni, the clan of the Oznites; through Eri, the clan of the Erites; "},{"num":17,"verse":"through Arod, the clan of the Arodites; through Areli, the clan of the Arelites. "},{"num":18,"verse":"These were the clans of the descendants of Gad, of whom there were enrolled forty thousand five hundred."},{"num":19,"verse":"The sons of Judah were Er and Onan. Er and Onan died in the land of Canaan. "},{"num":20,"verse":"The descendants of Judah by their clans were: through Shelah, the clan of the Shelahites; through Perez, the clan of the Perezites; through Zerah, the clan of the Zerahites. "},{"num":21,"verse":"The descendants of Perez were: through Hezron, the clan of the Hezronites; through Hamul, the clan of the Hamulites. "},{"num":22,"verse":"These were the clans of Judah, of whom there were enrolled seventy-six thousand five hundred."},{"num":23,"verse":"The descendants of Issachar by their clans were: through Tola, the clan of the Tolaites; through Puvah, the clan of the Puvahites; "},{"num":24,"verse":"through Jashub, the clan of the Jashubites; through Shimron, the clan of the Shimronites. "},{"num":25,"verse":"These were the clans of Issachar, of whom there were enrolled sixty-four thousand three hundred."},{"num":26,"verse":"The descendants of Zebulun by their clans were: through Sered, the clan of the Seredites; through Elon, the clan of the Elonites; through Jahleel, the clan of the Jahleelites. "},{"num":27,"verse":"These were the clans of the Zebulunites, of whom there were enrolled sixty thousand five hundred."},{"num":28,"verse":"The sons of Joseph were Manasseh and Ephraim. "},{"num":29,"verse":"The descendants of Manasseh by clans were: through Machir, the clan of the Machirites. Now Machir begot Gilead: through Gilead, the clan of the Gileadites. "},{"num":30,"verse":"The descendants of Gilead were: through Iezer, the clan of the Iezrites; through Helek, the clan of the Helekites; "},{"num":31,"verse":"through Asriel, the clan of the Asrielites; through Shechem, the clan of the Shechemites; "},{"num":32,"verse":"through Shemida, the clan of the Shemidaites; through Hepher, the clan of the Hepherites. "},{"num":33,"verse":"As for Zelophehad, son of Hepher—he had no sons, but only daughters. The names of the daughters of Zelophehad were Mahlah, Noah, Hoglah, Milcah and Tirzah. "},{"num":34,"verse":"These were the clans of Manasseh, and those enrolled numbered fifty-two thousand seven hundred."},{"num":35,"verse":"These were the descendants of Ephraim by their clans: through Shuthelah, the clan of the Shuthelahites; through Becher, the clan of the Becherites; through Tahan, the clan of the Tahanites. "},{"num":36,"verse":"These were the descendants of Shuthelah: through Eran, the clan of the Eranites. "},{"num":37,"verse":"These were the clans of the Ephraimites, of whom there were enrolled thirty-two thousand five hundred."},{"num":38,"verse":"The descendants of Benjamin by their clans were: through Bela, the clan of the Belaites; through Ashbel, the clan of the Ashbelites; through Ahiram, the clan of the Ahiramites; "},{"num":39,"verse":"through Shupham, the clan of the Shuphamites; through Hupham, the clan of the Huphamites. "},{"num":40,"verse":"The sons of Bela were Ard and Naaman: through Ard, the clan of the Ardites; through Naaman, the clan of the Naamites. "},{"num":41,"verse":"These were the descendants of Benjamin by their clans, of whom there were enrolled forty-five thousand six hundred."},{"num":42,"verse":"These were the descendants of Dan by their clans: through Shuham the clan of the Shuhamites. These were the clans of Dan, "},{"num":43,"verse":"of whom there were enrolled sixty-four thousand four hundred."},{"num":44,"verse":"The descendants of Asher by their clans were: through Imnah, the clan of the Imnites; through Ishvi, the clan of the Ishvites; through Beriah, the clan of the Beriites; "},{"num":45,"verse":"through Heber, the clan of the Heberites; through Malchiel, the clan of the Malchielites. "},{"num":46,"verse":"The name of Asher’s daughter was Serah. "},{"num":47,"verse":"These were the clans of the descendants of Asher, of whom there were enrolled fifty-three thousand four hundred."},{"num":48,"verse":"The descendants of Naphtali by their clans were: through Jahzeel, the clan of the Jahzeelites; through Guni, the clan of the Gunites; "},{"num":49,"verse":"through Jezer, the clan of the Jezerites; through Shillem, the clan of the Shillemites. "},{"num":50,"verse":"These were the clans of Naphtali, of whom there were enrolled forty-five thousand four hundred."},{"num":51,"verse":"These were the Israelites who were enrolled: six hundred and one thousand seven hundred and thirty."},{"num":52,"verse":"The Lord said to Moses: "},{"num":53,"verse":"Among these the land shall be divided as their heritage in keeping with the number of people named. "},{"num":54,"verse":"To a large tribe you shall assign a large heritage, to a small tribe a small heritage, each receiving its heritage in proportion to the number enrolled in it. "},{"num":55,"verse":"But the land shall be divided by lot, all inheriting according to the lists of their ancestral tribes. "},{"num":56,"verse":"As the lot falls the heritage of each tribe, large or small, will be assigned."},{"num":57,"verse":"Census of the Levites. These were the Levites enrolled by clans: through Gershon, the clan of the Gershonites; through Kohath, the clan of the Kohathites; through Merari, the clan of the Merarites. "},{"num":58,"verse":"These were clans of Levi: the clan of the Libnites, the clan of the Hebronites, the clan of the Mahlites, the clan of the Mushites, the clan of the Korahites."},{"num":59,"verse":"whose wife was named Jochebed. She was the daughter of Levi, born to Levi in Egypt. To Amram she bore Aaron and Moses and Miriam their sister. "},{"num":60,"verse":"To Aaron were born Nadab and Abihu, Eleazar and Ithamar. "},{"num":61,"verse":"But Nadab and Abihu died when they offered unauthorized fire before the Lord. "},{"num":62,"verse":"The Levites enrolled were twenty-three thousand, every male one month or more of age. They were not enrolled with the other Israelites, however, for no heritage was given them among the Israelites."},{"num":63,"verse":"These, then, were those enrolled by Moses and Eleazar the priest, when they enrolled the Israelites on the plains of Moab along the Jordan at Jericho. "},{"num":64,"verse":"Among them there was not one of those who had been enrolled by Moses and Aaron the priest, when they enrolled the Israelites in the wilderness of Sinai. "},{"num":65,"verse":"For the Lord had told them that they would surely die in the wilderness, and not one of them was left except Caleb, son of Jephunneh, and Joshua, son of Nun."}]