[[],[{"type":"header","content":"The Widow’s Oil"},{"type":"prose","content":"Now one of the wives  of the sons of the prophets cried out to Elisha [for help], saying “Your servant my husband is dead, and you know that your servant [reverently] feared the ; but the creditor is coming to take my two sons to be his slaves [in payment for a loan].” "}],[{"type":"prose","content":"Elisha said to her, “What shall I do for you? Tell me, what do you have [of value] in the house?” She said, “Your maidservant has nothing in the house except a [small] jar of [olive] oil.” "}],[{"type":"prose","content":"Then he said, “Go, borrow containers from all your neighbors, empty containers—and not  a few. "}],[{"type":"prose","content":"Then you shall go in and shut the door behind you and your sons, and pour out [the oil you have] into all these containers, and you shall set aside each one when it is full.” "}],[{"type":"prose","content":"So she left him and shut the door behind her and her sons; they were bringing her  as she poured [the oil]. "}],[{"type":"prose","content":"When the containers were all full, she said to her son, “Bring me another container.” And he said to her, “There is not a one left.” Then the oil stopped [multiplying]. "}],[{"type":"prose","content":"Then she came and told the man of God. He said, “Go, sell the oil and pay your debt, and you and your sons can live on the rest.”"},{"type":"header","content":"The Shunammite Woman"}],[{"type":"prose","content":"Now there came a day when Elisha went over to Shunem, where there was a prominent  influential woman, and she persuaded him to eat a meal. Afterward, whenever he passed by, he stopped there for a meal. "}],[{"type":"prose","content":"She said to her husband, “Behold, I sense that this is a holy man of God who frequently passes our way. "}],[{"type":"prose","content":"Please, let us make a small, fully-walled upper room [on the housetop] and put a bed there for him, with a table, a chair, and a lampstand. Then whenever he comes to  us, he can turn in there.”"}],[{"type":"prose","content":"One day he came there and turned in to the upper room and lay down to rest. "}],[{"type":"prose","content":"And he said to Gehazi his servant, “Call this Shunammite.” So he called her and she stood before him. "}],[{"type":"prose","content":"Now he said to Gehazi, “Say to her now, ‘You have gone to all this trouble for us; what can I do for you? Would you  to be mentioned to the king or to the captain of the army?’” She answered, “I live among my own people [in peace and security and need no special favors].” "}],[{"type":"prose","content":"Later Elisha said, “What then is to be done for her?” Gehazi answered, “Well, she has no son and her husband is old.” "}],[{"type":"prose","content":"He said, “Call her.” So Gehazi called her, and she [came and] stood in the doorway. "}],[{"type":"prose","content":"Elisha said, “At this season next year, you will embrace a son.” She said, “No, my lord. O man of God, do not lie to your maidservant.”"}],[{"type":"prose","content":"But the woman conceived and gave birth to a son at that season the next year, just as Elisha had said to her."},{"type":"header","content":"The Shunammite’s Son"}],[{"type":"prose","content":"When the child was grown, the day came that he went out to his father, to the reapers. "}],[{"type":"prose","content":"But he said to his father, “My head, my head.” The man said to his servant, “Carry him to his mother.” "}],[{"type":"prose","content":"When he had carried and brought him to his mother, he sat on her lap until noon, and  he died. "}],[{"type":"prose","content":"She went up and laid him on the bed of the man of God, and shut  [of the small upper room] behind him and left. "}],[{"type":"prose","content":"Then she called to her husband and said, “Please send me one of the servants and one of the donkeys, so that I may run to the man of God and return.” "}],[{"type":"prose","content":"He said, “Why are you going to him today? It is neither the New Moon nor the Sabbath.” And she said, “ all right.” "}],[{"type":"prose","content":"Then she saddled the donkey and said to her servant, “Drive [the animal] fast; do not slow down the pace for me unless I tell you.” "}],[{"type":"prose","content":"So she set out and came to the man of God at Mount Carmel.When the man of God saw her at a distance, he said to Gehazi his servant, “Look, there is the Shunammite . "}],[{"type":"prose","content":"Please run now to meet her and ask her, ‘Is it well with you? Is it well with your husband? Is it well with the child?’” And she answered, “It is well.” "}],[{"type":"prose","content":"When she came to the mountain to the man of God, she took hold of his feet. Gehazi approached to push her away; but the man of God said, “Let her alone, for her soul is desperate  troubled within her; and the  has hidden  from me and has not told me.” "}],[{"type":"prose","content":"Then she said, “Did I ask for a son from my lord? Did I not say, ‘Do not give me false hope’?”"}],[{"type":"prose","content":"Then he said to Gehazi, “Gird up your loins (prepare now!) and take my staff in your hand, and go [to the woman’s house]; if you meet any man [along the way], do not greet him and if a man greets you, do not [stop to] answer him; and lay my staff on the face of the boy [as soon as you reach the house].” "}],[{"type":"prose","content":"The mother of the child said, “As the  lives and as your soul lives, I will not leave you.” So Elisha arose and followed her. "}],[{"type":"prose","content":"Gehazi went on ahead of them and laid the staff on the boy’s face, but there was no sound or response [from the boy]. So he turned back to meet Elisha and told him, “The boy has not awakened (revived).”"}],[{"type":"prose","content":"When Elisha came into the house, the child was dead and lying on his bed. "}],[{"type":"prose","content":"So he went in, shut the door behind the two of them, and prayed to the . "}],[{"type":"prose","content":"Then he went up and lay on the child and put his mouth on his mouth, his eyes on his eyes, and his hands on his hands. And as he stretched himself out on him  held him, the boy’s skin became warm. "}],[{"type":"prose","content":"Then he returned and walked in the house once back and forth, and went up [again] and stretched himself out on him; and the boy sneezed seven times and he opened his eyes. "}],[{"type":"prose","content":"Then Elisha called Gehazi and said, “Call this Shunammite.” So he called her. And when she came to him, he said, “Pick up your son.” "}],[{"type":"prose","content":"She came and fell at his feet, bowing herself to the ground [in respect and gratitude]. Then she picked up her son and left."},{"type":"header","content":"The Poisonous Stew"}],[{"type":"prose","content":"Elisha came back to Gilgal during a famine in the land. The sons of the prophets were sitting before him, and he said to his servant, “Put on the large pot and cook stew for the sons of the prophets.” "}],[{"type":"prose","content":"Then one [of them] went into the field to gather herbs, and found a wild vine and gathered from it a lapful of wild gourds, and came and cut them up into the pot of stew, although they did not know . "}],[{"type":"prose","content":"So they served it for the men to eat. But as they ate the stew, they cried out, “O man of God, there is death in the pot.” And they could not eat it. "}],[{"type":"prose","content":"But he said, “Bring flour.” And he threw it into the pot and said, “Serve it for the people so that they may eat.” Then there was nothing harmful in the pot."}],[{"type":"prose","content":"Now [at another time] a man from Baal-shalisha came and brought the man of God bread of the first fruits, twenty loaves of barley bread, and fresh ears of grain [in the husk] in his sack. And Elisha said, “Give it to the people [affected by the famine] so that they may eat.” "}],[{"type":"prose","content":"His servant said, “How am I to set [only] this before a hundred [hungry] men?” He said, “Give it to the people so that they may eat, for thus says the , ‘They shall eat and have  left.’” "}],[{"type":"prose","content":"So he set it before them, and they ate and left , in accordance with the word of the ."}]]