[{"header":"Paul and the False Apostles"},{"num":11,"verse":"I wish you would tolerate me, even when I am a bit foolish. Please do! "},{"num":2,"verse":"I am jealous for you, just as God is; you are like a pure virgin whom I have promised in marriage to one man only, Christ himself. "},{"num":3,"verse":"I am afraid that your minds will be corrupted and that you will abandon your full and pure devotion to Christ—in the same way that Eve was deceived by the snake's clever lies. "},{"num":4,"verse":"For you gladly tolerate anyone who comes to you and preaches a different Jesus, not the one we preached; and you accept a spirit and a gospel completely different from the Spirit and the gospel you received from us!"},{"num":5,"verse":"I do not think that I am the least bit inferior to those very special so-called “apostles” of yours! "},{"num":6,"verse":"Perhaps I am an amateur in speaking, but certainly not in knowledge; we have made this clear to you at all times and in all conditions."},{"num":7,"verse":"I did not charge you a thing when I preached the Good News of God to you; I humbled myself in order to make you important. Was that wrong of me? "},{"num":8,"verse":"While I was working among you, I was paid by other churches. I was robbing them, so to speak, in order to help you. "},{"num":9,"verse":"And during the time I was with you I did not bother you for help when I needed money; the believers who came from Macedonia brought me everything I needed. As in the past, so in the future: I will never be a burden to you! "},{"num":10,"verse":"By Christ's truth in me, I promise that this boast of mine will not be silenced anywhere in all of Achaia. "},{"num":11,"verse":"Do I say this because I don't love you? God knows I love you!"},{"num":12,"verse":"I will go on doing what I am doing now, in order to keep those other “apostles” from having any reason for boasting and saying that they work in the same way that we do. "},{"num":13,"verse":"Those men are not true apostles—they are false apostles, who lie about their work and disguise themselves to look like real apostles of Christ. "},{"num":14,"verse":"Well, no wonder! Even Satan can disguise himself to look like an angel of light! "},{"num":15,"verse":"So it is no great thing if his servants disguise themselves to look like servants of righteousness. In the end they will get exactly what their actions deserve."},{"header":"Paul's Sufferings as an Apostle"},{"num":16,"verse":"I repeat: no one should think that I am a fool. But if you do, at least accept me as a fool, just so I will have a little to boast of. "},{"num":17,"verse":"Of course what I am saying now is not what the Lord would have me say; in this matter of boasting I am really talking like a fool. "},{"num":18,"verse":"But since there are so many who boast for merely human reasons, I will do the same. "},{"num":19,"verse":"You yourselves are so wise, and so you gladly tolerate fools! "},{"num":20,"verse":"You tolerate anyone who orders you around or takes advantage of you or traps you or looks down on you or slaps you in the face. "},{"num":21,"verse":"I am ashamed to admit that we were too timid to do those things!"},{"num":22,"verse":"Are they Hebrews? So am I. Are they Israelites? So am I. Are they Abraham's descendants? So am I. "},{"num":23,"verse":"Are they Christ's servants? I sound like a madman—but I am a better servant than they are! I have worked much harder, I have been in prison more times, I have been whipped much more, and I have been near death more often. "},{"num":24,"verse":"Five times I was given the thirty-nine lashes by the Jews; "},{"num":25,"verse":"three times I was whipped by the Romans; and once I was stoned. I have been in three shipwrecks, and once I spent twenty-four hours in the water. "},{"num":26,"verse":"In my many travels I have been in danger from floods and from robbers, in danger from my own people and from Gentiles; there have been dangers in the cities, dangers in the wilds, dangers on the high seas, and dangers from false friends. "},{"num":27,"verse":"There has been work and toil; often I have gone without sleep; I have been hungry and thirsty; I have often been without enough food, shelter, or clothing. "},{"num":28,"verse":"And not to mention other things, every day I am under the pressure of my concern for all the churches. "},{"num":29,"verse":"When someone is weak, then I feel weak too; when someone is led into sin, I am filled with distress."},{"num":30,"verse":"If I must boast, I will boast about things that show how weak I am. "},{"num":31,"verse":"The God and Father of the Lord Jesus—blessed be his name forever!—knows that I am not lying. "},{"num":32,"verse":"When I was in Damascus, the governor under King Aretas placed guards at the city gates to arrest me. "},{"num":33,"verse":"But I was let down in a basket through an opening in the wall and escaped from him."}]