[{"num":11,"verse":"I would you could suffer me a little in my foolishness, yea and I ask you to bear with me. "},{"num":2,"verse":"For I am jealous over you with godly jealousy. For I espoused you to one man, to present you a chaste virgin to Christ. "},{"num":3,"verse":"But I fear that, as the serpent beguiled Eve through his subtlety, so your minds might be corrupted from the simplicity that is in Christ. "},{"num":4,"verse":"For if he who comes preaches another Jesus than him whom we preached, or if you are given another spirit than that which you were given, or another gospel than that which you were given, you might right well be content."},{"num":5,"verse":"I suppose that I was not behind the chief apostles. "},{"num":6,"verse":"Though I be poor in speaking, yet I am not so in knowledge. However, among you we are known to the utmost, who we are in all things. "},{"num":7,"verse":"Did I sin, because I humbled myself so that you could be exalted, and because I preached to you the gospel of God free? "},{"num":8,"verse":"I robbed other congregations, and took support from them in order to serve you. "},{"num":9,"verse":"And when I was present with you and had need, I was a burden to no one, for that which was lacking to me, the brethren who came from Macedonia supplied. And in all things I kept myself so that I would not be burdensome to you. And I will continue so to keep myself. "},{"num":10,"verse":"If the truth of Christ is in me, this claim will not be taken from me in the regions of Achaia. "},{"num":11,"verse":"Why? Because I do not love you? God knows. "},{"num":12,"verse":"Nevertheless, what I do, that I will continue to do, so as to cut away occasion from those who desire occasion to seem like us in the things that they claim."},{"num":13,"verse":"For the false apostles are deceitful workers, and fashion themselves to be like the apostles of Christ. "},{"num":14,"verse":"And no wonder, for Satan himself is changed into the fashion of an angel of light. "},{"num":15,"verse":"Therefore it is no great thing if his ministers fashion themselves as though they were the ministers of righteousness – whose end shall be according to their deeds."},{"num":16,"verse":"I say again, lest anyone think that I am foolish, or else even now take me as a fool if I boast a little, "},{"num":17,"verse":"that what I am saying I do not say after the ways of the Lord, but as it were foolishly, since we have now come to boasting. "},{"num":18,"verse":"Seeing that many boast after the flesh, I will boast also. "},{"num":19,"verse":"For you suffer fools gladly, because you yourselves are wise. "},{"num":20,"verse":"For you oblige even if a man brings you into bondage, if a man devours, if a man takes, if a man exalts himself, if a man strikes you on the face. "},{"num":21,"verse":"I speak by way of rebuke. As if we were weak!"},{"num":22,"verse":"they are Hebrews; so am I. They are Israelites; so am I. They are the seed of Abraham; so am I. "},{"num":23,"verse":"They are the ministers of Christ (I speak like a fool); I am more so: in labours more abundant, in stripes above measure, in prison more frequently, in death often."},{"num":24,"verse":"Five times from the Jews I received every time forty stripes less one. "},{"num":25,"verse":"Three times I was beaten with rods. I was once stoned. I suffered shipwreck three times. Night and day I have been in the deep of the sea, "},{"num":26,"verse":"often journeying, in danger in rivers, in danger from robbers, in danger from my own nation, in danger among the heathen. I have been in danger in cities, in danger in the countryside, in danger on the sea, in danger among false brethren, "},{"num":27,"verse":"in labour and travail, in sleepless nights often, in hunger, in thirst – going without food often, in cold and without clothing. "},{"num":28,"verse":"And besides the things that outwardly happen to me, I am daily concerned and do care for all the congregations. "},{"num":29,"verse":"Who is sick, and I am not sick? Who is hurt in the faith and my heart does not burn? "},{"num":30,"verse":"If I must boast, I will boast of my afflictions. "},{"num":31,"verse":"The God and Father of our Lord Jesus Christ, who is blessed forevermore, knows that I do not speak untruly."},{"num":32,"verse":"In the city of Damascus, the governor of the people under king Aretas laid watch in the city of the Damascenes, and would have captured me. "},{"num":33,"verse":"But at a window I was let down in a basket through the wall, and so escaped his hands."}]