[{"header":"Super-Apostles?"},{"num":11,"verse":"I’d be glad if you would bear with me in a little bit of foolishness. Yes: bear with me, please! "},{"num":2,"verse":"I’m jealous over you, and it’s God’s own jealousy: I arranged to marry you off, like a pure virgin, to the one man I presented you to, namely the Messiah. "},{"num":3,"verse":"But the serpent tricked Eve with its cunning, and in the same way I’m afraid that your minds may be corrupted from the single-mindedness and purity which the Messiah’s people should have. "},{"num":4,"verse":"For if someone comes and announces a different Jesus from the one we announced to you, or if you receive a different spirit, one you hadn’t received before, or a different gospel, one you hadn’t accepted before, you put up with that all right. "},{"num":5,"verse":"According to my calculations, you see, I am every bit as good as these super-apostles. "},{"num":6,"verse":"I may be untutored in speaking, but that certainly doesn’t apply to my knowledge. Surely that’s been made quite clear to you, in every way and on every point!"},{"header":"No, They Are False Apostles!"},{"num":7,"verse":"Did I then commit a sin when I humbled myself in order to exalt you? When I announced the gospel of God to you without charging you for it? "},{"num":8,"verse":"I robbed other churches by accepting payment from them in order to serve you; "},{"num":9,"verse":"and when I was with you, and was in need of anything, I didn’t lay a burden on anybody, because my needs were more than met by the brothers who came from Macedonia. That’s how I stopped myself from being a burden to you – and I intend to carry on in the same way. "},{"num":10,"verse":"As the Messiah’s truthfulness is in me, this boast of mine will not be silenced in the regions of Achaea. "},{"num":11,"verse":"Why? Because I don’t love you? God knows ...!"},{"num":12,"verse":"I’m going to continue to do what I’ve always done, so as to cut off any opportunity (for those who want such an opportunity!) for anyone to look as if they can match us in the things they boast about. "},{"num":13,"verse":"Such people are false apostles! The only work they do is to deceive! They transform themselves so that they look like apostles of the Messiah – "},{"num":14,"verse":"and no wonder. The satan himself transforms himself to look like an angel of light, "},{"num":15,"verse":"so it isn’t surprising if his servants transform themselves to look like servants of righteousness. They will end up where their deeds are taking them."},{"header":"The Boasting of a Reluctant Fool"},{"num":16,"verse":"I’ll say it again: don’t let anyone think I’m a fool! But if they do – well, all right then, welcome me as a fool, so that I can do a little bit of boasting! "},{"num":17,"verse":"What I’m going to say now, I’m not saying as if it came from the Lord, but as if I was a fool, as if I really did want to indulge myself in this kind of boasting. "},{"num":18,"verse":"Plenty of people are boasting in human terms, after all, so why shouldn’t I boast as well? "},{"num":19,"verse":"After all, you put up with fools readily enough, since you are so wise yourselves. "},{"num":20,"verse":"You put up with it if someone makes you their slave, or if they eat up your property, or overpower you, or give themselves airs, or slap you in the face. "},{"num":21,"verse":"Well, I’m ashamed to say it: we weren’t strong enough for that!"},{"header":"Boasting of Weaknesses"},{"num":22,"verse":"Are they Hebrews? So am I. Are they Israelites? So am I. Are they the seed of Abraham? So am I. "},{"num":23,"verse":"Are they servants of the Messiah? – I’m talking like a raving madman – I’m a better one. I’ve worked harder, been in prison more often, been beaten more times than I can count, and I’ve often been close to death. "},{"num":24,"verse":"Five times I’ve had the Jewish beating, forty lashes less one. "},{"num":25,"verse":"Three times I was beaten with rods; once I was stoned; three times I was shipwrecked; I was adrift in the sea for a night and a day. "},{"num":26,"verse":"I’ve been constantly travelling, facing dangers from rivers, dangers from brigands, dangers from my own people, dangers from foreigners, dangers in the town, dangers in the countryside, dangers at sea, dangers from false believers. "},{"num":27,"verse":"I’ve toiled and laboured, I’ve burnt the candle at both ends, I’ve been hungry and thirsty, I’ve often gone without food altogether, I’ve been cold and naked."},{"num":28,"verse":"Quite apart from all that, I have this daily pressure on me, my care for all the churches. "},{"num":29,"verse":"Who is weak and I’m not weak? Who is offended without me burning with shame?"},{"num":30,"verse":"If I must boast, I will boast of my weaknesses. "},{"num":31,"verse":"The God and father of the Lord Jesus, who is blessed for ever, knows that I’m not lying: "},{"num":32,"verse":"in Damascus, King Aretas, the local ruler, was guarding the city of Damascus so that he could capture me, "},{"num":33,"verse":"but I was let down in a basket through a window and over the wall, and I escaped his clutches."}]