[{"num":11,"verse":"Would to God you could suffer a little of my foolishness, and indeed, suffer me."},{"num":2,"verse":"For I am jealous over you with godly jealousy. For I have prepared you for one husband; to present you as a pure virgin to Christ."},{"num":3,"verse":"Yet I fear, however, that just as the serpent tricked Eve through his subtlety, so your minds may be corrupted from the simplicity that is in Christ."},{"num":4,"verse":"For if someone comes, preaching another Jesus whom we have not preached - or if you receive another spirit whom you have not received, or another gospel which you have not received - you might well tolerate him."},{"num":5,"verse":"For I suppose that I am not inferior to the very chief Apostles."},{"num":6,"verse":"And though I am unskilled in speaking, I am not so in knowledge. And among you we have made ourselves clearly understood in all things."},{"num":7,"verse":"Have I committed an offense because I abased myself, that you might be exalted; and because I freely preached to you the Gospel of God?"},{"num":8,"verse":"I robbed other churches, taking wages from them to do you service."},{"num":9,"verse":"And when I was present with you, and had need, I was not a hindrance to anyone. For that which I was lacking, the brothers who came from Macedonia supplied. And in all things, I have myself from being burdensome to you, and will keep doing so."},{"num":10,"verse":"As the truth of Christ is in me, this rejoicing shall not be taken from me in the regions of Achaia."},{"num":11,"verse":"Why? Because I do not love you? God knows."},{"num":12,"verse":"But what I do I will do so that I may cut off the opportunity of those who desire the opportunity to be found like us in that of which they boast."},{"num":13,"verse":"For such false apostles are deceitful workers and transform themselves into the Apostles of Christ."},{"num":14,"verse":"And it is no wonder; for Satan himself is transformed into an angel of light."},{"num":15,"verse":"Therefore, it is no great thing for his ministers to transform themselves, as though they were the ministers of righteousness, whose end shall be according to their works."},{"num":16,"verse":"I say again, let no one think that I am foolish, (or even take me as a fool) that I may also boast of myself a little."},{"num":17,"verse":"What I speak, I do not speak according to the Lord but, as it were, foolishly, while we are boasting."},{"num":18,"verse":"Seeing that many rejoice after the flesh, I will rejoice also."},{"num":19,"verse":"For you endure fools gladly, because you are wise."},{"num":20,"verse":"For you endure, even if someone enslaves you, if someone devours you, if someone takes from you, if someone exalts himself, if someone strikes you on the face."},{"num":21,"verse":"Concerning dishonor I speak as though we were weak. But wherein anyone is bold (I speak foolishly) I am bold also."},{"num":22,"verse":"They are Hebrews, so am I. They are Israelites, so am I. They are the seed of Abraham, so am I."},{"num":23,"verse":"They are the ministers of Christ (I speak as a fool) I am more; In labors, more abundant; in stripes, above measure, in prison, more exceedingly; in death often."},{"num":24,"verse":"Five times I have received forty stripes minus one from the Jews."},{"num":25,"verse":"Three times I was beaten with rods. I was once stoned. I suffered shipwreck three times. Night and day, I have been on the deep sea."},{"num":26,"verse":"While journeying I was often in perils from waters, in perils from robbers, in perils from my own nation, in perils among the Gentiles, in perils in the city, in perils in wilderness, in perils in the sea, in perils among false brothers,"},{"num":27,"verse":"in weariness and painfulness, in sleeplessness often, in hunger and thirst, in fastings often, in cold and in nakedness."},{"num":28,"verse":"Besides outward things, I am daily-laden, and care for all the churches."},{"num":29,"verse":"Who is weak, and I am not weak? Who is offended, and I do not burn?"},{"num":30,"verse":"If I must boast, I will boast of my infirmities."},{"num":31,"verse":"The God and the Father of our Lord Jesus Christ, Who is blessed for evermore, knows that I do not lie."},{"num":32,"verse":"In Damascus, the governor of the people under King Aretas, posted a guard over the city of the Damascenes, and would have caught me."},{"num":33,"verse":"But at a window, I was let down in a basket, through the wall, and escaped his hands."}]