[[],[{"type":"header","content":"Judgment on Tyre"},{"type":"prose","content":"Now in the eleventh year, on the first of the month, the word of the LORD came to me, saying,"}],[{"type":"prose","content":"“Son of man, because Tyre has said in regard to Jerusalem, ‘Aha! The gateway of the peoples is broken; it has opened to me. I shall be filled,  she is laid waste,’"}],[{"type":"prose","content":"therefore this is what the Lord GOD says: ‘Behold, I am against you, Tyre, and I will bring up many nations against you, as the sea brings up its waves."}],[{"type":"prose","content":"They will destroy the walls of Tyre and tear down her towers; and I will sweep her debris away from her and make her a bare rock."}],[{"type":"prose","content":"She will become a dry place for  nets in the midst of the sea, for I have spoken,’ declares the Lord GOD; ‘and she will become plunder for the nations."}],[{"type":"prose","content":"Also her daughters who are on the mainland will be killed by the sword, and they will know that I am the LORD.’”"}],[{"type":"prose","content":"For the Lord GOD says this: “Behold, I am going to bring upon Tyre from the north Nebuchadnezzar king of Babylon, king of kings, with horses, chariots, cavalry, and a great army."}],[{"type":"prose","content":"He will kill your daughters on the mainland with the sword; and he will make siege walls against you, pile up an assault ramp against you, and raise up a large shield against you."}],[{"type":"prose","content":"And he will direct the blow of his battering rams against your walls, and he will tear down your towers with his axes."}],[{"type":"prose","content":"Because of the multitude of his horses, the dust  them will cover you; your walls will shake from the noise of cavalry, wagons, and chariots when he enters your gates as  enter a city that is breached."}],[{"type":"prose","content":"With the hoofs of his horses he will trample all your streets. He will kill your people with the sword, and your strong pillars will go down to the ground."}],[{"type":"prose","content":"Also they will take your riches as spoils and plunder your merchandise, tear down your walls and destroy your delightful houses, and throw your stones, your timbers, and your debris into the water."}],[{"type":"prose","content":"So I will put an end to the sound of your songs, and the sound of your harps will no longer be heard."}],[{"type":"prose","content":"I will turn you into a bare rock; you will become a dry place for  nets. You will not be rebuilt, for I the LORD have spoken,” declares the Lord GOD."}],[{"type":"prose","content":"The Lord GOD says this to Tyre: “Will the coastlands not shake from the sound of your downfall when the wounded groan, when the slaughter takes place in your midst?"}],[{"type":"prose","content":"Then all the princes of the sea will descend from their thrones, remove their robes, and strip off their colorfully woven garments. They will clothe themselves with trembling; they will sit on the ground, tremble again and again, and be appalled at you."}],[{"type":"prose","content":"And they will take up a song of mourning over you and say to you,"},{"type":"poetry","content":"‘How you have perished, you inhabited one,"},{"type":"poetry","content":"From the seas, you famous city,"},{"type":"poetry","content":"Which was mighty on the sea,"},{"type":"poetry","content":"She and her inhabitants,"},{"type":"poetry","content":"Who imposed her terror"},{"type":"poetry","content":"On all her inhabitants!"}],[{"type":"poetry","content":"Now the coastlands will tremble"},{"type":"poetry","content":"On the day of your downfall;"},{"type":"poetry","content":"Yes, the coastlands which are by the sea"},{"type":"poetry","content":"Will be horrified at your passing.’”"}],[{"type":"prose","content":"For this is what the Lord GOD says: “When I make you a desolate city, like the cities which are not inhabited, when I bring up the deep over you and the great waters cover you,"}],[{"type":"prose","content":"then I will bring you down with those who go down to the pit, to the people of old, and I will make you remain in the lower parts of the earth, like the ancient ruins, with those who go down to the pit, so that you will not be inhabited; but I will put glory in the land of the living."}],[{"type":"prose","content":"I will cause you sudden terrors and you will no longer exist; though you will be sought, you will never be found again,” declares the Lord GOD."}]]