[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(4) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And God shall wipe away all tears . . .",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Instead of “all tears” we should translate “every tear,” and so possess the promise in its true and tender form. The first, or former, things are passed away: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "death shall not be any longer; neither shall mourning, nor crying, nor pain, be any longer.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " The splendid array of negatives come as heralds of the positive peace of the new Jerusalem: no sea, no tears, no death, no mourning, no crying, no pain; with the former things these six shadows pass away from life. “The ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "mourning",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is that grief which so takes possession of the whole being that it cannot be hid” (Abp. Trench). It is the same word that is rendered “wailing” in our English version (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 18:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). It is used of mourning for the dead. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Crying",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is the voice of despair and dismay, as well as sorrow; it is the loud outcry which is the witness that “the times are out of joint.” ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Pain",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " includes painful labour and weariness. With the passing away of these there must depart the ground for the often-repeated cry of “Vanity of vanities! “The sad minor of the poet’s song will cease, for—",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "“Time with a gift of tears,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Grief with a glass that ran,”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "together with “travail and heavy sorrow,” shall be no more. On the whole passage, comp. Isaiah 25:8; Isaiah 65:19.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "together with “travail and heavy sorrow,” shall be no more. On the whole passage, comp. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 25:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 65:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Revelation 21:4-5",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 21:4-5",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And God shall wipe away all tears from their eyes ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Though here their tears have flowed plentifully, not one shall ever be found on the face of any of them; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and there shall be no more death ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— This is a full proof that this whole description belongs to eternity and not to time. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Neither shall sorrow, or crying, or pain be any more — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Under the former heavens, and upon the former earth, there were death and sorrow, crying and pain; all which occasioned many tears. But now pain and sorrow are fled away, and the saints have everlasting life and joy; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for the former things",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " — All the mournful scenes, which were on earth so familiar to their eyes; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "are passed away ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— To return no more for ever. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And he that sat upon the throne said — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Not to St. John only; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Behold, I make all things new ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— From the first mention of him that sat upon the throne, (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 5:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") this is the first speech which is expressly ascribed to him. He is the author of this second, as he was of the first creation; and he commands these things to be ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "written ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "for the edification, support, and consolation of his people, with a full assurance of their certainty and importance. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And he",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " — The same person; ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "saith to me, Write — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Namely, as follows: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "These words are true and faithful ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— This includes all that went before. The apostle seems again to have ceased writing, being overcome with ecstasy and the voice of him that spake.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "21:1-8 The new heaven and the new earth will not be separate from each other; the earth of the saints, their glorified, bodies, will be heavenly. The old world, with all its troubles and tumults, will have passed away. There will be no sea; this aptly represents freedom from conflicting passions, temptations, troubles, changes, and alarms; from whatever can divide or interrupt the communion of saints. This new Jerusalem is the church of God in its new and perfect state, the church triumphant. Its blessedness came wholly from God, and depends on him. The presence of God with his people in heaven, will not be interrupt as it is on earth, he will dwell with them continually. All effects of former trouble shall be done away. They have often been in tears, by reason of sin, of affliction, of the calamities of the church; but no signs, no remembrance of former sorrows shall remain. Christ makes all things new. If we are willing and desirous that the gracious Redeemer should make all things new in order hearts and nature, he will make all things new in respect of our situation, till he has brought us to enjoy complete happiness. See the certainty of the promise. God gives his titles, Alpha and Omega, the Beginning and the End, as a pledge for the full performance. Sensual and sinful pleasures are muddy and poisoned waters; and the best earthly comforts are like the scanty supplies of a cistern; when idolized, they become broken cisterns, and yield only vexation. But the joys which Christ imparts are like waters springing from a fountain, pure, refreshing, abundant, and eternal. The sanctifying consolations of the Holy Spirit prepare for heavenly happiness; they are streams which flow for us in the wilderness. The fearful durst not meet the difficulties of religion, their slavish fear came from their unbelief; but those who were so dastardly as not to dare to take up the cross of Christ, were yet so desperate as to run into abominable wickedness. The agonies and terrors of the first death will lead to the far greater terrors and agonies of eternal death.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And God shall wipe away all tears from their eyes - This will be one of the characteristics of that blessed state, that not a tear shall ever be shed there. How different will that be from the condition here - for who is there here who has not learned to weep? See the notes on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 7:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Compare the notes on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 25:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And there shall be no more death - In all that future world of glory, not one shall ever die; not a grave shall ever be dug! What a view do we begin to get of heaven, when we are told there shall be no \"death\" there! How different from earth, where death is so common; where it spares no one; where our best friends die; where the wise, the good, the useful, the lovely die; where fathers, mothers, wives, husbands, sons, daughters, all die; where we habitually feel that we must die. Assuredly we have here a view of heaven most glorious and animating to those who dwell in a world like this, and to whom nothing is more common than death. In all their endless and glorious career, the redeemed will never see death again; they will never themselves die. They will never follow a friend to the tomb, nor fear that an absent friend is dead. The slow funeral procession will never be witnessed there; nor will the soil ever open its bosom to furnish a grave. See the notes on 1 Corinthians 15:55.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And there shall be no more death - In all that future world of glory, not one shall ever die; not a grave shall ever be dug! What a view do we begin to get of heaven, when we are told there shall be no \"death\" there! How different from earth, where death is so common; where it spares no one; where our best friends die; where the wise, the good, the useful, the lovely die; where fathers, mothers, wives, husbands, sons, daughters, all die; where we habitually feel that we must die. Assuredly we have here a view of heaven most glorious and animating to those who dwell in a world like this, and to whom nothing is more common than death. In all their endless and glorious career, the redeemed will never see death again; they will never themselves die. They will never follow a friend to the tomb, nor fear that an absent friend is dead. The slow funeral procession will never be witnessed there; nor will the soil ever open its bosom to furnish a grave. See the notes on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Corinthians 15:55",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Neither sorrow - The word \"sorrow\" here - πένθος  penthos - denotes sorrow or grief of any kind; sorrow for the loss of property or friends; sorrow for disappointment, persecution, or care; sorrow over our sins, or sorrow that we love God so little, and serve him so unfaithfully; sorrow that we are sick, or that we must die. How innumerable are the sources of sorrow here; how constant is it on the earth! Since the fall of man there has not been a day, an hour, a moment, in which this has not been a sorrowful world; there has not been a nation, a tribe - a city or a village - nay, not a family, where there has not been grief. There has been no individual who has been always perfectly happy. No one rises in the morning with any certainty that he may not end the day in grief; no one lies down at night with any assurance that it may not be a night of sorrow. How different would this world be if it were announced that henceforward there would be no sorrow! How different, therefore, will heaven be when we shall have the assurance that henceforward grief shall be at an end!",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Nor crying - κραυγὴ  kraugē.\" This word properly denotes a cry, an outcry, as in giving a public notice; a cry in a tumult - a clamor, Acts 23:9; and then a cry of sorrow, or wailing. This is evidently its meaning here, and it refers to all the outbursts of grief arising from affliction, from oppression, from violence. The sense is, that as none of these causes of wailing will be known in the future state, all such wailing will cease. This, too, will make the future state vastly different from our condition here; for what a change would it produce on the earth if the cry of grief were never to be heard again!",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Nor crying - κραυγὴ  kraugē.\" This word properly denotes a cry, an outcry, as in giving a public notice; a cry in a tumult - a clamor, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Acts 23:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and then a cry of sorrow, or wailing. This is evidently its meaning here, and it refers to all the outbursts of grief arising from affliction, from oppression, from violence. The sense is, that as none of these causes of wailing will be known in the future state, all such wailing will cease. This, too, will make the future state vastly different from our condition here; for what a change would it produce on the earth if the cry of grief were never to be heard again!",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "Neither shall there be any more pain - There will be no sickness, and no calamity; and there will be no mental sorrow arising from remorse, from disappointment, or from the evil conduct of friends. And what a change would this produce - for how full of pain is the world now! How many lie on beds of languishing; how many are suffering under incurable diseases; how many are undergoing severe surgical operations; how many are pained by the loss of property or friends, or subjected to acuter anguish by the misconduct of those who are loved! How different would this world be, if all pain were to cease forever; how different, therefore, must the blessed state of the future be from the present!",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "For the former things are passed away - The world as it was before the judgment. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "For the former things are passed away - The world as it was before the judgment. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "4. all tears—Greek, \"every tear.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "no more death—Greek, \"death shall be no more.\" Therefore it is not the millennium, for in the latter there is death (Isa 65:20; 1Co 15:26, 54, \"the last enemy … destroyed is death,\" Re 20:14, after the millennium).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "sorrow—Greek, \"mourning.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "passed away—Greek, \"departed,\" as in Re 21:1.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Scarce any of the passages in this verse, taken in the plain, literal sense, are applicable to any state of the church in this life: for though in the thousand years, mentioned ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Revelation 20:1-3",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Revelation 20:1-3",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ", the state of the church (as it is presumed) will be very happy comparatively to what it ever was before, and free from its enemies’ molestations and persecutions; yet I think none hath asserted that in that time no members of it shall die, or be sick, or have any sorrow or pain. There must be a great allowance of figures, if we will apply this to any state of the militant church; but all will be literally true as to the church in heaven. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And God shall wipe away all tears from their eyes,.... Occasioned by sin, Satan, the hidings of God's face, and afflictive dispensations of Providence; for these will be no more: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and there shall be no more death; natural or violent; there will be no more putting of the saints to death, or persecution of them unto death, as in former times; nor will they die a natural death any more; these children of the resurrection, and inhabitants of the new heaven and earth, will be like the angels, who die not; there will be no more deadness as to spiritual things among the saints; and as for the second death, that will have no power over them. So the Jews say (u),   , \"there is no death in the world to come\"; good is laid up for the righteous in the world to come, and with them is no death (x); and after the resurrection the body is perfect, and shall never after taste the taste of death (y). ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Neither sorrow, nor crying; on account of sin, or because of oppression and persecution, or through the loss of near relations and friends; sorrow and sighing will flee away, all occasions thereof being gone: neither shall there be any more pain; either of body or mind; there will be nothing to afflict the mind, and make that uneasy, but all the reverse; nor will there be any sickness or diseases of body, for the body will be raised glorious, powerful, incorruptible, and spiritual. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "For the former things are passed away; not only the first heaven and earth, the world, its fashion, and its lusts; but the former grievous times under Rome Pagan and Papal, and everything which in this present life gives uneasiness and distress. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(u) Echa Rabbati, fol. 48. 2. & Midrash Kohelet, fol. 61. 2.((x) Maimon. Teshuva, c. 8. sect. 1.((y) Midrash Hanneelam in Zohar in Gen. fol. 70. 1.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(u) Echa Rabbati, fol. 48. 2. & Midrash Kohelet, fol. 61. 2.((x) Maimon. Teshuva, c. 8. sect. 1.((y) Midrash Hanneelam in Zohar in Gen. fol. 70. 1.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And God shall wipe away all tears from their eyes; and there shall be no more death, neither sorrow, nor crying, neither shall there be any more pain: for the former things are passed away.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "God shall wipe",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Read simply, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "and shall wipe",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "and He shall wipe",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", according as it is thought necessary or not to begin a new sentence. The name of “God” is introduced from the parallel passage, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 7:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 25:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " the names used are those traditionally represented by “the Lord God.”",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "there shall be no more death",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] More exactly, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "death shall be no more",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", having been destroyed in the Lake of Fire, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 20:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " : not that the personification is put forward here.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "neither sorrow … any more pain",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Better, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "neither shall there be sorrow, nor crying, nor pain any more",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". See ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 35:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 51:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 65:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "for the former things are passed away",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "for",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " should probably be omitted; and the word for “former” is literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "first",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 4.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And God shall wipe away all tears from their eyes; and there shall be no more death, neither sorrow, nor crying, neither shall there be any more pain;",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "and death shall be no more, neither shall there be mourning, nor crying, nor pain, any more",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (Revised Version). ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "All tears",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; just as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 7:17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 25:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"He will swallow up death in victory; and the Lord God will wipe away tears from off all faces;\" cf. also ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 65:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). There is \"no more death\" because sin is no mere (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 51:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"Sorrow and mourning shall flee away\"), For the former things are passed away. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greek",
        "text": "Ὅτι",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"for,\" should probably be omitted, as in A and P, and ",
        "children": []
      },
      {
        "element": "span",
        "class": "hebrew",
        "text": "א",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " as first written. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "The former",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " state of things is the state now existing, which will then have passed away as described in ver. 1. Revelation 21:4",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Vincent's Word Studies",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And God shall wipe away",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Omit God. Read, as Rev., and He shall wipe away.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "All tears (πᾶν δάκρυον)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Lit., every tear. Compare Isaiah 25:8.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Lit., every tear. Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 25:8",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "There shall be no more death (ὁ θάνατος οὐκ ἔσται ἔτι)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Render, as Rev., death shall be no more.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Sorrow (πένθος)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Better, as Rev., mourning, since the word signifies manifested grief. See on Matthew 5:4; see on James 4:9. Compare Isaiah 65:19. \"That soul I say,\" observes Socrates, \"herself invisible, departs to the invisible world - to the divine and immortal and rational: thither arriving, she is secure of bliss, and is released from the error and folly of men, their fears and wild passions, and all other human ills, and forever dwells, as they say of the initiated, in company with the gods\" (Plato, \"Phaedo,\" 81). So Sophocles:",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Better, as Rev., mourning, since the word signifies manifested grief. See on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 5:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; see on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "James 4:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". Compare ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Isaiah 65:19",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". \"That soul I say,\" observes Socrates, \"herself invisible, departs to the invisible world - to the divine and immortal and rational: thither arriving, she is secure of bliss, and is released from the error and folly of men, their fears and wild passions, and all other human ills, and forever dwells, as they say of the initiated, in company with the gods\" (Plato, \"Phaedo,\" 81). So Sophocles:",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Sorrow touches not the dead.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Oedipus Coloneus,\" 966",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"How thrice happy those of mortals, who, having had these ends in view, depart to Hades; for to them alone is it given there to live; but to others, all things there are evil\" (\"Fragment\"). And Euripides:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"The dead, tearless, forgets his pains.\"",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"Troades,\" 606 ",
        "children": []
      }
    ]
  }
]