[{"num":11,"verse":"When Jabin king of Hazor heard of this, he sent to Jobab king of Madon, and to the kings of Shimron and Achshaph,"},{"num":2,"verse":"And to the kings who were in the north in the hill country and in the Arabah south of Chinneroth and in the lowland and in the heights of Dor on the west;"},{"num":3,"verse":"To the Canaanites in the east and west; to the Amorites, the Hittites, the Perizzites, the Jebusites in the hill country; and to the Hivites below [Mount] Hermon in the land of Mizpah."},{"num":4,"verse":"And they went out with all their hosts, much people, like the sand on the seashore in number, with very many horses and chariots."},{"num":5,"verse":"And all these kings met and came and encamped together at the Waters of Merom, to fight against Israel."},{"num":6,"verse":"But the Lord said to Joshua, Do not be afraid because of them, for tomorrow by this time I will give them up all slain to Israel; you shall hamstring their horses and burn their chariots with fire."},{"num":7,"verse":"So Joshua and all the people of war with him came against them suddenly by the Waters of Merom and fell upon them."},{"num":8,"verse":"And the Lord gave them into the hand of Israel, who smote them and chased them [toward] populous Sidon and Misrephoth-maim, and eastward as far as the Valley of Mizpah; they smote them until none remained."},{"num":9,"verse":"And Joshua did to them as the Lord had commanded him: he hamstrung their horses and burned their chariots with fire."},{"num":10,"verse":"And Joshua at that time turned back and took Hazor and smote its king with the sword; for Hazor previously was the head of all those kingdoms."},{"num":11,"verse":"They smote all the people in it with the sword, utterly destroying them; none were left alive, and he burned Hazor with fire."},{"num":12,"verse":"And Joshua took all the cities of those kings and all the kings and smote them with the sword, utterly destroying them, as Moses the servant of the Lord commanded."},{"num":13,"verse":"But Israel burned none of the cities that stood [fortified] on their mounds—except Hazor only, which Joshua burned."},{"num":14,"verse":"And all the spoil of these cities and the livestock the Israelites took for their booty; but every man they smote with the sword until they had destroyed them, and they left none who breathed."},{"num":15,"verse":"As the Lord had commanded Moses His servant, so Moses commanded Joshua, and so Joshua did; he left nothing undone of all that the Lord commanded Moses."},{"num":16,"verse":"So Joshua took all that land: the hill country, all the South, all the land of Goshen, the lowland, the Arabah [plain], the hill country of Israel and its lowland,"},{"num":17,"verse":"From Mount Halak, which rises toward Seir, as far as Baal-gad in the Valley of Lebanon below Mount Hermon. He captured all their kings and slew them."},{"num":18,"verse":"Joshua had waged war a long time [at least five years] with all those kings."},{"num":19,"verse":"Not a city made peace with the Israelites except the Hivites, the people of Gibeon; all the others they took in battle."},{"num":20,"verse":"For it was of the Lord to harden their hearts that they should come against Israel in battle, that [Israel] might destroy them utterly, and that without favor and mercy, as the Lord commanded Moses."},{"num":21,"verse":"Joshua came at that time and cut off the Anakim [large in stature] from the hill country: from Hebron, from Debir, from Anab, and from all the hill country of Judah and the hill country of Israel. Joshua destroyed them utterly with their cities."},{"num":22,"verse":"None of the Anakim were left in the land of the Israelites; only in Gaza, Gath, and Ashdod [of Philistia] did some remain."},{"num":23,"verse":"So Joshua took the whole land, according to all that the Lord had spoken to Moses, and Joshua gave it for an inheritance to Israel according to their allotments by tribes. And the land had rest from war."}]