[{"header":"Defeating Northern Kings"},{"num":11,"verse":"When Jabin king of Hazor [the largest and best fortified of the Canaanite cities] heard about all that had happened, he sent messages to Jobab king of Madon, to the king of Shimron, and to the king of Acshaph. "},{"num":2,"verse":"He sent messages to the kings in the northern ·mountains [hill country] and also to the kings in the ·Jordan Valley [or Arabah] south of ·Lake Galilee [Kinnereth] and in the ·western foothills [lowlands; Shephelah]. He sent a message to the king of ·Naphoth [or the heights of] Dor in the west [the coastal plain south of Mount Carmel] "},{"num":3,"verse":"and to the kings of the Canaanites in the east and in the west. He sent messages to the Amorites, Hittites, Perizzites, and Jebusites in the ·mountains [hill country]. Jabin also sent one to the Hivites, who lived below Mount Hermon in the area of Mizpah [a coalition of the northern cities of Palestine]. "},{"num":4,"verse":"So the armies of all these kings came together with their horses and chariots [a great challenge to the Israelites, who only had foot soldiers]. There were as many soldiers as grains of sand on the seashore [Gen. 22:17]."},{"num":5,"verse":"All of these kings met together at the waters of Merom [probably modern Meirun, eight miles northwest of the Sea of Galilee], joined their armies together into one camp, and made plans to fight against the Israelites."},{"num":6,"verse":"Then the Lord said to Joshua, “Don’t be afraid of them, because at this time tomorrow I will give them to you. You will ·cripple [hamstring] their horses and burn all their chariots.”"},{"num":7,"verse":"So Joshua and his whole army surprised the enemy [10:9] by attacking them at the waters of Merom. "},{"num":8,"verse":"The Lord ·handed them over to [gave them into the hand of] Israel. They chased them to Greater Sidon, Misrephoth Maim, and the Valley of Mizpah in the east [locations north and west of the battle]. Israel fought until none of the enemy was left alive. "},{"num":9,"verse":"Joshua did what the Lord said to do; he ·crippled [hamstrung] their horses and burned their chariots [Israel did not take the horses and chariots to use themselves, in order to show their trust in God; Ps. 20:7]."},{"num":10,"verse":"Then Joshua went back and captured the city of Hazor and ·killed [struck with the sword] its king. (Hazor had been the leader of all the kingdoms that fought against Israel.) "},{"num":11,"verse":"Israel ·killed [struck with the sword] everyone in Hazor, ·completely destroying them [devoting them to destruction; 2:10; 6:21]; no one was left ·alive [that breathed]. Then they burned Hazor itself."},{"num":12,"verse":"Joshua captured all of these cities, ·killed [struck with the edge of the sword] all of their kings, and ·completely destroyed [devoted to destruction; v. 11] everything in these cities. He did this just as Moses, the servant of the Lord, had commanded. "},{"num":13,"verse":"But the Israelites did not burn any cities that were built on their mounds [so Israel could immediately occupy these strategically important cities; Deut. 6:10–11], except Hazor; only that city was burned by Joshua. "},{"num":14,"verse":"The ·people [sons; children] of Israel kept for themselves ·everything [the plunder/spoil] they found in the cities, including all the animals. But they ·killed [struck with the edge of the sword] all the people there; they left no one ·alive [that breathed]. "},{"num":15,"verse":"Long ago the Lord had commanded his servant Moses to do this, and then Moses had commanded Joshua to do it [Deut. 7:1–6; 20:16–18]. Joshua ·did everything [left nothing undone that] the Lord had commanded Moses."},{"num":16,"verse":"So Joshua defeated all the people in the land [a general statement, since not every city was taken; 17:16; Judg. 1]. He had control of the mountains and ·the area of southern Canaan [all the Negev], all the areas of Goshen, the ·western foothills [lowlands; Shephelah], and the ·Jordan Valley [or Arabah]. He controlled the ·mountains [hill country] of Israel and ·all the hills near them [or its lowlands/Shephelah]. "},{"num":17,"verse":"·Joshua controlled all the land from […from] Mount Halak near ·Edom [Seir] to Baal Gad in the Valley of Lebanon, below Mount Hermon. Joshua also captured all the kings in the land and killed them. "},{"num":18,"verse":"He ·fought [waged war] against them for ·many years [a long time; many days]. "},{"num":19,"verse":"The people of only one city in all the land had made a peace ·agreement [covenant; treaty] with Israel—the Hivites living in Gibeon. All the other cities were defeated in war. "},{"num":20,"verse":"The Lord ·made those people stubborn [hardened their hearts; Ex. 8:15] so they would fight against Israel and ·he could completely destroy them [would be devoted to destruction; 2:10; 6:17] without mercy. This is what the Lord had commanded Moses to do."},{"num":21,"verse":"Now Joshua fought the Anakites [or Anakim; Num. 13:33] who lived in the ·mountains [hill country] of Hebron, Debir, Anab, Judah, and Israel, and he completely destroyed them and their towns. "},{"num":22,"verse":"There were no Anakites left living in the land of the Israelites ·and only a few were left [or though some remained] in Gaza, Gath, and Ashdod. "},{"num":23,"verse":"Joshua took control of all the ·land of Israel [land] as the Lord had ·told Moses to do [or promised Moses] long ago. He gave the land to Israel, ·because he had promised it to them [as an inheritance]. ·Then Joshua divided the land among the tribes of Israel […according to their tribal divisions], and ·there was peace in the land [the land had rest from war]."}]