[{"header":"Joshua Defeats the Northern Kings"},{"num":11,"verse":"King Jabin of Hazor heard ⌞what had happened⌟. So he sent messengers to King Jobab of Madon and to the kings of Shimron and Achshaph. "},{"num":2,"verse":"He also sent messengers to the northern kings in the mountains, the plains south of Chinneroth, the foothills, and Naphoth Dor in the west, "},{"num":3,"verse":"the Canaanites from east and west, the Amorites, Hittites, Perizzites, the Jebusites in the mountains, and the Hivites at the foot of Mount Hermon in Mizpah. "},{"num":4,"verse":"They came out with all their armies. Their troops were as numerous as the grains of sand on the seashore. They also had horses and chariots. "},{"num":5,"verse":"All these kings camped together by the Springs of Merom in order to fight Israel."},{"num":6,"verse":"The Lord told Joshua, “Don’t be afraid of them because I am going to give them to Israel. About this time tomorrow they will all be dead. You must disable their horses so that they cannot be used in battle. You must burn their chariots.” "},{"num":7,"verse":"Joshua and all his troops arrived suddenly at the Springs of Merom and attacked the Canaanite armies. "},{"num":8,"verse":"The Lord handed them over to Israel, and the Israelites defeated them. The Israelites chased them as far as Great Sidon, Misrephoth Maim, and the valley of Mizpah in the east. There were no survivors. "},{"num":9,"verse":"Joshua disabled their horses and burned their chariots, as the Lord had told him."},{"num":10,"verse":"Then Joshua turned back and captured Hazor. He killed its king with a sword. (Hazor was formerly the head of all these kingdoms.) "},{"num":11,"verse":"They claimed everyone for the Lord by destroying them with swords. Not one person survived. Joshua also burned Hazor."},{"num":12,"verse":"So Joshua captured all these cities and their kings. He claimed them for the Lord by destroying them, as the Lord’s servant Moses had commanded him. "},{"num":13,"verse":"Israel did not burn cities built on mounds. However, Joshua made an exception and burned Hazor. "},{"num":14,"verse":"The people of Israel took all the loot and livestock from these cities. But they put everyone to death until they were all destroyed. Not one person survived. "},{"num":15,"verse":"So Joshua carried out what the Lord had commanded his servant Moses and what Moses had commanded him. He did not leave out anything the Lord had commanded Moses."},{"num":16,"verse":"Joshua took all this land, the mountains, all the Negev, all the land of Goshen, the foothills, the plains, and the mountains and foothills of Israel. "},{"num":17,"verse":"The land extended from Mount Halak which ascends to Seir as far as Baal Gad in the Lebanon Valley at the foot of Mount Hermon. He captured all their kings and killed them. "},{"num":18,"verse":"Joshua waged war with all these kings for a long time. "},{"num":19,"verse":"Not one city had made a peace treaty with the people of Israel except Gibeon, where the Hivites lived. Israel captured everything in battle. "},{"num":20,"verse":"The Lord made their enemies stubborn enough to continue fighting against Israel so that he could claim them all for destruction without mercy, as he had commanded Moses."},{"num":21,"verse":"At that time Joshua also wiped out the people of Anak in the mountains, in Hebron, Debir, and Anab, and in all the hills of Judah and Israel. Joshua claimed them for the Lord by destroying them and their cities. "},{"num":22,"verse":"None of the people of Anak remained in Israel. Some of them were left in Gaza, Gath, and Ashdod. "},{"num":23,"verse":"Joshua captured the whole land as the Lord had promised Moses. He gave it to Israel as a possession, dividing it among the tribes. So the land had peace."}]