[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(18) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "By his neesings a light doth shine, and his eyes are like the eyelids of the morning",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e., ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "fiery red and glowing.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Job 41:18",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 41:18",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "By his neesings a light doth shine — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Literally, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "His sneezing causes the light to sparkle. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "If he sneeze, or spout up water, it is like a light shining, either with the froth, or the light of the sun shining through it. The crocodile, in particular, is said frequently to sneeze. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "His eyes are like the eyelids of the morning — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "The eyes of the whale are said in the night-time to shine like a flame; and the eyes of the crocodile, although they are dull and dark under the water, yet, as soon as they appear above water, cast a bright and clear light, like that of the morning suddenly breaking forth after the dark night. “I think,” says Dr. Young, “this gives us as great an image of the thing it would express as can enter the thoughts of man. It is not improbable that the Egyptians stole their hieroglyphic for the morning, which is the crocodile’s eye, from this passage, though no commentator I have seen mentions it. It is easy to conceive how the Egyptians should be both readers and admirers of the writings of Moses, whom I suppose the author of this poem.” The doctor paraphrases this clause thus: ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "“Large is his front; and when his burnish’d eyes Lift their broad lids, the morning seems to rise.”",
        "children": [
          {
            "element": "span",
            "class": "ital",
            "text": "“Large is his front; and when his burnish’d eyes Lift their broad lids, the morning seems to rise.”",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "41:1-34 Concerning Leviathan. - The description of the Leviathan, is yet further to convince Job of his own weakness, and of God's almighty power. Whether this Leviathan be a whale or a crocodile, is disputed. The Lord, having showed Job how unable he was to deal with the Leviathan, sets forth his own power in that mighty creature. If such language describes the terrible force of Leviathan, what words can express the power of God's wrath? Under a humbling sense of our own vileness, let us revere the Divine Majesty; take and fill our allotted place, cease from our own wisdom, and give all glory to our gracious God and Saviour. Remembering from whom every good gift cometh, and for what end it was given, let us walk humbly with the Lord.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "By his neesings a light doth shine - The word rendered \"neesings\" means properly sneezing, and the literal sense here would be, \"His sneezings, light shines.\" Coverdale renders it, \"His nesinge is like a glisteringe fyre.\" Bochart says that the meaning is, \"that when the crocodile sneezes, the breath is driven through the nostrils with such force that it seems to scintillate, or emit fire.\" Probably the meaning is, that when the animal emits a sudden sound, like sneezing, the fire seems to flash from the eye. There is some quick and rapid motion of the eyes, which in the rays of the sun seem to flash fire. The sneezing of the crocodile is mentioned by Aristotle. Prof. Lee. Amphibious animals, the longer they hold their breath under water, respire so much the more violently when they emerge, and the breath is expelled suddenly and with violence. Schultens. This is the action here referred to - the strong effort of the animal to recover breath when he rises to the surface, and when in the effort the eyes seem to scintillate, or emit light.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And his eyes are like the eyelids of the morning - The \"eyelids of the morning\" is a beautiful poetic phrase quite common in Hebrew poetry. The eyes of the crocodile are small, but they are remarkable. When he lifts his head above water, his staring eyes are the first things that strike the beholder, and may then with great beauty be compared with the morning light. There is a remarkable coincidence here, in the fact that when the Egyptians would represent the morning by a hieroglyphic, they painted a crocodile's eye. The reason assigned for this was, that before the whole body of the animal appeared, the eyes seemed to rise from the deep; see Bochart on the passage, \"Hierez.,\" and also Herapollo, \"Hieroglyph.\" i. c. 65. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And his eyes are like the eyelids of the morning - The \"eyelids of the morning\" is a beautiful poetic phrase quite common in Hebrew poetry. The eyes of the crocodile are small, but they are remarkable. When he lifts his head above water, his staring eyes are the first things that strike the beholder, and may then with great beauty be compared with the morning light. There is a remarkable coincidence here, in the fact that when the Egyptians would represent the morning by a hieroglyphic, they painted a crocodile's eye. The reason assigned for this was, that before the whole body of the animal appeared, the eyes seemed to rise from the deep; see Bochart on the passage, \"Hierez.,\" and also Herapollo, \"Hieroglyph.\" i. c. 65. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "18. Translate: \"his sneezing, causeth a light to shine.\" Amphibious animals, emerging after having long held their breath under water, respire by violently expelling the breath like one sneezing: in the effort the eyes which are usually directed towards the sun, seem to flash fire; or it is the expelled breath that, in the sun, seems to emit light.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "eyelids of morning—The Egyptian hieroglyphics paint the eyes of the crocodile as the symbol for morning, because the eyes appear the first thing, before the whole body emerges from the deep [Horæ Hierogliphicæ 1.65. Bochart].",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "By his neesings; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " which may be understood either, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. Of any commotion or agitation of the body, like that which is in neezing, as when the whale stirreth himself and casteth or shooteth up great spouts of water into the air by the pipes which God hath planted in his head for this use; which water being thin, and transparent, and illuminated by the sun-beams, casts forth a shining light. Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. Of neezing properly so called, which the crocodile is said frequently to do, because it commonly turneth its eyes to the sun, as Strabo and others note; which when a man doth, he is apt to neeze. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Like the eyelids of the morning; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to which they seem very fitly compared, because the eyes both of the whale and crocodile are dull and dark under the water; but as soon as they appear above water, they cast forth immediately a bright and clear light, though not like that of the sun at noon-day, which had been too great an hyperbole, yet like the morning light, suddenly breaking forth after the dark night. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "By his neesings a light doth shine,.... The philosopher (i) observes, that those who look to the sun are more apt to sneeze: and it is taken notice of by various writers (k), that the crocodile delights to be sunning itself, and lying yawning in the sun and looking at it, as quoted by Bochart; and so frequently sneeze: which sneezings, through the rays of the sun, may seem to shine and give light. Though as, in sneezing, water is thrown out through the nostrils, it may be observed of the whale, that it has mouths or holes in its front, through which, as through pipes, it throws out showers and floods of water, as Pliny (l) relates; which, by means of the rays of the sun, as in a rainbow, appear bright and glittering; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and his eyes are like the eyelids of the morning: the break and dawn of day; a very beautiful expression, the same we call \"peep of day\": Pindar (m) has \"the eye of the evening\"; break of day, as Ben Gersom says, is about an hour and the fifth part of an hour before the sunrising. The eyes of the crocodile were, with the Egyptians, an hieroglyphic of the morning (n): wherefore this seems better to agree with the crocodile than the whale, whose eyes are not much bigger than those of a bullock; and has eyelids and hair like men's eyes; the crystal of the eye is not much bigger than a pea (o); its eyes are placed very low, almost at the end of the upper lip, and when without its guide, dashes itself against rocks and shoals (p). Though that sort of whales called \"orcae\" are said to have eyes a foot long, and of a red rosy colour, such as the morning is described by (q); and a northern writer (r) tells us that some whales have eyes, whose circumference will admit fifteen or twenty men to sit therein; and in others it exceeds eight or ten cubits; and that the pupil is a cubit, and of a red and flaming colour; which, at a distance, in dark seasons, among the waves, appears to fishermen as fire kindled. And Thevenot (s) says of crocodiles, that their eyes are indifferently big, and very darkish. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(i) Problem. s. 33. qu. 4. (k) Aelian. l. 3. c. 11. Leo African. Descriptio African, l. 9. p. 761. Pet. Martyr. Decad. 3. c. 4. (l) Nat. Hist. l. 9. c. 4, 6. (m) Olymp. Ode 3. v. 36. (n) Hor. Hiereglyph. apud Scheuchzer. vol. 4. p. 849. (o) Voyage to Spitzbergen, p. 145. (p) Aelian. l. 2. c. 13. Plin. l. 9. c. 62. (q) Hasacus apud Schultens in loc. (r) Olaus Magnus de Ritu Gent. Septent. l. 21. c. 5, 8. so Albertus Magnus de Animal. l. 24. c. 1.((s) Travels, ut supra, (part. 1.) p. 245. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(i) Problem. s. 33. qu. 4. (k) Aelian. l. 3. c. 11. Leo African. Descriptio African, l. 9. p. 761. Pet. Martyr. Decad. 3. c. 4. (l) Nat. Hist. l. 9. c. 4, 6. (m) Olymp. Ode 3. v. 36. (n) Hor. Hiereglyph. apud Scheuchzer. vol. 4. p. 849. (o) Voyage to Spitzbergen, p. 145. (p) Aelian. l. 2. c. 13. Plin. l. 9. c. 62. (q) Hasacus apud Schultens in loc. (r) Olaus Magnus de Ritu Gent. Septent. l. 21. c. 5, 8. so Albertus Magnus de Animal. l. 24. c. 1.((s) Travels, ut supra, (part. 1.) p. 245. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "By his neesings {g} a light doth shine, and his eyes are like the eyelids of the morning.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "By his neesings ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{g}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " a light doth shine, and his eyes ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "are",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " like the eyelids of the morning.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(g) That is, casts out flames of fire.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The animal is said to inflate itself, as it lies basking in the sun, and then force the heated breath through its nostrils, which in the sun appears like a stream of light.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the eyelids of the morning",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The reference may be to the shining of the reddish eyes of the animal, which are seen even under the water, before its head comes to the surface. In the Egyptian hieroglyphs the eyes of the crocodile are a symbol of the dawn.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "18–21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The monster breathes smoke and flame.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 18.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "By his neesings a light doth shine",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"Neesings\" is old English for \"sneezings.\" According to Aristotle, the crocodile is in the habit of sneezing, but I do not find this fact noted by modern writers Boehart asserts it very positively ('Hieroz.,' pp. 752-754), but he does not profess to speak from his own knowledge. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And his eyes are like the eyelids of the morning",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This probably does not mean more than that his eyes flash with light upon occasion, which is no doubt true, though the eyes, being small, have not generally attracted very much attention. Job 41:18",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "18  His sneezing sendeth forth light,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And his eyes are like the eyelids of the dawn;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "19  Out of his mouth proceed flames,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Sparks of fire escape from him;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "20  Out of his nostrils goeth forth smoke",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Like a seething pot and caldron;",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "21  His breath kindleth coals,",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "And flames go forth out of his mouth.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "That the crocodile delights to sun itself on the land, and then turns its open jaws to the sunny side, most Nile travellers since Herodotus have had an opportunity of observing; ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: Dieterici, Reisebilder, i.:194: \"We very often saw the animal lying in the sand, its jaws wide open and turned towards the warm sunbeams, while little birds, like the slender white water-wagtail, march quietly about in the deadly abyss, and pick out worms from the watery jaws.\" Herodotus, ii. 68, tells exactly the same story; as the special friend of the crocodile among little birds, he mentions τὸν τροχῖλον (the sand-piper, Pluvianus Aegyptius).)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and in connection therewith the reflex action of sneezing may occur, since the light of the sun produces an irritation on the retina, and thence on the vagus; and since the sun shines upon the fine particles of watery slime cast forth in the act of sneezing, a meteoric appearance may be produced. This delicate observation of nature is here compressed into three words; in this concentration of whole, grand thoughts and pictures, we recognise the older poet. עטשׁ is the usual Semitic word for \"sneezing\" (Synon. זרר   2 Kings 4:35). תּהל shortened from תּהל, Job 31:26, Hiph. of הלל. The comparison of the crocodile's eyes with עפעפּי־שׁחר (as Job 3:9, from עפעף, to move with quick vibrations, to wink, i.e., tremble), or the rendering of the same as εἶδος ἑωσφόρου (lxx), is the more remarkable, as, according to Horus, i. 68, two crocodile's eyes are the hieroglyph",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and in connection therewith the reflex action of sneezing may occur, since the light of the sun produces an irritation on the retina, and thence on the vagus; and since the sun shines upon the fine particles of watery slime cast forth in the act of sneezing, a meteoric appearance may be produced. This delicate observation of nature is here compressed into three words; in this concentration of whole, grand thoughts and pictures, we recognise the older poet. עטשׁ is the usual Semitic word for \"sneezing\" (Synon. זרר   ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 4:35",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). תּהל shortened from תּהל, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 31:26",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", Hiph. of הלל. The comparison of the crocodile's eyes with עפעפּי־שׁחר (as ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 3:9",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", from עפעף, to move with quick vibrations, to wink, i.e., tremble), or the rendering of the same as εἶδος ἑωσφόρου (lxx), is the more remarkable, as, according to Horus, i. 68, two crocodile's eyes are the hieroglyph",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: The eyes of the crocodile alone by themselves are no hieroglyph: how could they have been represented by themselves as crocodile's eyes? But in the Ramesseum and elsewhere the crocodile appears with a head pointing upwards in company with couching lions, and the eyes of the crocodile are rendered specially prominent. Near this group it appears again in a curved position, and quite small, but this time in company with a scorpion which bears a disc of the sun. The former (κροκοδείλου δύο ὀφθαλμοί) seems to me to be a figure of the longest night, the latter (κροκόδειλος κεκυφώς in Horapollo) of the shortest, so that consequently ἀνατολή and δύσις do not refer to the rising and setting of the sun, but to the night as prevailing against or succumbing to the day (communicated by Lauth from his researches on the astronomical monuments). But since the growth of the day begins with the longest night, and vice vers, the notions ἀνατολή and δύσις can, as it seems to me, retain their most natural signification; and the crocodile's eyes are, notwithstanding, a figure of the light shining forth from the darkness, as the crocodile's tail signifies black darkness (and Egypt as the black land).)",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "for dawn, ἀνατολή: ἐπειδ́περ (probably to be read ἐπειδὴ πρὸ) παντὸς σώματος ζώου οἱ ὀφθαλμοὶ ἐκ τοῦ βυθοῦ ἀναφαίνονται. There it is the peculiar brilliancy of the eyes of certain animals that is intended, which is occasioned either by the iris being furnished with a so-called lustrous substance, or there being in the pupil of the eye (as e.g., in the ostrich) that spot which, shining like metal, is called tapetum lucidum. For ἀναφαίνεσθαι of the eyes ἐκ τοῦ βυθοῦ, is the lustre of the pupil in the depth of the eye. The eyes of the crocodile, which are near together, and slanting, glimmer through the water, when it is only a few feet under water, with a red glow.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Nevertheless the comparison in Job 41:18 might also be intended differently. The inner (third) eyelid",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Nevertheless the comparison in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Job 41:18",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " might also be intended differently. The inner (third) eyelid",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "continued...",
        "children": []
      }
    ]
  }
]