[{"header":"The Gatekeepers"},{"num":26,"verse":"These are the groups of the gatekeepers."},{"num":2,"verse":"Meshelemiah had sons. Zechariah was his first son. Jediael was his second son. Zebadiah was his third son. Jathniel was his fourth son. "},{"num":3,"verse":"Elam was his fifth son. Jehohanan was his sixth son, and Eliehoenai was his seventh son."},{"num":4,"verse":"There were also Obed-Edom and his sons. Obed-Edom’s first son was Shemaiah. Jehozabad was his second son. Joah was his third son. Sacar was his fourth son. Nethanel was his fifth son. "},{"num":5,"verse":"Ammiel was his sixth son. Issachar was his seventh son, and Peullethai was his eighth son. God had blessed Obed-Edom with children."},{"num":6,"verse":"Obed-Edom’s son Shemaiah also had sons. They were leaders in their father’s family because they were capable men. "},{"num":7,"verse":"Shemaiah’s sons were Othni, Rephael, Obed, Elzabad, Elihu and Semakiah. Elihu and Semakiah were skilled workers. "},{"num":8,"verse":"All these men were Obed-Edom’s descendants. They and their sons and relatives were capable men. They were strong enough to do the work. Obed-Edom had 62 descendants in all."},{"num":9,"verse":"Meshelemiah had sons and relatives. They were skilled workers. In all, there were 18 sons and relatives."},{"num":10,"verse":"These are the gatekeepers from the Merari family. Hosah had sons. Shimri was chosen to be in charge. He was not the oldest son, but his father chose him to be in charge. "},{"num":11,"verse":"Hilkiah was his second son. Tabaliah was his third son, and Zechariah was his fourth son. In all, Hosah had 13 sons and relatives."},{"num":12,"verse":"These were the leaders of the groups of the gatekeepers. They had jobs for serving in the Temple of the Lord. Their relatives also had jobs in the Temple. "},{"num":13,"verse":"Each family was given a gate to guard. They were chosen by throwing lots. Young and old threw lots."},{"num":14,"verse":"Meshelemiah was chosen by lot to guard the East Gate. Then lots were thrown for Meshelemiah’s son Zechariah. He was a wise counselor. He was chosen for the North Gate. "},{"num":15,"verse":"Obed-Edom was chosen for the South Gate. And Obed-Edom’s sons were chosen to guard the storehouse. "},{"num":16,"verse":"Shuppim and Hosah were chosen for the West Gate. They also were to guard the Shalleketh Gate on the upper road."},{"num":17,"verse":"Six Levites stood guard every day at the East Gate. Four Levites stood guard every day at the North Gate. Four Levites stood guard every day at the South Gate. And two Levites at a time guarded the storehouse. "},{"num":18,"verse":"There were two guards at the western court. And there were four guards on the road to the court."},{"num":19,"verse":"These were the groups of the gatekeepers. They were from the families of Korah and Merari."},{"header":"Other Leaders"},{"num":20,"verse":"Other Levites were responsible for taking care of the treasuries of the Temple of God. They were also responsible for the places where the holy things were kept."},{"num":21,"verse":"Ladan was Gershon’s son. Ladan was the ancestor of several family groups. Jehiel was a leader of one of the family groups. "},{"num":22,"verse":"Jehiel’s sons were Zetham and his brother Joel. They were responsible for the treasuries of the Temple of the Lord."},{"num":23,"verse":"Other leaders were chosen from the family groups of Amram, Izhar, Hebron and Uzziel. "},{"num":24,"verse":"Shubael was the leader responsible for the treasuries of the Temple of the Lord. Shubael was the descendant of Gershom, who was Moses’ son. "},{"num":25,"verse":"These were Shubael’s relatives from Eliezer: Eliezer’s son Rehabiah, Rehabiah’s son Jeshaiah, Jeshaiah’s son Joram, Joram’s son Zicri and Zicri’s son Shelomith. "},{"num":26,"verse":"Shelomith and his relatives were responsible for everything that had been collected for the Temple. Things had been collected by King David and the heads of families. They had been collected by commanders of 1,000 men and of 100 men and other army commanders. "},{"num":27,"verse":"They also gave some of the things they had taken in wars. They gave them to be used in repairing the Temple of the Lord. "},{"num":28,"verse":"Shelomith and his relatives took care of all the holy things. Some had been given by Samuel the seer and Saul son of Kish. Some had been given by Abner son of Ner and Joab son of Zeruiah."},{"num":29,"verse":"Kenaniah was from the Izhar family. He and his sons worked outside the Temple. They worked as officers and judges in different places in Israel."},{"num":30,"verse":"Hashabiah was from the Hebron family. He and his relatives were responsible for the Lord’s work and the king’s business in Israel west of the Jordan River. There were 1,700 skilled men in Hashabiah’s group. "},{"num":31,"verse":"The history of the Hebron family shows that Jeriah was their leader. In David’s fortieth year as king, the records were searched. Some capable men of the Hebron family were found living at Jazer in Gilead. "},{"num":32,"verse":"Jeriah had 2,700 relatives who were skilled men. They were leaders of families. King David gave them the responsibility of directing the tribes of Reuben, Gad and the eastern half-tribe of Manasseh. They took care of the Lord’s work and the king’s business for them."}]