[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "18:1-16 The severest judgments, of themselves, will not humble or change the hearts of sinners; nothing, except the blood of Jesus Christ, can atone for the guilt of sin; nothing, except the sanctifying Spirit of God, can purge away its pollution. The priests and the Levites were gone to Judah and Jerusalem, 2Ch 11:13,14, but instead of them God raised up prophets, who read and expounded the word. They probably were from the schools of the prophets, first set up by Samuel. They had not the spirit of prophecy as Elijah, but taught the people to keep close to the God of Israel. These Jezebel sought to destroy. The few that escaped death were forced to hide themselves. God has his remnant among all sorts, high and low; and that faith, fear, and love of his name, which are the fruits of the Holy Spirit, will be accepted through the Redeemer. See how wonderfully God raises up friends for his ministers and people, for their shelter in difficult times. Bread and water were now scarce, yet Obadiah will find enough for God's prophets, to keep them alive. Ahab's care was not to lose all the beasts; but he took no care about his soul, not to lose that. He took pains to seek grass, but none to seek the favour of God; fencing against the effect, but not inquiring how to remove the cause. But it bodes well with a people, when God calls his ministers to stand forth, and show themselves. And we may the better endure the bread of affliction, while our eyes see our teachers.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "There is no nation ... - This is expressed in the style of Oriental hyperbole. What Obadiah means is: \"there is no nation nor kingdom, of those over which he has influence, whither the king has not sent.\" He could scarcely, for example, have exacted an oath from such countries as Egypt or Syria of Damascus. But Ahab may have been powerful enough to expect an oath from the neighboring Hittite, Moabite, and Edomite tribes, perhaps even from Ethbaal his father-in-law, and the kings of Hamath and Arpad. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "7-16. Obadiah was in the way … Elijah met him—Deeming it imprudent to rush without previous intimation into Ahab's presence, the prophet solicited Obadiah to announce his return to Ahab. The commission, with a delicate allusion to the perils he had already encountered in securing others of God's servants, was, in very touching terms, declined, as unkind and peculiarly hazardous. But Elijah having dispelled all the apprehensions entertained about the Spirit's carrying him away, Obadiah undertook to convey the prophet's message to Ahab and solicit an interview. But Ahab, bent on revenge, or impatient for the appearance of rain, went himself to meet Elijah.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And now thou sayest, go tell thy lord, behold, Elijah is here. Which, if I should not be able to make good, would be of fatal consequence to me; and that it is plain he feared, by what he next says. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And now thou sayest, Go, tell thy lord, Behold, Elijah is here.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 11.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And now thou sayest, Go, tell thy lord, Behold, Elijah is here.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Behold, Elijah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Obadiah echoes the words of ver. 8.] 1 Kings 18:11",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Obadiah was afraid that the execution of this command might cost him his life, inasmuch as Ahab had sent in search of Elijah \"to every kingdom and every nation,\" - a hyperbole suggested by inward excitement and fear. אין ואמרוּ is to be connected with what follows in spite of the accents: \"and if they said he is not here, he took an oath,\" etc.",
        "children": []
      }
    ]
  }
]