[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(21) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "How long halt ye between two opinions?—",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "In this exclamation is expressed the very motto of Elijah’s life. It is that of righteous impatience of the “halting” (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", limping to and fro) “between two opinions—at all times more dangerous, because more easy, than open apostasy—which was evidently characteristic of Ahab, and probably of the mass of the people. It might have suited well the accommodating genius of such polytheism as had been brought into Israel since the days of Solomon himself, but was utterly incompatible with the sole absolute claim of the worship of Jehovah. Perhaps Jezebel would have scorned it equally for Baal. Compare the indignant expostulation of Ezekiel (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 20:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Ezekiel 20:39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The question, once clearly understood, is always unanswerable, and is listened to here in awestruck silence.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1 Kings 18:21",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 18:21",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "How long halt ye between two opinions? ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Hebrew, ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "סעפים",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "segnipim, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "thoughts or considerations. Why do ye walk so lamely and unevenly, being so unsteady in your opinions and practices, as doubtful which to choose, Jehovah or Baal; sometimes serving one, and sometimes the other, and sometimes joining both together? Not only some Israelites worshipped God, and others Baal; but the same Israelites sometimes worshipped one, and sometimes the other. They worshipped God, perhaps, that they might please the prophets; and Baal to please Jezebel, and obtain favour at court. Now Elijah shows them the absurdity of this; he doth not insist on their relation to Jehovah, Is he not yours, and the God of your fathers; but Baal the god of the Zidonians, and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "will a nation change their God? ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jeremiah 2:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". No; he waves the prescription, and enters upon the merits of the cause: there can be but ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "one God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "but one ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "infinite, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and but one ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "supreme: ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "there needs but one God, one ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "omnipotent, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "one ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "all-sufficient: ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "what occasion of addition to that which is perfect? Now, if upon trial, it appear that Baal is that one, infinite, omnipotent being; that one supreme Lord, and all-sufficient Benefactor; you ought to renounce Jehovah, and cleave to Baal only: but if Jehovah be that one God, Baal is a cheat, and you must have no more to do with him. Apply this to the service of God, and the service of sin; the dominion of Christ, and the dominion of our lusts: these are the two thoughts or considerations, which it is dangerous halting between. Those do so that are unresolved under their convictions; unstable and unsteady in their purposes; promise fair, but do not perform; begin well, but do not hold on; that are inconsistent with themselves, indifferent and lukewarm in that which is good. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Their heart is divided, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "(",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hosea 10:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ",) whereas God will have all or none. Now we are fairly put to our choice, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "whom we will serve, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 24:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". If we can find one that has more right to us, or will be a better master to us than God, we may take him at our peril. God demands no more from us, than he can make out a title to. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The people answered him not a word — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Being convinced of the reasonableness of his proposal. They could say nothing to justify themselves, and they would say nothing to condemn themselves; but, as persons confounded, were entirely silent.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "18:21-40 Many of the people wavered in their judgment, and varied in their practice. Elijah called upon them to determine whether Jehovah or Baal was the self-existent, supreme God, the Creator, Governor, and Judge of the world, and to follow him alone. It is dangerous to halt between the service of God and the service of sin, the dominion of Christ and the dominion of our lusts. If Jesus be the only Saviour, let us cleave to him alone for every thing; if the Bible be the world of God, let us reverence and receive the whole of it, and submit our understanding to the Divine teaching it contains. Elijah proposed to bring the matter to a trial. Baal had all the outward advantages, but the event encourages all God's witnesses and advocates never to fear the face of man. The God that answers by fire, let him be God: the atonement was to be made by sacrifice, before the judgment could be removed in mercy. The God therefore that has power to pardon sin, and to signify it by consuming the sin-offering, must needs be the God that can relieve from the calamity. God never required his worshippers to honour him in the manner of the worshippers of Baal; but the service of the devil, though sometimes it pleases and pampers the body, yet, in other things, really is cruel to it, as in envy and drunkenness. God requires that we mortify our lusts and corruptions; but bodily penances and severities are no pleasure to him. Who has required these things at your hands? A few words uttered in assured faith, and with fervent affection for the glory of God, and love to the souls of men, or thirstings after the Lord's image and his favour, form the effectual, fervent prayer of the righteous man, which availeth much. Elijah sought not his own glory, but that of God, for the good of the people. The people are all agreed, convinced, and satisfied; Jehovah, he is the God. Some, we hope, had their hearts turned, but most of them were convinced only, not converted. Blessed are they that have not seen what these saw, yet have believed, and have been wrought upon by it, more than they that saw it.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The people were mute. They could not but feel the logical force of Elijah's argument; but they were not prepared at once to act upon it. They wished to unite the worship of Yahweh with that of Baal - to avoid breaking with the past and completely rejecting the old national worship, yet at the same time to have the enjoyment of the new rites, which were certainly sensuous, and probably impure. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "21-40. Elijah said unto all the people, How long halt ye?—They had long been attempting to conjoin the service of God with that of Baal. It was an impracticable union and the people were so struck with a sense of their own folly, or dread of the king's displeasure, that they \"answered not a word.\" Elijah proposed to decide for them the controversy between God and Baal by an appeal, not to the authority of the law, for that would have no weight, but by a visible token from Heaven. As fire was the element over which Baal was supposed to preside, Elijah proposed that two bullocks should be slain and placed on separate altars of wood, the one for Baal, and the other for God. On whichever the fire should descend to consume it, the event should determine the true God, whom it was their duty to serve. The proposal, appearing every way reasonable, was received by the people with unanimous approval. The priests of Baal commenced the ceremony by calling on their god. In vain did they continue invoking their senseless deity from morning till noon, and from noon till evening, uttering the most piercing cries, using the most frantic gesticulations, and mingling their blood with the sacrifice. No response was heard. No fire descended. Elijah exposed their folly and imposture with the severest irony and, as the day was far advanced, commenced his operations. Inviting the people to approach and see the entire proceeding, he first repaired an old altar of God, which Jezebel had demolished. Then, having arranged the cut pieces of the bullock, he caused four barrels or jars of water to be dashed all over the altar and round in the trench. Once, twice, a third time this precaution was taken, and then, when he had offered an earnest prayer, the miraculous fire descended (Le 9:24; Jud 6:21; 13:20; 1Ch 21:26; 2Ch 7:1), and consumed not only the sacrifice, but the very stones of the altar. The impression on the minds of the people was that of admiration mingled with awe; and with one voice they acknowledged the supremacy of Jehovah as the true God. Taking advantage of their excited feelings, Elijah called on them to seize the priestly impostors, and by their blood fill the channel of the river (Kishon), which, in consequence of their idolatries, the drought had dried up—a direction, which, severe and relentless as it seems, it was his duty as God's minister to give (De 15:5; 18:20). The natural features of the mount exactly correspond with the details of this narrative. The conspicuous summit, 1635 feet above the sea, on which the altars were placed, presents an esplanade spacious enough for the king and the priests of Baal to stand on the one side, and Elijah on the other. It is a rocky soil, on which there is abundance of loose stones, to furnish the twelve stones of which the altar was built—a bed of thick earth, in which a trench could be dug; and yet the earth not so loose that the water poured into it would be absorbed; two hundred fifty feet beneath the altar plateau, there is a perennial fountain, which, being close to the altar of the Lord, might not have been accessible to the people; and whence, therefore, even in that season of severe drought, Elijah could procure those copious supplies of water which he poured over the altar. The distance between this spring and the site of the altar is so short, as to make it perfectly possible to go thrice thither and back again, whereas it would have been impossible once in an afternoon to fetch water from the sea [Van De Velde]. The summit is one thousand feet above the Kishon, which nowhere runs from the sea so close to the base of the mount as just beneath El-Mohhraka; so that the priests of Baal could, in a few minutes, be taken down to the brook (torrent), and slain there.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "How long halt ye between two opinions?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " why do you not make straight paths with your feet? as the phrase is, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Hebrews 12:13",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 12:13",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; why do you walk so lamely and unevenly, being so unsteady in your opinions and practices, and doubting whether it is better to worship God or Baal? ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "If the Lord be God; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " whom you pretend to worship in the calves, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " 2 Kings 10:16,31",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "2 Kings 10:16",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ",31",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ": compare ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Exodus 32:4",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Exodus 32:4",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Follow him; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " worship him, and him only, and that in such place and manner as he hath commanded you, and not by the calves. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "But if Baal; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " if Baal can prove himself to be the true God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "The people answered him not a word, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " being convinced of the reasonableness of his proposition; taught by experience that Jehovah had sent this judgment, and that Baal could not remove it, which had staggered them in their opinion about Baal; yet not daring to disown Baal, for fear of the displeasure of the king, then present. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Elijah came unto all the people,.... Assembled at Mount Carmel: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and said, how long halt ye between two opinions? sometimes inclining to the one, and sometimes to the other: as a lame man in walking, his body moves sometimes to one side, and sometimes to another; or \"leap ye upon two branches\" (r), like a bird that leaps or hops from one branch to another, and never settles long; or rather it denotes the confusion of their thoughts, being like branches of trees twisted and implicated; thus upbraiding them with their inconstancy and fickleness; what their two opinions were, may be learnt from the next clause: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "if the Lord be God, follow him: but if Baal, then follow him; for there is but one God, one infinite, immense, and incomprehensible being; one that is omnipotent, all sufficient, good, and perfect; there cannot be more, and therefore but one to be followed, served, and worshipped: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the people answered him not a word: through conviction and confusion, his reasoning being unanswerable; or not knowing which to choose at present; or fearing they should be drawn into a snare, should they name any; either incur the displeasure of the king, who was for Baal, or of the prophet, who was for the Lord, at whose word rain was withheld, and might be given, which they were desirous of. ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(r)    \"transilietis super duos ramoe, Malvenda; vos transilientes super ambos ramos\", Piscator. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(r)    \"transilietis super duos ramoe, Malvenda; vos transilientes super ambos ramos\", Piscator. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Elijah came unto all the people, and said, How long {g} halt ye between two opinions? if the LORD be God, follow him: but if Baal, then follow him. And the people answered him not a word.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And Elijah came unto all the people, and said, How long ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{g}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " halt ye between two opinions? if the LORD ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "be",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " God, follow him: but if Baal, ",
            "children": []
          },
          {
            "element": "i",
            "class": "",
            "text": "then",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " follow him. And the people answered him not a word.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(g) Be consistent in religion and do not be indifferent, whether you follow God or Baal, or whether you serve God wholly or in part, Zep 1:5.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And Elijah came",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] R.V. adds ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "near",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The word is the same which is twice so rendered in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 18:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It indicates an approach for the purpose of conference and support.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "How long halt ye between two opinions",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The verb is an expressive word, and is used below for the irregular, stumbling sort of dance about the altar of Baal (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 18:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). It indicates a lame uncertain gait. Hence it suits very well the conduct of Israel, now drawn toward Jehovah, but not earnest there, and then attracted to Baal, but not altogether satisfied with that worship. The LXX. renders ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἕως πότε ὑμεῖς χωλανεῖτε ἐπ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "ʼ ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἀμφοτέραις ταῖς ἰγνύαις",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; How long go ye lame on both knees? But there is no ground for the last word of that translation, and it loses the sense. It was a lame going, now in one direction, now in another, that Elijah was reproaching.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 21.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And Elijah came unto all the people",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [He is concerned not so much with the king as the people of the Lord. His object was not \"to prove that Ahab and not he had troubled Israel,\" but to prove that Jehovah and not Baal was God. There is abundant room on the plateau, or \"wide upland sweep\" (Stanley), above referred to, to accommodate a large ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "c",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "oncourse of people], ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "and said, How long halt ye between two opinions?",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [This is a faithful and felicitous rendering. But it must be remembered that \"halt\" is used in the sense of \"limp.\" Vulg. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Usquequo claudicatis in duas partes",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The same word is used in ver. 26 of the swaying, tottering dance of the Baal prophets.] ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "If the Lord be God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "if Jehovah the God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "], ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "follow him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "go",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", walk straight) ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "after him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "]: ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "but if Baal, then follow him And the people answered him not a word.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [Not only were they awed by the presence of the king and the priests of Baal on the one side, and of Elijah on the other, but they were \"convicted by their own consciences,\" and so were speechless (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 22:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").] 1 Kings 18:21",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Elijah addressed the assembled people as follows: \"How long do ye limp upon both sides? Is Jehovah God, then go after Him; but if Baal be God, then go after him\" - and the people answered him not a word. They wanted to combine the worship of Jehovah and Baal, and not to assume a hostile attitude towards Jehovah by the worship of Baal; and were therefore obliged to keep silence under this charge of infatuated halving, since they knew very well from the law itself that Jehovah demanded worship with a whole and undivided heart (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 6:4-5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). This dividing of the heart between Jehovah and Baal Elijah called limping הסּעפּים שׁתּי על, \"upon the two parties (of Jehovah and Baal).\" For סעפּים the meaning \"divided opinions, parties,\" is well established by the use of סעפים in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 119:113",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and the rendering of the lxx ιγνύαι, the hollow of the knee, is only a paraphrase of the sense and not an interpretation of the word.",
        "children": []
      }
    ]
  }
]