[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(24) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "And call ye on the name of your gods.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—This gift of a “sign from heaven”—not unfamiliar to Israelite experience (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 9:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Chronicles 21:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2Chronicles 7:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ")—which may not, as our Lord teaches us (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 12:38-39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 16:1-4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), be craved for or demanded as a ground of faith, is, like all other miracles, granted unasked when it is seen by God’s wisdom to be needed, in order to startle an ignorant and misguided people into serious attention to a message from heaven. In this instance the worship of Baal was a worship of the power of Nature, impersonated perhaps in the sun; and the miracle therefore entered (so to speak) on the visible sphere, especially usurped in his name, in order to claim it for the Lord Jehovah.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1 Kings 18:24",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 18:24",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "The God that answereth by fire — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That sendeth down fire to consume the sacrifice presented to him: this the people knew the true God used to do. It was a great condescension in God, that he would permit Baal to be a competitor with him; but thus God would have every mouth to be stopped, and all flesh become silent before him: and Elijah doubtless had a special commission from God, or he durst not have put the matter to this issue. But the case was extraordinary, and the judgment upon it would be of use, not only then, but in all ages. Elijah does not say, The God that answers by water, though that was the thing the country needed, but ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that answers by fire, let him be God ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— Because the atonement was to be made, before the judgment could be removed: the God, therefore, that has power to pardon sin, and to signify that by consuming the sin-offering, must needs be the God that can relieve us against the calamity. “If, as it is generally believed, Baal was the idol of the sun, or that power whom his worshippers supposed to preside over the element of fire, the reason of Elijah’s proceeding is still more obvious, as it afforded a full proof that Jehovah, the God of nature, was alone the sovereign Lord and Ruler of all its operations, and of those of fire among the rest.” — Dodd. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "All the people answered, It is well spoken — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Even the Baalites themselves, partly because they could not, without great reproach to themselves and Baal, refuse so fair and equal a motion; and partly because they were confident of Baal’s power and divinity, having probably had some experiments of supernatural and extraordinary things done in his worships by God’s just and wise permission, for the hardening of that wicked people in their idolatry; as God hath in several ages suffered lying wonders to be wrought by the devil and his angels, for a similar reason.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "18:21-40 Many of the people wavered in their judgment, and varied in their practice. Elijah called upon them to determine whether Jehovah or Baal was the self-existent, supreme God, the Creator, Governor, and Judge of the world, and to follow him alone. It is dangerous to halt between the service of God and the service of sin, the dominion of Christ and the dominion of our lusts. If Jesus be the only Saviour, let us cleave to him alone for every thing; if the Bible be the world of God, let us reverence and receive the whole of it, and submit our understanding to the Divine teaching it contains. Elijah proposed to bring the matter to a trial. Baal had all the outward advantages, but the event encourages all God's witnesses and advocates never to fear the face of man. The God that answers by fire, let him be God: the atonement was to be made by sacrifice, before the judgment could be removed in mercy. The God therefore that has power to pardon sin, and to signify it by consuming the sin-offering, must needs be the God that can relieve from the calamity. God never required his worshippers to honour him in the manner of the worshippers of Baal; but the service of the devil, though sometimes it pleases and pampers the body, yet, in other things, really is cruel to it, as in envy and drunkenness. God requires that we mortify our lusts and corruptions; but bodily penances and severities are no pleasure to him. Who has required these things at your hands? A few words uttered in assured faith, and with fervent affection for the glory of God, and love to the souls of men, or thirstings after the Lord's image and his favour, form the effectual, fervent prayer of the righteous man, which availeth much. Elijah sought not his own glory, but that of God, for the good of the people. The people are all agreed, convinced, and satisfied; Jehovah, he is the God. Some, we hope, had their hearts turned, but most of them were convinced only, not converted. Blessed are they that have not seen what these saw, yet have believed, and have been wrought upon by it, more than they that saw it.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The God that answereth by fire - God had frequently before consumed offerings with supernatural fire ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 9:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 6:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Baal-worshippers were no doubt in the habit of attributing thunder and lightning to their gods - the great Nature-power - and thus had no excuse for declining Elijah's challenge. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "21-40. Elijah said unto all the people, How long halt ye?—They had long been attempting to conjoin the service of God with that of Baal. It was an impracticable union and the people were so struck with a sense of their own folly, or dread of the king's displeasure, that they \"answered not a word.\" Elijah proposed to decide for them the controversy between God and Baal by an appeal, not to the authority of the law, for that would have no weight, but by a visible token from Heaven. As fire was the element over which Baal was supposed to preside, Elijah proposed that two bullocks should be slain and placed on separate altars of wood, the one for Baal, and the other for God. On whichever the fire should descend to consume it, the event should determine the true God, whom it was their duty to serve. The proposal, appearing every way reasonable, was received by the people with unanimous approval. The priests of Baal commenced the ceremony by calling on their god. In vain did they continue invoking their senseless deity from morning till noon, and from noon till evening, uttering the most piercing cries, using the most frantic gesticulations, and mingling their blood with the sacrifice. No response was heard. No fire descended. Elijah exposed their folly and imposture with the severest irony and, as the day was far advanced, commenced his operations. Inviting the people to approach and see the entire proceeding, he first repaired an old altar of God, which Jezebel had demolished. Then, having arranged the cut pieces of the bullock, he caused four barrels or jars of water to be dashed all over the altar and round in the trench. Once, twice, a third time this precaution was taken, and then, when he had offered an earnest prayer, the miraculous fire descended (Le 9:24; Jud 6:21; 13:20; 1Ch 21:26; 2Ch 7:1), and consumed not only the sacrifice, but the very stones of the altar. The impression on the minds of the people was that of admiration mingled with awe; and with one voice they acknowledged the supremacy of Jehovah as the true God. Taking advantage of their excited feelings, Elijah called on them to seize the priestly impostors, and by their blood fill the channel of the river (Kishon), which, in consequence of their idolatries, the drought had dried up—a direction, which, severe and relentless as it seems, it was his duty as God's minister to give (De 15:5; 18:20). The natural features of the mount exactly correspond with the details of this narrative. The conspicuous summit, 1635 feet above the sea, on which the altars were placed, presents an esplanade spacious enough for the king and the priests of Baal to stand on the one side, and Elijah on the other. It is a rocky soil, on which there is abundance of loose stones, to furnish the twelve stones of which the altar was built—a bed of thick earth, in which a trench could be dug; and yet the earth not so loose that the water poured into it would be absorbed; two hundred fifty feet beneath the altar plateau, there is a perennial fountain, which, being close to the altar of the Lord, might not have been accessible to the people; and whence, therefore, even in that season of severe drought, Elijah could procure those copious supplies of water which he poured over the altar. The distance between this spring and the site of the altar is so short, as to make it perfectly possible to go thrice thither and back again, whereas it would have been impossible once in an afternoon to fetch water from the sea [Van De Velde]. The summit is one thousand feet above the Kishon, which nowhere runs from the sea so close to the base of the mount as just beneath El-Mohhraka; so that the priests of Baal could, in a few minutes, be taken down to the brook (torrent), and slain there.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "That answereth by fire, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " i.e. that shall consume the sacrifice by fire sent from heaven; which the people knew the true God used to do, as ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Genesis 4:4 Judges 6:21 13:20",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 4:4",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 6:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " 13:20",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "All the people; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " even the Baalites themselves; partly because they could not without great reproach to themselves and Baal refuse so equal a motion; and partly because they were confident of Baal’s power and divinity, having probably had some experiments of supernatural and prodigious events done in the worship of Baal by God’s just and wise permission, for the hardening of that apostatical and wicked people in their idolatry; as God hath in several ages for the like reason suffered lying wonders to be wrought by the devil, whom they worshipped in and by their idols. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And call ye on the name of your gods,.... The Baalim, the many lords and gods they served: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and I will call on the name of the Lord; the one true Jehovah and God of Israel, whom I:serve: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and the God that answereth by fire; by causing fire to come down upon the sacrifice, and consume it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "let him be God; accounted, owned, and acknowledged as the true God, and so afterwards worshipped as such: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and all the people answered and said, it is well spoken; they thought it a very reasonable proposal, a very good method to determine the controversy, and come at the truth, and know who was the true God, and who not. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and all the people answered and said, it is well spoken; they thought it a very reasonable proposal, a very good method to determine the controversy, and come at the truth, and know who was the true God, and who not. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And call ye on the name of your gods, and I will call on the name of the LORD: and the God that answereth {h} by fire, let him be God. And all the people answered and said, It is well spoken.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And call ye on the name of your gods, and I will call on the name of the LORD: and the God that answereth ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{h}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " by fire, let him be God. And all the people answered and said, It is well spoken.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(h) By sending down fire from heaven to burn the sacrifice.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "call ye on the name of your gods",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] R.V. ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "god",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". And so in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 18:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Baal was meant, and though the plural ‘Elohim’ came to be specially used of Jehovah, as embracing all that other nations conceived as attributes of all their gods, yet the plural is also applied to single heathen divinities. Thus ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 5:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ‘Dagon our god’; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 1:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ‘Baal-zebub, the god of Ekron.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Elijah by saying ‘call ye’ identifies the people, to whom he is speaking, with the Baal-prophets to whom he uses the same words in the next verse.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "on the name of the Lord",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The LXX. adds ‘my God.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "that answereth by fire",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] As Baal was specially the Sun-god, the trial by sending down fire was one to which the prophets of Baal could make no objection.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 24.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And call ye on the name of your gods",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [As Elijah is still addressing the people, not the prophets of Baal (see ver. 25), this change of person is significant. He sorrowfully assumes that they have taken Baal and Astarte for their gods], ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "and I will call on the name of the Lord: and the God that answereth by fire, let him be God.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "he",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " shall be ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "the God, i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the true God and their God. Cf. ver. 39. Not only was a \"sign from heaven\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 8:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ever esteemed a more powerful and direct proof of Divine energy - perhaps as being less liable to be counterfeited, and as excluding the idea of the operation of infernal powers (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Matthew 12:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") - but it must be remembered that Baal claimed to be the Sun god and Lord of the elements and forces of nature; while Jehovah bad already, according to the law, identified Himself with this token (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 9:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 21:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 7:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Indeed, this sign had a double fit. ness as a test of the true religion. It would not only put the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "powers",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " of the rival deities to the proof; it would also at the same time decide which of the rival systems of worship was acceptable to the Supreme Being. It is observable that there is no mention of rain. We might have expected, after the long drought, that this would be the test. But that could not be promised until the Lord had first been recognized as God.] ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And all the people answered and said, Is well spoken.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Good the word",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". They accepted Elijah's proposition, but whether eagerly or reluctantly it is difficult to say. The Hebrew merely conveys that they admitted its fairness and reasonableness. Having gained the assent of the people, for whose verdict he and the Baal prophets were now contending, and who were, consequently, entitled to be consulted as to the sign which would satisfy them, he turns to the band of 400 prophets, who, probably in all the bravery of their sacrificial vestments (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 10:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), occupied a separate position on the hill top, between the king and the people, and repeats his proposal to them. 1 Kings 18:24",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "As the people adhered to their undecided double-mindedness, Elijah proposed to let the Deity Himself decide who was the true God, Jehovah or Baal. The prophets of Baal were to offer a sacrifice to Baal, and he (Elijah) would offer one to Jehovah. And the true God should make Himself known by kindling the burnt-offering presented to Him with fire from heaven, and in this way answering the invocation of His name. This proposal was based upon the account in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". As Jehovah had there manifested Himself as the God of Israel by causing fire to fall from heaven upon the first sacrifice presented in front of the tabernacle and to consume it, Elijah hoped that in like manner Jehovah would even now reveal Himself as the living God. And the form of decision thus proposed would necessarily appear all the fairer, because Elijah, the prophet of Jehovah, stood alone in opposition to a whole crowd of Baal's prophets, numbering no less than 450 men. And for that very reason the latter could not draw back, without publicly renouncing their pretensions, whether they believed that Baal would really do what was desired, or hoped that they might be able to escape, through some accident or stratagem, from the difficult situation that had been prepared for them, or fancied that the God of Elijah would no more furnish the proof of His deity that was desired of Him than Baal would. In order, however, to cut off every subterfuge in the event of their attempt proving a failure, Elijah not only yielded the precedence to them on the occasion of this sacrifice, but gave them the choice of the two oxen brought to be offered; which made the fairness of his proposal so much the more conspicuous to every one, that the people willingly gave their consent.",
        "children": []
      }
    ]
  }
]