[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "MacLaren's Expositions",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1 Kings",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "THE TRIAL BY FIRE1 Kings 18:25 - 1 Kings 18:39",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "THE TRIAL BY FIRE",
            "children": []
          },
          {
            "element": "span",
            "class": "p",
            "text": "",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 18:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " - ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 18:39",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The place, the purpose, and the actors in this scene, make it among the grandest in history. A nation, with its king, has come together, at the bidding of one man, to settle no less a question than whom they shall worship. There, on the slope of Carmel, with the brassy heaven gleaming hard and dry above them, and the yellow, burnt-up plain of Jezreel at their feet, the expectant people stand. The assembly was a singular proof of Elijah’s ascendency; for Ahab’s bluster had sunk, cowed in his presence, and he had meekly done the prophet’s bidding in summoning ‘all Israel’ and the eight hundred and fifty Baal and Asherah prophets, for an unexplained purpose. The false priests would come unwillingly; but they came.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Then Elijah takes the command, and, though utterly alone, towers above the crowd in the courage of his undaunted confidence in his message. His words have the ring of authority as he rebukes indecision, and calls for a clear adhesion to Baal or Jehovah. If the people had answered, the trial by fire would have been needless. But their silence shows that they waver, and therefore he makes his proposal to them.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Note that the priests are not consulted, nor is Ahab. The former would have had some excuse for shirking the sharp issue; but the people’s assent forced them to accept the ordeal,-reluctantly enough, no doubt.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "I. The vain cries to a deaf God.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " It is strange that one of the parties to the test has power to determine its conditions, especially as Elijah’s prophetic authority was one of the things in dispute; but it is a sign of the magnetic power which one bold man with absolute confidence in his own convictions exercises over men. The Baal prophets are given every advantage in priority of action. Error is best unmasked by being allowed free opportunity to do its best; for the more favourable the circumstances of trial, the more signal the defeat. God’s servants must never be suspected of unfair tricks in their controversy with error. They can afford to let it try first. Notice the substitution of ‘your god,’ in the Revised Version, for ‘your gods’ in the Authorised Version. That is obviously right; for the only question was about one god,-namely, Baal.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " So, in the early morning, with all the people gazing at them, the Baal priests or prophets begin their attempt. It was easy to prepare the sacrifice, and lay it on the altar,-though, no doubt, it was done sullenly, with foreboding of the coming exposure. The whole account of the wild invocations of the priests may suggest some of the characteristics of idolatry, and touch our hearts with pity, as well as with the sense of its absurdity, which animated Elijah’s mockery.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Note, then, the vivid picture, in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 18:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", of the long hours of vain crying. On the one hand, we hear the wild chorus echoing among the rocks; on the other, we feel the dead silence in the heavens.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The monotonous and almost mechanical repetition of the invocation, prolonged till the syllables have no meaning to the yelling crowd, is characteristic of the frenzied excitement so common in idolatry. To call such howlings prayer, degrades the name. They are the very opposite of that sacred communion of a believing soul with the God whom it knows, trusts, and beseeches with submission. Neither knowledge nor trust is in these shrieks, which seek to propitiate the stern god by repeating his name as a kind of charm. Heathenism has no true prayer. Wild cries and passionate desires, flung upwards to an unloved god, are not prayer; and that solace and anchor of the troubled soul is wanting in all the dreary lands given up to idolatry.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The melancholy persistence of the unanswered cries may stand as a symbol of the tragic obstinacy with which their devotees cling to their vain gods,-a rebuke to us with a more enlightened faith. The silence, which was the only answer, is put in strong contrast with the continuous roar of the four hundred and fifty,-so long and loud the hoarse cries here, so unmoved the stillness in the careless heaven. That, too, is typical of heathenism, which is sad with unavailing cries and ignorant of answers to any. As the day wore on, and the voices grew hoarse, and hope declined, more violent bodily exercise was resorted to, and the shouting crowd danced {or, perhaps, as the margin says, ‘limped,’-a picturesque and contemptuous word for the grotesque contortions around the altar}, as if that might bring the answer. That again is a feature common to all heathenism. No wonder that Elijah’s scorn broke forth vehemently at such a sight. Noon was the hour of the sun’s greatest power, and, since Baal was probably a solar deity, it was the hour when, if ever, he would spare one of his abundant fiery beams to light the pyre. So Elijah’s taunts came just when they were most biting, and none can say that they were undeserved. His fiery zeal and his naturally stern character broke out in the bitter irony with which he imagines a variety of undignified positions for Baal.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Sarcasm is not the highest weapon, and the ‘spirit of Elijah’ is not the spirit of Jesus; but the exposure of the absurdity of idolatry is legitimate, and even ridicule may have its place in pricking wind-distended bladders. A man throttling a serpent may be excused using anything that comes handy for the purpose. But, at the same time, the right attitude for us as Christians in the presence of that awful fact of idolatry, is neither contempt nor scientific curiosity, but pity deep as Christ’s, and earnest resolve to help our darkened brethren. The taunts stirred to fiercer excitement and more extravagant acts, as ridicule is wont to do, and therein proves itself an unreliable instrument of controversy. Laughing at a man generally makes him more obstinate. The priests answered Elijah by savagely gashing their half-naked bodies with knives and lances,-a ready way to make blood come, but not to bring fire. The frenzy became wilder as the day declined, and at last, covered with blood, hoarse with shouting, panting with their gymnastics, they ‘prophesied,’ having wrought themselves into that state of excitement in which incoherent rhapsodies burst from their lips. What a scene to call worship! That is what millions of men are ready to practise to-day. And all the while there is no voice, no answer, no care for them, in the pitiless sky. The very genius of idolatry is set before us in that tumultuous crowd on Carmel.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "II. The sacrifice of faith and the answer by fire.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " We pass from a scene of wild commotion into an atmosphere of sacred calm in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 18:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The contrast is striking. The fiery fervours of the day are past, and the sun is sinking behind the top of Carmel, and there is much to do before it sets. Elijah with his own hands, as would appear, repairs a ruined altar among the woods. Probably it had been erected for secret worship of Jehovah by some faithful amid the national apostasy, when access to Jerusalem was forbidden them, and had been destroyed by Ahab in his crusade against Jehovah worshippers. The selection of the twelve stones was symbolical of the unbroken unity of the nation, and was Elijah’s protest against the very existence of the Northern kingdom, and its assumption of the name of ‘Israel’ The writer explains what was meant, when he reminds us that Israel was the name given to Jacob, and therefore, as he would have us infer, was the common property of all his descendants. Judah was a part of Israel, and Israel should be an undivided whole, uniting in all its tribes in bringing offerings to Jehovah.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " It was a daring thing to do before Ahab’s face; but the weak king was, for the time, subjugated by the imperious will and courage of Elijah. The building of the altar, with its mute witness to God’s purpose, would touch some hearts in the gazing, silent crowd. The next step was, of course, meant to make the miracle more conspicuous by drenching everything with water, probably brought, even in that drought, from the perennial fountain near at hand. Perhaps, too, the number of barrels was intended, again, as symbolical of the twelve tribes.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " One can fancy the wonder and eagerness of the people, and the dark frowns of the baffled and exhausted Baal priests, as they gradually came out of their frenzy, and knew that they had lost their opportunity. The tranquil though earnest prayer of the prophet is in sharpest contrast with the meaningless bellowings to Baal. Note in it the solemn invocation. The great Name, which all listening to him had deposed from rule over them, is set in the front; and the ancestral worship, as well as the divine gifts and dealings with the patriarchs, is pleaded with God as the reason for His answer now. The name of ‘Israel’ instead of the more common ‘Jacob,’ has the same force as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 18:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Note the substance of the petitions. The deepest desire of a truly devout soul is that God would make His name known. Zeal for God’s honour and love for men who have gone astray from Him, conspire to make that the head and front of His true servant’s prayers. It is God, not his own credit, about which Elijah thinks first. For himself, all that he desires is to be known as an obedient servant, and as not having done anything at the bidding of his own will or judgment, but in accordance with the all-commanding Voice.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " Clearly we must suppose that in all the ordering of this sublime trial by fire, Elijah had been acting ‘at Thy word,’ even though we have no other record of the fact. He had no right to expect an answer unless he had been bidden to propose the test. God will honour the drafts which He bids us draw on Him; but to suspend our own or other people’s faith in Him, on the issue of some experiment whether He will answer prayers, is not faith, but rash presumption, unless it is in obedience to a distinct command. Elijah had such a command, and therefore he could ask God to vindicate his action, and to prove that he was God’s servant. His last petition is beautiful, both in its consciousness of power with God and recognition of his place as a prophet, and in its lowly subordination of all personal aims to the restoration of Israel to the true worship. He asks, with reiteration which is earnestness and faith, and therefore the sharpest contrast to the mechanical repetition by Baal’s priests, that God would hear him; but his sole object in that prayer is, not that his name may be exalted as a prophet, or that any good may come to him, but that the blinded eyes may be opened, and the hearts, that have been so sadly led astray, be brought back to the worship of their fathers’ God.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The whole brief prayer, in its calm confidence; its adoring recognition of the name and past dealings of Jehovah as the ground of trust; its throbbing of earnest desire for the manifestation of His character before men; its consciousness of personal relation to God, which humbles rather than puffs up; its beseeching for an answer, and its closing petition, which comes round again to its first, that men may know God, and fasten their hearts on Him,-may well stand as a pattern of prayer for us.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " The short prayer of faith does in a moment what all the long day of crying could not do. The language in which the answer is described emulates the rapidity of the swift tongues of fire which licked up sacrifice, altar, and water. They were the tokens of acceptance, reminding of the consuming of the first sacrifices in the Tabernacle, and, like them, inaugurating a new beginning of the worship of God. The burning of the altar, as well as of the sacrifice, expressed the acceptance of the people whom it, by its twelve stones, symbolised. And the people, on their part, were-for the time, at all events-swept away by the miracle, and by the force of the prophet’s example and authority. Short-lived their faith may have been, as certainly it was superficial; but the fire had for the time melted their hearts, and set them flowing in the ancient channels of devotion. The faith that is founded on miracle may be deepened into something better; but unless it is, it speedily dies away. The faith that is due to the influence of some strong personality may lead on to an independent faith, based on personal experience; but, unless it does, it too will perish.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " We may find a modern reproduction of the test of Carmel in the impotence of all other schemes and methods of social and spiritual reformation and the power of the Gospel. In it and its effects God answers by fire. Let the opposers, who are so glib in demonstrating the failure of Christianity, do the same with their enchantments, if they can.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1 Kings 18:25",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 18:25",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Choose ye one bullock for yourselves, and dress it first — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "I give you the precedence, because I am single, and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "you are many. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "It was wise in Elijah to put them upon sacrificing first; because, if he had offered first and God had answered by fire, Baal’s priests would have desisted from making the trial on their part; and because the disappointment of the priests of Baal, of which he was well assured, would prepare the way for the people’s attention to his words, and cause them to entertain his success with more affection; and this coming last would leave the greater impression upon their hearts. And this they accepted, because they might think that if Baal answered them first, which they presumed he would, the people would be so confirmed and heightened in their opinion of Baal, that they might murder Elijah before he came to his experiment.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "18:21-40 Many of the people wavered in their judgment, and varied in their practice. Elijah called upon them to determine whether Jehovah or Baal was the self-existent, supreme God, the Creator, Governor, and Judge of the world, and to follow him alone. It is dangerous to halt between the service of God and the service of sin, the dominion of Christ and the dominion of our lusts. If Jesus be the only Saviour, let us cleave to him alone for every thing; if the Bible be the world of God, let us reverence and receive the whole of it, and submit our understanding to the Divine teaching it contains. Elijah proposed to bring the matter to a trial. Baal had all the outward advantages, but the event encourages all God's witnesses and advocates never to fear the face of man. The God that answers by fire, let him be God: the atonement was to be made by sacrifice, before the judgment could be removed in mercy. The God therefore that has power to pardon sin, and to signify it by consuming the sin-offering, must needs be the God that can relieve from the calamity. God never required his worshippers to honour him in the manner of the worshippers of Baal; but the service of the devil, though sometimes it pleases and pampers the body, yet, in other things, really is cruel to it, as in envy and drunkenness. God requires that we mortify our lusts and corruptions; but bodily penances and severities are no pleasure to him. Who has required these things at your hands? A few words uttered in assured faith, and with fervent affection for the glory of God, and love to the souls of men, or thirstings after the Lord's image and his favour, form the effectual, fervent prayer of the righteous man, which availeth much. Elijah sought not his own glory, but that of God, for the good of the people. The people are all agreed, convinced, and satisfied; Jehovah, he is the God. Some, we hope, had their hearts turned, but most of them were convinced only, not converted. Blessed are they that have not seen what these saw, yet have believed, and have been wrought upon by it, more than they that saw it.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Elijah gives precedence in everything to the Baal-priests, to take away all ground for cavil in case of failure. It is his object to make an impression on king and people; and he feels rightly that the impression will depend greatly on the contrast between their inability and the power given to him. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "21-40. Elijah said unto all the people, How long halt ye?—They had long been attempting to conjoin the service of God with that of Baal. It was an impracticable union and the people were so struck with a sense of their own folly, or dread of the king's displeasure, that they \"answered not a word.\" Elijah proposed to decide for them the controversy between God and Baal by an appeal, not to the authority of the law, for that would have no weight, but by a visible token from Heaven. As fire was the element over which Baal was supposed to preside, Elijah proposed that two bullocks should be slain and placed on separate altars of wood, the one for Baal, and the other for God. On whichever the fire should descend to consume it, the event should determine the true God, whom it was their duty to serve. The proposal, appearing every way reasonable, was received by the people with unanimous approval. The priests of Baal commenced the ceremony by calling on their god. In vain did they continue invoking their senseless deity from morning till noon, and from noon till evening, uttering the most piercing cries, using the most frantic gesticulations, and mingling their blood with the sacrifice. No response was heard. No fire descended. Elijah exposed their folly and imposture with the severest irony and, as the day was far advanced, commenced his operations. Inviting the people to approach and see the entire proceeding, he first repaired an old altar of God, which Jezebel had demolished. Then, having arranged the cut pieces of the bullock, he caused four barrels or jars of water to be dashed all over the altar and round in the trench. Once, twice, a third time this precaution was taken, and then, when he had offered an earnest prayer, the miraculous fire descended (Le 9:24; Jud 6:21; 13:20; 1Ch 21:26; 2Ch 7:1), and consumed not only the sacrifice, but the very stones of the altar. The impression on the minds of the people was that of admiration mingled with awe; and with one voice they acknowledged the supremacy of Jehovah as the true God. Taking advantage of their excited feelings, Elijah called on them to seize the priestly impostors, and by their blood fill the channel of the river (Kishon), which, in consequence of their idolatries, the drought had dried up—a direction, which, severe and relentless as it seems, it was his duty as God's minister to give (De 15:5; 18:20). The natural features of the mount exactly correspond with the details of this narrative. The conspicuous summit, 1635 feet above the sea, on which the altars were placed, presents an esplanade spacious enough for the king and the priests of Baal to stand on the one side, and Elijah on the other. It is a rocky soil, on which there is abundance of loose stones, to furnish the twelve stones of which the altar was built—a bed of thick earth, in which a trench could be dug; and yet the earth not so loose that the water poured into it would be absorbed; two hundred fifty feet beneath the altar plateau, there is a perennial fountain, which, being close to the altar of the Lord, might not have been accessible to the people; and whence, therefore, even in that season of severe drought, Elijah could procure those copious supplies of water which he poured over the altar. The distance between this spring and the site of the altar is so short, as to make it perfectly possible to go thrice thither and back again, whereas it would have been impossible once in an afternoon to fetch water from the sea [Van De Velde]. The summit is one thousand feet above the Kishon, which nowhere runs from the sea so close to the base of the mount as just beneath El-Mohhraka; so that the priests of Baal could, in a few minutes, be taken down to the brook (torrent), and slain there.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Ye are many, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and I am willing to give you the precedency. This he did, partly because if he had first offered, and God had answered by fire, as he knew that he would do, Baal’s priests would have been discouraged, and upon some excuse (which would easily be accepted in regard of the king’s authority, and the favour which they had with the people) would have desisted from making the trial on their part; and partly because the disappointment of the priests of Baal, of which he was well assured, would notably prepare the way for the people’s more diligent attention unto his words and actions, and cause them to entertain the prophet’s good success with more admiration and affection; and this coming last, would leave the greater impression and relish upon their hearts. And this they accepted, be cause they might think, that if Baal did answer them first, which they presumed he would, the people would be so confirmed and heightened in their opinion of Baal, that they by the king’s assistance might murder Elijah before he came to his experiment. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Elijah said unto the prophets of Baal,.... Who agreed to this proposal, though not expressed; or they signified it by their silence. Ben Gersom thinks they agreed to it, because that, according to their belief, Baal was Mars, and in the sign of Aries, one of the fiery planets, and therefore fancied he could send down fire on their sacrifice; but Abarbinel is of opinion that it was the sun they worshipped, under the name of Baal, the great luminary which presides over the element of fire, and therefore had power to cause it to descend; and if not, they agreed to it, he thinks, for three reasons; one was necessity, they could not refuse, after the people had approved of it, lest they should rise upon them, and stone them; and another was, that Elijah proposed to offer without the temple, contrary to the law of his God, and therefore concluded he would not answer him by fire, and so they should be upon a par with him; and the third was, that they thought they should offer their bullocks together, so that, if fire descended, it would come upon them both, and then the dispute would be, whether his God, or their god, sent it; and so no proof could be made who was God, nor the matter in controversy decided: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "choose you one bullock for yourselves, and dress it first; for ye are many; therefore in civility to them gave the choice of the bullock and the altar first, he being one and they many: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and call on the name of your gods, but put no fire under; under the wood on which was the sacrifice cut in pieces; and when they had so done, then they were to call on their gods to cause fire to descend upon it. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and call on the name of your gods, but put no fire under; under the wood on which was the sacrifice cut in pieces; and when they had so done, then they were to call on their gods to cause fire to descend upon it. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Elijah said unto the prophets of Baal, Choose you one bullock for yourselves, and dress it first; for ye are many; and call on the name of your gods, but put no fire under.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the prophets of Baal",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Here, as above in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 18:19",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the LXX., instead of ‘Baal’ has ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "τῆς αἰσχύνης",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". See note there. The pomp and splendour of the priests of Baal glittering no doubt with gorgeous vestments (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 10:22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") would shew the more because of the rough shaggy garb of the Tishbite, whose congenial abode was the mountain tops or the fastnesses of Gilead.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 25.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And Elijah said unto the prophets of Baal, Choose you one bullock for yourselves, and dress",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [or ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "offer",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", as in ver. 23] ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "it first; for ye are many",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "the many",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Every pre-eminence and advantage which he gives to them will make his triumph, when it comes, all the greater. It is quite possible that he meant again to hint at their immense superiority in point of numbers. But no doubt he was only too glad to find a reason for their taking the  lead. \"He is anxious that their inability shall be fully manifested before he shows his own power\" (Rawlinson). Whether the idea was also present in his mind that they \"could prepare their victim in a much shorter time than he could prepare his\" (",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "ib",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) is by no means so certain]; ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "and call on the name of your gods",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [or ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "god, i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Baal], ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "but put no fire under.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [The repetition (cf. ver. 24) shows that the ordeal was proposed separately to the people and the prophets.] 1 Kings 18:25",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "As the people adhered to their undecided double-mindedness, Elijah proposed to let the Deity Himself decide who was the true God, Jehovah or Baal. The prophets of Baal were to offer a sacrifice to Baal, and he (Elijah) would offer one to Jehovah. And the true God should make Himself known by kindling the burnt-offering presented to Him with fire from heaven, and in this way answering the invocation of His name. This proposal was based upon the account in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". As Jehovah had there manifested Himself as the God of Israel by causing fire to fall from heaven upon the first sacrifice presented in front of the tabernacle and to consume it, Elijah hoped that in like manner Jehovah would even now reveal Himself as the living God. And the form of decision thus proposed would necessarily appear all the fairer, because Elijah, the prophet of Jehovah, stood alone in opposition to a whole crowd of Baal's prophets, numbering no less than 450 men. And for that very reason the latter could not draw back, without publicly renouncing their pretensions, whether they believed that Baal would really do what was desired, or hoped that they might be able to escape, through some accident or stratagem, from the difficult situation that had been prepared for them, or fancied that the God of Elijah would no more furnish the proof of His deity that was desired of Him than Baal would. In order, however, to cut off every subterfuge in the event of their attempt proving a failure, Elijah not only yielded the precedence to them on the occasion of this sacrifice, but gave them the choice of the two oxen brought to be offered; which made the fairness of his proposal so much the more conspicuous to every one, that the people willingly gave their consent.",
        "children": []
      }
    ]
  }
]