[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(39) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "They fell on their faces.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—Exactly as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 9:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", at the inauguration of the sacrifices of the new Tabernacle by the fire from heaven, with the characteristic addition of the cry, “Jehovah; He, and He only, is God.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1 Kings 18:39",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 18:39",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "When all the people saw it, they fell on their faces — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "In acknowledgment and adoration of the true God; and all, as one man, cried out, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Jehovah, he is the God ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— He alone; and Baal is a senseless idol. And they repeated the words to signify their abundant satisfaction, and assurance of the truth of their assertion. And some, we may hope, had their hearts so turned back as to be determined that he should be their God, and that they would serve him only, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 24:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". But it is certain the generality of them were convinced only, not converted; they yielded to the truth of God, that ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "he is the God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "but consented not to his covenant that he should be ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "their ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "God. Blessed are they, who have not seen what they saw, and yet have believed, and been influenced more than they that saw it.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "18:21-40 Many of the people wavered in their judgment, and varied in their practice. Elijah called upon them to determine whether Jehovah or Baal was the self-existent, supreme God, the Creator, Governor, and Judge of the world, and to follow him alone. It is dangerous to halt between the service of God and the service of sin, the dominion of Christ and the dominion of our lusts. If Jesus be the only Saviour, let us cleave to him alone for every thing; if the Bible be the world of God, let us reverence and receive the whole of it, and submit our understanding to the Divine teaching it contains. Elijah proposed to bring the matter to a trial. Baal had all the outward advantages, but the event encourages all God's witnesses and advocates never to fear the face of man. The God that answers by fire, let him be God: the atonement was to be made by sacrifice, before the judgment could be removed in mercy. The God therefore that has power to pardon sin, and to signify it by consuming the sin-offering, must needs be the God that can relieve from the calamity. God never required his worshippers to honour him in the manner of the worshippers of Baal; but the service of the devil, though sometimes it pleases and pampers the body, yet, in other things, really is cruel to it, as in envy and drunkenness. God requires that we mortify our lusts and corruptions; but bodily penances and severities are no pleasure to him. Who has required these things at your hands? A few words uttered in assured faith, and with fervent affection for the glory of God, and love to the souls of men, or thirstings after the Lord's image and his favour, form the effectual, fervent prayer of the righteous man, which availeth much. Elijah sought not his own glory, but that of God, for the good of the people. The people are all agreed, convinced, and satisfied; Jehovah, he is the God. Some, we hope, had their hearts turned, but most of them were convinced only, not converted. Blessed are they that have not seen what these saw, yet have believed, and have been wrought upon by it, more than they that saw it.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The Lord, he is the God - The people thus pronounced the matter to be clearly and certainly decided. Baal was overthrown; he was proved to be no god at all. The Lord Yahweh, He, and He alone, is God. Him would they henceforth acknowledge, and no other. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "21-40. Elijah said unto all the people, How long halt ye?—They had long been attempting to conjoin the service of God with that of Baal. It was an impracticable union and the people were so struck with a sense of their own folly, or dread of the king's displeasure, that they \"answered not a word.\" Elijah proposed to decide for them the controversy between God and Baal by an appeal, not to the authority of the law, for that would have no weight, but by a visible token from Heaven. As fire was the element over which Baal was supposed to preside, Elijah proposed that two bullocks should be slain and placed on separate altars of wood, the one for Baal, and the other for God. On whichever the fire should descend to consume it, the event should determine the true God, whom it was their duty to serve. The proposal, appearing every way reasonable, was received by the people with unanimous approval. The priests of Baal commenced the ceremony by calling on their god. In vain did they continue invoking their senseless deity from morning till noon, and from noon till evening, uttering the most piercing cries, using the most frantic gesticulations, and mingling their blood with the sacrifice. No response was heard. No fire descended. Elijah exposed their folly and imposture with the severest irony and, as the day was far advanced, commenced his operations. Inviting the people to approach and see the entire proceeding, he first repaired an old altar of God, which Jezebel had demolished. Then, having arranged the cut pieces of the bullock, he caused four barrels or jars of water to be dashed all over the altar and round in the trench. Once, twice, a third time this precaution was taken, and then, when he had offered an earnest prayer, the miraculous fire descended (Le 9:24; Jud 6:21; 13:20; 1Ch 21:26; 2Ch 7:1), and consumed not only the sacrifice, but the very stones of the altar. The impression on the minds of the people was that of admiration mingled with awe; and with one voice they acknowledged the supremacy of Jehovah as the true God. Taking advantage of their excited feelings, Elijah called on them to seize the priestly impostors, and by their blood fill the channel of the river (Kishon), which, in consequence of their idolatries, the drought had dried up—a direction, which, severe and relentless as it seems, it was his duty as God's minister to give (De 15:5; 18:20). The natural features of the mount exactly correspond with the details of this narrative. The conspicuous summit, 1635 feet above the sea, on which the altars were placed, presents an esplanade spacious enough for the king and the priests of Baal to stand on the one side, and Elijah on the other. It is a rocky soil, on which there is abundance of loose stones, to furnish the twelve stones of which the altar was built—a bed of thick earth, in which a trench could be dug; and yet the earth not so loose that the water poured into it would be absorbed; two hundred fifty feet beneath the altar plateau, there is a perennial fountain, which, being close to the altar of the Lord, might not have been accessible to the people; and whence, therefore, even in that season of severe drought, Elijah could procure those copious supplies of water which he poured over the altar. The distance between this spring and the site of the altar is so short, as to make it perfectly possible to go thrice thither and back again, whereas it would have been impossible once in an afternoon to fetch water from the sea [Van De Velde]. The summit is one thousand feet above the Kishon, which nowhere runs from the sea so close to the base of the mount as just beneath El-Mohhraka; so that the priests of Baal could, in a few minutes, be taken down to the brook (torrent), and slain there.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "They fell on their faces, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " in way of acknowledgment and adoration of the true God. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "He is the God; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " he alone; and Baal is a dull and senseless idol. And they double the words, to note their abundant satisfaction and assurance of the truth of their assertion. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And when all the people saw it, they fell on their faces,.... In reverence of God, astonished at the miracle wrought, ashamed of themselves and their sins, particularly their idolatry, that they should turn their backs on the true God, and follow idols: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and they said, the Lord, he is the God, the Lord, he is the God; which acknowledgment of God, as the true God, in opposition to Baal, is repeated, to show their firm belief and strong assurance of it. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and they said, the Lord, he is the God, the Lord, he is the God; which acknowledgment of God, as the true God, in opposition to Baal, is repeated, to show their firm belief and strong assurance of it. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And when all the people saw it, they fell on their faces: and they said, The LORD, he is the God; the LORD, he is the God.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "39",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And when all the people saw",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "they fell",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The LXX. simply says ‘And all the people fell.’ Josephus describes the reaction thus, ‘They fell upon the ground and worshipped the one God, calling Him most mighty and true, while the others were but names devised by wrong and senseless opinion.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 39.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And when all the people saw it, they fell on their faces",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [As in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 9:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 7:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 22:31",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 5:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Revelation 11:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". They recognized in the fire, that is to say, the token of the Divine Presence]: ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "and they said, The Lord",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Jehovah",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The connexion of this verse with the three verses preceding is obscured by our translation], ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "he is the God; the Lord, he is the God.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [The echo of ver. 24. The Hebrew words are the same. Stanley remarks that it is as if (by a slight inversion) they turned \"the name of the prophet himself into a war-cry, 'Eli-Jah-hu.'\"] 1 Kings 18:39",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Then fire of Jehovah fell and consumed the burnt-offering and the pieces of wood, etc. יהוה אשׁ, the fire proceeding from Jehovah, was not a natural flash of lightning, which could not produce any such effect, but miraculous fire falling from heaven, as in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Chronicles 21:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Chronicles 7:1",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 9:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), the supernatural origin of which was manifested in the fact, that it not only consumed the sacrifice with the pile of wood upon the altar, but also burned up (in calcem redegit - Cler.) the stones of the altar and the earth that was thrown up to form the trench, and licked up the water in the trench. Through this miracle Jehovah not only accredited Elijah as His servant and prophet, but proved Himself to be the living God, whom Israel was to serve; so that all the people who were present fell down upon their faces in worship, as they had done once before, viz., at the consecration of the altar in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Leviticus 9:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and confessed \"Jehovah is God:\" האלהים, the true or real God.",
        "children": []
      }
    ]
  }
]