[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(40) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Slew them.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—This ruthless slaughter of Baal’s prophets, as a judgment on their idolatry and perversion of the people, belongs alike to the fierce righteousness of the character of Elijah, and to the spirit of the old Law. (See, for example, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 13:6-18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 17:2-7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".) The law was adapted (as in the terrible crucial example of the slaughter of the Canaanites) to the “hardness of men’s hearts.” In the imperfect moral and religious education of those times, it did not recognise the difference between moral and political offences punishable by human law, and the religious sin or apostasy which we have been taught to leave to the judgment of God alone; and it enjoined an unrelenting severity in the execution of righteous vengeance, which would be morally impossible to us, who have been taught to hate the sin, and yet spare, as far as possible, the sinner. The frequent quotation of such examples by Christians—of which ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 9:54",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is the first example—is a spiritual anachronism. In this particular case, however, it is also to be remembered that those slain were no doubt implicated in the persecution headed by Jezebel, and that the Baal-worship was a licentious and perhaps bloody system. Elijah, presiding over the slaughter which dyed the waters of the Kishon with blood, felt himself the avenger of the slaughtered prophets, as well as the instrument of the judgment of God.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "1 Kings 18:40",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "1 Kings 18:40",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Elijah said, Take the prophets of Baal ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "— He takes the opportunity of ordering the execution of these idolaters, while the people’s hearts wore warm with the fresh sense of this great miracle. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And they took them — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "For the people, in that fit of zeal wherein they now were, readily obeyed Elijah’s command, and executed the sentence he pronounced. And Ahab could make no opposition, being himself also, it is likely, astonished at the stupendous miracle. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And Elijah brought them down to the brook Kishon — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "That their blood might be poured into that river, and thence conveyed into the sea, and might not defile the holy land. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And slew them there — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Or, ordered them to be slain by the people. As these idolatrous priests were manifestly under a sentence of death, passed upon such by the sovereign Lord of life and death, so Elijah had authority to execute it, being a prophet, and an extraordinary minister of God’s vengeance. The ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "four hundred prophets of the groves, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "it seems, did not attend, and so escaped, which perhaps Ahab rejoiced in: but it proved, they were reserved to be the instruments of his destruction, by encouraging him to go up to Ramoth-Gilead.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "18:21-40 Many of the people wavered in their judgment, and varied in their practice. Elijah called upon them to determine whether Jehovah or Baal was the self-existent, supreme God, the Creator, Governor, and Judge of the world, and to follow him alone. It is dangerous to halt between the service of God and the service of sin, the dominion of Christ and the dominion of our lusts. If Jesus be the only Saviour, let us cleave to him alone for every thing; if the Bible be the world of God, let us reverence and receive the whole of it, and submit our understanding to the Divine teaching it contains. Elijah proposed to bring the matter to a trial. Baal had all the outward advantages, but the event encourages all God's witnesses and advocates never to fear the face of man. The God that answers by fire, let him be God: the atonement was to be made by sacrifice, before the judgment could be removed in mercy. The God therefore that has power to pardon sin, and to signify it by consuming the sin-offering, must needs be the God that can relieve from the calamity. God never required his worshippers to honour him in the manner of the worshippers of Baal; but the service of the devil, though sometimes it pleases and pampers the body, yet, in other things, really is cruel to it, as in envy and drunkenness. God requires that we mortify our lusts and corruptions; but bodily penances and severities are no pleasure to him. Who has required these things at your hands? A few words uttered in assured faith, and with fervent affection for the glory of God, and love to the souls of men, or thirstings after the Lord's image and his favour, form the effectual, fervent prayer of the righteous man, which availeth much. Elijah sought not his own glory, but that of God, for the good of the people. The people are all agreed, convinced, and satisfied; Jehovah, he is the God. Some, we hope, had their hearts turned, but most of them were convinced only, not converted. Blessed are they that have not seen what these saw, yet have believed, and have been wrought upon by it, more than they that saw it.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Elijah required the people to show their conviction by acts - acts which might expose them to the anger of king or queen, but which once committed would cause them to break with Baal and his worshippers forever.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "Elijah is said to have slain the \"prophets of Baal,\" because the people killed them by his orders. Why they were brought down to the torrent-bed of Kishon to be killed, is difficult to explain. Perhaps the object of Elijah was to leave the bodies in a place where they would not be found, since the coming rain would, he knew, send a flood down the Kishon ravine, and bear off the corpses to the sea. Elijah's act is to be justified by the express command of the Law, that idolatrous Israelites were to be put to death, and by the right of a prophet under the theocracy to step in and execute the Law when the king failed in his duty. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "Elijah is said to have slain the \"prophets of Baal,\" because the people killed them by his orders. Why they were brought down to the torrent-bed of Kishon to be killed, is difficult to explain. Perhaps the object of Elijah was to leave the bodies in a place where they would not be found, since the coming rain would, he knew, send a flood down the Kishon ravine, and bear off the corpses to the sea. Elijah's act is to be justified by the express command of the Law, that idolatrous Israelites were to be put to death, and by the right of a prophet under the theocracy to step in and execute the Law when the king failed in his duty. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "21-40. Elijah said unto all the people, How long halt ye?—They had long been attempting to conjoin the service of God with that of Baal. It was an impracticable union and the people were so struck with a sense of their own folly, or dread of the king's displeasure, that they \"answered not a word.\" Elijah proposed to decide for them the controversy between God and Baal by an appeal, not to the authority of the law, for that would have no weight, but by a visible token from Heaven. As fire was the element over which Baal was supposed to preside, Elijah proposed that two bullocks should be slain and placed on separate altars of wood, the one for Baal, and the other for God. On whichever the fire should descend to consume it, the event should determine the true God, whom it was their duty to serve. The proposal, appearing every way reasonable, was received by the people with unanimous approval. The priests of Baal commenced the ceremony by calling on their god. In vain did they continue invoking their senseless deity from morning till noon, and from noon till evening, uttering the most piercing cries, using the most frantic gesticulations, and mingling their blood with the sacrifice. No response was heard. No fire descended. Elijah exposed their folly and imposture with the severest irony and, as the day was far advanced, commenced his operations. Inviting the people to approach and see the entire proceeding, he first repaired an old altar of God, which Jezebel had demolished. Then, having arranged the cut pieces of the bullock, he caused four barrels or jars of water to be dashed all over the altar and round in the trench. Once, twice, a third time this precaution was taken, and then, when he had offered an earnest prayer, the miraculous fire descended (Le 9:24; Jud 6:21; 13:20; 1Ch 21:26; 2Ch 7:1), and consumed not only the sacrifice, but the very stones of the altar. The impression on the minds of the people was that of admiration mingled with awe; and with one voice they acknowledged the supremacy of Jehovah as the true God. Taking advantage of their excited feelings, Elijah called on them to seize the priestly impostors, and by their blood fill the channel of the river (Kishon), which, in consequence of their idolatries, the drought had dried up—a direction, which, severe and relentless as it seems, it was his duty as God's minister to give (De 15:5; 18:20). The natural features of the mount exactly correspond with the details of this narrative. The conspicuous summit, 1635 feet above the sea, on which the altars were placed, presents an esplanade spacious enough for the king and the priests of Baal to stand on the one side, and Elijah on the other. It is a rocky soil, on which there is abundance of loose stones, to furnish the twelve stones of which the altar was built—a bed of thick earth, in which a trench could be dug; and yet the earth not so loose that the water poured into it would be absorbed; two hundred fifty feet beneath the altar plateau, there is a perennial fountain, which, being close to the altar of the Lord, might not have been accessible to the people; and whence, therefore, even in that season of severe drought, Elijah could procure those copious supplies of water which he poured over the altar. The distance between this spring and the site of the altar is so short, as to make it perfectly possible to go thrice thither and back again, whereas it would have been impossible once in an afternoon to fetch water from the sea [Van De Velde]. The summit is one thousand feet above the Kishon, which nowhere runs from the sea so close to the base of the mount as just beneath El-Mohhraka; so that the priests of Baal could, in a few minutes, be taken down to the brook (torrent), and slain there.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Elijah said unto them; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " he takes the opportunity, whilst the people’s hearts were warm with the fresh sense of this great miracle. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Elijah brought them down to the brook Kishon, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " that their blood might be poured into that river, and thence conveyed into the sea, and might not defile the holy land. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Slew them there.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Quest.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " How could Elijah do this, seeing he was but a private person? ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Answ.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " First, he had no doubt the consent of all the heads of the people, who were there assembled; and of the king too, who durst not resist the universal torrent, and could not deny that they were impostors, and worthy of death; and probably was by the prophet assured of rain when this was done. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Answ.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " Secondly, As these idolatrous priests were manifestly under a sentence of death, passed upon such by the sovereign Lord of life and death, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": " Deu 13 Deu 17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; so Elijah had sufficient authority to execute it, as being a prophet, and an extraordinary minister of God’s vengeance against sinners, now especially when the magistrate so grossly neglected his duty therein. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And Elijah said unto them, take the prophets of Baal,.... The four hundred and fifty that were upon the spot; for the number of the people of Israel, now gathered together, were equal to it; nor was it in Ahab's power to hinder it, and he might himself be so far surprised and convicted as not in the least to object to it: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "let not one of them escape: that there might be none of them left to seduce the people any more: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and they took them; laid hold on them, everyone of them: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and Elijah brought them down to the brook Kishon; which ran by the side, and at the bottom of Mount Carmel, into the sea; See Gill on Judges 4:7, Judges 5:21. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and Elijah brought them down to the brook Kishon; which ran by the side, and at the bottom of Mount Carmel, into the sea; See Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 4:7",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ", ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Judges 5:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "and slew them there; intimating, that it was owing to the idolatry they led the people into that rain had been withheld, and the brooks were dried up, as this might be; or, as Ben Gersom thinks, that the land might not be defiled with their blood, but be carried down the river after it: these he slew not with his own hand, but by others he gave orders to do it; and this not as a private person, but as an extraordinary minister of God, to execute justice according to his law, Deuteronomy 13:1 by which law such false prophets were to die; and the rather he was raised up and spirited for this service, as the supreme magistrate was addicted to idolatry himself. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and slew them there; intimating, that it was owing to the idolatry they led the people into that rain had been withheld, and the brooks were dried up, as this might be; or, as Ben Gersom thinks, that the land might not be defiled with their blood, but be carried down the river after it: these he slew not with his own hand, but by others he gave orders to do it; and this not as a private person, but as an extraordinary minister of God, to execute justice according to his law, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Deuteronomy 13:1",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " by which law such false prophets were to die; and the rather he was raised up and spirited for this service, as the supreme magistrate was addicted to idolatry himself. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And Elijah said unto them, Take the prophets of Baal; let not {o} one of them escape. And they took them: and Elijah brought them down to the brook Kishon, and slew them there.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And Elijah said unto them, Take the prophets of Baal; let not ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{o}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " one of them escape. And they took them: and Elijah brought them down to the brook Kishon, and slew them there.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(o) He commanded them that as they were truly persuaded to confess the only God: so they should serve him with all their power, and destroy the idolaters his enemies.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "40",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Take the prophets of Baal",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Elijah avails himself of the newlykindled enthusiasm to put an end, as far as he may, to the false worship. Josephus explains ‘they seized and slew the prophets, Elijah exhorting them so to do.’ Although the text may be taken to signify that Elijah put the priests to death with his own hand, we can hardly suppose this to have been so. He is only said to do himself what he caused others to do.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the brook Kishon",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] This is at the foot of Mount Carmel on the side towards the sea. It was the spot where Sisera was overthrown by Barak (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jdg 4:7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") and the stream then was pictured as sweeping away the dead bodies of those who had been slain by the Israelite forces (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Jdg 5:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 40.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And Elijah said unto them, Take the prophets of Baal; let not one of them escape.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [Elijah's promptitude is extremely striking. The people had hardly recovered from their terror and awe before he proceeds to judgment. The narrative has the air of truth, and was doubtless reduced to writing by an eye-witness.] ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And they took them: and Elijah brought them down",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [Heb. ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "caused them to go down, i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", had them brought down. He could but lead the way, as they numbered 450] ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "to",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "the brook",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Wady",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". \"Like most of the so called ' rivers of Palestine,' the perennial stream forms but a small part of the Kishon\" (Grove)] ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Kishon",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [\"Tortuous,\" now called ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Nahr el Mukatta",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the \"river of slaughter.\" See Thomson, L. and B. 2. pp. 140, 141; Porter, pp. 383-4; Dict. Bib. 2. p. 45. It flows directly under Carmel], ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "and slew them there.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " [Obviously, he merely superintended the slaughter. That he slew them all with his own hand is altogether out of the question. Nor is it clear that\" sword in hand he stood over them\" (Stanley). Josephus rightly explains: \"they slew the prophets at Elijah's instigation.\" It is almost certain, from their resorting to the Kishon for this purpose, that it was not quite dry at the time. Their blood would mingle with its waters, and the flood which the \"great rain\" would presently produce (cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 5:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") would carry their corpses down to the sea. It has often been supposed that the mound near the Kishon, known as ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "Tell el Cassis",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"the mound of the priests,\" derives its name from this slaughter of the prophets of Baal. But Conder (p. 90) remarks that \"Kassis is the word applied to a Christian priest, and the word Kohen or Kamir would more naturally be expected if there was any real connexion with the idolatrous priests of Baal.\"] This action of the prophet Elijah in instituting this wholesale slaughter in the hour of his triumph has been repeatedly arraigned and denounced, but most unjustly. According to some, it was an act of gross fanaticism and cruelty; others have seen it in a wild and terrible ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "vendetta",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " for the murder of the Lord's prophets. By some, indeed, it has been justified on the principles of the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "lex talionis",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 21:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", etc.); on the ground, that is to say, that the men who had instigated Jezebel in her attempted extermination of the prophetic schools had merited extermination in their turn. But ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "it",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " is a fatal objection to their view, first, that we not only have no proof, but no reason for thinking, that it was at their  instigation that the queen \"cut off the prophets of the Lord;\" and, secondly, that it is not clear that she succeeded in her sanguinary purpose, or that many lives were sacrificed to her fury. And Elljah's action needs no such lame apologies. As the Lord's prophet, as the vindicator and restorer of the law, there was no other course open to him. If the Mosaic law was then written, and this very incident is one of the proofs that it was then written; if, however it had fallen into contempt or desuetude, it was still binding upon Israel; and if Elijah was justified in executing its provisions, and was required to execute them, however repugnant they might be to his inclinations (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 27:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Galatians 3:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), then he could not have done otherwise than he did. For it was an essential part of that law, it was an obligation that was laid, not once or twice, but on three separate occasions (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 22:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 17:2-7",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), on the Jewish people, it was a duty they were to perform, however distressing and harrowing it might be (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 13:6-9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), to provide that the worshipper of false gods, and especially the teacher of such worship, should be put to death. It was primarily, of course, the duty of the authorities, of the theocratic king and his subordinates, to execute these injunctions. But the king of that age was corrupt and powerless - nay, was himself idolatrous. So great was the depravity of the time that the false prophet enjoyed the favour and protection of the court, and the true prophet was everywhere being hunted to death. The execution of this law, consequently, could not be expected from the king. It must be executed, if at all, in spite of him, and in disregard of his protests. It was only Elijah, therefore, could put it into force, and Elijah only in the hour of his triumph. And the ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "jus",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "zelotyparum",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the right claimed by every faithful Jew to execute vengeance, after the example of Phinehas (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 25:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), upon any gross breach of the Divine law committed in his presence, was not his only warranty; he held a commission, higher than the king's, as the prophet of the Most High. He had just proved that the Lord He was God. It was now for him to prove that God's law was no dead letter. It was for him to cut off the men - some of them renegades from the faith of Israel, some of them foreign emissaries introduced into the land who had corrupted his countrymen, and threatened the very existence of the true religion. It is necessary, therefore, for those who challenge his conduct in this respect, who call him sanguinary, vindictive, etc., to settle their account with the law which he obeyed, and, indeed, with Him who has approved this deed, and has forewarned us that He too will act in like manner (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 19:27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). For this terrible retribution is by no means an exceptional or isolated act, in contrast to the general spirit of that dispensation; on the contrary, it is in thorough accord with the system out of which it sprung. We gain nothing, therefore, by repudiating this one transaction. For clearly, in the first place, it was allowed and approved of God, who otherwise would hardly have answered the prayer which Elijah presently offered, and (2) other similar acts have distinctly received Divine commendation (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Exodus 32:25-28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Numbers 25:7-13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Kings 1:9",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " sqq.) It is true that the spirit of Elias was not the spirit of Christianity (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 9:56",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), but it is forgotten how different was the dispensation of Elijah from that of the New Covenant. In that age idolaters must receive their just recompense of reward, because the judgment to come had not then been revealed; because justice must be measured out to men in this life. We do not avenge idolatry or irreligion now with fire and sword, not because the thing is any the less sinful, but because the duty has been taken out of our hands; because our religion instructs us to leave it to Him who has said, \"Vengeance is Mine,\" etc. It is perhaps worth remarking here that there is nothing in this history half so dreadful as might be seen on a thousand battlefields - and those not battlefields for truth and right - on which, nevertheless, Elijah's critics have learned to look with complacency. It may, however, be objected to this view that the punishment denounced by the law was stoning (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 13:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 17:5",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). But surely it is easy to see why, in this particular, the law was not kept. It was simply that the exigency of the occasion did not  permit of its being kept. It was because the 450 traitors to God and their country could not be stoned within the few hours that remained before the night closed in and the multitude dispersed, that a more speedy punishment, that of the sword, was adopted. And it would have been a sacrifice of the spirit of the law to the letter had some few false prophets been stoned and the rest thereby been afforded the opportunity to escape, and, under Jezebel's protection, to renew their efforts against truth and morality and religion. 1 Kings 18:40",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Elijah availed himself of this enthusiasm of the people for the Lord, to deal a fatal blow at the prophets of Baal, who turned away the people from the living God. He commanded the people to seize them, and had them slain at the brook Kishon, and that not so much from revenge, i.e., because it was at their instigation that queen Jezebel had murdered the prophets of the true God (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 18:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), as to carry out the fundamental law of the Old Testament kingdom of God, which prohibited idolatry on pain of death, and commanded that false prophets should be destroyed (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 17:2-3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 13:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(Note: It was necessary that idolatry and temptation to the worship of idols should be punished with death, as a practical denial of Jehovah the true God and Lord of His chosen people, if the object of the divine institutions was to be secured. By putting the priests of Baal to death, therefore, Elijah only did what the law required; and inasmuch as the ordinary administrators of justice did not fulfil their obligations, he did this as an extraordinary messenger of God, whom the Lord had accredited as His prophet before all the people by the miraculous answer given to his prayer. - To infer from this act of Elijah the right to institute a bloody persecution of heretics, would not only indicate a complete oversight of the difference between heathen idolaters and Christian heretics, but the same reprehensible confounding of the evangelical standpoint of the New Testament with the legal standpoint of the Old, which Christ condemned in His own disciples in Luke 9:55-56.) ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(Note: It was necessary that idolatry and temptation to the worship of idols should be punished with death, as a practical denial of Jehovah the true God and Lord of His chosen people, if the object of the divine institutions was to be secured. By putting the priests of Baal to death, therefore, Elijah only did what the law required; and inasmuch as the ordinary administrators of justice did not fulfil their obligations, he did this as an extraordinary messenger of God, whom the Lord had accredited as His prophet before all the people by the miraculous answer given to his prayer. - To infer from this act of Elijah the right to institute a bloody persecution of heretics, would not only indicate a complete oversight of the difference between heathen idolaters and Christian heretics, but the same reprehensible confounding of the evangelical standpoint of the New Testament with the legal standpoint of the Old, which Christ condemned in His own disciples in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 9:55-56",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".) ",
            "children": []
          }
        ]
      }
    ]
  }
]