[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1:21-36 The people of Israel were very careless of their duty and interest. Owing to slothfulness and cowardice, they would not be at the pains to complete their conquests. It was also owing to their covetousness: they were willing to let the Canaanites live among them, that they might make advantage of them. They had not the dread and detestation of idolatry they ought to have had. The same unbelief that kept their fathers forty years out of Canaan, kept them now out of the full possession of it. Distrust of the power and promise of God deprived them of advantages, and brought them into troubles. Thus many a believer who begins well is hindered. His graces languish, his lusts revive, Satan plies him with suitable temptations, the world recovers its hold; he brings guilt into his conscience, anguish into his heart, discredit on his character, and reproach on the gospel. Though he may have sharp rebukes, and be so recovered that he does not perish, yet he will have deeply to lament his folly through his remaining days; and upon his dying bed to mourn over the opportunities of glorifying God and serving the church he has lost. We can have no fellowship with the enemies of God within us or around us, but to our hurt; therefore our only wisdom is to maintain unceasing war against them.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Bethel was within the borders of Benjamin, but was captured, as we here learn, by the house of Joseph, who probably retained it. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "24. the spies … said, … Show us, … the entrance into the city—that is, the avenues to the city, and the weakest part of the walls.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "we will show thee mercy—The Israelites might employ these means of getting possession of a place which was divinely appropriated to them: they might promise life and rewards to this man, though he and all the Canaanites were doomed to destruction (Jos 2:12-14); but we may assume the promise was suspended on his embracing the true religion, or quitting the country, as he did. If they had seen him to be firmly opposed to either of these alternatives, they would not have constrained him by promises any more than by threats to betray his countrymen. But if they found him disposed to be serviceable, and to aid the invaders in executing the will of God, they might promise to spare him.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " Together with his estate, as the following verse manifests. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And when he showed them the entrance, into the city,.... Pointing to it with his fingers, as the same writers observe: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "they smote the city with the edge of the sword; they gave notice of what intelligence they had got to the body of the army, who came up, entered the city, took it, and put the inhabitants of it to the sword, as they were ordered to do with all the Canaanites: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "but they let go the man and all his family; who had returned to it, encouraged by the promise made him, and for the sake of saving of his family; which though not expressed, he might have asked the favour of sparing them, which might be promised, as was in the case of Rahab; provided he would either renounce Heathenism, and embrace the true religion, or depart to another country, the latter of which he chose. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "but they let go the man and all his family; who had returned to it, encouraged by the promise made him, and for the sake of saving of his family; which though not expressed, he might have asked the favour of sparing them, which might be promised, as was in the case of Rahab; provided he would either renounce Heathenism, and embrace the true religion, or depart to another country, the latter of which he chose. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And when he showed them the entrance into the city, they smote the city with the edge of the sword; but they let go the man and all his family.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "but they let … go",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] As Rahab and her kindred were spared, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 6:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "Judges 1:25",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And the watchmen (i.e., the spies sent out to explore Bethel) saw a man coming out of the town, and got him to show them the entrance into it, under a promise that they would show him favour, i.e., would spare the lives of himself and his family (see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 2:12-13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "); whereupon they took the town and smote it without quarter, according to the law in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 20:16-17",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", letting none but the man and his family go. By \"the entrance into the city\" we are not to understand the gate of the town, but the way or mode by which they could get into the town, which was no doubt fortified. ",
        "children": []
      }
    ]
  }
]