[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(28) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Did not utterly drive them out.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—This is mentioned by way of blame, as the cause of their future sins and disasters (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Judges 2:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; Josh. 16:16, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 17:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). As to the morality of these exterminating wars, we must bear in mind that men and nations must alike be judged by the moral standard of their own day, not by the advanced morality of later ages. We learn from unanimous testimony that the nations of Canaan had sunk to the lowest and vilest depths of moral degeneracy. When nations have fallen thus low, the cup of their iniquity is full; they are practically irreclaimable. To mingle with them would inevitably be to learn their works, for their worst abominations would find an ally in the natural weakness and corruption of the human heart. The Israelites therefore believed that it was their positive duty to destroy them, and the impulse which led them to do so was one which sprang from their best and not from their worst instincts. It must not be forgotten that the teaching of Christ has absolutely changed the moral conceptions of the world. It intensified, to a degree which we can hardly estimate, our sense of the inalienable rights of humanity and of the individual man. In these days there is scarcely any amount of evidence which would convince us that we were bidden to exterminate a whole population, and involve women and children in one indistinguishable massacre. But neither the Israelites nor any other ancient nations, at this early stage of their moral development, had any conception corresponding to those which would in our minds rightly excite horror, were we to receive a command like that given by Moses, that “thou shalt save nothing alive that breatheth” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 22:16",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), or by Samuel, “Slay both man and woman, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "infant and suckling, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "ox and sheep, camel and ass” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1Samuel 15:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). We should instantly declare it to be ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "impossible ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "that God—as Christ has revealed to us the character of our Father in heaven—should give us commands which would militate against our sense of justice no less than against our sense of compassion. To quote such commands as an excuse for, or an incentive to, such horrible acts of wickedness as the Sack of Beziers, or the Massacre of St. Bartholomew, is ignorantly and recklessly to obliterate the whole results of God’s progressive moral education of our race. It is to ignore the fact that we are living under a wholly different dispensation, and to disavow every blessing which has accrued to humanity from the broadening light and divine revelation of three thousand years. But the ancient Israelites, living as they did in the “days of ignorance” which God “winked at” (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Acts 17:30",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), had never attained to that idea of human individuality—that sense of the independence and infinite worth of each human life—which would have shown them that they knew not what manner of spirit they were of (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Luke 9:56",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). The wild and passionate sense of severe justice, the comparative indifference to human life, the familiarity with pain and death which blunted the keen edge of pity, “the deficient sense of individuality, the exaggerated sense of the solidarity which united a criminal with all his surroundings and possessions,” prevented them from regarding the execution of their ban on guilty nations, cities, or families in any other light than that of the zeal for righteousness by which it was impelled. Their deeds must be estimated by the elements of nobleness which mingled with them, and not indiscriminately condemned by standards of judgment of which neither they nor the age in which they lived had any conception. They firmly believed that in exterminating Canaan they were acting under Divine commands; and there was nothing in such commands which would in that day have shocked the moral sense of the world. “They did not look unnatural to the ancient Jew; they were not foreign to his standard; they excited no surprise or perplexity; they appealed to a genuine but rough idea of justice which existed, when the longing for retribution upon crime in the human mind was not checked by the strict sense of human individuality” (Mozley, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Lectures on the Old Test., ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "p. 103).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Jdg 1:28",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Jdg 1:28",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "When Israel was strong they put the Canaanites to tribute — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Herein they violated the law, whereby they were enjoined to destroy or expel that people when they were able. And as they were strong enough to impose tribute on them, they undoubtedly might have driven them entirely out of the land. But it cost them less trouble, and brought them more profit, to make them tributaries, than to expel them; and therefore they preferred it, being influenced by sloth and covetousness. And this seems to be here spoken of as their common fault at this time.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "1:21-36 The people of Israel were very careless of their duty and interest. Owing to slothfulness and cowardice, they would not be at the pains to complete their conquests. It was also owing to their covetousness: they were willing to let the Canaanites live among them, that they might make advantage of them. They had not the dread and detestation of idolatry they ought to have had. The same unbelief that kept their fathers forty years out of Canaan, kept them now out of the full possession of it. Distrust of the power and promise of God deprived them of advantages, and brought them into troubles. Thus many a believer who begins well is hindered. His graces languish, his lusts revive, Satan plies him with suitable temptations, the world recovers its hold; he brings guilt into his conscience, anguish into his heart, discredit on his character, and reproach on the gospel. Though he may have sharp rebukes, and be so recovered that he does not perish, yet he will have deeply to lament his folly through his remaining days; and upon his dying bed to mourn over the opportunities of glorifying God and serving the church he has lost. We can have no fellowship with the enemies of God within us or around us, but to our hurt; therefore our only wisdom is to maintain unceasing war against them.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "The site of this new Luz is not known, but \"the land of the Hittites\" was apparently in the north of Palestine, on the borders of Syria (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 10:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " note). ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "27-36. The same course of subjugation was carried on in the other tribes to a partial extent, and with varying success. Many of the natives, no doubt, during the progress of this exterminating war, saved themselves by flight and became, it is thought, the first colonists in Greece, Italy, and other countries. But a large portion made a stout resistance and retained possession of their old abodes in Canaan. In other cases, when the natives were vanquished, avarice led the Israelites to spare the idolaters, contrary to the express command of God; and their disobedience to His orders in this matter involved them in many troubles which this book describes.   ",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " No text from Poole on this verse. ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And it came to pass, when Israel was strong,.... All the tribes of Israel were become numerous, and able to drive the Canaanites out of the land everywhere, and particularly were able to assist Manasseh in expelling the Canaanites out of the above places, yet they did not; but all they did was: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "that they put the Canaanites to tribute, and did not utterly drive them out; which flowed from covetousness, and a love of ease; they did not care to be at the trouble of expelling them, as they found it turned more to their account and present advantage to make them tributaries; and this was true of the Israelites in general, and of the half tribe of Manasseh in particular; which, as Abarbinel thinks, is here respected. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "that they put the Canaanites to tribute, and did not utterly drive them out; which flowed from covetousness, and a love of ease; they did not care to be at the trouble of expelling them, as they found it turned more to their account and present advantage to make them tributaries; and this was true of the Israelites in general, and of the half tribe of Manasseh in particular; which, as Abarbinel thinks, is here respected. ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And it came to pass, when Israel was strong, that they put the Canaanites to tribute, and did not utterly drive them out.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "28",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". By the time of Solomon these cities had become Israelite possessions, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 4:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " f.; it was probably David who subdued them, after they had been weakened by the Philistines. The latter were masters of Beth-shean in Saul’s time, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Samuel 31:10",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ff.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "taskwork",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] or ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "forced labour",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The word ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "mas",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " properly denotes a body of men engaged upon forced labour; here it is used of the Canaanites when reduced to subjection, cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Deuteronomy 20:11",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Isaiah 31:8",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". As an institution in Israel, the corvée or labour-gang (employed in the East down to modern times) first appears at the end of David’s reign, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "2 Samuel 20:24",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; it was further organized by Solomon for his public works, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 5:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 9:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 9:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Though Canaanites may have been employed for the fortifying of Megiddo and Gezer (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 9:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), the levying of Israelites for this slavery was deeply resented, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ib.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 12:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 12:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The word does not mean ‘tribute.’",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "did not utterly drive them out",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] Even when subjugated, the Canaanites in many places continued to live among the dominant population, a constant danger, as the subsequent history shews, to Israelite religion and morals. The extermination of the Canaanites was but the theory of later times. Of the cities named, Beth-shean, for instance, harboured an alien population throughout its history; see G. A. Smith, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Hist. Geogr.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", p. 358.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 28.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "Put the Canaanites to tribute",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", or made them tributaries, as in vers. 30, 33, ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i.e.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " imposed forced labour upon them, as the Gibeonites were made hewers of wood and drawers of water (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Joshua 9:21, 27",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; see ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 9:21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Judges 1:28",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "As the Israelites grew strong, they made serfs of the Canaanites (see at ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 49:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). When this took place is not stated; but at all events, it was only done gradually in the course of the epoch of the judges, and not for the first time during the reign of Solomon, as Bertheau supposes on the ground of ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 9:20-22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 4:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", without considering that even in the time of David the Israelites had already attained the highest power they ever possessed, and that there is nothing at variance with this in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 4:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 9:20-22",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". For it by no means follows, from the appointment of a prefect by Solomon over the districts of Taanach, Megiddo, and Bethshean (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "1 Kings 4:12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), that these districts had only been conquered by Solomon a short time before, when we bear in mind that Solomon appointed twelve such prefects over all Israel, to remit in regular order the national payments that were required for the maintenance of the regal court. Nor does it follow, that because Solomon employed the descendants of the Canaanites who were left in the land as tributary labourers in the erection of his great buildings, therefore he was the first who succeeded in compelling those Canaanites who were not exterminated when the land was conquered by Joshua, to pay tribute to the different tribes of Israel. ",
        "children": []
      }
    ]
  }
]