[{"header":"David Becomes King over Judah"},{"num":2,"verse":"Some time later, David inquired of the Lord to ask, “Am I to move to any one of the cities of Judah?”"},{"num":2,"verse":"So David went there, along with his two wives Ahinoam from Jezreel and Abigail, widow of Nabal from Carmel. "},{"num":3,"verse":"David brought his army with him, each soldier accompanied by his household, and they settled in the cities of Hebron. "},{"num":4,"verse":"After this, the army of Judah arrived, and they anointed David king over the house of Judah."},{"num":5,"verse":"So David sent messengers to the people of Jabesh-gilead and told them, “May the Lord bless you, because you showed gracious love like this to your lord Saul by burying him. "},{"num":6,"verse":"Now may the Lord reward you with gracious love, as well as faithfulness, to you, too! And I will also reward you because you did this good thing. "},{"num":7,"verse":"So strengthen yourselves, and be valiant in heart, because your lord Saul has died, and the household of Judah has anointed me to be king over them.”"},{"header":"Abner’s Rebellion and the Battle at Gibeon"},{"num":8,"verse":"Meanwhile, Ner’s son Abner, the commander of Saul’s army, had taken Saul’s son Ish-bosheth and brought him to Mahanaim. "},{"num":9,"verse":"He installed him as king over Gilead, the Ashurites, Jezreel, Ephraim, Benjamin, and all of the rest of Israel. "},{"num":10,"verse":"Ish-bosheth began to reign over Israel at the age of 40 years, and he reigned for two years, even though Judah’s lineage followed David. "},{"num":11,"verse":"The period of David’s kingship in Hebron lasted seven years and six months."},{"num":12,"verse":"Ner’s son Abner and the servants of Saul’s son Ish-bosheth set out from Mahanaim for Gibeon. "},{"num":13,"verse":"Zeruiah’s son Joab and some of David’s staff went out to meet them at the pool of Gibeon. One side encamped on one side of the pool while the other encamped on the other side of the pool."},{"num":14,"verse":"Abner told Joab, “Let’s have the young men get up and fight in our presence.”"},{"num":15,"verse":"So they got up and twelve were counted to represent Benjamin and Saul’s son Ish-bosheth and twelve to represent members of David’s staff. "},{"num":16,"verse":"Each man grabbed his opponent by the head, plunged his sword into his opponent’s side, and then they both fell together. That’s why the place at Gibeon was named The Field of Swords. "},{"num":17,"verse":"The battle was very violent that day, with Abner and the men of Israel being defeated in the presence of David’s servants."},{"header":"Abner Kills Joab’s Brother Asahel"},{"num":18,"verse":"Zeruiah’s three sons Joab, Abishai, and Asahel were there. As a runner, Asahel was fast, like one of the wild gazelles. "},{"num":19,"verse":"So Asahel ran straight after Abner, following him. "},{"num":20,"verse":"When Abner looked behind him, he said, “Is that you, Asahel?”"},{"num":21,"verse":"Abner told him, “Go off to your right or left after one of the young men and grab some war spoils.” But Asahel would not stop following him, "},{"num":22,"verse":"so Abner told Asahel again, “Stop following me. Why should I strike you down? How could I show my face to your brother Joab?”"},{"num":23,"verse":"But Asahel refused to turn away, so Abner struck Asahel in the abdomen with the butt end of his spear, and the spear protruded through his back. He collapsed to the ground and died where he fell. Everyone gathered round the place where Asahel had collapsed and died, and stood still there."},{"num":24,"verse":"Meanwhile, Joab and Abishai continued to chase Abner. At dusk, as they approached the hill of Ammah that is located near Giah on the way to the Gibeon desert, "},{"num":25,"verse":"the descendants of Benjamin rallied around Abner, forming a single military force. They took their stand on top of the hill."},{"num":26,"verse":"Then Abner called out to Joab, “Must the battle sword keep on devouring forever? Don’t you realize that the end result is bitterness? How long will it take for you to order your army to stop pursuing their own relatives?”"},{"num":27,"verse":"Joab answered, “As God lives, if you hadn’t spoken up, by morning my army would have broken off their pursuit of their own relatives.” "},{"num":28,"verse":"So Joab sounded his battle trumpet, his entire army stopped pursuing Israel any longer, and they quit fighting."},{"num":29,"verse":"Abner and his army traveled through the Arabah by night, crossed the Jordan, and arrived at Mahanaim after marching all morning. "},{"num":30,"verse":"Joab returned from his pursuit of Abner, and when he had mustered his entire army, nineteen of David’s soldiers were missing besides Asahel. "},{"num":31,"verse":"Meanwhile, other soldiers of David had killed 360 of Abner’s men from the tribe of Benjamin. "},{"num":32,"verse":"They retrieved Asahel’s body and buried him in his father’s tomb at Bethlehem. Then Joab and his men marched all night until daybreak and arrived back in Hebron."}]