[{"header":"David Is Anointed to Be King Over Judah"},{"num":2,"verse":"After Saul and Jonathan died, David asked the Lord for advice. “Should I go up to one of the towns of Judah?” he asked."},{"num":2,"verse":"So David went up there with his two wives. Their names were Ahinoam from Jezreel and Abigail from Carmel. Abigail was Nabal’s widow. "},{"num":3,"verse":"David also took his men and their families with him. They made their homes in Hebron and its towns. "},{"num":4,"verse":"Then the men of Judah came to Hebron. There they anointed David to be king over the people of Judah."},{"num":5,"verse":"So he sent messengers to them to speak for him. The messengers said, “You were kind to bury the body of your master Saul. May the Lord bless you for that. "},{"num":6,"verse":"And may he now be kind and faithful to you. David will treat you well for being kind to Saul’s body. "},{"num":7,"verse":"Now then, be strong and brave. Your master Saul is dead. And the people of Judah have anointed David to be king over them.”"},{"header":"The Armies of David and Saul Fight Each Other"},{"num":8,"verse":"Abner, the son of Ner, was commander of Saul’s army. Abner had brought Saul’s son Ish-Bosheth to Mahanaim. "},{"num":9,"verse":"There Abner made Ish-Bosheth king over Gilead, Ashuri and Jezreel. He also made him king over Ephraim, Benjamin and other areas of Israel."},{"num":10,"verse":"Ish-Bosheth was 40 years old when he became king over Israel. He ruled for two years. But the people of Judah remained faithful to David. "},{"num":11,"verse":"David was king in Hebron over the people of Judah for seven and a half years."},{"num":12,"verse":"Abner, the son of Ner, left Mahanaim and went to Gibeon. The men of Ish-Bosheth, the son of Saul, went with him. "},{"num":13,"verse":"Joab, the son of Zeruiah, and David’s men also went out. All of them met at the pool in Gibeon. One group sat down on one side of the pool. The other group sat on the other side."},{"num":14,"verse":"Then Abner said to Joab, “Let’s have some of the young men get up and fight. Let’s tell them to fight hand to hand in front of us.”"},{"num":15,"verse":"So the young men stood up and were counted off. There were 12 on the side of Benjamin and Saul’s son Ish-Bosheth. And there were 12 on David’s side. "},{"num":16,"verse":"Each man grabbed one of his enemies by the head. Each one stuck his dagger into the other man’s side. And all of them fell down together and died. So that place in Gibeon was named Helkath Hazzurim."},{"num":17,"verse":"The fighting that day was very heavy. Abner and the Israelites lost the battle to David’s men."},{"num":18,"verse":"The three sons of Zeruiah were there. Their names were Joab, Abishai and Asahel. Asahel was as quick on his feet as a wild antelope. "},{"num":19,"verse":"He chased Abner. He didn’t turn to the right or the left as he chased him. "},{"num":20,"verse":"Abner looked behind him. He asked, “Asahel, is that you?”"},{"num":21,"verse":"Then Abner said to him, “Turn to the right or the left. Fight one of the young men. Take his weapons away from him.” But Asahel wouldn’t stop chasing him."},{"num":22,"verse":"Again Abner warned Asahel, “Stop chasing me! If you don’t, I’ll strike you down. Then how could I look your brother Joab in the face?”"},{"num":23,"verse":"But Asahel refused to give up the chase. So Abner drove the dull end of his spear into Asahel’s stomach. The spear came out through his back. He fell and died right there on the spot. Every man stopped when he came to the place where Asahel had fallen and died."},{"num":24,"verse":"But Joab and Abishai chased Abner. As the sun was going down, they came to the hill of Ammah. It was near Giah on the way to the dry and empty land close to Gibeon. "},{"num":25,"verse":"The men of Benjamin gathered in a group around Abner. They took their stand on top of a hill."},{"num":26,"verse":"Abner called out to Joab, “Do you want our swords to keep on killing us off? Don’t you know that all this fighting will end in bitter feelings? How long will it be before you order your men to stop chasing their fellow Israelites?”"},{"num":27,"verse":"Joab answered, “It’s a good thing you spoke up. If you hadn’t, the men would have kept on chasing them until morning. And that’s just as sure as God is alive.”"},{"num":28,"verse":"So Joab blew a trumpet. All the troops stopped. They didn’t chase Israel anymore. They didn’t fight anymore either."},{"num":29,"verse":"All that night Abner and his men marched through the Arabah Valley. They went across the Jordan River. All morning long they kept on going. Finally, they came to Mahanaim."},{"num":30,"verse":"Then Joab stopped chasing Abner. He gathered together the whole army. Besides Asahel, only 19 of David’s men were missing. "},{"num":31,"verse":"But David’s men had killed 360 men from Benjamin who were with Abner. "},{"num":32,"verse":"They got Asahel’s body and buried it in his father’s tomb at Bethlehem. Then Joab and his men marched all night. They arrived at Hebron at sunrise."}]