[{"num":2,"verse":"And it came to pass after this, that Dovid inquired of Hashem, saying, Shall I go up into any of the towns of Yehudah? And Hashem said unto him, Go up. And Dovid said, To where shall I go up? And he said, Unto Chevron."},{"num":2,"verse":"So Dovid went up there, and his two nashim also, Achinoam the Yizre’elit, and Avigal eshet Nabal the Carmeli."},{"num":3,"verse":"And his anashim that were with him did Dovid bring up, every ish with his household; and they dwelt in the towns of Chevron."},{"num":4,"verse":"And anshei Yehudah came, and there they anointed Dovid Melech over Bais Yehudah. And they told Dovid, saying, The Anshei Yavesh-Gilead were they that buried Sha’ul."},{"num":5,"verse":"And Dovid sent malachim unto the Anshei Yavesh-Gilead, and said unto them, Berukhim atem of Hashem, that ye have showed this chesed unto adoneichem, even unto Sha’ul, burying him."},{"num":6,"verse":"And now Hashem show chesed and emes unto you; and I also will repay you this tovah, because ye have done this thing."},{"num":7,"verse":"Therefore now let your hands be strengthened, be ye bnei chayil; for adoneichem Sha’ul is dead, and also the Bais Yehudah have anointed me Melech over them."},{"num":8,"verse":"But Avner ben Ner, Sar Tzava of Sha’ul, took Ishboshet Ben Sha’ul, and brought him over to Machanayim;"},{"num":9,"verse":"And made him melech over Gil‘ad, and over the Ashuri, and over Yizre’el, and over Ephrayim, and over Binyamin, and over all Yisroel."},{"num":10,"verse":"Ishboshet ben Sha’ul was forty shanah when he began to reign over Yisroel, and reigned two shanim. But Bais Yehudah followed Dovid."},{"num":11,"verse":"And the time that Dovid was Melech in Chevron over Bais Yehudah was shivah shanah and shishah chodashim."},{"num":12,"verse":"And Avner ben Ner, and the avadim of Ishboshet Ben Sha’ul, went out from Machanayim to Giveon."},{"num":13,"verse":"And Yoav Ben Tzeruyah, and the avadim of Dovid, went out, and met together by the pool of Giveon; and they sat down, the one on the one side of the pool, and the other on the other side of the pool."},{"num":14,"verse":"And Avner said to Yoav, Let the young men now arise for a contest before us. And Yoav said, Let them arise."},{"num":15,"verse":"Then there arose and went over by mispar twelve of Binyamin, which pertained to Ishboshet ben Sha’ul, and twelve of the avadim of Dovid."},{"num":16,"verse":"And they caught every one his re’a by the rosh, and thrust his cherev in his re’a’s side; so they fell down together; therefore that makom was called Chelkat-Hatzurim, which is in Giveon."},{"num":17,"verse":"And there was a very fierce milchamah that day; and Avner was defeated, and the Anshei Yisroel, before the Avadim of Dovid."},{"num":18,"verse":"And there were three Bnei Tzeruyah there: Yoav, Avishai, Asahel; Asahel was as swift of foot as a gazelle."},{"num":19,"verse":"Asahel pursued after Avner; and in going he turned not to the right nor to the left from following Avner."},{"num":20,"verse":"Then Avner looked behind him, and said, Art thou Asahel? And he answered, I am."},{"num":21,"verse":"And Avner said to him, Turn thee aside to thy right or to thy left, and lay thee hold on one of the ne’arim, and capture thee his armor. But Asahel would not turn aside from following of him."},{"num":22,"verse":"And Avner said again to Asahel, Turn thee aside from following me; why should I strike thee to the ground? How then should I hold up my face to Yoav achicha?"},{"num":23,"verse":"Howbeit he refused to turn aside; therefore Avner with the butt end of the khanit struck him under the fifth rib, that the khanit came out his back; and he fell down there, and died in the same place; and it came to pass, that as many as came to the makom where Asahel fell down and died, stopped."},{"num":24,"verse":"Yoav also and Avishai pursued after Avner; and the shemesh went down when they were come to the hill of Ammah, that lieth before Giach by the derech midbar Giveon."},{"num":25,"verse":"And the Bnei Binyamin gathered themselves together after Avner, and became aguddah echat (one unit), and stood on the top of one hill."},{"num":26,"verse":"Then Avner called to Yoav, and said, Shall the cherev devour lanetzach (forever)? Knowest thou not that it will be marah in the latter end? Ad mosai shall it be then, until thou bid the people return from pursuing their brethren?"},{"num":27,"verse":"And Yoav said, As HaElohim liveth, if thou hadst not spoken, HaAm would have continued every one following his brother, not stopping until haboker."},{"num":28,"verse":"So Yoav blew a shofar, and kol haAm stood still, and pursued after Yisroel no more, neither fought they any more."},{"num":29,"verse":"And Avner and his anashim marched kol halailah through the Aravah, and passed over Yarden, and went through all Bitron, and they came to Machanayim."},{"num":30,"verse":"And Yoav returned from following Avner; and when he had gathered kol HaAm together, there lacked of Dovid’s avadim nineteen ish and Asahel."},{"num":31,"verse":"But the avadim of Dovid had struck down of Binyamin, and of anshei Avner, so that three hundred and threescore ish died."},{"num":32,"verse":"And they took up Asahel, and buried him in the kever of aviv, which was in Beit-Lechem. And Yoav and his men marched kol halailah, and they came to Chevron at dawn."}]