[{"header":"The Lampstand"},{"num":8,"verse":"The Lord said to Moses,"},{"num":2,"verse":"“Tell Aaron to put the seven lamps in the place I showed you. These lamps will light the area in front of the lampstand.”"},{"num":3,"verse":"Aaron did this. He put the lamps in the right place so that they lighted the area in front of the lampstand. He obeyed the command that the Lord gave Moses."},{"num":4,"verse":"This is how the lampstand was made: It was made from hammered gold, all the way from the gold base at the bottom to the gold flowers at the top. It looked just like the pattern that the Lord had shown to Moses."},{"header":"Dedicating the Levites"},{"num":5,"verse":"The Lord said to Moses,"},{"num":6,"verse":"“Separate the Levites from the other Israelites. Make these Levites clean."},{"num":7,"verse":"This is what you should do to make them clean: Sprinkle the special water from the sin offering on them. This water will make them clean. Then they must shave their bodies and wash their clothes. This will make their bodies clean."},{"num":8,"verse":"“They must take a young bull and the grain offering that must be offered with it. This grain offering will be flour mixed with oil. Then take another young bull for a sin offering."},{"num":9,"verse":"Bring the Levites to the area in front of the Meeting Tent. Then bring all the Israelites together at that place."},{"num":10,"verse":"Bring the Levites before the Lord. The Israelites will put their hands on them."},{"num":11,"verse":"Aaron will give the Levites to the Lord as an offering from the Israelites. Then the Levites will be ready to do their special work for the Lord."},{"num":12,"verse":"“Tell the Levites to put their hands on the heads of the bulls. One bull will be a sin offering and the other bull will be used as a burnt offering to the Lord. These offerings will make the Levites pure."},{"num":13,"verse":"Tell the Levites to stand in front of Aaron and his sons. Then give the Levites to the Lord. They will be like an offering."},{"num":14,"verse":"This will make the Levites holy. They will be different from the other Israelites. The Levites will belong to me."},{"num":15,"verse":"“So make the Levites pure and give them to the Lord as a special offering. After you do this, they can come and do their work at the Meeting Tent."},{"num":16,"verse":"The Israelites will give me the Levites. They will belong to me. In the past I told every Israelite family to give me their firstborn son. But now I am taking the Levites in place of these firstborn sons from the other families in Israel."},{"num":17,"verse":"Every firstborn in Israel—man or animal—is mine, because I killed all the firstborn children and animals in Egypt. And I chose to take the firstborn sons to belong to me."},{"num":18,"verse":"But now I will take the Levites in their place. I will take the Levites in place of all the firstborn sons from the other families in Israel."},{"num":19,"verse":"I chose the Levites from among all the Israelites. And I give them as gifts to Aaron and his sons. I want them to do the work at the Meeting Tent. They will serve for all the Israelites. They will help make the sacrifices that make the Israelites pure. Then no great sickness or trouble will come to the Israelites when they come near the holy place.”"},{"num":20,"verse":"So Moses, Aaron, and all the Israelites obeyed the Lord. They did with the Levites everything that the Lord commanded Moses."},{"num":21,"verse":"The Levites washed themselves and their clothes. Then Aaron gave them to the Lord as special offerings. Aaron gave the offerings that covered their sins and made them pure."},{"num":22,"verse":"After that the Levites came to the Meeting Tent to do their work. Aaron and his sons watched them. They were responsible for the work of the Levites. Aaron and his sons did what the Lord commanded Moses."},{"num":23,"verse":"Then the Lord said to Moses,"},{"num":24,"verse":"“This is a special command for the Levites: Every Levite man who is 25 years old or older must come and share in the work at the Meeting Tent."},{"num":25,"verse":"But when a man is 50 years old, he will retire from this hard work."},{"num":26,"verse":"Men who are at least 50 years old will be on duty to help their brothers, but they will not do the work themselves. That is what you must do for the Levites so that they can do their duty.”"}]