[{"header":"Psalm 145"},{"num":1,"verse":"I will extol You, my God, O King; and I will bless Your name forever and ever [with grateful, affectionate praise]."},{"num":2,"verse":"Every day [with its new reasons] will I bless You [affectionately and gratefully praise You]; yes, I will praise Your name forever and ever."},{"num":3,"verse":"Great is the Lord and highly to be praised; and His greatness is [so vast and deep as to be] unsearchable."},{"num":4,"verse":"One generation shall laud Your works to another and shall declare Your mighty acts."},{"num":5,"verse":"On the glorious splendor of Your majesty and on Your wondrous works I will meditate."},{"num":6,"verse":"Men shall speak of the might of Your tremendous and terrible acts, and I will declare Your greatness."},{"num":7,"verse":"They shall pour forth [like a fountain] the fame of Your great and abundant goodness and shall sing aloud of Your rightness and justice."},{"num":8,"verse":"The Lord is gracious and full of compassion, slow to anger and abounding in mercy and loving-kindness."},{"num":9,"verse":"The Lord is good to all, and His tender mercies are over all His works [the entirety of things created]."},{"num":10,"verse":"All Your works shall praise You, O Lord, and Your loving ones shall bless You [affectionately and gratefully shall Your saints confess and praise You]!"},{"num":11,"verse":"They shall speak of the glory of Your kingdom and talk of Your power,"},{"num":12,"verse":"To make known to the sons of men God’s mighty deeds and the glorious majesty of His kingdom."},{"num":13,"verse":"Your kingdom is an everlasting kingdom, and Your dominion endures throughout all generations."},{"num":14,"verse":"The Lord upholds all those [of His own] who are falling and raises up all those who are bowed down."},{"num":15,"verse":"The eyes of all wait for You [looking, watching, and expecting] and You give them their food in due season."},{"num":16,"verse":"You open Your hand and satisfy every living thing with favor."},{"num":17,"verse":"The Lord is [rigidly] righteous in all His ways and gracious and merciful in all His works."},{"num":18,"verse":"The Lord is near to all who call upon Him, to all who call upon Him sincerely and in truth."},{"num":19,"verse":"He will fulfill the desires of those who reverently and worshipfully fear Him; He also will hear their cry and will save them."},{"num":20,"verse":"The Lord preserves all those who love Him, but all the wicked will He destroy."},{"num":21,"verse":"My mouth shall speak the praise of the Lord; and let all flesh bless (affectionately and gratefully praise) His holy name forever and ever."}]