[{"num":2,"verse":"And you being dead in your peysha’im and chatta’im,"},{"num":2,"verse":"In which you amol (formerly) fier zich (comported oneself), according to the course of the Olam Hazeh, according to the Sar of the authority of the air [the Samekh Mem, Hasatan, teivel, the devil], the ruach now working in the bnei haMeri (sons of Rebellion)."},{"num":3,"verse":"Among them we too all formerly conducted ourselves in the ta’avot of our basar, following the lusts of the flesh and of the machshavot (thoughts), and we were by nature Bnei Rogez (Sons of Anger) of Hashem, as also the rest."},{"num":4,"verse":"But Hashem, being rich in rachamim (mercy), because of His ahavah harabba (great love) with which He loved us,"},{"num":5,"verse":"Even when we were dead in our peysha’im, He made us alive together with Rebbe, Melech HaMoshiach (by the unmerited Chen v’Chesed Hashem you have been delivered in your personal Geulah and the Yeshu’at Eloheinu), [TEHILLIM 103:12]"},{"num":6,"verse":"And raised us up with Moshiach and seated us with Him in Shomayim in Rebbe, Melech HaMoshiach Yehoshua,"},{"num":7,"verse":"In order that, in the Olam HaBah, He might display the surpassing osher of the Chen v’Chesed Hashem of Him in chesed toward us in Rebbe, Melech HaMoshiach Yehoshua."},{"num":8,"verse":"For by unmerited Chen v’Chesed Hashem you have been delivered from Hashem’s Mishpat (Judgment) and granted a share in the Geulah (Redemption), through emunah; and this is not [an einfal (intuitive idea)] of yourselves, it is a matnat Hashem (gift of G-d);"},{"num":9,"verse":"Not the result [of the zchus (merit)] of doing ma’asim (works) [Ac 15:1; Ga 5:3 4], so that before Hashem no man should be a ravrevan (boaster, braggart). [DEVARIM 9:5]"},{"num":10,"verse":"For we are His masterpiece, having been created in Moshiach Yehoshua for ma’asim tovim, which Hashem prepared beforehand, that the derech of our halakhah should be in them.[YESHAYAH 29:23; 42:7; 60:21;]"},{"num":11,"verse":"Therefore, have zikaron (remembrance) that formerly you, the Goyim in the flesh, who are called \"arelim\" (uncircumcised ones) by the ones being called \"nimolim\" (circumcised ones) which is a Bris Milah performed in the flesh by human hands"},{"num":12,"verse":"Have zikaron (remembrance) that you were at that time bazunder (unrelated and separate) from Rebbe, Melech HaMoshiach, having been alienated from the torat haEzrakhut (the citizenship) in the Am Brit, from Yisroel, being zarim (strangers) to the Beritot HaHavtacha, farloiren (lost) and having no tikvah (hope) and without G-d in the Olam Hazeh. [YESHAYAH 14:1; 65:1]"},{"num":13,"verse":"But now in Rebbe, Melech HaMoshiach Yehoshua, you, who formerly where in the outermost courts, have been brought near by the kapporah of the dahm of Moshiach."},{"num":14,"verse":"For Moshiach himself is our shalom, who made the Shneym into Echad, having broken down in the basar of Moshiach the barrier of the Mechitzah (the dividing partition), the Soreg (barrier of the holy precinct in the Beis HaMikdash between Jews and non-Jews), the Eyvah (Enmity),"},{"num":15,"verse":"By annulling the chok (decree, law) of mishpatim in ordinances that the Shnaym He might create in Himself into Adam Chadash Echad (One New Humanity), arbitrating shalom,"},{"num":16,"verse":"And that Moshiach might bring the ritztzuy (reconciliation, cessation of enmity), reconciling to Hashem the Shnaym into one guf (body) [BERESHIS 47:18; TEHILLIM 16:9-10; IYOV 19:25-27; YESHAYAH 53:11] through the Moshiach’s Etz, having put to death the Eyvah by it."},{"num":17,"verse":"And having come, Moshiach preached shalom to you, the ones in the outermost courts, and shalom to the ones near; [TEHILLIM 148:14; YESHAYAH 57:19]"},{"num":18,"verse":"Because through Moshiach we both have HaSha’ar laHashem (gate to approach G-d’s presence, access of the tzaddikim TEHILLIM 118:20) by one Ruach Hakodesh to Elohim HaAv."},{"num":19,"verse":"Therefore, then, no longer are you zarim and aliens, but you are fellow citizens of the Kadoshim and bnei bayit members of the household of G-d,"},{"num":20,"verse":"Having been built upon the yesod (foundation) of the Shlichim and Nevi’im, Moshiach Yehoshua himself being the ROSH PINAH (TEHILLIM 118:22),"},{"num":21,"verse":"In whom all the binyan (edifice), being fitly joined together, grows into a Heikhal Kadosh b’Hashem;"},{"num":22,"verse":"In whom also you are being built together into a Mishkan of Hashem in the Ruach Hakodesh. [T.N. In this chapter Rav Sha’ul uses the courts of the Beis Hamikdash to teach the saving work of Moshiach.]"}]