[{"num":2,"verse":"And you were dead in trespasses and sins"},{"num":2,"verse":"(wherein you once walked according to the course of this world, according to the authority of the ruler of the air, even the spirit who now works in the sons of disobedience,"},{"num":3,"verse":"among whom all of us also once lived in the lusts of our flesh, in fulfilling the will of the flesh, and of the mind; and were, by nature, the children of wrath, just as the rest)."},{"num":4,"verse":"But God, Who is rich in mercy, through His great love with which He loved us,"},{"num":5,"verse":"even when we were dead by sins, has quickened us together in Christ (by grace you are saved)"},{"num":6,"verse":"and has raised us up together and made us sit together in the Heavenly places in Christ Jesus;"},{"num":7,"verse":"so that He might show, in the ages to come, the exceeding riches of His grace through His kindness toward us in Christ Jesus."},{"num":8,"verse":"For by grace are you saved, through faith, and that not of yourselves. It is the gift from God"},{"num":9,"verse":"(not of works, lest anyone should boast)."},{"num":10,"verse":"For we are His workmanship, created in Christ Jesus for good works; which God has ordained, so that we would walk in them."},{"num":11,"verse":"Therefore, remember that you, being formerly Gentiles in the flesh (the ones called “uncircumcision” by those called “circumcision” in the flesh, made with hands),"},{"num":12,"verse":"that you were, at that time, without Christ; and were aliens from the commonwealth of Israel; and were strangers to the covenants of the promise; and had no hope; and were without God in the world."},{"num":13,"verse":"But now, in Christ Jesus, you who were once far off, are made near by the blood of Christ."},{"num":14,"verse":"For He is our peace. He has made of both, one, and has broken the barrier of hostility;"},{"num":15,"verse":"having annulled (through His flesh) the Law of commandments contained in ordinances, in order to make (in Himself) one new man from the two. And so, make peace,"},{"num":16,"verse":"so that He might reconcile both to God in one body by the cross, and thereby slay hostility."},{"num":17,"verse":"And He came and preached peace to you who were afar off, and to those who were near."},{"num":18,"verse":"For through Him we both have access to the Father, by one Spirit."},{"num":19,"verse":"Now therefore, you are no longer strangers and foreigners, but citizens with the saints, and of the household of God;"},{"num":20,"verse":"having been built upon the foundation of the Apostles and Prophets, Jesus Christ Himself being the Chief Cornerstone."},{"num":21,"verse":"In Him, all the building, fitted together, grows into a holy Temple in the Lord."},{"num":22,"verse":"In Him, you also are being built together, to be the habitation of God by the Spirit."}]