[{"header":"The Ruined Waistband"},{"num":13,"verse":"Thus the Lord said to me, “Go and buy yourself a linen waistband and put it on your loins, but do not put it in water.” "},{"num":2,"verse":"So I bought the waistband according to the word of the Lord and put it on my loins. "},{"num":3,"verse":"Then the word of the Lord came to me a second time, saying, "},{"num":4,"verse":"“Get up and take the waistband that you have bought, which is [wrapped] around your loins, and go to the [river] Euphrates and hide it there in a crevice of the rock.” "},{"num":5,"verse":"So I went and hid it by the Euphrates, as the Lord had commanded me. "},{"num":6,"verse":"And after many days the Lord said to me, “Get up, go to the Euphrates and get the waistband which I commanded you to hide there.” "},{"num":7,"verse":"Then I went to the Euphrates and dug, and I took the waistband from the place where I had hidden it. And behold, the waistband was decayed and ruined; it was completely worthless."},{"num":8,"verse":"Then the word of the Lord came to me, saying, "},{"num":9,"verse":"“Thus says the Lord, ‘In this same way I shall destroy the pride of Judah and the great pride of Jerusalem. "},{"num":10,"verse":"These wicked and malevolent people, who refuse to listen to My words, who walk in the stubborn way of their heart and have followed other gods [which are nothing—just man-made carvings] to serve them and to worship them, let them be just like this waistband which is completely worthless. "},{"num":11,"verse":"For as the waistband clings to the body of a man, so I caused the whole house of Israel and the whole house of Judah to cling to Me,’ says the Lord, ‘that they might be for Me a people, a name, a praise, and a glory; but they did not listen and obey.’"},{"header":"Captivity Threatened"},{"num":12,"verse":"“Therefore you are to speak this word to them, ‘Thus says the Lord, the God of Israel, “Every jar should be filled with wine.”’ The people will say to you, ‘Do we not already know that every jar should be filled with wine?’ "},{"num":13,"verse":"Then say to them, ‘Thus says the Lord, “Behold, I am about to fill with drunkenness all the people of this land, even the kings who sit on David’s throne, the priests, the prophets and all the people of Jerusalem. "},{"num":14,"verse":"I will smash them one against another, both the fathers and the sons together,” says the Lord. “I shall destroy them [nothing will restrain Me]; I will not show pity nor be sorry nor have compassion.”’”"}]