[{"header":"Jeremiah’s symbolic acts"},{"num":13,"verse":"The Lord proclaimed to me: Go and buy a linen undergarment. Wear it for a while without washing it."},{"num":2,"verse":"So I bought a linen undergarment, as the Lord told me, and I put it on."},{"num":3,"verse":"The Lord spoke to me again:"},{"num":4,"verse":"Take the undergarment that you are wearing and go at once to the Euphrates and put it under a rock."},{"num":5,"verse":"So I went and buried it at the Euphrates, as the Lord instructed."},{"num":6,"verse":"After a long time, the Lord said to me: Return to the Euphrates and dig up the undergarment that I commanded you to bury there."},{"num":7,"verse":"So I went to the Euphrates and I dug up the linen undergarment from the place I had buried it. But it was ruined and good for nothing."},{"num":8,"verse":"Then the Lord’s word came to me:"},{"num":9,"verse":"The Lord proclaims: In the same way I will ruin the brazen pride of Judah and Jerusalem!"},{"num":10,"verse":"Instead of listening to me, this wicked people follow their own willful hearts and pursue other gods, worshipping and serving them. They will become like this linen garment—good for nothing!"},{"num":11,"verse":"Just as a linen undergarment clings to the body, so I created the people of Israel and Judah to cling to me, declares the Lord, to be my people for my honor, praise, and grandeur. But they wouldn’t obey."},{"num":12,"verse":"So deliver this word to them: The Lord the God of Israel proclaims: Every wine jug should be filled with wine. And they will answer you, “Don’t we already know that? Obviously every wine jug should be filled with wine!”"},{"num":13,"verse":"Then you should say to them: The Lord proclaims: I’m going to fill everyone who lives in this country with wine that makes them drunk, including the kings on David’s throne, the priests, the prophets, and all those living in Jerusalem."},{"num":14,"verse":"And I will shatter every one of them, even parents and children, declares the Lord. I won’t take pity; I won’t have compassion; I will show no mercy when I destroy them."}]