[{"num":13,"verse":"The destruction of the Jews is prefigured. 11 Why Israel was received to be the people of God, and why they were forsaken. 15 He exhorteth them to repentance."},{"num":1,"verse":"Thus saith the Lord unto me, Go, and buy thee a linen girdle, and put it upon thy loins, and put it not in water."},{"num":2,"verse":"So I bought the girdle according to the commandment of the Lord, and put it upon my loins."},{"num":3,"verse":"And the word of the Lord came unto me the second time, saying,"},{"num":4,"verse":"Take the girdle that thou hast bought, which is upon thy loins, and arise, go toward Perath, and hide it there in the cleft of the rock."},{"num":5,"verse":"So I went, and hid it by Perath, as the Lord had commanded me."},{"num":6,"verse":"And after many days the Lord said unto me, Arise, go toward Perath, and take the girdle from thence, which I commanded thee to hide there."},{"num":7,"verse":"Then went I to Perath, and dug, and took the girdle from the place where I had hid it, and behold, the girdle was corrupt, and was profitable for nothing."},{"num":8,"verse":"Then the word of the Lord came unto me, saying,"},{"num":9,"verse":"Thus saith the Lord, After this manner will I destroy the pride of Judah, and the great pride of Jerusalem."},{"num":10,"verse":"This wicked people have refused to hear my word, and walk after the stubbornness of their own heart, and walk after other gods to serve them, and to worship them: therefore they shall be as this girdle, which is profitable to nothing."},{"num":11,"verse":"For as the girdle cleaveth to the loins of a man, so have I tied to me the whole house of Israel, and the whole house of Judah, saith the Lord, that they might be my people: that they might have a name, and praise, and glory, but they would not hear."},{"num":12,"verse":"Therefore thou shalt say unto them this word, Thus saith the Lord God of Israel, Every bottle shall be filled with wine, and they shall say unto thee, do we not know that every bottle shall be filled with wine?"},{"num":13,"verse":"Then shalt thou say unto them, Thus saith the Lord, Behold, I will fill all the inhabitants of this land, even the kings that sit upon the throne of David, and the Priests and the Prophets, and all the inhabitants of Jerusalem with drunkenness."},{"num":14,"verse":"And I will dash them one against another, even the fathers and the sons together, saith the Lord: I will not spare, I will not pity, nor have compassion, but destroy them."},{"num":15,"verse":"Hear and give ear, be not proud: for the Lord hath spoken it."},{"num":16,"verse":"Give glory to the Lord your God before he bring darkness, and or ever your feet stumble in the dark mountains, and while you look for light, he turn it into the shadow of death and make it as darkness."},{"num":17,"verse":"But if ye will not hear this, my soul shall weep in secret for your pride, and mine eye shall weep and drop down tears, because the Lord’s flock is carried away captive."},{"num":18,"verse":"Say unto the King and to the Queen: Humble yourselves, sit down, for the crown of your glory shall come down from your heads."},{"num":19,"verse":"The cities of the South shall be shut up, and no man shall open them: all Judah shall be carried away captive: it shall be wholly carried away captive:"},{"num":20,"verse":"Lift up your eyes, and behold them that come from the North: where is the flock that was given thee, even thy beautiful flock?"},{"num":21,"verse":"What wilt thou say when he shall visit thee? (for thou hast taught them to be captains and as chief over thee) shall not sorrow take thee as a woman in travail?"},{"num":22,"verse":"And if thou say in thine heart, Wherefore come these things upon me? For the multitude of thine iniquities are thy skirts discovered and thy heels made bare."},{"num":23,"verse":"Can the black Moor change his skin? or the leopard his spots, then may ye also do good, that are accustomed to do evil?"},{"num":24,"verse":"Therefore will I scatter them, as the stubble that is taken away with the South wind."},{"num":25,"verse":"This is thy portion, and the part of thy measures from me, saith the Lord, because thou hast forgotten me, and trusted in lies."},{"num":26,"verse":"Therefore I have also discovered thy skirts upon thy face, that thy shame may appear."},{"num":27,"verse":"I have seen thine adulteries, and thy neighings, the filthiness of thy whoredom on the hills in the fields, and thine abominations. [Woe] unto thee, O Jerusalem: wilt thou not be made clean? when shall it once be?"}]