[{"header":"Jeremiah’s Linen Belt"},{"num":13,"verse":"This is what the Lord said to me: “Go and buy a linen belt. Then put it around your waist. Don’t let the belt get wet.”"},{"num":2,"verse":"So I bought a linen belt, just as the Lord told me. And I put it around my waist. "},{"num":3,"verse":"Then the Lord spoke his word to me a second time: "},{"num":4,"verse":"“Take the belt you bought and are wearing. Go to Perath. Hide the belt there in a crack in the rocks.” "},{"num":5,"verse":"So I went to Perath and hid the belt there, just as the Lord told me."},{"num":6,"verse":"Many days later the Lord said to me, “Now go to Perath. Get the belt that I told you to hide there.” "},{"num":7,"verse":"So I went to Perath and dug up the belt. I took it from where I had hidden it. But now it was ruined. It was good for nothing."},{"num":8,"verse":"Then the Lord spoke his word to me. "},{"num":9,"verse":"This is what the Lord said: “In the same way I will ruin the pride of the people of Judah and the great pride of Jerusalem. "},{"num":10,"verse":"These evil people refuse to listen to my warnings. They stubbornly do only what they want to do. They follow other gods to serve and worship them. So they will become like this linen belt. They will be good for nothing. "},{"num":11,"verse":"A belt is wrapped tightly around a man’s waist. In the same way I wrapped the families of Israel and Judah around me,” says the Lord. “I did that so they would be my people. Then they would bring fame, praise and honor to me. But my people would not listen to me."},{"header":"Warnings About Leather Wine Bags"},{"num":12,"verse":"“Say to them: ‘This is what the Lord, the God of Israel, says: All leather bags for holding wine should be filled with wine.’ People will say to you: ‘Of course, we know all wine bags should be filled with wine.’ "},{"num":13,"verse":"Then you will say to them, ‘This is what the Lord says: I will make everyone in this land like a drunken man. I am talking about the kings who sit on David’s throne. I am also talking about the priests and the prophets. I am talking about all the people who live in Jerusalem. "},{"num":14,"verse":"I will make the people of Judah stumble and fall into one another. Fathers and sons will fall into one another, says the Lord. I will not feel sorry or have pity for them. My mercy will not stop me from destroying them!’”"},{"header":"Threat of Slavery"}]