[[],[{"type":"header","content":"People Who Do Only What They Want to Do"}],[{"type":"prose","content":" told me, “Go and buy yourself some linen shorts. Put them on and keep them on. Don’t even take them off to wash them.” So I bought the shorts as  directed and put them on."}],[{"type":"prose","content":"Then  told me, “Take the shorts that you bought and go straight to Perath and hide them there in a crack in the rock.” So I did what  told me and hid them at Perath."}],[{"type":"prose","content":"Next, after quite a long time,  told me, “Go back to Perath and get the linen shorts I told you to hide there.” So I went back to Perath and dug them out of the place where I had hidden them. The shorts by then had rotted and were worthless."}],[{"type":"prose","content":" explained, “This is the way I am going to ruin the pride of Judah and the great pride of Jerusalem—a wicked bunch of people who won’t obey me, who do only what they want to do, who chase after all kinds of no-gods and worship them. They’re going to turn out as rotten as these old shorts. Just as shorts clothe and protect, so I kept the whole family of Israel under my care”—’s Decree—“so that everyone could see they were my people, a people I could show off to the world and be proud of. But they refused to do a thing I said."}],[{"type":"prose","content":"“And then tell them this, ‘’s Message, personal from the God of Israel: Every wine jug should be full of wine.’“And they’ll say, ‘Of course. We know that. Every wine jug should be full of wine!’"}],[{"type":"prose","content":"“Then you’ll say, ‘This is what  says: Watch closely. I’m going to fill every person who lives in this country—the kings who rule from David’s throne, the priests, the prophets, the citizens of Jerusalem—with wine that will make them drunk. And then I’ll smash them, smash the wine-filled jugs—old and young alike. Nothing will stop me. Not an ounce of pity or mercy or compassion will slow me down. Every last drunken jug of them will be smashed!’”"},{"type":"header","content":"The Light You Always Took for Granted"}],[{"type":"poetry","content":"Then I said, Listen. Listen carefully: Don’t stay stuck in your ways!"},{"type":"poetry","content":""},{"type":"poetry","content":"Let your lives glow bright before "},{"type":"poetry","content":""},{"type":"poetry","content":"Before you trip and fall"},{"type":"poetry","content":""},{"type":"poetry","content":"The light you always took for granted will go out"},{"type":"poetry","content":""},{"type":"poetry","content":"If you people won’t listen,"},{"type":"poetry","content":""},{"type":"poetry","content":"Weep because of your stubborn arrogance,"},{"type":"poetry","content":""},{"type":"poetry","content":"Rivers of tears from my eyes,"},{"type":"poetry","content":""},{"type":"prose","content":"* * *"}],[{"type":"poetry","content":"Tell the king and the queen-mother,"},{"type":"poetry","content":""},{"type":"poetry","content":"Your dazzling crowns"},{"type":"poetry","content":""},{"type":"poetry","content":"The villages in the Negev will be surrounded,"},{"type":"poetry","content":""},{"type":"poetry","content":"And Judah dragged off to exile,"},{"type":"poetry","content":""},{"type":"prose","content":"* * *"}],[{"type":"poetry","content":"Look, look, Jerusalem!"},{"type":"poetry","content":""},{"type":"poetry","content":"What will become of your flocks of people,"},{"type":"poetry","content":""},{"type":"poetry","content":"How are you going to feel when the people"},{"type":"poetry","content":""},{"type":"poetry","content":"Now look down on you? You didn’t expect this?"},{"type":"poetry","content":""},{"type":"poetry","content":"Do I hear you saying,"},{"type":"poetry","content":""},{"type":"poetry","content":"The answer’s simple: You’re guilty,"},{"type":"poetry","content":""},{"type":"poetry","content":"Your guilt has your life endangered,"},{"type":"poetry","content":""}]]