[[],[{"type":"header","content":"The Ruined Undergarment"},{"type":"prose","content":"This is what the  said to me: “Go and buy yourself a linen undergarment and put it around your waist, but do not put it in water.”"}],[{"type":"prose","content":"So I bought the undergarment in accordance with the word of the , and put it around my waist."}],[{"type":"prose","content":"Then the word of the  came to me a second time, saying,"}],[{"type":"prose","content":"“Take the undergarment that you bought, which is around your waist, and arise, go to the Euphrates and hide it there in a crevice of the rock.”"}],[{"type":"prose","content":"So I went and hid it by the Euphrates, as the  had commanded me."}],[{"type":"prose","content":"After many days the  said to me, “Arise, go to the Euphrates and take from there the undergarment which I commanded you to hide there.”"}],[{"type":"prose","content":"Then I went to the Euphrates and dug, and I took the undergarment from the place where I had hidden it; and behold, the undergarment was ruined, it was completely useless."}],[{"type":"prose","content":"Then the word of the  came to me, saying,"}],[{"type":"prose","content":"“This is what the  says: ‘To the same extent I will destroy the pride of Judah and the great pride of Jerusalem."}],[{"type":"prose","content":"This wicked people, who refuse to listen to My words, who walk in the stubbornness of their hearts and have followed other gods to serve them and to bow down to them, let them be just like this undergarment which is completely useless."}],[{"type":"prose","content":"For as the undergarment clings to the waist of a man, so I made the entire household of Israel and the entire household of Judah cling to Me,’ declares the , ‘so that they might be My people, for renown, for praise, and for glory; but they did not listen.’"},{"type":"header","content":"Captivity Threatened"}],[{"type":"prose","content":"“Therefore you are to speak this word to them. ‘This is what the , the God of Israel says: “Every jug is to be filled with wine.”’ And  they say to you, ‘Do we not very well know that every jug is to be filled with wine?’"}],[{"type":"prose","content":"then say to them, ‘This is what the  says: “Behold, I am going to fill all the inhabitants of this land—the kings who sit for David on his throne, the priests, the prophets, and all the inhabitants of Jerusalem—with drunkenness!"}],[{"type":"prose","content":"Then I will smash them against each other, both the fathers and the sons together,” declares the . “I will not have compassion nor be troubled nor take pity so as to keep from destroying them.”’”"}],[{"type":"poetry","content":"Listen and pay attention, do not be haughty;"},{"type":"poetry","content":"For the  has spoken."},{"type":"poetry","content":""}],[{"type":"poetry","content":"Give glory to the  your God"},{"type":"poetry","content":"Before He brings darkness"},{"type":"poetry","content":"And before your feet stumble"},{"type":"poetry","content":"On the mountains in the dark,"},{"type":"poetry","content":"And while you are hoping for light"},{"type":"poetry","content":"He makes it into gloom,"},{"type":"poetry","content":" turns  into thick darkness."},{"type":"poetry","content":""}],[{"type":"poetry","content":"But if you do not listen to it,"},{"type":"poetry","content":"My soul will weep in secret for  pride;"},{"type":"poetry","content":"And my eyes will shed"},{"type":"poetry","content":"And stream down tears,"},{"type":"poetry","content":"Because the flock of the  has been taken captive."},{"type":"poetry","content":""}],[{"type":"poetry","content":"Say to the king and the queen mother,"},{"type":"poetry","content":"“Take a lowly seat,"},{"type":"poetry","content":"For your beautiful crown"},{"type":"poetry","content":"Has come down from your head.”"},{"type":"poetry","content":""}],[{"type":"poetry","content":"The cities of the Negev have been locked up,"},{"type":"poetry","content":"And there is no one to open ;"},{"type":"poetry","content":"All Judah has been taken into exile,"},{"type":"poetry","content":"Wholly taken into exile."}]]