[{"num":8,"verse":"On that day King Ahasu-e′rus gave to Queen Esther the house of Haman, the enemy of the Jews. And Mor′decai came before the king, for Esther had told what he was to her; "},{"num":2,"verse":"and the king took off his signet ring, which he had taken from Haman, and gave it to Mor′decai. And Esther set Mor′decai over the house of Haman."},{"header":"Esther Saves the Jews"},{"num":3,"verse":"Then Esther spoke again to the king; she fell at his feet and besought him with tears to avert the evil design of Haman the Ag′agite and the plot which he had devised against the Jews. "},{"num":4,"verse":"And the king held out the golden scepter to Esther, "},{"num":5,"verse":"and Esther rose and stood before the king. And she said, “If it please the king, and if I have found favor in his sight, and if the thing seem right before the king, and I be pleasing in his eyes, let an order be written to revoke the letters devised by Haman the Ag′agite, the son of Hammeda′tha, which he wrote to destroy the Jews who are in all the provinces of the king. "},{"num":6,"verse":"For how can I endure to see the calamity that is coming to my people? Or how can I endure to see the destruction of my kindred?” "},{"num":7,"verse":"Then King Ahasu-e′rus said to Queen Esther and to Mor′decai the Jew, “Behold, I have given Esther the house of Haman, and they have hanged him on the gallows, because he would lay hands on the Jews. "},{"num":8,"verse":"And you may write as you please with regard to the Jews, in the name of the king, and seal it with the king’s ring; for an edict written in the name of the king and sealed with the king’s ring cannot be revoked.”"},{"num":9,"verse":"The king’s secretaries were summoned at that time, in the third month, which is the month of Sivan, on the twenty-third day; and an edict was written according to all that Mor′decai commanded concerning the Jews to the satraps and the governors and the princes of the provinces from India to Ethiopia, a hundred and twenty-seven provinces, to every province in its own script and to every people in its own language, and also to the Jews in their script and their language. "},{"num":10,"verse":"The writing was in the name of King Ahasu-e′rus and sealed with the king’s ring, and letters were sent by mounted couriers riding on swift horses that were used in the king’s service, bred from the royal stud. "},{"num":11,"verse":"By these the king allowed the Jews who were in every city to gather and defend their lives, to destroy, to slay, and to annihilate any armed force of any people or province that might attack them, with their children and women, and to plunder their goods, "},{"num":12,"verse":"upon one day throughout all the provinces of King Ahasu-e′rus, on the thirteenth day of the twelfth month, which is the month of Adar."},{"header":"The Decree of Ahasu-erus"},{"num":16,"verse":"The following is a copy of this letter:"},{"num":14,"verse":"A copy of what was written was to be issued as a decree in every province, and by proclamation to all peoples, and the Jews were to be ready on that day to avenge themselves upon their enemies. So the couriers, mounted on their swift horses that were used in the king’s service, rode out in haste, urged by the king’s command; and the decree was issued in Susa the capital."},{"num":17,"verse":"Then Mor′decai went out from the presence of the king in royal robes of blue and white, with a great golden crown and a mantle of fine linen and purple, while the city of Susa shouted and rejoiced. The Jews had light and gladness and joy and honor. And in every province and in every city, wherever the king’s command and his edict came, there was gladness and joy among the Jews, a feast and a holiday. And many from the peoples of the country declared themselves Jews, for the fear of the Jews had fallen upon them."}]