[{"num":20,"verse":"And Pashur, the son of Immer, the priest, that was ordained prince in the house of the Lord, heard Jeremy prophesying these words. (And Pashur, the son of Immer, the priest, who was ordained the leader, or the chief official, in the House of the Lord, heard Jeremiah prophesying these words.)"},{"num":2,"verse":"And Pashur smote Jeremy, the prophet, and sent him into the stocks, that were in the higher gate of Benjamin, in the house of the Lord. (And Pashur struck the prophet Jeremiah, and then sent him into the stocks, that were at the Upper Gate of Benjamin, in the House of the Lord.)"},{"num":3,"verse":"And when it was clear in the morrow, Pashur led Jeremy out of the stocks. And Jeremy said to him, The Lord called not Pashur thy name, but Dread on each side. (And when the morning came, Pashur led Jeremiah out of the stocks. And Jeremiah said to him, The Lord calleth thy name not Pashur, but Magormissabib, that is, Terror let loose.)"},{"num":4,"verse":"For the Lord saith these things, Lo! I shall give thee and all thy friends into dread, and they shall fall down by the sword of their enemies; and thine eyes shall see; and I shall give all Judah in the hand of the king of Babylon, and he shall lead them over into Babylon, and he shall smite them with sword. (For the Lord saith these things, Lo! I shall give thee and all thy friends unto terror, and they shall fall down by the sword of their enemies; and thy eyes shall see it; and I shall give all Judah into the hands, or into the power, of the king of Babylon, and he shall lead them over to Babylon, and he shall strike them down with the sword.)"},{"num":5,"verse":"And I shall give (them) all the chattel of this city, and all the travail thereof, and all the price; and I shall give all the treasures of the kings of Judah in(to) the hand of their enemies; and they shall ravish them, and shall take, and lead [them] forth into Babylon. (And I shall give all the substance of this city, and all the fruits of its labours, and all its things of value, and all the treasures of the kings of Judah into the hands of their enemies; yea, they shall rob them, and then they shall take these people, and lead them forth to Babylon.)"},{"num":6,"verse":"Forsooth thou, Pashur, and all the dwellers of thine house, shall go into captivity; and thou shalt come into Babylon, and thou shalt die there; and thou shalt be buried there, thou and all thy friends, to which thou prophesiedest leasing. (And thou, Pashur, and all the inhabitants of thy house, shall go into captivity; and thou shalt come into Babylon, and thou shalt die there; and thou shalt be buried there, thou and all thy friends, to whom thou hast prophesied many lies.)"},{"num":7,"verse":"(O) Lord, thou deceivedest me, and I am deceived; thou were stronger than I, and thou haddest the mastery; I am made into scorn all day. All men bemock me,"},{"num":8,"verse":"for now a while ago I spake, crying [out] wickedness, and I cried (out) destroying. And the word of the Lord is made to me into shame, and into scorn all day. (for a while now I have spoken, crying out against wickedness, and against destruction. But the word of the Lord hath only brought me shame, and scorn, each day.)"},{"num":9,"verse":"And I said, I shall not have mind on him, and I shall no more speak in his name. And the word of the Lord was made, as fire swelling in mine heart, and closed in my bones; and I failed, not suffering to bear. (And so I said, I shall not remember him, and I shall no longer speak in the Lord’s name. But the word of the Lord was made to me like a fire swelling in my heart, and enclosed in my bones; and I failed, and could not bear it, and so I had to speak it out.)"},{"num":10,"verse":"For I heard despisings of many men, and dread in compass, (and they said,) Pursue ye, and pursue we him, of all men that were peaceable to me, and keeping my side; if in any manner he be deceived, and we have the mastery against him, and get vengeance of him. (For I heard the despising of many people, and fear was all around, and they said, Pursue ye, yea, let us pursue him, even from all those who were peaceable to me, and on my side; yea, they said, perhaps he can be deceived, and we shall have the mastery over him, and take vengeance upon him.)"},{"num":11,"verse":"Forsooth the Lord as a strong warrior is with me, therefore they that pursue me shall fall, and they shall be feeble; and they shall be shamed greatly (and they shall be greatly shamed), for they understood not (about) everlasting shame, that shall never be done away."},{"num":12,"verse":"And thou, Lord of hosts, the prover of a just man, which seest the reins and [the] heart, I beseech, see I thy vengeance of them; for I have showed my cause to thee. (And thou, Lord of hosts, the prover of the just, who seest the reins and the heart, I beseech thee, let me see thy vengeance upon them; for I have shown my cause to thee./And thou, Lord of hosts, the tester of the righteous, who seest the depths of the heart, I beseech thee, let me see thy vengeance upon them; for I have stated my case to thee.)"},{"num":13,"verse":"Sing ye to the Lord, praise ye the Lord, for he delivered the soul of a poor man from the hand of evil men. (Sing ye to the Lord, praise ye the Lord, for he rescued the souls of the poor from the hands, or the power, of evil people.)"},{"num":14,"verse":"Cursed be the day wherein I was born, the day wherein my mother childed me be not blessed. (Cursed be the day when I was born, may the day when my mother gave birth to me be not blessed.)"},{"num":15,"verse":"Cursed be the man, that told to my father, and said, A knave child is born to thee, and made him glad as with joy. (Cursed be the man, who told my father, and said, A boy child is born to thee, and made him happy with joy.)"},{"num":16,"verse":"That man be as the cities be, which the Lord destroyed, and it repented not him; [Be that man as be the cities, that the Lord turned upside-down, and it repented him not; hear he (the) cry early, and yelling in midday time,] (May that man be like the cities, which the Lord destroyed, and he did not repent for doing that; let him hear the cries of alarm in the morning, and the yelling at midday,)"},{"num":17,"verse":"he that killed not me from the womb, hear cry early, and yelling in the time of midday; that my mother were [made] a sepulchre to me, and her womb were an everlasting conceiving. [that me (he) slew not from the privy womb; that made were to me my mother a sepulchre, and her privy womb conceiving everlasting. (that he did not kill me in the womb; so that my mother was made a tomb for me, and within her womb I was an everlasting conception.)] (because the Lord did not kill me in the womb, so that my mother was made my tomb, and I was an everlasting, or never born, conception, within her womb.)"},{"num":18,"verse":"Why went I out of the womb, that I should see travail and sorrow, and that my days shall be wasted in shame? (O why was I born, so that I could see struggle, or trouble, and sorrow, and that my days would be wasted in shame?)"}]