[{"num":1,"verse":"From: Sha’ul, an emissary — I received my commission not from human beings or through human mediation but through Yeshua the Messiah and God the Father, who raised him from the dead — also from all the brothers with me"},{"num":2,"verse":"To: The Messianic communities in Galatia:"},{"num":3,"verse":"Grace and shalom to you from God our Father and from the Lord Yeshua the Messiah, "},{"num":4,"verse":"who gave himself for our sins, so that he might deliver us from the present evil world-system, in obedience to the will of God, our Father. "},{"num":5,"verse":"To him be the glory forever and ever! Amen."},{"num":6,"verse":"I am astounded that you are so quick to remove yourselves from me, the one who called you by the Messiah’s grace, and turn to some other supposedly “Good News,” "},{"num":7,"verse":"which is not good news at all! What is really happening is that certain people are pestering you and trying to pervert the genuine Good News of the Messiah. "},{"num":8,"verse":"But even if we — or, for that matter, an angel from heaven! — were to announce to you some so-called “Good News” contrary to the Good News we did announce to you, let him be under a curse forever! "},{"num":9,"verse":"We said it before, and I say it again: if anyone announces “Good News” contrary to what you received, let him be under a curse forever!"},{"num":10,"verse":"Now does that sound as if I were trying to win human approval? No! I want God’s approval! Or that I’m trying to cater to people? If I were still doing that, I would not be a servant of the Messiah."},{"num":11,"verse":"Furthermore, let me make clear to you, brothers, that the Good News as I proclaim it is not a human product; "},{"num":12,"verse":"because neither did I receive it from someone else nor was I taught it — it came through a direct revelation from Yeshua the Messiah. "},{"num":13,"verse":"For you have heard about my former way of life in [traditional] Judaism — how I did my best to persecute God’s Messianic Community and destroy it; "},{"num":14,"verse":"and how, since I was more of a zealot for the traditions handed down by my forefathers than most Jews my age, I advanced in [traditional] Judaism more rapidly than they did."},{"num":15,"verse":"But when God, who picked me out before I was born and called me by his grace, chose "},{"num":16,"verse":"to reveal his Son to me, so that I might announce him to the Gentiles, I did not consult anyone; "},{"num":17,"verse":"and I did not go up to Yerushalayim to see those who were emissaries before me. Instead, I immediately went off to Arabia and afterwards returned to Dammesek. "},{"num":18,"verse":"Not until three years later did I go up to Yerushalayim to make Kefa’s acquaintance, and I stayed with him for two weeks, "},{"num":19,"verse":"but I did not see any of the other emissaries except Ya‘akov the Lord’s brother. "},{"num":20,"verse":"(Concerning these matters I am writing you about, I declare before God that I am not lying!) "},{"num":21,"verse":"Next I went to Syria and Cilicia; "},{"num":22,"verse":"but in Y’hudah, the Messianic congregations didn’t even know what I looked like — "},{"num":23,"verse":"they were only hearing the report, “The one who used to persecute us now preaches the Good News of the faith he was formerly out to destroy”; "},{"num":24,"verse":"and they praised God for me."}]