[{"num":1,"verse":"Greetings from Paul, an apostle. I was chosen to be an apostle, but not by any group or person here on earth. My authority came from none other than Jesus Christ and God the Father, who raised Jesus from death."},{"num":2,"verse":"Greetings also from all those in God’s family who are with me."},{"num":3,"verse":"I pray that God our Father and the Lord Jesus Christ will be good to you and give you peace."},{"num":4,"verse":"Jesus gave himself for our sins to free us from this evil world we live in. This is what God our Father wanted."},{"num":5,"verse":"The glory belongs to God forever and ever. Amen."},{"header":"There Is Only One Good News Message"},{"num":6,"verse":"A short time ago God chose you to follow him. He chose you through his grace that came through Christ. But now I am amazed that you are already turning away and believing something different from the Good News we told you."},{"num":7,"verse":"There is no other message that is the Good News, but some people are confusing you. They want to change the Good News about Christ."},{"num":8,"verse":"We told you the true Good News message. So anyone who tells you a different message should be condemned—even if it’s one of us or even an angel from heaven!"},{"num":9,"verse":"I said this before. Now I say it again: You have already accepted the Good News. Anyone who tells you another way to be saved should be condemned!"},{"num":10,"verse":"Now do you think I am trying to make people accept me? No, God is the one I am trying to please. Am I trying to please people? If I wanted to please people, I would not be a servant of Christ."},{"header":"Paul’s Authority Is From God"},{"num":11,"verse":"Brothers and sisters, I want you to know that the Good News message I told you was not made up by anyone."},{"num":12,"verse":"I did not get my message from any other human. The Good News is not something I learned from other people. Jesus Christ himself gave it to me. He showed me the Good News that I should tell people."},{"num":13,"verse":"You have heard about my past life in the Jewish religion. I persecuted the church of God very much. I tried to destroy his people."},{"num":14,"verse":"I was becoming a leader in the Jewish religion. I did better than most other Jews my own age. I tried harder than anyone else to follow the traditions we got from our ancestors."},{"num":15,"verse":"But God had special plans for me even before I was born. So he chose me through his grace."},{"num":16,"verse":"It pleased him to let me see and know his Son so that I could tell the Good News about him to the non-Jewish people. I immediately prepared to do this work without asking for advice or help from anyone."},{"num":17,"verse":"I did not go to Jerusalem to see those who were apostles before I was. But, without waiting, I went away to Arabia. Later, I went back to the city of Damascus."},{"num":18,"verse":"Three years later I went to Jerusalem to meet Peter. I stayed with him 15 days."},{"num":19,"verse":"I met no other apostles—only James, the brother of the Lord."},{"num":20,"verse":"God knows there is nothing untrue in any of this."},{"num":21,"verse":"Later, I went to the areas of Syria and Cilicia."},{"num":22,"verse":"No one in any of Christ’s churches in Judea had ever met me before."},{"num":23,"verse":"They had only heard this about me: “This man was persecuting us. But now he is telling people about the same faith that he once tried to destroy.”"},{"num":24,"verse":"These believers praised God because of me."}]