[{"header":"The Deity of Jesus Christ"},{"num":1,"verse":"In the beginning [before all time] was the Word (Christ), and the Word was with God, and the Word was God Himself. "},{"num":2,"verse":"He was [continually existing] in the beginning [co-eternally] with God. "},{"num":3,"verse":"All things were made and came into existence through Him; and without Him not even one thing was made that has come into being. "},{"num":4,"verse":"In Him was life [and the power to bestow life], and the life was the Light of men. "},{"num":5,"verse":"The Light shines on in the darkness, and the darkness did not understand it or overpower it or appropriate it or absorb it [and is unreceptive to it]."},{"header":"The Witness of John the Baptist"},{"num":6,"verse":"There came a man commissioned and sent from God, whose name was John. "},{"num":7,"verse":"This man came as a witness, to testify about the Light, so that all might believe [in Christ, the Light] through him. "},{"num":8,"verse":"John was not the Light, but came to testify about the Light."},{"num":9,"verse":"There it was—the true Light [the genuine, perfect, steadfast Light] which, coming into the world, enlightens everyone. "},{"num":10,"verse":"He (Christ) was in the world, and though the world was made through Him, the world did not recognize Him. "},{"num":11,"verse":"He came to that which was His own [that which belonged to Him—His world, His creation, His possession], and those who were His own [people—the Jewish nation] did not receive and welcome Him. "},{"num":12,"verse":"But to as many as did receive and welcome Him, He gave the right [the authority, the privilege] to become children of God, that is, to those who believe in (adhere to, trust in, and rely on) His name— "},{"num":13,"verse":"who were born, not of blood [natural conception], nor of the will of the flesh [physical impulse], nor of the will of man [that of a natural father], but of God [that is, a divine and supernatural birth—they are born of God—spiritually transformed, renewed, sanctified]."},{"header":"The Word Made Flesh"},{"num":14,"verse":"And the Word (Christ) became flesh, and lived among us; and we [actually] saw His glory, glory as belongs to the [One and] only begotten Son of the Father, [the Son who is truly unique, the only One of His kind, who is] full of grace and truth (absolutely free of deception). "},{"num":15,"verse":"John testified [repeatedly] about Him and has cried out [testifying officially for the record, with validity and relevance], “This was He of whom I said, ‘He who comes after me has a higher rank than I and has priority over me, for He existed before me.’” "},{"num":16,"verse":"For out of His fullness [the superabundance of His grace and truth] we have all received grace upon grace [spiritual blessing upon spiritual blessing, favor upon favor, and gift heaped upon gift]. "},{"num":17,"verse":"For the Law was given through Moses, but grace [the unearned, undeserved favor of God] and truth came through Jesus Christ. "},{"num":18,"verse":"No one has seen God [His essence, His divine nature] at any time; the [One and] only begotten God [that is, the unique Son] who is in the intimate presence of the Father, He has explained Him [and interpreted and revealed the awesome wonder of the Father]."},{"header":"The Testimony of John"},{"num":19,"verse":"This is the testimony of John [the Baptist] when the Jews sent priests and Levites to him from Jerusalem to ask him, “Who are you?” "},{"num":20,"verse":"And he confessed [truthfully] and did not deny [that he was only a man], but acknowledged, “I am not the Christ (the Messiah, the Anointed)!” "},{"num":21,"verse":"They asked him, “What then? Are you Elijah?” And he said, “I am not.” “Are you the [promised] Prophet?” And he answered, “No.” "},{"num":22,"verse":"Then they said to him, “Who are you? Tell us, so that we may give an answer to those who sent us. What do you say about yourself?” "},{"num":23,"verse":"He said, “I am the voice of one shouting in the wilderness, ‘Make straight the way of the Lord,’ as the prophet Isaiah said.”"},{"num":24,"verse":"Now they had been sent from the Pharisees. "},{"num":25,"verse":"They asked him, “Why then are you baptizing, if you are not the Christ, nor Elijah, nor the Prophet?” "},{"num":26,"verse":"John answered them, “I baptize [only] in water, but among you there stands One whom you do not recognize and of whom you know nothing. "},{"num":27,"verse":"It is He [the preeminent One] who comes after me, the strap of whose sandal I am not worthy to untie [even as His slave].” "},{"num":28,"verse":"These things occurred in Bethany across the Jordan [at the Jordan River crossing], where John was baptizing."},{"num":29,"verse":"The next day he saw Jesus coming to him and said, “Look! The Lamb of God who takes away the sin of the world! "},{"num":30,"verse":"This is He on behalf of whom I said, ‘After me comes a Man who has a higher rank than I and has priority over me, for He existed before me.’ "},{"num":31,"verse":"I did not recognize Him [as the Messiah]; but I came baptizing in water so that He would be [publicly] revealed to Israel.” "},{"num":32,"verse":"John gave [further] evidence [testifying officially for the record, with validity and relevance], saying, “I have seen the Spirit descending as a dove out of heaven, and He remained upon Him. "},{"num":33,"verse":"I did not recognize Him [as the Messiah], but He who sent me to baptize in water said to me, ‘He upon whom you see the Spirit descend and remain, this One is He who baptizes with the Holy Spirit.’ "},{"num":34,"verse":"I myself have [actually] seen [that happen], and my testimony is that this is the Son of God!”"},{"header":"Jesus’ Public Ministry, First Converts"},{"num":35,"verse":"Again the next day John was standing with two of his disciples, "},{"num":36,"verse":"and he looked at Jesus as He walked along, and said, “Look! The Lamb of God!” "},{"num":37,"verse":"The two disciples heard him say this, and they followed Jesus. "},{"num":38,"verse":"And Jesus turned and saw them following Him, and asked them, “What do you want?” They answered Him, “Rabbi (which translated means Teacher), where are You staying?” "},{"num":39,"verse":"He said to them, “Come, and you will see.” So they went [with Him] and saw where He was staying; and they stayed with Him that day, for it was about the tenth hour. "},{"num":40,"verse":"One of the two who heard what John said and [as a result] followed Jesus was Andrew, Simon Peter’s brother. "},{"num":41,"verse":"He first looked for and found his own brother Simon and told him, “We have found the Messiah” (which translated means the Christ). "},{"num":42,"verse":"Andrew brought Simon to Jesus. Jesus looked at him and said, “You are Simon the son of John. You shall be called Cephas (which is translated Peter).”"},{"num":43,"verse":"The next day Jesus decided to go into Galilee, and He found Philip and said to him, “Follow Me [as My disciple, accepting Me as your Master and Teacher, and walking the same path of life that I walk].” "},{"num":44,"verse":"Now Philip was from Bethsaida, the city of Andrew and Peter. "},{"num":45,"verse":"Philip found Nathanael and told him, “We have found the One Moses in the Law and also the Prophets wrote about—Jesus from Nazareth, the son of Joseph [according to public record].” "},{"num":46,"verse":"Nathanael answered him, “Can anything good come out of Nazareth?” Philip replied, “Come and see.” "},{"num":47,"verse":"Jesus saw Nathanael coming toward Him, and said of him, “Here is an Israelite indeed [a true descendant of Jacob], in whom there is no guile nor deceit nor duplicity!” "},{"num":48,"verse":"Nathanael said to Jesus, “How do You know [these things about] me?” Jesus answered, “Before Philip called you, when you were still under the fig tree, I saw you.” "},{"num":49,"verse":"Nathanael answered, “Rabbi (Teacher), You are the Son of God; You are the King of Israel.” "},{"num":50,"verse":"Jesus replied, “Because I said to you that I saw you under the fig tree, do you believe [in Me]? You will see greater things than this.” "},{"num":51,"verse":"Then He said to him, “I assure you and most solemnly say to you, you will see heaven opened and the angels of God ascending and descending on the Son of Man [the bridge between heaven and earth].”"}]