[{"header":"Prologue"},{"header":"John the Baptist’s Testimony"},{"num":19,"verse":"This is John’s testimony when the Jews from Jerusalem sent priests and Levites to ask him, “Who are you?”"},{"num":20,"verse":"He did not refuse to answer, but he declared: “I am not the Messiah.”"},{"num":21,"verse":"“What then?” they asked him. “Are you Elijah?”"},{"num":22,"verse":"“Who are you, then?” they asked. “We need to give an answer to those who sent us. What can you tell us about yourself?”"},{"num":23,"verse":"He said, “I am a voice of one crying out in the wilderness: Make straight the way of the Lord—just as Isaiah the prophet said.”"},{"num":24,"verse":"Now they had been sent from the Pharisees. "},{"num":25,"verse":"So they asked him, “Why then do you baptize if you aren’t the Messiah, or Elijah, or the Prophet?”"},{"num":26,"verse":"“I baptize with water,” John answered them. “Someone stands among you, but you don’t know Him. "},{"num":27,"verse":"He is the One coming after me, whose sandal strap I’m not worthy to untie.”"},{"num":28,"verse":"All this happened in Bethany across the Jordan, where John was baptizing."},{"header":"The Lamb of God"},{"num":29,"verse":"The next day John saw Jesus coming toward him and said, “Here is the Lamb of God, who takes away the sin of the world! "},{"num":30,"verse":"This is the One I told you about: ‘After me comes a man who has surpassed me, because He existed before me.’ "},{"num":31,"verse":"I didn’t know Him, but I came baptizing with water so He might be revealed to Israel.”"},{"num":32,"verse":"And John testified, “I watched the Spirit descending from heaven like a dove, and He rested on Him. "},{"num":33,"verse":"I didn’t know Him, but He who sent me to baptize with water told me, ‘The One you see the Spirit descending and resting on—He is the One who baptizes with the Holy Spirit.’ "},{"num":34,"verse":"I have seen and testified that He is the Son of God!”"},{"num":35,"verse":"Again the next day, John was standing with two of his disciples. "},{"num":36,"verse":"When he saw Jesus passing by, he said, “Look! The Lamb of God!”"},{"num":37,"verse":"The two disciples heard him say this and followed Jesus. "},{"num":38,"verse":"When Jesus turned and noticed them following Him, He asked them, “What are you looking for?”"},{"num":40,"verse":"Andrew, Simon Peter’s brother, was one of the two who heard John and followed Him. "},{"num":41,"verse":"He first found his own brother Simon and told him, “We have found the Messiah!” (which means “Anointed One”), "},{"num":42,"verse":"and he brought Simon to Jesus."},{"header":"Philip and Nathanael"},{"num":43,"verse":"The next day He decided to leave for Galilee. Jesus found Philip and told him, “Follow Me!”"},{"num":44,"verse":"Now Philip was from Bethsaida, the hometown of Andrew and Peter. "},{"num":45,"verse":"Philip found Nathanael and told him, “We have found the One Moses wrote about in the Law (and so did the prophets): Jesus the son of Joseph, from Nazareth!”"},{"num":46,"verse":"“Can anything good come out of Nazareth?” Nathanael asked him."},{"num":47,"verse":"Then Jesus saw Nathanael coming toward Him and said about him, “Here is a true Israelite; no deceit is in him.”"},{"num":48,"verse":"“How do you know me?” Nathanael asked."},{"num":49,"verse":"“Rabbi,” Nathanael replied, “You are the Son of God! You are the King of Israel!”"},{"num":50,"verse":"Jesus responded to him, “Do you believe only because I told you I saw you under the fig tree? You will see greater things than this.” "},{"num":51,"verse":"Then He said, “I assure you: You will see heaven opened and the angels of God ascending and descending on the Son of Man.”"}]