[{"num":1,"verse":"¶ In the beginning was the Word, and the Word was with the God, and the Word was God."},{"num":2,"verse":"The same was in the beginning with the God."},{"num":3,"verse":"All things were made by him, and without him was not any thing made that was made."},{"num":4,"verse":"In him was life, and the life was the light of men."},{"num":5,"verse":"¶ And the light shines in the darkness, and the darkness apprehended it not."},{"num":6,"verse":"There was a man sent from God, whose name was John."},{"num":7,"verse":"The same came for a witness, to bear witness of the Light, that all men through him might believe."},{"num":8,"verse":"He was not the Light, but was sent to bear witness of the Light."},{"num":9,"verse":"That Word was the true Light, which lightens every man that comes into this world."},{"num":10,"verse":"He was in the world, and the world was made by him, and the world knew him not."},{"num":11,"verse":"He came unto his own, and his own received him not."},{"num":12,"verse":"But as many as received him, to them gave he power to become sons of God, even to them that believe on his name,"},{"num":13,"verse":"who are not born of blood, nor of the will of flesh, nor of the will of man, but of God."},{"num":14,"verse":"And the Word was made flesh and dwelt among us (and we beheld his glory, the glory as of the only begotten of the Father), full of grace and truth."},{"num":15,"verse":"¶ John bore witness of him and cried, saying, This is he of whom I spoke, He that comes after me is preferred before me, for he was before me."},{"num":16,"verse":"And of his fullness we have all received, and grace for grace."},{"num":17,"verse":"For the law was given through Moses, but the grace and the truth of God came through Jesus, the Christ."},{"num":18,"verse":"No man has seen God at any time; the only begotten Son, which is in the bosom of the Father, he has declared him."},{"num":19,"verse":"¶ And this is the testimony of John, when the Jews sent priests and Levites from Jerusalem to ask him, Who art thou?"},{"num":20,"verse":"And he confessed and denied not, but confessed, I am not the Christ."},{"num":21,"verse":"And they asked him, What then? Art thou Elijah? And he said, I am not. Art thou the prophet? And he answered, No."},{"num":22,"verse":"Then said they unto him, Who art thou? that we may give an answer to those that sent us. What sayest thou of thyself?"},{"num":23,"verse":"He said, I am the voice of one crying in the wilderness, Make straight the way of the Lord, as said the prophet Isaiah."},{"num":24,"verse":"And those who were sent were of the Pharisees."},{"num":25,"verse":"And they asked him and said unto him, Why dost thou baptize then if thou art not the Christ, nor Elijah, nor the prophet?"},{"num":26,"verse":"John answered them, saying, I baptize with water, but there stands one among you, whom ye know not;"},{"num":27,"verse":"he it is, who coming after me is preferred before me, whose shoe’s latchet I am not worthy to unloose."},{"num":28,"verse":"These things were done in Bethabara beyond Jordan, where John was baptizing."},{"num":29,"verse":"¶ The next day John saw Jesus coming unto him and said, Behold the Lamb of God, who takes away the sin of the world."},{"num":30,"verse":"This is he of whom I said, After me comes a man who is preferred before me, for he was before me."},{"num":31,"verse":"And I knew him not; but that he should be made manifest to Israel, therefore am I come baptizing with water."},{"num":32,"verse":"And John gave testimony, saying, I saw the Spirit descending from heaven like a dove, and it abode upon him."},{"num":33,"verse":"And I knew him not; but he that sent me to baptize with water, the same said unto me, Upon whom thou shalt see the Spirit descending and abiding on him, the same is he who baptizes with the Holy Spirit."},{"num":34,"verse":"And I have seen and have given testimony that this is the Son of God."},{"num":35,"verse":"And again the next day John stood, and two of his disciples,"},{"num":36,"verse":"and looking upon Jesus as he walked, he said, Behold the Lamb of God!"},{"num":37,"verse":"¶ And the two disciples heard him speak and followed Jesus."},{"num":38,"verse":"Then Jesus turned and saw them following and said unto them, What seek ye? They said unto him, Rabbi (which is to say, being interpreted, Master), where dwellest thou?"},{"num":39,"verse":"He said unto them, Come and see. They came and saw where he dwelt and abode with him that day, for it was about the tenth hour."},{"num":40,"verse":"One of the two who heard John speak and followed him was Andrew, brother of Simon Peter."},{"num":41,"verse":"He first found his own brother Simon and said unto him, We have found the Messias, which is, being interpreted, the Christ."},{"num":42,"verse":"And he brought him to Jesus. And when Jesus beheld him, he said, Thou art Simon the son of Jonah: thou shalt be called Cephas, which is by interpretation, A stone."},{"num":43,"verse":"¶ The day following Jesus desired to go forth into Galilee and found Philip and said unto him, Follow me."},{"num":44,"verse":"Now Philip was of Bethsaida, the city of Andrew and Peter."},{"num":45,"verse":"Philip found Nathanael and said unto him, We have found him of whom Moses in the law and the prophets wrote: Jesus of Nazareth, the son of Joseph."},{"num":46,"verse":"And Nathanael said unto him, Can any good thing come out of Nazareth? Philip said unto him, Come and see."},{"num":47,"verse":"Jesus saw Nathanael coming to him and said of him, Behold a true Israelite, in whom is no guile!"},{"num":48,"verse":"Nathanael said unto him, From where dost thou know me? Jesus answered and said unto him, Before Philip called thee, when thou wast under the fig tree, I saw thee."},{"num":49,"verse":"Nathanael answered and said unto him, Rabbi, thou art the Son of God; thou art the King of Israel."},{"num":50,"verse":"Jesus answered and said unto him, Because I said unto thee, I saw thee under the fig tree, believest thou? thou shalt see greater things than these."},{"num":51,"verse":"And he said unto him, Verily, verily, I say unto you, Hereafter ye shall see the heaven open and the angels of God ascending and descending upon the Son of man."}]