[{"header":"In the Beginning Was the Word[b]"},{"header":"Chapter 1"},{"num":6,"verse":"Faith Means Welcoming the Word of God Made Man. A man appeared, sent by God, whose name was John."},{"num":7,"verse":"He came as a witness to give testimony to the light, so that through him all might come to believe."},{"num":8,"verse":"He himself was not the light; his role was to bear witness to the light."},{"num":15,"verse":"Jesus Christ, Fullness of Truth. John testified to him, proclaiming, “This is the one of whom I said, ‘The one who comes after me ranks ahead of me because he existed before me.’ ”"},{"header":"Jesus Is the Expected Messiah[g]"},{"num":19,"verse":"John the Baptist Is Not the Messiah. This is the testimony offered by John when the Jews sent priests and Levites from Jerusalem to ask him, “Who are you?”"},{"num":20,"verse":"He confessed, he did not deny, but confessed, “I am not the Christ.”"},{"num":21,"verse":"Then they asked him, “Who then are you? Are you Elijah?” He said, “I am not.” “Are you the Prophet?” He answered, “No.”"},{"num":22,"verse":"Therefore, they said to him, “Who are you, so we may have an answer to give to those who sent us? What do you have to say about yourself?”"},{"num":23,"verse":"He replied, in the words of the prophet Isaiah,"},{"num":24,"verse":"Some Pharisees were present in this group,"},{"num":25,"verse":"and they asked him, “Why then are you baptizing if you are neither the Christ, nor Elijah, nor the Prophet?”"},{"num":26,"verse":"John answered them, “I baptize with water; but among you there is one whom you do not know,"},{"num":27,"verse":"the one who is coming after me. I am not worthy to loosen the strap of his sandal.”"},{"num":28,"verse":"This took place in Bethany, beyond the Jordan, where John was baptizing."},{"num":29,"verse":"Behold, the Lamb of God, Who Takes Away the Sin of the World. The next day John saw Jesus coming toward him, and he said,"},{"num":32,"verse":"John also gave this testimony, saying,"},{"num":35,"verse":"We Have Found the Messiah. The next day John was standing there with two of his disciples,"},{"num":36,"verse":"and as he watched Jesus pass by, he said, “Behold, the Lamb of God.”"},{"num":37,"verse":"On hearing him say this, the two disciples began to follow Jesus."},{"num":38,"verse":"When Jesus turned and saw them following him, he asked them, “What are you looking for?” They said to him, “Rabbi” (which, translated, is “Teacher”), “where are you staying?”"},{"num":39,"verse":"He answered them, “Come and see.” So they went and saw where he was staying, and they remained with him for the rest of that day. It was about four o’clock in the afternoon."},{"num":40,"verse":"One of the two who had heard John speak and had followed Jesus was Andrew, the brother of Simon Peter."},{"num":41,"verse":"The first thing Andrew did was to seek out his brother Simon and say to him, “We have found the Messiah” (which, translated, is “Christ”),"},{"num":42,"verse":"and he took him to Jesus. Jesus gazed at him and said, “You are Simon son of John. You will be called Cephas” (which, translated, is “Peter”)."},{"num":43,"verse":"The next day Jesus decided to go to Galilee. Encountering Philip, he said to him, “Follow me.”"},{"num":44,"verse":"Philip came from the same town, Bethsaida, as Andrew and Peter."},{"num":45,"verse":"Philip found Nathanael and said to him, “We have found the one about whom Moses in the Law and also the Prophets wrote—Jesus the son of Joseph, from Nazareth.”"},{"num":46,"verse":"Nathanael said to him, “Can anything good come from Nazareth?” Philip replied, “Come and see.”"},{"num":47,"verse":"When Jesus saw Nathanael coming toward him, he said of him, “Behold, a true Israelite, in whom there is no deception.”"},{"num":48,"verse":"Nathanael asked him, “How do you know me?” Jesus answered him, “Before Philip summoned you, when you were under the fig tree, I saw you.”"},{"num":49,"verse":"Nathanael said to him, “Rabbi, you are the Son of God. You are the King of Israel.”"},{"num":50,"verse":"Jesus responded, “Do you believe because I told you that I saw you under the fig tree? You will see greater things than that.”"},{"num":51,"verse":"Then he added, “Amen, amen, I say to you, you will see the heavens opened and the angels of God ascending and descending upon the Son of Man.”"}]