[{"num":18,"verse":"After these things, Paul departed from Athens and came to Corinth."},{"num":2,"verse":"There he found a certain Jew named Aquila, born in Pontus and lately come from Italy with his wife Priscilla, because Claudius had commanded all Jews to depart from Rome. Paul went unto them,"},{"num":3,"verse":"and because he was of the same craft, he lodged with them and worked; for by their occupation they were tentmakers."},{"num":4,"verse":"And he reasoned in the synagogue every Sabbath, and persuaded the Jews and the Greeks."},{"num":5,"verse":"And when Silas and Timothy had come from Macedonia, Paul was pressed in the spirit, and testified to the Jews that Jesus was Christ."},{"num":6,"verse":"But when they opposed themselves and blasphemed, he shook his raiment and said unto them, “Your blood be upon your own heads; I am clean. From henceforth I will go unto the Gentiles.”"},{"num":7,"verse":"And he departed thence and entered into a certain man’s house named Justus, one who worshiped God and whose house was adjoining the synagogue."},{"num":8,"verse":"And Crispus, the chief ruler of the synagogue, believed in the Lord, with all his house. And many of the Corinthians, hearing, believed and were baptized."},{"num":9,"verse":"Then the Lord spoke to Paul in the night through a vision, saying, “Be not afraid, but speak and hold not thy peace."},{"num":10,"verse":"For I am with thee, and no man shall set upon thee to hurt thee, for I have many people in this city.”"},{"num":11,"verse":"And he continued there a year and six months, teaching the Word of God among them."},{"num":12,"verse":"And when Gallio was deputy of Achaia, the Jews with one accord began an insurrection against Paul, and brought him to the judgment seat,"},{"num":13,"verse":"saying, “This fellow persuadeth men to worship God contrary to the law.”"},{"num":14,"verse":"And when Paul was about to open his mouth, Gallio said unto the Jews, “If it were a matter of wrong or wicked lewdness, O ye Jews, reason would have it that I should bear with you."},{"num":15,"verse":"But if it be a question of words and names and your own law, look ye to it; for I will not be judge of such matters.”"},{"num":16,"verse":"And he drove them from the judgment seat."},{"num":17,"verse":"Then all the Greeks took Sosthenes, the chief ruler of the synagogue, and beat him in front of the judgment seat. But Gallio was concerned about none of those things."},{"num":18,"verse":"And Paul after this tarried there yet a good while, and then took his leave of the brethren and sailed thence into Syria, and with him Priscilla and Aquila, having shorn his head at Cenchrea, for he had made a vow."},{"num":19,"verse":"And he came to Ephesus and left them there, but he himself entered into the synagogue and reasoned with the Jews."},{"num":20,"verse":"When they desired him to tarry a longer time with them, he consented not,"},{"num":21,"verse":"but bade them farewell, saying, “I must by all means keep this feast that cometh in Jerusalem, but I will return again unto you, if God wills.” And he sailed from Ephesus."},{"num":22,"verse":"And when he had landed at Caesarea and had gone up and saluted the church, he went down to Antioch."},{"num":23,"verse":"And after he had spent some time there, he departed and went through all the country of Galatia and Phrygia in order, strengthening all the disciples."},{"num":24,"verse":"And a certain Jew named Apollos, born at Alexandria, an eloquent man and mighty in the Scriptures, came to Ephesus."},{"num":25,"verse":"This man was instructed in the Way of the Lord; and being fervent in the Spirit, he spoke and taught diligently the things of the Lord, though he knew only the baptism of John."},{"num":26,"verse":"And he began to speak boldly in the synagogue. When Aquila and Priscilla had heard him, they took him unto them and expounded unto him the Way of God more perfectly."},{"num":27,"verse":"And when he was disposed to pass into Achaia, the brethren wrote, exhorting the disciples to receive him. And when he had come, he helped them much who had believed through grace;"},{"num":28,"verse":"for he mightily refuted the Jews (and that publicly), showing by the Scriptures that Jesus was Christ."}]