[{"num":2,"verse":"“To the angel of the Messianic Community in Ephesus, write: ‘Here is the message from the one who holds the seven stars in his right hand and walks among the seven gold menorahs: "},{"num":2,"verse":"“I know what you have been doing, how hard you have worked, how you have persevered, and how you can’t stand wicked people; so you tested those who call themselves emissaries but aren’t — and you found them to be liars. "},{"num":3,"verse":"You are persevering, and you have suffered for my sake without growing weary. "},{"num":4,"verse":"But I have this against you: you have lost the love you had at first. "},{"num":5,"verse":"Therefore, remember where you were before you fell, turn from this sin, and do what you used to do before. Otherwise, I will come to you and remove your menorah from its place — if you don’t turn from your sin! "},{"num":6,"verse":"But you have this in your favor: you hate what the Nicolaitans do — I hate it too. "},{"num":7,"verse":"Those who have ears, let them hear what the Spirit is saying to the Messianic communities. To him winning the victory I will give the right to eat from the Tree of Life which is in God’s Gan-‘Eden.”’"},{"num":8,"verse":"“To the angel of the Messianic Community in Smyrna, write: ‘Here is the message from the First and the Last, who died and came alive again: "},{"num":9,"verse":"“I know how you are suffering and how poor you are (though in fact you are rich!), and I know the insults of those who call themselves Jews but aren’t — on the contrary, they are a synagogue of the Adversary. "},{"num":10,"verse":"Don’t be afraid of what you are about to suffer. Look, the Adversary is going to have some of you thrown in prison, in order to put you to the test; and you will face an ordeal for ten days. Remain faithful, even to the point of death; and I will give you life as your crown. "},{"num":11,"verse":"Those who have ears, let them hear what the Spirit is saying to the Messianic communities. He who wins the victory will not be hurt at all by the second death.”’"},{"num":12,"verse":"“To the angel of the Messianic Community in Pergamum, write: ‘Here is the message from the one who has the sharp double-edged sword: "},{"num":13,"verse":"“I know where you are living, there where the Adversary’s throne is. Yet you are holding onto my name. You did not deny trusting me even at the time when my faithful witness Antipas was put to death in your town, there where the Adversary lives. "},{"num":14,"verse":"Nevertheless, I have a few things against you: you have some people who hold to the teaching of Bil‘am, who taught Balak to set a trap for the people of Isra’el, so that they would eat food that had been sacrificed to idols and commit sexual sin. "},{"num":15,"verse":"Likewise, you too have people who hold to the teaching of the Nicolaitans. "},{"num":16,"verse":"Therefore, turn from these sins. Otherwise, I will come to you very soon and make war against them with the sword of my mouth. "},{"num":17,"verse":"Those who have ears, let them hear what the Spirit is saying to the Messianic communities. To him winning the victory I will give some of the hidden man. I will also give him a white stone, on which is written a new name that nobody knows except the one receiving it.”’"},{"num":18,"verse":"“To the angel of the Messianic Community in Thyatira, write: ‘Here is the message from the Son of God, whose eyes are like a fiery flame and whose feet are like burnished brass: "},{"num":19,"verse":"I know what you are doing, your love, trust, service and perseverance. And I know that you are doing more now than before. "},{"num":20,"verse":"But I have this against you: you continue to tolerate that Izevel woman, the one who claims to be a prophet, but is teaching and deceiving my servants to commit sexual sin and eat food that has been sacrificed to idols. "},{"num":21,"verse":"I gave her time to turn from her sin, but she doesn’t want to repent of her immorality. "},{"num":22,"verse":"So I am throwing her into a sickbed; and those who commit adultery with her I am throwing into great trouble, unless they turn from the sins connected with what she does; "},{"num":23,"verse":"and I will strike her children dead! Then all the Messianic communities will know that I am the one who searches minds and hearts, and that I will give to each of you what your deeds deserve. "},{"num":24,"verse":"But to the rest of you in Thyatira, to those who do not hold this teaching, who have not learned what some people call the ‘deep things’ of the Adversary, I say this: I am not loading you up with another burden; "},{"num":25,"verse":"only hold fast to what you have until I come. "},{"num":26,"verse":"To him who wins the victory and does what I want until the goal is reached,"},{"num":28,"verse":"just as I have received authority from my Father. I will also give him the morning star. "},{"num":29,"verse":"Those who have ears, let them hear what the Spirit is saying to the Messianic communities.”’"}]