[{"header":"To the church in Ephesus"},{"num":2,"verse":"‘To the angel of the church in Ephesus write:"},{"num":2,"verse":"I know your deeds, your hard work and your perseverance. I know that you cannot tolerate wicked people, that you have tested those who claim to be apostles but are not, and have found them false. "},{"num":3,"verse":"You have persevered and have endured hardships for my name, and have not grown weary."},{"num":4,"verse":"Yet I hold this against you: you have forsaken the love you had at first. "},{"num":5,"verse":"Consider how far you have fallen! Repent and do the things you did at first. If you do not repent, I will come to you and remove your lampstand from its place. "},{"num":6,"verse":"But you have this in your favour: you hate the practices of the Nicolaitans, which I also hate."},{"num":7,"verse":"Whoever has ears, let them hear what the Spirit says to the churches. To the one who is victorious, I will give the right to eat from the tree of life, which is in the paradise of God."},{"header":"To the church in Smyrna"},{"num":8,"verse":"‘To the angel of the church in Smyrna write:"},{"num":9,"verse":"I know your afflictions and your poverty – yet you are rich! I know about the slander of those who say they are Jews and are not, but are a synagogue of Satan. "},{"num":10,"verse":"Do not be afraid of what you are about to suffer. I tell you, the devil will put some of you in prison to test you, and you will suffer persecution for ten days. Be faithful, even to the point of death, and I will give you life as your victor’s crown."},{"num":11,"verse":"Whoever has ears, let them hear what the Spirit says to the churches. The one who is victorious will not be hurt at all by the second death."},{"header":"To the church in Pergamum"},{"num":12,"verse":"‘To the angel of the church in Pergamum write:"},{"num":13,"verse":"I know where you live – where Satan has his throne. Yet you remain true to my name. You did not renounce your faith in me, not even in the days of Antipas, my faithful witness, who was put to death in your city – where Satan lives."},{"num":14,"verse":"Nevertheless, I have a few things against you: there are some among you who hold to the teaching of Balaam, who taught Balak to entice the Israelites to sin so that they ate food sacrificed to idols and committed sexual immorality. "},{"num":15,"verse":"Likewise, you also have those who hold to the teaching of the Nicolaitans. "},{"num":16,"verse":"Repent therefore! Otherwise, I will soon come to you and will fight against them with the sword of my mouth."},{"num":17,"verse":"Whoever has ears, let them hear what the Spirit says to the churches. To the one who is victorious, I will give some of the hidden manna. I will also give that person a white stone with a new name written on it, known only to the one who receives it."},{"header":"To the church in Thyatira"},{"num":18,"verse":"‘To the angel of the church in Thyatira write:"},{"num":19,"verse":"I know your deeds, your love and faith, your service and perseverance, and that you are now doing more than you did at first."},{"num":20,"verse":"Nevertheless, I have this against you: you tolerate that woman Jezebel, who calls herself a prophet. By her teaching she misleads my servants into sexual immorality and the eating of food sacrificed to idols. "},{"num":21,"verse":"I have given her time to repent of her immorality, but she is unwilling. "},{"num":22,"verse":"So I will cast her on a bed of suffering, and I will make those who commit adultery with her suffer intensely, unless they repent of her ways. "},{"num":23,"verse":"I will strike her children dead. Then all the churches will know that I am he who searches hearts and minds, and I will repay each of you according to your deeds."},{"num":24,"verse":"Now I say to the rest of you in Thyatira, to you who do not hold to her teaching and have not learned Satan’s so-called deep secrets, “I will not impose any other burden on you, "},{"num":25,"verse":"except to hold on to what you have until I come.”"},{"num":26,"verse":"To the one who is victorious and does my will to the end, I will give authority over the nations –  "},{"num":27,"verse":"that one “will rule them with an iron sceptre and will dash them to pieces like pottery” – just as I have received authority from my Father. "},{"num":28,"verse":"I will also give that one the morning star. "},{"num":29,"verse":"Whoever has ears, let them hear what the Spirit says to the churches."}]