[{"num":2,"verse":"To the messenger of the congregation of Ephesus write: These things says he who holds the seven stars in his right hand, and walks in the midst of the seven golden candlesticks: "},{"num":2,"verse":"I know your works, and your labour, and your patience, and how you cannot bear those who are evil. And you examined those who say they are apostles, but are not, and have found them liars, "},{"num":3,"verse":"and did wash yourself. And you have patience, and for my name’s sake have laboured, and have not fainted."},{"num":4,"verse":"Nevertheless, I have something against you. For you have left your first love. "},{"num":5,"verse":"Remember therefore from whence you are fallen, and repent and do the first works, or else I will come to you shortly and will remove your candlestick out of its place – unless you repent."},{"num":6,"verse":"But this you have: you hate the deeds of the Nicolaitans, which deeds I also hate. "},{"num":7,"verse":"Let him who has ears hear what the Spirit says to the congregations. To him who overcomes, I will give to eat of the tree of life, which is in the midst of the paradise of God."},{"num":8,"verse":"And to the angel of the congregation of Smyrna write: These things says he who is the first and the last, who was dead and is alive: "},{"num":9,"verse":"I know your works and tribulation and poverty, but you are rich. And I know the blasphemy of those who call themselves Jews, and are not, but are the congregation of Satan."},{"num":10,"verse":"Fear none of those things that you will suffer. Behold, the devil will cast some of you into prison, to try you, and you will have tribulation ten days. Be faithful to the death, and I will give you a crown of life. "},{"num":11,"verse":"Let him who has ears hear what the Spirit says to the congregations. He who overcomes will not be hurt by the second death."},{"num":12,"verse":"And to the messenger of the congregation in Pergamos write: This says he who has the sharp sword with two edges: "},{"num":13,"verse":"I know your works and where you dwell, even where Satan’s seat is; and you keep my name and have not denied my faith. And in my days Antipas was a faithful witness of mine, who was slain among you, where Satan dwells."},{"num":14,"verse":"But I have a few things against you. You have there those who maintain the doctrine of Balaam, who taught in Balak to put occasions of sin before the children of Israel, that they should eat of meat dedicated to idols, and commit fornication. "},{"num":15,"verse":"So also you have those who maintain the doctrine of the Nicolaitans, which thing I hate. "},{"num":16,"verse":"Repent and turn therefore, or else I will come to you shortly, and will fight against them with the sword of my mouth. "},{"num":17,"verse":"Let him who has ears hear what the Spirit says to the congregations. To him who overcomes, I will give to eat manna that is hid, and will give him a white stone, and in the stone a new name written, which no one knows save the one that receives it."},{"num":18,"verse":"And to the messenger of the congregation of Thyatira write: This says the Son of God, who has his eyes like a flame of fire, whose feet are like brass: "},{"num":19,"verse":"I know your works, and your love, service, and faith, and your patience, and your deeds, which are more at the last than at the first. "},{"num":20,"verse":"Notwithstanding, I have a few things against you. You suffer that woman Jezebel, who calls herself a prophetess, to teach and to corrupt my servants, to make them commit fornication, and to eat meats offered up to idols. "},{"num":21,"verse":"And I gave her space to repent of her fornication, but she did not repent. "},{"num":22,"verse":"Behold, I will cast her into a bed, and those who commit fornication with her into great adversity, unless they turn from their deeds. "},{"num":23,"verse":"And I will kill her children with death. And all the congregations will know that I am he who searches the reins and the hearts. And I will give to every one of you according to your works."},{"num":24,"verse":"To you all I say, and to others of the people of Thyatira, as many as do not have this teaching and who have not known the deepness of Satan (as they say), I will put upon you no other burden "},{"num":25,"verse":"but that which you have already. Hold fast till I come. "},{"num":26,"verse":"And whoever overcomes and keeps my works until the end, to him I will give power over nations, "},{"num":27,"verse":"and he shall rule them with a rod of iron, and like the vessels of a potter shall he break them to pieces. Even as I received of my Father, "},{"num":28,"verse":"so will I give him the morning star. "},{"num":29,"verse":"Let him who has ears hear what the Spirit says to the congregations."}]