[{"header":"The Message to Ephesus"},{"num":2,"verse":"“To the angel of the church in Ephesus write: ‘The words of him who holds the seven stars in his right hand, who walks among the seven golden lampstands."},{"num":2,"verse":"“‘I know your works, your toil and your patient endurance, and how you cannot bear evil men but have tested those who call themselves apostles but are not, and found them to be false; "},{"num":3,"verse":"I know you are enduring patiently and bearing up for my name’s sake, and you have not grown weary. "},{"num":4,"verse":"But I have this against you, that you have abandoned the love you had at first. "},{"num":5,"verse":"Remember then from what you have fallen, repent and do the works you did at first. If not, I will come to you and remove your lampstand from its place, unless you repent. "},{"num":6,"verse":"Yet this you have, you hate the works of the Nicola′itans, which I also hate. "},{"num":7,"verse":"He who has an ear, let him hear what the Spirit says to the churches. To him who conquers I will grant to eat of the tree of life, which is in the paradise of God.’"},{"header":"The Message to Smyrna"},{"num":8,"verse":"“And to the angel of the church in Smyrna write: ‘The words of the first and the last, who died and came to life."},{"num":9,"verse":"“‘I know your tribulation and your poverty (but you are rich) and the slander of those who say that they are Jews and are not, but are a synagogue of Satan. "},{"num":10,"verse":"Do not fear what you are about to suffer. Behold, the devil is about to throw some of you into prison, that you may be tested, and for ten days you will have tribulation. Be faithful unto death, and I will give you the crown of life. "},{"num":11,"verse":"He who has an ear, let him hear what the Spirit says to the churches. He who conquers shall not be hurt by the second death.’"},{"header":"The Message to Pergamum"},{"num":12,"verse":"“And to the angel of the church in Per′gamum write: ‘The words of him who has the sharp two-edged sword."},{"num":13,"verse":"“‘I know where you dwell, where Satan’s throne is; you hold fast my name and you did not deny my faith even in the days of An′tipas my witness, my faithful one, who was killed among you, where Satan dwells. "},{"num":14,"verse":"But I have a few things against you: you have some there who hold the teaching of Balaam, who taught Balak to put a stumbling block before the sons of Israel, that they might eat food sacrificed to idols and practice immorality. "},{"num":15,"verse":"So you also have some who hold the teaching of the Nicola′itans. "},{"num":16,"verse":"Repent then. If not, I will come to you soon and war against them with the sword of my mouth. "},{"num":17,"verse":"He who has an ear, let him hear what the Spirit says to the churches. To him who conquers I will give some of the hidden manna, and I will give him a white stone, with a new name written on the stone which no one knows except him who receives it.’"},{"header":"The Message to Thyatira"},{"num":18,"verse":"“And to the angel of the church in Thyati′ra write: ‘The words of the Son of God, who has eyes like a flame of fire, and whose feet are like burnished bronze."},{"num":19,"verse":"“‘I know your works, your love and faith and service and patient endurance, and that your latter works exceed the first. "},{"num":20,"verse":"But I have this against you, that you tolerate the woman Jez′ebel, who calls herself a prophetess and is teaching and beguiling my servants to practice immorality and to eat food sacrificed to idols. "},{"num":21,"verse":"I gave her time to repent, but she refuses to repent of her immorality. "},{"num":22,"verse":"Behold, I will throw her on a sickbed, and those who commit adultery with her I will throw into great tribulation, unless they repent of her doings; "},{"num":23,"verse":"and I will strike her children dead. And all the churches shall know that I am he who searches mind and heart, and I will give to each of you as your works deserve. "},{"num":24,"verse":"But to the rest of you in Thyati′ra, who do not hold this teaching, who have not learned what some call the deep things of Satan, to you I say, I do not lay upon you any other burden; "},{"num":25,"verse":"only hold fast what you have, until I come. "},{"num":26,"verse":"He who conquers and who keeps my works until the end, I will give him power over the nations, "},{"num":27,"verse":"and he shall rule them with a rod of iron, as when earthen pots are broken in pieces, even as I myself have received power from my Father; "},{"num":28,"verse":"and I will give him the morning star. "},{"num":29,"verse":"He who has an ear, let him hear what the Spirit says to the churches.’"}]