[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(12) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "Behold a ladder. . . . —",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "Isaac had confirmed Jacob in the possession of the blessing before he started on his long journey, but it was necessary that he should also have the Divine ratification of his appointment; for the chief privilege was the covenant with God previously confirmed to Isaac, his father (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 17:19-21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). Day after day, then, he travels forward, anxious and oppressed, feeling as he went farther from his home the responsibilities attendant upon that birthright which he had coveted so eagerly. His lot was now a repetition of that of Abraham; but he had travelled from Haran with a noble following, and by express command. Jacob had at most but a few attendants, and no voice from God had ever as yet reached him. But faith in Him was growing strong, and the Divine ratification to him of the Abrahamic covenant was at length vouchsafed. In his sleep he sees a ladder, or staircase, rising from the ground at his side, and reaching up to heaven. It tells him that heaven and earth are united, and that there is a way from one to the other. Upon these stairs “messengers of Elohim are ascending and descending,” carrying up to God men’s prayers, and the tale of their wants and sorrows, of their faith and hope and trust; and bringing down to them help and comfort and blessing. At the head of the ladder Jehovah himself stands. The word is that used in ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 24:13",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", and signifies that the Deity was not there accidentally, but that He holds there His permanent station. Finally, Jehovah from His heavenly post confirms to Jacob all the promises made from the time when Abraham left Ur of the Chaldees, and assures him of His constant presence and protection.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "It has been pointed out that each of the three stages in the dream has emphasis given to it by the word behold, and that this rises to a climax at the third repetition, when the covenant God is seen stationed at the head of this pathway between earth and heaven. But besides this, the value of Jacob in Jehovah’s sight arises now from his being the appointed ancestor of the Mesciah, in whom all the families of the earth were to be blessed (Genesis 28:14). Christ, too, is the Way symbolised by this ladder (John 14:6), and the bridge of union between the material and the spiritual world (1Timothy 2:5). Our Lord, accordingly, Himself claims that “the angels of God ascend and descend upon Him” (John 1:51),",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "It has been pointed out that each of the three stages in the dream has emphasis given to it by the word ",
            "children": []
          },
          {
            "element": "span",
            "class": "ital",
            "text": "behold, ",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "and that this rises to a climax at the third repetition, when the covenant God is seen stationed at the head of this pathway between earth and heaven. But besides this, the value of Jacob in Jehovah’s sight arises now from his being the appointed ancestor of the Mesciah, in whom all the families of the earth were to be blessed (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 28:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Christ, too, is the Way symbolised by this ladder (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 14:6",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "), and the bridge of union between the material and the spiritual world (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "1Timothy 2:5",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "). Our Lord, accordingly, Himself claims that “the angels of God ascend and descend upon Him” (",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 1:51",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "),",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Benson Commentary",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "Genesis 28:12",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "Genesis 28:12",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Behold a ladder set up on the earth — ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "This might represent, 1st, The ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "providence of God, ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "by which there is a ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "constant correspondence kept up ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "between heaven and earth. The counsels of heaven are executed on earth, and the affairs of this earth are all known in heaven. Providence doth his work gradually and by steps; angels are employed as ministering spirits to serve all the designs of Providence, and the wisdom of God is at the upper end of the ladder, directing all the motions of second causes to his glory. The angels are active spirits, continually ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ascending ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "descending; ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "they rest not day nor night. They ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ascend ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "to give account of what they have done, and to receive orders; and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "descend ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "to execute the orders they have received. This vision gave seasonable comfort to Jacob, letting him know that he had both a good guide and good guard; that though he was to “wander from his father’s house,” yet he was the care of Providence, and the charge of the holy angels. 2d, The ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "mediation of Christ. ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "He is this ladder: the foot on earth in his human nature, the top in heaven in his divine nature; or, the former is his humiliation, the latter is his exaltation. All the intercourse between heaven and earth since the fall is by this ladder. Christ is ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the way: ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "all God’s favours come to us, and all our services come to him, by Christ. If God dwell with us, and we with him, it is by Christ: we have no way of getting to heaven but by this ladder; for the kind offices the angels do us, are all owing to Christ, who hath reconciled things on earth and things in heaven, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Colossians 1:20",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "28:10-15 Jacob's conduct hitherto, as recorded, was not that of one who simply feared and trusted in God. But now in trouble, obliged to flee, he looked only to God to make him to dwell in safety, and he could lie down and sleep in the open air with his head upon a stone. Any true believer would be willing to take up with Jacob's pillow, provided he might have Jacob's vision. God's time to visit his people with his comforts, is, when they are most destitute of other comforts, and other comforters. Jacob saw a ladder which reached from earth to heaven, the angels going up and coming down, and God himself at the head of it. This represents, 1. The providence of God, by which there is a constant intercourse kept up between heaven and earth. This let Jacob know that he had both a good guide and a good guard. 2. The mediation of Christ. He is this ladder; the foot on earth in his human nature, the top in heaven in his Divine nature. Christ is the Way; all God's favours come to us, and all our services go to him, by Christ, Joh 1:51. By this way, sinners draw near to the throne of grace with acceptance. By faith we perceive this way, and in prayer we approach by it. In answer to prayer we receive all needful blessings of providence and grace. We have no way of getting to heaven but by Christ. And when the soul, by faith, can see these things, then every place will become pleasant, and every prospect joyful. He will never leave us, until his last promise is accomplished in our everlasting happiness. God now spake comfortably to Jacob. He spake from the head of the ladder. All the glad tidings we receive from heaven come through Jesus Christ. The Messiah should come from Jacob. Christ is the great blessing of the world. All that are blessed, are blessed in him, and none of any family are shut out from blessedness in him, but those that shut out themselves. Jacob had to fear danger from his brother Esau; but God promises to keep him. He had a long journey before him; to an unknown country; but, Behold, I am with thee, and God promises to bring him back again to this land. He seemed to be forsaken of all his friends; but God gives him this assurance, I will not leave thee. Whom God loves, he never leaves.",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Jacob's dream and vow. Setting out on the way to Haran, he was overtaken by night, and slept in the field. He was far from any dwelling, or he did not wish to enter the house of a stranger. He dreams. A ladder or stair is seen reaching from earth to heaven, on which angels ascend and descend. This is a medium of communication between heaven and earth, by which messengers pass to and fro on errands of mercy. Heaven and earth have been separated by sin. But this ladder has re-established the contact. It is therefore a beautiful emblem of what mediates and reconciles ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 1:51",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". It here serves to bring Jacob into communication with God, and teaches him the emphatic lesson that he is accepted through a mediator. \"The Lord stood above it,\" and Jacob, the object of his mercy, beneath. First. He reveals himself to the sleeper as \"the Lord\" ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 2:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", \"the God of Abraham thy father, and of Isaac.\" It is remarkable that Abraham is styled his father, that is, his actual grandfather, and covenant father. Second. He renews the promise of the land, of the seed, and of the blessing in that seed for the whole race of man. Westward, eastward, northward, and southward are they to break forth. This expression points to the world-wide universality of the kingdom of the seed of Abraham, when it shall become the fifth monarchy, that shall subdue all that went before, and endure forever. This transcends the destiny of the natural seed of Abraham. Third. He then promises to Jacob personally to be with him, protect him, and bring him back in safety. This is the third announcement of the seed that blesses to the third in the line of descent ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 12:2-3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 22:18",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 26:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "12. he dreamed … and behold a ladder—Some writers are of opinion that it was not a literal ladder that is meant, as it is impossible to conceive any imagery stranger and more unnatural than that of a ladder, whose base was on earth, while its top reached heaven, without having any thing on which to rest its upper extremity. They suppose that the little heap of stones, on which his head reclined for a pillow, being the miniature model of the object that appeared to his imagination, the latter was a gigantic mountain pile, whose sides, indented in the rock, gave it the appearance of a scaling ladder. There can be no doubt that this use of the original term was common among the early Hebrews; as Josephus, describing the town of Ptolemais (Acre), says it was bounded by a mountain, which, from its projecting sides, was called \"the ladder,\" and the stairs that led down to the city are, in the original, termed a ladder (Ne 3:15) though they were only a flight of steps cut in the side of the rock. But whether the image presented to the mental eye of Jacob were a common ladder, or such a mountain pile as has been described, the design of this vision was to afford comfort, encouragement, and confidence to the lonely fugitive, both in his present circumstances and as to his future prospects. His thoughts during the day must have been painful—he would be his own self-accuser that he had brought exile and privation upon himself—and above all, that though he had obtained the forgiveness of his father, he had much reason to fear lest God might have forsaken him. Solitude affords time for reflection; and it was now that God began to bring Jacob under a course of religious instruction and training. To dispel his fears and allay the inward tumult of his mind, nothing was better fitted than the vision of the gigantic ladder, which reached from himself to heaven, and on which the angels were continually ascending and descending from God Himself on their benevolent errands (Joh 1:51).",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " This ladder may be considered, either, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "1. Literally, and so it represented to Jacob the providence of God, who, though he dwell in heaven, extends his care and government to the earth, and particularly makes use of the angels as ministering spirits for the good of his people. And these angels do not appear idle, or standing still, but always in motion, either ascending to God to receive his commands, or descending to earth for the execution of them. Which was a most seasonable vision for Jacob in his sad and sorrowful condition, that he might see that though he was forsaken and persecuted by men, and forced to flee away secretly for fear of his life, yet he neither was, nor should be, neglected or forsaken by God in this whole journey. Or, ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "2. Mystically, and so it represents Christ, by whom heaven and earth are united, who is called ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the way",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " to heaven, which this ladder was, who, as the Head of angels, is perpetually sending them forth either to God or from God to minister to the heirs of salvation, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " Hebrews 1:14",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Hebrews 1:14",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "; and this explication or accommodation of this vision, is warranted by our Saviour himself, ",
        "children": []
      },
      {
        "element": "span",
        "class": "bldvs",
        "text": " John 1:51",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": " ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 1:51",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And he dreamed,.... As he slept; not a common dream, but under divine direction and influence: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and, behold, a ladder set upon the earth, and the top of it reached to heaven: denoting either the providence of God, and the various steps of it, bringing about his own glory and the good of his people; and which is steady, firm, and sure, and reaches to all things here on earth; and in an especial manner is concerned about the people of God, their protection and safety; and is directed and governed according to the will, counsels, and purposes of God in heaven; a view of which must be very encouraging to Jacob in his present circumstances: or else the incarnation and mediation of Christ, who in his human nature was to be in the fulness of time on earth, there to live a while, obey, suffer, and die, and so was the ladder set on earth; and his divine nature was the top of it, which reached heaven; here he was in that nature before his incarnation, and from hence he came; and indeed here he was in that when on earth; and as man, he ascended on high when he had done his work, and is now higher than the heavens; he may be fitly represented hereby as the Mediator, who has reconciled things in heaven and things on earth, and has as it were joined and united heaven and earth together: and the various rungs in this ladder, so considered, are Christ's interposition as a surety front eternity; his incarnation in time; his being under the law, and his obedience to it; his sufferings, the shedding of his blood, and the death of the cross; his resurrection from the dead, ascension to heaven, session at the right hand of God, and intercession there. Moreover this may point out to us Christ as the way to his Father, of access unto him, and acceptance with him, by which he communicates the blessings of his grace to men, and by which they ascend to God with their prayers and praises to him: as also as being the way to heaven and eternal happiness; the various steps to which are election in him, redemption by him, regeneration by his Spirit and grace, the several graces of his Spirit, faith, hope, and love, justification by his righteousness, pardon by his blood, adoption through him, and the resurrection of the dead: ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "and, behold, the angels of God ascending and descending on it: which may be expressive of the employment of angels in the affairs of Providence, who receive their commission from heaven, and execute it on earth, in which they are diligent, faithful, and constant; and of the ministry of them, both to Christ personal, and to his church and people, even to every particular believer; see John 1:51. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "and, behold, the angels of God ascending and descending on it: which may be expressive of the employment of angels in the affairs of Providence, who receive their commission from heaven, and execute it on earth, in which they are diligent, faithful, and constant; and of the ministry of them, both to Christ personal, and to his church and people, even to every particular believer; see ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 1:51",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And he dreamed, and behold a {d} ladder set up on the earth, and the top of it reached to heaven: and behold the angels of God ascending and descending on it.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "And he dreamed, and behold a ",
            "children": []
          },
          {
            "element": "span",
            "class": "cverse3",
            "text": "{d}",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " ladder set up on the earth, and the top of it reached to heaven: and behold the angels of God ascending and descending on it.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(d) Christ is the ladder by which God and man are joined together, and by whom the angels minister to us: all graces are given to us by him, and we ascend to heaven by him.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "12",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "And he dreamed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The vision, about to be described, is conveyed through the medium of a dream; cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 20:3",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "a ladder",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] It has been suggested, e.g. by Stanley (",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Sinai and Palestine",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", p. 219) that the ledges of rock, one above the other, on the Bethel hill produced an impression on the faculties of Jacob, which took the shape, in his dream, of a flight of steps. By “a ladder,” LXX ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "κλίμαξ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", Lat. ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "scala",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", we must not understand a house ladder, with uprights and rung of wood; but, rather, a stairway, or ascent by successive terraces. Possibly, the “ladder” here mentioned resembled the ascent to Babylonian and Assyrian temples, in which the shrine or sanctuary, on the summit, was reached by steps leading through seven terraces, corresponding to the seven planets: see note on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 11:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "on the earth … to heaven",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] The distinctive feature of the vision is the communication between earth and heaven.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "For the impression produced upon the mind of a modern traveller by the scenery of this spot, see footnote1[24].",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[24] “One of the most singular stone formations west of the Jordan in Palestine is to be seen in the great stonefield a little to the north of the modern town of Beitin, the ancient Bethel.… Huge stones seem to be piled one upon another to make columns nine or ten feet or more in height. In reality these columns are produced by erosion, and the different density of the strata has led to greater erosion in one part than in another, so that they taper and bulge in manifold and various shapes. So strong is the resemblance to construction made by men’s hands that I myself have gone to this spot, not once but several times, and examined every stone, to make sure that there could be no mistake in my impression, and I have found that others have done the same thing. It is only after such a careful examination of the site that one convinces one’s self that in reality these stone pillars are the work of nature, not of man.… Surely it is a point at which heaven and earth meet. And there stand the pillars which the mighty heroes of antiquity erected.… It was only the giant men of olden times who could set up as memorials of communion with God these mighty stones at this point where heaven and earth are so clearly united” (Peters, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "Early Hebrew Story",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", pp. 111, 112).",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "the angels of God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] For this unusual expression, cf. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 32:1-2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The expression “the angel of God” is common, but that of “the angels of God” is most rare. We are to suppose that to the sleeper’s eyes were revealed the heavenly hosts, the members and attendants of the heavenly court (see notes on ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 1:26",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 6:2",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ").",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ascending and descending",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] See the use made of this vision in our Lord’s words to Nathanael, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 1:51",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". “Ascending” comes before “descending,” which reminds us that the process of Divine ministration to the sons of men has been going on before it is finally revealed to their spiritual faculties. “Ascending,” with tasks completed: “descending,” with fresh commissions from above.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 12.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And he dreamed",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". This dream, which has been pronounced \"beautifully ingenious,\" \"clever\" and \"philosophical,\" the work of a later Hebrew poet and not of Jacob (De Wette), was not wonderful considering the state of mind and body in which he must have been - fatigued by travel, saddened by thoughts of home, doubtless meditating on his mother, and more than likely pondering the great benediction of his aged and, to all appearance, dying father. Yet while these circumstances may account for the mental framework of the dream, the dream itself was Divinely sent. ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And behold a ladder",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - the rough stones of the mountain appearing to form themselves into vast staircase (Stanley, Bush) - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "set up an the earth, and the top of it reached to heaven:",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - symbolically intimating the fact of a real, uninterrupted, and close communication  between heaven and earth, and in particular between God in his glory and man in his solitude and sin - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "and behold the angels of God",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "- literally",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "the messengers of Elohim",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "i",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".e. the angels (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 103:20, 21",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Psalm 104:4",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Hebrews 1:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "ascending and descending on it",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "accented",
        "text": "vide",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 1:51",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", which shows that Christ regarded either the ladder in Jacob's vision as an emblem of himself, the one Mediator between God and man (Calvin, Luther, Ainsworth, 'Speaker's Commentary,' Murphy), or, what is more probable, Jacob himself as type of him, the Son of man, in whom the living intercourse between earth and heaven depicted in the vision of the angel-trodden staircase was completely fulfilled (Hengstenberg, Baumgsrten, Lange, Bush). Genesis 28:12",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Keil and Delitzsch Biblical Commentary on the Old Testament",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Jacob's Dream at Bethel. - As he was travelling from Beersheba, where Isaac was then staying (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 26:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "), to Haran, Jacob came to a place where he was obliged to stop all night, because the sun had set. The words \"he hit (lighted) upon the place,\" indicate the apparently accidental, yet really divinely appointed choice of this place for his night-quarters; and the definite article points it out as having become well known through the revelation of God that ensued. After making a pillow with the stones (מאשׁת, head-place, pillow), he fell asleep and had a dream, in which he saw a ladder resting upon the earth, with the top reaching to heaven; and upon it angels of God going up and down, and Jehovah Himself standing above it. The ladder was a visible symbol of the real and uninterrupted fellowship between God in heaven and His people upon earth. The angels upon it carry up the wants of men to God, and bring down the assistance and protection of God to men. The ladder stood there upon the earth, just where Jacob was lying in solitude, poor, helpless, and forsaken by men. Above in heaven stood Jehovah, and explained in words the symbol which he saw. Proclaiming Himself to Jacob as the God of his fathers, He not only confirmed to him all the promises of the fathers in their fullest extent, but promised him protection on his journey and a safe return to his home (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Genesis 28:13-15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "). But as the fulfilment of this promise to Jacob was still far off, God added the firm assurance, \"I will not leave thee till I have done (carried out) what I have told thee.\" ",
        "children": []
      }
    ]
  }
]