[{"header":"Guilt Offerings for Other Sins"},{"num":6,"verse":"The Lord told Moses these rules for the people:"},{"num":2,"verse":"“You are guilty of sin against the Lord when you do any of these things: when you lie about what happened to something you were taking care of for someone else; when you lie about a deposit you received; when you steal something; when you cheat someone;"},{"num":3,"verse":"when you find something that was lost and lie about having it; when you fail to keep a promise; or when you do any other bad things like these."},{"num":4,"verse":"If you do any of these things, you are guilty of doing wrong. You must give back whatever you stole or whatever you took by cheating. You must return whatever you took that another person asked you to hold, or whatever you found and lied about having,"},{"num":5,"verse":"or whatever you made a false promise about. You must pay the full price and then add one-fifth of that amount as a fine and give it all to the true owner."},{"num":6,"verse":"You must also bring a ram to the Lord that has nothing wrong with it (or the same amount in silver) to the priest."},{"num":7,"verse":"Then the priest will go to the Lord to make you pure, and God will forgive you for whichever of these things you did that made you guilty.”"},{"header":"Burnt Offerings"},{"num":8,"verse":"The Lord said to Moses,"},{"num":9,"verse":"“Give this command to Aaron and his sons: This is the law of the burnt offering. The burnt offering must stay on the hearth of the altar all night until morning. The altar’s fire must be kept burning."},{"num":10,"verse":"The priest must change clothes and put on the special linen underwear and linen robe. Then he must gather up the ashes from the fire and burnt offerings and set them down by the altar."},{"num":11,"verse":"Then he must take off the special clothes and put on the other clothes and carry the ashes outside the camp to a special place that is pure."},{"num":12,"verse":"The fire that was started on the altar must never be allowed to stop burning. Every morning the priests must put wood on the altar. They must arrange the burnt offerings on the wood, and they must burn the fat of the fellowship offerings on it."},{"num":13,"verse":"That fire must always be kept burning on the altar. It must never be allowed to stop burning."},{"header":"Grain Offerings"},{"num":14,"verse":"“This is the law for the grain offering: The sons of Aaron will bring it to the front of the altar as an offering to the Lord."},{"num":15,"verse":"There must be some oil and frankincense on the grain offering. The priest will take a handful of fine flour from the grain offering and burn it on the altar as a sweet-smelling memorial offering to the Lord."},{"num":16,"verse":"“Aaron and his sons will use the rest of that grain to make bread without yeast. This must be eaten in a holy place—in the courtyard around the Meeting Tent."},{"num":17,"verse":"I have given this part of the grain offering as the priests’ share of the gifts offered to me. Like the sin offering and the guilt offering, it is most holy. It must not be baked with yeast."},{"num":18,"verse":"Any male descendant of Aaron may eat from these gifts to the Lord. This is their share forever throughout your generations. Whatever touches these offerings will be made holy.”"},{"header":"The Priests’ Grain Offering"},{"num":19,"verse":"The Lord said to Moses,"},{"num":20,"verse":"“This is the offering that Aaron and his sons must bring to the Lord when Aaron is anointed to be the high priest. They must bring 8 cups of fine flour for a grain offering. This will be offered at the times of the daily offering—half of it in the morning and half of it in the evening."},{"num":21,"verse":"The fine flour must be mixed with oil and baked on a pan. After it is cooked, you must bring it in, break it into pieces, and offer it as a sweet-smelling gift to Lord."},{"num":22,"verse":"“In the future, when Aaron’s descendants take their place as the anointed priests, they will continue to make this grain offering to the Lord. This rule will continue forever. The grain offering must be completely burned for the Lord."},{"num":23,"verse":"Every grain offering that a priest gives must be completely burned. It must not be eaten.”"},{"header":"The Law of the Sin Offering"},{"num":24,"verse":"The Lord said to Moses,"},{"num":25,"verse":"“Tell Aaron and his sons: This is the law of the sin offering. The sin offering must be killed in the place where the burnt offering is killed before the Lord. It is most holy."},{"num":26,"verse":"The priest who offers the sin offering must eat it. But he must eat it in a holy place, in the courtyard around the Meeting Tent."},{"num":27,"verse":"Touching the meat of the sin offering makes a person or a thing holy."},{"num":28,"verse":"If the sin offering was boiled in a clay pot, the pot must be broken. If the sin offering was boiled in a bronze pot, the pot must be washed and rinsed in water."},{"num":29,"verse":"“Any male in a priest’s family may eat the sin offering. It is very holy."},{"num":30,"verse":"But if the blood of the sin offering was taken into the Meeting Tent and used in the Holy Place to make people pure, that sin offering must not be eaten. It must be completely burned in the fire."}]