[{"num":6,"verse":"6 The offering for sins which are done willingly. 9 The law of the burnt offerings. 13 The fire must abide evermore upon the altar. 14 The law of the meat offering. 20 The offerings of Aaron, and his sons."},{"num":1,"verse":"And the Lord spake unto Moses, saying,"},{"num":2,"verse":"If any sin and commit a trespass against the Lord, and deny unto his neighbor that which was taken him to keep, or that which was put to himof trust, or doth by robbery, or by violence oppress his neighbor,"},{"num":3,"verse":"Or hath found that which was lost, and denieth it, and sweareth falsely, for any of these things that a man doeth, wherein he sinneth:"},{"num":4,"verse":"When, I say, he thus sinneth and trespasseth, he shall then restore the robbery that he robbed, or the thing taken by violence which he took by force, or the thing which was delivered him to keep, or the lost thing which he found,"},{"num":5,"verse":"Or for whatsoever he hath sworn falsely, he shall both restore it in the whole sum, and shall add the fifth part more thereto, and give it unto him to whom it pertaineth, the same day that he offereth for his trespass."},{"num":6,"verse":"Also he shall bring for his trespass unto the Lord, a ram without blemish out of the flock in thy estimation worth two shekels for a trespass offering unto the Priest."},{"num":7,"verse":"And the Priest shall make an atonement for him before the Lord, and it shall be forgiven him, whatsoever thing he hath done, and trespassed therein."},{"num":8,"verse":"¶ Then the Lord spake unto Moses, saying,"},{"num":9,"verse":"Command Aaron and his sons, saying, This is the law of the burnt offering, (it is the burnt offering because it burneth upon the altar all the night unto the morning, and the fire burneth on the altar)."},{"num":10,"verse":"And the Priest shall put on his linen garment, and shall put on his linen breeches upon his flesh, and take away the ashes when the fire hath consumed the burnt offering upon the altar, and he shall put them beside the altar."},{"num":11,"verse":"After, he shall put off his garments, and put on other raiment, and carry the ashes forth without the host unto a clean place."},{"num":12,"verse":"But the fire upon the altar shall burn thereon and never be put out: wherefore the Priest shall burn wood on it every morning, and lay the burnt offering in order upon it, and he shall burn thereon the fat of the peace offerings."},{"num":13,"verse":"The fire shall ever burn upon the altar, and never go out."},{"num":14,"verse":"¶ Also this is the law of the meat offering, which Aaron’s sons shall offer in the presence of the Lord, before the altar."},{"num":15,"verse":"He shall even take thence his handful of fine flour of the meat offering and of the oil, and all the incense which is upon the meat offering, and shall burn it upon the altar for a sweet savor, as a memorial therefore unto the Lord:"},{"num":16,"verse":"But the rest thereof shall Aaron and his sons eat: it shall be eaten without leaven in the holy place: in the court of the Tabernacle of the Congregation they shall eat it."},{"num":17,"verse":"It shall not be baked with leaven: I have given it for their portion of mine offering made by fire: for it is as the sin offering, and as the trespass offering."},{"num":18,"verse":"All the males among the children of Aaron shall eat of it: It shall be a statute forever in your generations concerning the offerings of the Lord made by fire: whatsoever toucheth them shall be holy:"},{"num":19,"verse":"¶ Again the Lord spake unto Moses, saying,"},{"num":20,"verse":"This is the offering of Aaron and his sons, which they shall offer unto the Lord in the day when he is anointed: the tenth part of an Ephah of fine flour, for a meat offering perpetual: half of it in the morning, and half thereof at night."},{"num":21,"verse":"In the frying pan it shall be made with oil: thou shalt bring it fried, and shalt offer the baked pieces of the meat offering for a sweet savor unto the Lord."},{"num":22,"verse":"And the Priest that is anointed in his stead, among his sons shall offer it: It is the Lord’s ordinance forever, it shall be burnt altogether."},{"num":23,"verse":"For every meat offering of the Priest shall be burnt altogether, it shall not be eaten."},{"num":24,"verse":"¶ Furthermore, the Lord spake unto Moses, saying,"},{"num":25,"verse":"Speak unto Aaron, and unto his sons, and say, This is the Law of the sin offering, In the place where the burnt offering is killed, shall the sin offering be killed before the Lord, for it is most holy."},{"num":26,"verse":"The Priest that offereth this sin offering, shall eat it: in the holy place shall it be eaten, in the court of the Tabernacle of the Congregation."},{"num":27,"verse":"Whatsoever shall touch the flesh thereof shall be holy: and when there droppeth of the blood thereof upon a garment, thou shalt wash that whereon it droppeth in the holy place."},{"num":28,"verse":"Also the earthen pot that it is sodden in, shall be broken, but if it be sodden in a brazen pot, it shall both be scoured and washed with water."},{"num":29,"verse":"All the males among the Priests shall eat thereof, for it is most holy."},{"num":30,"verse":"But no sin offering, whose blood is brought into the Tabernacle of the Congregation, to make reconciliation in the holy place, shall be eaten, but shall be burnt with fire."}]