[{"num":6,"verse":" The Lord said to Moses, "},{"num":2,"verse":"“If any one sins and commits a breach of faith against the Lord by deceiving his neighbor in a matter of deposit or security, or through robbery, or if he has oppressed his neighbor "},{"num":3,"verse":"or has found what was lost and lied about it, swearing falsely—in any of all the things which men do and sin therein, "},{"num":4,"verse":"when one has sinned and become guilty, he shall restore what he took by robbery, or what he got by oppression, or the deposit which was committed to him, or the lost thing which he found, "},{"num":5,"verse":"or anything about which he has sworn falsely; he shall restore it in full, and shall add a fifth to it, and give it to him to whom it belongs, on the day of his guilt offering. "},{"num":6,"verse":"And he shall bring to the priest his guilt offering to the Lord, a ram without blemish out of the flock, valued by you at the price for a guilt offering; "},{"num":7,"verse":"and the priest shall make atonement for him before the Lord, and he shall be forgiven for any of the things which one may do and thereby become guilty.”"},{"header":"Instructions concerning Sacrifices"},{"num":8,"verse":" The Lord said to Moses, "},{"num":9,"verse":"“Command Aaron and his sons, saying, This is the law of the burnt offering. The burnt offering shall be on the hearth upon the altar all night until the morning, and the fire of the altar shall be kept burning on it. "},{"num":10,"verse":"And the priest shall put on his linen garment, and put his linen breeches upon his body, and he shall take up the ashes to which the fire has consumed the burnt offering on the altar, and put them beside the altar. "},{"num":11,"verse":"Then he shall put off his garments, and put on other garments, and carry forth the ashes outside the camp to a clean place. "},{"num":12,"verse":"The fire on the altar shall be kept burning on it, it shall not go out; the priest shall burn wood on it every morning, and he shall lay the burnt offering in order upon it, and shall burn on it the fat of the peace offerings. "},{"num":13,"verse":"Fire shall be kept burning upon the altar continually; it shall not go out."},{"num":14,"verse":"“And this is the law of the cereal offering. The sons of Aaron shall offer it before the Lord, in front of the altar. "},{"num":15,"verse":"And one shall take from it a handful of the fine flour of the cereal offering with its oil and all the frankincense which is on the cereal offering, and burn this as its memorial portion on the altar, a pleasing odor to the Lord. "},{"num":16,"verse":"And the rest of it Aaron and his sons shall eat; it shall be eaten unleavened in a holy place; in the court of the tent of meeting they shall eat it. "},{"num":17,"verse":"It shall not be baked with leaven. I have given it as their portion of my offerings by fire; it is a thing most holy, like the sin offering and the guilt offering. "},{"num":18,"verse":"Every male among the children of Aaron may eat of it, as decreed for ever throughout your generations, from the Lord’s offerings by fire; whoever touches them shall become holy.”"},{"num":19,"verse":"The Lord said to Moses, "},{"num":20,"verse":"“This is the offering which Aaron and his sons shall offer to the Lord on the day when he is anointed: a tenth of an ephah of fine flour as a regular cereal offering, half of it in the morning and half in the evening. "},{"num":21,"verse":"It shall be made with oil on a griddle; you shall bring it well mixed, in baked pieces like a cereal offering, and offer it for a pleasing odor to the Lord. "},{"num":22,"verse":"The priest from among Aaron’s sons, who is anointed to succeed him, shall offer it to the Lord as decreed for ever; the whole of it shall be burned. "},{"num":23,"verse":"Every cereal offering of a priest shall be wholly burned; it shall not be eaten.”"},{"num":24,"verse":"The Lord said to Moses, "},{"num":25,"verse":"“Say to Aaron and his sons, This is the law of the sin offering. In the place where the burnt offering is killed shall the sin offering be killed before the Lord; it is most holy. "},{"num":26,"verse":"The priest who offers it for sin shall eat it; in a holy place it shall be eaten, in the court of the tent of meeting. "},{"num":27,"verse":"Whatever touches its flesh shall be holy; and when any of its blood is sprinkled on a garment, you shall wash that on which it was sprinkled in a holy place. "},{"num":28,"verse":"And the earthen vessel in which it is boiled shall be broken; but if it is boiled in a bronze vessel, that shall be scoured, and rinsed in water. "},{"num":29,"verse":"Every male among the priests may eat of it; it is most holy. "},{"num":30,"verse":"But no sin offering shall be eaten from which any blood is brought into the tent of meeting to make atonement in the holy place; it shall be burned with fire."}]