[{"num":4,"verse":"After the whole nation had gone across the Jordan River, the Lord spoke to Joshua. He said, "},{"num":2,"verse":"“Choose 12 men from among the people. Choose one from each tribe. "},{"num":3,"verse":"Tell them to get 12 stones from the middle of the river. They must pick them up from right where the priests stood. They must carry the stones over with all of you. And they must put them down at the place where you will stay tonight.”"},{"num":4,"verse":"So Joshua called together the 12 men he had appointed from among the Israelites. There was one man from each tribe. "},{"num":5,"verse":"He said to them, “Go back to the middle of the Jordan River. Go to where the ark of the Lord your God is. Each one of you must pick up a stone. You must carry it on your shoulder. There will be as many stones as there are tribes in Israel. "},{"num":6,"verse":"The stones will serve as a reminder to you. In days to come, your children will ask you, ‘What do these stones mean?’ "},{"num":7,"verse":"Tell them that the Lord cut off the flow of water in the Jordan River. Tell them its water stopped flowing when the ark of the covenant of the Lord went across. The stones will always remind the Israelites of what happened there.”"},{"num":8,"verse":"So the Israelites did as Joshua commanded them. They took 12 stones from the middle of the Jordan River. There was one stone for each of the tribes of Israel. It was just as the Lord had told Joshua. The people carried the stones with them to their camp. There they put them down. "},{"num":9,"verse":"Joshua also piled up 12 stones in the middle of the river. He piled them up right where the priests who carried the ark of the covenant had stood. And they are still there to this very day."},{"num":10,"verse":"The priests who carried the ark remained standing in the middle of the Jordan River. They stayed there until the people had done everything the Lord had commanded Joshua. It was just as Moses had directed Joshua. All the people went across quickly. "},{"num":11,"verse":"As soon as they did, the ark of the Lord and the priests also went across to the other side. The people were watching them. "},{"num":12,"verse":"Among the people who went across the river were men from the tribes of Reuben and Gad and half of the tribe of Manasseh. The men were ready for battle. They went across ahead of the rest of the Israelites. It was just as Moses had directed them. "},{"num":13,"verse":"There were about 40,000 of them. All of them were ready for battle. They went across in front of the ark of the Lord. They marched to the plains around Jericho. They were prepared to go to war."},{"num":14,"verse":"That day the Lord honored Joshua in the eyes of all the Israelites. They had respect for Joshua as long as he lived. They respected him just as much as they had respected Moses."},{"num":15,"verse":"Then the Lord spoke to Joshua. He said, "},{"num":16,"verse":"“Command the priests to come up out of the Jordan River. They are carrying the ark where the tablets of the covenant law are kept.”"},{"num":17,"verse":"So Joshua gave a command to the priests. He said, “Come up out of the Jordan River.”"},{"num":18,"verse":"Then the priests came up out of the river. They were carrying the ark of the covenant of the Lord. As soon as they stepped out on dry ground, the water of the Jordan began to flow again. It went over its banks, just as it had done before."},{"num":19,"verse":"On the tenth day of the first month the people went up out of the Jordan River. They camped at Gilgal on the eastern border of Jericho. "},{"num":20,"verse":"Joshua set up the 12 stones at Gilgal. They were the ones the people had taken out of the Jordan. "},{"num":21,"verse":"Then he spoke to the Israelites. He said, “In days to come, your children after you will ask their parents, ‘What do these stones mean?’ "},{"num":22,"verse":"Their parents must tell them, ‘Israel went across the Jordan River on dry ground.’ "},{"num":23,"verse":"The Lord your God dried up the Jordan for you until you had gone across it. He did to the Jordan River the same thing he had done to the Red Sea. He dried up the Red Sea ahead of us until we had gone across it. "},{"num":24,"verse":"He did it so that all the nations on earth would know that he is powerful. He did it so that you would always have respect for the Lord your God.”"}]