[[],[{"type":"header","content":"Israel’s Taunt"},{"type":"prose","content":"For the LORD will have compassion on Jacob (the captives in Babylon) and will again choose Israel, and will settle them in their own land. Foreigners (Gentiles) will join them [as proselytes] and will attach themselves to the house of Jacob (Israel). "}],[{"type":"prose","content":"The peoples will take them along and bring them to their own place (Judea), and the house of Israel will possess them as an inheritance in the land of the LORD as male and female servants; and they will take captive those whose captives they have been, and they will rule over their [former] oppressors."}],[{"type":"prose","content":"And it will be in the day when the LORD gives you rest from your pain and turmoil and from the harsh service in which you have been enslaved, "}],[{"type":"prose","content":"that you will take up this taunt against the king of Babylon, and say,"}],[{"type":"prose","content":"“I will rise up against them,” says the LORD of hosts, “and will cut off from Babylon name and survivors, and son and grandson,” declares the LORD. "}],[{"type":"prose","content":"“I will also make Babylon a possession of the hedgehog and of swamps of water, and I will sweep it away with the broom of destruction,” declares the LORD of hosts."}],[{"type":"header","content":"Judgment on Assyria"},{"type":"prose","content":"The LORD of hosts has sworn [an oath], saying, “Just as I have intended, so it has certainly happened, and just as I have planned, so it will stand— "}],[{"type":"prose","content":"to break the Assyrian in My land, and on My mountains I will trample him underfoot. Then the Assyrian’s yoke will be removed from them (the people of Judah) and his burden removed from their shoulder. "}],[{"type":"prose","content":"This is the plan [of God] decided for the whole earth [regarded as conquered and put under tribute by Assyria]; and this is the hand [of God] that is stretched out over all the nations. "}],[{"type":"prose","content":"For the LORD of hosts has decided  planned, and who can annul it? His hand is stretched out, and who can turn it back?”"}],[{"type":"header","content":"Judgment on Philistia"},{"type":"prose","content":"In the year that King Ahaz [of Judah] died this [mournful, inspired] oracle (a burden to be carried) came:"}]]