[
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Ellicott's Commentary for English Readers",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "(25) ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "It was the third hour.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "—The precise statement of the hour is peculiar to St. Mark, but it agrees with the narrative common to him with St. Matthew and St. Luke of the darkness that came over the land at the “sixth hour.”",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "",
        "children": [
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Henry's Concise Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "15:22-32 The place where our Lord Jesus was crucified, was called the place of a scull; it was the common place of execution; for he was in all respects numbered with the transgressors. Whenever we look unto Christ crucified, we must remember what was written over his head; he is a King, and we must give up ourselves to be his subjects, as Israelites indeed. They crucified two thieves with him, and him in the midst; they thereby intended him great dishonour. But it was foretold that he should be numbered with the transgressors, because he was made sin for us. Even those who passed by railed at him. They told him to come down from the cross, and they would believe; but they did not believe, though he gave them a more convincing sign when he came up from the grave. With what earnestness will the man who firmly believes the truth, as made known by the sufferings of Christ, seek for salvation! With what gratitude will he receive the dawning hope of forgiveness and eternal life, as purchased for him by the sufferings and death of the Son of God! and with what godly sorrow will he mourn over the sins which crucified the Lord of glory!",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Barnes' Notes on the Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And it was the third hour ... - In ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 19:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " it is said, \"And it was the preparation of the passover, and about the sixth hour, etc. Much difficulty has been felt in reconciling these passages, and infidels have usually adduced them to prove that the evangelists have contradicted themselves. In reconciling them the following remarks may perhaps make the matter clear:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) The Jews divided both the night and the day into four equal parts of three hours each. See the notes at Matthew 14:25. The first division of the day commenced at six o'clock in the morning, and ended at nine; the second commenced at nine and ended at twelve, etc. \"The third\" hour mentioned by Mark would therefore correspond with our nine o'clock; the \"sixth\" hour mentioned by John would correspond with our twelve, or noon.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(1) The Jews divided both the night and the day into four equal parts of three hours each. See the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 14:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The first division of the day commenced at six o'clock in the morning, and ended at nine; the second commenced at nine and ended at twelve, etc. \"The third\" hour mentioned by Mark would therefore correspond with our nine o'clock; the \"sixth\" hour mentioned by John would correspond with our twelve, or noon.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(2) mark professes to give the time accurately; John does not. He says \"it was about the sixth hour,\" without affirming that this was exactly the time.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(3) a mistake in \"numbers\" is easily made; and if it should he admitted that such an error had crept into the text here, it would be nothing more than has occurred in many ancient writings. It has been proved, moreover, that it was common not to write the \"words\" indicating numbers at \"length,\" but to use \"letters.\" The Greeks designated numbers by the letters of the alphabet, and this mode of computation is found in ancient manuscripts. For example, the Cambridge manuscript of the New Testament has in this very place in Mark, not the word \"third\" written at length, but the Greek letter gamma (γ), the usual notation for third. Now it is well known that it would be easy to mistake this for the Greek letter sigma (ς), the mark denoting \"six.\" An error of this kind in an early manuscript might be extensively propagated, and might have led to the present reading of the text. Such an error is actually known to exist in the \"Chronicon\" of Paschal, where Otho is said to have reigned ς, (six) months, whereas it is known that he reigned but three, and in this place, therefore, the γ, three, was mistaken for ς, six.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(4) there is some external authority for reading \"third\" in John 19:14. The Cambridge manuscript has this reading. Nonnus, who lived in the fifth century, says that this was the true reading (Wetstein). Peter of Alexandria, in a fragment concerning the Passover, as quoted by Usher, says, \"It was the preparation of the Passover, and about the \"third\" hour, as,\" he adds, \"the most accurate copies of the Bible have it; and this was the handwriting of the evangelist (John), which is kept, by the grace of God, in his most holy church at Ephesus\" (Mill). It is to be admitted, however, that no great reliance is to be placed on this account. That a mistake \"might\" have occurred in the early manuscripts is not improbable. No man can \"prove\" that it did \"not\" so occur, and so long as this cannot be proved, the passages should not be adduced as conclusive proof of contradiction.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(4) there is some external authority for reading \"third\" in ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 19:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". The Cambridge manuscript has this reading. Nonnus, who lived in the fifth century, says that this was the true reading (Wetstein). Peter of Alexandria, in a fragment concerning the Passover, as quoted by Usher, says, \"It was the preparation of the Passover, and about the \"third\" hour, as,\" he adds, \"the most accurate copies of the Bible have it; and this was the handwriting of the evangelist (John), which is kept, by the grace of God, in his most holy church at Ephesus\" (Mill). It is to be admitted, however, that no great reliance is to be placed on this account. That a mistake \"might\" have occurred in the early manuscripts is not improbable. No man can \"prove\" that it did \"not\" so occur, and so long as this cannot be proved, the passages should not be adduced as conclusive proof of contradiction.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "After all, perhaps, without the supposition that there is any error in the text, the whole difficulty may be removed by the following statements:",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(1) Calvary was \"without\" the walls of Jerusalem. It was a considerable distance from the place where Jesus was tried and condemned. Some time, more or less, would be occupied in going there, and in the preparatory measures for crucifying him.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(2) it is not necessary to understand \"Mark\" as saying that it was precisely nine o'clock, according to our expression. With the Jews it was six until seven; it was the third hour until the fourth commenced; it was the ninth until it was the tenth. They \"included\" in the \"third\" hour the whole time from the third to the fourth. The same mode they adopted in regard to their days. See the notes at Matthew 12:40.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(2) it is not necessary to understand \"Mark\" as saying that it was precisely nine o'clock, according to our expression. With the Jews it was six until seven; it was the third hour until the fourth commenced; it was the ninth until it was the tenth. They \"included\" in the \"third\" hour the whole time from the third to the fourth. The same mode they adopted in regard to their days. See the notes at ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 12:40",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ".",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(3) it is not unduly pressing the matter to suppose that Mark spoke of the time when the process for crucifixion commenced - that is, when he was condemned - when they entered upon it - when they made the preparation. Between that and the time when he was taken \"out\" of Jerusalem to Mount Calvary, and when he was actually nailed to the tree, there is no improbability in supposing that there might have been an interval of more than an hour. Indeed, the presumption is that considerably more time than that would elapse.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(4) John does not profess, as has been remarked, to be strictly accurate. He says \"it was about the sixth hour,\" etc.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(5) now suppose that John meant to indicate the time when he was \"actually\" suspended on the cross - that he spoke of the \"crucifixion\" denoting the \"act of suspension,\" as it struck \"him\" - and there is no difficulty. Any other two men - any witnesses - might give just such an account now. One man would speak of the time when the process for an execution commenced; another, perhaps, of the very \"act\" of the execution and would \"both\" speak of it in general terms, and say that a man was executed at such a time; and the circumstantial variation would \"prove\" that there was no collusion, no agreement to \"impose\" on a court - that they were honest witnesses. That is \"proved\" here.",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "(6) that this is the true account of the matter is clear from the evangelists themselves, and \"especially from Mark.\" The three first evangelists concur in stating that there was a remarkable \"darkness\" over the whole land from the \"sixth\" to the \"ninth\" hour, Matthew 27:45; \"Mar 15:33;\" Luke 23:44. This fact - in which Mark concurs - would seem to indicate that \"the actual crucifixion\" continued only during that time - that he was, in fact, suspended at about the sixth hour, though the preparations for crucifying him had been going on (Mark) for two hours before. The fact that Mark Mar 15:33 mentions this darkness as commencing at the \"sixth\" and not at the \"third\" hour, is one of the circumstances undesignedly occurring that seems to signify that the crucifixion then had \"actually\" taken place, though the various arrangements for it Mark 15:25 had been going on from the \"third\" hour.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(6) that this is the true account of the matter is clear from the evangelists themselves, and \"especially from Mark.\" The three first evangelists concur in stating that there was a remarkable \"darkness\" over the whole land from the \"sixth\" to the \"ninth\" hour, ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Matthew 27:45",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; \"Mar 15:33;\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Luke 23:44",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". This fact - in which Mark concurs - would seem to indicate that \"the actual crucifixion\" continued only during that time - that he was, in fact, suspended at about the sixth hour, though the preparations for crucifying him had been going on (Mark) for two hours before. The fact that Mark Mar 15:33 mentions this darkness as commencing at the \"sixth\" and not at the \"third\" hour, is one of the circumstances undesignedly occurring that seems to signify that the crucifixion then had \"actually\" taken place, though the various arrangements for it ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 15:25",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": " had been going on from the \"third\" hour.",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "One thing is conclusively proved by this - that the evangelists did not \"conspire together\" to impose on the world. They are independent witnesses, and they were honest men; and the circumstance adverted to here is one that is allowed to be of great value in testimony in courts of justice - \"circumstantial variation with essential agreement.\" ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "One thing is conclusively proved by this - that the evangelists did not \"conspire together\" to impose on the world. They are independent witnesses, and they were honest men; and the circumstance adverted to here is one that is allowed to be of great value in testimony in courts of justice - \"circumstantial variation with essential agreement.\" ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Jamieson-Fausset-Brown Bible Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "Mr 15:21-37. Crucifixion and Death of the Lord Jesus. ( = Mt 27:32-50; Lu 23:26-46; Joh 19:17-30).",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "See on [1519]Joh 19:17-30.",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Matthew Poole's Commentary",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "bld",
        "text": "See Poole on \"Mark 15:21\"",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "See Poole on \"",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "Mark 15:21",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "\"",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": " ",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Gill's Exposition of the Entire Bible",
    "elements": [
      {
        "element": "span",
        "class": "",
        "text": "And it was the third hour, and they crucified him. The time of the daily sacrifice of the morning, at which the priests ought to have been; and the time when the sanhedrim usually began to sit (x); for ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "\"the grand sanhedrim sat from the daily sacrifice of the morning, to the daily sacrifice of the evening:'' ",
        "children": []
      },
      {
        "element": "p",
        "class": "",
        "text": "but this being an extraordinary case, and they in a hurry to put Jesus to death, had been sitting up all night; and early in the morning had procured the sentence of death on him, which they were going to execute by the time they used to sit: this was about nine o'clock in the morning, and takes in the time between that and twelve at noon. The Ethiopic version reads, \"and it was the sixth hour\", to make it agree with John 19:14; and for the reconciling of these two places; see Gill on John 19:14. ",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "but this being an extraordinary case, and they in a hurry to put Jesus to death, had been sitting up all night; and early in the morning had procured the sentence of death on him, which they were going to execute by the time they used to sit: this was about nine o'clock in the morning, and takes in the time between that and twelve at noon. The Ethiopic version reads, \"and it was the sixth hour\", to make it agree with ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 19:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": "; and for the reconciling of these two places; see Gill on ",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "John 19:14",
            "children": []
          },
          {
            "element": "span",
            "class": "",
            "text": ". ",
            "children": []
          }
        ]
      },
      {
        "element": "p",
        "class": "",
        "text": "(x) Maimon. Hilch. Sanhedrin, c. 3, sect. 1.",
        "children": [
          {
            "element": "span",
            "class": "",
            "text": "(x) Maimon. Hilch. Sanhedrin, c. 3, sect. 1.",
            "children": []
          },
          {
            "element": "span",
            "class": "verse-link",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXPOSITORY (ENGLISH BIBLE)",
    "name": "Geneva Study Bible",
    "elements": [
      {
        "element": "span",
        "class": "cverse2",
        "text": "And it was the third hour, and they crucified him.",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Expositor's Greek Testament",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 15:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ὥρα τρίτη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", the third hour = nine o’clock as we reckon; raising a harmonistic problem when compared with ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 19:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Grotius comments: “id est, jam audita erat tuba horae tertiae, quod dici solebat donec caneret tuba horae sextae” (they called it the third hour till the sixth was sounded).—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καὶ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " = when, Hebraistic, but also not without example in classics in similar connections: the fact stated connected with its time by a simple ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καὶ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; instances in Meyer.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Cambridge Bible for Schools and Colleges",
    "elements": [
      {
        "element": "span",
        "class": "bld",
        "text": "25–38",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The Death",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "bld",
        "text": "25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "it was the third hour",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "] or nine o’clock. St John’s words (",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 19:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") clearly point to a different mode of reckoning.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Bengel's Gnomen",
    "elements": [
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 15:25",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Τρίτη",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "third",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") which the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "sixth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " and ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "ninth",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " hour follows, ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 15:33",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". Therefore it is Jewish hours that are here marked. However the case stands in Mark and John as to both the kind of hour and the mode of enumeration respectively employed by them, both mean the one and the same portion of the day, viz. in the forenoon. Nor is there any reason why we should desire to diminish the number of hours of His remaining on the cross. Jesus hung upon it more than six hours: for even ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "six hours",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", from the third to the ninth hour, were in themselves a longer time than ordinary hours of equal length, inasmuch as the equinox was now past: for they were wont to divide the day, whether it were shorter or longer, into twelve hours: and between the close of the supernatural darkness and the death of Jesus many events intervened. There are some who explain this verse thus: ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "It was the third hour from the time that they had crucified Him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". But if this had been his meaning, Mark would have said, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "There were three hours",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; and in that case, passing by the hour of the crucifixion itself, he would say, what occurred three hours afterwards [which is not likely]: for, both the casting of lots, and the superscription written, were acts more speedily done [than the act of crucifixion].—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καὶ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "Καὶ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " either is used in its strict meaning, ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "and",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; in order that Mark may intimate, that first of all the soldiers nailed Jesus to the cross, next, that they divided His garments, and then erected the cross: or else, rather, the ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καὶ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " has a relative force, so that the hour should be precisely denoted, to which the mention of the crucifixion is both prefixed and subjoined.[9] Comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "John 19:14",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": "; comp. ",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "καὶ",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", ch. ",
        "children": []
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "Mark 2:15",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ", at the end of verse.—",
        "children": []
      },
      {
        "element": "span",
        "class": "greekheb",
        "text": "ἐσταύρωσαν",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ") elevating the ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "cross",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ".",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "",
        "text": "[9] “It was the third hour ",
        "children": []
      },
      {
        "element": "span",
        "class": "ital",
        "text": "when",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " they crucified Him.”—ED. and TRANSL.",
        "children": []
      },
      {
        "element": "span",
        "class": "p",
        "text": "",
        "children": [
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          },
          {
            "element": "br",
            "class": "",
            "text": "",
            "children": []
          }
        ]
      },
      {
        "element": "span",
        "class": "verse-link",
        "text": "",
        "children": []
      }
    ]
  },
  {
    "type": "EXEGETICAL (ORIGINAL LANGUAGES)",
    "name": "Pulpit Commentary",
    "elements": [
      {
        "element": "span",
        "class": "cmt_sub_title",
        "text": "Verse 25.",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": " - ",
        "children": []
      },
      {
        "element": "span",
        "class": "cmt_word",
        "text": "And it was the third hour, and they crucified him",
        "children": []
      },
      {
        "element": "span",
        "class": "",
        "text": ". The third hour would literally be nine o'clock. But we gather from ver. 33 that our Lord was on his cross, and still alive, at the sixth hour, that is, at twelve o'clock. The simplest mode of solving the chronological difficulty seems to be this: The Jews divided their day into four parts, which they called hours, namely, the first, from six to nine; the third, from nine to twelve; the sixth, from twelve to three; and the ninth, from three to six. It was, then, within the third hour, that is, between nine and twelve, that they crucified him; and it was from the sixth to the ninth hour that he was actually upon his cross. St. John employs the Asiatic mode of computing time. Mark 15:25",
        "children": []
      }
    ]
  }
]