[{"header":"New People Move into Jerusalem"},{"num":11,"verse":"The leaders of Israel ·lived [settled] in Jerusalem. The rest of the people ·threw [cast] lots to choose one person out of every ten to come and live in Jerusalem, the holy city. The other nine could stay in their own cities. "},{"num":2,"verse":"The people ·blessed [praised; commended] those who volunteered to live in Jerusalem [at this point in the rebuilding, Jerusalem was dangerous and perhaps uncomfortable]."},{"num":3,"verse":"These are the ·area [provincial] ·leaders [officials] who lived in Jerusalem. (·Some [Other; Most] people lived on their own ·land [property] in the cities of Judah. These included Israelites, priests, Levites, Temple servants, and ·descendants [sons] of Solomon’s servants. "},{"num":4,"verse":"Others from the ·families [sons] of Judah and Benjamin lived in Jerusalem.)"},{"num":5,"verse":"There was also Maaseiah son of Baruch. (Baruch was the son of Col-Hozeh, the son of Hazaiah. Hazaiah was the son of Adaiah, the son of Joiarib. Joiarib was the son of Zechariah, a ·descendant [son] of Shelah.) "},{"num":6,"verse":"All the ·descendants [sons] of Perez who ·lived [settled] in Jerusalem totaled 468 men. They were ·soldiers [capable/outstanding/exceptional men]."},{"num":7,"verse":"These are ·descendants [sons] of Benjamin who ·moved into [settled in] Jerusalem. There was Sallu son of Meshullam. (Meshullam was the son of Joed, the son of Pedaiah. Pedaiah was the son of Kolaiah, the son of Maaseiah. Maaseiah was the son of Ithiel, the son of Jeshaiah.) "},{"num":8,"verse":"·Following him [or His brothers] were Gabbai and Sallai, for a total of 928 men. "},{"num":9,"verse":"Joel son of Zicri was ·appointed over them [their chief/supervisor], and Judah son of Hassenuah was second in ·charge [command] of the ·new area of the city [city]."},{"num":10,"verse":"These are the priests who moved into Jerusalem. There was Jedaiah son of Joiarib, Jakin, "},{"num":11,"verse":"and Seraiah son of Hilkiah, the ·supervisor [leader] in the ·Temple [house] of God. (Hilkiah was the son of Meshullam, the son of Zadok. Zadok was the son of Meraioth, the son of Ahitub.) "},{"num":12,"verse":"And there were ·others [colleagues; brothers] with them who ·did [performed] the work for the ·Temple [house]. All together there were 822 men. Also there was Adaiah son of Jeroham. (Jeroham was the son of Pelaliah, the son of Amzi. Amzi was the son of Zechariah, the son of Pashhur. Pashhur was the son of Malkijah.) "},{"num":13,"verse":"And there were family heads with him. All together there were 242 men. Also there was Amashsai son of Azarel. (Azarel was the son of Ahzai, the son of Meshillemoth. Meshillemoth was the son of Immer.) "},{"num":14,"verse":"And there were ·brave [capable; outstanding; exceptional] men with Amashsai. All together there were 128 men. Zabdiel son of Haggedolim was ·appointed over them [their chief/supervisor]."},{"num":15,"verse":"These are the Levites who moved into Jerusalem. There was Shemaiah son of Hasshub. (Hasshub was the son of Azrikam, the son of Hashabiah. Hashabiah was the son of Bunni.) "},{"num":16,"verse":"And there were Shabbethai and Jozabad, two of the leaders of the Levites who were in charge of the work outside the ·Temple [house] of God. "},{"num":17,"verse":"There was Mattaniah son of Mica. (Mica was the son of Zabdi, the son of Asaph.) Mattaniah was the ·director who led the people [leader] in thanksgiving and prayer. There was Bakbukiah, who was second in charge over his ·fellow Levites [colleagues; brothers]. And there was Abda son of Shammua. (Shammua was the son of Galal, the son of Jeduthun.) "},{"num":18,"verse":"All together 284 Levites lived in the holy city."},{"num":19,"verse":"The gatekeepers who moved into Jerusalem were Akkub, Talmon, and others with them. There was a total of 172 men who ·guarded [kept watch at] the city gates."},{"num":20,"verse":"The other Israelites, priests, and Levites lived on their own ·land [property] in all the cities of Judah."},{"num":21,"verse":"The Temple servants lived on the hill of Ophel, and Ziha and Gishpa ·were in charge of [supervised] them."},{"num":22,"verse":"Uzzi son of Bani was ·appointed over [chief officer/supervisor of] the Levites in Jerusalem. (Bani was the son of Hashabiah, the son of Mattaniah. Mattaniah was the son of Mica.) Uzzi was one of Asaph’s ·descendants [sons], who were the singers responsible for the service of the ·Temple [house] of God. "},{"num":23,"verse":"The singers were under the king’s ·orders [commandment], which regulated them day by day."},{"num":24,"verse":"Pethahiah son of Meshezabel was the king’s ·spokesman [representative; adviser] in all matters concerning the people. (Meshezabel was a descendant of Zerah, the son of Judah.)"},{"num":25,"verse":"Some of the people of Judah lived in ·villages [settlements] with their surrounding fields. They lived in Kiriath Arba and its ·surroundings [towns], in Dibon and its ·surroundings [towns], in Jekabzeel and its ·surroundings [settlements], "},{"num":26,"verse":"in Jeshua, Moladah, Beth Pelet, "},{"num":27,"verse":"Hazar Shual, Beersheba and its ·surroundings [towns], "},{"num":28,"verse":"in Ziklag and Meconah and its ·surroundings [towns], "},{"num":29,"verse":"in En Rimmon, Zorah, Jarmuth, "},{"num":30,"verse":"Zanoah, Adullam and their ·villages [settlements], in Lachish and the fields around it, and in Azekah and its ·surroundings [towns]. So they ·settled [lived; camped] from Beersheba all the way to the Valley of Hinnom."},{"num":31,"verse":"The ·descendants [sons] of the Benjaminites from Geba lived in Micmash, Aija, Bethel and its ·surroundings [towns], "},{"num":32,"verse":"in Anathoth, Nob, Ananiah, "},{"num":33,"verse":"Hazor, Ramah, Gittaim, "},{"num":34,"verse":"Hadid, Zeboim, Neballat, "},{"num":35,"verse":"Lod, Ono, and in the ·Valley of the Craftsmen [Ge-harashim]."},{"num":36,"verse":"Some groups of the Levites from Judah settled in the land of Benjamin."}]