[{"header":"New People Move into Jerusalem"},{"num":11,"verse":"The leaders of Israel lived in Jerusalem. The rest of the people threw lots. One person out of every ten was to come and live in Jerusalem. It was the holy city. The other nine could stay in their own cities. "},{"num":2,"verse":"The people blessed those who volunteered to live in Jerusalem."},{"num":3,"verse":"These are the area leaders who lived in Jerusalem. (Some people lived on their own land in the cities of Judah. These included Israelites, priests, Levites, Temple servants and descendants of Solomon’s servants. "},{"num":4,"verse":"Others from the families of Judah and Benjamin lived in Jerusalem.)"},{"num":5,"verse":"There was also Maaseiah son of Baruch. (Baruch was the son of Col-Hozeh, who was the son of Hazaiah. Hazaiah was the son of Adaiah, who was the son of Joiarib. Joiarib was the son of Zechariah, who was a descendant of Shelah.) "},{"num":6,"verse":"All the descendants of Perez who lived in Jerusalem totaled 468 men. They were soldiers."},{"num":7,"verse":"These are descendants of Benjamin who moved into Jerusalem. There was Sallu son of Meshullam. (Meshullam was the son of Joed, who was the son of Pedaiah. Pedaiah was the son of Kolaiah, who was the son of Maaseiah. Maaseiah was the son of Ithiel, who was the son of Jeshaiah.) "},{"num":8,"verse":"Following him were Gabbai and Sallai. All together there were 928 men. "},{"num":9,"verse":"Joel son of Zicri was appointed over them. And Judah son of Hassenuah was second in charge of the new area of the city."},{"num":10,"verse":"These are the priests who moved into Jerusalem. There was Jedaiah son of Joiarib, Jakin "},{"num":11,"verse":"and Seraiah son of Hilkiah. (Hilkiah was the son of Meshullam, who was the son of Zadok. Zadok was the son of Meraioth, who was the son of Ahitub. Seraiah was the supervisor in the Temple.) "},{"num":12,"verse":"And there were others with them who did the work for the Temple. All together there were 822 men. Also there was Adaiah son of Jeroham. (Jeroham was the son of Pelaliah, who was the son of Amzi. Amzi was the son of Zechariah, who was the son of Pashhur. Pashhur was the son of Malkijah.) "},{"num":13,"verse":"And there were family heads with him. All together there were 242 men. Also there was Amashsai son of Azarel. (Azarel was the son of Ahzai, who was the son of Meshillemoth. Meshillemoth was the son of Immer.) "},{"num":14,"verse":"And there were brave men with Amashsai. All together there were 128 men. Zabdiel son of Haggedolim was appointed over them."},{"num":15,"verse":"These are the Levites who moved into Jerusalem. There was Shemaiah son of Hasshub. (Hasshub was the son of Azrikam, who was the son of Hashabiah. Hashabiah was the son of Bunni.) "},{"num":16,"verse":"And there were Shabbethai and Jozabad. They were two of the leaders of the Levites. They were in charge of the work outside the Temple. "},{"num":17,"verse":"There was Mattaniah son of Mica. (Mica was the son of Zabdi, who was the son of Asaph.) Mattaniah was the director. He led the people in thanksgiving and prayer. There was Bakbukiah, who was second in charge over his fellow Levites. And there was Abda son of Shammua. (Shammua was the son of Galal, who was the son of Jeduthun.) "},{"num":18,"verse":"All together 284 Levites lived in the holy city of Jerusalem."},{"num":19,"verse":"These are the gatekeepers who moved into Jerusalem. There were Akkub, Talmon and others with them. There was a total of 172 men. They guarded the city gates."},{"num":20,"verse":"The other Israelites, priests and Levites lived on their own land. They were in all the cities of Judah."},{"num":21,"verse":"The Temple servants lived on the hill of Ophel. Ziha and Gishpa were in charge of them."},{"num":22,"verse":"Uzzi son of Bani was appointed over the Levites in Jerusalem. (Bani was the son of Hashabiah, who was the son of Mattaniah. Mattaniah was the son of Mica.) Uzzi was one of Asaph’s descendants. They were the singers. They were responsible for the service of the Temple. "},{"num":23,"verse":"The singers took orders from the king. Those orders told the singers what to do each day."},{"num":24,"verse":"Pethahiah son of Meshezabel was the king’s spokesman. Meshezabel was a descendant of Zerah, the son of Judah."},{"num":25,"verse":"Some of the people of Judah lived in villages with their surrounding fields. Some lived in Kiriath Arba and its surroundings. Some lived in Dibon and its surroundings. Some lived in Jekabzeel and its surroundings. "},{"num":26,"verse":"Others lived in Jeshua, Moladah, Beth Pelet, "},{"num":27,"verse":"Hazar Shual, Beersheba and its surroundings. "},{"num":28,"verse":"Others were in Ziklag and Meconah and its surroundings. "},{"num":29,"verse":"Some people lived in En Rimmon, Zorah, Jarmuth, "},{"num":30,"verse":"Zanoah, Adullam and their villages. Some were in Lachish and the fields around it. Some lived in Azekah and its surroundings. So they settled from Beersheba all the way to the Valley of Hinnom."},{"num":31,"verse":"The descendants of the Benjaminites from Geba lived in Micmash, Aija, Bethel and its surroundings. "},{"num":32,"verse":"They lived in Anathoth, Nob, Ananiah, "},{"num":33,"verse":"Hazor, Ramah and Gittaim. "},{"num":34,"verse":"They lived in Hadid, Zeboim, Neballat, "},{"num":35,"verse":"Lod, Ono and in the Valley of the Craftsmen."},{"num":36,"verse":"Some groups of the Levites from Judah settled in the land of Benjamin."}]