[{"num":11,"verse":"The leaders of the people lived in the holy city of Jerusalem. The rest of the population drew lots, and one out of every ten of them came to live in Jerusalem also. The other nine-tenths stayed in their towns."},{"num":2,"verse":"So when others decided, on their own, to settle in Jerusalem willingly, the people were grateful, blessing and thanking them."},{"num":3,"verse":"These are the leaders of the provinces who came to live in Jerusalem. (Most of the people of Israel—common folk, priests, Levites, servants in the temple, and those who were descendants of Solomon’s servants—continued to live in their own homes in towns around Judah, "},{"num":4,"verse":"though some of the people from Judah and Benjamin decided to settle in Jerusalem.)"},{"num":5,"verse":"Maaseiah, Baruch’s son—who is the son of Col-hozeh, the son of Hazaiah, the son of Adaiah, the son of Joiarib, the son of Zechariah, the son of a Shilonite. "},{"num":6,"verse":"There were 468 descendants of Perez who lived in Jerusalem, all of them courageous soldiers."},{"num":7,"verse":"From Benjamin’s tribe: Sallu, Meshullam’s son—who is the son of Joed, the son of Pedaiah, the son of Kolaiah, the son of Maaseiah, the son of Ithiel, the son of Jeshaiah; "},{"num":8,"verse":"Gabbai and Sallai followed him. There were 928 men from the tribe of Benjamin. "},{"num":9,"verse":"They were led by Joel, Zichri’s son. Judah, Hassenuah’s son, was second in command over the city."},{"num":10,"verse":"From the priests: Jedaiah, Joiarib’s son; Jachin; "},{"num":11,"verse":"Seraiah, Hilkiah’s son—the son of Meshullam, the son of Zadok, the son of Meraioth, the son of Ahitub (who was supervisor of God’s temple). "},{"num":12,"verse":"There were 822 of their relatives who ran the temple. Also Adaiah, Jeroham’s son—the son of Pelaliah, the son of Amzi, the son of Zechariah, the son of Pashhur, the son of Malchijah, "},{"num":13,"verse":"and his relatives who were also the heads of families. They numbered 242 men. Amashsai, Azarel’s son—the son of Ahzai, the son of Meshillemoth, the son of Immer, "},{"num":14,"verse":"and their relatives. There were 128 courageous warriors, led by Zabdiel, Haggedolim’s son."},{"num":15,"verse":"From the Levites: Shemaiah, Hasshub’s son—the son of Azrikam, the son of Hashabiah, the son of Bunni; "},{"num":16,"verse":"Shabbethai and Jozabad, the Levite leaders who were responsible for the work being done on the outside of God’s temple; "},{"num":17,"verse":"Mattaniah, Mica’s son—the son of Zabdi, the son of Asaph. Mattaniah was the worship leader who would lead us in thanksgiving prayers. His assistant was Bakbukiah; also Abda, Shammua’s son—the son of Galal, the son of Jeduthun. "},{"num":18,"verse":"There were 284 Levites in the holy city of Jerusalem."},{"num":19,"verse":"From the gatekeepers: Akkub, Talmon, and the rest of their relatives who watched over the gates were 172 men. "},{"num":20,"verse":"All of the rest of the Israelites, priests, and Levites lived on their family’s land in Judah. "},{"num":21,"verse":"The temple servants lived on the hill of Ophel. Ziha and Gishpa were their leaders."},{"num":22,"verse":"The leader of the Levites living in Jerusalem was Uzzi, Bani’s son—the son of Hashabiah, the son of Mattaniah, the son of Mica. Uzzi was a descendant of Asaph, who led the singers in worship in the temple. "},{"num":23,"verse":"The singers answered directly to Judah’s king before the conquest, and he gave them their responsibilities day to day. "},{"num":24,"verse":"Now, Pethahaiah, Meshezabel’s son—a descendant of Zerah, Judah’s son—advised the king in Persia about the concerns the people had in Jerusalem."},{"num":25,"verse":"The returning Israelites lived in Jerusalem’s surrounding cities, near their farms. Some of the descendants of Judah lived in Kiriath-arba and its villages, Dibon and its villages, Jekabzeel and its villages. "},{"num":26,"verse":"They also lived in Jeshua, Moladah, Beth-pelet, "},{"num":27,"verse":"Hazar-shual, Beersheba and its villages, "},{"num":28,"verse":"Ziklag, Meconah and its villages, "},{"num":29,"verse":"En-rimmon, Zorah, Jarmuth, "},{"num":30,"verse":"Zanoah, Adullam and its towns, Lachish and its farms, Azekah and its villages. Their settlement stretched from Beersheba all the way to the valley of Hinnom, covering the area God had given to Judah and his descendants."},{"num":31,"verse":"The Benjaminites lived in Geba, Michmash, Aija, Bethel and its villages, "},{"num":32,"verse":"Anathoth, Nob, Ananiah, "},{"num":33,"verse":"Hazor, Ramah, Gittaim, "},{"num":34,"verse":"Hadid, Zeboim, Neballat, "},{"num":35,"verse":"Lod, Ono, and in the valley of the craftsmen. "},{"num":36,"verse":"Some of the Levites from Judah were sent to live in Benjamin’s settlements."}]