[{"header":"Visit of the Queen of Sheba"},{"num":9,"verse":"Now when the queen of Sheba heard of the fame of Solomon she came to Jerusalem to test him with hard questions, having a very great retinue and camels bearing spices and very much gold and precious stones. When she came to Solomon, she told him all that was on her mind. "},{"num":2,"verse":"And Solomon answered all her questions; there was nothing hidden from Solomon which he could not explain to her. "},{"num":3,"verse":"And when the queen of Sheba had seen the wisdom of Solomon, the house that he had built, "},{"num":4,"verse":"the food of his table, the seating of his officials, and the attendance of his servants, and their clothing, his cupbearers, and their clothing, and his burnt offerings which he offered at the house of the Lord, there was no more spirit in her."},{"num":5,"verse":"And she said to the king, “The report was true which I heard in my own land of your affairs and of your wisdom, "},{"num":6,"verse":"but I did not believe the reports until I came and my own eyes had seen it; and behold, half the greatness of your wisdom was not told me; you surpass the report which I heard. "},{"num":7,"verse":"Happy are your wives! Happy are these your servants, who continually stand before you and hear your wisdom! "},{"num":8,"verse":"Blessed be the Lord your God, who has delighted in you and set you on his throne as king for the Lord your God! Because your God loved Israel and would establish them for ever, he has made you king over them, that you may execute justice and righteousness.” "},{"num":9,"verse":"Then she gave the king a hundred and twenty talents of gold, and a very great quantity of spices, and precious stones: there were no spices such as those which the queen of Sheba gave to King Solomon."},{"num":10,"verse":"Moreover the servants of Huram and the servants of Solomon, who brought gold from Ophir, brought algum wood and precious stones. "},{"num":11,"verse":"And the king made of the algum wood steps for the house of the Lord and for the king’s house, lyres also and harps for the singers; there never was seen the like of them before in the land of Judah."},{"num":12,"verse":"And King Solomon gave to the queen of Sheba all that she desired, whatever she asked besides what she had brought to the king. So she turned and went back to her own land, with her servants."},{"header":"Solomon’s Great Wealth"},{"num":13,"verse":"Now the weight of gold that came to Solomon in one year was six hundred and sixty-six talents of gold, "},{"num":14,"verse":"besides that which the traders and merchants brought; and all the kings of Arabia and the governors of the land brought gold and silver to Solomon. "},{"num":15,"verse":"King Solomon made two hundred large shields of beaten gold; six hundred shekels of beaten gold went into each shield. "},{"num":16,"verse":"And he made three hundred shields of beaten gold; three hundred shekels of gold went into each shield; and the king put them in the House of the Forest of Lebanon. "},{"num":17,"verse":"The king also made a great ivory throne, and overlaid it with pure gold. "},{"num":18,"verse":"The throne had six steps and a footstool of gold, which were attached to the throne, and on each side of the seat were arm rests and two lions standing beside the arm rests, "},{"num":19,"verse":"while twelve lions stood there, one on each end of a step on the six steps. The like of it was never made in any kingdom. "},{"num":20,"verse":"All King Solomon’s drinking vessels were of gold, and all the vessels of the House of the Forest of Lebanon were of pure gold; silver was not considered as anything in the days of Solomon. "},{"num":21,"verse":"For the king’s ships went to Tarshish with the servants of Huram; once every three years the ships of Tarshish used to come bringing gold, silver, ivory, apes, and peacocks."},{"num":22,"verse":"Thus King Solomon excelled all the kings of the earth in riches and in wisdom. "},{"num":23,"verse":"And all the kings of the earth sought the presence of Solomon to hear his wisdom, which God had put into his mind. "},{"num":24,"verse":"Every one of them brought his present, articles of silver and of gold, garments, myrrh, spices, horses, and mules, so much year by year. "},{"num":25,"verse":"And Solomon had four thousand stalls for horses and chariots, and twelve thousand horsemen, whom he stationed in the chariot cities and with the king in Jerusalem. "},{"num":26,"verse":"And he ruled over all the kings from the Euphra′tes to the land of the Philistines, and to the border of Egypt. "},{"num":27,"verse":"And the king made silver as common in Jerusalem as stone, and cedar as plentiful as the sycamore of the Shephe′lah. "},{"num":28,"verse":"And horses were imported for Solomon from Egypt and from all lands."},{"header":"Death of Solomon"},{"num":29,"verse":"Now the rest of the acts of Solomon, from first to last, are they not written in the history of Nathan the prophet, and in the prophecy of Ahi′jah the Shi′lonite, and in the visions of Iddo the seer concerning Jerobo′am the son of Nebat? "},{"num":30,"verse":"Solomon reigned in Jerusalem over all Israel forty years. "},{"num":31,"verse":"And Solomon slept with his fathers, and was buried in the city of David his father; and Rehobo′am his son reigned in his stead."}]